{"id": 10141, "submission_id": "114222m", "title": "AITA for making plans on Valentine's so I don't babysit my granddaughter?", "selftext": "My (36f) daughter Lia (17f) is a teen mom. My daughter got pregnant at 14, and it was very shocking news, but we found out very early on, and she got to abort it. A few months later and she got pregnant again and I couldn't handle the situation very well at the time but having my sister (her aunt) talk to her about what she was planning to do, she decided to keep the baby which I'll admit I wasn't very happy to hear and I told her she'll have to be responsible about the consequences.\n\nOf course as a mother I couldn't have her work and distract her self from school, I didn't want her to miss on her childhood so I had to work evening-night shifts to care for my granddaughter while Lia was in school. \n\nI realized that Lia has been taking advantage of my situation and making me cancel plans so I can babysit for her. I overheard her making plans for Valentine's 2 weeks ahead on the phone with someone saying, \"My mom will do it she has no life anyways,\" and laughing afterward. Being a single mom and having to work multiple jobs was hard enough but since she gave birth to her daughter, I haven't gone out to any party, I've canceled many weekend gatherings so that my daughter can be able to hangout with her friends and if I did go, I'd always have my granddaughter with me and for her to laugh about my situation like that angered me. \n\nThat same day, I was asked by a guy I've been seeing to accompany him on Valentine's, and I was hesitant, but I didn't want to miss the chance. He's a really nice guy, I haven't been on a date for almost 6 years, and it wouldn't hurt to give my daughter a taste of motherhood when she least expected. \n\nI told my daughter that I got asked out for Valentine's and she was happy at first but then asked if I was going to take her daughter with me and I said obviously not and she'll have to cancel plans for a day. I didn't expect her reaction to be so extreme she cried, screamed, and told me I was being selfish and that I was letting her miss on her date just because I thought a guy was interested in me. \n\nThe argument didn't end very well, I stood my ground and went to that date, and she had to cancel plans, but she's still really mad about it and has been ignoring me. I love my daughter, and I wouldn't want her to miss anything, but I wanted her to learn a lesson and be responsible. My sister agrees with me but my friend told me i should have done it on a normal day not on Valentine's. Does my approach make me AH?", "created_utc": 1676583953, "permalink": "/r/AmItheAsshole/comments/114222m/aita_for_making_plans_on_valentines_so_i_dont/", "score": 1124, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1)for making plans on valentine's so I wouldn't have to babysit my granddaughter \n2)making my daughter cancel her plans instead\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but you fucked up letting it get this far and you’re going to have to do some serious work to reparent your daughter so she can take responsibility and care for her child.", "No , she is clearly taking advantage of you . If she didn’t want the responsibility of having a baby then she shouldn’t have had her . \n\nI had a baby at 17 and my social life was gone . It wasn’t my moms responsibility to watch my child but mine . I didn’t get to go out with friends or any boyfriends but I dealt with it . \n\nShe needs tough love . You need to stop cancelling your plans and let her deal with her own child . \n\nGo live your life !\n\nETA : NTA 100%", "NTA...making adult decisions and becoming a parent is not always easy.  Also, you can't be there to save her from everything, mom.  This is her child. She is going to have to make some sacrifices.  If YOU keep making all the sacrifices, she will never really learn what being a parent means.  Start living your life.  By the way, how was the date???", "NTA, but you might be covering too much for your daughter under the guise of letting her have a childhood. You shouldn't give up all your social life so that she doesn't have to give up anything. Covering for her finantially so she doesn't have to work and can build a good life for ? Amazing parenting. Being a live in babysitter? You will only harm her and the child, she will never learn responsability.\n\nThat last fact can be attested by the fact that she got pregnant twice in months while being 14. Or by the fact she had a crazy tantrum when told she couldn't do as she pleased. She was not taught responsability nor given consequences", "NTA\n\nYour daughter has a baby. She is responsible for the child. Each and every time she wants to make some kind of social engagement, she needs to ask you if you are willing to babysit. Make sure she understands this.\n\nTelling her that you'll care for her child so that she can keep attending school is one thing. It's not the same as agreeing to care for the child 24/7 so she can pretend she's young and single with no responsibilities.\n\nWhere is the father of the baby? IS he also taking responsibility for his child?", "NTA - time for a new set of rules for you daughter. She's a mom now, her life revolves around her child.  If she has a little spare time and a willing babysitter she can go out but you're not available unless she asks well in advance.\n\nYou raised a crappy kid (or trained her to be entitled) but the time to fix that is now.", "it sounds like your daughter needed an overdue reality check. NTA and i hope you had a wonderful date!", "NTA, your daughter desperately needs to learn some responsibility", "dude. your daughter is a mom. she doesn't seem to realize it. I feel like you've enabled this reaction and you're going to have to mitigate the fallout. but the time is now. she doesn't get to be a child anymore.\n\nETA: NTA", "NTA. You teach people how to treat you. It's time she stops taking advantage. You got an unfiltered look of what she really thinks. Time to take time for you.", "NTA\n\nGo out and enjoy it... you've had to take a world full of problems on your back because of your daughter, she can give up one night or find someone else to babysit.", "NTA she is still a mother and has to learn that not everything is about her and what she wants. She can't constantly push her responsibilities on her, there is a price when you have children. You need to sit her down and explain to her that she isn't always going to get her way and that you do have your own life. Your granddaughter is her responsibility not yours. School is one thing, she can miss out occasionally on dates, especially since she thinks she has no responsibility and that you will just take over. That needs to change.", "NTA. Maybe your friend should babysit for her?  You are the grandma, not the mom! When your daughter decided to become a mom and keep the baby she chose to take on the responsibility of being a parent. Kudos to you for going above and beyond for your daughter and grand daughter, but it may be time to take  a step back and make her take some accountability. Good luck and all the positive vibes sent your way!", "NTA. She's taking advantage of you and has been for a long time. It's more than okay for you to start saying no to her in favor of you having your own life.", "Nta at all. You're being taken advantage of. One valentines date isn't even that important, and whoever she's seeing should be able to understand regardless.", "NTA\n\nBut FFS\n\n> I told her she'll have to be responsible about the consequences.\n\n> Of course as a mother I couldn't have her work and distract her self from school, I didn't want her to miss on her childhood so I had to work evening-night shifts to care for my granddaughter while Lia was in school. \n\n\"There will be consequences for your decision!\"\n\n\\* *immediately mitigates consequences* \\*", "I think you did the right thing OP. As your daughter gets older, she should be taking greater responsibility for childcare as hard as that is for her.\n\nI'm sure she is cross about it but that's just tough. I think you need to stand firm and I'd not be babysitting, unless it's for her to attend school or work, for the forseeable and until I'd had an apology for the attitude.\n\nI hope your date was great!", "NTA. Lia’s reaction to your V-Day plans should really make you consider putting some boundaries in place with respect to your time and efforts. Please stay strong. She won’t learn to be a responsible parent if you cave whenever she has a hissy fit.", "NTA- she got pregnant young, aborted, basically got pregnant as soon as possible after that, has your full support because you work your ass off to help her, you provide free childcare and she has the audacity to expect you to always be available. The blatant disrespect she displays behind your back is disgusting. You deserve to go out and have a life. She takes advantage of you and needed to learn the hard lesson of what it’s really like to have to parent a child, which is that sometimes you have to sacrifice things you want to take care of your kid.", "Your friend is 1000% WRONG. \n\nYou have bent over backwards for your daughter and granddaughter and your daughter does not seem at all grateful.  Granted, she is a child herself, and at this age it is normal to be self-absorbed, but she made adult decisions that put her in this situation and she must deal with the consequences.\n\nYou have to stand your ground, and further, perhaps you need to start setting some very distinct boundaries and expectations.  I understand that you do not want her to miss out on her own childhood, but if you make this too easy for her, and minimize the consequences of her being a parent, then she is likely to repeat this decision, and you will have 2, 3 or more grandchildren to raise.  \n\nShe needs to be responsible when at all possible to take care of her own child.", "NTA. You’re allowed to do this without any guilt whatsoever. I hope you have fun and I hope your daughter learns how to use birth control.", "Of course you’re NTA OP. \n\nI want to address your friend in this situation. Why are you, the parent of a nearly adult woman who is also a parent herself, less entitled to spend their Valentine’s Day how they want than a teen who feels entitled to you as childcare whenever suits her? Icky. Your friend can babysit if she believes your daughter is acting appropriately by throwing this fit.", "NTA. Your daughter sounds entitled and spoiled. She is a parent, despite being a teen. This a good first step in teaching her to be a responsible parent.", "NTA: You really need to stop cuddling your daughter. She obviously does not respect you nor appreciate all that you do for her & her child. Time to lay some REAL ground rules.", "NTA. It sounds like she's already pretty unempathetic toward your support. Have you talked to her about your experience being a teen mom? I don't know what your situation was like, but either to show her that you did it without support or that the support you received was different and you still made it out. It seems she's taken you for granted in a big way and you're going to have to put up boundaries that stop enabling it, as much as you don't want to, for your granddaughter's sake. She needs to take on the responsibility of parenting before her daughter is old enough to realize she doesn't want to take care of her.", "NTA. It's not your job to be looking after your granddaughter.\n\nI'd be telling Lia that the only time you will be looking after her is when she is at school and any other time, it's up to her.\n\nIf she has to cancel dates and nights out or any social activities, then that's on her. She chose to be a mother at 14, so it's time she stepped up and started acting like one.", "OMG NTA!!!!\n\nFrankly, you shouldn’t be doing as much as you already are because now your daughter expects you to be full time mom-babysitter-financial support, etc. \n\nShe needs to learn some very hard life lessons, including the lesson about her child now being HER responsibility!", "NTA I think this was a great lesson in responsibility and may need to have more reality checks for daughter moving forward", "NTA -  Her body, her choice but choices have consequences. This is the literal definition of FAFO.", "You're obviously NTA. She wanted to keep the kid. Let her live with the consequences", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (36f) daughter Lia (17f) is a teen mom. My daughter got pregnant at 14, and it was very shocking news, but we found out very early on, and she got to abort it. A few months later and she got pregnant again and I couldn't handle the situation very well at the time but having my sister (her aunt) talk to her about what she was planning to do, she decided to keep the baby which I'll admit I wasn't very happy to hear and I told her she'll have to be responsible about the consequences.\n\nOf course as a mother I couldn't have her work and distract her self from school, I didn't want her to miss on her childhood so I had to work evening-night shifts to care for my granddaughter while Lia was in school. \n\nI realized that Lia has been taking advantage of my situation and making me cancel plans so I can babysit for her. I overheard her making plans for Valentine's 2 weeks ahead on the phone with someone saying, \"My mom will do it she has no life anyways,\" and laughing afterward. Being a single mom and having to work multiple jobs was hard enough but since she gave birth to her daughter, I haven't gone out to any party, I've canceled many weekend gatherings so that my daughter can be able to hangout with her friends and if I did go, I'd always have my granddaughter with me and for her to laugh about my situation like that angered me. \n\nThat same day, I was asked by a guy I've been seeing to accompany him on Valentine's, and I was hesitant, but I didn't want to miss the chance. He's a really nice guy, I haven't been on a date for almost 6 years, and it wouldn't hurt to give my daughter a taste of motherhood when she least expected. \n\nI told my daughter that I got asked out for Valentine's and she was happy at first but then asked if I was going to take her daughter with me and I said obviously not and she'll have to cancel plans for a day. I didn't expect her reaction to be so extreme she cried, screamed, and told me I was being selfish and that I was letting her miss on her date just because I thought a guy was interested in me. \n\nThe argument didn't end very well, I stood my ground and went to that date, and she had to cancel plans, but she's still really mad about it and has been ignoring me. I love my daughter, and I wouldn't want her to miss anything, but I wanted her to learn a lesson and be responsible. My sister agrees with me but my friend told me i should have done it on a normal day not on Valentine's. Does my approach make me AH?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA Becoming a teen mother is not the end of the world. You have been gracious and have provided a home for your daughter and granddaughter.  Your daughter is finishing school and you have allowed her to have a social life with her friends outside of motherhood. I applaud you for it \n\n However, your daughter made a lifetime commitment to her child, her daughter's needs come first and the party is over. Stop cancelling your plans to accommodate your daughter's social life. You've made sacrifices to raise your child and now it's time for your daughter to do the same.", "NTA. She chose to become a mother, it’s her responsibility. She shouldn’t be expecting anyone to babysit, she should be asking first. If she’s disappointed and angry about having to parent, that’s on her not you. I’ve been a stay at home mom for 4 years and am so lucky to have my mom take my child roughly once a week, but a lot of the time my plans end up being cancelled because she has her own life. It’s disappointing sometimes, but I CHOSE to be a parent. I don’t expect my mom to drop everything for me. 90% of the time she’s the one asking to babysit, the other 10% is me asking her in advance", "NTA.", "NTA. Good for you, mom! Keep making those child free plans. Your daughter made the decision to procreate, now she can accept the responsibility that comes with that decision. She's not entitled to go out with her friends all the time, she has a child. Time for her to suck it up and be the loser with no life.", "NTA and quite frankly, she does not need to be dating right now or she’s just gonna get pregnant again before she graduates. Seems this child hasn’t learned a thing.", "NTA.\n\nFirst pregnancy: Probably a mishap from having sex. She knew she couldn’t care for the baby, so she got an abortion. It can be a traumatic experience, but lessons can be learned.\n\nSecond pregnancy: She’s probably been having unprotected sex and hoping for the best even after the abortion, so nothing was learned from the first. On top of that, she has decided to keep the child, which means that she acknowledged that she will be responsible for taking care of this helpless baby for at least 18 years. However, she is not asking, but literally attempting to force the responsibility of babysitting her child on you because she wants to “go on a date.”\n\nTeens know about the risks of sex and pregnancy. She took them and now has to face the consequences.", "NTA at all but TIL that I’m now older than someone’s Grandma. Fuck.", " Not the AITA", "NTA", "The only reason she feels that she can say you have no life is because she practically takes away every chance you have to go out. \n\nGo out and have fun and you have a good time out on your date.", "Honestly, you may need to be a bigger AH or you're going to be babysitting more grandkids.\n\nIf she doesn't learn that there are true consequences - OF HERS - to being a teen mom, she'll do it again.\n\nYou can support her getting an education, but there is no reason you need to cancel your social life so that she can have hers. \n\nThat's my two cents.\n\nBut NTA. You may want to rethink how you are enabling her behavior by raising her child.", "NTA. She's 17. Time for her to grow up and - outside of school -  take responsibility for parenting her own child. As for you ensuring that she had a childhood, that backfired. Time for you to start setting boundaries to get your life back. You might also check local resources for parenting classes for Lia.", "After she got pregnant the first time did you not think to put her on birth control?", "NTA. Kid is her responsibility, if she wanted to go out and have a life, etc, maybe she shouldn't have had the child.", "Is she on birth control after back to back pregnancies?", "ESH. You created this situation. You told your daughter she would be responsible for her baby and immediately back tracked so your daughter wouldn't \"miss out on her childhood\". All the while thinking you looked like a hero mom to your daughter and she's been mocking you the whole time.  Your daughter's and ungrateful and doesn't appreciate all you've done for her.", "You're 15 year old daughter pregnant twice? \n\nYTA for not parenting your CHILD\n\nNTA for finally forcing your daughter to mother her own baby", "NTA", "NAH. She has a lot of responsibilities that you are bearing a lot of the load from. It is ok now and again for her to feel the weight of those responsibilities. \n\nMy parents were 20 when they had me and my parents had lives when I was your daughter’s age, which meant at times I couldn’t do all the things I wanted to do (and I didn’t have a kid). \n\nIt must have stung, but that is how we learn. And Valentine’s Day is trumped up fake holiday crap anyway. You are letting her live most of her life.", "INFO\n\nDid she ask you to watch her daughter and you agreed? Or did you just overhear her make plans?", "100% NTA. Your daughter is a parent now and her choices have consequences. Being a parent means you don't get to run free and easy any time you want when their kid is small and needs supervision. She chose this path. \n\nI hope you had a nice date. You deserve time to have fun and she needs to learn how to be the parent to her child she chose to have.", "NTA. It's nice of you that you want your daughter to still be a teenager even though she has a kid but you should have her be a mom more. You're doing her a favour but she doesn't understand it because she's never seen any different. Good luck", "NTA ( teen mom here no in her 40’s) you have indulged your daughter far too much to which she feels entitled & her plans supersedes your own I lived with my dad when I was a teen mom & I asked him when I needed to watch my son , sometimes he said yes sometimes he said no & when he said no I never threw a tantrum you need to start making your daughter be more responsible for her child & not caring for her when you have plans part of being a mom is the loss of certain freedoms to do whatever you want whenever you want she will get mad but in the end it will be beneficial to all 3 of you", "NTA. She made the decisions to end up pregnant. Yes, she does need a life but SO DO YOU! She needs to be prepared for when she is an adult. What does she want to do (besides being a mom) once she is out of high school? I hope you two have been discussing it.", "NTA. It seems like you care more about your daughter than she does you.\n\n> \"My mom will do it she has no life anyways,\" and laughing afterward.\n\nThe above statement is what makes your daughter the asshole. If you do have no life, surely it's because of her.", "Nta for this situation,  however you are kind of the AH to yourself for putting up with this for 3 years and kind of the AH for letting your 14 year old daughter get pregnant not just once but twice. Why didn't you get her on birth control after the first one, or monitor the heck out of her? I know a few teen moms and had a few in my class, usually their parents are anti contraception, never really discussed sex with them/no sex education,  and for the most part were kind of absentee parents.  Not always the case obviously and maybe you did everything right...", "Nta. Please consider doing this often. She needs to understand the consequences of her actions before she saddles you with a few more grandchildren.\n\nI want to say more, but I'll get banned.", "NTA\n\nShe chose to have and raise her baby. That includes on holidays and weekends.", "**ESH**\n\nOf course you're N-T-A for making plans on Valentine's day. That child is not your responsibility, it's your daughter's. You should be making plans for yourself regularly. While you are generous and smart to rearrange your work schedule so that your daughter can finish her education, I honestly don't understand ANY of the rest of this. You've COMPLETELY shielded her from the consequences of her actions, and by doing so, you've spoiled her rotten and basically taken up the entire burden of raising your grandchild. Why? You say you don't want her to \"miss out on her childhood\". Why not? Why are you not letting her face the consequences of her choices . . . which means giving up some of her childhood now that SHE IS A MOTHER? Do you think that's helpful?\n\n>I told her she'll have to be responsible about the consequences.\n\nExcept that you literally haven't followed through on this at all. It sounds like she hasn't had to be responsible or face any consequences AT ALL. \n\nYou mention \"giving her a taste of motherhood\". She should be getting a lot more than a \"taste\". SHE IS A MOTHER. Other than when she is in school or doing schoolwork, she should be doing the vast majority of the childcare. Having you babysit so she can go out with her friends, as with most mothers with young children, should be an occasional treat . . . not an expectation. \n\nESH because she has become spoiled and entitled and isn't parenting her own child, but she learned that by you allowing her to have this baby under her roof, and promptly giving up your own life to take care of everything for her, so she never has to lift a finger. Stop letting her take advantage of you.", "YTA because you’re enabling your daughter to be irresponsible and you’re shielding her from the consequences of her actions. \n\nCongratulations, you forced your daughter to babysit her own child ONE time. Do you want a medal? You are doing your daughter AND your granddaughter a huge disservice. \n\nIn fact, you’re not just enabling bad behavior, you are actively teaching your daughter to be an absentee mom.", "NTA. You are not doing your daughter any favors by acting as the de facto mom for her child. Getting pregnant again a few months after her first pregnancy?!?  She obviously did not learning anything about contraception.  Where is the father?  The other grandparents?  \n\nShe is not going to learn how to be a responsible adult much less a responsible parent if you are always there.", "NTA 100%. You are the one experiencing the consequences of her choices- that’s not how life works. I’d start shifting those onto her shoulders before you end up raising your granddaughter while fun passes you by.", "ESH.  \n\n>I wanted her to learn a lesson and be responsible.\n\nYou overheard a conversation where your daughter said something hurtful that convinces you that you're being taken advantage of.  Righteo. \nSo you now  want to teach responsibility and have her learn you can't be used?  \n\nWhy go about it in such an underhanded way?!  Much more mature and adult of you to have told her you overheard the conversation, realise your own unhappiness at the life changes that you made decisions about to enhance her welfare, three years later you want some changes, and present the new rules about your availability.  That's role modelling appropriate behaviours in several ways.  Instead you approach from a position of hurt in a back handed, cunning and manipulative manner.... teaching your daughter to be back handed, cunning and manipulative.  Righteo.", ">I told her she'll have to be responsible about the consequences.\n\n>Of course as a mother I couldn't have her work and distract her self from school, I didn't want her to miss on her childhood\n\nShe gave up her childhood when she had a kid. You just say things. She clearly doesn't have an actual understanding of responsibility.  Give her a taste of motherhood? She's already a mother.\n\nYou should 100% have to take a test to have kids. \n\nNTA for not babysitting but this whole thing is bleh", "Thank you for asking! It went really well, most definitely not the last. :)", "Ensuring your child (because she was a child when she became a mother) finishes school is going to massively improve the lives and prospects of both daughter and grandaughter. The OP has most definitely done the right thing here despite how hard it was.", "Lol! When I was pregnant with my son, the teen daughter of a friend was due the same month. \n\nFriend was younger than me. (I was in my 40's at the time, so granted I was an older mom.)", "I think you mean \"NTA\" because you literally wrote \"not the am I an a\\*\\*hole\"", "Unless I locked her up and prevented her from having a life, there was no way I could have prevented that from happening. She has to come back before 9 pm which she does, I used to drop her off wherever she goes and I know she didn't drink as far as I know, I've thought her about contraceptive methods and that she can ask me if she wanted to be on birth control (although I was against her being sexually active at her age). It was her choice to have unprotected sex because \"it just happened\". It is very easy to blame the parent when you know nothing.", "Either way doesn't matter.  This dumb teen had her own mothers example and went ahead and had a kid at 14, that now, she doesn't want to take responsibility of.  She even laughs about how she is taking advantage.  Screw her - she wanted a kid at 14, let her deal with it.  Actions have consequences.", "My daughter seems to be careless with situations im involved in, and I think it took me a little too long to realize, but besides that, she's a very responsible student. She actually works really hard and cancels any plans if it distracts her from her studies. She's among the top 5 students of her grade and plans to pursue a degree in biochem or psychology.", "Good. NTA. Take care of you. You matter equally as much as your daughter and granddaughter. \n\nYou deserve good things too, and as you said, your daughter needs to start learning about the real world. \n\nGood for you!", "That is awesome!!!   You deserve an amazing time!  Now...don't cave in.  Nurture you for a while.  Go on more dates and have fun.", "She could’ve kept her in school and not enabled her shitty behavior at the same time they aren’t mutually exclusive. Daughters free time should be spent with the child she decided to have simple as.", "I do. Thanks for catching that. 😊", "After she got pregnant the first time, did you make a doctor’s appointment for her to get birth control?  Unless she physically refused to take it, that would’ve been non-negotiable for me.", "Yeah, when you fail to parent it's very easy to blame the parent.\n\nI'm guessing your daughter's dad isn't in the picture?", "All that may be true, but if the mom had agreed to watch the child, she shouldn't go back on that. That's not hotter you parent, and that's not how she should model for her own child.", "Definitely, but I was responding to the fact that the pp was criticising the op for supporting the daughter through school...", "She wasn't planning on being sexually active, and she just had an abortion so I completely believed that. Her second pregnancy was so unexpected to me, and after that was when I forced her to be on birth control, and her doctor suggested it as well.", "Your daughter has had an abortion and a child before she was 17. She doesn't need to go on a date for Valentines.  She needs to stay home with her baby... not go make another.", "NTA at all. \nYou deserve time for YOU!", "maybe as her mother you could have taught her to keep her legs closed and her knickers on YAH", "Stop babying your daughter and ruining your life. She made this choice, SHE needs to deal with it.\n\nHelping is one thing, taking it all onto yourself is another. \n\nNTA, but stop letting her abuse and use you!", "I'm sorry, but the moment she decided to keep the baby, you needed to stop babying her. She is a mom and she needs to act like it. I get that you want her to finish her education. That is very important. She does not need to go out with friends all the time though. I could understand going out one weekend night a month, or her taking the baby with her when she hangs out with friends. She also needs to get a job so she can see what reality will be like soon. You need to get back to living your life.\n\nNTA", "NTA, your daughter, not only got pregnant TWICE at 14, but had a baby. Sounds like she was completely irresponsible with her relationships and even more irresponsible for her CHILD. While being a teen mom is hard and having your mom help out once in a while is a blessing, if you decided to have a child that young you need to be prepared for the sacrifices you need to make.", "NTA You were clear. There would be consequences for her choices. Kudos to you for making sacrifices so she can further her education, but that doesn't mean she gets to go off to parties  and expect you to actually raise her child. I think you and your daughter need to sit down again and have a long talk about expectations going forward meaning you will do what you can so she can focus on school but NOT so she can go off and party. She is the baby's mother and now she needs to prioritize her child as you have prioritized yours.", "NTA \n\n>, \"My mom will do it she has no life anyways,\" and laughing afterward\n\n>I didn't expect her reaction to be so extreme she cried, screamed, and told me I was being selfish and that I was letting her miss on her date just because I thought a guy was interested in me. \n\nYour daughter seems to have a pretty mean streak. It is one thing to help your daughter care for her kid, and another to give up your live for it. It was her decision, and she can at least spend the weekends with the kid. She can start to party when the little one is grown up. \n\nYou are young, and your daughter is old enough, start living your life as well...", "No way\n\nNTA\n\nGood for you", "NTA, your daughter having a child does not erase your life. You are doing great at ensuring she continues her education. However, allowing every social opportunity to occur for her while ignoring your own self care is crazy. She is still maturing and a child too, but don't kid glove her because of this. OP it may be time to speak with someone you trust with experience in teenagers with babies. People throw out therapy, but that is up to you. It could be just as simple as contacting a group that specializes in teenage mothers to find that guidance. Bless you for what you are doing, because in our house she would only be going to structured activities through school events or community, not 'dates' that resulted in not one but two pregnancies. I understand we cannot sit over our kids every minute, and that these situations happen, but she cannot have full freedom. Her choices have resulted in not being a teen with no responsibilities. If she wants that level of freedom there are still options available like open adoption.", "NTA. You are being taken advantage of and your daughter has no respect for you. This seems like a good lesson for her. \n\nYou should ‘have a life’ more often so she can raise her own child.", "NTA", "NTA.  I would have done the same I think.", "Granny here who loves her grand baby SO MUCH! Anyway NTA big time!, your daughter is, and its high time you did this. More than high time. She’s taking advantage of you. And she really needs you so boo hoo for her and her tantrum. NTA ! Edit: autocorrect nonsense", "Oh, *you’re* the one letting *her* miss a date just because you think a guy’s interested in you? I think she may be projecting just a smidge.\nNTA", "NTA \n\nYou've been kind and helped your daughter a lot. But she's almost 18 and needs to start stepping up and understanding that her child is HER responsibility. She is in fact taking advantage of you. Stand your ground. Go have a life and have some fun because after everything you've done for her and your family you deserve it!", "You're being selfish!  I can't believe that after all you have done, she could say that.  But she is 17 years old.  Surely, she understood that when she chose to become a single mom as a teenager, that was going to come with a lot of sacrifice and growing up fast.  \n\nNTA.  It's about time she discovers that you have a life, too.", "You say you don't want to miss out on her childhood but she is no longer a child; she has a child of her own. You shouldn't have let her keep screaming at you; she was hostile, disrespectful and aggressive. From now on you don't even have to have plans every time. You get to tell her that she needs to stay home more. You don't have to force her to never go out, but at the same time it's long overdue for her to make sacrifices.", "NTA - But she is clearly taking advantage of you. Why are you taking the baby with you so she can go out?  She had the baby, not you. She has to learn that actions have consequences.", "NTA let her ignore you who cares she started to act like an entitled brat start letting her understand that she’s a teen mom she chose this route and it’s not your responsibility you took on too much of her responsibility and now she’s taking advantage of that situation. I would honestly barely watch her child at this point unless it’s an emergency. She needs to understand that the child is her responsibility not yours.", "NTA. Her baby her responsibility. While she is still a teen, she is no longer a child. She is a parent. Parents make sacrifices as you illustrated one too many times by being a baby sitter. You are not the baby sitter. You are the grandmother. Grandparents aren’t free sitters at a parent’s beck and call. If she felt old enough to make adult decisions, she is old enough to care for, take responsibility for, and be accountable the result of her adult decisions. You gave her a dose of reality and it didn’t settle well with her.\n\nIf I were you, I would establish a day where you will take care of the kid. Maybe do every other Saturday. Even if you just sit at home on the Saturday you’re not keeping the baby, I wouldn’t baby sit so she can go out.\n\nETA: She also needs to realize and come to terms with the fact that she’s probably going to lose a lot of her friends because she won’t be giving them the time she should be giving her child. (That is only if you stop baby sitting as often, which again, I really think you should.)", "NTA in any way, shape or form.  Too many of my friends have been in your shoes, raising the grandkids because the parents want to live a single lifestyle.  Put yourself first from now on, don't cancel plans just so she can be a careless teenager.", "NTA when your daughter decided to keep taking her her pants off for any boy and got pregnant not once but TWICE she gave up any right to any freedom or childhood. She’s taking advantage and clearly doesn’t take parenting serious. You should stop enabling her. The more you let her have a ‘normal’ childhood the more she’s going to take advantage. She should be watching her own kid 99% of the time outside of school hours. \nShe should not be going to parties or on dates. She gave up that privilege when she got pregnant. \nIf you let her keep this up you’re likely to end up with a second grandchild  real soon!", "NTA.  I would recommend you start discussing her plans for getting a job and moving out when she graduates school.  Daycare, housing, etc.    Don't let her take any more advantage of you - only babysit/grandma time on your terms.", "NTA. Your daughter is selfish. The child is not your responsibility for a second so the fact that you stepped up is super awesome. The fact of the matter is you're making it too easy for her though. The child is hers. If she isn't in school or working she should have the child. You shouldn't be taking the baby off her hands so she doesn't miss hanging out or a dance or whatever all the time. Good luck.", "NTA, you are enabling your daughter and she does not see the real consequences of her actions. You need to step back and let her raise the child she choose to have.", "NTA. She needs to raise her own child. Stop babysitting", "NTA ABSOLUTELY NTA … stop babysitting for her and letting her use you when she clearly does not value or respect everything you do for her and her daughter (WHICH IS A LOT)!!! You are an amazing mother and grandmother, you deserve to have a life and live it! Don’t feel guilty about it or let your daughter and her choices/child hold YOU back… she chose motherhood and it’s now time for her to BE A MOTHER!!", "NTA and now she needs to do more and you need to do less. Live your life and let her take responsibility for her child. Stop cancelling events or planning them around caring for her child.", "NTA I hope you had a great date.  You're trying to do right by your daughter and grandbaby, but that doesn't mean you get NO life at all.", "NTA. And if she wants to ignore you, let her!", "NTA. You've spoiled her though by putting your life on hold and letting her live hers. She's a mother. And while I can understand letting her live more when she was a mother at 14, she's now 17 and still living her life and she feels entitled to your time to raise her daughter while she still has fun because you've always done it. You need to set boundaries that SHE is the mother and needs to be raising her daughter, and if she wants to go out then she has to figure out a babysitter that isn't you, and you need to reclaim your life and not raise her child anymore except when your daughter is in school.", "Nta at all! Youre daughter is not mature enough to be a mum, im sorry. Auntie better step up.", "NTA. What is she going to do when she starts college, ffs?", "NTA! \nYour daughter hasn’t learned about consequence. Pregnant once, abort, then pregnant again. And now, you have her on a long leash trying to salvage her childhood. That ship sailed. The second she decided to keep the child, she forfeited having the same experience as others her age. I’m not saying she can’t enjoy friends, school or events, but her responsibility is now yours. You’ve allowed it. I get it. You don’t want her to miss anything. Parents want the best for their kids but too late. She has a kid. \nI hope she is now on some birth control.", "NTA but you have definitely helped create this monster. \nShe choose to have baby, she needs to step up and be the parent. \n\nI had my first young at 19 so not that crazy but it definitely made me grow the eff up fast. \nShe needs a reality check.", "NTA, I imagine how hard it was for you, a single mother to realize your child is going down the same path after trying so hard raise her.\n\nBut like it or not, your daughter is now a grownup with grownup responsibilities and decisions she made.\n\nIt is one thing to support her and another thing to tak on the motherhood responsibility for your grandchild as well.\n\nSoon enough your daughter will go away and you will be left alone with noone by your side. Is this how you imagined your life?\n\nEnjoy your life, be happy, go out and live! Your role is to support a teen mom, not adopt her baby.", "NTA. You already had your kids and time as mother to a child. You are now a grandmother and taking on more responsibility than a grandmother should. Time for your daughter to be accountable as a mother and deflect that role to you.", "You are an exceptionally young mother yourself - you did the initial hard work & it is time to get some joy in your life, not all the responsibilities. I am glad you met someone and had a good time, and what an easy day to remember later if things work out well!\n\nNTA. Let your daughter step up as a Mom.", "Soooooo it is totally acceptable for you to set boundaries. It is unfortunate that due to your daughters maturity the person who looses is your granddaughter which is probably why you have stepped in as much as you had. Since you actually had plans NTA - but I do hope you set more boundaries so that you can also have a life. Separately I do hope when your daughter is more relaxed you can talk to her about her disproportionate reaction to you having plans and what is appropriate expectations of you/her in a constructive way so to ensure you both are aligned.", "NTA. She’s a teen mom. I know you mean well but she needs to step up and take over more.  You’ve done too much. Never cancel anything again. Even if it’s just to say no, I’m tired.  That’s your right.  Start doing it.", "NTA  you need to dial the babysitting WAY back! Outside of attending school her kid is HER responsibility! Stop being her doormat already!", "NTA. You’ve done too much for her and now she acts like an entitled brat. I understand watching her kid while she’s in school, but she can get her butt home and be a mom after that bell rings. She wanted a kid. Here it is. You live your life.", "NTA, but that lesson on responsibility is 3+ years too late", "This is part of the reason why kids shouldn't have kids, and why sex education is vitally important.\n\nNTA.", "INFO: what did your parents do to help when you got pregnant at 19?", "NTA but you really need to stop coddling your daughter. She's not a kid anymore now that she's a mother. This is creating a very toxic environment for your Granddaughter as your daughter still has not learned to be a proper mother. You need to immediately stop enabling your daughter to act like she's still a kid. She has given up that right. She needs to step WAY up for her daughter's sake. How long do you plan to bend over backwards for her?", "NTA", "your daughter is taking advantage of you", "Your daughter is now a mother. She doesn't get to go party and hang out with her friends all the time anymore. When she is not at school she should be with her child being a mother. During school breaks she needs to be working. Her going out once or twice a month without her daughter is enough. She chose this path now she needs to take responsibility", "NTA. But you aren’t doing her any favors but not making her responsible for her daughter.  It seems more like you’re the mother and shes the sister. Starting making her be a parent.", "NTA but please for God's sake, get her on birth control of some kind. She's clearly irresponsible", "NTA one but! You have done more for that girl than she may ever know, but you have to also teach her how to be a mom so she is prepared to do it on her own. Also, you are 36!!!! Go enjoy yourself!", "YTA to yourself! Your daughter needs to be a mom she doesn’t get a childhood she chose to have a child.", "NTA. \n\nYou've given up enough for your daughter and  granddaughter. Please continue taking your independence back. You deserve a life of your own.  \n\nYour daughter chose to have her daughter. She wanted to be a mom, so let her be one. Her decision has consequences -- and please don't think of consequences as punishment-- and one of those consequences is giving up a lot of freedom and accepting a lot of responsibility until the child is grown. You raised your kid; don't do her job for her.", "As a teenage mother myself, what the OP did was spot on. It is not OP's responsibility to care for her grandchild. The daughter should be asking OP to care when it is convenient to OP, not expecting her. So, NTA for standing her ground. \n\nOn the other hand, OP is definitely TA for enabling her by always caring for the child for 3 years. This has made the daughter entitled which is clearly in OP.", "YTA for allowing your 14 y/o to get pregnant a few months after she had an abortion. YTA for not teaching her about birth control and providing her access to it.", "Your not teaching her responsibility your shielding her from her responsibilities You created her you taught her how you will take care of everything 🤷🏻‍♀️ and now your surprised she acts this way you the one who taught her it’s ok  to treat you this way she has no consequences to her action", "Spay and Neuter your Vacant Little Hosebags.", ">some serious work to reparent your daughter \n\nIt’s too late. \n\nWhen you have a kid at 17, realize how stupid that is and abort it, THEN HAVE ANOTHER KID A FEW MONTHS LATER. Well, that is when we throw in the towel and realize this idiot is to far gone\n\nEdit: appears I’m blind… FOURTEEN SHE GOT PREGNANT AT 14. Did I say she’s to far gone ? Sorry I meant she’s BEEN far gone. OP your being mooched off of… why doesn’t she take her own daughter on her date", "i also think it is fair to say that she’s still young and has a lot to learn and a lot of maturing to do. \n\ni’m going kinda ESH personally. the daughter is being shitty, but op shouldn’t have allowed her daughter to take it this far. 17 year olds (especially ones that got pregnant twice at 14) don’t exactly have the best decision making skills or impulse control.", "Me too! Baby at 16 and I was 100% responsible. I worked to pay daycare so I could finish school and work. I paid for diaper, clothes, food, meds, dr visits, insurance, etc. My parents were fantastic grandparents to her, but basics were my responsibility. Go out?? 🤣🤣🤣 No, you’re a mother now you stay home and take care of YOUR baby. I’m in my 40’s now with 3 kids and I’m so grateful they made me step up", "Daughter had the baby at 14. Not 17. OP helping was reasonable as daughter was a teen. But yes, daughter needs to step up.\n\nI am concerned at a 14 getting knocked up twice in a few months. Where was the sex ed?", "But can you imagine what the kids will do when she heads off to college. Id be surprised if she doesn't leave kid with mom and disappear. Making a ton of excuses as to why she can't take her daughter with her when she moves out.", "I would try and get her on some so she's not popping out more kids anytime soon that she expects you to raise", "That’s what sticks out. Pregnant once, abort and pregnant again within months. Oh she’s a responsible kid. Where was the talk about protection after the first pregnancy? I know things happen and a baby is a blessing but this girl needed birth control immediately after the first pregnancy. She’s not responsible obviously.", ">When you have a kid at 17, realize how stupid that is\n\nShe was *14* the first time she got pregnant.  She was at most 15 when she got pregnant again.  smh", "She was 14!!", "That was at 14 not 17. Her kid is 2 or 3 now.", "Not 17, 14. She got pregnant at 14, had an abortion, then got pregnant again months later when she was either still 14 or had turned 15. \n\nThe daughter has had issues and lacked responsibility for a long time.", "re-read it, she got pregnant at 14. not saying it justifies anything, but 14 is too young to understand the ramifications imo", "fourteen. she was fourteen when she first got pregnant.", "Strong agree. My teenage girls were difficult at that age, and I was so happy to see them go away to college (They are in their 20s now and lovely, responsible people). The OP still needs to finish raising her teenager, and that means the grandchild too for now.", "I want to know how old the father is. OP seems to be backseat parenting and then wondering why her daughter is out of control.", "If this is America, sex ed is mostly \"don't have sex\" ...at least that's how it was when I was in school.", "But weekends she should be canceling plans not you. As a mom she dos not have free time just like you did not. Her responsibilities are education and child care. Most moms have household and/or job responsibilities as a well as taking care of our children. We were lucky to get out child free a few times a year. She wanted the job as a mother, give it to her!", "Exactly. So far, not a good track record. And I’m not going to shame or blame. But this teen needs to be educated.", "Its funny you mention that she cancels plans when it distracts her from her studies and that she's responsible \"student\" but what about as a mother? Does she cancel plans for her kid?\n\nIts great that she's focussed on her studies and education but there seems to be lack of parental responsibility coming from your daughter.\n\nEdit: typo", "And yet here you ate not forcing her to be responsible for the life she willingly brought into this world. \n\nGuess who's going to ensnup with the baby when your 17yr old goes to college? Yep, you. \n\nYour daughter is going to ditch her kid on you as soon as she can and leave for college. Then she'll make a ton of excuses as to why her kid can't come, and she needs you to babysit. \n\nIf I were you I would start forcing your daughter to be a mom, or you'll be doing the mom things all over again. While your daughter is living it up at college acting like she doesn't have a kid at home. \n\nGood luck, if this is how your kid treats you from your lack of consequences and boundries. I can only imagine what shell do when she's 18 and graduated.", "After the first time getting pregnant you could have limited her social life if she wasn't being responsible.  My 21 year old daughter has always had a social life, a few boyfriends and hasn't managed to get pregnant. Clearly your daughter isn't making the best choices and you should have communicated with her the risks of unprotected sex and the choices shes making after the 1st pregnancy.", "And the OP was also a teen mom… just as a side note, though she was legally an adult, based on the ages listed.", "i think we also need to look at the nuance here, and OP needs to set boundaries. \n\ni don’t think OP was wrong for this specific situation. but she’s in this situation with her daughter taking advantage because she’s allowed it. OP clearly cares and wants to help her daughter (and my math puts OP as pregnant at 18-19, so maybe a sense of not wanting her to go through similar things), and that is great. but the daughter still needs to raise her own kid, and sometimes that means giving up time with friends etc\n\nsounds like mom has sacrificed a lot to help her kid, and her kid is taking advantage now. it’s not OP’s job to do everything, but she’s let her daughter take advantage to an extent. time to put your foot down, and teach your kid that actions have ramifications", "DUDE THIS!!! you are with your kids on the weekends most of the time! OP what's gonna happen when she is out of school?? Is she still gonna expect everything to stay the same?", "Exactly, it's one thing to babysit so her daughter could continue her education but her childhood ended the day she have birth. That baby is her responsibility yet she seems to act like a carefree teen instead of a mother. Time for the OP to stop being so soft and make her daughter care for her own child.", "She probably feels a little invincible. Clearly though she can get pregnant", "She literally said “my mom has no life anyway” and laughed while she basically said she doesn’t care at all that she makes her mom take care of her baby. The same mother who sacrificed her livelihood because this kid wants to be a fucking doorknob. \n\nIf someone said that to me after I did all that for them forget watch their kid I wouldn’t wanna be anywhere near them. Parenting is a form of guidance not servitude like your making it out to be.", "I think it was less the school and more the “ I didn't want her to miss on her childhood”. \n\nLike. Honey, her childhood was gone as soon as she became a mom. \n\nYou don’t lose yourself as a person, but you don’t get to have care free last minute weekend plans without planning for child care. And no, expecting your mom to cancel her plans minute so you can go have fun is not planning for child care.", "She was 14! Do you even know the age of consent for your state? Or who the father is? \n\nYou shouldn’t have left it up to her to ask for birth control. You should have made it happen. You also shouldn’t have taken a hands off approach to her second pregnancy. Why did you leave it up to your sister to deal with? Why didn’t you step up and parent when your daughter decided to keep the baby and you disagreed?", "I'm not making it out to be servitude at all! That behavior from the daughter is absolutely insanity, but the way the mom handled it was wrong too.\n\nIf the mom heard that,  she should have immediately put a stop to that behavior AND refuse to babysit because of that. There's a direct correlation from the child's behavior to consequence. Based on the child's behavior, the mom should have been doing this a lot.\n\nHowever, that's not what the mom did. The mom overheard it and then made her own plans and then told her daughter, \" while you have to cancel your stuff now\" once she made plans. If I remember the post correctly, the mom didn't say it was due to the daughter's behavior or anything. \n\nThe mom is, and seems like has been, parenting her daughter immaturely. I'm sure the daughter will repeat the cycle and be an ineffective parent too.", "It sounds like leaving all of the difficult parenting to someone else is something Lia learned from mom.", ">  My daughter got pregnant at 14, and it was very shocking news, but we found out very early on, and she got to abort it. A few months later and she got pregnant again\n\nYTA cause you didn't properly teach her about birth control, even after she already had one abortion.  All this *motions to OP* could have been avoided from the start.", "ESH. Why, after the first \"accident\" didn't you get her on birth control?!", "NTA\n\nBut this was long overdue. You need to put your foot down and stop enabling your daughter because you’re scared she’ll “miss her childhood”. Honey, your daughter gave up her childhood the moment she decided to have this baby. She needs to start being responsible for that child and stop taking your help for granted.", "Off topic, but I just can’t fathom someone being a grandparent at 36", "NTA she is the mother not you! She has a 7 year old not you. I think you have put your life on hold to help your daughter which she doesn’t appreciate. Now it’s time that your daughter gets a taste of the real world and learn mother hood is 24/7 and we don’t get Hollidays off.", "NTA but man you haven't done her any favors by coddling her. Going forward I wouldn't babysit for her (especially unpaid) and go live your life. She made the decision to risk becoming pregnant (twice!) And she made the decision to keep the child, but it doesn't sound like she has any real responsibilities when it comes to being a mother.\n\nThings need to change or else you'll end up in a much worse situation. Stop letting her take advantage of you.", "NTA, but…like I know it’s really none of our business, but after the first pregnancy did you guys not talk about birth control? The pill, an IUD, shots? Something?\n\nIdk this is judgy but I mean you’re here to be judged, so…it seems like maybe you haven’t been the best *parent* to her in a while. I don’t mean you haven’t cared for her or loved her, but that you haven’t set boundaries and expectations. Her behavior has been out of control since well before her baby was born, and you’re still enabling it.\n\nSchool is important and it’s good that you were able to help make sure she didn’t have to drop out, but her social life needs to take a few dings at this point. She’s a mom; she needs to act like one.", "NTA. \nyou’ve done a very honourable thing helping out so much so that she could live a normal ish childhood from 14-17. Now she’s almost an adult and you’re allowed to step away.", "NTA\n\nAnd GO MOM!", "Your daughter forfeited her childhood by deciding to keep her baby. Now she gets to mother her baby. NTA, you shoudl have been doing this from the get-go.", "But where is the father in this situation?", "How about putting her on birth control right after the abortion? I mean WTF !?!??", "ESH.  She obviously sucks for taking advantage of you, but you brought this on yourself by not ensuring she didn't follow in your footsteps (like, did you not teach about birth control, especially after her abortion?).  You also let her take advantage of you for far too long.", "ESH.\n\nBut mostly you, because you're the adult here and your daughter is still a child, and you handled this really poorly. This didn't need to be a \"teaching moment\", and you didn't have to drop this on her suddenly the way you did.\n\nEdit: I forgot to say - Of course you deserve to enjoy your life, and I'm glad you feel like you can start to live your life for you. It's not what you want that's the problem, it's how you handled it.", "Your daughter needs to grow up, she got pregnant at 14 and didn't learn from it at ALL. Then she got pregnant again and acts as if it your child. \n\nTime to stop bending over backwards for her and show her what being a parent means and that means sacrifices. She made a choice to not use birth control, she made a choice to have the child now she doesn't get a choice in raising said child. \n\nThe only thing you should have done differently is to stop coddling her, she doesn't even appreciate it. NTA", "Nta for making plans, but y t a for allowing your daughter on nights and weekends have you still babysit. During school hours is fine, but the rest of the time should of been a no from the start", "NTA. Your daughter is a single mother now, stop shielding her from that responsibility.", "Why should you have done it? Your daughter, young as she is, is a mother and her child is her responsibility. That she laughs at you is pretty disgusting, even allowing for her youth. You do plenty for her. She needs to understand that you also have a life and her decision to have her child means she needs to ask, in advance, if you are free to babysit.  And act like an adult if the reply is no. NTA. The selfish one here is your daughter.", "Oh no, a teen mom got pregnant and suffered the consequences of having a baby, oh the humanity\\~\n\nSeriously, no you're not the asshole. Your daughter needs to smarten up and take responsibility for her actions. You've been a single mom for years, living by the grace of multiple jobs, having no social life to speak of, and your daughter who is absorbing your assets with a shit eating grin has the audacity to laugh about this? It's time for some tough love and forced empathy training. After all, she's an absolute fool if she thinks this situation will remain forever. Eventually she'll be expected to be independent.\n\nBesides, what's one valentines day for her? She's only 17. Plenty of time to date in future...or maybe not\\~ \n\nNTA", "NTA", "NTA for making plans. Honestly though, you’ve been too nice and may have let helping your daughter go a little too far. It’s great that you’re an involved grandma and have been supporting them, but it doesn’t sound like your daughter’s learned anything about motherhood and responsibility, and I suggest you keep teaching her those lessons. Otherwise she’ll never move out and you’ll be taking care of them (mainly your granddaughter) forever, never getting a chance to live your own life. Stop letting her get away with not being a mother to her child. Teach her how to be a parent. She’ll need to cancel plans sometimes. She’ll need to stay home on weekends and holidays to take care of her child. If she wants to go out, she always needs a backup plan in case you’re not available. She made the choice to keep the baby as a teenager, and she needs to start facing that choice. If you don’t make her own up to her decisions, you’ll move into AH territory pretty quickly, because you’re not doing anyone any favors.", "NTA. You've just done 17 years as a single parent. You'll be doing another 17 years if your daughter gets her way.", "NTA\n\nHowever you really aren't doing her any favors bu enabling this behavior. And you're not doing your granddaughter any favors either. She needs her mom to be an actual parent.", "NTA- we there she was a teen mom or an adult mom, she has responsibilities now, stop canceling your plans for her, it's not your job to raise that baby and she clear doesn't care about your feelings.", "NTA and you should reduce the amount of free babysitting you do for her to go out for social reasons. She needs to re-evaluate her priorities and won’t do that if it’s made so easy for her to do what she wants (I applaud you for ensuring she could finish school, though)", "NTA you made it as a single parent so can she.\nIf you want to babysit while she is in school, great but don’t put your own life on hold just because you don’t want your daughter to experience any inconvenience.\nYou are NTA for living your life and you shouldn’t have to leave the house to avoid babysitting.\nPlease find a backbone", "NTA you’re allowed to have a special holiday too.\nYour daughter has made some very poor decisions, and as she gets older you really need to put more and more responsibility on her, you cannot keep running to her rescue over and over.", "NTA.  Your daughter is an entitled supersized AH.  \n\nOP, you have created a monster who has zero respect for you.  \n\nYou should quit being the mother to her baby.  (I cannot refer to it as babysitting - because I suspect that you have been more of a mother to this baby than she has.)\n\nSHE chose to have this baby & SHE needs to raise it.  If she doesn’t… get ready to be a grandma again within 1-2 years max.  \n\nWhy should she try to prevent getting pregnant again when you’re the one facing all the real lasting consequences of having the baby?", "NTA There's nothing stopping your daughter from hiring a babysitter - like every other parent who wants to go out without their child.", "NTA…Your friend is dead wrong. Your daughter has become very entitled and you did her an enormous favor. If you don’t take care of your own needs then everyone suffers. Keep it up!", "NTA.  She is the baby's mother. She needs to step up.", "NTA, but you've got to let her mother her own kid. What is it going to be like when college rolls around? Is she planning on taking her child with her, or is she planning to leave her kid with you for four years while she \"visits when she can.\" Wanting your daughter to finish school is a wonderful thing, but it's turned into the point where you're being accused of being selfish by telling her that she'll have to stay with her own child. The two of you need to have a serious talk about her stepping up, otherwise you're going to be the only one raising your grandchild", "NTA. I wish tf my daughter would take an attitude after I’ve sacrificed, worked nights to watch her baby. How dare she ignore you. All babysitting during moms hook hours would stop immediately. Also lose your friend that said you shouldn’t have gone out on valentine day.", "You messed up by not nipping this in the bud years ago, your daughter turned you into her doormat.\n\nNTA but you would be if you cave to her tantrums. She'll stop ignoring you the next time she needs a free babysitter.", "NTA. Don't let your daughter take advantage of you OP. Your daughter is a mother, she has to be responsible for her child. Let her.", "NTA for this particular instance but...         \n     \nYATA for the fact you have been enabling her.  I agree with helping her while she is in school but you should not be worried about \"her childhood\".  She was the one who chose to destroy it by making the same mistake the second time.  She should be having to participate BIG TIME helping around the house and taking care if her child when she is not in school", "NTA your daughter got pregnant at 14. She clearly needs a reality check. It's a good lesson for her", "NYA Daughter needs to grow up. You’re not a built in babysitter.", "Had my daughter at 16 here. My mom was great and very supportive but she made me raise my now 24yr old daughter.  Just as I should.  Shes my responsibility,  not my mothers. You're daughter is taking terrible advantage of you and it needs to stop. She made her bed and now needs to lie in it. You are 100% not the asshole. Your irresponsible entitled daughter is. Stop enabling her shitty behavior.  I'm all for you helping her when shes trying to finish school etc but you need to live YOUR life. Instead it sounds like your daughter is doing it for you.", "She’ll get over it.", "NTA. She's lucky to have you, but you shouldn't throw away a chance for romance/fun for a brat like her. It's time she learned the REAL fact of life: it's hard to chase after fun if you've got a baby to care for. OP, it's time you came first in your own life.", "INFO\n\nDid you agree to watch your granddaughter and then back out? Or did your daughter just assume you would do it?", "I have actually thought a lot about this. If my kid gets pregnant (or gets someone pregnant) high school is over. They will get a GED. They will get a FULL time job or multiple part time jobs. They will attend community College. They are responsible for the kid 100 percent of the time. That includes providing daycare unless I choose to stay home with the baby. (Let's face it, a teen parent will easily be able to get daycare vouchers). Literally, my life would not change. Once you have a baby you are an adult! No ifs, ands, or buts.", "NTA. She’s a young mom. She needs to learn to take care of her daughter and not rely on you all the time.", "NTA, I think valentine's day should be the beginning, not a one time thing, the beginning of it being like this from now on. Make plans when you want and watch your grandbaby when you can/want to. Now that you heard how she really feels, she's definitely acting old enough to start taking primary responsibility of the minding of the child.", "Former teen mom here I never made plans without asking my mom in advance if she didn't mind watching my baby. I had more support than a lot of teen moms so I made sure I didn't abuse it. Did I go every where  no, bug I was still able to do a lot.", "NTA\n\nThis shouldn't have been the first time your daughter was responsible for the child she had. There should be more, many, many more days of cancelled plans because when you have a baby, that's what happens. You miss stuff. It sounds like she's essentially an entitled big sister. What happens when she goes to college, assuming that's the plan? Turns eighteen, at the very least and gets a job? Is she going to be mature enough to parent or does she expect you to raise this child? What are your expectations?\n\nI'm glad you went on the date. As for your friend's comment, he didn't ask you on a normal day, did he?", "NTA\n  \nShe is having such a bad reaction because this is the first time in years that she has met a boundary.\n  \nBe prepared for her to bang on it, throw things on it, and try to ram through it. \n  \nIt's going to suck. But remember this:\n \nYOU ARE NOT BEING SELFISH. You want to have your own life. You signed up to be a mother to your *daughter*. Not your granddaughter. \n  \nShe is asking you to be there as her mother and her daughter's mother. That's not fair. You have one daughter. \n  \nSometimes my 7 year old talks about when she's a mommy. Because I teach a lot of teen mothers, I say, \"yes, but please not for at least 20 years. I can't help you with your baby if I still have babies at home.\"\n  \nBottom line, I won't have the time, energy, money, or emotional capacity to care for a grandchild while simultaneously getting my own child through school.\n  \nI chose to have my children. If they choose to have children, they will need to step up to be the parent.", "Nta. She must grow up.", "nta for having a life, but yta for the way you've been coddling your daughter. knock that shit off. make her get a job and pay for the things she should be responsible for and actually take care of her daughter", "NTA\n\nI’m a bit surprised that following your daughter’s abortion she wasn’t given a long-lasting method of contraception like an IUD or implant. For her to get pregnant again almost immediately after her abortion would indicate some critical thinking problems or abortion regret, or both. Your daughter should be seeing a therapist and be on some long-term contraception that she cannot forget to take or neglect to use.\n\nHer behaviour towards you has been very entitled and you deserved to have an evening to enjoy yourself.", "NTA, but OP you and your daughter need to have a \"come to jesus meetinting\". You are going to have to make your daughter put her big girl draws on and take care of that baby. Once she gets home from school the baby should be her responsibility if you don't set limits on your time that baby will eventually be calling you mama. You are a single parent, so you know how hard it is, why are you letting her off so easy and making it harder on your self. She can be mad, let her be, but stand your ground, she lost all that free time once that baby arrived, end of discussion. Where is the daddy and his parents?", "This doesn't answer the question. but after abortion #1, why didn't someone offer a Depo shot or something to prevent another pregnancy? You could have been responsible with your daughter sooner. She was 14yo, and you needed to step up provide some guidance and prevention to someone who clearly wasn't mature enough to have the responsibility to have a child. So babysit and stop complaining because you are just as responsible for that child being born as she was, if not more.", "NTA. \n\nYour daughter got pregnant, then aborted the baby and yet still got pregnant several months later? \n\nThen on top of it all, she doesn't do much of the actual parenting because you take care of everything? She gets to still be in school \\[which I definitely think is important\\] and not have to work and then thinks she can also just force you to do all the babysitting and never have to actually watch her child? \n\nNo, you are NTA. Though I would put your foot down about her stepping up as more of a parent. Having her stay in school is important, but you also need her to understand she has a major responsibility to this child that goes beyond just being around. That is HER child, she needs to raise it too.", "She's the mom. She's going to need to learn that fact.  You're awesome for helping out so much.  NTA.  She needs boundaries.   Her actions need to have consequences for her life,  not yours.", "NTA for giving her a dose of reality... but low-key you are TA for letting her get away with this for so long.  You aren't doing her or your grandchild any favors by allowing her to dump all of her responsibility on you.  \n\nSit her down, tell her the free ride is over.  She's expected to care for her child from now on:  don't go planning dates, don't go setting up hangouts with friends.  Either be at home with her child outside of school hours, or get an after-school job and contribute financially to raising her child.  If she takes the job route, diapers, wipes, etc are HER responsibility from now on.  And she pays some nominal fee to you for childcare during work hours.  Child care during school hours, of course, will remain free until she graduates.  If some special thing comes up like a school dance or something, she has to make arrangements for childcare in advance.  Etc.\n\nHer childhood ended the moment she chose to keep that baby.  Make her take responsibility for her choice.", "Oh love, this is a giving too much rope situation. NTA, you are being taken advantage of. Which is often our job as mums but you were right to put your foot down & I would try & stick to fairer boundaries in future. You deserve a life. Grandparenthood is supposed to be where we get to do the fun bits whilst maintaining our lives. \nInfo: was the date good?", "Nta. Had my dad gotten pregnant 2xs at 14, she wouldn't be having a social life. She would be too busy dealing with her child. Its one thing to help so she can finish school, its entirely another thing when when her social calender looks like every other teens. Shes a mother now, her actions should reflect that. The fact that she thinks its hilarious to make you give up your social life so she can go abt like nothing happened & she has no responsibilities is disrespectful. Shes never going to learn if you keep making it so easy but more importantly, she is never going bond & see herself as a mother", "What in the hell? Pregnant TWICE at fourteen? What?", "Nta but put your daughter on birth control", "NTA but what the hell are you doing raising a child SHE decided she wanted?", ">but I wanted her to learn a lesson and be responsible\n\nLittle late for that, isn't it?", "ESH. Your daughter needs to step up more, yes. But she was a child when she had a baby. Of course you had to take on more & help her, because she is a minor & was a child herself still.\n\nHave you put any focus on helping her develop some skills? She obviously has to grow up faster than her peers, but that doesn’t mean she just also all of a sudden has the life skills of an adult just because she had a baby. She is 17 & whether she has a kid or not, she still has the brain of a 17 year old. \n\nOne way you can support her is not enabling her but not abandoning her to figure everything out herself either. She needs guidance & constructive support.", "NTA. My sister had her son at 14.  My mom would babysit if it was for school or work but never for her to hang out.  She did the same for me when I had my daughter at 26.  \nStart living your life and make your daughter br a parent.", "If you love your daughter, you’ll let her actually reap the consequences of her behaviour. She should be missing out on those lovely teen things. She is a mother. \nYou should not be missing out on moving on with your life due to her circumstance. \nYTA", "NTA. Lia needs to learn what parenting is and the only way it will happen is by letting her do it. She doesn't need to be focused on dating right now anyway. Please stop rescuing her every time or feeling guilty. \nPlease don't listen to or accept the judgement from some of these responses saying you're the ass for not parenting her etc etc \nGet out and enjoy your life. It's her turn with some guidance from you.", "NTA. So is the baby daddy doing anything to help out? Does she even know who got her pregnant? I think you need to talk to her about what she said was super disrespectful and you expect her to be better then that. Stop babysitting all the time and make your daughter start acting like the mother she decided she wanted to be.", "The argument DID end well; it just didn't end the way Lia wanted. NTA.", "You’re NTA for this but very much TA for taking care of her kid. She’s the monster you’ve created.", "It’s called responsibility", "NTA My daughter is a teen mom as well.\nWhile pregnant I told her, her baby is her responsibility.\nAs a grandma I do financially help support my daughter and grandson and will until he's a year old. Then she'll need to figure out daycare and a full time job.\nI watch him once a month, so my daughter can go out with friends. \nYou really need to set boundaries. Such as; you'll babysit once a month or once every other Saturday. Even if you don't have a \"life\" you're almost done raising your daughter, so you shouldn't have to start over and raise your granddaughter too. Your daughter chose to get pregnant and have a baby. That was her decision and at that moment she decided to be grown. \nIt's very noble of you to financially support both your daughter and granddaughter while your daughter finishes school. Once she graduates there will need to be more boundaries set. \nYour daughter has gotten so used to you taking care of her daughter that she feels entitled to go out with friends or on a date whenever she wants. Of course she's upset with you, because she didn't get her way.\nSet firm boundaries now, so that this type of situation doesn't happen again.", "NTA. Glad you had fun on your date", "NTA. She chose to be a mother and at a young age which means sacrifices. It’s angered me to read to you have allowed her to take advantage of you but you taking on the roll as “mom” to your granddaughter. It’s time for you to sit your daughter down and have a very long and needed conversation about the responsibilities that come with motherhood.", "NTA, stop coddling her.  Check with her school's social worker.  Most schools have a day care center that will care fir students children.  Limit the time you watch your granddaughter so she can hang out.  She is a mother and needs to be one.", "NTA. I hope you had a lovely, well deserved, evening out. Your daughter is having a temper tantrum. She needs to learn to suck it up and deal with the reality of her life. She also needs to finish schooling so she can get a career and provide for her child in the future. Basically she needs to grow the hell up asap.", "NTA.\n\nYou are being gracious enough by taking on a responsibility you did not ask for and helping her with the child as is. It's VERY manipulative of her to make such a fuss and ignore you for standing your ground when:\n\nA. You had every right to do so\n\nB. She was very shamelessly taking advantage of you and laughing about it", "No! NTA. Good for you. You're only 36 -- you deserve to have a life and a nice guy to date. Stop enabling your daughter and give her room to step up to be a mother to her own child. Don't give up on your own life so she can have a childhood; it'll just prevent her from ever growing up.", "Yeah, I think there’s some introspection needed on mom’s part here. First and foremost, I get that 14 isn’t 19 but um, wasn’t OP *also* a teen mom? \n\nSecond, it’s unclear if OP ever committed to her daughter to take her daughter’s daughter on V-day. If yes, she shouldn’t have - the minute she heard the daughter say she had no life she should have said that she wouldn’t take the kid that night - date or no date.", "Maybe she should have taught her daughter about birth control and safe sex🤷", "Yeah that drove me nuts...\n\nI hope from now on OP prioritises her own life and happiness more, her daughter has a responsibility to learn how to be a mother to her child not expect others to put their lives on hold to play babysitter all the time, and then say they have no life?!", "NTA.  Your daughter is an entitled supersized AH.  \n\nOP, you have created a monster who has zero respect for you.  \n\nYou should quit being the mother to her baby.  (I cannot refer to it as babysitting - because I suspect that you have been more of a mother to this baby than she has.)\n\nSHE chose to have this baby & SHE needs to raise it.  If she doesn’t… get ready to be a grandma again within 1-2 years max.  \n\nWhy should she try to prevent getting pregnant again when you’re the one facing all the real lasting consequences of having the baby?", "If you parent your kids, you’ll enjoy your grandkids and befriend your adult kids. \n\nIf you befriend your kids, you’ll hate your adult kids and parent your grandkids.", "What got me was:\n\n>(36f) daughter Lia (17f)\n\nfollowed by:\n\n>it was very shocking news\n\nSo, a mother who had her kid at 18 or 19 (and therefore got pregnant at 17/18) is “very shocked” her daughter got pregnant as a teenager. \n\nLike teen pregnancy is unheard of to the former teen mother.\n\n(Edited for clarity)", "You should look at the statistics for the ages of the fathers of teen pregnancies before you judge the child for having sex.", "I’m 29. My cousin was a grandfather at 29. I cannot imagine myself as a grandmother.", ">you’ve had to take a world full of problems on your back because of your daughter\n\nNo. She’s had to take a world full of problems on her back because of *how she raised* her daughter. \n\nSorry, but barring SA, if a 14-year-old ends up pregnant twice, her parents aren’t doing their job.", "Treating children as consequences is a sure fire way to ensure a rented kid who hates being alive.", "You’re right - it’s only one time, but hopefully OP will make this the start of her daughter stepping up. \n\nBTW, when the mother takes care of the kid it’s not babysitting. It’s parenting. Something she clearly needs to do more of.", "The best thing for Lia is if she was kept busy with school, work and taking care of her child so she doesn't have the time to get pregnant again.\n\nBecause if OP thinks it no fun with ONE baby, just wait....", "When fourteen year olds get pregnant they aren’t fucking monsters. A lot of times the baby has an adult father and the teen is a rape victim. \n\nShe’s not stupid, she’s a literal child. This is why children aren’t ready for sex. This is why OP should have gotten her daughter on an IUD or implant.\n\nEdit: also, it’s not “too late” to help a teen straighten out. Plenty of people have hard teen years and grow up to be good people. Some people do that even without good parents.\n\nYou severely lack empathy.", "I mean OP had the daughter at 18ish? this is how trauma/poverty becomes generational. 1 teen parent becomes parent to another teen parent.", "Arm implant or IUD should have happened after the abortion. No question. Also interesting that we're not discussing the male involved in this. Where is he and his family in all this?", "Right? Get her on some type of birth control that she doesn't have to take every day because she's obviously irresponsible.", "It’s time for a reality check with your daughter. She’s been coasting on you for 2 or 3 years now. She hasn’t had to face the consequences of her choices not to use BC or abstain or abort or surrender for adoption. If she wanted to be a carefree teenager, she had all of those options. Now she doesn’t. Tell her you helped her though the earliest hardest parts when she was barely in high school, but now she is nearing adulthood and her child is fully her responsibility. You’re no longer going to sacrifice your social life so that she can be irresponsible. Tell her SHE hasn’t been fair to YOU and now it’s time for it to change. \n\nAs for your friend, she’s absurd. Your teenage daughter has already been knocked up twice. She really doesn’t need to go out on Valentine’s Day. You, on the other hand, are a single and available adult without a small child, and if you want to go out on vday, it shouldn’t be depending on your daughter’s preferences. That is some messed up hierarchy of priorities in your friend’s mind.\n\n\nGlad the date went well. It seems that there was a lack of rules or common sense or discipline or something along the way- maybe because you were also a very young mom. It’s okay for you to change that dynamic. It’s well past time for your almost adult daughter to learn some responsibilities. Good luck!", "NTA. I’m so glad you had a great date! You deserve a life too, and you are already raising a second child, one you did not choose to have. Your daughter does need to come to terms with the fact that she did *decide* to become a mother, and that means she is going to be deferring or leaving behind some experiences that childfree teens will have. Unless she plans to let her adopt her child (and it doesn’t sound like you are offering her that) she needs to be a mother, with your support. That means her priorities are finishing her education, and mothering too. Everything else will be based on your willingness to accommodate her, and that is entirely up to you.", "And then drops the next kid back home with Mom. Again.", "I honestly don’t see much wrong with OP becoming primary caregiver. If my daughter had a baby when she was 14 I would simply raise the baby until she was able to.", "Has abortion and immediately gets pregnant again.  FFS", "taking care of the child is one thing, but to allow her daughter to continue living as if she didn't have a child and serious responabilities was wrong. Her daughter obviously has never been given consequences before in her life seeing as she got pregnant right after getting an abortion for getting pregnant (at 14 no less) and needs a heavy dose of reality.", "Yes, let’s punish the baby by this teen raising her when it’s clear she’s not ready.\n\nI honestly hope no one commenting this stuff is a parent.", "Actually the daughter got pregnant at 14 had an abortion and a few months later was pregnant again and kept it if I read the first paragraph correctly.", "So, she has no problem cancelling plans to study, but has a problem cancelling plans to take care of her own child? She might be a responsible student, but a responsible mother, that she is not.", "She also needs to be a good mom, because that is what she chose.", "You really should consider threatening her the next time she abuses you that she’s going to have to drop out of school and get a GED, because she’s going to keep abusing you until you give her a reason to stop.", "I do judge the other adults involved though, OP didn’t and no doctors insisted that the 14 year old have an IUD fitted after her abortion? That’s unusual where I come from. Abortion providers don’t want repeat business, it’s necessary healthcare but it’s for an avoidable situation so they will help you avoid it a subsequent time. For this girl to have a second pregnancy so soon following her abortion means the adults in her life dropped the ball. A 14 year old with a 5 year IUD would have the remainder of their childhood protected and at 19 be marginally better at making decisions for herself when it’s time to have the IUD replaced. I hope for everyone’s sake that the daughter has one now and that a second grandchild doesn’t make an appearance.\n\nThe person getting the daughter pregnant is equally responsible and should be sued for child support if he  is an adult, or pending if he is a teen.", "parents can only do so much.", "Ummm…birth control? After your daughter got pregnant AT FOURTEEN, birth control was clearly a necessity.", "Honestly same, who the hell is getting a 14yo pregnant? It takes two to make a baby.", "Yup. Which means it should have fallen on OP.", "No as a mom she should be making plans that are kid friendly OR making sure she has a sitter before confirming her plans. \n\nOp I think it's time you make her put her daughter in daycare, get a part time job after school and actually take care of her own daughter. You should not be your granddaughters primary caregiver, she needs help covering a few hours here and there sure watch the baby but not the way you have been. She needs a reality check because she's obviously not appreciative for what you've done for them whatsoever and that's the worst part of it all.", "My sister's best friend had FOUR abortions in two years and then kept the fifth pregnancy about a year later. She wasn't a teenager though, she was 27 when her daughter was born.\n\nI'm very pro choice but shit, at some point you should consider some form of birth control. I believe all her abortions were early enough to just use the abortion pill but that still has to be rough on your body.", "That's quite common. Often it's because they (both parties) don't know how to use contraception, or won't use it, or didn't really want the termination in the first place.", "I want to know why OP didn’t make sure she was on birth control or at least better supervised.", ">This!--absolutely 2nd pregnancy was deliberate.  \n>  \n>Also notice that OP was 18 when she got pregnant, so tho an \"adult\" teen, still a teen pregnancy.  And no mention of daughter's father.", "Right, how do you make that mistake twice XD", "This.  \n\nOff time?  Honey, moms don't get a lot of that.  After school activities?  You've got a child, care for it instead.  Weekends?  You have a baby, you want to go out with your friends better go somewhere you can take the baby with.  Special occasion coming up (like Homecoming or Prom)?  Better ask IN ADVANCE about Mom keeping the baby for the evening and how long she's willing to do you that favor.", "I’m talking about the mother, not the daughter. I’ll make an edit so it’s clearer.", ">The person getting the daughter pregnant is equally responsible and should be sued for child support if he  is an adult, or pending if he is a teen.\n\nIf he's an adult impregnating a 14-year-old, there should be more than just child support pursued.", "Parents can tell their kids they can get another abortion or give up the child for adoption or move out and take care of their own shit. OP didn't have to raise the baby.", "I just…your 14yo child just had an abortion and you DON’T have her movements under supervision 100% of the time? That child would be going to a babysitter’s house before and after school until I picked her up. There would be 0 minutes of the day that she wasn’t under the supervision of a trustworthy adult. I just can’t imagine being like “well, I assume she learned her lesson so nothing needs to change”.", "She still could have gotten pregnant. Have you spent any time at a middle or high school? Of a church? They have sex in the bathrooms, closets, at the park after school, etc…", "The daughter doesn’t necessarily need to raise the baby. If it were my daughter I would just adopt the baby. A teen isn’t ready for babies.", "It seems like OP was also a teen mom and really highlights how we're all failing here", "Exactly. I don't have a problem with her watching the baby during school hours, but that child needs to remember she's a mother now. I have a friend who's daughter had a baby at 16. She watched the baby while her daughter was in school, she was already watching her older son's kids while him and his wife were at work. But she was to come home right after school and be mom. She told them she would watch the baby the night of homecoming and prom but other than that, if they asked and she said no, just remember no is a complete sentence.", "Probably.", "Continuing a pregnancy and giving birth is *much* rougher on the body than any number of early abortions.  Of course BC would be better.", "Abortion is much safer than pregnancy", "The abortion pill taken early enough isn’t rough on your body. Pregnancy is rough on your body.", "My niece had an IUD when she was in high school. No worrying about taking a pill every day. I think she still has one now.", "I see thank you for clarifying.", "Not planning on being sexually active?! What the FUCK? She got pregnant at FOURTEEN & months later got pregnant AGAIN ? Do you still believe she's not going to be sexually active & not get pregnant again before she can, or will, care for the kid she has now?!\n\nedit to remove judgement cuz this is soo screwed up! OP, you've ruined any kind of childfree life for yourself for at least another 18 years. Step back! Let her take responsibility for her kid & stop letting her make you the mama of her kid", "the daughter *chose* to keep the baby, and is now essentially guilting her mother into raising the baby. \n\ni don’t entirely disagree with you, but actions have consequences. she chose to abort the first time, then got pregnant months later and wanted to keep it. welcome to the real world, kid. i’m all for as an adult doing everything possible to help, but from the post it sounds a lot like mom put her entire life on hold to work to support her daughter and grandchild, and watch the grandkid when she wasn’t working. while the daughter is either at school or our having fun with friends or boyfriends.", "And she needs to do like every other mom does, take your kid with you. And then have a rare time out when you pay for a sitter if you can afford it. This girl gets to go to school, no job, and gets to hang out childless with her friends all the time. That is no consequences", "Thank you for making me aware it was confusing. I didn’t realize until you mentioned it that it could be misinterpreted.", "I mean, you cannot force a teenager to take a pill every day, you cannot force an IUD or implant, and you can’t force an abortion or even adoption. These are all legally up to the daughter to decide.", "And you know this girl is going to expect to go off to college and leave the kid with grandma because she's never had to actually be the parent before", "I mean, if I had a kid who got pregnant twice I’d be giving the pill Nurse Ratchet style and checking under her tongue before she could leave the dinner table.\n\nI’m kidding, mostly. But while a parent can’t hold a kid down and force an IUD into them, they definitely have the right to exert a lot more control over their kids than this woman did. When the situation absolutely calls for it, of course.", "I don't know if that's true if she's under the age of consent", "It can be very strongly suggested, and if the child is not cognitively able to make good decisions for their own health the parent is allowed to override their decisions. There is a test for cognitive competence in minors to decide whether they understand the gravity of their situation. Clearly Lia would still fail this test at 17."]}