{"id": 1016, "submission_id": "yl0u92", "title": "AITA for canceling on my girlfriend to be with my ex", "selftext": "So me and my ex wife divorced about a two years ago, there’s no hurt feelings. It was a mutual decision, we have two kids together, maya and Cameron. \n\nI’ll be honest and say I don’t really like the schedule, it’s a fair 50-50 schedule, but I don’t like not seeing my kids all the time, ( yes before anyone comes at me I understand that that was what I was signing up for when I divorced, but that doesn’t make not seeing my kids and easier)\n\nSometimes me and my ex-wife will let our kids come over on each others time, if we have something going on. \n\nI’ve been dating someone for a few months, “Amy” me and Amy had a date last Wednesday , it was gonna be around six at a movie. \n\nAround 12 Pm kat (my ex) messaged me saying that she would be going on a date, and if I wanted to come grab the kids. \n\nI was glad because I wanted to see my kids so I said yes just give me a minute to start some things out. \n\nI then called Amy , and and asked her if we could reschedule, and I take her tomorrow on the date, and explained that I would like to see my kids. \n\nAlso know this is not a reoccurring thing, usually kat tells me a few days before hand, but it was last minute. \n\nShe got mad at me , ( especially for some reason when I said that I will be picking them up at my ex’s house ) and she said that I was blowing her off to take time out of my day *for* my ex. \n\nI tried explaining that that’s crazy I’m not going there to have a few drinks I’m picking up my **kids**  \n\nBut apparently , it was the same thing, and i was being very disrespectful to her by blowing her off to take time for my ex, and that I’m disrespecting our relationship. \n\nI told her that I really don’t get why she thinks that, because I’m literally going to pick up my kids. \n\nThis ended in an argument, with her saying “FINE” and then refusing to take any of my calls, I picked up my kids, she still didn’t answer me, I stopped trying, then when I stopped calling she starting texting me about how much of an ass I was and she was breaking up with me. \n\nI said ok but was I the problem here.\n\nI feel like I’m right here, I was getting my kids. I haven’t introduced them yet because I feel that it’s way to soon, I mean I get it could be disappointing but I don’t feel like it was that bad, I would’ve taken her the next day. I don’t feel like “being with my ex” was how it should’ve been taken. But it’s how she took it.\n\nEdit: one this wasn’t to satisfy kat, was it beneficial to her? Yeah, but I did it because I wanted to see my kids, if my kids weren’t involved I’d say no, for everyone telling me to just have my kids meet, we have dates for a SHY of 3 months, no. \n\nBad timing? Yeah sure\n\nI didn’t take my kids so she could go on her date, while maybe that’s what it seemed, again I want to see my children, would I cancel on Amy to go drive kat to her date? No. Wether anyone feels otherwise about it that’s not what happened. \n\nWether a partner will agree or not, if I get to see my kids, I’m most likely going to t, I’m not going to lie abt it. Well, maybe this is a bad time for a partner . Maybe that just means no partner at all. 🤷🏽‍♂️ oh well.", "created_utc": 1667476866, "permalink": "/r/AmItheAsshole/comments/yl0u92/aita_for_canceling_on_my_girlfriend_to_be_with_my/", "score": 135, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the asshole for canceling on my girlfriend last minute, to quite be with my ex,\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. There was no emergency and you see your kids regularly. Dropping everything sends a very clear message that your current partner's needs will always come second to your ex's whims. Do not expect to find many women who will accept that deal.", "Nta. Some people can’t take / understand single parents. Be careful when you’re looking for a partner\nbecause you will need someone who is good to your kids, not just you", "NTA. She doesn't went a man who is a dad first. She sees your children as competition & you being forever linked to your ex because of the kids as a huge problem. She's jealous of that connection. It's a good thing that she showed her ass this early & went ahead & ended things, because she would have been terrible with your kids.", "NTA - if she can’t accept that sometimes you will put your kids first, she shouldn’t be dating someone with kids", "My god, NTA. Dude if your post was “my ex offered to let me spend time with our kids on her visitation time, but I had a date with a person I’ve been casually seeing for a few months” everyone would be calling you the asshole.\n\nYou’re a good dad", "YTA\n\nYou cancelled last minute on a date with your girlfriend so your *ex* could have a date night instead of you and your gf.\n\nTo you, you see your kids. To her, you’re dropping her last minute to support your ex’s poor planning for her entertainment. She didn’t call you to cover a work or medical emergency.\n\nHow many ex wives do this on purpose?? Loads and loads.\n\nThis is why I personally won’t date anyone with any children ever again. The children are turned into weapons to hurt the new partner, and the new partner is crazy for expecting respect and decency.", "This is not someone you can date. She doesn't understand that your first priority is your kids.\n\nNTA.", "YTA, and so is your ex.\n\nI get you wanted to see your kids. But it was your wife's time with the kids AND you had a date planned with Amy. Blowing her off so your ex can go on her date is massive AH territory. She was right to be mad with you, I would be too.\n\nAnd before anyone says the kids should come first: tell that to his ex who dumped the kids on him the moment it was more convenient for her than rescheduling her date. And no she didn't strongarm him into it. She merely used the fact he wants to see his kids as much as he can as a form of leverage.", "Nta your kids come first no matter what.", "YTA for not having communicated what your priorities are in the last 6 months that your kids come ahead of her. \n\nShe has every right to be upset that you cancelled your 6 months without notice.\n\nYour reason is legitimate based on your values. She should know going forward that if it is a choice between the two it will be your kids.", "NTA. Your girlfriend is immature and not understanding situations like this is a red flag. She doesn’t sound like someone you want to add to your coparenting situation.", "NTA. Your children should always come first. You should make sure to tell your next gf that so that she understands that.", "ESH.  Yeah, okay, sure, maybe Amy could’ve been more flexible.  She certainly didn’t have to make this about your ex.  But I don’t know why you’re trying to pass this off as a one-time thing when clearly you *will* just drop everything at a moment’s notice if anything involving the kids is involved, even though it wouldn’t have killed *you* to tell Kat you already had plans and she needs to give you more advance notice, either.  And while I’m not going to tell you the kids shouldn’t be your priority, you’re going to have a hard time dating if your dates never know exactly when you’re going to follow through on your existing commitments to them.", "NTA - However, suspect she probably had something special planned, maybe even bought a new outfit for it.", "I’m thoroughly convinced anyone writing YTA is NOT A PARENT. So don’t listen to any of them.", "NTA. This person was going to become an issue later anyway because she didn't understand that your kids will always come first. Best for her to show her ridiculous attitude this early so you can make a clean break.", "NTA … and I would take this as a huge red flag and get rid of her. She’ll constantly push to be more important than your children. She isn’t ready for this dynamic, and she isn’t worth your time", "NTA. Kids always come first. Red flag on the way she reacted.", "NTA.  I get why gf was annoyed but her making this about your ex instead of your kids puts gf into AH territory.  She can’t handle how you coparent and that’s ok.  You’ll find someone who will.", "YTA.  You ditched a date with your gf so your ex could go on a date.  \n\nLook, I get your children should be your priority.  But it was your ex's custody - simply she wanted to go on a date.  You already had plans, and ditched those plans.  There was no emergency.  There was simply - your ex wanted to go on a date.\n\nYou made it very clear your gf (now ex-gf), that she would never be even a partial priority.  Because again, this was not any type of emergency at all.", "YTA. You cancelled your date so your ex could go on her date. It’s nothing to do with the kids, it’s basically telling your gf that your ex’s dating life comes before yours. Did you tell your ex that it was awkward as you have a date too? It was only a date. Why couldn’t ex move her date to the next day? To me, this isn’t about putting your kids first, it’s about the daft reason for cancelling. And now you’ve made gf look like a monster who doesn’t want you to see your kids, rather than someone who just doesn’t want you to cancel for bs reasons. If it was an emergency situation I’m sure it would’ve been a different story.", "NTA. I've been in that position and there is NOTHING that I value more than time with my children. I'm happily married now but we are all aware that regardless what happens, the children come first, and if you're asking me to spend time with you OR spend time with my babies, it's them every time. If you don't like that, find someone less involved.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo me and my ex wife divorced about a two years ago, there’s no hurt feelings. It was a mutual decision, we have two kids together, maya and Cameron. \n\nI’ll be honest and say I don’t really like the schedule, it’s a fair 50-50 schedule, but I don’t like not seeing my kids all the time, ( yes before anyone comes at me I understand that that was what I was signing up for when I divorced, but that doesn’t make not seeing my kids and easier)\n\nSometimes me and my ex-wife will let our kids come over on each others time, if we have something going on. \n\nI’ve been dating someone for a few months, “Amy” me and Amy had a date last Wednesday , it was gonna be around six at a movie. \n\nAround 12 Pm kat (my ex) messaged me saying that she would be going on a date, and if I wanted to come grab the kids. \n\nI was glad because I wanted to see my kids so I said yes just give me a minute to start some things out. \n\nI then called Amy , and and asked her if we could reschedule, and I take her tomorrow on the date, and explained that I would like to see my kids. \n\nAlso know this is not a reoccurring thing, usually kat tells me a few days before hand, but it was last minute. \n\nShe got mad at me , ( especially for some reason when I said that I will be picking them up at my ex’s house ) and she said that I was blowing her off to take time out of my day *for* my ex. \n\nI tried explaining that that’s crazy I’m not going there to have a few drinks I’m picking up my **kids**  \n\nBut apparently , it was the same thing, and i was being very disrespectful to her by blowing her off to take time for my ex, and that I’m disrespecting our relationship. \n\nI told her that I really don’t get why she thinks that, because I’m literally going to pick up my kids. \n\nThis ended in an argument, with her saying “FINE” and then refusing to take any of my calls, I picked up my kids, she still didn’t answer me, I stopped trying, then when I stopped calling she starting texting me about how much of an ass I was and she was breaking up with me. \n\nI said ok but was I the problem here.\n\nI feel like I’m right here, I was getting my kids. I haven’t introduced them yet because I feel that it’s way to soon, I mean I get it could be disappointing but I don’t feel like it was that bad, I would’ve taken her the next day. I don’t feel like “being with my ex” was how it should’ve been taken. But it’s how she took it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I hope she finds a guy without kids instead, because she seems to have trouble understanding that she can’t come before them.", "ESH. You had plans with Amy and canceled on her to spend time with your kids. This wasn't an emergency or anything you could have told your wife you had plans as it wasn't your night.   \n\n\nWith all that said Amy needs to understand dating a single parent isn't easy and compromises need to be adjusted for. She was right to break up with you. This was not a situation where being a Dad comes first.", "ESH\n\nYour ex should not be making date plans on her time to care for the kids. If she does she should not be approching you for childcare.\n\nYou should not be blowing off your plans for a date with your gf so that your ex can have a dates. You had plans first. You are putting your ex's needs above your current partners. If it was a an emergency like someone was in the hospital it would have been different.\n\nYour Gf although justifiably pissed should maybe take the kids on a playdate instead of escalating the situation.", "I get that you want to spend time with your kids - good parent! No sarcasm - but you blew off your current partner in favour of your old one at the last minute. It wasn't an emergency or something otherwise crucial, and instead you showed her that your ex is more important than her. I think you're incompatible, which is no one's fault. But for how you handled this, **YTA**", "NTA, although you do need to see some boundaries with the ex. I understand that you see a chance to spend time with your kids and you jumped on it, that's awesome. I also understand that not having your kids meet this woman you were seeing-also awesome, it is too soon. If you let the ex wife do this is nasty become the norm to her that you'll drop everything on a whim though. Had you been seeing this woman long enough that you could all spend time together this wouldn't even be an issue. Big red flag on the girlfriend's part that she's supposed to be a priority already. I can almost see her side, and it's within her rights to not want a relationship with you over this as maybe she thinks this will be the norm. Had you not told her it was so the ex could go on an a last minute date and she still responded this way you're better off without her. I understand you want more time with your kids, just don't let the ex wife use that against you.", "I'm sorry to disagree with everyone here but YTA, you had plans before your ex wife did. You prioritsed your ex over your current GF. Your kids have nothing to do with this. You've only been dating Amy for a few months and this very early impression of you shows you will pick your ex's happiness over hers. If you had said no, your ex would've had to reschedule, your kids would not be left to fend for themselves, so stop using them as an excuse.", "Nta. You dont have to be sorry you had an opportunity to spend time with your kids and took it. She wasnt the one for you. You found out that you were on two different lifestyle paths early on so no damage done. Continue to take every opportunity you can to spend time with your children. The right partner will be there with you not making you choose between them and your kids.", "NTA this isn't the one for you,  break it off now. Find someone mature and secure enough to deal with your obviously awesome coparenting situation.", "NTA. It sounds like the ex was offering him an extra chance to be with the kids, rather than using him as a sitter. It is a tough one, because who wants to hear that they will always be second to someone's kids?", "Definitely NTA. Your kids are obviously your first priority and rightly so. Anyone open to dating a person with kids has to understand that just because they're divorced doesn't mean they never see their ex.", "Nta. But your title is so wrong.", "NTA. My husband had kids before we met. I never once reacted like this to him going to see or get his children. Your gf showed her true colors when it comes to you having been married before and having children. She seems like she would try to get you to take your kids less than your agreed time just so you can spend more time with her. I’d dump her and move on.", "NTA and good lawd her skin is thin. She should not date a man with an ex and kids if the whole thing makes her uncomfortable. My boyfriend lived with his co-parent and child the first year and a half that we were together and while that was hell-ish at times, interfering with or giving grief about his fathering just didn't really come up. except for this one time, he cut our date short because his son \"requires popeyes\" and he left to go get it for him---but that's a story for a different thread......\n\nNTA, OP. I think you and your new lady need to have a thorough discussion about expectations, hard feelings, and your relationship.", "NTA. I think it’s great that you’re putting your kids before your girlfriend. That shows me your priorities are in order, which you don’t see often. You’re probably better off without someone like Amy in your life.", "Your kids are your priority. She wants to be your priority. These things are hard to reconcile, but not impossible. Doesn’t sound like you are handling it gracefully yet. \nIt was rude to cancel plans last minute, dating someone with kids from a prior relationship is not easy, the kids normally come first over the new relationship. Not everyone is going to be ok with that or understand it. This is one of the challenges dating if you are divorced with kids. \nYou are NTA, but you are going to have to find a partner willing to put up with being dropped last minute……", "ESH, your ta in Amy’s eyes for cancelling on her. Your super dad in your kids eyes for spending more time them. I’m too lazy to read through all the comments but has Amy met your kids yet? If not, cancelling on her (without inviting her to come hang out) should have had a “if things continue to go well between us , I expect to introduce to you to my kids ______(whatever is in your head as a time line)”\n\n\nHonestly it sounds like Amy quit listening to you, went with her gut feeling and didn’t listen and continue to let her emotions ride roughshod over her, cuz you sound like NTA\n\nBullet dodged if that’s the case", "NTA, don’t take your now ex Amy back. If this is how she’s reacting to you being a responsible dad and wanting to spend time with your kids imagine how entitled she will be if you ever marry her . I think you know this as you didn’t try arguing back or tried to “convince her otherwise “ . Take this exit route and tell Amy shes the AH who can’t see that you’re trying to be a great dad . Don’t parent her she needs to learn how to share on her own.", "NTA kids come first, if she can't understand that then it's probably a good thing you guys broke up.", "NTA", "YTA.  I'm divorced with a kid myself.  Wanting to take some extra time with your kids is great, and I totally get it, but why didn't your ex let you know earlier? I think it's great that you guys have this kind of relationship, but 24-48 hours notice would be considerate.  Your established plans should take priority over your ex's impulsive requests.  This situation sounds like your ex manipulating you to make sure you're at her beck and call over the kids.  That's the thing that I think makes YTA, and makes your gf smart to break this off.  Setting boundaries with your ex in non-emergency situations is going to make this good situation better in the long run.", "NTA.  Your kids should come first. Sounds like you need to dump her. She is acting like a child.", "NTA. \n\nSounds like Amy is not ready for a man with an ex and   children.  Good for you for putting your kids first and having an amicable relationship with your ex.", "NTA - You said you've been dating this woman for months. Obviously your kids are an important part of your life unless you've never talked about them. If you're serious about this relationship maybe make more opportunities for her and your kids to spend time together. Lol literally take her with you when you pick up your kids. Make her see that being with your kids is literally a part of your life and see if she accepts it.", "YTA. In effect, you canceled your date to facilitate your ex’s last-minute date.\n\nI can see why you did- more kid time- but you did prioritize your ex’s date over your own.", "YTA - you had a commitment that you chose not to keep at the last minute. I get it, you went to spend time with your kids, so schedule it like everybody else. It’s incredibly rude to cancel plans at the last minute for non emergency reasons. Amy could’ve planned something else for her evening had you been more thoughtful. She also knows that you are unreliable now.", "NTA. Unless I missed some details I’d have to say that your title is incorrect. It should read “AITA for canceling on my GF to be with my kids”", "YTA it was your ex's time with the kids, if you both have plans surely the person who has scheduled time with the kids should move their plans?", "NTA!\n\nOP this woman sounds crazy and you are probably dodging a bullet by her breaking up with you. Your reasoning for rescheduling the date is very reasonable and she is being very insecure and possessive by getting upset about this. This woman sounds like the type who could jeopardize your co parenting and even your relationship with your kids.", "ESH.", "NTA your kids should come first and a supportive partner would be more than okay with that.", "ESH", "Dude, this isn't about your ex. This is about the shitty schedule. \n\nIf everytime your ex use you as a sitter and you cancel on your GF, I totally get it.\n\nYTA and you're going to stay single for a very long time.", "NTA, anyone that says differently doesn’t understand how being a parent works. You dodged a bullet. If this was a regularly occurring thing, sure, it would be a problem. But it wasn’t. You did the right thing and ending things was also the right thing. She’s not ready to be with someone with kids.", "NTA. When you date someone with kids, you understand the kids always come first. You didn’t cancel on Amy, you wanted to reschedule. You offered an actual date to reschedule to (people who don’t want to actually reschedule leave it vague).\n\nAmy’s the asshole here.", "Soft YTA.  You blew off your girlfriend.  She has a right to be upset at your cancelling plans with her, just a few hours notice \n\nHowever, understandable about wanting to spend time with your kids. \n\nThis would be an issue with any girlfriend you may have - it is not respecting them if you blow them off.   You’ll need to find a better balance of your time or endure girlfriends know up front thst you miss your kids and any opportunity you have to spend with them, you’ll want to include them in your time and that may mean sometimes they’ll be included in plans last minute.  BUT this does not mean blowing them off.", "NAH. \n\nYou chose to be with your kids at the expense of a scheduled date with your girlfriend. Perfectly understandable. \n\nYour girlfriend doesn’t want to date someone with higher priorities. Also perfectly understandable.", "YTA - you had plans and you blew her off. \nIf it was for an emergency sure but this wasn’t.\nYou’ll never have a long term relationship if this is your attitude, that the woman in your life don’t matter in the slightest.", "ESH - Your girlfriend over reacted, but you blew her off so your ex could go on a date. You may feel otherwise, but that’s what happened. You both had dates that night and she could’ve rescheduled her date or hired a sitter.", "I can't call you TA for putting the kids as your no1 priority.\n\nSucks for the current gf but I think it's unreasonable for her to expect to be a priority over the kids. Especially considering that's you're only dating for a few months.\n\nNTA\n\nEDIT: a lot of people are saying that he cancelled on his gf so \"his ex could go on a date\". no, he cancelled because he saw an opportunity to spend more time with his kids. the ex going on a date thing is irrelevant.", "NTA, but you need to be up front with a new partner so they know what to expect in a kids vs. girlfriend situation. That way, she can nope out early if that isn’t going to work for her.", "NTA. I would say no-one's the asshole, because most people don't realise going in how much more complicated it is trying to be intimate with a single parent, but she was unreasonable and egotistical. It's fine to not be able to handle the reality of not being someone's #1, but it's not fine to react the way she did.", "YTA You could have had it all. \n\nYou could've told your ex wife you can't today but you can take the kids tomorrow and it would've resulted in \n\n1. Having an extra evening with your kids just one day later. \n\n2. Could have had the date with your gf today. \n\n3. Respected your gf’s time (what does “I can take her tomorrow” mean? Did you even ask if she had plans for the following day? She is not an object you can take off the shelf when it fits your schedule)\n\nInstead you cancelled on your gf so your ex could go on a date. Why not make HER switch evenings? Why does your gf have to switch around her schedule for your ex’s poor planning? \n\nIt would have taken NO extra time with your children away. This is not about wanting to spend more time with your kids. This is about letting your ex get away with what she wants and making your gf pay for it.\n\nEdit: typos", "NTA. But your title is misleading- even you’re suggesting you canceled on your girlfriend to be with your ex, but you canceled on your girlfriend to be with your kids, right? Just curious how you phrased this to Amy since you wrote the title as if it was about your ex with no mention of kids.", "NTA. she got mad at you for wanting to see your kids?? Any person in her situation who does not want their partner to see their children is bad news", "NTA - You kids come first, always. Your girlfriend knew what the situation was when she started dating you.", "I think NTA, u want to spend time with ur kids and at the end of the day ur relationship with them is the most important, especially if u were offering to make up the date. ur a decent father for wanting to spend time with them and surely she knows she's dating a father? when dating someone with kids u should always expect the kids are gonna be top priority so NTA", "ESH. You have every right to see your kids whenever you can, but to cancel your date last minute so your ex can go to hers is a little AH-ish, just a tad though. She shouldn't have reacted like that at all and what's she said is 100% unfair on you but why was your exs date more important than yours that you have to cancel yours?", "Nta, I think the both of you just have different priorities. Dating parents isn't for everyone and I think Amy is realizing it's not for her.", "NAH\n\nI can understand you wanting as much time as possible with your kids, I can also understand why that made her feel dismissed and unimportant.\n\nShe realised she’ll always come second place to them and that she doesn’t want that. Breaking up is a logical decision.", "I want to say NTA but i think i may have to go with ESH… Amy was completely in the wrong for blowing up on you like that and getting mad that you wanted to go and pick up your children considering they are literally your flesh and blood, they should come before your new girlfriend. But i also think you should have asked her if she wanted to move your alone time date to the next day and maybe offer to take her and the kids on a day out and introduce them. I understand it could be too early but you are obviously a big part in your children’s life and they should have the right to meet and know about your current relationship situations as she may have been a potential step mother.", "NTA", "NTA, kudos to you for being a great father to your kids. If the woman you are dating is like this while you’re dating, imagine what she would be like once you guys are official. Dodged a bullet with this one.", "YTA because such things should be discussed in advance. Was it the last minute date your ex found out? Or she knew she'll be going on a date earlier yet said nothing about the kids? And yeah, this situation isn't an emergency, so you have no other choice. Yeah, you're a good father but not so good of a partner. Your gf has every right to be upset because of this", "NTA and you’re dodging a huge bullet. This woman is never going to understand the rational, level-headed decision of putting your children first. She will compete with them and try to lessen your relationship with them. Why people like this choose to date people with children, I will never understand. You’re better off.", "NTA. Your children will always be at the top of the priority list.  If Kat is not mature enough to handle that, you are better off finding that out early, rather than further down the line when she has opportunities to damage your relationship with them. \n\nMake sure your next one is more accepting.", "NTA\r  \n\r  \nThese are your children, who will always come first. You're with a woman who wants to be number one over them and is angry that you chose them over her. \r  \n\r  \nIf she really did break up with you, good, bullet dodged as that's not a woman you really want around your kids. She will resent them for taking your attention away from her and they'd be fully aware of this. I bet her saying she was breaking up with you (through text no less) was her way of trying to get you to beg her not to. She sounds manipulative on top of everything else.", "If it was your day to see your kids then NTA. In this instance you sir, are a massive AH.\n\nYou literally dropped everything to accomodate your ex. Look at it from her perspective. It’s a new relationship. You made plans. And then on the day you cancel.\n\nI get that they are your kids but you had a prior commitment. They weren’t sick. They didn’t need rescuing. You did this to please your ex and yourself with no regard for your soon to be ex girlfriend. Bad pattern and precedent to set. Her needs and feelings are expendable. She has no chance of being any sort of priority.", "ESH - Amy shouldn't have taken it personally when your kids came first (because they should, part of dating someone with kids) but, it wasn't an emergency, like a car breaking down or a work disaster that she needed to handle. your ex had a date.  she should have given you more warning or rescheduled since you ALSO had a date.", "NAH. Your ex asked, you said yes, and your gf is probably gonna dump you.", "NTA. I don’t think it’s unreasonable to ask someone to reschedule a date for that, especially if it’s not happening all the time. If Amy can’t handle something like this, how is she going handle you co-parenting in the future? I’d say that’s a big red flag.", "NTA.\n\nSounds like the breakup needed to happen if she wants to consider herself more important than your kids after only a few months.  I honestly think your kids should be more important than any mere girlfriend and perhaps AS important as anyone you might marry in the future.\n\nI think you lucked out with the break up, honestly.", "YTA if you dont have time for a relationship because you have to be on call for your ex then dont date.", "NTA. Your kids come first, full stop. Anyone who tries to place a wedge between you and your kids would not be a good stepparent.", "NTA. Better you find out now before things get too serious. Co-parenting is a beast and it sounds like you and ex are champions at it.", "YTA because you blew off your gf. That was wrong", "ESH.", "NTA", "Look i have no qualms about you wanting to spend time with your kids. However, custody agreements and schedules are a thing for a reason. It keeps like consistent for the kids - it gives the kids, and the parents, a sense of structure. \n\nWhat i do have issues with is you dumping your date just because your ex wife has a date and didn’t want to get a sitter. That is what your girlfriend saw when you rescheduled your date the day of. She saw you setting her aside so that you could allow your ex wife to go on a date. Had it been a scheduled time for you to have the kids, there wouldn’t have been an issue. \n\nSo for that reason I’m going with ESH. You and your ex wife need clear and consistent rules about the custody agreement. Your girlfriend sucks because she blew it a bit out of portion but some people aren’t meant to be step parents and that’s alright. Some people are meant to be involved with someone who has kids.", "NTA you aren't canceling on your GF to be with your Ex your canceling on your GF to be with your kid.", "NTA", "NAH\n\nYour GF wanted you to put her before your children every time there was a choice. That was her right. Her being upset and deciding that she isn’t happy with being second to your children is fine. \n\nThe two of you have different priorities, no one needs to be an asshole here.", "Your ex could have gone on her date the next night. Why do you have to rearrange *your* date to satisfy your ex? I think that is the point your gf wanted to make known. For that YTA.", "NAH. Cancelling plans last minute wouldn’t sit right with me either unless it was an emergency. But You’re allowed to choose your kids over your new girlfriend. You’ve broken up already so you’re ahead of almost everyone else on here", "Saying this as a single mom of the better part of 20 years: your relationship with your kids is your #1 priority in life. \n\nAnd, if you're really lucky, and smart, like you were in this scenario... that reality is going to weed out a LOT of potential romantic partners from developing into long term relationships. And that's a GOOD THING. \n\nIt's not fun, it's not easy, but it's very simple... your kids come first, and people are going to, on the surface, give a lot of lip service to how wonderful that is, how they admire you and respect you for being such a wonderful parent, yada, yada, yada...  but the minute they get inconvenienced by your actual ACTIONS of putting your kids before them? Oh, the true colors finally show.\n\nThis one knew you were a single dad... probably blew sunshine up your ass over how attractive that is, so loving, so caring... but that was because she wanted that goodness all directed AT HERSELF. \n\nA quality you need to find in a partner is that they REALLY GROK that, until they are adults, your kids are always #1... and it doesn't offend or upset them, that they are adult enough, mature enough,  to recognize that that is always going to be your priority, in all things, big and small. And you will know this ny little tests of life, lime this one, that come up. \n\nYour kids are gonna be the reason a lot of trash ends up on the curb. Let it go. This is the season of your life of parenting, and it's not forever, but it is The Good Old Days for you and for your children.  It's worthy of the honor, and sacrifice, and investment of all your time, love, and attention.\n\nNTA. 100%", "It's a bit ESH, she shouldn't have blown up at you but she could see this as you ditched her and your date to let your ex go and enjoy her date therefore ditch her for your ex. \n\nKids complicate things and you and your next partner should be on the same page around priorities.", "On the surface this sounds like NTA, and I’m sure everyone will agree saying “put your kids first”, and that your girlfriend is being possessive, jealous, etc…\n\nBut I’m wondering if this is a straw that broke the camel’s back.  You say this is the first time *this* happened, and yes, there’s expectations that my partner’s kids come first, but I don’t always want to feel second either.\n\nFirst time this happened?  She’s the AH.", "NTA. Your exwife was going on a date, not planning to spend time with you. Your girlfriend does not understand how much you miss your children. It is understandable she is disappointed but a bit exaggerated. You seem to be at different places in life.", "NTA. Kids come first! Ditch the girlfriend. She cannot date a guy with kids with this kind of attitude. Has she met the kids yet, how is she with them?", "NTA. She probably would have always been the sort to try to get between you and the kids and not understand being civil to your ex. The kids come first and I don't think she would understand that. She saved you a lot of pain.", "NTA. When you date someone with kids you have to accept that the kids come first. Amy is making it clear that your kids aren't a priority in her mind...think on that.", "Dump the gf, kids always come first. NTA", "NTA---Because your kids will always come first...BUT it sounds like you are too busy to date right now, seems like you have your hands full.", "ESH\n\nIt's not just about that. Y'all had plans, but you didn't value her. You could've even proposed doing something at home.\n\nThat said, she seems unreasonable, but who knows what else has gone on to make her feel uncomfortable about this", "NTA", "NTA. \n\nI am single & don’t want kids. When I’m dating someone who has kids, I know the kids always comes first. That’s just how it is. To me, you putting the kids first shows how great of a dad you are. Why wouldn’t I want they qualify in a person I’m dating? \n\nThis is a red flag. If she already has a problem with this, it’s only going to get worse.", "NAH\n\nAmy just learnt the first lesson of dating a parent. Your kids are your priority, you will blow anything off for your kids. \n\nAmy has only just realise that. It’s a hard pill to swallow, to realise your not your love interests priority. Doesn’t mean she isn’t important, doesn’t mean she won’t grow to equal importance, but she won’t be the priority until those kids are independent and grown. \n\nI think it’s probably for the best that you have broken up, your lifestyles are not compatible.", "NTA! \n\nYa’ll.  OP prioritizes his kids over this relationship. That is *not* a bad thing nor unreasonable! This gf is a three months dating and his kids are ummm… his KIDS. Of course time with them can be a priority! Sounds like his ex would do the same for him so I don’t think OP is even sucky for last minute taking the kids. \nI get why the girlfriend could be bothered by a last minute cancellation but taking picking up the kids & hanging with them instead to be “time for the ex” is super wacky. She’s the only asshole. Sounds like OP, his kids, & his ex are all pretty healthy relationships actually.", "NTA-kids trump gf or bf.", "NAH.\n\nYou aren't, I don't blame you for wanting to see your kids, but at a certain point you will have to decide on how to integrate a new relationship (romantic) into this existing relationship (parenting) and understand you might have to change priorities. JUST LIKE YOU EX HAS JUST DONE!\n\nYour ex isn't either. She didn't expect you to take the kids, she just asked if you could. If you said no, she presumably wouldn't have gone on the date or would have found someone else.\n\nYour (ex) gf isn't either, since she has a reasonable expectation that you prioritize her, especially since you canceled a date at the last minute.\n\nShitty situation, but make sure to read what is in all CAPS again.", "So I want to tell you that of course you should put your kids first always, but given the reason why you cancelled and how oblivious you seem to be as to why Amy would be upset, YTA. \n\nYes, your kids come first and you are struggling not having them all the time. You should cancel whenever there is an emergency, an event for your kids, or if your kids are just having a day and want to see you. \n\nBut, even people who have their kids 100% of the time make and keep plans with other adults in their life. Your ex gave up her own time with the kids to go on a date, and I'm not even judging that because dating and just adult interaction is important for parents. \n\nI am saying YTA because you seem to not understand why a woman you are dating, who already gets limited time with you- for very valid reasons- is upset that you cancelled on her so your ex could go out on a date. If you want to date and have adult relationships, you have to set some boundaries with your ex, and with yourself. If you are unwilling to keep plans when there is no emergency, just a conflict on your ex's parenting time, I don't think you are going to find a romantic partner at all. \n\nAnd I don't think Amy handled this particularly well, but I think that is because when she pointed out that you were cancelling your date with her so your ex could go out on a date, you held on to \"but this is about my kids!\" and in reality, it isn't. Amy hears loud and clear that you will accommodate your ex- and her dating life- over plans you made with her. \n\nThis is a kind YTA because you sound like an awesome dad who is trying to move on and also be super involved, and you deserve to find a partner, but stuff like this will drive even level headed partners away.", "YTA, you should not be dating without explicitly informing partners you will ditch them with mere hours of notice to hang out with your kids while your ex goes on a date or runs errands. That’s fine if that’s your prerogative but it’s not fine to assume your partner knows “kids come first” means having dates canceled because your ex didn’t hire a babysitter. \n\nIf you will do that every single time the opportunity arises (and it sounds like you intend to), you should only date fully informed people who agree it is reasonable to never have a set date with you. And don’t get cute and ask about emergencies, surprise kid events or sick kids or any of the actual “kids come first” stuff that is typical. What you did was not cool. \n\nAnd yes, I was a single parent for several years so I actually do get missing your kids after divorce. I also get being considerate of others’ time and six hours of notice for a non-emergency is just rude unless everyone is aware it’s a possibility from day one.\n\nShe was fine to dump you because you two are not compatible. It’s pretty crummy to watch your partner ditch your date so his ex can enjoy her date. You are thinking of the time with the kids but you should have some sensitivity to how your partner felt. I’m sure she was shocked to suddenly be sitting at home while a woman you divorced gets to be out because of said ditching. Be very clear with your next partner and explain this exact scenario as an example so they know.", "NTA. Anyone you date needs to understand they’re not just dating you. You are a package deal with your kids, and they will always come first, as they should. Amy just wasn’t up to date someone with children. Hope you eventually find someone who is, if that’s what you want.", "Hm. I was leaning towards N A H, but honestly I think I’m gonna go with YTA. You have 50/50 split custody, there is zero reason that your ex wife shouldn’t have been able to find a sitter or just ask you earlier in advance. It’s weird that you rescheduled your date so that she could have one. She asked you last minute, so you decided to cancel your plans with your girlfriend. This was not an emergency, this was your ex wife going on a date night. You girlfriend has that right to be upset and the right to dump you.", "Nope, it sends the message that his KIDS will always come first, which is exactly how it should be.", "I don't think the current partner will come 2nd to ex's whims. They'll always come second to his kids, though. As it should be. This had nothing to do with the ex. It was always about the kids. Kids were there first and should always come first. It's best whatever partner he has knows that from the beginning and get to stepping if they can't handle it. Op is doing exactly as he should.", "Imo NTA, it's totally natural to want to see your kids. \n\nIn my experience kids ALWAYS come first.\n\nNTA because OP puts his kids first, but he needs to communicate better with his next partners and set boundaries with his ex wife and custody", "And she can't separate the kids from the ex in her mind, which will 1000% lead to other problems later on.", "I mean I hear what you’re saying because communication is key but yes his kids should absolutely come before her why wouldnt they they’re his kids and she is a gf of a few months that hasnt even met them yet. It would have been good to let her know though that anytime he has the chance to see the kids when its not his scheduled time he will take it even at the last minute.", "I don't think it's necessary to communicate that your children come before everything else. That should be expected. They are his kids and she is a person he has been dating for a few months. There is no contest there in priority.", "Isn't it a given that a person's children take top priority in their life? She shouldn't be dating someone with kids if she isn't okay with that.", "I disagree. If I date a person with kids, I’d love and prefer them to pick their kids over me. Especially if we’ve only started dating.", "She can wear it for the next date. If OP doesn’t dump her.", "This exactly! I could understand if the ex suddenly had a sick relative or had to work unexpectedly but you basically just told your (soon to be ex) girlfriend that your ex's dates were more important than your own.  YTA\n\nEdited to add: Obviously I understand that you wanted extra time with your children but it sounds like you need to establish better boundaries/communication with your ex over what constitutes a last minute change in arrangements otherwise you're going to find yourself sitting home alone 'just in case' you get a phone call and that's no way to live!", "lol you’re funny thinking he’s TA", "I wonder if the ex even knew he did that. I wonder if she would have asked if she knew he had a date.", "Nah, this reads like he’s desperate to spend any extra time with his kids at all. Ex could have had emergency hair brushing for 10 hrs and OP would have been like, “Solid - have fun. Can I get the kids now???” OP is a soft AH bc this sets up the precedent that he will ditch GF if any opportunity arises with more FaceTime with the kids. He needs a better schedule with his ex on the kids so he’s not so desperate for time with them.", "He canceled the date so he could SEE HIS KIDS.", "In most custody orders there’s a clause called first right of refusal. It means if you can’t care for kids for X amount of time on your custodial time, you must offer the other parent to take the kids before you can seek a babysitter. This means, get a date, offer kids to dad, he says yes, he gets them. If not, you get babysitter. Most active parents are going to snag that time. Doesn’t mean mom wouldn’t have still gone on date, getting a babysitter, if he’d said no. She just offered the time to dad first. Don’t see anything malicious from mom and definitely not dad. \n\nNTA", "Being a dad and spending time with your kids ALWAYS comes first emergency or not. Being a dad ALWAYS comes first. Sorry not sorry.", "He’s not hanging out with his ex. He’s hanging out with his kids. He did blow the girlfriend off but for his kids, not his ex. And yes his kids are more important than her.", "did kat write this?? this is rule #1 of dating with children. the kids always come first. the man loves his children and wants to see them, and kudos to him for it! many dads don't do this. keep doing your thing OP!", "Bro, those are his kids. He said he wants to see them more. He could have said no but he wanted to spend time with them. He’s only been dating his gf for a few months. Those are his kids. It would have been great if his gf would of  been like yeah it’s no problem. Seems like the current gf thinks he’s doing it to help his ex but he just wants to spend time with his kids.", "That’s part of parenting. Even when the kids are your own, you’ll be coming in second a lot. If you aren’t mature enough to handle that, you’re at different life stages.", "I think the question here is would OP's ex just have gotten a babysitter if OP said no?\n\nIf she was relying on him to take the kids it's one thing, but if she was offering him the chance before grabbing a sitter, that's another.", "No he prioritized his kids over his girlfriend he's only known for 3 months. \n\nGood on him for knowing his priorities. As to the girlfriend, there are things that come with dating a single parent and she shouldn't be offended by him being given the opportunity to spend more time with his kids. If they had continued dating for longer, she could have joined them on nights like that.", "If the ex said “you need to take the kids or I can’t go on a date” that’s facilitating. \nIf he said no, the ex could’ve had a sitter ready. \nAnd he choose to spend more time with the kids, that’s being a dad.", "this is such a gross take. if he was rescheduling for pretty much any other reason, sure! but he was picking up his kids to spend time with them. if you choose to date a single parent, you should expect that to happen sometimes.", "I wouldn't say he's TA, but he should've compromised. The gf is kinda an ah for her reaction.", "You cannot be a sitter for your own kids. The other parent should be the first you contact in this kind of situation.", "I agree with your take, though it sort of seems unpopular on this post. My parents did co-parenting relatively well (my dad suffered from serious mental illness so a lot hinged on his state of mind) and if either of them had something come up during their time they offered the other parent the option to have first “dibs” on babysitting. OP doesn’t mention that the ex had no other options for care and they wanted the opportunity to spend time with their kids. So for me it is NTA. I kinda get the girlfriend being mad but if they were my partner I would respect their priorities.", "Exactly.\n\nI get that kids are a priority and that OP is a dad, *but his ex is also a mom*.\n\nI'd worry about OP's boundaries with his ex if he's so prepared to drop everything because she couldn't be bothered to plan her dates better. \n\nHer dinner and a movie are not an emergency and could have been re-scheduled. *OP had made a commitment to his GF*. *We have no idea if his GF could re-schedule or not*.\n\nOP's girlfriend deserves better and *OP really shouldn't be wasting her time if he can't me her A priority in the slightest*.", "All of this ^^ but would also like to add that I would have been upset too, not because you're spemding time with your kids but because your ex said jump and you said how high. I don't think it has anything to do with the kids, it's the fact that your ex wanted you to do a thing and you RAN to do that thing. Doesn't matter if the thing was watching your kids or building a bridge, you still dropped your current gf to do a thing for your ex", "Scenario: the wife says “no, you can’t have the kids tomorrow, bc we have plans, they have school, etc.”", "Never introduce a kid early. Ever. It could create a lot of problems if you haven’t sorted out your feelings and relationship with that person. That person may never want to be a step mom. Everyone I know who met partners early has a bad or sad story. The person is either a really awful fit or you get attached and they break up - which is so so messy. They have a right to meet someone after you two get your ish together. The kids can know you’re dating and you ease them into everything else.", "Absolutely not introducing my kids to a person I’ve known for only a few months.", "This, you cancel a date so your ex can go on a date. WTF.", "Is it that hard to believe that he’d want to spend an extra day with his children?", "I don’t think his ex needed him to watch the kids (babysit) so she could go on a date. He wasn’t throwing over his girlfriend to do his ex a favor. It was that she’d be out so he could spend the evening with them if he wanted. \n\nAlso maybe his ex didn’t give him more notice because her plans were last minute.", "He’s not an on call babysitter for his ex.\n\nNo where does he say the ex made any demands or said he had to take the kids.\n\nIt sounds like she simply gave him an option to spend additional time with HIS kids, which is what he says he wants.\n\nAnd fathers are NOT babysitters", "I would hardly call this babysitting, and more so being a parent. But pop off. Also, NTA OP, sounds like you dodged a bullet with Amy.", "That’s a bit extreme tbh.", "This is dumb. She's his GF, and had only been so for 3 months. He didn't blow her off, he was trying to reschedule for the next day, so he could hang out with his kids.\n\nIf you aren't down for that dad life, don't try dating a single dad. The kids come first. If she was a quality woman, she should've obviously been disappointed, but also understood and seen that he was a devoted father. That's a green flag for any good woman", "Many/most custody arrangements include a \"right of first refusal.\" This means that if you aren't personally watching the kids, you have to offer the time to the other parent before you can leave them with grandparents/babysitter/whoever.\n\nSince OP repeatedly mentions throughout the post that he (I assume he) misses his kids and wishes he had more time with them, I think it's fair to assume he would have jumped on this opportunity even if the ex had offered to get a babysitter.", "Thats his point though he didnt do it to satisfy his ex he did it because he wanted to see his kids. It was about his wants not his exes, she didnt twist his arm or even know he had his own date she asked did he wanna grab the kids and he immediately said yes that is not on the ex and he’s NTA for wanting to see his kids as much as possible but his girlfriend(well ex now) can be angry if she wants but that just shows she isnt right for his life and as such she was right to end it now.", "THIS RIGHT HERE! The first thing I told my now husband was 'I will always choose my son' his response was that is as it should be. Son is now grown and we BOTH still choose our son and grandson over anything else.", "She already dumped him", "Thank you! I feel like this situation is so far out of line from his kids actually needing him, there was not an emergency, or a big celebration, or any injuries/illness. This was crappy planning and no one wants to date a crappy planner.", "This is the best answer here, I can not believe how many NTA responses there are on this thread. The ex didn't have an emergency, she had a date of her own! It's rude of him to cancel like this and unfair for his current/future partners. You can be a parent and have your own life too - sounds like the ex has figured this out before OP.", "I'm not arguing against his values. Only stating it's an AH move to blindside her on their 6 month celebration with the news she is a secondary priority.", "Your assuming it should be expected, that doesn't mean your assumption is correct. Not everyone will agree kids come before them in a relationship.", "Actually, he’s saying that the opportunity to see his kids (that he misses seeing all the time) is a higher priority than his date.", "Or he misses his kids and will jump at any chance, emergency or not, to spend time with them.  Those kids will 100% know that their father will want to spend time with them.  They would also 100% feel let down and sad if he didn’t take the time.  OP made his priorities quite clear.  Just because it happens to benefit his ex does *not* mean he’s doing something for her. \n\nOP is NTA here, and those who would prioritize a gf or bf over their kids shouldn’t be a parent.", "Exactly. This is the kind of guy that wants someone else to look bad when this is all on him. His ex might have been mortified if she knew he’d so readily cancelled his own date.", "I would hope my boyfriend would drop anything and everything to see his children. That’s part of dating a father. The end.", "Why? He shouldn’t have to cancel plans to see his kids, he should have a healthy arrangement to see his kids and make plans around those dates. He should only cancel his plans in urgent situations. No because his ex has a date. That’s shitty.", "Not when it's your ex wife looking for child care to go on a date. Sorry not sorry. Prioritizing your ex's relationship over yours last minute makes him an AH.", "I know but the reason he's with the kids is that his ex decided to drop them on him literally on the very same day, with no regard to his plans with Amy. As I said, he's not the AH for spending time with his kids but he just showed Amy that Kat's date is more important than the one he had planned with her. That's my stance, I won't discuss it further. **YTA**", "That’s no excuse for cancelling on his gf though. He didn’t cancel because his ex had an emergency (in that case he absolutely would have been NTA) but he cancelled his pre-planned date so his ex could go on one last minute. That’s not fair to his gf", "He rescheduled so his ex could go on a date. Being a parent is hard but in this case, OP made the choice to be unreliable.", "He picked up his kids so his ex could go on a date. Let me repeat that: HE BLEW OFF HIS OWN DATE SO HIS EX COULD GO ON HERS. In what world is that an okay reason? The kids weren't in danger. They weren't sick. His ex didn't have an emergency and needed a sitter last minute. She could have just as well rescheduled her date to be on a day she didn't have the kids, or sought out another sitter.", "People with kids make plans and schedules like everyone else does. They do it all the time.", "In this case, he is a sitter. Being called to take care of kids while their parent is on a date is being a sitter.", "He didn’t jump for his ex. He jumped for his kids. He literally sent his ex off to go be with another man! lol", "No one said he had to, he decided to do this on his own. I can see why his SO decided to move on. \n\nI dont think fathers are babysitters. He parents his kid when he has them but hes acting like an on call babysitter. People generally know when their kids will be around unless emergencies happen....", "Its the fact that hes on call, not that hes watching his own kid...\n\nGood for Amy imo", "Its not really. If he is \"on call\" any time he doesnt have custody then he needs to let his SO know that he will never be able to actually set time aside for her unless its a special occasion. \n\nPeople get fed up dating Dr.s and Lawyers for the same reason and people generally know what their signing up for in those cases", "It's not a six month celebration. The date started at 6. They've been dating about 3 months.", "That's how I see it too.", "Sorry posted a bit too rashly without addressing that part of it - edited (before I saw you comment) to add a bit more explanation.", "The girlfriend is a person too and her time is equally valuable. The man’s time is not more valuable because he has kids. Canceling last minute is disrespectful and “I miss my kids” is not an emergency. This is why a lot of people won’t date single parents. Because single parents want to keep their partners in a toybox and take them out to play with only when it is convenient. OP is 100% YTA.", "She might not have known, like he said she usually lets him know days in advance but this time it was last minute", "but to his kids, he's very reliable. that is more important than any date. sorry, just gonna agree to disagree here 🤷‍♀️", "I stand by my statement. You cannot be a sitter for your own kids. This is just called parenting.", "God forbid a dad wants to spend time with his kids. Not every parent sees their kids as a chore, and even better, good on OP and his ex for being awesome co-parents\n\nAny good woman would be disappointed about the change of plans, but would also see dad being a dad as a green flag. If you aren't willing to deal with single parent life, then don't date a single parent", "Again, wouldn’t consider it being on call. Would consider it being a parent. Again, pop off.", "I dunno maybe it’s just me and the family I grew up in but like my parents were always “on call” to be parents. Like I’d go to school or something but they’d be on call in case something happened. Seems like kind of a parent thing", "This is *one time* in 6 months that this happened, unless I missed something. If the gf can’t handle one rescheduled date in half a year, maybe she’s the one not ready for a relationship..", "Me three.", "If someone you’re dating doesn’t understand your kids come first, that person is NOT worth dating. 100% NTA", "The ex wife managed to keep her plans and made arrangements for the kids like a responsible adult. OP chose to cancel last minute anyway. I bet that Amy is worried that’s going to be a theme and she’s probably right. This was not an emergency and it was 100% inconsiderate on his part.", "I can’t believe the YTA takes here, this is bonkers. He’s a dad first, and his kids absolutely should take priority over a casual movie date with his gf.", "Nope.", "It can actually be written into divorce papers that the opposite parent gets first offer if one parent needs a sitter/daycare. Lots of parents want the extra time with their kids. While it can make dating difficult when the kids are younger, kids grow and they won’t need you forever. Lots of parents would prefer to maximize that time.", "Its being on call.... for your ex... so they can date...\n\nBeing a parent is what he does once he has the kid", ">in case something happened\n\nYes, this is a parent thing.\n\n\n\"Im canceling our plans because my ex wants to go out\" in not the same.", "Its for a date night, you missed the fact that it wasnt an emergency and he said that he takes every opportunity to see his kids. If she gets another date then his SO would have to skip her own date so his ex could go out. If his ex gets a solid relationship going she can call him to babysit at anytime...", "You sound as bitter as Amy, at least this isn’t a hill you’ll die on alone I suppose.", "An opportunity arose to be with his kids? He could’ve said no but he values time with his kids.", "He takes every opportunity to see HIS KIDS because he’s a FATHER. If she can’t deal with dating a father… then she shouldn’t be with him. His kids should be his highest priority. Good for him.", "...why would i be alone? Projecting are we?", "And he is free to do that, just like Amy is free to value her own time. If he wants to be on call, he can be. He just cant expect everyone else to put their lives on hold for him", "Sure, but he needs to let his SO know that if his ex has so much as a date then he needs to cancel his and his SOs plans. Otherwise he needs to get used to being single or with someone that doesnt mind the hectic scheduling.\n\nMom gets the other 50% of the kids time right? Shes smart enough to go out sometimes even when she has the kids lmao", "Exactly, he shouldn't date."]}