{"id": 10161, "submission_id": "1148znt", "title": "AITA for making a driver give me his insurance after he hit my car?", "selftext": "I was driving home from practice today. My sister was in the passenger seat. I was in a rush to get home. While I was driving I was in the middle lane out of 3. A person in the lane to my right was trying to switch lanes in front of me and I wasn’t letting them. They had been driving slow and I didn’t feel like letting them in because I was going faster, but their lane was close to ending and when it did they’d have to make a turn. There was no car directly behind me, if they wanted to they could have slowed down even more and switched lanes behind me. They didn’t want to do that but we’re getting impatient since I wasn’t letting them in, so they decided to switch lanes anyways and try to scare me into letting them in, even though they knew I was beside them. I didn’t budge and they swiped the side of my car and went back to their lane.\n\nI slowed down and told my sister to take a picture of their license plate. I rolled down the window and had her signal the driver to pull over. They pulled over and I told them to give me their insurance. They had scratched up the right side of my car pretty good, as well as the left side of their own car. The driver told me that they wouldn’t be able to afford the cost of their insurance rate increasing from the accident and asked me to let it go. I told them I wasn’t going to let it go and that if they couldn’t afford to pay for the damages they shouldn’t have caused them. They gave me their insurance info, but they called me a heartless asshole and said I should have just let them switch lanes. I think I’m in the right and that it’s their fault for recklessly trying to force me to yield, but my sister thinks I should have just let them change lanes and that I shouldn’t have taken their insurance since my parents can afford to pay the damages, although they would be pissed about it. I told her the driver could have been lying to get out of paying and that they brought it on themselves. We argued over it while I finished the drive home. The argument has stuck with me through the night, so I wanted to ask here. So let me know, AITA?\n\nEdit: I saw someone bring it up so I just wanted to clarify, when I say I had them give me their insurance I mean that I went through the normal process for after a crash in order to have insurance handle it. In my state you exchange insurance, license, and call the cops. I answered questions from the authorities and gave them my insurance. I let them handle the other driver once they arrived. The process went relatively quickly and I drove home when they said I could. I shortened it for the post, but I realize it’s probably good to clarify this for anyone who is worried about if I went through the proper process.\n\nEdit 2: Seen people bring this up so I want to clarify it here, the other car was in a turn lane not a zipper merge. At the end of the lane you have to make a right turn into a shopping center. \n\nAdditionally, I’ve also seen people be confused by my poor phrasing of some things so I’ll try to be more clear about the situation. I was going at a consistent speed of 48 MPH, the speed limit is 45. People in my area honk and tailgate if you go the speed limit, it’s normal to go 2-3 over. Cops in my area don’t care unless you’re going 5 or more over, so it’s typically safer to speed slightly. To my left was the fast lane, where there were cars going well over 50 and I remember being easily passed many times. To my right was the turn only lane. The right lane doesn’t last long. Most of my drive home is 2 lanes, then it splits into 3 for a short time. The 3rd lane is mostly used for people who want to make turns, although some people also use it as a way to go slower. It first begins a little bit before it gives the opportunity to turn onto the highway, then it turns to a church, finally it turns to the shopping center and then goes back to 2 lanes. I usually stay in the right lane because the turn to get to my neighborhood and house is from the right lane, is it’s easiest to stay in this one lane the whole drive. The person in the turn only lane was going somewhere between 35-40 MPH and must not have realized it was turn only. I was in the process of passing them when they turned on their turn signal. The front half of my car was aligned with the back half of their car. I hope that I have cleared up some questions.", "created_utc": 1676603021, "permalink": "/r/AmItheAsshole/comments/1148znt/aita_for_making_a_driver_give_me_his_insurance/", "score": 84, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could have just let the person switch lanes in front of me, and I didn’t have to take their insurance to may for the damage they did to my car.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but you need to calm way the heck down as a driver. You can be *technically right* but still in the wrong. The next time someone might get hurt.", "ESH. Like, congratulations on standing your ground and not letting someone whose lane was ending to merge in front of you. You ended up with a scratched up car that your parents will have to pay to fix if it turns out the other driver’s insurance lapsed or was cancelled. \n\nMaybe one day when you’re more mature and mom and dad don’t pay your body shop bills you’ll try harder to avoid accidents.", "ESH.  You for willfully contributing to this accident, and them for trying to dodge their part of the responsibility.", "ESH\n\nMy general rule with driving is that it may not matter if you are right.\n\nYou had the right of way, now have to get your car to a shop, get a rental, hope the body shop does good, go get your car back.  \n\nI have lost two friends in accidents where they had the right of way.  no fixing that.\n\nbe safe OP", "People. It was not OP’s responsibility to let the other person merge in front of them. That is not the laws of the road in the United States. The other driver needed to either speed up or slow down in order to SAFELY change lanes. That’s not on OP.", "NTA. If they are merging they are required to match the flow of traffic in order to move over. If you sped up to block them you’d be the asshole. If you kept the same pace and they maliciously swiped in and hit you then they are directly at fault. People need to learn to drive. You are not required to slam on the brakes to let them in, nor should you.", "NTA. They hit your car, on purpose. They deserve their insurance rate increasing. You not letting them merge into your lane isnt even that bad, they could have just slowed down and merged, but they were being aggressive.  \n\n\nPlay stupid games, win stupid prizes.", "ESH. Drive defensively, dude.", "NTA for getting their insurance info, it’s what is supposed to happen if you get in an accident. Let your ego go on the road tho. I know they were going slow, but if someone is trying to get in your lane, just let them in. Swallowing your pride works out better than being right and having to deal with a jackass and insurance claims", "ESH you really got your car wrecked to prove a point that you didn’t want to give someone space to merge. You sure taught them a lesson. Luckily, it didn’t evolve into a road rage incident. They are also TA because they too were dumb enough to play lane-merging-chicken with another AH on the road. You both played stupid games and won stupid prizes. Congratulations. \n\nThe true question is was it worth it to you? Did you get where you wanted to go faster? Is the value of your vehicle any higher with its new scratches? Was it worth the deductible you will pay for repairs?", "ESH you should have just let them in but you are right to have them give you their insurance information because the did damage your car and could have slowed down. But what you did was dumb.", "NTA. It’s on the merger to find a place to merge into, so they’re an asshole for hitting your car anyway. They’re also an asshole for trying to keep this stuff off record, as depending on who you have insurance with, all of this has to be reported to the police anyway.", "ESH.\n\nYou we’re the AH for not letting them into the lane you were in. Play stupid games, win stupid prizes.  They are an idiot for forcing the issue and ultimately causing the accident that damaged both cards. They/their insurance should pay because they caused the accident.  That’s how it is decided, not by who can afford it. Parents are not responsible just because they can afford it. Your sister is not the brightest bulb if she doesn’t understand that.", "NTA. I think people forget that the left lanes are for passing (i.e. faster driving). It would have been courteous and admittedly BETTER for you to have let them change lanes, but you had no obligation to. And like you said, they could have slowed to merge behind you and they decided not to.", "NTA. He shouldn’t have tried to push into your lane if he wasn’t prepared to deal with the consequences.", " NTA. But as you become an experience driver, even if you have right of way and are in the right, gotta learn to be defensive driver. In long run, you'll be safe. People are idiots on roads and do stupid things but I don't wanna risk my life or anyone else. That car did not merge properly and should have waited for you to pass to merge but would it be so bad to let them in? It would have taken little bit  of your time and yes it would be annoying but an accident would have been avoided. I see people speed and switch lanes all time.... for what to save 10 or 20 seconds of time? I used to be like that. Usually we'll all be at same light eventually or catch up. No worth it man", "NTA. In the merging lane I NEVER try speeding up when the car next to me is clearly ahead of me/going faster than me. I always slow down and go behind them. I’ve also been the person to not let someone merge in front of me if I know they’ve been going slow. That person needed to slow tf down, and be WAY more mindful of their surroundings while driving. Maybe their insurance going up will remind them to pay attention while driving.", "NTA they learn that not everyone’s gonna yield to their driving and it’s not your problem but their insurance is gonna go up they should’ve slow down. Saying that you weren’t gonna let them in instead of just saying fuck it.", "ESH. You’re both the reason people have road rage. Grow up.", "INFO: \" they decided to switch lanes anyways and try to scare me into letting them in.\"  Sorry you're going to need to explain exactly how they changed lanes and you still weren't letting them in and it wasn't your fault. Sounds like you were hogging the middle lane and speeding up to match them but maybe I'm missing something. Quite happy to be wrong but don't get it.", "ETA here.\n\nYou're a huge asshole for not letting the guy merge. And you can be partly at fault:\n\n\"The driver that does not change lanes usually will not be completely at fault for the accident. But they can have some fault when they do not fulfill their driving obligations. The driver that does not change lanes has an obligation to pay attention to the movement of the other cars and drive a safe speed for the conditions. When a driver fails to do these things, they can have some fault for an accident when another driver changes lanes. Common ways a driver that did not change lanes can have some fault in an accident when another car changes lanes include:\n\n**Speeding up as the other vehicle is changing lanes in front**\nSlowing down as the other vehicle changes lanes behind\nTexting or talking on the phone. This is commonly referred to as distracted driving\n**Purposefully refusing to let the other car enter the lane of travel**\"\nhttps://distasiofirm.com/who-is-at-fault-when/sideswipe-accident/\n\nOther guy is an asshole for not following protocol.\n\nNext time a guy is trying to merge, let them. Not only does it help make traffic go faster, but it also doesn't make you look like an asshole.\n\nhttps://amainsider.com/zipper-merge/#:~:text=Put%20simply%2C%20drivers%20use%20both,as%20much%20as%2040%20percent.", "NTA - if they were trying to cut in front of you, they should have waited and got behind you. Definitely go through insurance", "[removed]", "NTA, but be better to other drivers.\n\nIt's the other driver's responsibility to find a way to merge. If there weren't other cars around, they definitely should have slowed down or sped up to get around you. They caused a wreck and it's 100% on them to own up to it. If they couldn't afford the insurance hike, they shouldn't have damaged your car.\n\nEven then, there's basically no reason not to let someone over if they're signaling they want to merge. If you want to go faster than them, merge left yourself or speed up to get out of the way. Don't just coast along and box them out of your lane because you're petty.", "ESH", "NTA. The other votes are thinking practically. Choose your battles. You chose this one, and by your account, you were in the right. Doesn’t mean every time you are right you wanna deal with consequences though.", "ESH\n\nHe should pay for the damage he caused , but you’re also an AH for not letting him switch lanes. You should always be cordial with other drivers while you’re driving", "NTA. But I don’t have a lot of sympathy for you, let people lane change", "YTA\n\nYou're not the asshole for demanding insurance, you're the asshole for being an overly shitty driver. I mean holy fuck, just let them over. If they're slow then get the fuck out of the middle lane and pass them in the **passing** lane.\n\nAlso, as an FYI I hope the insurance adjuster sees this story. At best, it's 50/50 but given your attitude and own admissions I'd say you are at fault. The front most person generally has the right away because the rearmost person has the most visibility. Given how much of an overly aggressively shitty driver you were being, it's your fault. \n\nOh well, time to see if I can crosspost this in r/idiotsincars", "ESH\n\nYou - for being such a jerk about them switching lanes. Dude, if the lane was ending, why not let them in? There is another lane for you to pass them afterward. You were just being unnecessarily antagonistic.\n\nThem - well, obviously for causing a crash. And yeah, their insurance rate increase is not your problem.", "YTA. Sounds like your ego contributed to an unsafe driving environment. Driving is not a racing video game. If someone is behaving poorly on the road, you want to create distance from them, not stay right next to them. If you didn't like the way that person was driving, you don't take revenge by blocking their entrance into a lane, you create a safe distance between you and them.\n\nYou could've been hurt. Your sister could've been hurt. Cars are not toys, please make safer choices on the road. If you were my kid, I would be pissed at you for putting yourself into that situation even if you did technically do the right thing by getting the insurance information. Your safety is more important.", "They hit your car on purpose but don’t want to pay for it?! Lmao. NTA. \n\nYea, you coulda let them in but it’s their responsibility to merge responsibly. That being said, once you saw them come into your lane you absolutely should’ve moved to prevent an accident. That’s also your responsibility. But NTA for making them give you their insurance when they essentially tried to run you out of the way", "NTA for getting their insurance and forcing them to pay for damages, but next time you better avoid being in the situations like this. You could be 1000 times in the right but it’s ultimately not worth it. You were lucky it was just a scratch this time. You were risking your life and your sister’s life to save like 5 seconds. YTA for reckless driving.", "[removed]", "ESH. You were driving like an asshole to not let them in but also this isn’t levee racing from Grease so they shouldn’t have hit you. \n\nThey legally need to either pay for the repairs or let the insurers sort it out. Also in the UK you need to report traffic accidents to police so you’d need their details. Dunno where you are though.", "[deleted]", "[removed]", "You sound like you were being a dick.\n\nYTA", "INFO... was he ahead of you when he signaled to merge?", "ESH\n\nLegally, yes the person merging is required to pace with the traffic they are merging into and have a large enough gap before they switch lanes. That being said, a defensive driver will do what they can to avoid a collision, not sit there like an asshat and get side swiped. Depending on insurance regulations in your area you may find your policy cancelled or severely increased in cost if your insurance company finds out you refused to avoid the collision. You have officially made yourself a legal and financial liability to your own policy by behaving like an entitled toddler and are not the sharpest tool in the shed for posting this in a public forum.", "You're a complete and utter A hole.", "The normal process in a crash is to exchange insurance info and drivers license info. You call the police to the scene to file a report and let the police and insurance work out the details. Everyone thinks they weren’t in the wrong in a crash. That’s why we have police and insurance. Let them figure it out… additionally in most states the law says the lane that is ending needs to yield to the through lane but it’s also not nice to close the gap and ultimately results in crappy situations for everyone. YTA", "YTA\n\nYou blocked a car that was trying to merge. You admit you were in a rush, you admit you didn't want to let them in. You caused this.", "I hope your insurer finds this post. YTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI was driving home from practice today. My sister was in the passenger seat. I was in a rush to get home. While I was driving I was in the middle lane out of 3. A person in the lane to my right was trying to switch lanes in front of me and I wasn’t letting them. They had been driving slow and I didn’t feel like letting them in because I was going faster, but their lane was close to ending and when it did they’d have to make a turn. There was no car directly behind me, if they wanted to they could have slowed down even more and switched lanes behind me. They didn’t want to do that but we’re getting impatient since I wasn’t letting them in, so they decided to switch lanes anyways and try to scare me into letting them in, even though they knew I was beside them. I didn’t budge and they swiped the side of my car and went back to their lane.\n\nI slowed down and told my sister to take a picture of their license plate. I rolled down the window and had her signal the driver to pull over. They pulled over and I told them to give me their insurance. They had scratched up the right side of my car pretty good, as well as the left side of their own car. The driver told me that they wouldn’t be able to afford the cost of their insurance rate increasing from the accident and asked me to let it go. I told them I wasn’t going to let it go and that if they couldn’t afford to pay for the damages they shouldn’t have caused them. They gave me their insurance info, but they called me a heartless asshole and said I should have just let them switch lanes. I think I’m in the right and that it’s their fault for recklessly trying to force me to yield, but my sister thinks I should have just let them change lanes and that I shouldn’t have taken their insurance since my parents can afford to pay the damages, although they would be pissed about it. I told her the driver could have been lying to get out of paying and that they brought it on themselves. We argued over it while I finished the drive home. The argument has stuck with me through the night, so I wanted to ask here. So let me know, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH clearly the other driver should have slow down and moved behind you, but at the same time you were reckless when you saw them coming over and not just giving them space. Avoiding an accident should be a priority. Luckily all that happened here was some surface damage to the car- they could’ve pushed you into oncoming traffic, a barrier, spun your car, all kinds of things.  ￼", "ESH because you risked your sister's safety to make a point. Yes you were technically right and they are definitely AHs but you never willingly risk a passenger's safety like that. You owe her a big apology.", "YTA - in my state, at least, we use the zipper merge, where you are supposed to let the car in the lane that was ending in. Not sure about your state, but you should be paetially at fault.\n\nEither way, YTA.", "YTA. The fundamental lesson of drivers ed is to drive defensively, and this takes precedence over what the law allows. You see a car AHEAD OF YOU attempting to merge, you make way. \n\nYou know why they were driving slowly? So they wouldn’t crash when their lane ended. You’re just like any other jerk that prioritized arriving to your destination 3 seconds faster instead of driving safely. People die on the road because of this; I have no sympathy about whether you received their insurance.", "YTA your aggressive driving caused this.", "So you had *3* lanes, you decided to stay in the middle lane instead of moving over to the fast lane on the left and maintain your speed (which in turn would have allowed them to maintain their speed as well) \n\nYou created a situation you made yourself a victim of, and in turn made someone else’s life a bit harder all for the sake of your ego\n\nYTA", "YTA for not letting the other car merge. I had that happen the other day, raining, lots of traffic, my lane was ending and 2 asshats refused to let me in like they're supposed to. You're a jerk of a driver.", "Your sister is right that you should have just let this other car in. It would have cost you a lot less time than this whole ordeal. \nAnd you should also apologize to her because it probably wasn’t very fun for her to be a helpless passenger in an accident that could have so easily been avoided by both drivers not being AHs, especially since they hit her side of the car. \n\nBut she is wrong about the insurance thing. You did the right thing by getting insurance info. \nSo N-T-A to your specific question, but you were an AH more generally.  \n\nI guess maybe it’s an ESH, except your sister, who you again, you should really apologize to.", "ESH\n\nYou are a AH for not letting someone in who was trying to merge. He was likely going slower because he didn't want to run out of lane before he had a chance to move over, and even if not you should just drive defensively, share the road with the other people also trying to get home, and collect the good karma from not being a jerk. A common cause of accidents like this are drivers being in a rush to get somewhere, which you so thoroughly demonstrated. You helped contribute to a situation that resulted in damage to two cars, and you almost definately got home even later than you would have if you just let him merge, losing both time and money.\n\nYou did the right thing in getting his insurance, that is what you should do after an accident. He shouldn't have tried to force his way in and he is an AH for that too, but you both played a part in what happened.", "ESH. Where I'm from in Australia it would be considered your fault for not allowing a car to merge into your lane when there's is ending. It was a douchey move on your part and there was nothing stopping you from overtaking them after they merged. You're lucky it wasn't a more serious accident. Do better if you're going to be in control of a car.", "ESH. Let people in and don't be stupid. A lot of people die in wrecks, not worth the risk.\nThat being said getting insurance info is always a good idea", "YTA.  You risked life & limb for multiple people including your sister because you were in a hurry.  Besides the risk of an accident, you also risked road rage.  Where I live, that sort of driving can get you shot.  Move left to the fast lane, or better yet, slow down a little.", "Sure, it’s not your responsibility to let someone move over before the lane they are in ends… exiting that lane safely is on them. \n\nHOWEVER you specifically state you didn’t let them move over on purpose. If you were actually going faster and they were going so slow as you claim, you should have been past them pretty quickly and they could have moved behind you. \n\nI suspect you were slowing down for god knows why to prevent them from moving over. And it’s not like you were even completely oblivious to the situation either like it was a new place or road for you because you can describe it all in great detail.  I was going to vote E.s.h. But changed my mind while typing to YTA because you need to be a better human.", "There’s a saying that cemeteries are full of drivers who had the right of way.", "This is a Esh at least", "They had their sister as a passenger. Their actions could've risked her life. \n\nOP is not a responsible driver especially since it was the passenger side that was in danger.", "They’re not even technically right. They admit they were mad at the other driver for going “too slow.”", "THIS. Like, the very first rule that a driver should learn is \"Let the food have a right of way\", cause seriously, a car crash is not worth it.", "I agree with this, but if the other driver has lapsed or no insurance, OPS insurance would cover the damage (with or without UIM) and go after the other party for reimbursement as warranted.", "That's not completely clear: \n\n\"When merging, both drivers have the responsibility to merge safely. The driver already in the lane has right of way. That said, if the driver behaves in a way that makes it difficult to allow other drivers to enter the lane, they may be liable in a collision. Improper behavior can be slowing down or speeding up to close the gap and prevent other drivers from joining the road safely. \"\n\nIt seems OP was behaving in a way that made it difficult for the other driver.", "Technically sure, but the reality of the situation is they engaged in behavior that contributed to the accident. So now they’re right, but they also have a scratched up car and could’ve been injured or worse.", "It is EVERY driver’s responsibility to make the road safe for themselves or others. If another driver makes a mistake, you are still compelled to prevent or reduce the associated danger. That is absolutely on OP and has nothing to do with the law.", "I was going 48 in a 45 which I think is pretty normal, people to my left were passing me easily. He was going significantly slower, I can’t say for sure but if I had to guess I’d say somewhere around 35ish, give or take.", "“On purpose” was the perspective of the OP. I personally don’t trust OP to provide a good rational perspective on the thoughts and intentions of other drivers on the road given their own stupidity on the road.", "They had space to merge. Behind OP’s car.", "ESH for the same reasons.", "Exactly this. NTA.", "I was in the middle lane because it soon becomes the right lane only. The third lane is to turn into a shopping center. The turn to my house is on the right so I just stay in what becomes the right lane for the whole drive, currently the middle lane where I was. I was about 3 minutes away from the turn home, it’s easiest to stay in the right lane. The person trying to change lanes was to my side and I was in the process of passing when they signaled to switch lanes because they saw the turn was coming up. The front half of my car was lined up with the back half of their car by the time they tried to force me to slow down and let them into the lane. The speed limit was 45, I was going 48 and they were going under 40.", "Finally someone said it. \n\nIt's mind boggling how so many people are saying OP should have yielded when there was no one behind them. This is 100% on the actual AH that couldn't tap the brakes and be at the end of the line.", "yes depending on where they live, they were technically in the right and the other driver should’ve slowed down to merge behind, the only issue i have is that technically OP mentions not letting them merge in front of them which comes off as intentionally blocking them from merging, which at least where i live is illegal. i don’t think Op is the ah for going the proper route because the other driver should never have merged into the side of a vehicle, but its just as easy for the driver to slow down to merge behind as it would be for OP to speed up or change lanes", "Turning lanes aren't for passing, and people who want to change lanes should be looking for room to do so before the end of their lane. That's why roads have handy signs letting you know that you should prepare to merge.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Nope, I’d say it was definitely the person who changed lanes’s fault.", "but the other dude could have gone behind op, plus the other dude was going slower anyways soooooooooooooo", "Guess what, the other driver could have slowed down ( since they knew their lane was ending) and just gotten behind them", "Agree.\nYTA", "Ahh yes because the turtle wanted it his way and illegally merged and hit him. Lawl", "I don’t see how you arrived at your conclusion of OP being the AH", "No, the other person caused it by not braking.", "Zipper merge is used to have one car go, then the other (that’s trying to merge in) so based on what OP said, they would have been correct to keep going, with no one behind them, for the other car to merge. \n\nSo I mean absolutely drive defensively if you see someone being an ass but the other driver was most definitely an asshole here", "Zipper merges are for lanes that are ending, not for lanes that are turn only lanes.", "You’re the kinda guy who beats his wife then screams, “Look what you made me do!”, huh? Metaphorically speaking, of course.", "Their land wasn’t ending, it was a turn lane.", "Fair. I always forget that is an option.", "Food is important!", "Yes, hence the ESH ruling. They both suck.", ">the person trying to change lanes was to my side \n\nLeft or right?", "So you Lane hog?", ">The front half of my car was lined up with the back half of their car by the time they tried to force me to slow down and let them into the lane. The speed limit was 45, I was going 48 and they were going under 40.\n\nSo you were speeding and you purposely didn't let them merge when they were ahead of you. You are like 75% at fault here. Driving is a privilege, not a constitutional right. You get your drivers license based on the skills you have and the rules you agree to follow. \n\nIf the guy decides to go to court, I expect it to go in their favor not yours.", "So there was a zipper merge, and they were ahead of you?  \n\nWhere I live your actions were illegal.", "and people like you are why where I am from merging has no right of way. Too many idiots lane hogging and blocking. Merging is a shared responsibility. YTA. Grow up before you kill someone who isnt you. \n\nEven if you did have the right away, graveyards are full of people who had the right of way. You could have killed your sister.", "OP accelerated to prevent the other car from overtaking. OP is definitely the asshole", "I think this might be the other dude lol either way, it's definitely someone who doesn't understand how the road rules work.", "\"bUt ThE oThEr DrIvEr!!\"\n\nNo,  op knew; acknowledged and admitted that the other car needed to get over and HE PURPOSELY DID NOT LET THEM IN.  He knew; acknowledged and admitted that HE WAS IN THE MIDDLE OF A 3 LANE ROAD.  Op couldve moved the fuck over.\nInstead he put his sister's life in danger.  That. Right there.  Is why.  Op is an asshole. He put other people in danger because he didn't want to be inconvienced by a few minutes.. instead of doing the right thing and moving over ; speeding up, or slowing down and letting them in.  !!!!HE!!!PURPOSELY!!!! BLOCKED THEM!!!!!. He didn't even same time with his idiocy! He wasted time!!!\n\n\n\nYou defending him only outs yourself as another road raging asshole driver.", "But if he just lets the car merge than OP isnt in this situation, so who’s really the winner here? Let the turtle in and get home in one piece. Who gives af who’s right and wrong", "Both drivers were assholes, granted, but if OP says he \"didn't let the other car in\", that implies that the other car was ahead of him. OP also mentioned that the other car was driving slowly. OP likely tried to pass the other slower moving car.", "Your comment doesn't even remotely make sense.", "Right, left side was the fast lane. People were easily passing me. Most people were going well over 50 to my left.", "I go the speed of traffic in the lane, but yes I generally just stay in one lane. For most of my drive it’s 2 lanes, then it splits off to 3 for a little bit, then it goes back to 2 lane. The 3rd lane is for a turn at a light that goes onto the highway, a turn to a church, and then the turn to the shopping center. It doesn’t last long.", "Totally wrong, they would not be at fault at all. It’s 100% the fault of the person who switched lanes into them. \n\nThe other person proved that they did not have the skills and did not follow the rules. It is wrong to slam on your breaks to let someone in. When you are switching lanes, you yield to the traffic. It is not the other way around.", "Not a zipper merge. It was a turn lane the people were trying to get out of.", "It isn’t a zipper merge. A zipper merge is when a lane is closed due to construction and cars use both lanes until they reach the construction, where 1 lane is the cut off by cones or some other obstruction and you alternate lanes to enter.", "No, OP said he was already passing them. He didn’t speed up, he maintained speed. The other driver (the one required by law to yield) refused to slow down.", "If the car had slowed down, and merged when safe, this wouldn’t have happened.", "Maybe you should try improving your reading comprehension then.", "That is actually False. \n\nMost of the time they wouldn't be at fault BUT they admitted that:\n\nA. They were speeding\n\nB. They wanted to prevent the other car from merging\n\nC. The other car was in front of them about to merge \n\nD. OP knew it was dangerous\n\nWith this information, they are more than half at fault. They weren't being a responsible driver. They could've caused a bigger accident.", "“The person trying to change lanes was to my side and I was in the process of passing when they signaled to switch lanes because they saw the turn was coming up. The front half of my car was lined up with the back half of their car by the time they tried to force me to slow down and let them into the lane.”\n\nSo OP is speeding, sees someone signaling to get over (due to a lane ending), makes no accommodations to allow them in, then once they see they are actually executing the lane change still does not try and avoid a collision. He stood his ground.\n\nThis is stupid driving, not defensive driving. The driver in the right lane made a mistake too no question about it, but it was an avoidable accident regardless.", "Op said he was speeding up to pass the other car before the merge was coming.", "Clearly the other driver didn’t exhibit the kind of rationality you’re talking about. When you’re driving and see someone else driving crazy,  doing what you need to do to get home safe supercedes right and wrong", "A. The other car was going 10 under. That is also illegal and much more dangerous than going 3 over the speed limit. The other driver would definitely be at fault here. \n\nB/C. And the other car wanted to prevent OP from getting in front of them. There were no other cars behind OP, so it would have been much safer for the other driver to get behind them. Especially as OP says he was more beside them than behind them when they wanted over. \n\nD. The other driver must have known that playing chicken and forcing his way in was dangerous. \n\nYou cannot convince me that OP is at fault. Could he have gotten over? Yeah absolutely. That’s probably what I would have done. But it doesn’t change the fact that it’s not his fault at all.", "It doesn't matter that OP was doing 3 over the speed limit, and LOL at you for implying they were going too fast for the other driver to react. \n\nA turn signal isn't a Fremen crysknife from Dune that can't be sheathed until it's used. If you turn on your signal and then look to see a) a car is right there in the other lane and b) there's a huge gap behind them, you are 100% the asshole for forcing a merge--and if you didn't see them you are insufficiently attentive to be operating a motor vehicle. All this both sides caterwauling does nothing but enable the asshole drivers that think everyone else is obligated to get out of their way.", "No, he said he was going faster than them to begin with. It reads to me as if he just maintained speed.", "I hate other drivers. But I probably fall into that category from time to time. I’m trying to be better lol", "OP intentionally did not let the other driver in with a lane ending situation. They are very clearly an asshole. OP even says the other driver was frustrated because they weren’t letting them in, which means OP was persistent about blocking.\n\nThe right lane made an error because they changed lanes into a side swipe. There is no scenario that they are not accountable for that. \n\nNonetheless, defensive driving is good driving, everything else is asshole driving.", "Read the first part of the post again:\n\n\"person in the lane to my right was trying to switch lanes in front of me\"\n\nAlso if OP was going faster then how did the other car get in front of them?", "Lol i hear you. Where I live and work there are sooo many shitty drivers. And if I wanted to stand my ground and be right I’d probably have a few totaled cars on my hands lol", "And also, that doesn’t say anything about what we were discussing, which was that OP did not speed up. And just to clarify, there was NO MERGE coming up. Their lane was a turn lane, not a merge point.", "Read the comments. \n\n“ The person trying to change lanes was to my side and I was in the process of passing when they signaled to switch lanes because they saw the turn was coming up. The front half of my car was lined up with the back half of their car by the time they tried to force me to slow down and let them into the lane. ”", "The other car was still ahead of OP. Op decided to risk his sister's life by speeding up. Also I doubt the other car was going 30. Probably around 40 because they managed to stay in front of OP all that time when they sped up to merge. \n\nIf there are traffic cameras near that merger, then it would be easier to see what the hell actually happened. A car going 48 vs a car going 30. You'd expect the car going 30 to be passed up quickly even if they sped up.", "I’d guess the other car was somewhere between 35-40. I was driving a consistent speed, just the general flow of traffic in my area. On this road most people go a few miles over and I find it better to stick to that rule than directly follow the 45MPH limit. I got honked at and tailgated multiple times when I was first starting to drive for going the exact limit. Cops almost never pull you over in my area unless you go 5 over so I usually go 2-3 over, as does almost everyone else. Also it wasn’t a merger, they had been cruising in a turn lane without realizing and were trying to change lanes at the last minute. They only turned on their signal as I was in the process of passing them.", "NTA You didn't hit anybody, THEY hit YOU. Let the law decide who's at fault. ALWAYS follow proper procedure in legal matters.", "It doesn't hurt to be a courteous driver.", "Your local claims adjuster here :::::waves!:::::\n\nSo.. clearly they were the majority at fault. They failed to yield.\n\nYou self admitted you were aware of the risk and didn’t take any evasive action.\n\nI’m calling some comparative negligence here. But yes.. you should have got his insurance.", "NTA.\n\nI also hate people that use a turn lane as a merge lane and wont just take the wide open space behind you. I also don't let them in. Not going to judge you for that. You were not an asshole to make someone that caused an accident exchange insurance information.\n\nFrom their pleading excuse, it sounds like they already drive like shit if their rates are that high.", "YTA. You're one of THOSE drivers. Your insistence in sticking tight, instead of letting things go, causes accidents. And now you're posing as an innocent. You are SO childish.", "ESH. You have every right to get their insurance but you also contributed to the accident. Insurance will most likely fault you both. So congrats I hope wanting to hurry was worth your premium increase.", "YTA. YOU caused the accident by not letting them change lanes. It’s an indicator, not a permission-asker. Drop it.", "ESH. Like others have stated, there is *technically* right while still being in the wrong. Would it have really killed you to let them over?", "You're not the asshole for making the other driver take responsibility for damage they causes to your vehicle.  You ARE the asshole for intentionally preventing them from moving over when their lane was ending.", "ESH\n\nIt takes 2 minutes to let someone in, usually less. If you’re in the US how long do you think it takes for someone to pull out a gun? \n\nIt’s not worth your life or your sister’s!", "NTA. Always file against their insurance. They merged into you trying to play chicken. Well stupid games got stupid prize. Don’t file with your insurance otherwise you will be on the hook for a deductible that you may or may not recover. Make them pay for the damages and your rental while the vehicle is repaired.", "Be aware that YOUR car insurance may go up as well, because you could have prevented the accident but didn't. I worked with a lady years ago who was upset that her insurance went up due to having been in two car accidents that weren't her fault. I think someone told her to take defensive driving lessons to stop allowing \"accidents\" that weren't preventable to happen. You should look into taking the class as well.", "I’m going with ESH.  Obviously the other driver shouldn’t have played stupid games and win their stupid prizes, and although you technically don’t have to make room for them, it is a common courtesy to make room if you are safely able to.\n\nI also was also of the opinion “as long as I have the right of way I’ll be protected” until about 5 years ago.  I was taking classes at my university.  Classes got out and I had to cross a street to get to the parking lot.  There is a pedestrian crosswalk (the kind without lights, basically tells cars to yield to any pedestrians in the crosswalk).  For a while I would just start walking once I got to it, regardless if cars were coming.  I have the right of way right? What could go wrong? One day I started crossing and one of the cars also didn’t give a damn and would have hit me if I didn’t stop just in time.  Thankfully one of the campus police were right there and pulled him over, but that really shook me up.  I realized yeah I was protected legally, but physically that car could have killed me. You know the old saying “Here lies Joe.  He had the right of way”.  I realized laws don’t protect you physically from stupidity, you do.  You have to drive defensively, which means making room for assholes even if they don’t deserve it.", "ESH. He shouldn't have purposely merged into you, but you should have just let him in if you could. You were totally in your right to ask for their insurance, but if you had just let them in you wouldn't have needed to.", "It’s never worth getting into wreck to prove you’re right. What you did sounds pretty stupid if you ask me.", "I kinda want to say n t a cuz i mean I’ve passed someone who wanted to move over but was moving slower and I bet many of us have …so perhaps we all deserve an esh lol", "I've never understood why people would rather deal with the hassle of having a car repaired than just accept that they may be right, but they're still the loser in the situation. \n\nJust let inconsiderate drivers in so you don't have to deal with them for longer than the 2 minutes you're following them. \n\nNot to mention if their lane ending didn't have give way markings and the other car was in front, then it's a zipper merge and they didn't have right of way...", "You need to change this to Esh you are the top comment right now", "The even truer question is:\n\n\"Will you be happy when you or your sister is dead, as long as you had the right-of-way?\"\n\nOP needs to learn that Ego has no place in the driver's seat. It's possible to be an assertive driver without being an asshole driver. Wisdom is knowing that \"being right\" isn't always as important as being alive and safe.", "Work in insurance, hear these stories everyday. It’s almost always ruled partial fault of both drivers. This story will throw red flags for other guys insurance and they’ll fight it. OP insurance will pay some and other driver will pay.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I thtink this depends on the state and the type of coverage mom and dad have. If they have the bare minimum state required liability insurance, and no collision coverage or uninsured motorist coverage, they could be on the hook for all damages if the other driver has no insurance or their insurance won't pay.\n\nAlso, even if mom and dad do have collision coverage, they may have a $500 or $1000 deductible.  And an accident claim like this could cause their rates to go up. \n\nI'm certainly getting a vibe from OP of \"I don't care if I'm in a crash, mom and dad will pay for any damages\"", "If he was going slower than how did he try to get in front of you?", "They chose to merge into a lane without checking to see if it was clear. That in itself is  \"on purpose.\"  If it was intentional to hit them, I cannot assess that.", "Yeah I’m guessing OP will be found some % at fault", "I always yield for food!", "Not really, op just failed to yield to another cars request. The driver could have slowed down and merged safely instead they decided to side swipe someone. \n\nThey initiated the accident, and did it intentionally. \n\nYou are literally arguing that someone who broke not a single law is equally at fault as someone who intentionally sideswiped THE PASSENGER of another car. \n\nNTA I hope their insurance becomes unaffordable and it lapses so they can lose their license next time.", "Adjuster here! I would totally find them partially at fault. Not because I’m a dick. Because they were aware of the danger and took no action to avoid.", "To be fair, they never said equally at fault.\n\nBut *some portion* of fault can absolutely be assigned if it can be shown that, despite another making a mistake or doing something wrong, that they had ample time and awareness to have avoided the accident, but chose not to. As OP is admitting here.\n\nSomeone else making an error doesn't give another party *carte blanch* to just let an avoidable accident happen.", "I thought so but also OP intentionally was being rude so he didn’t even not take action but he sabotaged the situation to be stubborn.", "You are right op could have deescalated the situation better, the other persons mistake isn’t nearly as terrible as just hitting a car because they won’t move. \n\nYou honestly want to share a road with someone who’ll just ram you if you don’t yield?", "blanche", "oops"]}