{"id": 1018, "submission_id": "yl1jta", "title": "AITA for leaving the kids with my husband for 2 hours while I went shopping?", "selftext": "\n\n\nMy husband was involved in an accident that injured his spinal cord so badly he needed to have a wheelchair. He also suffers from a head injury that causes him to be unable to perform some tasks properly as well as constant confusion. Sometiimes he'd lose track of time.\n\n\nI take care of the house and kids on me own. Yesterday, I wanted to go shopping for some christmas stuff but couldn't take the kids because firstly, they'd want to get everything they see. And secondly, I didn't want them to see what I bought them. I couldn't get the babysitter to come watch the kids like she does usually when I'm out. I was in a rush, what I did was place the kids ( 3&5 )and their toys near my husband and asked him to just keep an eye on them. He was unsure of the whole thing but I had to leave.\n\n\nDuring my 2nd hour of shopping I got an angry call ftom his mother berating me for leaving my husband with the kids knowing he's unable to watch them properly. I went home and she yelled at me there saying thank God she came over because she found my husband asleep in his wheelchair and the kids were out of sight. I said I was in a rush, the babysitter didn't come and thought it wouldn't hurt if he watched them for a couple of hours. She argued about how irresponsible I was to leave my husband with the kids knowing he's unable to watch them like any other able bodied person could. She said I should've made sure someone was with the kids and my husband. I had a screaming match with her and my husband just watched. She left and told her family about what a horrible mother I was and even claimed I was abusing my husband by giving him tasks he can not handle. They of course sided with her.\n\n\n\nAITA?", "created_utc": 1667478531, "permalink": "/r/AmItheAsshole/comments/yl1jta/aita_for_leaving_the_kids_with_my_husband_for_2/", "score": 1709, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might have messed up by leaving the kids with him and not finding other childcare arrangements before I went shopping.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. But OP, are you okay? Do you have enough support between your husband and kids? Maybe reach out to the extended family next time if you need a couple hours by yourself. You’re in a major caregiver position and need to take care of yourself, but please don’t forget your kids are also babies. I doubt they could have called 911 or family members for help if they needed it. Wait until they are older to do this again.", "YTA. I'm going to soften this a little bit because I'm sure this is all very hard for you. You have two young children that it sounds like you are essentially raising as a single mother.\n\nYou *know* your husband can't look after the kids. You *know* it's not safe to leave them with someone who loses time and gets confused. You *know* you need a babysitter when you go out. You *know* that you should not have gone out yesterday and that you *wanted* to go shopping, but you didn't *have* to yesterday. *You know your MIL is right that you essentially left the kids alone, unsupervised and you're lucky she turned up*.\n\nBut you did it anyway. This is a sign that you aren't coping. You need help. You need to find resources that make things easier for you. You need to reach out for more help. Ask your MIL if she's able to help more so you have someone other than the babysitter to call on. Ask your own family. Do *something* before this entire thing eats you alive.", "I'm going to try and give judgement fairly but with sympathy.\n\nI can't imagine how difficult things must be for you right now. But OP, you were extremely irresponsible and definitely YTA for what you did. Your husband cannot take care of your children under the current circumstances, that's the unfortunate reality. And you leaving the kids to him could have ended terribly. Anything could have happened and your husband would have been unable to do anything to help/protect your kids or himself. You might as well have left the kids alone. It would have been essentially the same.\n\nChristmas shopping isn't a priority, there's still nearly two months left. You could have asked someone else to keep an eye on the kids, or you could have gone any other day when your babysitter is available. \n\nBut I'm genuinely not trying to shame you. I think you went now despite it being a terrible idea because you are overwhelmed and you needed an excuse to be out for some hours without feeling terrible for being overwhelmed. You are taking care of two very young kids and a husband that can't take care of himself, and you are over your limit. You need help, someone that can come by and help with your husband. There's nothing shameful about it; there's a reason why people have a job on that field. \n\nTaking care of someone disabled is incredibly difficult, and requires professional assistance. There's a lot of stigma about asking for professional help, but it's utter nonsense and you owe it to yourself, your kids and your husband to find a way to move forward. And it clearly cannot be the same way it's been until now, because it's not working. Your lack of judgement could very well be due to the stress. And that means it's time to find solutions that keep all your family (you, husband and kids) safe, healthy and happy.\n\nSo yeah, I have to say YTA. But please op, take it as a wake up call to ask for help. I am not here to shame you, I'm here to say there are resources, and you should make use of them. This kind of stuff cannot happen again.", "YTA and I strongly suspect this isn’t exactly about the Christmas shopping. You’ve been experiencing a stressful situation that is likely to cause anyone to burn out. Needing a break to get out of the house alone is reasonable. Leaving your children without adequate care is not. Your reaction to others rightly being upset about the children being endangered is not. You clearly need help dealing with the home situation now that your husband needs more care and can’t equally participate in child care. You’re in a hard situation no one would envy, but at the end of the day you are responsible for ensuring those kids are not endangered. Being left with someone who can’t care for them and keep them safe is endangering them. It sounds like MIL is close enough to come over so next time you  NEED to get out, why not just call her if the baby sitter isn’t free? I also encourage you to look into respite care to help give yourself a break from time to time.", "What you are describing here and the way to tell it makes me thinks that you are on the verge of a caretaker burn out. Of course it was bad to leave your very YOUNG children under the care of your physically and mentally impaired husband. Dangerous for all actually.\n\nBUT I'm not sure why despite what you wrote you did not come to that realization yourself which in turn makes me thinks you are not in a decent state of mind, be it exhaustion, grieving (for what life was supposed to be) or something along those lines.\n\nTry and reach for all the help you can and good luck for everything.\n\nAnd YTA for this situation but you know it I think.", "YTA I’m sorry this is a difficult situation but you were wrong to leave such young children in the care of someone who is clearly not mentally fit to even care for themselves let along children.\n\nYour mother in law was right to be upset with you. Clearly you need more support or some kind of help with this situation.", "YTA Anything could happen to two small unsupervised children. He’s clearly not in the right frame of mind to care for them. Why would you risk it?", "My father died of cancer and I saw my mom almost run herself into the ground in trying to care for him. Fortunately she had help (Hospice Care was GREAT!) and she could get some rest and time away.\n\nI know that people don't talk about this, but caregiver burnout is a very real thing and it sounds as if maybe you have it.  You're NOT a bad person because of this.  However, you have to get help.  Putting your children in the care of someone who physically CAN'T care for them is dangerous (at best!).\n\nYTA - in regards to this situation.  You are N-T-A for having caregiver burnout.\n\nBTW - I agree with your MiL that it was (borderline) abuse to put your husband and children in that situation.\n\nSo please seek help - for yourself, your husband and your children.  Don't EVER put your husband and children in that situation again.", "YTA shop online, wait a couple days it's the start of Nov, ask your mil. All better solutions then leaving your very young children essentially home alone. You are very irresponsible and whatever your real rush was put your children in serious danger.", "YTA for leaving the kids with your husband knowing he couldn’t do it. But are you getting any help at all? This is a lot to handle in this situation", "YTA BUT I think you might have caretaker burnout. It is a very real thing and can result in making decisions that you normally would never make. You’re a good mom, you’re doing the best you can. Have a 5 and 3 year old is hard enough, but add having to take care of an injured adult plus all the responsibilities that come with taking care of the home, holidays etc. Will these injuries heal? Will he be able to pull his own weight eventually? If not it’s time to start coming up with a long term plan. I’m sorry you’re in this position. Do t forget to take care of yourself too! Without you everything will completely fall apart.", "YTA. I'm sorry you're in this situation, but your husband is not capable of being a partner to you in this way. It's not safe to leave your children with a person - even if that person is their parent - who is not physically capable of caring for children.", "YTA. I appreciate that you are probably overwhelmed and need some alone time, but your husband is not able to safely look after children of that age on his own.", "INFO: You mention several times you were in a rush, but i don't understand WHY. Why was their a rush to do the shopping right then?", "\"*They of course sided with her.\"*\n\nYou mean because she was right? This is one of those rare MIL stories where she was 100% right.\n\nYou basically left your kids uncared for.\n\nIf you don't want to be your husband's caregiver then you need to just get out of the marriage.\n\nYTA.", "YTA\n\nYou're clearly overwhelmed but that is no excuse to abandon your children. They really had no supervision as you admit your husband has lapses in memory and isn't physically capable of intervening in an emergency or crisis.  \n\nYou need to ask for help.  As much for the sake of your children, as your own sanity.  You are stretched too thin but you had a serious lapse in judgement here.  The christmas shopping could be done at any time.  \n\nReach out to family and friends and check your local resources for in home help and respite.  You need to do the leg work and get help.  You are only one person, trying to do too many things i.e. being a mother to 2 young children, run a home and look after an adult with spinal cord injuries.  You need help and that's ok...  but don't just leave your kids virtually unattended because you needed a time out (and that's what that supposed christmas shopping emergency really was).", "YTA.  He has constant confusion.  Your children are 3 & 5.  Part of having someone watch over your children is having someone able to attend to the kids (and it sounds like your husband would need attention too).  It sounds like you had options too such as your MIL.  Instead you plunked them down with toys and went for 2 hours.  It must be difficult to be in your situation but your judgment in this case was very off.", "YTA..I was raised by a severely disabled father, however his disabilities didn't prevent him from caring for us. Your husband's disabilities do. This was a massive error in judgement. You need to find out what more help you could get and maybe grovel to his family and explain that you need more.support to stop this kind of thing from happening again.", "YTA You put your kids in a dangerous situation for no good reason. You know he has limitations on what he can do and decided the risk was worth it. Your Mother is right. Your own description of your husbands condition precludes him from being able to be responsible for small kids. \n\nChristmas is almost two months away, you could have waited until there was someone else to watch the children. You need to consider if there was an emergency could your husband handle it? In a fire could he get them out? There are a lot of bad things that can happen, and kids in that age range are hard to manage sometimes. YTA", "Unfortunately, YTA. Christmas shopping at the beginning of November is *so important* that you couldn’t have waited until you found someone to look after the kids? If your husband can’t take care of himself, how can he take care of your kids? \n\nI agree with MIL, and if she was over there to help your husband when he called, maybe you could have called her in the first place to come babysit? Then she wouldn’t be angry with you for this neglect and abuse? \n\nYTA. Christmas shop online or find a babysitter.", "So knowing that your husband is unable to even take care of himself properly, you left a 3 year old and a 5 year old in his care? For an \"emergency\" Christmas shopping? You have two whole months to do this. YTA. Something could have happened to your children.", "YTA, why would you leave your 2 children with someone who is incapable to doing basic care tasks for them?", "YTA. I get you are in a very difficult situation and your lives have all changed, but this wasn’t on. You know he has issues with confusion and plainly, would struggle if one of the kids got themselves into a difficult position. It wasn’t fair on any of them to just leave like that.  \n\nYou need to start asking for more help.  You wanted to go shopping. You couldn’t get the babysitter. That should either trigger you asking elsewhere, or simply putting off your plans. \n\nYour mother in law was correct. Not saying she handled it perfectly but she was likely in a panic about her son and grandchildren being in danger.", "YTA… there is no such thing as a shopping emergency that justifies leaving your children in a dangerous situation. Which is exactly what you did. \n\nI’m absolutely sure you’re pretty exhausted from the situation with your husband, taking care of him and two children. But when you feel burnt out and need a break you ask for help, you be honest and say you have to have a break. Clearly your MIL had time to come over and watch them and you didn’t even ask her… don’t let your exhaustion and stress decrease the level of care for your children and husband.", "YTA. Your kids are 3 and 5 and your husband is seriously injured if ANYTHING happened who would be able to help them?! You we're gone 2 hours and still not finished?\n\nDo your Christmas shopping online and get some help to look after your family", "Info: why didn't you reach out to have someone over for caretaking? Sounds like you actually needed a mental health break and you deserve that but you can't endanger your household over it", "YTA, Christmas is still a ways away, you could have waited for a better time…\n\nHowever, this sounds like caretaker burnout in the making, if it hasn’t started already. You need help.", "YTA \n\nHe's not capable of caring for himself, what on gods green earth makes you think he can care for two small children?\n\nI'm glad your MIL chewed you out, because you deserved it.", "WHAT THE HELL IS WRONG WITH YOU. You can't leave young children with someone in that condition. It's incredible dangerous. If I was your mil I would have immediately called CPS on you. Seriously what the hell", "I mean, yes, you are. If there had been an emergency of some sort, your husband would not have been able to help the kids and vice versa. Christmas shopping is not an emergency situation that needed to be done right at that minute. Why didn’t you ask your MIL to watch them when you couldn’t get the sitter to come over? I understand your current situation is difficult with your husband’s condition, but you put everyone in a potentially dangerous situation; it’s not like you left them alone for 10 minutes to shower.", "The circumstances you are in seem to have made it really difficult for you to see wants versus needs. The reality is that a Christmas shopping trip at the beginning of November is a want. Having someone in the house who is able bodied and capable, and can ensure everyone is safe is a need. Your life is creating compassion fatigue, which affects judgement and reasoning. You need help. More than a babysitter. The load you’ve taken on is too great, and there doesn’t seem to be an end in sight. So, while the family that piled on is correct when they say that situation you created is dangerous and YTA for putting your family in danger, it’s time for them to step up and help you. You can’t continue to do all of this on your own, nor should you have to.", "Not going to sugar coat this, YTA. You wouldn't expect someone with no arms to be able to hug you so don't expect someone who is not able to look after your children to look after them. Your husband seems to be doing what he can given his circumstances however he sounds limited based on what info you gave and given that info you did NOT HAVE to go shopping that moment and leave him solo with your children. You sound like you may be having some caregiver fatigue and maybe need to find a way to have some you time. However please make sure to do so in a way that doesn't leave your kids solo with your husband or your husband without any help.", "YTA\n\nChristmas shopping is not an emergency. If it takes you two hours, pretty sure you can find some other days when it is convenient for you and your family to go shopping. Leaving ur toddlers with ur husband who u know damn well is unable to do much when it comes to ur children’ safety is incredibly irresponsible.", "YTA, you didn't need to leave there and then. It wasn't an emergency. When you can't get suitable childcare, you rearrange your plans.\n\nI do think you and your husband should explore ways he can be with his kids and help care for them, perhaps some extra support to build his independence. I know many wheelchair users who are active and involved parents.", "Yta ,your kids could have gotten seriously hurt.  BUT your actions seem so nonsensical that I think caregiver burn out might be taking a part in your decision making, like the fact that it seems so rational to you that leaving your two extremely young children alone with your ill and disabled husband in a none emergency situation sounds like mental instability tbh .", "YTA. But I want to say that gently. You sound extremely burned out, and that could explain why you’re making bad decisions like leaving them home alone with him. Are you getting any help at all?", "YTA. Your children are too young to leave with a wheelchair bound person with a serious traumatic brain injury. He physical can't handle young children. You left your children unsupervised. (Edit: The serious TBI is the obstacle,, not the wheelchair, people with physical disabilities do an excellent job of parenting all the time).\n\nA lot of areas have caregiver support groups. Find out what kind of resources are available to you and use them. You made a terrible choice. You are also under an incredible amount of stress. It's no excuse for leaving toddlers unsupervised, but it's also a reason why poor decisions get made. Get support for yourself if you aren't already.", "You get +2 points for getting ahead on your Christmas shopping but -100 points for intentionally leaving your husband, 5 YO & 3 YO in an unsafe situation. You're very lucky nothing happened to them. \n\nYTA", "YTA, OP.  What if there had been a fire or something?  Your husband isn't in the proper condition to save himself right now, let alone two small children.  Look, I don't want to judge too harshly, because it sounds maybe like caregiver burnout since you're doing everything, but this was not okay.  Next ti.e, order online if you can't find someone else to watch your kids, or wait until they can.", "YTA. There is absolutely no reason you need to do Christmas shopping the first week of November. There is no reason to leave two small children with someone who literally can't take care of them. I'm having a hard time believing this is real.", "I'm sorry OP, I can't imagine how stressful your home life is right now.  Your MIL is right to flip out about this, though - it was a really bad call.\n\nAre you able to look into some kind of assistance?  Caring for two small children and a newly disabled husband is a lot for someone to handle on their own.\n\nYTA, but gently, because frankly given the circumstances I assume stress is kind of doing in your reasoning at the moment.", "YTA unless you live somewhere that you can recieve Zero packages because this Whole thing was avoidable by shopping online...unless you're going to admit the truth which is you have Caretakers Fatigue and got to a point where you broke and said \"fuck the consequences, I need to get out\" which is honestly how it sounds. You need to ask for help.", "YTA shopping is not an emergency. I get that you resent your husband for being a burden (caregiver fatigue is real) but you endangered the children; they are far too young for such limited supervision.\n\nIt’s okay to need a break sometimes. But the children can’t suffer for it.\n\nAny particular reason you didn’t ask MIL to babysit?", "You're getting a lot of Y.T.As.\n\nI'm not saying you're not, but it sounds to me like you need more help if this is where your decision-making is taking you.\n\nAre you the full time caretaker for your husband and two small children plus your household?\n\nPlease make sure you properly schedule and plan ahead for quality self care.\n\nAnd buy your Xmas gifts online.", "YTA. Why couldn’t you do it another time when you could have arranged for a sitter? I understand if you want a break but it’s utterly irresponsible to leave your children with someone who isn’t capable of helping them in an emergency. It’s as simple as that", "Yta. Your husband is constantly confused & yet you felt he was capable of caring for not just one but 2 toddlers?! So you could go shopping?!? Omg you are so lucky nothing bad happened in that time", "YTA. Christmas shopping is not an emergency and you put your children at a real risk. Absolutely unacceptable.", "YTA. Why wouldn’t you have asked your MIL? Clearly she was free since she showed up anyway.", "YTA\n\nWe are only *3 days* into November.", "YTA\n\nOnline shopping is a thing. What was your husband supposed to do if they got into the knives? Your mil is right you’re extremely lucky she popped in", "YTA. He can't handle watching them. This was dangerous. Imagine how your husband would feel, if he saw them get injured and could do nothing about it.", "YTA. You decided to go shopping thinking it would be ok. It wasn't ok, evidently because your husband is clearly unwell and not fit to look after the kids.\n\n3 & 5 is just way too young. If they were a few years older maybe, but at that age it's just too dangerous to leave them there.", "YTA like a huge one. You don't leave kids that small with someone who is incapable of caring for them properly. Had anything happened to those children your poor husband would never have forgiven himself, only it wouldn't have been his fault, it'd have been yours. You quite literally endangered your children's lives bc you couldn't be bothered to either say no to them, find someone else to watch them, wait to go shopping, or shop online. For the life of me, I don't know how you could type that shit out to post and not realize what a massive ah you were. I'm honestly wondering if this is even real.", "I’m sorry you’re in such a difficult situation but YTA and I can’t wrap my head around the fact that Christmas shopping couldn’t wait for a better time…", "YTA Online shopping is a thing", "YTA. You need to be honest with yourself. You know that he can't watch them properly in case of emergency. But it is understandable that you need a break, nobody's perfect. So I would turn this situation to your own good. Publicly (I mean to your MIL and family) admit that you were wrong and thank her to proposing to babysit. Make her babysit for free.", "Yeah, YTA.\n\nChristmas shopping is not even close to being an emergency during which you HAD TO leave your very young children with someone who can't even take care of himself.\n\nMaybe your husband should be in hospital or in a facility.", "YTA and i say that gently. I’m sure it’s frustrating trying to coordinate for any errands and seemed reasonable in the moment but your actions were unsafe. They were unsafe for your children and your husband. Your mil is right and I’m sure her reaction and delivery comes from a place of concern and panic in the moment.", "YTA - I can understand how exhausted you are mentally and physically. You just running away instead of ensuring your children and being watched safely prove that also that you may need to seek some help from a professional. Next time call someone else to assist your husband with the kids. I’m sorry you’re going through this and the exhaustion is very real but remember in all the chaos the kids come first.\n\nI would recommend planning for a weekend getaway just you - for some free time.", "Soft YTA. Obvs you're going through a lot. Taking care of two small children, under normal circumstances, is exhausting; on top of that, you have a husband to take care of as well. You must be exhausted all the time, and stressed out, and lonely, and I'm sorry. You desperately need a break. \n\nBut this was a bad call to make. So many things could've happened to your children while you were away, and it seems like your husband wouldn't fully register or understand it, and wouldn't be able to ask for help. It was very lucky that MIL showed up. I'm sorry she's giving you a hard time (though it can't be easy for her to see her son so vulnerable), but you definitely need to make sure you leave your kids with someone who can fully take care of them. You could've postponed the Christmas shopping to another time when MIL or your babysitter could stay with the kids (I mean, it's Nov. 3, you got time).\n\nPlease take care of yourself and get more help.", "I don't know if you're necessarily an asshole, but you definitely need some parenting classes and skills.  Who tf leave a 5 year old and a toddler with an adult incapable of caring for them? Irresponsible and stupid, if you ask me.", "Gentle YTA OP. I know you're likely feeling trapped, overwhelmed, exhausted etc. And just needed to get some things done and needed a change of scenery and a bit of a break. But you did screw up by leaving a 3 and 5 year old with your diabled hubby. Things could've gone very wrong. Please get help. This is not the way.", "Yta! Why couldn’t u have asked her to watch them for a few hours? It really doesn’t seem safe that u left them worth your husband", "As a person who was a caregiver for 10 years.... This hurts to read.  I understand the suffocating responsibilities.  You cannot safely leave the children with him because he is likely not safe alone.  For those pointing fingers in the family, ask for help.  There is no shame in asking for help.  Your mental health is more important than you realize.  Please take care of yourself.  I'd hug you if I could.", "YTA. How is Christmas shopping an emergency? You are so lucky that nothing happened while you were gone.", "YTA your husband isn't capable of watching children due to the injuries, it's not that hard to understand", "YTA\n\nYou didn't really need to go Christmas shopping there and then. Its not like its tomorrow there was no real reason to rush! Its not like you need a appointment to shop for Christmas presents. You left someone completely incapable of looking after the children alone with them cos what you wanted was more important. I get you need a break as you have a lot on your plate, but this is NOT the way to do it.\n\nYou can order online, wait till you get a sitter, ask MIL, friends, other family, but you didn't. \n\nYou left your kids and disabled husband in a potentially dangerous situation for TOYS.", "You DID NOT *have to leave,* you stated in paragraph 2 that you *WANTED TO LEAVE*. I understand that your responsibilities are overwhelming, but you can not risk your children’s lives and safety like that. That is definitely a YTA thing and a cry for help. Have you contacted local organizations regarding respite care and other services for your husband and your family?", "YTA, sorry. \n\nIf your husband just had a spinal cord injury leaving him paraplegic it would be different, many wheelchair users make great parents, but the head injury makes it a no go. He's not cognitively able to care for the kids, by the sounds of it he wouldn't be able to call for help if needed or recognise a dangerous situation and act accordingly. The fact he wasn't able to stay awake shows his level of disability and it sounds like you didn't even ask MIL if she could babysit when obviously that was an option if she came over. \n\nI get needing a break from caring, I absolutely do, but you need to make sure that you put support in place first to allow for that to be done safely.", "YTA. There is no earthly reason why you meeded to Xmas shop that badly in the first week of November that you had to leave your two, under six, children with someone who is in a wheelchair and gets confused/loses track of time. \n\nWhy couldn't you wait until you could get a baby sitter? You're MIL is right (a rarity for AITA), you are very lucky she went over and the children did not injure themselves.", "YTA not a major one but you need to recognize why. It sounds like you are the sole caretaker for the 3 of them. That is extremely exhausting. I understand why you would feel you need to take a break from it. However, this was incredibly irresponsible. He is not in a state where he can be left alone with these young children. It seems he may also need consistent supervision as well. 2hrs is a long time with these conditions and it also seems you didn't put your best foot forward with trying to find help because your MIL was able to stop by. You could have asked if she'd be available. \n\nIt's important you get a break, but make sure everyone is safe FIRST. If you continue the way you are rn the next time you might not be so lucky.", "YTA, you basically left your kids by themselves and in danger. They’re 3&5. If they were older and could watch themselves, it wouldn’t be an issue but one is a literal toddler. If they swallowed something and choked, got into chemicals, or anything that could harm them, fell, got hurt etc how would you expect your husband to help them?  You put your children in an unsafe situation for Christmas shopping you could of DONE ONLINE. I understand you’re probably burnt out and overwhelmed caring for everyone in the house and we all need a breather but does not give you the right to leave your children with someone who cannot safely watch them. Shop online or coordinate with the babysitter for her next available day. It’s November, there’s time to Christmas shop.", "YTA and you need to ask for help. If family can’t or won’t help, then you have GOT to look elsewhere.  \n\nBurnout is real and will lead to more bad judgement calls like these if you don’t take action now.   \n\nI’m not in the US so can only go by my experience here in the UK. Is there any organisations you can call like social services? Any charities or programmes you can reach out to for support?   \n\nPlease get some support. You will be no good to your children or husband if you keep running in empty. \n\nYour children have already lost the father that they knew, please don’t let them lose their mother too.", "YTA, was the shopping worth risking your children?\n\nI get that you’re overwhelmed and stressed and need time to yourself but endangering your children isn’t the way. If the baby sitter couldn’t come then you reschedule. \n\nMy mom had a toddler cousin who died when her mom stepped out to borrow something from a neighbour. She was gone moments.\n\nMy cousin got his hands on scissors and cut his own lip in half when he was 2. His dad was supposed to be watching him while my aunt was in the shower, but he was watching TV. He was right there!\n\nYou left a 3 and 5 year old effectively alone with our supervision and without help if there was an emergency. Same with your husband.\n\nI know this is a sign you need help. I hope you get it.", "YTA\n\nKids should only be left when there is a responsible adult to look after them. Your husband has a head injury with constant confusion- he is not a responsible adult who can look after them.\n\nBut you’re clearly experiencing carer burn out and feeling desperate. A babysitter is great and all but who is helping with things like showering your husband? Cooking dinner for the family? Everyone needs a break sometimes and I’m guessing you aren’t getting one. You need to get some help. Maybe MIL and family could help?", "Leaving 3 helpless people for hours while none of them are even capable of using a bathroom on their own isnt just cruel, it makes me wonder if the resentment of having to care 24/7 made you leave them in a harmful situation so the 'problem' would fix itself. I think you need serious help.", "YTA. Constant confusion? Nope. Nope, nope, nope. From your own description your husband is not in shape to watch children. He was unsure, your kids are way too young. And on top of that, what if something had happened to your husband?\n\nChristmas shopping can be carried out in a lot of different ways--wait another day until the babysitter can come, do it online, tell the kids you're buying stuff for the angel tree, use it as an opportunity to teach them they \\*can't\\* have everything they see.\n\nThat said, do you have any help taking care of your husband? Is there respite care in your area? Will his insurance pay for someone to watch HIM so you can get some time to yourself or just you and the kids?\n\nBut you can't leave the kids alone with someone who cannot take care of them. Who cannot stop them from doing something dangerous. Who, it seems, can't even dial 911? Or know WHEN to dial 911?", "Why the rush? You had time to contact the babysitter but no one else? You HAD to rush out RIGHT THAT MINUTE to go Christmas shopping??? \n\nI know it must be physically and emotionally exhausting being the caregiver for two young children and a husband with disabilities like yours has. You need help and a break from time to time. However, the choices you made were not good and could have caused harm to any one of the three. \n\nI’m gonna have to say YTA.", "YTA, while I sympathise with your situation, you put your children in danger to go shopping. You essentially left a 3 and 5 year old to fend for themselves because their father is no longer physically or mentally capable of caring for them. \n\nI'm really astounded that you cant see the danger in what you did. Thank heavens MIL showed up. You 100% deserved the chewing out you got. \n\nThere is no reason you couldnt have waited to go christmas shopping when you had proper care arrangements in place. \n\nI'm actually quite angry reading this post thinking of all the things that could have gone so horribly wrong for your children.", "YTA,  you basically left your young children alone", "YTA \n\nRead what you wrote", "YTA it is November would waiting a few more days hurt Christmas shopping that badly? Is this about shopping or were you burnt out and needing a break? You were the AH you could have seriously hurt your husband and/ or the kids by leaving them.", "So basically, you left your assumingly very young kids with insufficient care because you were in a rush to .....christmas shop? It's November. \nOP why did it have to be that day? Couldn't you make proper arrangements to go on a shopping trip? Also clearly your mother in law was available, why didn't you ask her to come over?\n\nYTA like how could you possibly think you aren't?", "I get wanting to be discrete for the kids sake, but it’s 2022 and Amazon exists. You can shop for them online while your husband is recovering from….checks notes….a SPINAL\nCORD INJURY! Sorry, YTA.", "YTA.  So what would have happened if a fire broke out.  How is he supposed to get the kids and him out?  Kids also meddle a lot when no one is watching them an able to stop them from doing something dangerous.  Next time communicate with someone and have them come over and watch the kids.", "YTA. Kids that young cannot take care of their injured father. If they were 12 and 10, sure. But not 3 and 5", "YTA. Why didn’t you ask your MIL to watch the kids if you were so desperate to go Christmas shopping at that exact moment?", "Yes YTA. He’s wheelchair bound and has a head injury. What would have happened if one of your children choked?", "YTA if you know your husband isn't capable of watching them, why would you leave them with him!? Why not call your mil and ask her to come over or any one else capable of it? Or better yet, why did you have to go Xmas shopping at that very second? If you don't have someone to watch your kids then you don't go. Plan a day when the babysitter can watch the kids and go then.", "I think your judgement is impacted.\n\nDo you have any help at all?? You have two toddlers and an adult that needs round the clock full time care it sounds like.\n\nYour MIL magically showed up when you went out, so why couldn’t she come to the house to give you a break?", "First thing I want to know is why you were in such a rush and why this couldn’t be planned out better? Your MIL was over so why didn’t you ask her? YTA OP, how is that even up for discussion? You admit in the first paragraph that your husband is physically and mentally unable to care for the kids on his own, yet you leave him alone with two young children who probably aren’t equipped to take care of themselves properly. And why did you HAVE to leave, that makes zero sense. I’ve never heard of emergency Christmas shopping in early November. This whole story feels off to me, like shopping wasn’t your real reason or you are leaving out some big details. And for 2 hours?! Shame on you.", "YTA how irresponsible can you be? I understand needing time away but you endangered your own kids and you knew it when you walked out the door.", "How are you finding this mentally, with having to do all this on your own, Do you receive any help from anybody. I think you have your hands full.", "YTA, next to the obvious handing your children to someone clearly incapable of handling his own kids, you pin it all on them and being \" in a rush\"\n\nThis couldve been planned. It is not because there is a green light from retail they are stocking up, you need to rush out as if its the day before...\n\n1/ it is way to early and you can plan\n2/ why is it you wanted to go but suddenly you were in a rush. In my eyes there was no emergency to shop right this instant and i dont believe your day are fully booked until the 25th of december and there was absolutely NO time.\n3/ why did this emergency take 2 hours??\nYou know he is wheelchair bound, cant act in an instant if something happens. Children can practically vanish in a half hour and make a huge mess in an instant if not fast enough.\n\n\nSo why the rush?", "Were you an AH? Maybe in the moment. \nDo you have respite care for your husband?\nRegular breaks from the kids so you can run errands?\nI don't mean a babysitter you can call but someone who comes a couple of hours twice a week or a preschool you take the kids to. \n\nThis was a dangerous choice. It could have turned out badly. \nPlease figure out something else.", "YTA. It's early November, you have plenty of time to online shop and things will still arrive on time. It sounds like your husband is incapable of handling the children on his own and you left them in an unsafe situation. If you had to leave to get some distance to clear your head and regroup it seems like you could have called your MIL to relieve you for a short break.", "YTA I’m going to guess these aren’t your bio kids because you refer to them as “the kids” instead of my kids or our kids. You made a HORRIBLE unsafe decision to leave them with your husband. Did you even try contacting anyone else about babysitting other than the babysitter? Because you clearly didn’t ask your MIL", "Wow I’m sorry I know it must be hard being the primary care giver to everyone but …. YTA !!! Your children are not old enough to do basic tasks for themselves and your husband isn’t able to do them for them either ! You might as well have left them at home alone !", "This is about more than christmas gifts.   I think christmas gifts really mean time alone to regroup.    You know what you did wrong and i think there is more to it. That being said, you have a heavy lift in life, seems like you are taking  3 people plus yourself. Ate you able to do this long-term.   What help do you have for husband and can you get and for how long.   It was poor judgment to leave them . But i also worry about burnout because you need help.  Ask all those people to come help and do it.   When you need help and then if they say no tell them to shut it.  They don’t get it and wont help .   Try to find help so you aren’t taking everything on in the house.  Try to get a carer for your husband etc.", "Soft YTA because your life is obviously not easy, and I’m so sorry for your family’s situation. However, 3 & 5 y/o is WAAAAAY too young to effectively be left to their own devices. While it sucks that the babysitter couldnt come, it sounds like your MIL was free? Did you even try to call her, or are you guys often butting heads so asking her for help hurts your pride? Christmas shopping is not so important that a toddler and a very young child should be left with someone who is physically and cognitively incapable of taking care of them. Take this as a wake-up call that your family needs more help and support than you are currently getting.", "YTA, and sadly in denial about your husband’s diminished capacity. Please get help.", "YTA", "YTA. The shops are open every day you know. Your actions were idiotic and dangerous and your MIL is absolutely correct in her observations.", "YTA, you know what you did. I think you know your TAH. You went shopping…..\nThis was not an emergency. You could have waited until someone able bodied could help. Sounds like you could have called your MIL. This was horribly irresponsible for so many reasons.", "I'm surprised you don't understand this... YTA you left your kids unsupervised. Your husband is clearly not capable of looking after them for 2 hours when he was unable to stay awake for 2 hours.", "How can you be in a rush to do Christmas shopping when it's the first week of November? \n\nI think there's missing information here.  \n\nEither way YTA", "Yta. He can’t even care for himself properly but you expected him to be able to SAFELY care for two children under the age of 5 for two hours?!?! For gifts not needed for 2 months? Not like you were running to the bathroom! This could have waited until you found a sitter, your children are priority. \n\nAll the gifts in the world do not matter if something would have happened to them because of your reckless negligence.", "At what point did you selfishly think leaving 2 children under the age of 6 with a heavily disabled parent was acceptable. \n\nThey could have seriously hurt themselves or their father. \n\nIf that was me I'd call social services. That is really bad judgement and could have resulted in serious harm to your children/or husband. \n\nYour MIL is right. You need to seriously grovel. \n\nYTA.", "YTA You left two small children with someone who is still recovering from terrible injuries to go *Christmas shopping*? Have you lost your mind?!\n\nYou either should have stayed home or called his mom. Instead you chose to neglect your entire immediate family.", "Yeah, YTA. It’s a tough situation and normally leaving the kids with their father: absolutely fine. Leaving the kids with their father when he’s in a wheelchair: also fine. Leaving the kids with a father who is constantly mentally foggy and confused? Not fine at all.", "YTA - It doesn't sound like your husband is in a state where he is capable of looking after children. So effectively you've left your children alone. If you couldn't find a baby sitter or someone capable of looking after them, you shouldn't have gone Christmas shopping. Do it online, or go another time. It's the start of November, you have time! Why didn't you ask your MIL? She was planning to come over anyway! That being said I'm not envious of your position, looking after 2 children on your own can't be easy, but you messed up here.", "YTA \n\nIt sounds like he’s genuinely not capable of looking after them so dropping them in front of him with toys and expecting him to just deal was cruel and neglectful.\n\nIf you can’t get a babysitter then you wait to go shopping.", "YTA so you’d rather go do something unnecessary for 2 hours than make sure your children are safe? Let’s not pretend that this was all about doing something for the kids. This wasn’t a need.\n\nYou could’ve waited until you had proper childcare. \n\nThis speaks to a larger problem and everyone in this family deserves for it to be addressed properly.", "YTA. This wasn't an emergency that required you to bolt right out the door. This was a leisurely shopping trip for some alone time. You left 2 small children with what is effectively a disabled man in a wheelchair unable to care for himself. What if God forbid there had been a house fire? Could he have even managed to get himself out, let alone corral two young and scared children onto his wheelchair and get all 3 out safely? Say one of thr kids got ahold of something small and put it in theor mouth and began choking? Could he have performed the Heimlich or been in any position to help? Would any of that been worth it for a few cheap gifts from over priced retailers 2 months before Christmas?", "YTA - I totally sympathize that your situation is hard and you needed a break. However it was wrong to leave your young children with your husband when he's not capable of looking after them at the moment. Something serious could so easily happened to one of them if your MIL didn't come over.", "YTA. Maybe the 5 year old would be ok but a 3 year old needs constant supervision. You really thought the toddler would just sit there quietly for 2 hours???", "YTA online shopping would've been the way", "YTA. You basically left them unattended. You could literally go to jail and lose custody of your children for this. Don't do it again. Sorry your babysitter didn't show up, but that happens sometimes.", "YTA you described your husband like someone with a very reduced mobility and in a semi-confusional state, then you wrote down that you left your kids alone with him. I don’t know where you live, but where I live you could be charged for child abandonment.", "They are 3 and 5, not 13 and 15. Seriously, do better next time.", "There are like 4,000 ways any one of the three of them (poor husband included!) could have been hurt, maimed or killed. You didn't run next door for a cup of sugar, you left for 2 hours!\n\n4,000 x YTA \n\nPS if you don't want to take care of your husband, it's better you leave than torture him and let your kids grow up thinking that's an acceptable way to treat disabled people AND partners!\n\nEdit: not advocating leaving disabled partners. Advocating against AH being neglectful caregivers.", "Miss ma’am it was November 2, there is no way you NEEDED to RIGHT THEN AND THERE rush out to get some Christmas shopping done without taking the time to ensure your extremely young children and disabled husband were properly taken care of. YTA.", "YTA. Um. You didn't have to leave, you chose to leave. You chose to pick a day where you couldn't find someone to watch your kids. You chose to be neglectful by leaving the kids with your wheelchair bound husband knowing he can't watch over them properly. And, you chose to give up on trying to find another person to babysit them because you were \"in a rush.\" Nice parenting, OP.", "YTA. You did NOT need to go out right then and there you should have waited either a day or a few hours until you could have gotten someone to come over. I get it I do you're burnt out but that does not excuse you from putting your kids in danger and your husband as well just because you WANTED to go Christmas shopping. Get some help please to help take some of this stress off of you. Look up resources that can aid you guys.", "YTA, but you knew that.  Why the rush?  You chose to leave your children with your husband who was incapable of adequately watching them.  Your MIL is correct, you failed parenting that day.  It sounds like you are suffering burn out.  Do you not have anyone who can assist on a daily basis, especially assisting in housekeeping and tending to your husband?  You need to take a deep breath, look to your mental and physical health and what can be done to meet the needs of your family.  Call your MIL and tell her she was right, you weren't in your right mind and ask for help.  Let her know you've been so overwhelmed and made an error in judgment and would appreciate her assistance.  It's best to have her as an ally.", "YTA and jesus.   It sounds like your husband needs a constant carer, never mind your babies?  Do you get those babies could have been killed?    \n\n\nDo you understand that CPS will absolutely TAKE YOUR KIDS if you pull a stunt like this again and get caught?  You left a 3 and a 5 year old functionally alone and unsupervised.  People go to jail for stuff like that.       \n\n\nHoly shit.  I really hope this is not real.", "YTA, why didnt you call MIL in the first place? Clearly she was available", "You shouldn’t have done that - what you do need to do is look into respite care and see if you can find a way to get a break. Caring for small children is stressful. Caring for an adult with that level of disability is stressful. \nWhile his mother has a point, are you getting much support from her and the rest of the family? Was there an option of calling her to come over and hold down the fort?", "YTA. I don't want to infantilize your husband, but it doesn't sound like he was equipped with the tools to properly watch his kids. You prioritized Christmas shopping over your kids' safety and wellbeing... you should plan to go another time when you have more time to secure a sitter.", "Christmas is 2 months away. You're not crunched on time. You could have made plans and had someone watch the children. You knew this wasn't a good idea and still did it anyway. \n\nYTA. And ffs wait for December.....", "YTA.\n\nSometimes MILs can be right", "YTA, Christmas shopping is not an emergency, what you did was incredibly irresponsible, you know well your husband is incapable to watch the kids, you might as well left them all on their own, and you cannot take your eyes of little kids, especially the 3 year old.\n\n1 could of called a baby sitter in advance to book a time \n\n2 ask family for help in advance \n\n3 shopped online \n\nXmas shopping isn't important to do right away, you could of planned and organised this well in advance.\nHonestly you got a lot self reflection to do because you fucked up.", "I know you're overwhelmed, taking care of an injured spouse and two young children.  But leaving your children with a man who is unable to properly care for them is wrong.\n\nYou need to get some  help.  Can his mom help out when you need a break?  Will insurance cover a caregiver?\n\nSoft YTA, because you're in a horrible situation.  Please, reach out and get some resources.  You're lucky nothing happened to either your children or your husband.", "YTA\n\nMost shops have online stores and you have almost 2 months to do the shopping. You were negligent.", "YTA and I don’t see how you can defend from this one. Online shopping? Maybe waiting to have someone ready?", "YTA\nOh come on you had to leave? No you chose to. Seriously your kids are 3&5 and you knew your husband couldn't care for them properly. Yet your Christmas shopping had to be done right that minute. Like someone else already said do better next time. You're lucky no one was seriously injured.", "YTA big time.  You were in a rush to Christmas shop????  Anything could have happened. And what was your husband to do in emergency?", "YTA you left your young children without a capable caregiver for *hours* to do an errand you have more than a month to schedule safely. I wouldn’t blame your MIL for calling CPS.", "My dad is disabled from a spinal cord injury along with head trauma and I honestly cannot believe you left your children alone with him. My dad also falls asleep in his chair and I cannot imagine what went through your mind as you left. \n\nYou left a 3 and 5 year old with someone who 100% could not take care of them. You put all three of them in danger. I don't believe you didn't think anything bad would happen.\n\nYTA and are very lucky your MiL showed up when she did. And the fact that you were gone for 2 hours? I just cant wrap my head around this.", "YTA\n\n\"I wanted to go shopping\" \"I had to leave\" ... Which one is it. If you *want* to go shopping, you don't *have* to leave. your husband had a spinal cord injury, god knows what can happen and hes in a damn wheelchair.   \n\n\nYou should've made sure someone was there with them, and you're definitely the AH for abandoning them for a shopping trip that doesn't have any rush.", "Yta. He can’t watch them. Plain and simple. What if something happened? You’d never forgive yourself and neither would he", "YTA. Christmas is quite sometime away so you didn’t have to go now. You could have waited until a day where the sitter was free. I know it’s probably overwhelming at times but you can’t leave kids that age on their own with an adult who gets confused due to a brain injury even if that person is their dad", "YTA are you kidding me? \n\nHis mother is right, you were extremely irresponsible with your children. You didn't *need* to go Christmas shopping. You purposefully left them with someone you KNEW wasn't capable of watching them. The hell is wrong with you", "YTA\n\nChristmas shopping wasn’t an emergency. If your MIL randomly showed up, it seems she would have been a good option to help watch your children. \n\nBeing a care giver to a spouse with a TBI and spinal cord injury plus having 2 young children cannot be easy.  Who helps you? I can believe you need time to yourself but better planning has to happen to keep everyone safe.", "YTA Christmas is 2 months away, online shopping would have been a totally viable option.", "What item was so vitally important that you needed to leave immediately, but simultaneously frivolous enough that you didn't feel rushed to return said item home where it supposedly belongs? \n\nReally, 2 hours?\n\nYTA", "YTA, why were you in such a rush? It's not even December, yet. Why didn't you ask your mother in law to come over to watch the kids? What is something happened? 3 and 5 are way too young to be on their own.", "I mean, I'm not going to call you an asshole because I can't imagine how stressful your life must be with a three year old, a five year old and a husband with a complex injury/disability. I get the feeling you probably don't get many moments of rest. It wasn't a good call to leave your kids with your husband because he couldn't look after them in an emergency, but I can't even begin to judge because boy are you living a difficult situation right now.", "Of course you are. Even in an emergency this would not be acceptable.  YTA", "YTA wtf? How are you even here asking this?", "I’m sorry but YTA in the best way possible. \n\nYou truly were thinking for your kids in the moment wanting to buy them gifts, but leaving such young kids with someone who if something happened could not do a single thing and honestly should have someone watching them as well, is child endangerment. \n\nOne of your kids could of done something and died all while your husband would of had to sit there unable to do anything. Sometimes the rush truly isn’t as important as making sure everyone is safe. From how it sounds it really seems like a lapse in judgment due to dealing with so much all by yourself, but in this cause it was a very dangerous mistake.", "YTA\n\nAt no point when you typed out this story did you think dang I’m an AH? I don’t understand how you write this and then go yeah I’m not that bad of a person.", "YTA. You WANTED to go Christmas shopping. You didn't have to. you could have gone on another day when help was available. how irresponsible and selfish!  It wasn't an emergency. There is no justification for leaving your husband and kids to fend for themselves like that.", "The family of course sided with your mother in law because she is 100% correct. You are lucky your actions didn’t result in an injury to your children and/or possibly having them removed from your home by authorities. \n\nYTA\n\nEdit to add - where’d you really go? Not buying that you were out Xmas shopping for 2 hours in the age of online shopping…", "YTA and it’s called edging Amazon!", "YTA, you can buy almost anything online and have it delivered, it’s barely November, plenty of time. That said, get a regular carer in to stay with your husband and kids so you can schedule this kind of thing. If mother in law is so outraged, maybe she’d be willing to put in a day to care for her son and grandkids.", "Your husband is confined to a wheelchair, and you thought it would have been a wonderful idea to let him watch your young kids? You can't be this ignorant, but here we are. YTA, and not a soft YTA. \n\nWhy didn't you call his mom, or your mom, in the first place? What an AH.", "YTA 100% you keep saying you were in a rush but just wanted to go shopping? That’s not a need to rush and 2 freaking hours?!?!\n\nLook you are obviously under some serious pressure but that doesn’t excuse leaving children with someone who can’t take care of himself let alone anyone else. This was so incredibly selfish, anything could have happened. \n\nGet some help.", "YTA - nothing about “wanted to go shopping for some Christmas stuff” is urgent enough to warrant leaving your very young children with your seriously disabled and immobile husband. \n\nWhether you need to shop, or have personal appointments, or just get a very deserved break from being a caretaker, you have a responsibility to find appropriate care for your kids and you failed to do so. \n\nI have a hard time believing that you took the time to type out how you left your 3 and 5 year old with a wheelchair bound adult with a brain injury for a few hours but it’s ok because you put them on a blanket with toys, read it back, and thought “yep, I really did everything right”.", "I’m sure you’re exhausted but YTA. That is extremely unsafe.", "YTA. You knew your husband was unfit to watch them, knew he was unsure about what was even going on, and act like in 2022, there aren’t many other ways of shopping and getting Christmas gifts than having to physically go in store for hours.", "YTA. This was not an emergency. You did not need to go shopping.", "YTA - Why didn't you wait for a day when the babysitter was available to do your Christmas shopping? It's the 3rd of november, ffs, it's not like it's urgent? You can even buy every type of gift online! So this sounds like an excuse. If you need some time for yourself, that's acceptable, but plan it better. Just imagine if something happened to the children and your husband was unable to intervene. That's downright cruel.", "YTA no reason Christmas shopping couldn’t wait for another day you risked your kids safety for no reason", "Oh you are for sure TA.", "YTA. You left a disabled man, a toddler, and a child alone, for something that could be rescheduled and planned better. You are a horrible mom and wife for doing that and even thinking that you might be right. How dense could you be.", "YTA \n\n…just…what???", "YTA. This can’t be real. Did you hope the kids would get into an accident? And your husband couldn’t stop them? At their age, they’re death seekers. Your husband is not capable of looking after them, he’s basically a child himself.\n\nI don’t know if you were hoping something bad would happen or you’re so exhausted from having 3 dependents that you weren’t thinking properly, but this is a bad thing you have done. \n\nAnd there’s no rush to get Christmas presents, so why couldn’t you wait until you get someone?", "YTA\n\nI can not believe you would put your 3 and 5 year old children in such danger. What if they had turned on the oven, or wandered into the road? How do you expect someone's who can't even stay awake or keep track of time to be able to react in time to save them?\n\nListen. I have brain injuries, bad enough that on a bad day I can forget that I'm cooking something while still in the kitchen. \n\nI have a high needs 3yo. I would never leave him alone with someone with such injuries, and I would be furious if his father left him with me while I'm having a bad symptom day. \n\nImagine if something *HAD HAPPENED* would that sale on crappy toys and fall apart ornaments have been worth you coming home to a dead toddler?\n\nIt's November. You have more than enough time to oder what you need online. If you don't want to pay shipping, then make a damn pick up order and get it when your kids are *safe*.\nHell, you could even take them for a pick up order,  and just tell the employees it's Christmas stuff that needs to go in the trunk.\n\n*edit for spelling. You got me so mad, my brain is foggy.", "people severely minimize the work that goes into being a caretaker. Caretakers are emotionally and physically drained all the time and are never allowed to show it. You are THE caretaker for your now basically disabled husband, and you have two small kids at very hard ages. You sound like you need a break, I feel for you. Time for your mother in law to come watch the kids and your husband at least twice a week so you don’t go insane. You are probably exhausted. But unfortunately you made a bad choice. My kids are also 3&5 and I would have considered the same thing when I’m at the edge of a mental break. ESH", "Getting used to someone having life changing injuries is difficult and sometimes you can mentally credit them with more ability than they actually have. I’m sure that you felt looking after the children was a simple task, well within your husbands remit.\n\nYour screaming match probably came from the frustration and helplessness both you and your MIL feel right now and your husband watching that and indirectly being the cause probably feels even more useless than he did before.\n\nGentle YTA for going, but both you and the MIL are TA for arguing in front of him", "YTA. You knew better!", "First things first yeah YTA, but I can see you pov. There are times when I feel rushed to get things out of the way but much like any other emotion it’ll cloud your judgment. I’ve come to learn that when this happens it’s best to stop and re-look at somethings. I’m moments like this when you calm down it’s easy to see that there were other options. Hindsight can be a bitch.", "YTA. You not only neglected the children, you actually neglected your husband. Abuse and neglect all around. You would never choose a a sitter who you felt was in capable of physically, watching your children, yet, you feel comfortable enough to pick up and leave to go shopping for holiday, leaving behind your entire family, unsupervised which makes zero sense. If something happened to any of them, you would be in a ton of trouble. Your MIL bitching at you is the least of your problems…", "Way, WAY too young to be left alone with a seriously disabled caretaker, who needs his OWN caretaker.", "YTA and  a bigger one for that clickbait title", "YTA…for leaving two young children with someone who clearly is not able to take care of himself, let alone anyone else.  How you think you could not be?  Are you crazy?  Or just plain stupid?  Honestly, you either need some serious help or need not to be caring for these children.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\n\n\nMy husband was involved in an accident that injured his spinal cord so badly he needed to have a wheelchair. He also suffers from a head injury that causes him to be unable to perform some tasks properly as well as constant confusion. Sometjmes he'd lose track of time.\n\n\nI take care of the house and kids on me own. Yesterday, I wanted to go shopping for some christmas stuff but couldn't take the kids because firstly, they'd want tk get everything they see. And secondly, I didn't want them to see what I bought them. I couldn't get the babysitter to come watch the kids like she does usually when I'm out. I was in a rush, what I did was place the kids ( 3&5 )and their toys near my husband and asked him to just keep an eye on them. He was unsure of the whole thing but I had to leave.\n\n\nDuring my 2nd hour of shopping I got an angry call ftom his mother berating me for leaving my husband with the kids knowing he's unable to watch them properly. I went home and she yelled at me there saying thank God she came over because she foubd my husband asleep in his wheelchair and the kids were out of sight. I said I was in a rush, the babysitter didn't come and thought it wouldn't hurt if he watched them for a couple of hours. She argued about how irresponsible I was to leave my husband with the kids knowing he's unable to watch them like any other able bodied person could. She said I should've made sure someone was with the kids and my husband. I had a screaming match with her and my husband just watched. She left and told her family about what a horrible mother I was and even claimed I was abusing my husband by giving him tasks he can not handle. They of course sided with her.\n\n\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. ….   You put your kids and husband in danger.", "YTA\n\nYou know your husband's limitations.  You shouldn't have left your children alone with him.  \n\nIt sucks, I get it.  Your husband should be able to take care of his kids.  I can't imagine what he feels, knowing that he can't be the normal fun dad his kids want and need.  He isn't what he was anymore.  You cannot treat him like he is.  You're prolonging the suffering of him and you by not coming to terms with his current state.  Do better.", "YTA. You left your children in an unsafe situation. You know your husband is not capable of looking after them, yet you left them, with someone unable to care for them - to go Christmas shopping - in November. You're incredibly lucky your MIL just chewed you out and didn't call CPS. You're even luckier that nothing bad happened to your children while they where being left without sufficient supervision. You need to seek help for yourself and your husband because clearly you're not coping. A brain injury can be extremely life changing and devastating for everyone in the family.", "YTA I understand this was a rush but your MIL seemed free. To leave your younger children with someone who is not able to care for them is not right. Maybe around the corner for some milk but hours on end while your husband suffers from constant confusion as you put it is negligent. Maybe make plans to have someone come once a week or once bi-weekly so you can get a break to do shopping like this but don't jeopardize your children.", "YTA you made an impulsive decision that could have ultimately ended in disaster for your children. I hope that sinks in", "YTA. This wasn't an emergency and it doesn't sound like your husband can handle the kids at this age. \n\nCaregiver burn out is real. Do you have a social worker that can help her you resources to give you a break?", "YTA You screwed up here. I am so sorry about what HAS to be a very heavy burden on you right now but it doesn't change the fact that your kids are small and your husband is incapable of being a responsible adult for even a couple of hours. You can blink and a kid this small can literally have their lives hanging in the balance...and that can go VERY badly with no to little adult supervision.\n\nYour MIL wasn't wrong to be upset but I sure as heck hope she is helping you out as well.", "YTA, no this is beyond AH behavior this is just cruelty!", "You are most definitely ta. First of all, online shopping would have been a better option, second, IF U ARE AWARE THAT UR HUSBAND IS UNABLE TO WATCH KIDS PROPERLY WHY STILL GIVE HIM THE TASK?? And third the kids are 3 and 5 right? How did u expect it to go smoothly exactly? A disabled man in a wheelchair unable to perform certain tasks properly ( including babysitting toddlers ) watching 2 toddlers who themselves don’t know any better, just playing around possibly injuring themselves? I agree with MIL 100%", "I completely understand wanting some time away. But YTA.", "YTA, well done on not caring for your kids properly.", "YTA. It’s the beginning of November and you decided Christmas shopping as an emergency. It is not. And while usually parents should be/are capable of parenting their children it’s obvious that your husband can’t in this circumstance.", "Wow. Do you even care about your children? You may as well have left them alone. Huge YTA. Also, online shop or go when they are in school or you have an able bodied suitable and safe sitter! It is only just November it wasn't an emergency. Jesus.", "YTA\n\nWOW, great parenting and good to know u have ur husband's best interest at heart! So many bad things could have happened and ur husband would not be able to protect or help the children. It's so sad to see that u took the time to type and post this, without any sympathy or remorse. Shameful!", "YTA. shopping? really? omg", "I guess online shopping doesn’t exist 😑", "I won’t shame. This woman has been through so much, as has dear husband. Both have long roads ahead. I can’t imagine. And really feelin for the wee kids. Given severity of injuries & still unknown recovery, spontaneity for unplanned Christmas shopping 🛍 isn’t an option. To be fair to kids & husband, he still requires care & not that kind of stress.\n\nWife is probably caring, dedicated & burnt out. But she still shouldn’t of left such young children alone to just Christmas shop Nov 1st…..I base this on Dad, & he is still recovering from a severe head injury. Sure folks using wheelchairs take care of kids. But this dad was in a horrific accident w/ multiple physical traumas he’s still rehabbing from. Outcomes still unknown.", "You HAD to do christmas shopping in the beginning of november? like you absolutely HAD to? What…. uhm since you asked, yes YTA. a big one too. \n\nalso YTA for screaming at ur mother in law. if i were ur husband i’d get a divorce asap \n\nyou could’ve done the shopping in december, when you had a babysitter. its not the end of the world to not do it in november when you didnt have anyone to watch the kids either. christmas isnt going to be ruined if you didnt go shopping now", "YTA. Dear god. You need to call the hospital and ask for a caretaker information session. You are wildly unprepared and uninformed about your husband’s condition.", "A spinal injury requiring a wheel chair + a head injury in which he basically has involuntary lapses? And you were like “hey let me leave him with our MULTIPLE children (who sound young btw) and no other adult supervision? \n\nYTA.", "YTA and you know it. You just wanted to be selfish.  Do better", "Yta. Yeah, xmas is in what 55 days? You couldn't order through Amazon or wait till you have a sitter? Your husband absolutely couldn't watch them and you owe him and your MIL a big fat apology.  I'm hoping this whole post is a creative writing experiment because you should KNOW throwing toys on the ground for a 5 and 3 year old is just beyond.  If I were your husband I would question you as a mother too.", "YTA\n\nWTF did I just read?? \n\nYou left two toddlers AND a very disabled adult alone for two hours?? \n\nAnd you were planning on leaving them alone for longer & only cut your shopping trip short because you were called away? How do you have zero common sense?! Were you raised by wolves? Wait - not a chance, wolves aren’t that irresponsible.", "YTA for leaving your kids in an unsafe environment. They are young and basically unsupervised.", "YTA for the pure fact something fatal could have happened to your toddler's. Like it seriously boggles the mind.", "If something would have happened to your children you would have felt guilty, not blame your husband. YTA", "I want to start out with sympathy, because your situation is far from easy. Neither you or your husband asked for this, and I can’t imagine how hard it must be as a caregiver to your husband while also managing a household with two small children.\n\nThat said, in this situation, YTA. Have you thought about what would have happened if your children had hurt themselves or gotten out of the house while you were away? What would your husband have done? Was Christmas shopping really worth that risk?", "YTA.  It was Christmas shopping, not an important appointment or a medical emergency, Christmas shopping.  You should have made sure you had someone capable available to watch the children or you should have scheduled your shopping for another time.", "It seems to me you don’t have much help or a good support system as a caregiver. Maybe it would be better for hubbie to have some professional care so you can focus on taking care of the kids and yourself. I understand you might’ve been desperate to leave the house for a little while, mistakes happen. Maybe this is the wake up call that things need to change. Your children deserve you happy and present even if that means hubbie moves to a facility. From how it reads it doesn’t seem like he will be  much of a parental figure to them with his condition. Make changes that will benefit you and your kids in the future. He will be taken care of by professionals and MIL, they need to be taken care of by you and have your full attention. I’m not sure if your husband will get better in the future but even if the situation is temporary I still think it’s a good idea. You and the kids can visit anytime and know his needs are covered. No one is in a stressful or negative environment, resentment doesn’t need to grow. Just a suggestion.", "YTA \n\nJust wait for a sitter next time. You badly need a breather it sounds like so this is a very light yta in my opinion but if anything had happened you not only put your kids in danger but your husband would have just had to watch whatever happened without being able to stop it. \n\nI recommend checking out some sitter websites. Meet people beforehand and such but you need time to yourself, even if it's just shopping for a few hours.", "You know you can just order gifts online right? And pretty much everything else you can do online. This was hugely irresponsible and if anything happened to the kids while you were gone you would never forgive yourself. Please don't do this again. YTA", "If I knew who and where you were, I would notify DCFS. YTA", "Why is this all OP’s responsibility? Bad decision? Probably. \nWhen does she get to take care of things? She’s not just a nanny and nurse aide that squeezes outside errands in. Where was MIL prior to this? Why has no one brought in an aide to help? It’s easy to bitch at OP but where is the help? If DH is not capable of being alone then he needs an aide or assisted living. \nI have been in this place and there is no real “happy” or “okay” answer. OP made a bad decision but is NTA. Just a burned out person expected to do everything.", "YTA, do you not like your kids? What the fuck were you thinking?", "You poor thing, the stores are only open for two hours from now until Christmas where you live. That must be very difficult for you. \n\nTruly hope no one is this inconsiderate and selfish. You ARE the asshole.", "NAH\n\nI can't even imagine how exhausted and lonely you must feel right now with two small children and a severly (and suddenly) disabled husband. \n\nI feel like you were just desperate to get away for a minute and used Christmas shopping as an excuse and had a major lapse in judgement. You can't leave your children alone with your husband. You're grieving the loss of him and I don't know if you have any system in place for your new life. You need to get some therapy and figure this out. \n\nI don't know your MIL, but I'm going to give her the benefit of the doubt. She is also grieving the loss of her able-bodied son and she may have overreacted, but it was out of fear. If you two got along before this, maybe reach out to her and tell her that you need help. If she was dropping in, she might have been able to babysit for you.", "I'm not going to call you a AH for it but leave two kids with someone who has your husband's disabilities was unfair to him and the kids. I understand you wanted to get away and go Christmas shopping but the responsible thing to do is wait until you could get someone to sit with your husband and kids.", "YTA, but go easy on yourself. You need to take a realistic look at your husband's capabilities and plan based off that. If doing everything yourself is too much, then you need to find other crutches to lean on if it can't be him right now.\n\nYou probably shouldn't have left your kids like that, but you also need to take an honest look at the stressors in your life so you don't burn out.\n\nBest of luck", "Info: how did your MIL get into the picture? You never indicated how she became involved with the situation.", "You are caregiver for three dependents.  This is exhausting.  Then the MIL comes over and, instead of helping, starts throwing a fit.  If she had that much of a problem with it she could have pitched in -- having a screaming match is not helpful at all. \n\nI'm sorry for everyone who wants to blame you for being overwhelmed by an overwhelming situation.  Quite typical for women and mothers on Reddit.  Best of luck, and NTA.", "ESH. If she was so worried, why couldn't she watch them?", "YTA and a terrible mother", "ESH. Your MIL was right, but she didn't' need to scream. What you did was wrong, Full Stop. You need help, real tangible help. \n\nYour partner is incapable of caring for children in his present condition. You need respite care. Please look into getting a babysitter on a regular schedule (like you know they are coming for a few hours every Tuesday and Friday or something) so you can have plans outside of caregiving. Your MIL should have seen the struggle and actually tried to help rather than just yell at you for making a very dumb decision. \n\nPlease look into what social services can help you with, or in home caregivers, it doesn't mean you love your family any less, but 24/7 caregiving and parenting will burn you out. You thought what you did was okay.", "If you know that your husband can’t watch the children properly, especially because of an injury that wasn’t his fault, then WHY THE HELL DID YOU LEAVE THEM WITH HIM???\n\nThis is grossly selfish and irresponsible. You could go shopping the following week when you had time to get a proper sitter.  Oh and it wasn’t that “the babysitter didn’t come”, it was that they told you flat out they weren’t available. Stop trying to make it sound like they just didn’t show up. \n\nWTF would you have done of something went wrong and the kids had been hurt or worse?  Did this even cross your mind? \nYou probably could end up with child endangerment charges for leaving them with someone you KNEW was incapable of watching them. \n\nIf you’re overwhelmed & are feeling like you can’t cope, then you need to get help, ASAP. Literally endangering your childrens lives is NOT the answer.", "NTA- instead of judging you what is his family doing to help you? You’re having a hard time and also need time to yourself. Please try to join some carer groups, therapy and if you can single parenting groups for support (no shade intended but you are raising your children alone even though he’s there.) if you have a social service team in your country you may be eligible to get respite services to get a carer in to get help with your husband so you can have time to yourself. His family are the ah for not only leaving you to care for him and two children alone but judging and criticising you without helping first.", "[removed]", "ESH", "If you can’t take of him like you should and have 2 kids I think it’s time for you to leave because girl.", "nta i feel bad for you you need to take care of yourself, you srent a full time nanny for your kids AND your husband…", "NTA - as a mother it sounds like you just needed a damn break. Were likely at your wits end and probably could of caused way more harm  from a breaking point there managing 3 very likely needy beings.  Would it have been better for your MIL or a sitter to be there yea likely... but sounds like you need grace so I'll solidly back my NTA but please ensure you have help.", "Yta", "YTA like I get that you may have caregiver burnout but I don’t really care in this situation because you put your kids in an extremely dangerous position and that is NEVER okay! Next time ask a family member to come by if you need a break or set up baby monitors and go in another room. You cannot be so irresponsible", "YTA\n\nYour kids are 3 and 5. Your husband is disabled, can't get out of a wheelchair and gets confused very easily. This does not sound like a safe environment for your children. You could've waited to go shopping until you had proper care lined up for the kids. \n\nMy judgement seems harsh because I don't particularly think you're an actual asshole. I think you're a human being who is stuck in an impossible situation and you're probably experiencing major burnout. I would suggest setting up regular babysitting care so you can have some time to yourself.", "This just shows they your MIL was probably free and you didn't bother asking her.\n\nYou are already the AH for letting him alone with the kids, but it's wise if you didn't even tried everything you could.", "Yta don't want the 3 and 5 yo to see their gifts Jesus ever heard of Amazon. Then u can take them with u instead of endangering them with a man who can't physically intervene if needed Jesus lady", "YTA. Why is Christmas shopping at the beginning of November so important? Your husband is mentally not fit to watch the children, you say he is constantly confused, can't perform some basic tasks, and loses track of time and yet you still thought leaving your young children with him was appropriate to go shopping? How do you NOT see an issue with that? Caregiver burn out is a real thing, but that doesn't mean you can just fluff off responsibility for your actions. Why did you not just call MIL in the first place and ask for a hand? Good grief.", "Wtf lady. You’re oblivious. If you can’t get a babysitter YOU DON’T GO! What if this accident hadn’t happened and he’d been at work. No babysitter do you just leave the kids at home? Maybe you should try crate training them? \nYour mother in law is right. This was incredibly neglectful to the kids and abusive to your husband. I can’t imagine how stressful that was for him. YTA", "Yta. From what you’ve said, your husband is unable to properly watch your kids. This was not an emergency situation where you had to be somewhere. You can Christmas shop online, go on another day, take them with you, or call someone else to watch them. You put them in danger by leaving them in a situation where they weren’t properly supervised. What if they had gotten choked on something, and he wasn’t able to intervene in time?", "YTA, you could buy Christmas gifts on any other day when the sitter is with the children. If anything happened to your children your husband would not be able to do much. They are too young to be left basically alone.", "YTA. \n\n“He was unsure of the whole thing but I had to leave.” \n\nNo the fuck you didn’t HAVE to leave. You weren’t getting food and toilet paper, you were buying things you could buy online and have delivered or go pick up after purchasing. You endangered your kids and your husband so you could go Christmas shopping. What if one of the kids were killed or injured while your husband was asleep? Would you then blame the confused and physically handicapped person for the incident? Please consider finding someone more intelligent than you to provide care for your family, you are incompetent at best and criminally dangerous at worst.", "YTA. Your shopping was not an emergency. Get over yourself and do better by your husband and children.", "Screaming, berating and blaming are not productive, including the MIL. Granted, they’re easy fun. They may even be justified upset. But it’s more useful to strategize ways of preventing caregiver burnout— hard to do in a country that has poor healthcare and social services networks. Long term, those are the problems that must be addressed. Short term, we’re all in this together. Which is why I am saying that the pileons are not helpful.", "I’m sorry but YTA. Why didn’t you ask your MIL to come instead of leaving your husband alone with them? Something serious could have happened.", "I think my favorite part of your post is how you mention you were \"in a rush.\"  You were in a rush to do what exactly?  Nothing that one would categorize as an emergency or top priority.  However, it was so important you thought it would be a wise decision to have your husband who was \"*involved in an accident that injured his spinal cord so badly he needed to have a wheelchair. He also suffers from a head injury that causes him to be unable to perform some tasks properly as well as constant confusion. Sometimes he'd lose track of time.\"* keep an eye on the children.\n\nGod forbid something had happened to the kids, what were you thinking your husband would do?  Or what if something happened to your husband like a seizure because of the accident, what were you thinking the children would do?  Your actions were very irresponsible.  His mother was right to scold you.  \n\n  YTA.", "YTA.  Though it can be easy to see that this shopping trip was mostly a guilt-free reason to give yourself a break with what is likely a physically and emotionally overwhelming situation for you. While you deserve tons of empathy, what you did was wrong.", "You need to see a therapist and receive real training.  Start taking reasonable babysitter time to treat yourself a little (spa days, girls night out).  You are clearly overwhelmed and your title here tells me you are frustrated with your husband’s disability.  I’m sure he is too", "YTA. How can someone who isn't able to take care of himself is going tobtake care of 5/3 year old kids? \nYou got lucky that nothing happened during those 2 hours.", "This one is going to be unpopular but NTA\n\nit's ok to want to take a break and actually go physically shopping instead of online, yes he is in a wheelchair but he could have stayed awake to look after them. You aren't a single parent and the fact that everyone wants to lump everything on you without compassion is cruel.", "I'm probally going to down voted for this but I'm going ESH, except for the kids and your husbend. Christmas shopping in November IS NOT AN EMERGENCY no matter how you spin it and I think you know that. It sounds more like you were desprate for a break and made up whatever excuse you could. You put your kids in danger. But something seems off that you couldn't/ wouldn't ask your MIL to watch them if you needed a break. Two small kids is A LOT with a supportive able-bodied partner, and doing it alone, plus taking care of your husbend sounds pretty over-whelming. You clearly need more help than an occasionally baby-sitter, and considering you did not reach out to her and MIL went screaming and gathering the family henchmen to come after you first thing, I'm guessing they may not be that supportive. \n\nYou messed up here. Period. But I'm choosing to believe that you know that. It might be time for a) seeing a therapist if you need help dealing with your new role and b) finding reliable help so that you get time for yourself.", "YTA. If you need a break which is understandable you need to get proper care for your husband and kids. You can’t abandone three people who cannot care for each other alone. Truthfully you could get cps called on you for this and if hubby can’t take care of himself elder abuse. You’re struggling and I understand being a caretaker with two young kids is hard but what you did is so dangerous. Get someone to come help you around the house and get some therapy to deal with the grief you feel for this situation. Understandably you are overwhelmed but still YTA", "I agree with everybody here. OP YTA in this instance but you need help with everything you're dealing with. Don't take what people are saying harshly. They understand it's a difficult situation", "What you did placed a 3 and 5 year old at risk. Your MIL could have handled this more graciously but I can't blame her for being horrified and angry to find that her grandchildren had been left in a potentially incredibly dangerous situation so you could go Christmas shopping at the beginning of November.\n\nI appreciate you are in a very difficult situation, but YTA.", "OP have you considered having your husband move back in with his parents and seeing if his social security will help pay for part time aide? Or putting him in an adult assisted living facility?\n\nIt sucks but you have 2 small kids that need a parent and it’s clear you’re starting to burn out. The children need a functioning parent. One is already out of commission and the other is mentally fading from exhaustion into a shell of her old self.\n\nNot saying divorce your husband but something has got to give and his parents need to step up and help more since you have 2 little ones that need to be raised right now. Hubby can always move back home after you’ve had a mental break for 6 months, a year, or when the youngest gets into preschool. \n\nBefore everyone starts hating me I’m not saying for OP to abandon her husband. I’m just saying to do what needs to be done to stay mentally present for the kids before they end up with two parents physically there but not mentally and emotionally there.", "Big time YTA. You’re husband, and I hate to say this, is physically and mentally incapable of taking care of kids at this moment. \n\nFirst off what distracted you enough to make you go Christmas shopping, IN NOVEMBER, that you needed to be out for 2hours while your seriously injured husband watched the kids. \n\nSecondly, how close is your MIL and why couldn’t she watch them? \n\nAnd finally, why didn’t you take your kids and lie? Like the easiest lie is to say that these are for you to send to Santa because you’re one of his helpers. Or just say “these toys aren’t for you kids. I’m buying presents for one of mommies friends birthday”", "YTA and I say that as someone who had a career supporting caregivers and their people as well as having spent a year as a caregiver to a sick spouse. \n\nWhat you did was irresponsible, selfish and DANGEROUS. I mean, if there was a fire they all could have died. I wish that was a super “out there” possibility but the kids are far too young to be left with a confused person in a wheelchair. How could he have wrangled them both? All it would take is 5 deciding to cook something. \n\nYou should be glad he was able to call MIL. \n\nYou should also be looking into paid carers who come on a set schedule to give you respite. IF you get on top of that, the YTA is gentle, if you think this was reasonable and you’re in control the YTA is firm.", "On this issue - YTA, the kids need better supervision\n\nIn general, I'm concerned for you - caregiver fatigue?  Is there anyway you can get help from the family even if it is for a few hours a week?  Perhaps address them with an I'm overwhelmed and make a mistake.  I need help. (clearly MIL can stop by periodically!)", "YTA. But it’s times like this where I’m glad I don’t feel sympathy and would gladly abandon my two children and disabled husband for my own happiness.", "If they were old enough to basically watch themselves, feed themselves and take care of minor things themselves, you would have been fine, but no. You left a preschooler and a kindergartener with someone who *cannot physically take care of them*.\n\nYou chose irresponsibly and left your children AND HUSBAND in a dangerous situation.\n\nYTA", "YTA. You said yourself he has limited mobility and cognitive difficulties.  He should not be in charge of watching kids.  If you thought he could handle it you wouldn't have thought it necessary to move the kids toys to be near him.  Those kids are very young and obviously will wander off and get into trouble.  Nothing of what you were doing constituted an emergency either.  You made an awful decision.", "Yeah sorry but YTA. You are perfectly aware that your husband has limited mobility, gets confused and loses track of time... and you leave him alone with small children? You said you were in a rush but were you? You were going shopping for Christmas stuff, it's the beginning of November. There's plenty of time, meaning there was no rush. \n\nYou could have ri-scheduled for a time the babysitter was available or call your MIL and ask her to look after you children while you were out. \n\nYou are probably exhausted for caring about your husband and your children on your own and you wanted a break, that's understandable. But you were irresponsible here.", "YTA. Your husband can’t handle certain tasks on his own. He also has memory issues. And you expect him to watch 2 kids. For hours. Because you HAD to go shopping. What if there were a fire? Or what if one of the kids fell? Or started choking? Would your husband know what to do or be able to help?", "YTA \nHe absolutely wasn't the one to leave the kids with based off of your description. \n\nbut it sounds like you're overwhelmed to be honest. Well I mean, I would be, that's a lot of things to be taking care of. 🤔 \n\nMaybe have a sit down with your MIL and have a talk with her about her coming to help a bit more often.\nTheres nothing wrong with asking for help. \nYou're literally taking care of two kids, while trying to help out another adult.\nThat's not easy.", "YTA.  It is November 3rd.  The Christmas shopping could have waited a few more weeks.", "YTA.\n\nIt’s not a great situation, but for shopping?  That’s not dire.  \n\nYou know most stores deliver, right?  There’s this small site called Amazon that has almost anything you can legal think of as well.  They’ll bring it to you, within days usually.  Well before Christmas, and you can have them wrapped if you’d like I believe.  You can certainly have them delivered to where the kids won’t see them.\n\nJust a thought for next time", "OP - you need support. Your are not an asshole, you are struggling.", "Yta. You put your children and husband in a bad situation and it could have been much worse. He could have fell out of his wheelchair the kids could have ran out of the house etc. Caregiver burnout sucks and it's draining but you can't put your husband and children at risk when you want to break away.", "Yta but you need support not a telling of good luck with everything", "I hate using the word AH in this situation because you obviously have too much on your plate. Memory loss aside..what if on the kids was injured in some way, got themselves into a dangerous situation etc. Your husband would have been UNABLE to help no matter how much he may have wanted. Do you have any family/friends nearby that can give you some respite? Contact his drs office to see if they have a social worker service that can help set up some respite care.", "INFO: why didn’t you call MIL to babysit\n\nAnd for what it’s worth you can buy presents with kids that age. Tell them the stuff you are buying us for someone else. I raised 3 kids on my own. You just make it work", "I know your situation is overwhelming but yes YTA. You know your husband can’t properly care for them. This wasn’t an emergency. This kind of thing will get your kids taken away if anyone calls CPS. Needing a break is understandable but you ask for help. If the sitter couldn’t come then wait or call someone else.", "YTA but I do understand. Your Husband is recovering from something you don’t understand and you can’t expect him to be alert and able to take care of your kids. I had brain surgery 18 months ago and would fall asleep out of no where or be very confused and forget how to do things as my brain started to heal. It’s very hard to be the partner who is helping and understand what he is going through. I hope he had a speedy recovery.", "YTA you did the equivalent of leaving them with a child or an alcoholic or drug addict. If one of the kids swallowed something they would have chocked to death.", "YTA - i have 3 year olds. I cannot imagine trying to watch them from a wheel chair with a head injury. You literally endangered the life of your three year old.", "Why were you in such a rush to go shopping? YTA. You weren’t late to work or in an emergency situation. Literally I can’t understand why you were in SUCH a rush to get to wherever you went shopping? It doesn’t make sense. And that was more important than making sure your kids were safe with someone who could watch them properly? The MIL is actually in the right here for being mad. \n\nI get you must be burnt out raising them basically alone, I know it must be hard, but this isn’t okay behavior and if you need support mentally please seek help from a professional because this is showing you’re not thinking clearly. Why didn’t you call MIL to come over? It’s clear she was available if she just came by. Utilize the resources you can. It sounds like you need that help.", "YTA.  \n\n>She said I should've made sure someone was with the kids and my husband.\n\nShe is right.\n\nHe clearly can not watch the kids so you put your kids in danger just to go shopping.   You could have even called his mom to come over, since she was available and was coming over anyway.  You did not make an appropriate effort to have someone to watch your kids and you are lucky MIL came over and that the kids did not get hurt.", "I think finding a way to get care for husband is good. Split time with the in laws or your family to take the kids some days a week.\n\nThis needs to stop for you.\nYou can’t care for a disabled man, work and make the house run, and 2 kids alone.\n\nWhat you need is to not be responsible for this. If you have to…divorce husband so that his family takes over. Find a way to relieve this 24/7 caretaking.\n\nIMO, this woman was the asshole in her decision but from a place of instability. \n\nThe fact MIL isn’t taking part time cqre of her child while your trying to care for the other literal children is mind boggling. Shame on MIL and everyone around who isn’t THERE. \n\nThis is why I’m leaning towards divorce. Husband will not be able to help, kids will not stop being small kids for a few years, you are putting others in danger including the husband. What if they set the house on fire? Husband wouldn’t be able to save hisself or kids.\n\nGotta seperate as much as it takes to create a safe environment and that probably won’t happen without serious time away from caregiving.", "YTA. You know full well that your husband cant even take care of himself yet you decided to leave 2 kids that he, 100%, cannot take care also.\n\nYou did that over something that you can do some other time. Christmas is more than a month away. You can find a babysitter for one day on that time.", "YTA", "YTA. I’m not gonna be mean about it, I know some people on here are about it. Sounds like you’re burnt out and denying the fact that your husband isn’t capable of doing everything he could before. Have you thought about hiring any sort of help for him or for your kids? Even if he wasn’t disabled, every parent needs some sort of break and shouldn’t be burdened with being responsible for everyone 24/7. I encourage you to reach out to MIL or other family members that would be able to help, you don’t need to do this alone.", "YTA \n\nYou understand how fast a 3 year old get's in trouble at home and the five year old as well.  How was he to cope if either or both got hurt?  And you KNOW he can't baby sit for them.  What you do need is some time off for yourself, and to call for help when you need to escape, even if for only a few hours.", "Soft YTA because honestly your whole situation sounds SO stressful.\n\nYour husband is sadly not a safe care taker. Deep down, you knew that. He knew that, which was why he was so uncomfortable and it was made clear when your MIL came home to find the children had run off and your husband was asleep.\n\nI understand you have baby sitter. I’m sorry you don’t have family to watch them, but it’s true they are not obligated to do so. It sounds like you should have chosen another day when you would be free and your baby sitter would be free as well. It may not hurt to look into a back up sitter.\n\nWhat are your options with daycare? Is it within the budget? I imagine your medical expenses are hurting your finances a bit, you need time to decompress too and to get things done.", "For all the screaming that your MIL did was she actively watching them or did she just start wailing at you? You needed help why couldn’t she look after your family for some hours? Really it sounds like you could use some help in general. YTA but for leaving two small kids under your husbands watch and he physically can’t watch them.", "Oh, OP, honey. You need help. A lot of it. Respite care. \n\nInfo: How often do you typically have a babysitter watch the children? \n\nYou made a grave error in judgement, but I don’t think you deserved to be yelled at for it or called a horrible mother for what on the surface appears to be one lapse in judgement - but I also don’t think you needed to be screaming back. Plus, this wasn’t an emergency you needed to leave for.", "YTA. You endangered your kids. Why didn’t you ask MIL to babysit so you could shop? Obviously she was available.", "Yes YTA he can't properly  watch them it was not safe to do that. I read the title came here to be firm not the AH. I was assuming your husband was a typically functioning adult. Then I read your post. Girl you know that was not ok\n\nThey aren't old enough to be left alone and that's essentially what you did. You are a few years away from being able to leave them home", "You should have called mil also why didn’t you but if she was spiteful that’s a quick way to loose your kids please ask for help regardless of how long", "YTA. Despite some of the commenters feeling sorry for you, you left toddlers essentially alone. Anything could have happened. What if there was a fire? You seem to think your MIL and husband's family were out of line but you need a serious reality check", "YTA\nWhy were you in a rush?", "I feel your pain and frustration so completely. I am in such a similar situation to you. In Feb this year my extremely fit and healthy husband had a series of strokes caused by a massive heart infection. He was in hospital for 3 1/2 months. We have two kids, a 2 and 4 year old. I also have a 15yo from a previous relationship. He has had to learn to do everything again. He couldn’t stand up, sit or walk for months is on a feeding tube and is constantly dizzy and forgetful. I have to do everything for everyone and I feel like I’m losing the plot a great deal of the time. I can’t keep up with housework, I never have any time to myself and I always feel like I’m dropping a ball somewhere. I would love to be able to afford a babysitter!\nI feel your desperation for a normal life. I feel your ache for the life you had before he got ill. Life is just not how we planned it is it 😔. \nYou did make the wrong choice on this occasion but I completely understand what you were feeling when you did it. I hope things get easier for you. My husband is getting better but it’s a slow, slow,slow process. Please take care x", "YTA. I'm gonna be a straight with you as possible. Your husband was badly injured. Your kids are 3&5. They are far too young to be left alone with someone in his state. He needs someone to look after him as well, you can't leave your children alone in his care. What you did is absolutely considered neglect. In my State, what you did could honestly have gotten your children taken away from you. Even if it was only two hours.b", "I can't believe you thought it'd be okay to leave your kids with your husband who is disabled so much that he cannot even take care of himself. What if something happened to one of your kids, who was going to take care of them? YTA and I fully get your MIl being as upset as she was not just bc of the neglect you showed for your kids well being, but your husband's as well. And while I understand you need a break you need to do it the right way, not going about it irresponsibly then getting upset when you're called out on it.", "This is beyond a Reddit judgement. It sounds like you’re struggling and make a bad decision in the heat of the moment. It’s ok. Just move on. I’m sorry you’re going through so much", "You need to look into placing him in a care facility or hiring a home nurse. Also I think you know you can’t leave your kids with him and you know your MIL is correct. I think your at the end of your rope and you wanted a moment of normalcy. You need to see someone for help and his family needs to help you with there son. No one is TA here I just think the whole situation is a lot for all involved.", "You’re getting plenty of sympathy in the comments but I hope the message is clear OP. YTA, and you need to ask for help. What you did is neglect.", "YTA \n\nYou were in a rush for Christmas things at the beginning of November. Yeah right. This is something that could have waited until you had a baby sitter. \n\nYou left your kids with your incapacitated husband who may not have been able to help the kids if they got hurt.", "YTA understandable but still an AH", "How the F\\* is she an a\\*\\*hole? Her husband's disability doesn't mean he is forever saved of taking care of their kids. That deadbeat fell asleep in 2 hrs while she was gone. She is a nice person for staying with a person like that! NTA, OP!", "This is an important point, to me. I don't know that I can even call OP TA since it sounds like she's struggling with an absolutely overwhelming situation and no one around her is willing to offer her support. MIL could come by the house without notice but can't be relied upon to help? What about any of the other people judging OP for leaving for what sounds like the first time in a while alone. It was irresponsible for sure, but there's a lot of quiet desperation in this post. To OP's credit, she's not blaming anyone else for it or even complaining about the fact that she's suddenly gained a caretaker role she wasn't anticipating and it's thrown off the family's balance for parenting and house management. I think she made a bad decision based on frustration, previous parenting patterns that are no longer in place, and possible burn out. People around them should be reaching out to help OP, not screaming at her and publicly shaming her.", "Exactly this! Was she TA yes she was and it was unsafe for children that young to be left just with toys and a person who is not capable of caring for them. However I can only imagine the burnout she is experiencing and that leads to errors in judgement. She needs to let his family know she needs help and she needs it asap.", "YES...I was just going to comment this with a gently YTA. I can *feel* the struggle of the OP in her comments. \n\nOP...**please** reach out for help. Even if you don't like your MIL, please for the sake of your children, reach out. I feel as if you are very close to burning out and need to seek some other resources as well. I don't know what is in your area but I'm sure there has to be something. Sit down with your MIL and discuss the situation and help her to understand your frustrations and potential for burn out. But next time, please do not leave these children alone.", "This should be top comment. OP, please read and heed. You are doing no-one involved any favours by trying to pretend all is well.", "Agreed. OP caregiver burn out is a very real thing.  Please find resources near you to help.", "You could also call the hospital he goes to and ask for their social worker.", "Replying to bump up. Please try to find a way to take better care of yourself. Sending hugs.", "Yes, OP YTA in this situation but you know you didn't make that decision because you don't care about either your kids or your husband. You are stretched thin. You made a bad decision that could've ended very badly but thankfully didn't, and your MIL is right. I think you know she's right too. It's easy to get defensive when your ability to parent is questioned but I feel like you know there was a huge risk in what you did. I would apologize to your MIL and explain that you realize you made a mistake and that you're sorry for blowing up. Maybe ask if there are ways they would be better able to support you. \n\nWhen is the last time you truly had some time \"off\" from being a caregiver? Real time off where you didn't have to worry about anything?", "You should look into home health care for your husband as well as having a babysitter for your kids. You deserve some respite care for yourself. This is a LOT to handle and it sounds like you’re trying to do it all.", "Was giving you an “I voted” award weird? Maybe. But it was free and what I could do. I hope OP listens.", "OP, this is it right here. I became my mom's caretaker at 16 for the same reasons. You need more help", "Good answer, I feel a lot of the ppl judging these posts do so without a shred of sympathy. I can totally see how she could convince herself this wasn’t a terrible idea. She is the asshole, but I hope she knows that she can be better and come up with safe solutions to her stress. I have a 2 and 4 year old that I am the primary caregiver for, burn out is real.", "This response has the empathy I think OP needs", "I don’t think she’s really in the right frame of mind either.", "This is what I was thinking. Yeah, OP made a bad decision but it sounds like she might be overwhelmed and that makes people prone to extra bad decision making. I hope she's getting help and that this burden doesn't fall on her alone. Good luck OP.\n\nYTA for leaving your kids with your husband like that, but I am sympathetic.", "This is the kind of comment we need to see more of! Thank you for asking if OP needs help, she’s still the AH for leaving her kids with her husband who is clearly unable to look after them properly but it would be a lot for her to handle too and I can’t imagine how stressful it would be in situations like that.", "I mentions this too. I'm pretty sure she does have this and she needs to find a way to get her time without leaving her children or husband in that situation again.", "It's only 52 days till Christmas!", " \"I had a screaming match with her and my husband just watched.\"  This sentence tells me that you haven't accepted the reality of your situation.  What did you expect him to do at that moment?  Your husband is not the same person he was before the accident and giving him tasks he used to be able to perform is not going to change that.  YTA.", "Agree, OP needs to find some respite care for her husband as she sounds burnt out. Even just for a long weekend once a month.", "Parent who are experienced in their wheelchair are as capable as any other parents, but he has a TBI and likely isn’t super proficient in the chair yet. On top of that, it’s the beginning of November, the holiday shopping can wait until the babysitter is available.", "Agree, being \"in a rush\" to Christmas shop is NOT an emergency. And shopping for 2 hours? For a 3 & 5 year old? Now I can see if it was black Friday shopping and getting them deals and steals....but no, it's too early in the game.", "Or waiting until a sitter can be found. It's no where near Christmas. Totally irresponsible, poor guy is in a wheelchair FFS", "Yes, you definitely need to *schedule** time for yourself. This is imperative for your health, especially since you’re taking care of your husband and 2 toddlers.\n\nYou need to ask each one of those family members that are calling you an AH to come assist you. But good luck with this. /s", "I think OP needs help and therapy because.... I feel so sorry for OP because they are expecting support and help from their husband that he can't provide because of his condition, and YTA because leaving young children alone with someone who is incapable of caring for them properly, it was foolish and dangerous, their safety and well being are above Christmas shopping.\n\nOP really needs someone there to support them.\n\nIf it becomes too much to handle, OP should consider what to do about their family situation.", "Also, it's November 3rd.  I get going shopping early, but still...", "Very well said. When I read the post I too was confused and surprised that OP couldn't see how dangerous a situation she left her children in. I'd give you an award if I had one!\n\nAnd OP YTA!", "I have brain injuries, and a 3yo son. \n\nOnce I recovered, this is something I potentially would have left my partner for. If he were to so ridiculous to do this in the first place, let alone react like OP is.", "I can understand why she's starting xmas shopping now (I hate crowds) but I had no confidence in her husband's ability to take care of the kids by the way she described her husband. If they were older, maybe I'd give her a pass.", "I was wondering the same thing. The fact that OP never thought to ask MIL after the babysitter couldn't make it gives me the impression that MIL isn't normally inclined to help OP with things, but is there in a heartbeat to yell at her for her f*** up.", "I think MIL might need to be asked or notified that assistance is wanted assuming Mil lives in another home and isn't telepathically linked to OP but it does seem like Mil has no trouble making it over", "Or, she wasn’t really just shopping for the kids. She could’ve said she needed some alone time or self-care time, or wanted to leisurely shop for herself to feel normal. That would’ve at least been honest. \n\nI feel for you, OP, but obviously YTA. Nobody’s going to help you if you don’t ask for it. \n\nThe family is siding with your MIL because she’s right. What you did was truly irresponsible. You might as well have asked the kids to watch each other, that’s how ridiculous your thought process was.", "I understand caretaker burn out, I really do, but yeah why did she HAVE to go, in such a hurry? \nOP, did you even call MIL? \n\nThis is a sad situation, but op you need help with it.", "No unfortunately no one's willing to help. Even his mother. They'd say they'd come if I call or let them know I need help but on many ocassions they'd ignored me. Thus I hired a babysitter.", "My best guess is either that she was desperate to get out of the house or because prices usually go up the longer you wait.", "All the gifts in the world don't matter, if there's nobody left to give them to...", "Disagree, what if there was a fire or some other emergency in the home. What if the 3 year old got out the front door and into traffic etc etc etc. So many things that could have gone wrong and the most capable person in the house was a 5 year old. As a mother this behaviour terrifies me.", "While I agree (and agree it was irresponsible to leave the kids with him) she probably needed a break and to get out of the house for a little", "My mom had a toddler cousin who died when her mom ran next door to borrow something from the neighbours, it can happen so fast!", "My mum had some neighbours who were irresponsible with their little boy. They left him unsupervised in their bathroom and he died. It's genuinely frightening how unbothered OP seems that her decisions here could have killed her children.", "Pull back on the judgment maybe? OP sounds overwhelmed. She needs more support! Still, soft...\nYTA", "Right?? Also online shopping exists.", "Plus she didn't even ask the MIL or she would have found out she already planned to come over.", "Not giving her a pass but I think she’s having a breakdown. Like no sane person would do this.\n\nI’m a MH professional (although carers are not my specialty) and this seems like a person who is really close to committing some acts that her family can’t come back for. OP desperately needs help, hoping their MIL realised after the anger has worn off", "I dunno, maybe working, mothering two kids, and caring for a husband with severe limitations. She sounds exhausted and not thinking clearly.", "I agree, and I also think it sucks that the mom called in the troops to abuse the OP.  That doesn't help anything.", "She is a TA though, it sounds like her mother in law was very available to watch the kids if she had called them.  I agree she probably is super stressed but that isn't an excuse to leave kids in a dangerous situation.", "What does this mean “YTA in the best way possible”?", "And there’s only 1 day you can Christmas shop….a call to CPS next time", "She was in a HURRY!  Couldn't wait to get another babysitter.  The Christmas shopping had to be done RIGHT THEN. /s", "Agreed! Also if anything happened to the children, the husband would feel so miserable and useless because he was there watching everything and unable to do something", "I don't understand her reasoning though. Why was she in a rush to *Christmas shop?* It's early November, there is ample time to do Christmas shopping. She couldn't postpone the trip until she could get a proper babysitter? This wasn't her running a quick errand either, she was gone 2 whole hours? She also never bothered to search for alternatives after the babysitter? The mother in law clearly is living close enough to do surprise visits, why not call her?", "On second thought, I think your MIL would be justified in dropping a dime to Child Protective Services.", "But minus other info (about pain meds and a sleep disorder) why would OP have predicted that her husband would fall asleep?\n\nAnd an able bodied parent might fall asleep sitting up from exhaustion accidentally for 20 minutes on the couch without it being a referedum on their ability to care for their own children. If he were able bodied, he could've gotten on the floor to play with the kids, keeping him awake or the kids might've felt free to wake him up...A lot of this seems tied up in his disability in ways we don't understand.", "She needs more support, not authorities involved. She made an error in judgment, yes, but she sounds overwhelmed.", "She had a babysitter that didn't show up. She very early could have called MIL and asked for help since the sitter didn't show up. Yes it's likely she's burned out but that no excuse to leave your children alone at those ages. She needs therapy clearly but she's still the AH in this situation.", "I understand what you mean. Caregiver fatigue/burnout is very real. She needs some serious help and resources beyond what reddit can give. There isn't a :happy\" answer here however she did have a lapse in judgment for this particular incident that she is asking about. While it sounds like MIL  possibly could have been there to help before showing up to be the \"hero\" for rescuing the kids/husband we don't have thay info and I doubt MIL would tell the truth to OP. While I do feel bad for OP in this instance I do think she either the A H or  e s h.", "Then maybe op should have called MIL and asked her to come over and watch the kids.  MIL is not a mind reader.  She didn’t know op wanted to go shopping.  Op needed to communicate.", "Because she is the primarily caregiver, is her responsibility to not leave her kids alone with someone who is sick and can’t properly care for them. Yes she is entitled to having a couple of hours off even a day if her mental health needs it, and it seems like she does have help. If the babysitter couldn’t come she should’ve stayed or find someone else to take care of her family, what she did is irresponsible and there is no other way to put it. I will give her the benefit of the doubt snd say maybe she is burned out and is not thinking straight, so maybe she should ask for more help, but that doesn’t erase the reality of what she did.", "She went off to do christmas shopping... I understand people are pushed into bad situations when they have to work or another emergency comes up but christmas shopping?? Not even food shopping but presents! Ridiculous.", "Agreed. She probably desperately needed a break. People who have not cared for people at home don’t realise how absolutely overwhelming it is. Do think she should look into respite care for her husband on a regular basis though.", "OP was doing Christmas shopping. This wasn't a necessity or even something she couldn't have done from home. It's all OPs responsibility because the kids' other parent has a literal brain injury and is in a wheelchair. This isn't a \"bad decision\"; this is neglect. Do you think parents who leave their kids locked in a car for hours while they go out drinking also just made a \"bad decision\"?", ">Why is this all OP’s responsibility?\n\nBecause she made the decision to take on the legal responsibility of keeping two small children safe and cared for. That is literally her job (and the law)\n\n>Where was MIL prior to this?\n\nIs MIL supposed to be psychic? She's just supposed to magically know that OP wants to go out without ever being told or asked for help? \n\n>Why has no one brought in an aide to help? \n\nIf they need an aide, then OP should pony up and hire one. \n\n>Just a burned out person expected to do everything.\n\nOh poor OP, needing to urgently go Christmas shopping right this very second 3 days into November to the point she is willing to leave her two basically helpless children with someone who cannot meaningfully watch or protect them because one (1) babysitter couldn't make it and it would just be too hard to call literally anyone else on the planet or, god forbid, reschedule her urgent shopping trip.\n\nThis could have gotten those kids killed. The husband KNEW this was a bad idea, and OP dismissed him because she just can't be fucking bothered to not risk the health and safety of the people she's supposed to love and protect. No amount of burnout can explain away this reckless disregard for her children's lives. OP isn't expected to do everything, she's expected to do the bare fucking minimum", "She didn't need to go shopping right then and there. Online shopping also exists. She left infants with an adult who is still recovering from a traumatic injury, without adequate support so she could go shopping. Being burned out isn't an excuse to put your kids at risk. Those kids are under 3. It's incredibly dangerous to leave them without proper supervision. She had options, she just didn't want to change her plans to fit those options so left her kids alone with an adult who needs supportive care so she could go Christmas shopping. 1 phone call to her MIL was all she had to do. A phone call.", "Leaving a 3 and 5 year old effectively uncared for over an extended period is inexcusable. If she's burnt out, tough. That's being a parent.", ">I feel like you were just desperate to get away for a minute and used Christmas shopping as an excuse and had a major lapse in judgement\n\nA major lapse of judgment that could end with someone severely hurt or dead. That's not just a lapse of judgment. It's neglect for her kids and disabled husband. You can't just stroll out the door without ensuring everyone is safe first", "It sounds to me like she just happened to stop by for a visit, but it's possible that he could've called her.", "The MIL could've pitched in if she was asked to help but doesn't seem like OP asked for it.  \n\n\nHe has SPINAL CORD AND HEAD INJURY. By OP accounts of the story, he has CONSTANT CONFUSION. Obviously someone who is not in position to completely take care of himself, let alone two kids by himself.  \n\n\nIs okay to be overwhelmed and want some time away but is NOT, IN ANY CONCEIVABLE WAY, right to just stroll out the door without any care with her husband's and kids well being and safety. She should've ensured someone was there", "How is MIL supposed to pitch in and help when she obviously wasn't even asked? OP makes it quite clear in her post that she tried thr normal babysitter only before deciding to let 2 small children alone with her disabled husband. She even says he seemed confused by what she was saying but left anyway. MIL showed up unexpectedly, and I'm sure once there kept an eye on things until the very irresponsible OP came home and had to be reprimanded like a child for being careless. There's being overwhelmed, and then theirs putting others lives in danger by being irresponsible.", "Being overwhelmed does not justify leaving a 3 and a 5 year old alone for hours without suitable care to go shopping.", "It doesn't sound like OP even asked. It reads like they asked the sitter, then gave up.", "Where did it say in the post that OP asked her too and she declined?", "I mean she literally was, she came over found the disaster, took care of it , then gave OP an earful for putting her family in that situation instead of asking for help.", "She wasn’t asked", "It's fair to say his family should help. But we don't know if they actually don't. That aside she didn't (atleast mention) that she even tried to contact them before she left her two very young children with someone who is physically and mentally incapable of watching them. His family is not TA for not reading her mind in THIS situation. She clearly needs help, but again we don't know and shouldn't assume she doesn't or does, have any. It's also largely her responsibility to get these services for herself. (His or her family could help with this, but again there isn't enough information to know what they do or don't do.) Regardless her actions in this particular situation is what makes her TA. She choose, knowingly, to leave them even after her husband was uncomfortable.\n\nEdit: They shouldn't act how she is saying they are towards her, but she also made a mistake that could have ended in an actual emergency, unlike a shopping trip. Their actions don't excuse hers.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Care to expand? How is the disabled father an asshole? 😂", "What?", "You're right, she's a mother and a wife. She's not getting paid because she signed up for \"for better and worse\" but the onus is still one OP chose. I feel for op, it's a rough situation but she knew better. All three of them need minding. Husband will likely be fine in his own but she essentially left a 3 and 5 year old by themselves without alerting an adult capable of consent", "So because she may have needed a break, its ok to let 2 young children and a disabled person totally incapable of caring for themselves alone just to do some leisurely shopping? What if the house had caught fire and all 3 had perished? Is it tragic but totally understandable because OP was taking \"Me Time\"?", "What a terribly ableist comment. His disability is new and he is not yet functioning. Asking him to watch his small children when it isn't an emergency was dumb. She is not a saint for staying married to her husband.", "Thank you, speak louder for those in the back.", "Exactly, MIL's behavior shows exactly why OP might not feel comfortable reaching out to that side of the family for support.", "I agree that she’s in an overwhelming situation she didn’t ask for but she knowingly left her kids in an unsafe environment. Her kids could have been seriously injured or her husband again trying to keep the toddlers safe.", "(As someone who as never received any awards before I say I don't care, feed me more 🤣. And thank you)", "I think this actually hits the nail on the head. Maybe she hasn't truly accepted how their life is now and what her husband's limitations really are. Hopefully this was just *a* lapse in judgement and not symptom of larger case of denial and refusal to face their new reality.", "I can’t imagine how much OP has on her plate at the moment. I really hope she is getting help to take care of everything.", "She is TA but Im sure its not even really about Christmas shopping she just needed to get out because she is wore down and burnt out. She needs to come up with a plan with her MIL or his other family to have them come help her sometimes so she can get a break and not make these terrible judgement calls because no one should be “in a rush” for Christmas Nov 1 she just wanted out of the house.", "I hear you.  I know that feeling of wanting to run.  That two hours was wrong...... I know why she did it.  There were days I felt like I forgot to breathe from the pressure.  Everyone points fingers and critiques but never truly helps.  She has to have a break.  I hope she has someone to vent to.  I had a friend I could call who was going through the same thing.  She kept me from doing something stupid and I hope I did the same for her.", "If she's burnt out, I can see how she has her judgement clouded. Not an excuse, but that's why.", "I’m so sorry you’re dealing with all this, and the holidays are stressful enough as it is. It sucks that MIL is saying she’s willing to help but then ignores you. Is there a way you could schedule time with her, maybe at least one day a week, where she could come help and let you get out and do what you need to (and also just have time for yourself. That’s important when you’re the sole caregiver)? That way it’s a set day/time and (hopefully) she sticks to it? If she’s close enough to stop by, she’s certainly close enough to help out. I really think you need to have an open and honest conversation with her (his whole family actually if they’re all being this way) about how you’re feeling and how you NEED help. Caregiver burnout is real and you need to be able to take care of yourself too.", "What’s the long-term plan? Is your husband’s condition expected to ever improve? If not, what’s the plan? \n\nCaregiving for two small kids and an adult is a lot go handle without consistent help, an occasional babysitter isn’t going to cut it. You’ll burnout. Also how are finances going to work? Where is the income coming from?\n\nYou really need to think about the future realistically and look into realistic options for how you will care for all three of them.", "On this very specific occasion YTA. If something happens to the kids when you're away you'll never forgive yourself.\nBut you need respite. And you need to tell MIL and all the armchair \"helpers\" shaming you right now something like this\n\"I was very wrong on this occasion, but I am on call 24/7 with a disabled husband and 2 young children and NONE OF YOU are willing to help. I'm exhausted and I need help, not abuse.\nIf you're willing to help, please get in touch. If you'd rather criticize and shame me for being on the verge of burn out, please stop contacting me.\"", "What are you disagreeing with?", "Tragic! So quick and then gone forever.", "Time has passed and she still feels so confident that she was right that she posted this. This is not a momentary lapse in judgment. This is caregiver burnout leading to straight up negligence", "MIL does not seem supportive according to OP on comments. So its debatable that such would have happened", "Shes also a ta because this was for CHRISTMAS.  Not an emergency.", "That she was thinking about doing something good for the kids but it caused a error in judgement that could of been big. Her heart was in the right place trying to manage everything and still prepare a good Christmas for the kids, but she didn’t think everything though. Causing her to be AH but not in a malicious way.", "Ok let’s consider that she’s raising 2 kids, has a husband who is fully reliant on her and is probably also working to pay all the bills herself. Time is not an infinite resource, not everyone can pick and choose when to do things. Should she have waited, yes. But she could of also also been very stressed and in a position where she thought there was no other option. Yes it was the wrong call but she is human and under all she is dealing with I think no one would be perfect.", "CPS isn't going to do anything but walk in, check to make sure everything looks safe, and leave. They have actual serious cases of abuse and neglect to look into and this lady just made a mistake while incredibly stressed.", "I know some people who do Christmas shopping this early. It’s usual because they have big families or sometimes certain items go on sale or are limited. That being said your right she easily could’ve gotten some one else to watch her kids. Which is why it’s important to stop and revaluate the situation when feeling rushed. Again she is the AH in this situation.", "DCFS is in a position to connect OP to respite care and educate her on her options for childcare since her husband is incapacitated.", "DCFS does offer support. They don't immediately take the kids away. Overwhelmed people need linkage to services. Overwhelmed people making incredibly reckless decisions regarding their vulnerable family members need to be investigated to make sure they aren't endangering others.", "I think OP is TA for this situation, but MIL doesn't sound that supportive so I'm hesitant to say she could have \"just called.\"", "Exactly. Those who don’t know just don’t know. I clearly said she wasn’t in the right but situations like this lead to mental health crisis. \nIf my child were so disabled I would be in pretty frequent contact with them and their partner- offering my help or resources to find help rather than just yell like it will fix something.", "Either from home or just wait until she was able to find a sitter. I don't understand why it was so important to do it *right that second* that she would put her children at risk. I know caregiver burnout is real, but she (with the help of her family) needs to look into other resources available to them.", "Reread what I wrote. 🤦🏼‍♀️ I never said she was in the right. \nAlso, I am that “wheelchair neuro injury parent”. I’m fully aware of the complications and hardships that come with it.", "Lol I think you need to use your grown up brain here. If husband is so incapable that he needs 24/7 care and his mom is so concerned she should be there. She should be asking daily. Don’t pull mom rank and then complain while doing nothing. \n\nREAD what I wrote. I never said she was in the right or that her actions were okay. Y’all are acting like she knocked herself up and asked for all this to happen. It did. It sucks. It’s bad. But no one has the right to pull a holier than though when they themselves are doing nothing. \n\nI have been on both sides of this AND the disabled person.", "The kids are 3 and 5 years old, not infants. But I agree with everything else.", "Read what I wrote. Go ahead. Read it again and you’ll see that you clearly missed what I said the first time.", "I didn’t say she was in the right. I also said there’s no happy or okay answer. And not “tough”. She didn’t sign up for all of it but she’s expected to handle it all alone while other capable helpers complain.", "[deleted]", "He should have been more attentive with his kids. /s", "lol I second \"what?\"", "I’m confused too.\n\nI *think* the person is saying, “If you can’t provide your husband with adequate care and support while also caring for 2 children, I think it’s time for you to leave.”", "I'm not saying what she did was right but! If she has PPA which can linger for years or anxiety, horrible thoughts that could mean harm to her husband and kids then for FFS step out. Now Christmas shopping early Nov sounds like a cop out and she should of called for help but if her MIL could show up to scold her then her ass can babysit", "No, she is not! But she is nice enough, taking she tolerates her crazy MIL and the guy who is unable to stay awake for 2 hrs...", "I'm not saying she didn't do something wrong, but I do have sympathy for her. A lot of people are completely ignoring the amount of trauma it sounds like she's going through with no support, and trauma can definitely lead to poor decisions. Her husband almost died, and she suddenly became essentially the single parent of three people who need around the clock care. Who is she meant to complain about how unfair that is? Certainly not her husband, who is dealing with his own trauma and grief, and it sounds like there aren't many others lining up to help her. Not to mention the delicate balance of not infantilizing her adult husband who is unable to act in any meaningful way as a contributing adult in her life.\n\n I also wonder about a MIL who will drop by without any notice, let herself into the house even when OP's car is gone, but can't be asked to watch the kids and her own son for two hours. Why didn't the husband call and ask his mom to come help support OP? Why doesn't he support OP when his mom is screaming at her instead of sitting there and watching? There's something there, for sure. Even if the husband wasn't capable of defending his wife or even calling his mom to help, it sounds like he needs more help than OP can provide on her own, especially with two very young children who are relying on her a sole caregiver.", "I think they are disagreeing that the 5 could have been ok. Since the risks of bad fall, fire, choking and wagering off isn't that much different for a 5yo.\nIn most cases, at least.", "\"The road to hell is paved with good intentions\"", "Thanks!", "Also anyone who knows anything about economics knows that prices rise due to demand. Let’s also consider maybe they are struggling due to hospital and healthcare bills for the husband. Maybe they can’t afford to buy Christmas gifts closer to Christmas due to the rise in price. Not everything is always cookie cutter, that is life.", "But online shopping exists? There's a whole chasm between being imperfect as a parent and neglecting your kids.", "While I agree that she probably has very limited options as to when she can get things done, the time she picked was not one of those options.", "That's fine and all but you can definitely wait a day or two? Like even if you do early Christmas shopping, there is no need to rush out of the door and abandon your kids with you disabled husband who can't take care of them right now.\nChristmas shopping is not a emergency. It does not need to be done right this instance even if you shop early. \nIf she really needed to go that day she could have planed ahead. \n\nThis wasn't a quick \"the stores close in 10 minutes and we need something\" errand, she was gone for two hours and didn't even bother to check in on her husband? \n\nI'm sorry, I can empathize with a lot, but this story is ridiculous. This was plain and simple child endangerment, in what world is Christmas shopping on the 2nd of November a big enough priority to rationalize this? She couldn't wait till the 4th or 5th to get a babysitter? Nah dude. I am not buying this.", "She also didn't have to leave. Sometimes the babysitter doesn't show up, you don't just leave anyway. My biggest issue her is that she didn't see this as a problem. She does not see how she was wrong in this situation. Yes, people make bad choices. But you're supposed to learn from them.", "You literally did though? What do you think the rating system means?", "The kids didn't sign up for this. She's the AH for sure", "You're right which is why I was questioning them because I didn't see any comments from OP. But OP actually just responded to someone a little after you saying that the Mom won't help out. They say they will but then ignore her when she needs help. So they were actually right.", "OP clearly states he's severely disabled. \n\nHow is he to blame for his disability?", "Oh right. Yeah I agree.", "And it is by taking those good intentions and learning from the mistakes along the way that will lead you to heaven. It is by making the mistake again and again under good intentions that walk you down the bath of hell.", "I try to get all my under 10 son's toy Christmas shopping done before Halloween because magically, the prices always seem to double between Halloween - Christmas", "This woman certainly deserves sympathy but she is still the AH here. She could have called the MIL. Would you feel the same way had the children wandered off and been hit by a car? Or burned the house down killing the three of them?", "She’s likely burnt out from caring for 2 kids, a disabled adult, and the house and we dont know if she has a job as well. She probably really NEEDED to get out and shopping was just what she was gonna do. She should have called her MIL to come over to help her since the babysitter could not because it was an awful choice leaving kids that young with someone who isnt capable and also wasnt comfortable watching them safely.", "Sometimes online shopping isn’t an option depending on the country, not being able to pay for shipping, and other external factors. Not everyone is overly privileged. Did she make a mistake in leaving them and possibly endanger them, yes. Was is malicious, no. Are the kids being neglected, starved, beaten or ignored and treated as less than. No. She is trying to provide them with a good life and fucked up. \n\nThis is the opportunity for her to learn so this doesn’t happen again. Not to have dozens of people saying her kids should be taken away, and acting like she attempted to murder the kids. The kids would probably be even more neglected and treated even worse in that situation if they were taken away and thrown into the foster system. But I doubt any of these people would be rushing to go adopt these children either. \n\nIt blow my mind how people act like everyone will be perfect all the time, when I can almost guarantee you have made mistakes in your own lives that could of had bad consequences but you were able to learn from them. You never stop learning even as an adult. Let this be an opportunity to better herself.", "And if this woman is having a mental health crisis? Not one person has mentioned this. She takes care of small kids, works and is the caregiver for her disabled spouse. Sudden erratic behavior or blurred judgment can be huge signs of burnout.  I never said she was in the right but it doesn’t automatically mean she is a villain.", "The first line of my comment says it was a bad decision. It’s also the last line lmao", "She didn’t sign up for it either. Neither did her husband. Bad stuff happens. I said there is no okay or happy answer.", "You missed the sarcasm.", "I never said she wasn’t the AH, I just think she made an error of judgment in a difficult situation due to external factors. I’ve clearly said multiple times she is the AH and messed up. But instead of making the situation that she is a horrible mother and should be attacked and such, instead it should focus on looking at her error and learn from her mistake so it doesn’t happen again. \n\nI truly don’t think I’m being unreasonable in wanting her to learn from this instead of just beating herself up thinking she’s the worst mother in the world and should have her kids taken away and she’s an unfit mother. She’s humans and made a mistake", "Oh, I'm sure she absolutely was burnt out. But, yeah, there's other options. In the US, many states have respite programs to give carers like her a free break. Like you said, she could have had someone else come over with them.", "They were left home alone without adequate supervision. That IS textbook neglect. And why are you assuming her not having these kids means they'd go into foster care? MIL sounds like she'd snap them and her son right up. Again, huge difference between \"I unknowingly made a mistake\" and \"I purposefully left my 3 and 5 yo home alone with my disabled husband (who can't take care of himself, let alone them) so I could go Christmas shopping\".", "And you also said she wasn't the AH, the other person was.", "Well, no. The right thing was not to leave her kids there to do Christmas shopping. It's only just gone November for fucks sake.\n\nWould you still have this opinion if her kids were now deaf or brain damaged from her idiotic choice? She's lucky her mother showed up.\nIf she can't handle it, she needs to get help.", "My bad. I agree with you that she made a bad choice. The difference I see is that when you make a bad choice and someone points it out typically you recognize that you were in the wrong. She doesn't see that she was wrong. She needs therapy at a bare minimum.", "100% agree and Im in US so I know the programs you mean. Leaving them that way shouldnt have felt like her only option she clearly needs help. She needs to rally her tribe and do it now! She needs the In laws, her own family, trusted friends, a neighbor, a babysitter and a back up sitter at this point and that way she doesnt get burnt out and her “help” doesnt feel burdensome because its not on just one person its a whole support system. I hope she gets the help she needs because this could have ended badly.", "She’s NTA. She’s a burnout caregiver who made a bad decision.", "She DOES need help. She’s managing a life meant for multiple adults. Burnout and mental crisis is real. \nI never supported her decision once. My first and last lines are saying it was a bad decision. The theme here seems to be people not reading or not comprehending. Regardless, I have been the husband and Inhave been the wife. I’m more than aware of the complications and hardships. \n\nThere is more to this than what we have read.", "So how is anyone else an AH here then!? Your whole POV is very concerning", "And this is why so many couples divorce after serious injury. Typically the man leaves sooner since as a woman and mom your conditioned to stay and caregive. But honestly, sounds like MIL had time to help and chose to stay and yell at you. I’d leave.", "Pretty sure this was criminally negligent OP. Obviously you’re desperate for some much needed respite care and I want that for you. Please look for any help offered by the government or family, friends, so you can have a regularly scheduled break(s). And keep the kids safe!", "I was waiting for the kids ages and then my stomach dropped. YTA.", "I do not feel you abused your husband but you definitely should not have left your small children with your husband who was not able to properly care for them. Yes disabled people can be great caregivers but your husband, from your description, is not able at this time. This could be dangerous for your small children and your husband. It seems you have some family involvement and I would strongly encourage you lean on your support systems to help you. Yes you need a break once in a while and you absolutely deserve it so call your family and ask for help. It’s ok to ask for help. Use ever resource available to you. And learn from this mistake, use this to grow and move forward.", "YTA (mostly)- I'm confused. MIL came over quickly and was there to help your husband. Why didn't you call her in the first place? Also are you good? Sounds like you may need some help or a break.", "YTA. You didn't HAVE TO GO. You WANTED TO. Your husband has a spinal injury. He couldn't properly attend to the children. What exactly was the \"RUSH?\" You made a CHOICE to leave them all in an unsafe situation. I hope your MIL calls CPS and APS on you. Caregiver burn out is real, but there is no excuse for what you've done. You made a conscious decision to neglect both your children and your husbands safety.", "ESH. Your MIL is right but she can help out more if she wants to be a raging b$tch about it. \n\nYou need more help. Your husband needs someone else to care for him for a while, though honestly, how much left do you have to give for that relationship? Seems like it would be easier for him to live with his parents.", "Yeah YTA. Christmas isn’t tomorrow, you didn’t NEED to go out. You put your kids at risk for your convenience.", "YTA but I don’t believe you deserved what you got. MIL took it overboard when I believe you could be able minded to just be told that you can’t do that anymore and move on with it.", "YTA, however, you clearly need some help around the house or something. You took a risk and it backfired but it’s gotta be hard being basically a single parent.", "YTA\n\n“I was in a rush” \n“I had to go”\n\nThose are odd words to use for a voluntary shopping trip. You didn’t have an emergency or an appointment, you didn’t have work…you literally were just going shopping- something you can do *any time.* \n\nI understand it’s probably hard to be essentially a single mom and you need a break for yourself every now and then. But given the circumstances you should be arranging proper childcare beforehand and go accordingly. Not sure what you were thinking leaving small children with a man you admitted is unable to look after them. \n\nLeaving some toys near them is not a plan. They’re 3&5- how long did you think they were going to sit around playing with toys in the same spot? They have mobility at that age not to mention other needs like food and needing to go potty. You take care of them 24/7 OP you know this. \n\nIt sounds like you were just at your breaking point and had to get out of the house no matter what…and while I sympathize with your situation this was incredibly irresponsible. In the future, carve out time for yourself with proper childcare booked in advance.", "YTA it sucks you have no gel but it doesn’t sound like your husband can care for the kids. You need help to navigate this very difficult time", ">My husband was involved in an accident that injured his spinal cord so badly he needed to have a wheelchair. He also suffers from a head injury that causes him to be unable to perform some tasks properly as well as constant confusion. Sometiimes he'd lose track of time.  \n>  \n> I was in a rush, what I did was place the kids ( 3&5 )and their toys near my husband and asked him to just keep an eye on them. He was unsure of the whole thing but I had to leave\n\nYou could have gone ONLINE shopping perhaps? I dont know where you live but where I live they deliver toys and such. Your MIL was right - You were really irresponsible to leave them\n\nYTA - But a soft YTA. You seem burned out. Next time ask a neighbour to help out, dont just leave a disabled Man in charge of two toddlers", "YTA in this but I think you need help. You need to look at why you left two small children with someone that couldn’t look after them in order to do Christmas stuff. That’s not safe.", "YTA your husband is currently unable to properly care for himself and is certainly unable to care properly for young children for any extended amount of time. How would you have felt if something had happened during that timeframe? Think about how your husband would have felt? It’s not his fault he’s injured. You should have put the needs of your husband and the needs of your young children before your needs. Why couldn’t you have taken them to the store with you? It was a selfish and thoughtless decision that could have been a deadly decision. If his cognitive skills failed him in that window of time think about what could have happened. It would your fault. If you need more help then ask for it but do not put your children’s life in danger because you needed to go grocery shopping. You made yourself sound very selfish and entitled in your post and that’s not good. If that’s a sign of your true character then you need to work on yourself and your narcissism because there’s a bigger picture here than your needs.", "YTA!\n\nYour husband was not in a position to take care of your kids. What could’ve happened if something really horrible happened to one of your kids? It would be a bad conscience on your part. So, your mother in law was right to call you out on it. If you don’t have a sitter, **the shopping can wait.**\n\nAlso, my suggestion to you is in the future to see if you have someone that can watch her kids . Someone that’s really trusted and very exemplary with kids. And that would include **making amends with your mother-of-law and offering for her to watch her kids and compensate her for it.**\n\nEdited", "YTA also lol at the redditors in here asking you if you are ok. I don't care if you are ok, you left your young kids in danger you should feel bad.", "So much YTA.", "YTA. Leaving your toddlers alone with your husband was dangerous. Toddlers don't just sit calmly and play for hours. \n\nAlso, consider how it must have felt for your husband. The guilt he would feel if something had happened. It was really unfair of you to put him in that position. I know you must be struggling, but this wasn't a good call.", "YTA. Buying christmas stuff is not some kind of emergency.", "YTA- couldn't you just reschedule another day? Shopping can wait.  There's online shop too.  So many options out there and yet you chose to make your husband be responsible.", "Of course YTA! Wow.", "YTA majorly. You couldn't wait for another time with the babysitter or someone else to watch your kids? You put your kids and husband in huge danger. If a fire started, how would they have gotten out? If a kid started choking on a toy or food, who'd give them the heimlich maneuver? Get your presents online.. I won't be surprised if his family contacts CPS.. this should've never happened in the first place.", "YTA times infinity", "YTA. It's early November. Unless your babysitter is completely booked up for the next six weeks, you absolutely didn't need to rush out.  \n\n\nI want to clarify though that that's the only part you're TA about - leaving the kids with your husband. As everyone else is pointing out, you should have more help and I can't fault you for getting burnt out.", "NTA because I don't have the heart to call you an AH! I totally sympathize with you. No, you shouldn't have left your small children in the care of an adult who isn't medically stable at the moment. However, if your MIL had a clue, she would help out more, but she didn't show up to help out with the kids, she came over to visit with her son and then berate you and tell on you, instead of taking a step back and realizing you have 2 small kids and an adult you have to care for as an overgrown child. This is not meant to be an insult, it's just a fact, because I knew someone who was in the same situation. \n\nINSTEAD OF EVERYONE AROUND YOU BEING PART OF THE PROBLEM, PERHAPS THEY SHOULD BECOME PART OF THE SOLUTION! Like once a week, someone coming and helping with the children so you can go shopping. A day where you can just go out and decompress on your own!!\n\nBTW, who cares what your MIL is telling everyone and they're all mad. If she's that concerned she can come care for her son! She's the AH.", "OP has said in one of their only comments that when she has tried to reach out to her extended family (I.e. her MIL) they do not respond and do not help. Which means they’re happy to chastise her and blame her, but give absolutely zero support. She is in a battle that she has already lost; she cannot get time by herself no matter what she does.", "Just want to add to this that if you can't take care of your husband anymore, that doesn't make you a bad person. Two very young kids and a severely disabled person is a lot to deal with. \n\nSpeaking as a disabled person, I know the pressure my health has put on my partner. He loves me and we've managed to work through it but we're incredibly lucky that we've made it. If you walk away, people who haven't been in your position will judge the hell out of you but they do not understand the pressure you are under. I know I'll probably get downvoted to hell for this but I want to tell you that if you want to walk away from your husband, that's ok. You and your kids need to be healthy and happy and if that's not possible while you're with your husband then you can walk away. Sending you hugs", "This. And seems like the MIL was maybe free and she could have asked her. IMO the MIL seems like a nightmare - instead of calling her a horrible mother, she should have asked her if she was okay and offer to help in the future.", "There are services available for respite care. \nPlease set up an appt with your husbands physician.  Have a in-depth discussion regarding level of care he needs and ask for social services to support you. This may mean he needs to be in a residential care setting. \n\nThe reality is that you may a poor decision that put the safety of your children and husband at risk.  I understand there isn’t support from family so it’s time to reach out to outside services", "Soft YTA, but send the husband to live with his mom if she is so worried.", "Yeah this is definitely burn out, there's no way she had to go christmas shopping almost 2 months early.  Please reach out to someone OP.", "OP commented she had to get a babysitter because the husband family don’t help out. While she made a bad decision, it’s obvious she needs support and is burning out.", "She probably needed some time alone. Of course she shouldn’t have left her kids! But sometimes when people are overwhelmed, they don’t make the best decisions.", "I couldn’t have said it better myself! I get it. Caretaker burnout is *real*. But it is also NEVER EVER an excuse for putting all 3 of them in danger to go SHOPPING!! Huge YTA to this lady. She’s super lucky her MIL didn’t get DCF involved.", "You’re being a bit harsh. OP is probably mentally and physically exhausted and wasn’t thinking straight. It isn’t like services and help are always readily available. It is an impossible situation", ">No unfortunately no one's willing to help. Even his mother. They'd say they'd come if I call or let them know I need help but on many ocassions they'd ignored me. Thus I hired a babysitter.\n\nJumping on the top thread to add OP's only comment thus far.\n\nThere is no help from her family or husband's family. They're happy to chastise her, but not to help. I honestly think she needs to think about whether or not this marriage is sustainable for her. It sounds like the husband needs 24/7 care, and she can't provide that while also raising kids. The MIL clearly doesn't care about the children's actual safety so much as she cares about berating OP. \n\nLike I said: rethinking the entire marriage might not be a bad idea. I am curious as to whether or not the husband is expected to improve over time, or if he is now permanently disabled.", "Oh my god, don't apologize to MIL. She can mind her business if she's not going to help. OP does need to make better decisions in the future though because this was dangerous.", "I think the lack of empathy that OP is clearly not getting in her real life makes this an ESH situation. \n\nIf MIL is able to come at the drop of a hat, why is she not helping? Of all the people who are judging and berating OP, which of them is *actively* pitching and or making themselves available?", "You can use this incident as leverage then. It's clear you need help. Not just one paid babysitter, you need his and your family to rally around and be available for Christmas shopping and just a goddam break. \n\nSend out a group message to the critics section and apologise for the lapse in judgement but that you are desperate for a break and paid babysitters aren't always available. When you ask for help, do it in the group message so everybody knows they are all flaking on you. \n\nSadly, you know you're the asshole here, the kids and even your husband were put at risk by not being supervised. But be firm with your MIL that HER SON and grandchildren need her help, if she won't do it for you.", "Since they're all chastising you, tell them this is literally your cry for help. You're overwhelmed and *need help now* and if they want to criticize you, *they should help*", "I’m not entirely sure who you would ask about this (maybe your husband’s doctor or insurance company?), but find respite care. Your family NEEDS it to cope in healthy ways that don’t endanger anyone. And yes, AFAIK, it is possible to find FREE care. Please look into it. You all deserve better.", "I am so sorry, OP. I have 3 kids and can't imagine having to care for a husband as well. I get zero help as well, but nothing like this! Apologize for this jack of judgement, but tell all those folks that this is your call for help. They are the real AHs for leaving you to manage alone. Maybe come up with a schedule that they can follow and that can help get you time away and save money with the babysitter. You should also be eligible for aid to get care for your husband.", "Can I ask you which country are you based in please?", "But, your MIL only found out about this because she came over?", "It’s unfortunate when you can’t depend on family for help, but sometimes that is what it is.  Often there are places like the YMCA that have drop-in care, or possibly you can get a day or 2 a week scheduled at a daycare so you can have some time to take care of things.  Reach out to a WIC office or county social office for ideas for respite care for your husband.  \n\nI’m sorry, your life sounds really challenging. But your husband is not an appropriate caregiver for your children.  I have to vote YTA, but I hope you find some help for your kids and maybe also some therapy for you to help cope with a devastating life situation.", "But it's an emergency and couldn't even wait until later in the day!! /s", "Do you also not understand caregiver burnout and that OP probably isn’t in her right mind since she seems to have little help and criticism coming from those who don’t help? Saying you’d leave is as much an AH move as leaving someone for having a brain injury", "You mean other than the first paragraph where OP says husbands head injury renders them unable to perform basic tasks and leaves him in a state of constant confusion?\n\nI don't think any prediction was necessary", "OP commented before that she has asked for help (specifically the MIL) and she ignores her requests...\n\nYet she finds time to come over and yell at her THE ONE TIME she messes up as a result of carer burnout...", "This puts an interesting, and saddening, spin on this whole story. This OP should really take this as a wake-up call and reevaluate the situation she is living in. She is essentially a full-time parent to two toddlers AND a disabled adult. She needs help!", "Maybe MIL needs to step up and help w her son.\n\nWhy did she decide to just drop by?", "Sounds like MIL should take care of the husband and she should take care of her kids tbh.", "Oh man, this is heartbreaking. I try not to think like this about all of these threads but it's sad when this is the case. \n\nMIL just wants to yell at OP, does she drive by and only stop if she doesn't see the car so she can \"catch\" OP doing something wrong? \n\nIf you can't get any additional resources to help out OP, this might be the way to go. Let MIL take care of her son so you can focus on your kids. \n\nShe is right that you shouldn't have left your kids with him but I can understand you are burned out on caregiving. \n\nYou aren't a bad mom OP, not even close. You are a mom who is overwhelmed by what life threw at your family and you have no help from extended family.", "Agreed wholeheartedly with this. I am also curious if he will potentially improve or if this is permanent. \n\nOP - you definitely need some support; I can't imagine how hard all of this must be for you! 100% the children should not have been left alone at that age, but I can't bring myself to make a Y T A judgement on this.", "In sickness or in health.", "Yes! Thank you! Everyone is saying OP is the AH, and yes she was wrong to do this. But in OPs only comment she says none of her family or her husbands family is willing to help. So MIL isn’t willing to help care for her profoundly disabled son or watch her grandchildren but she’s more than happy to scream at OP when she reaches a breaking point? Yeah, it’s ESH for sure. OP shouldn’t have left the kids alone but this is also an impossibly difficult situation for nearly anyone. It’s always the people unwilling to help who tell the caretaker how awful they’re being.", "On top of the long term plans, is it possible for OP husband to get short or long term disability. If he can get a nurse a couple times a week. Not sure the extent of his injury but around the clock care and children any help would be a plus.", "Doesn't that totally contradict \"nobody is willing to help\" though? The MIL came over to check on her son, that doesn't sound like \"no help\" but what do I know 🤷", "I do. I have a special needs son, and multiple disabilities. \n\nShe still made the wrong move. She can not put her kids in danger. She should have reached out to more than just the sitter. Like the mil. \n\nAnd yes I criticize her. Not only did she put her kids in danger,  she *came here for judgment*.\n\nNo. I said *I* have brain injuries. And that if *my partner* did the same thing *OP did*, then I would leave them. Read it again.", "I haven't seen any indication that the husband needs 24/7 care. He was asleep but fine. The concern is for the SMALL CHILDREN WHO WERE LEFT IN THE CARE OF SOMEONE WHO CAN NOT WATCH THEM. Literally the first rule of parenting is that small children need supervision by someone who can keep an eye on them, physically stop the from doing dangerous things/remove them from dangerous situations, and who can reasonably ensure their well-being. Instead of doing this, OP essentially left her children alone. Her husband has a brain injury resulting in constant confusion and, apparently, falling asleep randomly.\n\nIt's unfortunate that OP is dealing with all of this because no, she didn't ask for it. But that doesn't mean she gets a pass for neglecting the safety of the children she is legally and morally responsible for. My \"grown up brain\" actually cares about those kids, why the fuck doesn't hers?", "A support group would be a good idea, there are online ones if nothing local. A second babysitter for when she can’t get a hold of the first. A respite caregiver for her husband. Ordering the shopping to be delivered. Are there programs that help cover some of the cost of these things? I’d expect so but also that would depend on where OP is. \n\nOP, please do not leave your toddlers unattended again. I spent my kiddo’s toddler years constantly chasing, lifting them down from stuff, helping them out from under stuff—you know caring for them is a very physical job even if your husband was 100% unharmed mentally. You know this was the wrong call, and you know how you’d feel if you went shopping and your kids got hurt. \n\nYour MIL still sounds like an unhelpful dick though.", "Depending on the status of of disability, if you are in the US he will qualify for some level of supportive services to help you. Both in-home and out-of home options. Out of home may be harder for you to do, but think about it because your/your kids mental and physical health is just as important.  \n\nI hope you can access support in some way! Feel free to message me with specific questions.", "Yeah the husband has to go. He’s not and cannot pull his weight as a parent. It’s not his fault but he needs to go where he can be cared for and OP not feel burnt out", "She has time to scream at OP but not to help", "The husband may have called before falling asleep, if he's capable of it.", "The MIL doesn't seem to care much about him, either. Hospice care might be an option, but again, I have to wonder if he's projected to get better or if his condition is permanent.", "Her health matters too, and the health and mental well-being of their children. It's not always as easy as *in sickness or in health*. He's become not only her husband's sole care-giver, but their family's sole provider and their children's only parent. If something doesn't change, and quickly, she's going to burn out and end up having a break down. Then she won't be able to take care of anyone, *herself included*...", "Unfortunately, that's not realistic. Beyond that, being his apparent full-time caretaker is going to make her resent him. And the kids. Ideally, they would find someone to do at-home care professionally, who could take some of the pressure off of OP, while allowing the husband to heal (if possible). \n\nIt's not fair to OP to be the single parent of two kids under 10 and the caretaker of her husband. She needs help. He needs help. Help might only happen if they're no longer together.\n\nEdit: uh....am I blocked by this person or did they just up and delete, cause I'm curious about the reply telling me I'm a disgusting and awful person. \n\nAnyway: 'in sickness and in health' is great. But real life doesn't work out all the time. OP cannot sustain this current situation. She is not a professional nurse. She is not trained for this. Resentment happens. Resentment can't be stopped sometimes and left to fester, it will explode. I'm sorry to burst everyone's bubble, but that's how life works out. \n\nWe all want to think that our love for people is unconditional. That it's unmitigated and unabridged. And maybe some people's love for others is; maybe it's just different for every person. You can never find a crossable line with your kids, but you can with a spouse or your siblings or your parent. But unconditional love is unrealistic because the world is full of unexpected conditions. \n\nI don't mean this as a knock towards disabled people or ill people. I've got some mental health issues that make everyone's love for me pretty conditional. You deserve love, no matter how your body or your mind exists and interacts in this world. Everyone does, and you deserve a love that can love you through struggles.\n\nBut the unfortunate truth is that not everyone is capable of that love. We all want to think we are, and many of us are. But some of us aren't, and only time will tell if OP is. \n\nAgain, I hope that they find a solution that works for them. I hope op's husband lives a long, fulfilling, joyful life-because a disability, permanent or temporary, doesn't preclude you from a long, fulfilling, joyful life-and I hope he lives it as a father and husband. \n\nBut acknowledging real possibilities is something that has to happen.", "Even that OP would need help with. Applying for disability is pretty complex, filled with appointments you CANNOT miss and most folks are denied multiple times before theyre approved. I agree its the best long term move but in the short term she'll need to work with someone on that ongoing battle too.", "Eh, if OP had no idea MIL was coming over it doesn’t give her much opportunity for a break. Also idk what the MIL does while there. There’s a big difference between showing up, grabbing the kiddos and/or a broom and telling OP to go get a coffee for a few minutes or take a nap or whatever, vs showing up and expecting to be entertained and brought coffee while mil tells you how dirty your house is.", "um, a mother can visit her son anytime. that isn't being willing to help, that's simply being a mom that visits lol. willing to help would be let her know days she can watch the kids/help out with the husband, or cook/help with chores so OP doesn't have to do literally everything on her own.", "You reread what I wrote. Saying you’d leave your partner for making a poor decision while experiencing burnout and not being 100% there is as much an AH move as leaving them for having brain injuries. \n\nAlso you need to work on your empathy cause it sucks. You’re coming off really high and mighty", "Ideally they would be able to find someone who can do in-home care. That would probably be the least disruptive option for everyone.", "I wish I had awards to give for this comment. OP, this comment is everything. There are many services that your husband could qualify for if you are in the US. I have heard that other countries have services as well. I hope you can get some in-home support for yourself and your husband. I know from experience what it is like to take care of someone who is disabled. It is lonely and exhausting. You are not a bad person for utilizing these services (trust me I had guilt that I could do all of the care by myself, but I can’t).", "Home health will only be there for the husband. It wouldn’t be a fix all for her exact situation. Home health will show up when they want and then they will stay just as long as alotted, usually an hour or less, and then leave. They won’t do a thing to watch her kids if she needs to go somewhere. She should look into day care or an alternate babysitter or 2 that she could also call if the normal one isn’t available.", "If OP is in the UK there are help for carers too. A nurse will come in a few times a week for a few hours to give the OP respite. New Zealand has something like that too.", "\"In sickness and in health... well maybe not serious sickness, just a little sickness, if it's really bad then GTFO you freeloader\"", "I don't believe hospice care is available for those who are simply profoundly disabled. I thought you have to have a terminal diagnosis to even be eligible.", "Hospice is for the terminally ill. It is to make them as comfortable as they can be in their final days. What you are thinking of is a nursing home where they will give him 24/7 care.", "No but, unfortunately, if they are in the United States, he might be entitled to more services as a single, disabled individual. It's fucked up but it is the reality of the situation.", "I didn’t say divorce but he needs have his needs met and the children need to have their needs met  OP has needs as a person. She’s not just a “give machine” \n\nSending him where he can have his needs met is meeting the care he needs", "For hospice care, yeah, but I should have said a caretaker. People who are disabled can have at-home caretakers. Mistake on my part.", "Yup, just replied to another person. Mistake on my part!"]}