{"id": 10196, "submission_id": "114p5oz", "title": "AITA for I (34f) talking about my recent cancer diagnosis at a restaurant?", "selftext": "I(34f) recently got diagnosed with stage 2 breast cancer at the end of 2022.\n\nAt first we though the cancer was in the very early stages but it wasn’t until after my surgery it was confirmed what stage I was and what treatment plan I’d be getting. Once I was mobile enough post op and could sit comfortably on a chair my friends invited me out to dinner.\n\nWe met at a restaurant, all was good and we were having good conversations. I decided unless someone asked if any updates I won’t bring it up. But eventually one of my friends brought up the topic and asked how I was doing and if there are any updates. I told them the news and what’s to come after. They asked some questions we talked a bit more about it and that was that.\n\nThere was a couple sitting at a table near us who obviously was able to hear the conversation and the guy made a remark on how he was trying to enjoy his meal with his date but I ruined the mood by talking about a depressing topic and thanked me for ruining their date.\n\nOne of my friends was kind enough to ask the guy to mind his own business and if he has such an issue just ask the staff to find him another table if possible and leave us alone.\n\nAfter that I got uncomfortably awkward and stayed silent for the rest of my meal and really just wanted to go home.\n\nSo AITA for talking about that topic publicly?", "created_utc": 1676648652, "permalink": "/r/AmItheAsshole/comments/114p5oz/aita_for_i_34f_talking_about_my_recent_cancer/", "score": 2108, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because not everyone wants to hear about your personal life when you’re in public\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Must have been a pretty bad date if they were so distracted by another table's conversation.", "Omg, SO NTA. Fuck that guy and his total lack of empathy. Maybe he should be a better conversationalist so he and his date could have focused on their conversation instead of yours!", "Absolutely NTA\n\nLook, you're fighting cancer, pay no mind to the random tossers around you, and kudos to your friend to stand up for you.", "NTA \n\nHe didn't have to listen to your conversation, unless you were standing on your chair and shouting to the whole resturant? No? OK, you're good!", "NTA.  You were with friends who cared about you and wanted to hear it.  If some moron at another table wants to eavesdrop on a conversation that has nothing to do with him, and then tell them that what they were talking about was inappropriate, he can piss up a rope.      It's very easy to figure out who the A is here, and it's not you.", "NTA, Jfc, that guy is doubly the AH, one for eavesdropping, two for having the temerity to say to you that you ruined the mood by talking about your cancer. I hope his date lost his number", "[removed]", "NTA, it's very obvious that guy is just a morally bankrupt asshole. \n\nSorry you had to experience this during such a sensitive time. You don't owe it to anyone to hide your hardship and pain. Let alone a stranger in public.", "NTA. When you go out to eat in public, you may hear other people talking. It's part of going out. It's not your problem he was uncomfortable.", "No, NTA.  The guy making the remark needs to butt out of things that don't concern him.  He's a major AH.\n\nYour response should've been, \"I'm sorry my cancer is inconvenient for your lunch plans.\"", "NTA - that other diner was a massive asshole.", "NTA, what's the dude's problem??", "[removed]", "Absolutely NTA. This guy was eavesdropping on your conversation and then has the nerve to complain about what you’re talking about? Good on your friend for telling him to mind his own business. You did absolutely nothing wrong here.", "NTA. The guy was so bored on his date he decided to eavesdrop. I wish you a full recovery. You’re allowed your discuss your life and health anywhere.", "NTA\n\nFirst, I’m sorry about your diagnosis, I hope you will be ok.\n\nHe was rude to interrupt your dinner with his comment. He is in public, people are going to talk about different things.\nI didn’t know we were only able to discuss happy things when out.\n\nWhat ruined his date was his comment, if I was on a date with him, I’d be hesitant to another one.", "NTA at all.  If he'd been having any kind of interesting conversation on his own table then he wouldn't have heard you.  Plus he gets 100 extra AH points from me for confronting you about it.", "NTA", "NTA and if the topic of conversation had changed to rude blowhards whose dates should sneak out the back door of the restaurant and then lose the guy's number, I wouldn't have blamed you one bit.", "NTA.\n\n1. you were asked a question and all you did was answer\n2. you literally can't help that you have cancer, and you deserve to talk to your friends for support.\n3. that guy who complained was eavesdropping on a conversation that had nothing to do with him\n4. you didn't ruin their date, but he definitely did by being a jerk. I hope his date chooses not see him again after he showed his true colors. He was incredibly rude and insensitive.", "NTA. When you're in a public place you have to expect overhearing other peoples conversations, whatever they are. I'd understand if someone was being explicit of using way too many swaer words near a child, for example, but you were just talking to your friends and updating them on your life. He was the insensitive asshole in the situation.", "NTA. People need to mind their own business. I don't understand why some people feel the need to inject themselves into other peoples conversations.", "NTA - you were essentially out celebrating with your support group, and talking about your lives.  It is very normal that you'd end up talking about your cancer.  The nosy people at the table nearby can stfu and butt out.", "He’s going to be able to go on so many more dinner dates, you may have limited abilities to go out to dinner in the future. NTA", "NTA.", "NTA. If you can’t talk to your friends about your cancer treatment, exactly who can you talk about it with?? That’s what have time out with friends is for. Guy was an evesdropper. \n\n(Overall, I would agree to not talk about unpleasant, icky topics in a loud voice in public settings or yo use foul language similarly. That doesn’t sound remotely like what this is. So, I’m not saying people should never be mindful about what they are discussing in a public setting. But you should *definitely* be allowed to discuss your cancer with friends in public.)", "NTA", "NTA - People are AHs. This guy was no exception.  Sorry he was such and ass to you and hope your treatment goes well.", "NTA and if I'd been his date I would have left him there!", "NTA , the guy was a jerk on evesdropping your conversation instead of minding his own business", "NTA. Talking about cancer is always uncomfortable and I am sorry you are having to go through it. \n\nSo your friend asked about an update and I think it was very appropriate of you to provide a response instead of remain silent about it. \n\nAs far as the couple on the date eavesdropping on you, TWBTA. Just rude, inconsiderate, and unrealistic expectations dining out. You didn't choose to have cancer. Wish they would have been at least a little bit empathetic or show some grace.", "This doesn't even really belong here. Dude is obviously the AH, sorry about your cancer.", "NTA, this dude can go heck himself\nHope you'll be okay though", "WTF. I got followed to my car after having a PRIVATE phone conversation someone didn’t like. MYOB to these people. I am sorry and hope you get better.", "NTA.", "NTA. Also, why do some restaurants place tables so close to each other, no privacy smh.\n\nI get it, it's to save space, but still, I wish more restaurants, especially mid to high ends, were thoughtful about having good spacing between tables so that people could talk without having their conversations be heard by other people.", "NTA at allllll. You were having dinner with your friends, who clearly care about you and are concerned for you. They asked for life updates and you told them the news of the big C. \n\nThat couple should go f off. Sorry life isn’t always roses and dandelions you entitled AH. This isn’t your conversation so stay TF out of it. I think the awkwardness wasn’t from your news but the d bag who snooped on your convo.\n\nGood luck OP, I wish you a speedy recovery, and hope you have many years to make beautiful memories with your friends and loved ones. If you ever feel lost just know there’s some strangers on Reddit here pulling for you too ❤️", "NTA\n\nPublic space. You weren't being gross. \n\nHe needs to mind his business.\n\nIf he had been paying better attention to his date he wouldn't have been able to focus on yalls conversation.", "NTA. So sorry you're going through this OP. Yeah, it's a difficult topic to talk about, but you're allowed to do so.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(34f) recently got diagnosed with stage 2 breast cancer at the end of 2022.\n\nAt first we though the cancer was in the very early stages but it wasn’t until after my surgery it was confirmed what stage I was and what treatment plan I’d be getting. Once I was mobile enough post up and could sit comfortably on a chair my friends invited me out to dinner.\n\nWe met at a restaurant, all was good and we were having good conversations. I decided unless someone asked if any updates I won’t bring it up. But eventually one of my friends brought up the topic and asked how I was doing and if there are any updates. I told them the news and what’s to come after. They asked some questions we talked a bit more about it and that was that.\n\nThere was a couple sitting at a table near us who obviously was able to hear the conversation and the guy made a remark on how he was trying to enjoy his meal with his date but I ruined the mood by talking about a depressing topic and thanked me for ruining their date.\n\nOne of my friends was kind enough to ask the guy to mind his own business and if he has such an issue just ask the staff to find him another table if possible and leave us alone.\n\nAfter that I got uncomfortably awkward and stayed silent for the rest of my meal and really just wanted to go home.\n\nSo AITA for talking about that topic publicly?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "[removed]", "NTA, NTA, NTA and just to make sure you know it: NTA!", ">the guy made a remark on how he was trying to enjoy his meal with his date but I ruined the mood by talking about a depressing topic and thanked me for ruining their date.\n\nMaybe i he had focused on having a conversation with his date instead of eavesdropping yours his date wouldn't have been \"ruined\".\n\nNTA.", "I have a great comeback for situations like this. Next time something like this happens, look him right in the eyes and say “Did you know that minding your own business is free?”\n\nNTA btw", "NTA\n\nWhat an AH\n\n“Could you please not talk to your loved ones about real topics that are relevant to your life bc I am eavesdropping and am made so uncomfortable by your life that it’s ruining my meal.”\n\nYou did NOTHING wrong. Some people shouldn’t be allowed in public", "NTA.   He didn't like  the topic he was eavesdropping  on?  Lol \nI might have started talking about the new sex positions hubby and I were trying\nAnd the \"toys\" I bought at the sex shop.", "NTA he shouldn't have been eavesdropping. His date was going poorly because he wasn't paying attention to his date. If you were shouting racist slurs... ok, you were ruining everyone's night. Speaking at normal volume about something difficult but not rare... NTA. And we need to normalize talking about difficult things in our communities. Not hiding difficult and scary things away.\n\nI just finished chemo for breast cancer. DM if you want some tips on making chemo a little easier to bear. ❤", "Absolutely NTA. You showed astonishing restraint and grace, OP. I would have thrown a glass of water in that AH's face. I'm glad your friend spoke up for you.", "NTA - though that guy is a proper prick.", "Seriously! And after that, I’m sure it didn’t go well if his date was even close to a considerate person!", "You can take heart in knowing that if it was a first date. he probably won’t get a second one after he behaved that way.", "And honestly that guy clearly has no personality if they needed to eavesdrop on a neighboring conversation while supposedly being “on a date”", "Never mind. Figured it out. \n\nOP, wishing you all the best.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "My husband was a paramedic in Manhattan. When he and his co-workers would go out to eat after a shift, they would talk shop as one does. Sometimes they would look about as they were getting ready to leave and the immediately adjacent tables would all be empty. No one said anything to them about their conversations, they just moved on. NTA.", "NTA", "[removed]", "NTA\n\nThe guy at the other table should not be eavesdropping on other customers.", "NTA. His lack of empathy probably ruined the date. You did nothing wrong.", "100% NTA  \nI cannot comprehend how people can be so self centered.", "NTA, he was eavesdropping. f him", "NTA what kind of human can one be?!? It’s like driving with a Lamborghini beside a starving kid and complaining to be confronted with the awfully thin look. Such! An! Asshole!", "NTA\n\nHopefully his reaction showed his date exactly what kind of person he is.  Your friends were exactly right to tell him off and you have nothing to feel bad for.\n\nHe ruined his own date and tried to blame it on you so he didn't have to be accountable.  On a good date they wouldn't have been sitting there eavesdropping on other people because they had nothing better to do.  They would have been too interested in talking and getting to know each other to care what any other table was doing.", "NTA, he‘s an eavesdropping AH and you did nothing wrong. In addition I guess it also helped his date not to waste her time on him in the future. \n\nAll the best for your recovery!", "NTA the Guy was a nosy d*#+k", "He's mad that you were discussing something in public ? Sorry, bud, but you don't get to decide what people talk about. So NTA. Why do people suck so bad? Have your date at home. Wishing you the best, OP", "NTA- He shouldn't have eavesdropping. You were answering your friends questions. Obviously his date sucked already because he was blaming it on you.  I wish you the best of luck with your journey. My aunt was diagnosed at the beginning of Jan 2020 with stage 3 and then again Jan 2023 with stage 1. You just keep your head up and tell yourself that you will beat this and kick its ass.", "You weren't being loud, obnoxious, racist, homophobic, etc., so you can talk about whatever you want. And people can't expect to go out in the world and not be bothered anyway. \n\nThe guy was rude and entitled and I'm proud of your friend for shutting him down. NTA", "NTA.  The rest of the world doesn't exist to be the ambiance for someone's date.  If they want control of the content, then they need to go somewhere where they can control the setting.", "NTA and fuck that guy. Don’t waste one more second of your energy thinking about him. He must be a real prize if another table’s totally appropriate conversation is all he has to offer his date. \n\nI am glad you have friends who care about you want to know about your health. \n\nBest to you and I hope you are well and make a full recovery.", "NTA, I hope this dillholes date got out of there bc JEEZ.", "Wtf? No! NTA at all. Captain Nosey Pants needs to stop eavesdropping on others' conversations.", "Hopefully this was a red flag to his date. Presumably you weren't projecting in your best public speaking voice, so he was ease-dropping. Fuck him. Nta.", "[removed]", "Eh depends on how loud OP’s group was. Went on a date the other day and the couple next to us was so loud I couldn’t hear my thoughts let alone be able to have a conversation", " I wish you a full recovery. You’re allowed your discuss your life and health anywhere.", "I didn’t know we were only able to discuss happy things when out.", "Right, I'd so want to respond back, \"yeah, overhearing other people talk about cancer is so much more of a mood-ruiner than having it...\"", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA. This guy was eavesdropping on your conversation.", "Well I doubt OP was screaming at the top of her lungs about her breast surgery or making a scene. If their voices are really that loud, you can ask to be moved but telling a cancer patient that they ruined your date with their depressing story is next level-AH.", "Just to add, if it helps, my mother had a similar situation (they thought it was early stage but after surgery found Stage 2) in 1989, and is still going strong today with no recurrence.", "NTA OP.  The other couple shouldn’t have butted in.", "NTa. Tell to mind his own business.", "NTA. If I were in his situation, I think my first instinct would have been to pay for your meal anonymously, not go off on you for being open about what you're going through in a public space.  \n\nOn another note, good luck to you with everything. I'm happy to hear that you have such amazing friends who support and love you. Enjoy every dinner you're invited to, and anyone who gives you shit can fuck off. You're going to beat this!", "NTA. The guy is unreasonable in expecting strangers to be responsible for setting the mood for his date. He could have chosen a restaurant where the tables are farther apart.\n\nI have one caveat. I once was at a restaurant where a woman was on her phone describing, in detail, her chemotherapy sessions and the side effects. I think it’s reasonable to expect to not hear discussions of vomiting while dining in a restaurant.", "NTA and I hope that guy's date ghosted him after such appalling behavior. I'm guessing they were the \"stare at our phones and not talk for the duration of the meal\" couple we all see at restaurants nowadays.", "NTA", "NTA.  I would have pointed out that he shouldn’t be allowed to eat until he learns proper manners and not to eavesdrop on other diners.  I would then turn to the woman and say, now you know how he will be if you ever get cancer, be smart and leave him now.", "NTA. Maybe he shouldn't eavesdrop next time 💀", "NTA. You were at dinner with your friends, talking to them about something they asked you about. If the man didn't like your conversation, he should not have been listening. If your conversation ruined his date, then it must have been a bad date, and that's not on you, it's on him and his date.", "NTA, hopefully their date saw the gigantic waving red flag for what it was and didn’t go out with them again.", "Perhaps you should have complained about being seated next to a healthy couple, while you are suffering from cancer  /s.  After all, it could be tough to be confronted with someone else’s happy life when you have such a serious illness.\n\nYour dining neighbor’s complaint is no different than my hypothetical. The reality is, people go through different stages of life. \n\nNTA", "NTA. You & your friends did nothing wrong (and good for your friend for telling that guy off.) While your diagnosis may not be a 'fun' topic, there's certainly nothing wrong with discussing it in public. Again, your friend is right - if it makes that couple so uncomfortable, then they should ask the server for another table.\n\nOn a personal note, as a breast cancer survivor (who has discussed the topic & my treatment in public, in restaurants & elsewhere), I'm sending you healing thoughts & wishes.", "NTA\n\nHe could have asked to move, he could have ignored your conversation that he wasn’t a part of and honestly F him. I am so glad your friends stood up for you and what a bummer that he had to interject himself into your lunch with your friends.", "Is that dude high on drugs? Nta", "NTA\n\nnot at all\n\nI hope his date caught how shitty he is.", "NTA. If you are an AH, then so am I. I was diagnosed with BC last fall and I talk about it in public all the time, including in restaurants. If people don't want to hear me talk about a depressing topic they are welcome to not listen in on my conversations! And seriously, I cannot even FATHOM the selfishness of complaining to someone with a life-threatening disease going through multiple horrible treatments about how they are \"ruining the mood\" of my dinner. \n\nSorry to hear about your diagnosis (welcome to the club no one wants to join!) I hope your treatment goes well and I hope you have lots of supportive people helping you through this.", "NTA, as a cancer patient myself it's important to talk about it as it's a huge part of life. In my personal experience keeping a light attitude is helpful to ease the tension it creates. I (20m) was diagnosed with Acute Lymphoblastic Leukemia in 2021", "NTA. Hopefully his date will draw her own conclusions from his behavior.", "NTA. Fuck him. Talk about whatever you want at YOUR table. Ms. Manners would say for him to mind his business.", "Your life, your issues, your friends, your support system.\n\nNTA.", "NTA! The guys the AH. I’m also a breast cancer patient. Diagnosed 9/22/22. Hope your treatment is going well! If you’re not in the breast cancer subreddit you should join. Lots of great info and support over there 💞", "NTA, you have every right to sit wit your friends and discuss what going on in your life. That man can politely shove it where the sun doesn't shine.", "It's none of his F'ing business what you talk about and he's definitely TA for complaining about it. Yeah, thanks for the sympathy and concern, AH!\n\nUnless you were loudly spewing profanity or something, it's absolutely not his right to say anything.", "NTA", "NTA. He's an awful date if someone else's conversation distracted him that much. Then he had the audacity to tell you how you 'ruined' the date? Like no sir you did that yourself.", "NTA. He basically turned around and told you to stop existing in his vicinity as anything other than a perfectly healthy person. Of course he's in the wrong.", "NTA", "Asshole people ruin everything. NTA NTA NTA.", "Cancer survivor here, NTA. AND F THAT GUY IN THE EYE WITH A FLAMING TORCH!!", "Absolutley NTA! \n\nUnless you are load, cursing or are otherwise disruptive, you can talk about whatever you you want at your table. The audacity of some people!", "NTA. You were ask about your health you answered. Sorry part of life when in public people hear things. No one ask for their opinion not your problem. Hope for the best.", "NTA and I'm sorry this happened to you. That guy was way out of line.", "NTA: I feel bad for that dudes date. Imagine hearing a romantic interest saying that disgusting shit right in front of you, instant nope.", "I have been someone who was deeply upset by discussion of another customer's medical condition.  I was so upset hearing how the woman was struggling that I was near tears.  Her young relative was taking her out to get something other than hospital/nursing home food.  It was 8 years ago and it still saddens me.\n\nBut you know how I handled it? I paid for their dinner.  NTA, I hope you get better soon.", "Think how grateful the woman must have felt to OP for letting her know how much of an AH her date was.\n\nNTA", "There you go. This is so exactly the truth. He should’ve been enthralled with his date that he shouldn’t have noticed or heard what OP was saying.,", "Hope that was a first date and other person got a heads up that this should be the last too. NTA", "Not necessarily, some restaurants are ridiculous with how close the tables are. He was certainly an ass about it but you can't assume he was having a bad date....assumptions on a reddit post, who would've thought lol", "[removed]", "I am now eagerly looking forward to having an opportunity to use this line...", "If I had been his date, I would have said, \"Actually, she didn't ruin our date, but YOU just did\" and then left the dude.", "[removed]", "Wooosh", "On the bright side, maybe he showed his date his true colors and she can move on to someone who is actually a decent human being. If any dude did that on a date with me it would definitely be our last date.", "Bot", "I *guarantee* you that dude was striking out on his date and needed someone to blame. You're absolutely NTA! Years and years ago my mom and I routinely discussed her diagnosis at restaurants. She always said food made the conversations easier and feel less dire. Again you're NTA. And by the way, kick it's ass!", "NTA and I'm sure you did his date a favor. I know *I'd* never continue to date someone that acted like that!", "NTA. What an awful human being. I hope his date picked up on that and dumped him. If there is a next time, and I certainly hope there isn’t, go ahead and amp it up. Get super detailed. Make stuff up. Talk about Pap smears and poop. You or any of your friends have kids? There’s a ton of gross subject matter right there.", "NTA you did that guy's date a favor. Hope she has the smarts to dump him.", "[removed]", "NTA You behaved impeccably.\n\nYour fellow diner is an AH", "NTA : No you were not your friends wanted updated regarding your health. I am a cancer survivor please know that you will be in my prayers and please accept a hug from an internet stranger. And that person was a jerk.", "NTA. They should have minded their own business", "NTA AT ALL!! That guy needs to mind his own business and stop complaining about people around him seemingly just existing. On that note, I wish you a quick and easy recovery. Cancer is awful and hard, but I believe in you!! <3", "\"Uh, hey, I'm eavesdropping, and I don't like it. You need to stop talking.\" \n\nNo. NTA.", "If that was my date, it would have been our last.\n\nNTA", " NTA at all but that man sure is. It would serve him well to mind his business and cut the entitlement.", "Hopefully it was a first and last date for those two. If my date made someone else’s cancer all about him, I’d run.\n\nNTA. Take care of yourself.", "NTA at all", "NTA. But you are going to have to get used to standing up for yourself on the matter. It won't stop. I had cancer a few years ago and every time I left the house it was something like that. People telling me I needed to cover up my surgical scars. People saying it was inappropriate for me to have my hickman line visible. Multiple times women would come up to me and berate me for not wearing a wig and \"scaring\" their children. It won't stop. And the more it becomes visible to others the worse it will get. Learn to take joy in telling people to fuck off. It will be your greatest social asset. His date got ruined by them eavesdropping on you? Mayne he should try to be more interesting so he doesn't have to rely on strangers conversation to entertain himself and his date.", "NTA.\n\nThe guy was eavesdropping and heard some stuff that made him uncomfortable; in shorter words a him problem.\n\nBest of luck with your diagnosis, hope you beat the hell out of this stupid C word!", "NTA! I would have said I'm sorry my life threatening illness is disturbing your chi, fuck you very much", "NTA. And probably a good opportunity for this man's date to gain a better understanding of exactly what kind of a person this man is.", "NTA. Hell I would’ve been tempted to say “Sorry you overhearing my conversation with my friends about MY cancer ruined YOUR day”. If anything he was the asshole. Having had a breast cancer scare this year my heart goes out to you. I hope you receive all the care you need and make a full recovery.", "If you overhear someone talking about their cancer diagnosis, how is your reaction anything other than \"Oh no, that poor person, I hope everything works out ok for them\"? What a sad, soulless life that guy must lead.\n\nOP, of course you're NTA.  It's not like you stood behind him and spoke all the gory surgical details directly into his ear. Although maybe you should have.", "Wow\nTotally NTA \nThat guy must have been a pretty lame date since he was listening into another tables conversation.\nHope your are doing okay!", "op=NTA\n\nIt's PUBLIC--that means you get to talk about any topic you want unless specifically barred by the institution.  \n\nYou were asked, you answered(and unless you were discussing guts and gore, it's fine).", "NTA. If it was a problem for the eavesdroppers, then too bad for them.", "NTA. He's the AH for eavesdropping. If he didn't like a completely acceptable conversation that he wasn't part of, then he should have minded his own business and continued his conversation with his date. He ruined his own night. You held your composure well. I would have snapped on him, \"oh, you don't like my depressing conversation, NEITHER DO I!! I would much rather not have cancer, but here I am trying to enjoy my life before my treatment plans suck all the energy out of me and I can't do these things anymore.\"", "NTA \n\nyou’re literally fighting for your life and winning, that man must have a really bad date and look on life if he wants to act like that.", "NTA. Maybe if they were talking to one another instead of eavesdropping they wouldn’t have heard it. I hope he doesn’t get another date. What an insensitive jerk.", "NTA. Let’s invite him to sit down next to a table of healthcare workers. Hours of de-identified stories of body fluids, missing body parts and smells. \n\nCancer is your a chapter in your life and you’re entitled to talk to whoever and wherever you like. It’s jerks like him that make people terrified to talk about it, even though literally 50% of the population will have to go through this at some stage. My bestie recently had a mastectomy (she’s in her 30s) … she also works in oncology with me and I guarantee if anyone piped up about us making them miserable when we were talking about her cancer she would have whipped that shirt right over her head and given him something to be uncomfortable about. F those jerks. You’re not the asshole. F cancer too. I hope you’re doing OK 🌻", "NTA x 10000. Please do not let this stupid, ignorant and frankly bizarre comment put you off sharing what you are going through. Wishing you all the best with your treatment.", "I disagree, mild YTA it is impolite to discuss things of a medical nature or other things that might bother people when they are eating. It's pretty hard just to block someone at the next table out", "Honestly, one of my favorite memories with my husband was listening to a couple in the next room scream fight with each other in Costa Rica. We took turns listening at the wall 🤣🤣🤣", "Seriously I adore eavesdropping in public but I’m not going to give commentary.", "Yeah, sounds like he was blaming OP for his own inability to hold his date’s attention.", "The lack of empathy really gets me. It's not like OP was just rambling about something really gross or inappropriate, they were talking about their unfortunate experience they are currently having, with their friends. NTA. Good luck OP!", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I disagree.\n\nIf you don't like listening to someone else's conversation you can ignore what they're saying or switch tables. Like what an absolute boneheaded way to make sure you never get a second date by telling off a group of friends for talking about their friend's cancer diagnosis, especially while that friend is actively at the table.\n\nOP is NTA.", "My husband and I were at a diner and overheard a teen trying to dump his boyfriend. The dumpee was trying to talk the dumper out of it and we stayed dead silent while having a conversation via facial expression only.\n\n\"I just feel like, we're sort of on different vibes, you know?\"\n\n\"But couldn't we just keep going together, but on like, twin vibes?\"", "Lmao, taking turns listening at the wall killed me.😂my husband and I were just listening to a royal rumbal between our neighbouring couple in our condo building.", "Yup, it's not unheard of for men to leave their wives after their wife receives a cancer diagnosis. He sounds like the type.", "In my opinion, this is the point of marriage- having someone you can eavesdrop with.\n\nI wish you and your husband much happiness!", "[deleted]", "NTA, sorry that someone shamed you like that. Maybe they were dealing with something similar or had a heartbreak and their emotional brain took over. If I was on a date and someone had said that to you, I would exit said date. Yikes.", "NTA I was just talking to my therapist today about how people want to pretend children with cancer don't exist. (I'm a survivor of childhood cancer.) Like sorry that being momentarily aware of my life is harshing your buzz but you know I EXIST and DESERVE TO EXIST IN PUBLIC. If dude is so fragile he can't handle just overhearing someone talk about their life, he needs to order take out.", "NTA. It’s not like you stood on a chair and announced it to everyone. You were asked a question and you answered it, which led to further discussions. Asa frequent restaurant diner, I too hear conversations that gross me out, or that I disagree on 100%. As an adult, I ignore them and enjoy my meal.", "YNTA.  What a snarky, rude, obnoxious, pathetic man.  You are entitled to talk about your cancer, or whatever topic you'd like ... and do not need anyone's approval to do so.  I wish you well with your health.", "NTA. If you go out in public you will hear bits and pieces of other people's conversations. He doesn't get to dictate what other people talk about. He could have picked up his own conversational skills with his date and paid attention to them instead. \n\n\nI hope you are doing better and feeling well.", "NTA. If I were that guy’s date I’d have some choice words for him before I left and never saw him again.", "NTA NTA NTA. Conversation should have swiftly moved on to menstrual cycles and the in\"s and out's of chemo treatment. Oh the romance!", "NTA...if i was his date, i would be mortified by him omg", ">One of my friends was kind enough to ask the guy to mind his own business and if he has such an issue just ask the staff to find him another table if possible and leave us alone.\n\nRefreshing to see a post with a solid friend that has OP's back.\n\nNTA OP.", "NTA and wow that was so rude of him.", "NTA Wishing you a speedy recovery.", "NTA. You were asked by your friend and you were just answering them. What business does he have to say 'you' ruined his date? Sounds to me like it be either boring or going badly. For him to disrespect your very personal issue as being nothing more than a mood killer, honestly is so upsetting. I'm so sorry you were treated that way, you didn't deserve it.", "This guy probably takes all his phone calls on speakerphone. Don't worry about it.", "Uh, this one is really obvious. NTA. I'm sorry that happened to you. There are many aholes in the world. The guy on the date was TA in this case.", "NO YOU ARE NOT!  I almost never comment on these types of things, but I am a breast cancer survivor (also stage 2) and it just drives me crazy how weird people get.  If this guy was eavesdropping on your conversation then I say too effing bad if it \"depressed\" him.  Best wishes to you.", "Absolutely NTA.\n\nYour friend did the right thing. You had every right to have a conversation about whatever you wanted to talk about, and that bloke was completely out of order.\n\nFrom one BC survivor to another, I wish you the very best of luck. It's not easy, so take all the support your friends can offer.", "Absolutely not! NTA! He was listening in to your conversation, and was enough of an AH to tell people with a problem to not talk about their problem BETWEEN THEM because they are ruining his mood? Oh how dare you disrupt the center of the universe! And no, you didn't ruin his mood, because to do something like this means he has zero compassion, so you weren't making him sad. You were just making him feel icky with all the talk about doctors and OMG, female parts!\n\nOn the other hand, you probably DID ruin his date, because after this display I doubt any sane woman would want to have anything to do with him. And for that, all I have to say is good on you!\n\nHope you get over this soon, and please don't pay attention to AHs like that, you already have your own battle. I initially thought it would have been one of your friends complaining - glad this wasn't the case and you have decent people around you.", "NTA\n\nNext time he'll know not to eavesdrop on someone else's conversation", "NTA. There is nothing wrong or shameful about discussing your cancer and treatment in public, nor are you responsible for some stranger feeling differently", "NTA, part of being in public spaces is listening to other people's conversations by accident, if that asshole wants some peace and quiet, he can have his dates at his home.", "NTA, ignore ignorant people talk about it freely even make jokes if it helps you get through treatment, my sister had stage 4 lymphoma and spent 75% of her time throughout treatment and recovery making bald jokes, keep your spirits high and don't push yourself, recovery and keeping your spirits high is key", "NTA. Fuck cancer - I hope you kick its ass.   \n\n\nThese people were out of line and need to learn to mind their own business. You weren't yelling about killing puppies, you were talking about your medical issues with a friend group who supports you.", "Nta", "NTA. And what type of knob thinks they are so important that they have the right to abuse someone with cancer?!?! \nFingers crossed for a full recovery.", "Definitely NTA, so don't let what a stranger said take up space in your thoughts. You were updating friends and answering questions like normal conversations are supposed to happen. Even in public.\n\nI hope your cancer treatment goes smoothly as possible and are surrounded by love throughout this ❤️", "NTA, he was rude, and he needs to STFU.", "Nta. Wow, he was incredibly out of line, rude & cruel. Its not his business what you talk abt", "God no! That’s a real life event that has had major impact on you. That dude though; TA. NTA and many good vibes your way to a speedy recovery!", "NTA.  You were having a conversation with your friends.  He shouldn't have been eavesdropping.  Guys like him are a big part of why women are so uncomfortable talking about the issue, even with their physicians and friends.  I really hope his wife never gets ill.  I don't see him being very supportive of her.", "NTA. That guy had plenty of options and chose the option that showed everyone he was a jerk.", "A restaurant is a public space. If you aren’t talking loudly, screaming, swearing, or tap dancing on the chairs, fellow diners shouldn’t have any complaint.\nThat guy and his girl weren’t having any conversation and paid attention to yours.  The date wasn’t going well and he needed it to be someone’s fault.  Maybe his date was recovering from cancer or just diagnosed.  Maybe she was an AP and he was leaving his wife who had cancer.  \n\nYour conversation was something he intruded on when he should have been all enamored of his date, in s private dining room.", "You were simply giving them an update on the situation, not going into extremely graphic bathroom-related detail about side effects of treatment. NTA", "If this guy's date has 1/2 a brain she will run away from him and fast. What an unbelievable sick thing to do to someone. Your are NTA but he is a massive, massive prick and deserves a hard kick in the balls, if we can find them.", "Just asked partner, whose grandmother died from breast cancer 30 years ago. \nThe man should’ve flagged the waiter and paid for your meal and/or drinks, per partner. That dude instead acted like trash. \n\nNTA.", "NTA. Your friend had the correct response; the guy should've minded his own business and stayed out of a conversation he wasn't involved with in the first place.", "NTA.\n\nYou were asked by a friend and replied with the information they asked for.\n\nIf that guy doesn't want to hear anything that displeases him, he better start cooking for his dates at home and stay out of freaking public places.", "NTA. If he was enjoying his date he wouldn't have heard the conversation", "NTA - that guy should stay home if he doesn’t like what he hears in public.  The absolute gall.\n\nBest wishes on your recovery 💖", "NTA.  Your friend did the absolute right thing.  You answered the question.  You have every right to speak about what you want to.", "NTA and if I were his date there wouldn’t be another one. Rude as hell", "NTA. I feel bad for his date…", "NTA\nHe was the AH, not you. So glad you had a friend who stood up for you. God bless and good luck. 🙏🤞", "Or, he's an alpha male and had to show his date how he could protect her from strangers.  NTA", "OP should have changed the topic to something funny like how small that guy’s penis really is🤣! Seriously, the guy had no right to dictate what another table’s conversation is about & it’s a shame OP had to deal with such a rude, heartless AH. Sending healing prayers to OP.", "Was thinking the same thing.", "Yeah, I would have been irked if my friends didn't ask how I was doing.  NTA.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "No soul", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "she didn't bring it up though. She was asked and she answered. Absolutely NTA", "[removed]", "I really doubt anyone is going around screaming about their cancer diagnosis in a restaurant. Particularly when it was stated that they already were not bringing up the topic unless someone asked.", "OMG in my twenties I went to the bar on the corner after work for a drink. Woman was trying to dump her bf, and he was arguing. She then tried to triangulate me into it as I was sitting a one a few bar stools down. I politely deflected and he eventually stormed off. I felt bad, but I was dealing with my own crap and didn't have the bandwidth for theirs.", "It's so common nurses actually warn women who are diagnosed about it.", "That's... depressing.", "That's a thing??? My Nonna got cancer in the 90s and while she beat it she was never the same after the chemo. My grandpa made taking care of her his #1 priority right up until she passed. This included visiting her every day in the nursing home for 10 years and keeping their house exactly as she'd left it.\n\nI can't imagine finding out my partner has a serious illness and leaving them, or him leaving me. That's a cruel thing to do to anyone, especially someone you profess to love. I mean \"in sickness and in health\" is right there in traditional vows FFS.", "It definitely does happen, but it is a bit sexist to think that there aren't also women who leave when their partner gets sick. Whether or not someone does that depends on their morals and character, neither of which are dictated by gender. There are plenty of female sociopaths and narcissists as well.", "Reverse the genders and what would you say? Plenty of younger women marry older men who can take care of them financially. They might also be mad about a cancer diagnosis if there was a pre-nup and they were about to lose their meal ticket. Both scenarios probably happen equally as often and both are equally shitty.", "A doctor told me. Also if they stay, forget about a physical relationship.", "It's definitely a thing, but your grandpa sounds wonderful <3", "The story was about a man who complained to a stranger that overhearing the details of her cancer treatment plan ruined his date.  Given that the divorce rate is over 20% for women with a serious illness compared to 3% for men with a serious illness, I was stating a fact: A man is far more likely to leave their spouse during a medical crisis and women are more likely to stay. \n\nIt's not sexist. It simply isn't. It's a fact that's backed up with actual research.  If you don't like it, take it up with the men who leave. I'm not taking back or apologizing for what I said because I am not wrong.", "[deleted]", "I didn't know there was that substantial of a difference in the statistics. Thanks for sharing that. \n\nHowever, your whole point is still irrelevant since the person who complained was a stranger and not OP's partner. Stating which gender is more likely to leave a sick partner has no relevance on who is willing to complain to strangers in public or who may get triggered hearing someone talk about cancer. All that said, I am absolutely not excusing the man because it wasn't his place to say say anything.", "I'm not saying he wasn't a prick, but your anecdote had absolutely nothing to do with OP's story. Neither did the comment you were responding to. OP's story is about a man she does not know not liking to hear about cancer. From that, you all jump to stories about men leaving their partners or being mad due to cancer. \n\nWhat if the other person in OP's story was a woman who got angry about hearing her talk about cancer at the restaurant? Would you still immediately start telling the same stories? My point is that it doesn't matter what the gender of the person who confronted OP was. Shitty people are shitty people.", "[deleted]", "I hope you realize I didn't mean to shit on your personal story. It seemed like an anecdote and I just wanted to bring up a counterpoint that was also based on a bad personal experience. Still, sorry if I brought up unpleasant memories or anything. That definitely was not my goal and I wish you the best.", "You're NTA. The eavesdropping guy could have moved if it bothered him so much. He could have ignored and tuned out your conversation. Or he could have said he couldn't help but overhear, and wanted to wish you well and hope for a quick recovery. Instead he decided to pile drama onto a woman who is battling cancer. Sorry you had to encounter such a lack of class and empathy in that man.\n\nBest wishes for a quick recovery.", "NTA. Good on your friend!", "NTA \n\nSomeone at your table asked how you were doing before asking other questions. Not your fault someone else not sitting with you was eavesdropping on your conversation. People really should mind their business. The date must have been bad already if he payed attention to someone else’s conversation.", "NTA. He should mind his own business.", "What the absolute fuck. I’m glad your friend told him to mind his business but he needed a lesson in basic empathy and not being an AH. You can talk about your illness whenever and wherever you need. Don’t ever worry about people like this. NTA", "NTA. Good luck with treatment and hopefully you post after you beat the damn thing.", "SO NTA. people get so uncomfortable when people with medical issues talk about them. i expected your friends maybe to get awkward, but the AUDACITY of a stranger to say that you ruined their date is appalling. that is HIS problem, not yours, and please don’t take anyone else’s emotions on, i’m sure you’ve got enough of your own. much love", "Of course, you are NTA. I can't believe someone would make a comment like that. I just can't believe it. I can't imagine how embarrassed their date was. That really is crazy but I do hope that all goes well with your treatment and you are back with an update soon enough. Take care.", "NTA. If those peoples only entertainment was listening to your conversation then it’s their fault. I hope you get berter", "NTA. Wish I had been there to tell that chucklehead what I think of him.", "NTA. WTF? Can you not talk about your life at all? That guy had absolutely zero part in your conversation.", "NTA", "NTA please just think about the situation. he complained to you that just hearing about your cancer ruined his day but you having cancer apparently is fine to him. his privileged self can move seats. Did you see how his date reacted? You probably did her a favour so she can see what a jerk he is and stop wasting her time.", "NTA.", "INFO: How old was this fool? NTA unequivocally, I just want to know because of how ridiculously childish that comment was.", "Nta!!!!!!!! Don’t ever think you did wrong!!! It’s a public setting and ppl talk about all kinds of different things! You had every right!! That dude was the AH!", "NTA. Ild tell him to fuck off and tell his date to leave his ass now", "NTA. That guy is an eavesdropping asshole, and I hope the woman he was with decides there won’t be anymore dates. Good luck your treatment!", "NTA but dude trying to control other people’s conversations definitely is. SMH", "NTA I’ve been to the restaurants many time and I’m never listening into the tables next to me conversations much love to you OP stay strong you got this and don’t let that AH at the restaurant get to you ❤️", "Depends on the restaurant - some seating situations is kind of unavoidable.\n\nBut guy is an AH for opening his mouth about it.  Geez.  Sure sometimes it’s hard to ignore people if they’re close proximity or loud, but his comment was pointless.\n\nAlso, while it’s not the case here, sometimes we just eavesdrop because the dramaaaaaaa\n\nOnce sat at a table next to a bunch of Wall Street guys - two were talking about international politics and the other two were asking why AOC was in charge when she couldn’t even get their drink order right when she was a bartender.\n\nAnd then there were the two ladies playing the wealth and sex-capades Olympics and then at the end pulled out their little planners to set up another time to meet for tea.  What a delight.", "Yeah, you are wrong. Completely, totally wrong. \nAnd no it's not, you can absolutely mind your own business I rarely listen what other tables are discussing unless there is a fight.", "Yup, I hope it was the first date or at least early on into dating. I would’ve left then and there if I was out with someone who said that after overhearing another random guest talking about their diagnosis.", "I occasionally give commentary but i text it to my boyfriend, i can't imagine saying it out loud or loud enough anyone else could hear it\n\nAlso big thing, i wouldn't insult someone for talking about cancer, at most I'd say something like \"i hope she gets better\" but im not gonna shit talk someone for having cancer", "Bot, stolen comment\n\n[Oops stolen from here](https://www.reddit.com/r/AmItheAsshole/comments/114p5oz/aita_for_i_34f_talking_about_my_recent_cancer/j8ylj5e?utm_medium=android_app&utm_source=share&context=3)", "I had been married to my husband less that 1 year when I got diagnosed with stage II colon cancer. He was with me every step of the way, though couldn't be with me in person at appointments because of COVID. (I went into the hospital for the 1st time March of 2020.)\n\nMy treatment and surgeries radically altered my body, and I feel like we are just now getting back to (our new) normal. I know I am incredibly lucky to have him, and it breaks my heart that someone's partner could abandon them in their darkest time. Traditional vows mention \"in sickness and in health,\" but I guess some people aren't prepared for that.", "Saaaame.  Big fan of the texting comments when you overhear something outrageous or juicy in a restaurant", "Dr Seuss did it to his wife after she became sick 🙃 it’s so common that even the people who helped create things we loved in childhood were that kind of cruel in private", "He is a wonderful man. He and my Nonna set the bar of what true love looks like. They started dating in high school and never spent a day apart in the 62 years they were married until covid kept him from visiting her at the nursing home.", "Actually, my point is relevant because I was originally replying to another comment that was suggesting that the stranger's date should rethink continuing a relationship with him. Considering the statistical likelihood of men divorcing their spouses with a serious medical illness, coupled with this man's appalling behavior, I think it's pretty safe to assume that he doesn't handle a medical crisis very well.", "He was the one with the hang up. Perhaps he shouldn't have eavesdropped on your conversation. NTA. Talking about cancer should not be taboo and your friends went out with you to support you. He is the asshole.", "NTA but that guy is trash", "I have stage 4 colon cancer. NEVER be embarrassed or afraid to talk about how you're doing.  \nI agree with you about not bringing it up but if people ask tell them how ever much you're comfortable talking about.  You never know,  your story may influence someone to get checked out and catch it early.", "NTA.  I am so sorry you’re going through this, I wish you the best, speediest, least draining recovery possible.", "NTA. They should have not eavesdrop lol", "NTA at all.. Ooo he had one meal made uncomfortable from ur conversation about ur life threatening illness u have to live with daily!\nSo sad he had to realise the world doesn't revolve around him n keeping him comfortable. Maybe the person who just had surgery and has horrible treatment coming up might just be a lil more uncomfortable than ur 1hr max of listening to it. I get it can be a sore spot for other people as it effects many many people. Majority will have a story to tell if they're old enough at the time to remember. But that doesn't mean u cannot talk about ur own with ur friends!\n\nNTA", "NTA- your friends are allowed to ask what your situation is. He could mind his own business.", "NTA. You were having a conversation. People discuss all kinds of stuff in restaurants. That guy was terrible.\n\nAs someone who went through breast cancer in her thirties, I love your friends for taking you out, and for *talking about other stuff* as well as for asking you the deal and standing up for you. \n\nI hope everything goes well with treatment and there are no more surprises.", "NTA\n\nYou just had to sit next to one", "NTA tell them they ruined your depressing dinner by acting too romantic.", "NTA. That guy is kidding me right? Come on.", "OP - I hope that you are doing better and that you are on your way for a full remission / recovery ❤️❤️. \nThat guy is an AH - you are in public and having a conversation with your friends. He can say what he wants to his date (who I hope left him after for being such a cold and heartless person) but to try to interject with others is just ridiculous!", "Jesus christ. How heartless do you have to be to complain about that? Obviously NTA.", "I would have graphically described explosive diarrhea at that point.", "NTA. You were asked questions by someone you were with and answered. That dude is the AH for listening to your convo and having the audacity to whine about it.", "NTA at all, he should have minded his own business. Period. \n\nOne thing I will say though is that some restaurants cram ENTIRELY too many tables into a space just to make a little bit more money and it makes it a drag to try and have any kind of private dinner conversation, even if it isn't a sensitive topic. I've been seated at tables where I backed up my chair to go to the bathroom and almost knocked over someone's table- and I wasn't backing it up more than strictly necessary. \n\nthat doesn't justify him eavesdropping or commenting at all, not even a little bit, but it's just something I think could help avoid situations like this. I think that guy was probably striking out and wanted to place blame. Hopefully his lack of empathy was the nail in his metaphorical coffin, or else I'm sorry for the girl. I'd be mortified if my date said something like that. Like \"get up and storm out after paying my half of the bill\" mortified.", "Of course you're NTA.  In fact, you're a hero because you provided an opportunity for that asshat to wave his giant red flags around so his date knows to GTFO.", "NTA. What a couple of weirdos to eavesdrop *that* closely on your conversation? Also it must not have been going well for that to ruin their whole date.", "NTA. Next Table Eavesdropper can mind his own damn business, what kinda schmo relies on neighboring tables to “set the mood” for his date? Hope his date ditched him.", "NTA. I'm a terminal cancer patient, if someone asks about it, I don't mind sharing info. The busybody next to you that couldn't help listening, much less mentioning was inconvenienced that they may have to feint empathy for a stranger. Fuck him, very much, and he can mind his own business.", "NTA. Why was he ease dropping? He must be a horrible date.", "NTA. If there is any karma, that date is his last (with her at least).", "in my head your friend is Rosalie Aprile in the Sopranos yelling “hey nosy, eat your manicotti” to a gawker nearby.  we should all have a friend like her.  \n\nNTA and i’m rooting for you.", "Fuck that guy. And fuck cancer. NTA. ❤", "NTA 35f with colon and endometrial cancer. I'll talk about it wherever and whenever I feel like it, you should too. \n\n\nYou need a good support system, talking to your friends is a good way to cope. Dude should've been minding his own business if he didn't like your topic of conversation. \n\n\nHopefully, you see this post. I know not all cancers at a young age are from genetic reasons, but have you considered genetic testing? I was tested and found out I have Lynch syndrome with a gene mutation. It changes how I'm treated, sort of. plus requires a lot of yearly cancer screenings. \n\nWhen I first found out about the cancer, I asked the Dr about being tested for Lynch and he dismissed it. I wish I had pushed it more because I wasted 7 months trying treatments that would most likely never work. Now I have to have surgery to remove everything, and the cancer has advanced.", "No need to DM me, I'll just blast some details. Like this one.\n\nSIMETHICONE IS A MIRACLE. IT HELPS YOU FART. GET SOME FOR EVERYWHERE.", "Oh bullshit.\n\nI had cancer in my thirties. We did eventually divorce, but he didn't leave me because cancer, and it did not end our physical relationship. While plenty of men are shitty, \"just fyi, your husband is going to leave you and you'll never have sex again\" is not a useful thing to say to newly diagnosed cancer patients\n\nCancer survivors who want to have sex continue to have sex. Spouses of cancer survivors can and do manage to maintain or rebuild attraction to even very changed bodies. If you are a cancer survivor who wants sex and your spouse can't or won't get into it with you, I don't think I just lucked in to a dozen or so men who can cope - I think lots of people can cope.", "NTA.\n\nIf I overhear someone is battling cancer, I'm either going to wish them luck or say nothing.  Life is hard enough without being an asshole to someone you know is fighting an uphill battle.", "NTA He should be focused on his date, not you.", "NTA and I would’ve poured my water on his head.", "Baby, what I wanna say to that guy would get me banned from this sub. You’re doing great. NTA", "NTA.  Dude shouldn’t have been eavesdropping.", "NTA. This guy is a colossal bastard, and you did nothing wrong.  I'm so sorry this happened to you.", "NTA m", "NTA unless you're going into graphic detail about toe nails falling off and thrush infections.   Maybe it triggered something in him, like a memory of a loved one dying of cancer, but he's the massive asshole here, not you", "NTA you have every right to talk about whatever you choose at your table  lmao \n\nIt's a public place people talked about way worse. he probably was pressed and he ruined his date himself trying to talk about y'all like people need to learn how to mind their own business\n\ni'm sorry about your cancer.", "NTA, but that guy was definitely TA.", "NTA!!!  \nNo. Nope.  \nHis ears have this incredible function to them, that involves not focussing on conversations he isn't part of.  \n\nAs I say to my kids: make better choices, bruh.", "NTA.  His lack of empathy hopefully will cost him a follow up date.  Who would want to continue dating such an AH?", "What a heartless prick. NTA in anyway OP.", "Dude ruined his date by showing her what a douchevag he is. You did the girl a favour!", "NTA, if I was at your restaurant and overheard someone say that to another I would call them out for being rude and disrespectful. You were completely in the right, and best of luck man, I’m sorry for your recent diagnosis.", "NTA. Your friend is awesome. You did nothing wrong. Hope the date sees what an asshat that guy is and runs. Sending positive vibes for your cancer journey. 💖", "NTA\n\nShould have told him to shove his plate of food up his arse.", "NTA! its not your fault that his date was having a shitty time", "NTA. why was the guy listening in on your private convo?", "I am so sorry you went through this! Totally NTA! I’m only 38 and just went through a cancer recurrence (colon) and I’m involved in some advocacy groups that are trying to end the stigma of talking openly about cancer (and especially early onset as we almost never get taken seriously because of our age). I’m proud of you for being able to openly talk about it, and it sounds like that guy wasn’t getting laid in the first place lol. Glad your friends are supportive 😊", "I think his date noticed him staring at some girls so he felt compelled to make excuses.. regardless couldn't agree more..\n\nOP NTA", "Putting aside the depressing mood.. \n\nDepends on the volume of OP's conversation.\nThere are a lot of people in this world that have no idea how to control the volume of their conversation. I've definitely been on dates with my girlfriend that have been \"ruined\" by people loudly talking about whatever it is they have talked about. I usually just focus on my food and myself at that point. Whatever it is that they are talking about, it doesn't need to be said for the whole restaurant to hear. Almost all of the time its random conversation that isn't bad, but I still dont care. Basically, your voice shouldn't sound significantly louder than the persons voice sitting across from me talking at a normal level at most places.\n\nIf it was a respectable volume, it's definitely NTA.", "Hey at least now she knows he has absolutely no empathy and was apparently raised by wolves.", "She found out a lot about her date in that conversation, none of it good.", "My best first date was next to a very dramatic older couple (affairs on both ends, at least one 'secret child', references to 'the incident', etc. still partially convinced it was a hidden camera show that failed to take off), part way through I realized he was eavesdropping just as much as I was and the moment the other couple left we both absolutely lost it and had a blast dissecting their drama and speculating for the rest of the night", "It's part of going out. It's not your problem he was uncomfortable.", "I was warned. I've got surgery 1 next week. Thank you. I just grabbed the Target generic. Good to know the best ingredient.", "Right!", "I hope you're doing well now, and I'm glad your husband is a good one!", "Didn’t Newt Gingrich do it also?", "Total bullshit. Lots of marriages don’t survive cancer. But lots of marriages don’t survive having kids or job loss or the many other stresses life throws at us. \n\nMy parents for example, stayed together thru breast cancer and continued to have a good sex life. At the time I wished I didn’t know that detail. Looking back in the years since my mom died, I’m just happy for them."]}