{"id": 10265, "submission_id": "115c3f6", "title": "UPDATE: AITA for choosing to go on a trip with my girlfriend instead of taking care of my struggling brother's son?", "selftext": "Original Post: [https://www.reddit.com/r/AmItheAsshole/comments/11174gu/aita\\_for\\_choosing\\_to\\_go\\_on\\_a\\_trip\\_with\\_my/](https://www.reddit.com/r/AmItheAsshole/comments/11174gu/aita_for_choosing_to_go_on_a_trip_with_my/)\n\nThank you everyone for the comments, after reading through for about an hour it kinda helped me realize how toxic my relationship is with my family. As many of you mentioned, yes my brother is the \"golden child\" of the family and thinking about it now that favoritism is the main reason i wanted to move away from them so badly in the first place. I had a talk with my brother and my SIL where I apologized for calling their child a demon and for the condom remark. They accepted my apology but they did not apologize to me. Apparently ours and my SIL's parents were just not just telling them but encouraging them to use me for help the whole time. I told them how exhausted and frustrated I was and how much this whole shit show has hurt me and that I would not be watching Kyle anymore period and that they need to figure something else out. They did not take it well and my SIL started yelling again and after some arguing my SIL said that if I would not watch Kyle the least I could do is pay for his daycare and help with some of our other expenses since I have the money to zip off to a different country every month. I was honestly appalled. I would not have minded to help them out financially but the tone of her voice as she said it was just infuriating. The only thing they heard was that I would not continue helping them. They didn't give a shit about anything else I said. I just got up and left their house without saying a word. I wanted to leave before I completely exploded again. 10 minutes after I left my phone started buzzing with them and my parents and I just put it on DND. I read a lot of comments saying I should go No Contact and I really did not want to have to do that but they are very clearly not interested in respecting me as a human being so thats it. I will not be speaking to my family until they want to genuinely apologize to me. Thanks guys :)", "created_utc": 1676714810, "permalink": "/r/AmItheAsshole/comments/115c3f6/update_aita_for_choosing_to_go_on_a_trip_with_my/", "score": 1543, "replies": ["Sounds like the grandparents of the little \"demon\" don't want to have him around and that's why they suggested you babysit him instead", "Your family is indeed very toxic. Anyway, enjoy that trip with your GF! You both deserve a break and the time together.", "I hope that final confrontation eliminates any residual guilt you were feeling! \nI would go NC even if they try to apologize!", "Holy fucking shit. The entitlement that is REAKING off your SIL and family is absolutely mind blowing. \n\n\"The least you could do is pay for his daycare and help with other expenses\" ????? **It's not your child!** \n\nHonestly sounds like they're salty they can't like a similar child free life as you. The fact that the parents and in laws were also ganging up on you to \"take responsibility\" is freaking nuts as well. \n\nNo contact is unfortunate but your best option imo. Unless they end up giving a sincere apology, with no strings attached (i.e. future child care), I'd say good riddance!", "I say this as a parent, anything you do for others in terms of their children is a gift not an obligation. Don't feel bad about anything, they used you", "I just read the first bit. Do your family realise you have a life and that you have a gf and one day your own family? Lol I hate seeing toxic families like that when they fail to see you got things to do for yours! Mate you enjoy your life and mate I wouldn't being going back to them so soon as they will try to use you again over and over. Enjoy your trip!", "INFO: I just read your original post, is SIL pregnant again or are they just in planning mode for the next child they want to pawn off to you?", "Oh man. I’m sorry your family has taken advantage of you to such a degree that they forced you to cut contact off for your own sanity and well being. Suffering for the sake of family is a toxic cycle lie meant to empower the toxic people and put blame on the truth tellers such as yourself. Keep the distance and you’ll see how good it is for you.", "I'm so glad that you didn't back down over this. You can see by SIL's reaction to you setting clear boundaries that she and your brother are not going to change their behaviour. \n\n>They did not take it well and my SIL started yelling again and after some arguing my **SIL said that if I would not watch Kyle the least I could do is pay for his daycare and help with some of our other expenses** since I have the money to zip off to a different country every month. \n\n*That* remark really shows off the entitlement and jealousy. And what exactly are these *\"other expenses\"*? \n\nThe least *they* could do is parent the child they brought into the world. If they can't manage that then they shouldn't even consider having a second child. \n\nWell done for getting out of the situation and ignoring the calls from the rest of the entitled family members. Proud of you. Hope you've been able to spend some quality time with your GF.", "I am so sorry for you, for how they are treating you and for their lack of respect. The whole situation sucks. They are not entitled to your time or money, your SIL even suggesting that you pay for their son's daycare is ridiculous. It's a good thing you left before exploding, otherwise you'd feel bad again. But tbh that \"fucking without a condom\" remark from last time wasn't so out of place if they are not able to take care of a child, financially or time-wise. \n\nIf I were in your situation I'd probably lie at some point and say that my work situation has changed and I am no longer working remotely and have to go to the office every day and thus can't watch the kid anymore. This is NOT a good advise, that's a tactic of conflict-avoiding cowards like me. I'm just kind of curious what their reaction would be.", "The expectation from your sibling, and from both sets of grandparents is outrageous. I struggle with the idea that people are so very entitled that they think they can demand your time, let alone your money, for a child they chose to have. They don't have the right to your time, nor do they have the right to your money. In all honesty, they should not choose to have children they cannot afford. I know people's situations can change, and you can end up struggling to make ends meet, but if anyone can provide help then that should be received with gratitude not with this horrendously toxic attitude to your life being theirs to demand.\n\nThis is awful. I'm so sorry. As an aunt I did frequently get pissed off when it was assumed that I had nothing better to do than babysit - but my sibling would never have dreamed of expecting me to be their regular day time child care.  As a parent I understand the need to get time to yourselves, but my children are mine to cater to, and arrange things for, anything offered to me is a welcome bonus but never an expectation.", "You do not owe these people anything. Your brother chose to take a job with lower wage and less childcare compatibility. They chose to have children. You’ve been incredibly generous with your time. Their childcare issues are theirs to sort- they’ve been very lucky to reply on family (you) so far, time for them to figure it out like the rest of us.", "Wow! What exactly are they doing *for you* that warrants this kind of entitlement?!\n\nI mean, I have a self-centered sibling as well, but yours is a category of its own.", "It’s okay mate none of this is your fault. Post some pics from a beach and tell your brother to man up and support his family. Call him a deadbeat etc", "Wow... I can't imagine how sad your childhood must have been for your entire family to think of you as a servant. I'm so sorry, but remember, you are not their servant", "Since you won’t give free labor you have to pay?? I know you said you would have had no issue with that but you should.  That’s a ridiculous request and no where near your responsibility.", "NTA still OP!!!\n\nGood for you for standing up for yourself, your partner and your future! You deserve a wonderful life surrounded by people who love you. Not abusive users who feel entitled to your time and wallet!", "NTA. If your brother and his wife cannot afford kids they should not have them.", "still NTA. Uncles dont subsidise the children of two whole adults.  \n\n\nIf they try to strong arm you by dropping the kid off to your house anyway feel free to report an abandoned child, it's the biggest burning of the bridge but you can't be coerced into subsidising childcare (through your own labor or through payment) for your brother's family.   \n\n\nIt seems that your brother moved to your town in order to leave his industry and use you for free child care. Maybe think about relocating somewhere even further away from them, if you're WFH.", "Just because your brother made multiple poor financial decisions doesn’t mean you have to clean it up. Your SIL needs to get a second job because she already is neglecting her child as it is.", "NTA - well done. Never get into a pissing contest with a skunk.", "They want you to pay for their daycare?! Are they fucking insane?!\n\nGood riddance OP\n\nNTA", "Who's going to pay for your kids and watch your kids when you have them? Is it a round robin type of deal?", "You really need to stand up for yourself and tell them to fuck off. They see you as a doormat and they're straight-up bullying you. Don't be a victim here.", "OP I'm happy you stood up for yourself,  but I think you are being a bit naive if you think you will ever get a genuine apology from them or your parents. They raised your brother to think he was entitled to your time and money.  When you stood up for yourself they backed your brother. I'm glad you have decided to go no contact but I hope you are doing it understanding that it may be permanent because your family doesn't seem interested in real relationship with you . What they want is a relationship were you are ok catering to your brother's family needs.", "Wowewww. That sucks. Good thing you stopped. \n\nI wouldn’t go no contact right now. But you should learn more about the dynamic and boundaries and decide what to do from there. \n\nCheck out a CoDa Group (Codependents Anonymous) and/or Adult Children of Alcoholics and Dysfunctional Families (ACA) - it will help you figure out how to handle it. But there are lots of steps before no contact", "Imagine thinking that a person is obliged to pay child support for not babysitting for free. \n\nYou can be part of my family,  I just ask for vacation pictures and hope you had a great time", "I wish you the best, take care of yourself! It's a good thing you managed to see how toxic it is for you to have them in your life. Sad it had to happen, but yea.", "Thats you and your changed and my hormones changed along with my thinking. Each to their own. Meh", "Yes, why do they think they are entitled to OPs money?", "Winner winner chicken dinner.", "While the favoritism is obvious, I suspect they made use of of the grandparents previously, prior to the move.  OP says he moved away to get away from his family and this all started when brother and SIL moved closer to him.  I am sure that they had all decided before the move that OP would be helping out when they got there, they just didn't bother to get his opinion. \n\nNow the family is favoring the son with grandkids because.....well.....GRANDKIDS.   As the only single sibling in my family, I saw more than a little of that over the years.\n\nI am not sure what OP can do moving forward.  Tell his parents that if they are so concerned then they should move closer to help with the kids?  Negates him moving away in the first place.  Move again?  Kinda sucks uprooting his life...what about iob, girlfriend, etc?  Go NC?  I don't see his family respecting that.  I wonder how large is the town/city they are in.  Perhaps a change of address/phone number would be in order but OP needs to decide if he is ready to pull that trigger.", "This is very well worded. People can be so crazy sometimes.", "SiL seems a little unhinged, like she has decided OP is actually Kyle's dad somehow. \n\n\nMy wild ass speculation is something going on in the brothers household, they are not happy people.", "Your last paragraph might be better advice than you think. I've read too many stories about entitled people just dropping their children off in front of their relatives houses and driving away. I wouldn't put it past OP's brother and SIL to start doing that.", "I'm not sure OP plans on having kids, just saying :)", "It also seems like they like the idea of kids and the look of having a family, but don’t actually want the responsibility. Why even have kids if you don’t want to spend time with them? I don’t think the nephew’s behavioral issue came out of nowhere. That household is not stable.", "Never explain. Never lie. That shows weakness. That shows that he may change his mind if he's caught in a lie. The fact that he's at home can easily be verified anyway.\n\nIf they dare do this, just call the police/child protective service. That's it. There is no need to lie and there is no need to hide inside the home. There is no need to hide the car and there is no need to close the curtains. Do not set that precedent.", "And that's when you call the police.", "A family could also be just him and his GF (or perhaps wife then) or maybe they will like to get pets. A family isn't just parents + children.", "A family could also be just him and his GF (or perhaps wife then) or maybe they will like to get pets. A family isn't just parents + children.", "A family could also be just him and his GF (or perhaps wife then) or maybe they will like to get pets. A family isn't just parents + children.", "A family could also be just him and his GF (or perhaps wife then) or maybe they will like to get pets. A family isn't just parents + children. Just saying :)", "Hes only young he might not know yet. He still has his time to decide for sure who knows", "I don't know if you read the rest of his post but he says he doesn't particularly like kids, and very much likes his freedom to travel. Not saying he might never become a dad, but there's more to being fulfilled in life than starting a family", "A family could also be just him and his GF (or perhaps wife then) or maybe they will like to get pets. A family isn't just parents + children.", "At 24 things can change cause lord knows I said the same at that age. So never know what will be in store but his life isn't being a doormat to look after a kid with parents who don't get he was getting shitty with it", "That is what I meant as well", "I hate when people say “oh you’re only *insert age here*.  You’ll change your mind.  Or “you’ll change your mind when it is your own child, they’re so precious” or “you can’t just wait til you’re financially stable, once you have the kid you’ll just figure it out.”     I was told that constantly for the past almost 20 years and I still have not changed my mind.  It is probably the most annoying response to saying that either you do not like kids or you know you are not able to be responsible for another life 24/7 for 18 years. Some people just know.  And as a women I have had the hormonal thoughts that try to override my logical brain but then I think about my above reasons for not wanting a kid and then the hormonal urge is over.  \n\nEven if someone might change their mind the response is still rude and annoying.", "NTA.\n\nWhat in the holy raccoon. Pull your weight???\n\nYou didn't have a kid. This kid is not your problem. Daycare costs are not your problem. Your brothers life decisions are not yours to solve or support or even acknowledge unless you choose to.\n\nYour family sounds enmeshed and unhealthy in a million ways. It's always the healthiest family member who expects just normal, everyday boundaries that gets blasted for not being a 'team player' or in this case \"pulling your weight.\n\nHon, you can't pull your weight in decisions that had nothing to do with you, but somehow your family believes are your responsibility.\n\nThis is not a \"You\" problem, this is a systematic family problem that you were raised in and started way before you. I wish you all the best. It is no small thing to recover from this kind of family dynamic.\n\nWhen I was broke and in grad school,  my family thought I should send my older sister money each month, because her husband was an alcoholic. It was an awful time realizing my family really only liked me when I made their lives easier.\n\nThese books helped me:\n\nIt Wasn't your Fault by Engel\n\nHealing from Hidden Abuse by Thomas\n\nFree from Abuse & The Truth will set you free by Miller\n\nAdult Children of Emotionally Immature Parents by Gibson\n\nToxic Parents\n\nThe Betrayal Bond by Carnes", "IF they apologize then you also need to make sure you reinforce that Kyle is their child and they are responsible for his care and/or the cost of his care. \n\nYOU DO NOT have a DUTY to help watch him (or their new child) and you are NOT going to help with the cost. TOTAL ENTITLEMENT going on here. If they are having children then they should be ready, willing and able to provide for them. NTA", "You did a good job setting boundaries and sticking to them. Your brother, SIL, and parents are completely out of line. They are manipulative and abusive. \n\n\nYou might want to consider talking to a counselor. They could help you continue to set boundaries with your family.", ">They accepted my apology but they did not apologize to me.\n\nAs you see, apologizing to them was a mistake. Don't give an inch anymore.", "Wow just wow. How does any of it make any sense?!? It’s appalling! YOU did not spawn this child. You have zero responsibility for them. \n\nYou're a lot nicer than me OP. I wouldn’t have apologised at all in the first place.", "If it gets worse and you wfh anyway and if its possible for your gf i would move again and this time not let them know where you live (maybe the state but not the city).", "Good for you mate. Just an advice: if the day ever comes that they \"apologize\", there's a great chance it's to continue to manipulate you (actually I bet 100% it will actually be). This kind of toxic people never change. Never.", "I am just a stranger on the internet, but I am very proud of you Mate, you stood up for yourself and put boundaries to these entitled clowns, they knew what they did since the first day, when they moved to your hometown, and not just that, they attempt to have a second child and use you like a forever free child daycare. And the worst are the Grandparents. Just stay away of the all drama. Enjoy the trip :)", "Please go NC and change your #phone number. Unfortunately they don’t care and it’s okay to mourn that but it’s not okay for you to go thru that every time. Don’t let them bully you into taking him again or paying for anything. Live your life and make sure they don’t bother you at your apartment or decided to leave your nephew regardless of what said. This is toxic behavior. Have you though about maybe moving to another city or even an hour or so away from them. A place that’s not easily accessible for them to go. I hope you wen to your trip and had an amazing time.", "Every time i read these kind of posts a part of me wonders if these could be real. Who could be THIS entitled and show an attitude to people who were helping them out??? Have I been living in a fantasy world where people are.. abnormally reasonable??", "I am so shocked by this whole situation. I just don't understand why or how they came to the conclusion that it's YOUR duty to take care of a kids that's NOT yours. Or pay for his daycare. \n\nWhat????? \n\nI mean... What?????\n\nI'm in absolute disbelief. \n\nI'm sorry you're in this situation, but NC seems like the appropriate decision.\n\nEDIT: because I didn't realize before that SIL also asked for you to cover some of their other expenses. \n\nW H A T????????????", "Your SIL sounded like you are the father of her child and denying child support. So tell us the truth 😜. She sounds so entitled.", "\"I'm so pleased you're so concerned with little one and their welfare! I'll inform B and SIL that they should contact you immediately about the days you'll be looking after little one each week and the level of financial contribution you'll be making going forward! I've done my part. Your turn.\"\n\nFor each and every flying monkey you get. NTA.", "NTA. The balls on your SIL! Your money and you can spend it as you choose. Their child and you have no obligation to pay for daycare. That's their job.\n\nThe audacity of your parents ans SILs parents to encourage them to rely on you for childcare!", "Bloody hell mate, what an awful family.", "Hey! Read your og post then got here. How was the trip? I'm glad you stood your ground. Enjoy your life!", "You should really think about having a kick ass security system with cameras, or hire a house sitter when you go on vacation.  Your family sounds unhinged enough to do something stupid.", "It's unfortunate that they put you in this position, but since you are here you are taking the best route out.  I applaud that. \n\nPersonally, I'd send them a link to the original reddit (or this one, since it has a link to the original at the top).  It would save you reiterating the same points, and allow them to see some outsider perspectives as well as to understand that they have been cut off, and why.\n\nThere is some darkness in that house.  Don't let it get jnto you.", "NTA it's harder than people realize to go NC, it's so much more involved than just not talking to them. But do it and hang in there, I had to with my father's family - it meant giving up holidays, visiting, etc, as toxic as it is it leaves a weird hole. But I rebuilt with other friends, had better relationships with the relatives I do truly enjoy. It's been years and I glad I did it not only for me but my kids. It will be hard, but in the long run so worth it.", "NTA\n\nOne thing I've learnt in Reddit is that other family members want you to step up so that the existing problem doesn't become theirs. \n\nPlease don't engage since they'll gang up again on you. Do not even agree once or you'll be snared back again.", "Your family's entitlement is really shocking. The childcare...paying for daycare. Really who are the parents here? You are just being used and the moment you stop they have an attitude.\n\nI think your decision to go no contact is a wise one. They need to respect you. NTA.", "If she does don’t answer and call social services if she leaves him. I’m not sure why some parents think other people are responsible for their children", "INFO: What happened with your vacation? Shouldn't you have left by now?", "They're nuts. You should pay for his childcare?? Lololol. No. They can't get bent. Go no contact.", "Oh no wonder he’s a demon with parents like that. NTA: block them and change your locks", "Asking an unrelated question, how do you see a post after it has been removed, please?", "THEY SHOULD HAVE BEEN PAYING YOU!", "Throw your guilt away. I’m glad you know where you fully stand in your relationship.  You will get no apology so stop expecting one.  Your are not financially nor physically responsible for your nephew.  Your sil needs to apologize for sure but she won’t because she thinks she’s entitled to use you up with permission given from your family. Please stand your ground because the child is not your responsibility and your right about the condom also.", "They want you to pay for their childcare? Wow", "Do not feel guilty. He is not your child and you have no responsibility towards his care. Go enjoy your life not tied down to their responsibilities and control. Maybe look into therapy too so you don't accidentally get pulled in again once they do \"apologize.\"", "I hope you find the time every so often to think, \"Boy it is peaceful right now. Glad I'm not babysitting/ getting tasked my my family/ yelled at/ scheduled.\" Remind yourself when you are happy so that when they inevitably get in contact with you you know in your bones what freedom from their behavior means and won't be guilted into regretting it.", "Did you ever confront your parents for what they said?", "So sorry your family is like that, OP. Probably your brother and SIL were planning a second baby relying on you to take care of them, but now you know.\n\nI know this situation might be disconcerting, but you only have to gain to keep distance from toxic people", "Glad to hear. Truly toxic to expect your 24 yr old brother to be your childcare or cover your costs and the grandparents acting like that's not just craziness. \n\nEventually you may have your own family and costs - enjoy traveling as much as possible while it's easy, this is that your youth is for!", "She what?! Why on earth would you pay for daycare for a child that’s isn’t yours? Their entitlement is unhinged. I would stay no contact.", "Just read your original post + this update and it's appalling. you're an early 20s still young adult and have zero \"duty\" to mind your nephew nor financially support your older sibling. WTF\n\nI have 2 younger siblings with a similar age gap and I would never make them feel like it's an obligation to help with the kids I chose to have\n\nEmma sounds like a complete entitled brat and I fully support you going no contact with them, though please don't punish your nephew for it. I hope you can find a way to somehow maintain a connection with him", "Good for you. Sometimes family can just suffocate you and the only thing to do is step away, especially since they're ganging up on you. \nMight be good for you to set a deadline for when you will consider your relationship with them again, like go half a year at a time without contact then see how you feel.", "She suggested you pay for daycare… for a kid you don’t have??? Is she ok?", " (I had to make a comment after reading your OG post and your update)\n\nI’m assuming that the SIL’s family/parents live a bit farther away and can’t help take care of your nephew physically? It seems like a lot of the pressure from her is coming from both her, her parents *in addition* to your parents and brother. \n\nThe fact that her and her parents (and everyone, frankly) just blatantly *assumed* you’d drop everything to help raise your nephew, when you’re figuring out your own life, says a lot.\n\nAll parents here, in law, blood and through marriage, need to step up, have a discussion and talk about how they’ll be helping out with either looking after Kyle themselves or have *them* give some contributions to Kyle’s daycare and other expenses. You’ve helped put plenty already and don’t need to lift a finger until they buck up, apologize, and make some serious amends.\n\nI’m also concerned for you, OP, going forward. You’re 24 and might not ever have kids and that’s perfectly fine (I’m not planning to have any either and I’m a woman who’s 10 years older than you). But if/when you ever decide to have a family, I wouldn’t be the least bit surprised if, all of a sudden, your brother, SIL and your parents will turn around and simply and coldly expect *you* to do everything yourself in your chosen family dynamic and not offer the same support they asked for helping with Kyle.\n\nIf you keep your boundaries strong, you’ll have less and less of this BS to deal with and you’re just finding out about it now. Just keep your anger directed at the adults in the room and never the kids themselves. Like other people have mentioned, Kyle’s probably really confused and angry himself at changes he didn’t ask for and wants things to go back the way they were, but he simply can’t express it in a level-headed way or with the best words yet…cause he’s 4. Keep that in mind and treat Kyle with kindness and understanding, because the way adults treat him now will have huge impact on how he’ll handle emotions and situations the more he goes up.\n\nBest of luck to you OP!", "Being in a similar situation myself regarding favoritism and expectations of me because I'm the youngest of my brothers  (my mom literally agreed with me when I said to her \"it seems you think I'm less important because I'm the youngest\" and she said \"that's how it's supposed to be\"), I wholly encourage you to go no contact. Time away from them, even though I felt really fucking guilty at first about it, helped me see two things with much more clarity: a) they treated me like shit, and b) I feel, after some good therapy sessions to sort through that guilt, much happier about myself and my choices...MY choices. \n\nGood for you for holding that boundary. It will be tough, they will likely be relentless about it for a long time, but hold fast. Have fun with your gf on your trip!", "Wait wait wait. \n\nThey expected you to pay for daycare?\n\nNope.  \n\nIt hurts to know where you stand with family.  Don’t give them money.  Don’t engage.  Use that money to travel.", "Take care of yourself and good luck. This may not be quite over yet so be vigilant of any changes to things in your life.\n\nPlease do update when things has settled.", "This is the worst update I've ever read. I'm so sorry your family is so toxic. How the hell is anyone THAT entitled... they are the villains in any nerd movie ever. Yikers. Have fun on your trips with your girlfriend with all that freedom you have now.", "My heart is broken for you. I’m so sorry they’ve all been treating you this way.", "Cue the flash forward when all of Kyle’s teachers are discussing concerns about his behaviors with Emma and Luke and their only response is “bUt hE nEvErRrR aCtSs LiIiIke tHaT aT hOmEeEe”", "I'm sorry, OP, but you did the only thing you could. It's so amazing that they were shocked that you had not signed up to be an indentured servant for life", "I would get cameras at your house or move an get a new number.", "NTA  I'm glad that you have started to see your relationship with your family in clearer terms.  This epiphany will help you be stronger with your family.  The SIL, though, seems to be the greatest problem.  Permission to treat you like a servant is one thing, but her demands for you to finance their obligations is another thing entirely.  I bet they have successfully pressured everybody to give them money to fund their lifestyle.  None of this is your issue.  She is trying to push you into an argument that she can use to paint you as a bad person.  You did good not to allow her to press your buttons.\n\nEnjoy this part of your life.  Look at them from afar.  No money.  No childcare. No to the next thing.  You are not an extension of their family.  Shut down any future discussions that are about your supposed obligation to do anything.  If anyone brings it up, say \"I am not going to discuss this.\"  If they persist - walk away.", "My favorite part in all of this is that brother and SIL are presumably still planning to have another child, when they clearly can’t / don’t want to take care of the one they already have.\n\nHonestly I feel bad for both OP and the kid. At least OP can move on with his life, that kid is stuck with entitled and shitty parents.", "What I don't get is why his brother would switch to a lower paid career when he has a family", "Don’t you know it’s much easier for young people to take care of children, and anyone without children has nothing better to do than help parents take care of theirs. /s", "Well they don't need to either really. It's up parents to plan for childcare. Why OPs brother would take a job that pays less and has shitty benefits is beyond me.....", "This and before you go make sure you have a ring doorbell to document if they try to drop your nephew off while you aren’t home and try to blame you somehow for abandoning him.", "INFO: Does someone have Jeff Bezos’ phone number so that I can call him and tell him that the least he can do is pay some of my household expenses because he has the money to, you know, be Jeff Bezos?  Or do I have to be somehow related to him first before I can do that?", ">the least I could do is pay for his daycare and help with some of our other expenses\n\nfor 10% monthly interest rate, why not? ;)", "She is so jealous of your GF and not being in her situation ;)", "He needs to go NC. He is still to soft for that. Give him time. He needs to suffer a little more for that.", "Actually, this would be a good explanation as to why Kyle's behavior changed recently. Maybe he was told there's another baby on the way and he felt he was gonna be replaced?", "No need to lie. Doorbell  camera  , Don't open  the Door and  call the police  if they leave the nephew at the door anyway.   After a couple  of times  when cps is involved  they'll  stop or cps will remove the child from the parents.", "With as unhinged as his family is, I see them possibly doing drive bys to make sure the lights aren't on, no sound is made, & nobody answers the door. If I were OP, I'd look for a new flat to live in & not tell them where/when I moved.", "I cannot understand why the SIL wanted OP to pay for her kid's child care. Like in what universe does she have the right to ask?", "Uncles and aunts  ,basically  no one besides the parents  aren't  supposed  to subsidise  children.  It is a generous  gift if they alone choose to help but aren't  obligated  in any way shape or form.", "Seriously this. Plaster their feeds with photos of you and your gf having a well-deserved blast. Your family can either be happy for you like normal people or they can kick rocks.", "They need to realize  op is a person  and not their indebted slave/servant  before ever getting  to op having a life of his own.  So the answer is no they don't.  Unfortunately.  Massive  ah everyone  except op +gf.", "Found the SIL 👆", "Because OP is the scapegoat and B is the golden child.  It's typical in an abusive/ manipulative family.  \n\nThe scapegoat gets blamed, but the scapegoat also gets loads of responsibility dropped on them.  It goes together, so that when things go wrong, the scapegoat gets blamed.", "Some people with kids feeling entitled to time/money from their friends and family members without kids is a thing.", "And brother changed careers where he makes less money.  I understand the desire/need to be satisfied in your career but if you have responsibilities like raising a child you have to make sacrifices to ensure your family is financially stable", "Because he wants to pursue his dreams, but not take any responsibility or making any extra effort for it.", "I would suspect he was let go and he's making it sound like his idea. Either that or he's moved to a job with better long term prospects.", "[removed]", "I doubt it was by choice.", "I don’t get why anyone would believe this ridiculous story.", "You have to wonder if brother and SIL moved closer to OP deliberately....\n\nIn any event, OP needs to not be at his house the next time SIL tries to drop off demon child.  Maybe WFH from a different location for a week or two.  Otherwise I guarantee you that SIL is going to be trying to drop off the kid again and leaving the kid on his front doorstep.", "It is amazing how grandkids are such a motivating factor for time, attention, and resources. As the childless one in my family, I try to tell myself it must be part biological imperative (continuation of the line), but it still hurts to constantly be brushed aside for my child-having siblings.", "Cause op wouldn't  see 1 cent back EVER  .", "And signed documents, vetted by a lawyer.", "Money. Brother took a lower paying job", "And even more, they think the scapegoat doesn't deserve good things, like money in this case. She doesn't deserve to be able to go on trips, so she should give money to her sibling because he deserves it more.\n\nSo freaking weird.", "This is why i always made sure to be busy or at least have the appearance of always having stuff to do. \n\n'Can you watch Johhny?'\n\n\"Nope, sorry, gotta drop off these self-sealing stembolts before the flux capacitor runs out of unobtanium.\"", "I bet he changed the career counting on OP free babysitting", "That was really the first wave of bs like, what married father decided that taking a job for LESS money for MORE hours was any kind of good idea?", "Pursue his dreams and shove his responsibilities to his brother. Got it!", "You'd think if it had better long term prospects OP would've mentioned it was lower pay short term but would pay off later.\n\nDad's cousin had an offer like that; he took an assembly line job and had a degree, later was offered a job in the office that meant a pay cut now but in a couple years would make much more and wouldn't take the paycut", "Right? It kills me that both his parents and brothers in laws encouraged them to rely on him for childcare", "Then OP shouldn't present it that way", "People are ridiculous though. My sister, as an adult over 50, told her friend how I abused her. She really thought that not giving her my money that I worked for was abuse! She didn't want to bother working. Fortunately her friend is sensible and told her it isn't abuse and I have no obligation to give her money", "Having been in the OP's situation AND seen others behave this way, I think he's probably telling the truth. I had to work my way through college and take a full time course load, and my siblings thought nothing of shoving their kids in the door and leaving. I can't tell you how many times I worked, came home, did homework or worked on a term paper, and was woken by a repeated doorbell, phone ringing, and loud banging, so I could open the door and let their kids in while they ran off, not even asking if my mother was there to care for them while I, you know, went to school. I could have called CPS, but then my mother would have kicked me out. I had one time I was up until about 4:00 a.m. working on school stuff, left a note on my door saying I was up with school work and please don't wake me, only to have my nieces and nephews banging on my door, laughing about the note. My sister's response? \"Well, you should have done your school work during normal hours.\" Yeah, I couldn't I had too many children in the house that weren't mine.", "No.  \n\nHe cannot allow them to drive him out of *his* home.  If they try to drop kid, he needs to call the police for them trying to abandon that child.", "This so much. Hurts that my family always gave all their time money and resources to the siblings with children. Hope to get the exact same treatment once we have a family, though!", ">like the idea of kids and the look of having a family\n\nI think definitely this because they said they are thinking of having \"a daughter\" not \"another baby\". That's a big red flag for me that they are thinking of the image and not the reality of raising another person. Do they understand they don't even get to pick the sex, let alone the gender? That's not how it works.", "I have family like this. Had a kid because all their friends were married and had kids. Kiddo is messed up as is every woman/kid that has come into the one parent’s life. Beyond tragic, and not everyone is cut out to be parents and should not have kids.", "The first time I read this I saw the last words as 'parents + chicken'. \n\nI also completely agree about optional chicken.", "Okay. I'm sorry if your needs were unmet by a stranger's synopsis of a conflict in their life.", "Brother may have presented it to OP  that way and may be hiding the truth.", "This is the correct course of action.", "Yes! I was thinking the same thing. That’s why I asked if she was already pregnant because it’s not like picking out a puppy.", "I've had the same mindset since I was 17yo; I never plan on having kids & I will do everything I can to prevent getting pregnant. Some of my in-laws were not fond of my answer but it has not changed once in 18 years. Not everyone changes their mind; some people just know they don't want kids from a very early age."]}