{"id": 1027, "submission_id": "yl11zn", "title": "AITA: For telling my close family and friends about my sister robbing me?", "selftext": "Throwaway account for reasons of not being found. But I would like some sanity check and opinion if I did anything wrong.  \n\n\nSo a couple of months ago, my sister (34) decided to sell some of my prized possession (VR kit and Board games ) from the attic. I stored them whilst she was living with us and going through the housing process and once they were done, I would just take them out and start using them.\n\nHowever, a couple months ago, whilst getting something from the attic, I noticed that my VR kit and some board games were missing. So i decided to investigate and found out that she had sold it. When confronted about it, she said \"So what?\" and \"You know what you done\". She did not explain further as i was pissed and my parents intervened whilst her kid was down stairs. From then, I have not spoken to her and locked my possession and setup cameras. My parents gave her talking to not do it again.\n\nFast forward to her moving out, I recheck my stuff if they are still there and low and behold, they have vanished. I was angry so I decided to post it on social media to my close friends and family and basically outing her as a shitty person. My mum said I shouldn't have and that it should be kept within the family (Not my other family) and she would get \"better\" over time.\n\nI'm not bothered by the possessions but the principle is there. You don't steal off family members. I feel angry and hurt it happened again and my parents telling me to not tell anyone. \n\nAITA for outing their shitty behaviour on social media? This person is beyond reasoning so talking is not an option.", "created_utc": 1667477356, "permalink": "/r/AmItheAsshole/comments/yl11zn/aita_for_telling_my_close_family_and_friends/", "score": 1959, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I posted a personal family problem to other friends and family when I shouldn't have as it should be kept within the family. My parents said I shouldnt have posted and let everything know about personal family problems.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA your parents are enabling her by not calling out the behavior.", "NTA.  \"Keeping it in the family\" didn't work the first time.  So your anger is more than justified.", "NTA, but if you wanna be petty, file a police report lol", "NTA file a police report or threaten to. She is old enough to know better. \nINFO: How did she get to them if they were locked away with cameras around?", "You could tell your mom that you could have reported your sister to the police and that the amount would have possibly been a felony. This was the lesser of the two and having been outed is better than being arrested.\n\nNTA", "NTA\n\n&#x200B;\n\nTell your sister AND your mom this: Either you get the money  (from her or from sister, does not matter) to replace the stolen things within two weeks, or you will make a police report and go after her for her theft.\n\n&#x200B;\n\nDo you have her on camera taking the stuff? That will make it even easier.\n\n&#x200B;\n\nIf your mom wants to keep the lid on it, SHE can repay you.\n\n&#x200B;\n\n&#x200B;\n\nAnd go no contact woth your sister. IF anybody asks, jsut tell them the truth: She is a thief, an stole from you.", "As much as I HATE people posting all their family drama online because that’s almost never helpful and kind of immature, I think you were pretty justified here so I’ll make an exception and say NTA\n\nBut I’d call the police too. She is clearly not going to learn anytime soon.", "Nta. Call her out as loudly and publicly as you can. I'd gather the evidence ( any texts or sm messages and u said u have cameras) and file a police report to AND demand either return of items or reimbursement. The shittiest part of this isn't even just the theft or the parents enabling...it that the thief is raising a child who will learn its okay to steal even from family and actions have no real consequences", "NTA\n\nShe should be old enough to know not to steal. Maybe some jail time will set her straight.", "If you have proof, file a police report.  This is theft.\n\nNTA", "NTA. IF she will rob her own family she will for sure steal from anyone else. Might she get \"better\"? Sure, but not until she gets called out on shit and decides she wants to get better. Sounds like your parents are worried about the optics with your thief sister and not her actually being a thief.", "NTA", "NTA. She's just experiencing the consequences of her own actions. It sounds like she needed to be taught that lesson anyway.", "Funny how mom has an opinion about what you should and shouldn't do to family NTA just be very sure about how you want this to play out", "NTA. If she steals from family, she'll steal from other people. You're just giving people a heads up.", "NTA. Your parents are spineless. Your sister will not change if she keeps getting away with whatever she wants to do.", "She is 34, she is not getting better over time.", "Report her to the police", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway account for reasons of not being found. But I would like some sanity check and opinion if I did anything wrong.  \n\n\nSo a couple of months ago, my sister (34) decided to sell some of my prized possession (VR kit and Board games ) from the attic. I stored them whilst she was living with us and going through the housing process and once they were done, I would just take them out and start using them.\n\nHowever, a couple months ago, whilst getting something from the attic, I noticed that my VR kit and some board games were missing. So i decided to investigate and found out that she had sold it. When confronted about it, she said \"So what?\" and \"You know what you done\". She did not explain further as i was pissed and my parents intervened whilst her kid was down stairs. From then, I have not spoken to her and locked my possession and setup cameras. My parents gave her talking to not do it again.\n\nFast forward to her moving out, I recheck my stuff if they are still there and low and behold, they have vanished. I was angry so I decided to post it on social media to my close friends and family and basically outing her as a shitty person. My mum said I shouldn't have and that it should be kept within the family (Not my other family) and she would get \"better\" over time.\n\nI'm not bothered by the possessions but the principle is there. You don't steal off family members. I feel angry and hurt it happened again and my parents telling me to not tell anyone. \n\nAITA for outing their shitty behaviour on social media? This person is beyond reasoning so talking is not an option.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\nMaybe having her behavior outed will get her to think twice before doing it again.", "NTA \n\nShes 34, not 4. She is a thief and people need to know she's not to be trusted.", "NTA for outing and shaming a rat thief. I would have stolen stolen from her until I was made whole. Now your friends and family know your sister is not someone who can be trusted in their homes. Your parents are delusional if they think she will get better with time. She is in her mid 30s and parents are covering up her shitty behavior. They are enabling her bad behavior.", "When my brother robbed me I called the police.\n\nDon‘t allow thieves to prosper. “Because faaaamily” is not a legitimate excuse to enable shitty behaviour.\n\nNTA but your family are.", "NTA, given there didn't seem to be any actual consequences, repayments for the goods, the fact she did it again, sister thought she could just get away with it.", "Nta if she didn't want people to be told that she stole from you, then she shouldn't have stolen from you.", "God please report your sister, especially if you caught her on camera. What a shitty person, your parents are fools to let her get off so easily. NTA, your sister is though", "NTA and yes, press charges. Theft is Theft", "> You don't steal off family members.\n\nYou shouldn't but more often than not this is the easiet target because they can be manipulated into 'forgiveness' and be stolen from over and over. NTA", "NTA. Your parents are only saying that cause it’s your stuff she is stealing wait till the little thief goes after their stuff next. I would call the police and file a report and make sure everyone knows she is a thief too and can’t be trusted.", "NTA \n\nYour sister is 34. This is exactly who she is as a person, and honestly, people ought to know she's a thief in order to watch their own belongings.", "NTA hw much more time does she need? she's 34. this is what you call really lazy parenting", "NTA", "NTA \n\nGet her arrested for theft, I bet she'll learn then and if not then at least she's aware that if she tries to steal from you again she WILL be charged. Y'all need to stop letting people walk all over you BeCaUsE ThEy ArE FaMiLy", "NTA\n\nWell.\n\nYour parents have a favorite. \n\nYour sister has done something shitty to you TWICE, “keep it in the family” is about choosing to protect her over you being wronged by her.\n\nI also wonder if there are addiction issues here. \n\nMaybe she will get better - that doesn’t mean you owe her silence over what she’s done to you.", "NTA file that police report and bask in the petty.", "Nta. Poilce time.", "Unpopular opinion, but a very soft ESH.\n\nIt’s obvious why your parents and sister are wrong, I won’t go into that.\n\nThat said, you’re a bit of an asshole to yourself and your followers for posting it on social media. To you, it feels like enforcing consequences, but to the people seeing your post, it looks immature, petty, and possibly even a little toxic. People have a sort of unspoken consent process in their interactions; we start with small talk, and if both parties engage, that’s consenting to the small talk; someone then ventures to a slightly more personal topic, and if the other reciprocates, that’s consent to the slightly more intimate level of conversation — and so on and so forth. It’s why we feel awkward or uncomfortable seeing highly-personal posts on social media, or when a stranger approaches us to launch into a story of all their traumas; we haven’t consented to that intimate an exchange, so our boundaries feel violated. Those boundaries *should* be knocked down for some topics (it’s valuable to introduce discomfort if it’s addressing racism, ableism, homophobia, etc), but when it’s done to share family drama, it just looks unhealthy. It may get you a couple people validating your feelings, but it leads even more people to question your sense of boundaries.\n\nNext time, choose consequences that actually address the behavior — eg, a police report or small claims court. Don’t rely on people on social media to create the consequences (shaming) for you.", "NAH. You state that you are not bothered by the possessions, but then feel anger when the possessions are gone? What has been gained by \"outing\" you sister other than drama? I think you would feel better if you lived your life with a generous heart and wrapped your family in a blanket of love.", "INFO\nWhat did she mean by \"you know what you've done\"?\n\nDid she take and sell your things because you broke her items or caused similar property damage/loss?\n\nIt's bizarre to me that you waited two months without ever finding out why she did what she did to then tell everyone about her offense against you while still withholding the context you say exists.", "One does not “get better over time” if the behavior is never acknowledged or corrected. Name and shame her OP.", "Yeah, \"keep it in the family\" only works if the family gets off their ass and does something about it", "I dont think its petty to file a police report at all. Theft is theft. But OP might need to be prepared to move   out if the parents push back and retaliate to protect the sister", "I only got cameras to my pc area and my bedroom. I should have brought the stuff down from the attic into my room, but sadly I cannot store everything in there!", "God please report your sister, especially if you caught her on camera.", "I mean, eventually she'll be dead and stop stealing", "Op doesn't have a blanket. Sister stole it from the attic", "Didnt say small claims since vr headsets can go for quite a high pricez but op doesnt seem the nuclear option type", " Sure, but not until she gets called out on shit and decides she wants to get better.", "Then you retaliate and tell everyone that your parents are supporting a thief and kicked out the victim", "Still NTA hope you get some resolution", "Sometimes going nuclear is the only way to get thru to people.", "Nope. Nta. Be good or be good at it. She's neither so...", "NTA at all for what you did as far as outing them. Why in the world you didnt lock your stuff up so it couldnt be stolen is my question.", "NTA you should’ve filed a police report immediately. Your parents are always going to enable her behavior. You should report her for everything she has stolen from you and press charges. She is never going to change and never learn unless she’s held accountable and people stop enabling her. Keep calling it out and let everyone know the type of person she really is and tell your parents that you will continue to do that and everyone will know that they do nothing to stop their daughter from stealing from their own son", "If you embellished nothing, NTA. What other recourse were you given? Now you are being chastised for your honesty? If our actions shame us, it's time to modify our behaviour, not silence people.", "if a 34yo does not know stealing is wrong, it's not getting any better", "NTA", "NTA I wouldn't be outing her to social media I would be outing her to the police and suing her fir the value of the items.", "Of anyone sold my boardgames I would be violent. NTA", "NTA press charges too.\n\nIdk why people think you're supposed to allow \"family\" to mistreat you and be okay with it.", "NTA. Why don't you take the camera footage and go to the police?", "NTA. Your sister did learn a lesson about stealing from you: it is just fine and there will be no repercussions. If you feel that this is not the right lesson then it is up to you to do something about it. It is not unreasonable to warn others about her behavior. She is a thief, end of story.", "NTA. You'll notice that \"how can you do that to family?\" never applies to her robbing you.", "NTA know what would help her get better faster? Jail\n\nYou should never cut your family slack on stuff like this they should be the closest people in your life and should know how much you care for your possessions", "NTA, people need to be warned there's a thief in their circle. If she'll steal from family, she'll steal from literally anyone.", "NTA. Your sister is a thief. She is not going to get better over time. Your mother enables her shitty behavior which is part of the reason she is still a shitty person. Warning other people she's a thief is doing your friends and family a service so she can't steal from them too.", "NTA", "NTA.  You simply updated everyone on one of her latest escapes.  Your parents are silly to think a 34 yo juvenile who is going to grow out of her bad habits.\n\nOh, I liked the earlier comment of \"If she will rob her own family she will for sure steal from anyone else\", so in a sense this was a Public Service Announcement warning others about your sister.", "NTA. She should have to replace them as they were not hers to sell", "A year from now she will expect you to trust her around your things because all that happened in the past.", "I would say let everyone know. Never hide a theif. Your sister is an the asshole. Not you.", "Nta", "Report the thefts to the police.\n\nOr she'll keep doing it.\n\nNTA.", "NTA - she needs to be called out.", "NTA And does she have any easy accessed valuables that are worth the same as what she took from you?", "NTA. Out her to anyone who will listen. Thieves deserve a destroyed reputation.", "NTA. Im not sure which VR you had but those can get expensive. Im also a big board game person so I know those can get pricey.", "NTA- You kept it \"within the family\" once already and she still robbed you. File a police report and don't drop the charges until you get paid.\n\n\nPs- Your sister might have a substance abuse problem.", "She is 34ffs, people like this does not get better over time, specially with enablers \n\nNta", "NTA. Your sister is a thief, your parents enable her and don’t seem to care that she is a thief, and your family should know (she will probably steal or has  already stolen from them too)", "I am on the fence about your being an a-hole; I think posted it to SM was an a-hole move and probably did not help the situation nor gave your any \"sympathy points\".  Your sister sounds like a real immature, entitled, pretentious jerk and the fact your parents had to \"give her a talking to, to not do it again\" sounds very weird!  Instead of spreading this story, I would have made a police report, even if you didn't plan on pressing charges, you want this documented for the future, because trust me, unless she gets help, this behavior will not change!!", "OP, so I don't think you're going far enough. I'd tell your parents and sister that either she gets the stuff back or gives you the value of it, or you'll be filing a police report. At least if you file a report, they should be able to get the stuff back from pawn shops, if that's where she went.", "OP’s possessions are what should be kept in the family.", " I would call the police and file a report and make sure everyone knows she is a thief too and can’t be trusted.", "No, nope. \n\nOPs Sister is enormous AH for stealing OPs belongings.\n\nTheir parents are also assholes for enabling their daughters behavior.", "She deserved it as she stole multiple things from OP. \n\nOP is NTA.", "Especially when it’s a 34 year old", "File a police report", "I’m saying I don’t think it negatively impacts sister, but makes everyone else uncomfortable and leads people to have a more negative perception of OP.", "Or it makes everyone aware that OPs sister can steal from them.", "[removed]", "Bot comment, downvote and report for spam", "NTA, but you kind of look like one.  I mean, she definitely did you wrong, but what did you hope to accomplish by outing her so broadly, revenge? Definitely not the high road.", "NTA!! She stole from you and you’re parents are enabling her. She’s 34 years old, she isn’t “going to get better with time” how ridiculous your parents sound! They made because your posts makes them look like shitty parents, which I think they deserve! I’d tell her she has a week to get your belongings back or your filing a police report!", "INFO Why did you call the police?", "NTA. Seems to be she is getting off easy if the worst consequence she is experiencing is getting outted for being a shitty person on social media. She is lucky you didn't press charges and give them something to really worry about.", "NTA and good for you for outing the thieving lying AH.", "NTA. She decided to steal from you, she needs to face some consequences.", "NTA, your sister and your mum both suck. Why should the victim have to protect the people stealing from them, hurting them or abusing them?  That’s total BS and an attitude left over from our grandparent’s time. \n\nAbusers and their enablers teach their victims (usually children) to keep their secrets, to be quiet, not to say anything so that other people won’t know. \n\nNo more secrets!  Tell everyone.  The shame doesn’t belong to the victim.", "NTA", "NTA", "Nope!", "NTA. She's a grown woman, not a 6 year old who'll grow out of it.", "This type of parenting is why I have an aunt who is in jail often in her sixties. It never gets better with time, especially when they are enabled. You are NTA", "NTA. Good grief.", "NTA.  Keeping it in the family would only work if the family wasn't encouraging her.", "NTA, so what’s your sister’s favourite drug? Cause that’s what’s happening.", ">she said \"So what?\" and \"You know what you done\"\n\nINFO: What's this all about? Is this kind of behaviour new?", "Agreed. She probably also on drugs why she stole to get money. I wouldn't be surprised if the parents know and why they said she will get better overtime", "Get better sounds like they know she stole the stuff to get money for drugs.  That phrase only makes since to say in that situation.", "I think they were the ones who said that.", "A lot has been gained, namely the knowledge that OP’s sister is a thief and that they shouldn’t be trusted", "Better yet, call the police on her for theft.  It doesn’t matter how much she stole, she needs to go to jail.", "It's bizarre to me that you waited two months without ever finding out why she did what she did to then tell everyone about her offense against you while still withholding the context you say exists", "> or gives you the value of it\n\nNo. Replacement value of comparable quality", "File a police report. I guarantee she on drugs and your parents know hint why they say she will get better. She needs help and honestly shouldn't have her kids with her if she is so on drugs she had to repeatedly steal for money. They are not safe with her.", "This right here call the police she stole and sold your stuff and your parents are not doing shit to stop it sis’s stealing needs to stoped.", "NTA. She played a stupid game and won a stupid prize.", "NTA.", "NTA. But this isn’t a robbery, just straight-up theft.", "if you have the footage of her taking your stuff,  you should go to the police instead of making a post on social media \n\nNTA", "You're a better person than I am, because I would have gone to the police the first time.\n\nNTA", "NTA and you need to file a theft complaint.", "Dear OP, I am so sorry that you beloved possessions were taken and sold by her while you were not looking. To me, this is downright theft \n\nOP, you are NTA naming and shaming her for the thief she is. Don't let anyone tell you otherwise. Secondly, you are not airing 'dirty laundry' (also known as family secrets/shame) but you are outing her bad behaviour. \n\nHere is why I believe you are NTA and you done right:\n\n1. You are not just airing a grievance but you are exposing a thief\n2. You are sending a warning to others that if she done that to you before, she will do it again to others and that make people on your social media more wary if she visits their homes. I would not want her at my place either fearing what she might steal from me\n\nYour parents are in denial and are enabling her thieving ways rather than sort her out. If I am one of your cousins whose precious items are stolen by her, I would gladly report your sister and sue the pants off her", "ESH - what did you hope to accomplish by posting on social media?  If you had filed a police report and were asking if YWTA, I'd say YWNBTA.  Im sorry your sister is a thief - use this info to protect yourself in future interactions with her.", "NTA\n\nDid you file a police report?  If not, you need to.  Your sister is a thief.", "Call the policeeee", "OP outing the thief in a way is warning others to be wary of her", "It’s not the possessions it’s the behavior, op confronted their parents and they did not do anything. If the sister had stoped their than OP probably would not have been bothered. Since she continued OP was well within their rights to call her out. They could have gone further and filed a police report.", "NTA. Your parents and sister are. I’m sorry you’re going through something like that, that’s no way to live. Tell them you’ll do whatever it takes to defend yourself from an adult 34 yo who knows that stealing is not only not acceptable but a legal offence (it’s no longer a child who might be doing something without realising the moral issue). Say you’re sorry they’re uncomfortable, but you’re taking the best steps for your well-being. Mention that you’re willing to report this or next instance to the authorities if they don’t offer a solution -including compensation for your lost items. And mean it. Make it vs an unknown person, if you need to. \n\n\n\nYour parents are most likely in denial. With these people, btw, be ready for a ton of gaslighting. It’s never their fault, but yours, according to them. Oh, and it doesn’t get any better: it can get pretty worse.", "Yes, we need to warn them.", "Plus the sister has children who will model and mimic her behavior, i.e., raising another generation of entitled thieves", "That or a psychiatric issue like ASPD. I’m wondering if OP’s sister was always like that or if it’s a recent issue. In case it’s consistent, OP needs to protect herself.", "Would you want to invite a thief like her over for a visit and she steals from you when your back is turned while popping the kettle on the stove to make tea? Absolutely not. But if she is my guest who is caught red handed trying to steal my stuff, all hell will break loose coming from me", "She should be old enough to know not to steal. Maybe some jail time will set her straight.", "Yes, we shouldn’t let them get away with it.", "Mind you it will not be just all hell breaking loose if I catch a thief in the act trying to take my things. That thief will be taken to the police", "You don't steal period, family or not!  NTA", "Nta\n\nShe is and your parents are for not calling her on it.", "NTA\n\nYou have every right to tell whoever you want. She's lucky you didn't go to the police. She won't magically start to treat people better, she's only going to get worse as long as she faces no consequences for her actions.\n\nYou had done her a great kindness and she repayed you by stealing from you. Don't do a ything else for her and is she co.plains or asks why. Just tell her, every time you try to help her she repays you by stealing fron you.  You don't have to put up with that.", "NTA. On principle, keeping it within the family would’ve been a really good idea. But it seems your parents idea of keeping it within the family was to excuse her behavior and ignore it. We’re all responsible for our own behavior whether it’s positive or negative. Your parents enabling her make them just as guilty.", "You don't steal off anyone.. period!!! NTA", "A 34YO is going to get better over time? I'm not sure why your parents think their grown-ass daughter's character flaw is going to get better over time?", "You said \"You don't steal off family members.\" How about \"You dont Steal.\" Seriously, the fact that she iis a relative has no bearing here. She committed a crime. Maybe I just see stuff differently but if you dont care about me enough that you would steal from me, then I dont need to consider you family and I do not need to go easy on you.  \n\n\nNTA but you need to either do something or you are complicit and she will be stealing from others as Im sure she already has been.", "Your sister and your mom are both assholes. NTA. Wonder how your mom would act if her shit got stolen by the sister. I bet she would not keep it \"within the family\".", "NTA\n\n“Should be kept within the family” is how abusers are protected within the family to “keep the peace”", "Social media solves nothing. Call the police or tell your family directly. ESH: her for stealing, you for not solving problems like an adult.", "Your parents gave her a talking to and said she will get better in time? She's 34!!! That's who she is! She's all done! They already failed parenting her!\n\nNTA. Your sister is a thief and I would have filed a police report on her if the value was high enough. Also, she deserves being shamed for sure.\nSet of AH #2 are your parents for raising said thief.", "NTA. Your sister didn't keep your stuff in the family so you have no obligation to keep what she did with your stuff in the family.", "NTA.\n\nYour family needs to know she is a thief.", "When I was in therapy,  I had family crawling out of the woodwork, telling me that I had better not \"air the family's dirty laundry \". I told them that if you don't want it getting out that you do terrible things, then you shouldn't do terrible things.\n\nThis is why most of them pretend I'm dead now, but I have no regrets.\n\nSister did terrible things and now everyone knows. She's only got herself to blame.\n\nNTA", "File a police report.", "WTH did I just read your sister committed criminal acts and instead of calling the police and filing a report when you have proof you post on social media?! So you are also enabling her behaviors by ensuring she does not get real world consequences, your TA to yourself", "NTA", "NTA. If she is a thief, others she might also take advantage of, as she did you, need to be warned about her. Think of what you posted as a public service announcement.", "NTA. Keeping this kind of bad behavior \"in house\" so to speak is how it gets perpetuated further.", "Nta she is a 34 yr old mother, she needs to act like it. Does she have an addiction or something?", "NTA - It's simple, really.  If you have proof, take her to small claims.  That will help speed up the \"better over time\" BS.", ">You don't steal off family members.\n\nBut everyone else is fair game?", "NTA - she should consider herself lucky you didn't call the cops for theft of property.  Your parents aren't helping her by covering up.", "NTA, forget family you do not steal in general. She is a thief, if you have video proof you should demand the stuff back or get the authorities involved. She is a mother with a child, she isn't some kid, how much better will it get over time.", "NTA.  If she doesn't want to be called out on her horrible behavior, she shouldn't have done what she did in the first place.", "NTA your parents are defending her selfish and AH behaviour, she is stealing from you and you did the right thing saying to everybody how she is", "NTA. Your sister will NOT get better over time if she's being enabled and not held accountable for her behavior. Take it from me, as my wife and I were terrorized by their awful sister who was enabled by the rest of that family. It didn't stop til we went NC", "Not the asshole if she plays stupid games she wins stupid prizes. She deserves to be called out for horrible things that she did to you.\nMy better she's a tweaker probably mess or some other drug is she trying to get money to buy that shit just dump them say goodbye", "NTA\n\n>and she would get \"better\" over time.\n\nYou said she was 34...she is already set in her ways and the enabling nature of your parents will not help her become anything more than she is....a thief.", "NTA. Shady people don't like the light.", "NTA If she doesn't see any wrong in her actions why should it bother her to have her actions known? Your parents obviously don't think it is a big deal so steal from you either. Consider it a Public Service Announcement so that others can protect their stuff when your sister is around. I see no problem with publicly shaming people, especially when that is the only consequence they have.", "I don't think there's anything wrong with being honest. If she didn't want people to know she was a thief, then she shouldn't have stolen from you. If your mom didn't want to be embarrassed by other people knowing she raised a thief, then she would have nipped it in the bud and stopped supporting her as soon as she found out. And I highly doubt that this incident was when she found out.\n\nThis whole \"keep it in the family\" thing is ridiculous. You ever notice how people only say it about toxic stuff? \n\nI've done a lot of that myself in my childhood and that mentality is how things like abuse gets swept under the rug and ignored.\n\nNTA", "NTA she’s lucky you didn’t press charges. But why did you let her stay with you after she robbed you the first time?", "NTA, I would literally go into her wallet and start swiping cash until you are made whole. She is a thief and deserves no extra consideration.", "NTA - others need to be made aware in case she was ever in their homes.  Need to know that their possessions are not safe around her.", "Call the cops see if she likes it then.", "NTA. She should be thankful you didn’t press charges.", ">My mum said I shouldn't have and that it should be kept within the   \nfamily (Not my other family) and she would get \"better\" over time\n\nHighly doubt mum would be this nonchalant if it was HER sister was stealing from", "NTA", "Call the police?\n\nNTA", "NTA She's 34. How much time do they expect you to give? Don't let her in your house again. Clearly, she can't be trusted.", "NTA, your sister is a thief and deserves to be humiliated.", "OP should have done that in the first place, and it's not petty.", "Just your mom really.", "My older brother stole from family a lot and pawned things that were expensive, like consoles, guitars, expensive speakers. A lot of these things were gifts because we aren’t well off by any means. But he stole anything we had really. My dad kept kicking him out but letting him come back because he had nowhere to go and my brother ended up in jail a few times, first because he robbed someone and got caught, then because he broke the rules of his probation. It’s been a few years since he last got out but he is genuinely a much better person. But it took him being kicked out of my dad’s house multiple times and going to jail multiple times for him to get a hold of himself and grow up. OPs sister is going to keep doing this shit until everyone is calling her out for her BS and she has no choice but to grow up.", ">When confronted about it, she said \"So what?\" and \"You know what you done\".", "Umm, maybe you shouldn’t put some things in writing.", "Will do and sorted. Just hate thieves", "She doing drugs?", "NTA\n\nIf they're going to be like that you need to press charges. Your parents are going to keep enabling her.", "NTA but... wtf do you mean you don't steal off family members? You don't fucking steal.", "Nta, but your parents allowed this by not making her replace them and continuing to allow her to steal from you.", "Nta", "NTA... dont hide thieves.  They may go to the next family's house and start selling stuff.", "INFO: What do your parents mean when the say your sister will get better? Is she an addict or something. I’m confused why they are ok with her stealing and selling your property.", "NTA she’s a shitty sister and your parents have her back not yours. I’m sorry you have to deal with that.", "she stole TWICE and expected no repercussions. your parents are enabling this behavior.\nnext time tell her you will charge her with theft.\n\n\nNTA. good for you. \nnow when she visits the relatives they can can be aware she steals.\n\n\nhey.. if she is prepared to steal from you, your relatives might have had stuff stolen by her... (but haven't said anything due to your parents... keep in the family mentality)", "Ask her to give it back via text message. Get her to admit guilt, maybe even record a conversation. Do this swiftly and secretly, disguise is as a peace offering. If you guys can talk things out you'll take down the video. Once you have hard evidence report her to the police and make her pay you back. She isn't your sister, she is a criminal who stole your things twice. She lost the sis privilege the second she did it a second time. That shows she learned nothing. Make her learn the lesson this second time.", "NTA", "Shes 34 not 4 this shit doesn’t get better. Go NC with her and don’t allow her in your house. NTA!", "NTA. \n\nI'd file a police report.", "“You know what you done”\n\nInfo: what did you do? Inquiring minds want to know.\n\nNTA", "#THIS.\n\nThis is the important question.  u/Away-Ad4392, there is very obviously missing information here.  What did you do / what does she think you did?", "Guys, she’s not even 40 yet! Please be fair to the thief, she’s still learning! /s\n\nNTA. File a police report.", "So I read that right? 34? Wow!! Her parents gave her a talking to, she’ll get better overtime, are you sure you meant 34 and not 14 lol. That is just pathetic, NTA OP", "NTA.  If it had been me, I would have called the police and pressed charges.", "NTA- how is she gonna get “better over time” if there are no consequences for her stealing now?", "NTA, stealing is wrong & if she steals from her own sister what Can others expect…", "> she would get “better” over time\n \nYour sister is 34 years old. She’s not going to get better over time until she faces consequences. Outing her behavior is the least you could have done, you could have reported her and pressed charges.", "NTA.\n\nFile a police report", "NTA. If your sister doesn't want people to know that she steals, and that she steals from family, she should stop stealing.", "NTA, your sister is a thief and your parents are her enabler is who are just trying to keep you, her victim silent so she can continue to steal without anyone expecting them to step in and deal with it. \n\nIf she is stealing in their house and they are allowing her to get away with it they should have handled it. You are right, the principle of the matter is important. Your parents are saying it is acceptable for her to steal from you and that's not okay.\n\nBut it sounds like what you really need to do is no longer live with your parents since they have basically given her tacit approval to steal from you and that you as a victim should not speak out, you should just continue to be victimized. Your relationship with them has a fundamental problem, in the problem is them not treating you right.", "NTA\n\nI'm of the mindset that family is not the people we hold to the lowest standard, but rather the higher standard. Not perfection mind you, but if a random mugs you than why would you expect anything of them when they're a complete stranger. Someone you know semi-closely stealing from you? It's a bigger deal.\n\nEnabling family just because they're blood just creates an atmosphere for enmity to fester.", "Nta. You could report her for theft. She can report you for slander. Be careful", "NTA - Been through similar and all I can say is this: Protect Yourself", "NTA.\n\nThis way everyone can watch their personal belongings while she is around. \n\nYour parents should be ashamed of themselves for enabling such behavior.", "Hell no nta press charges", "YAH if you think the rule should be not to steal from family members. It's okay to steal from the rest of us, then? Your mom is scary; it sounds like she brought up a tribe of pickpockets.", "NTA. Your sister's a robber. I would personally report her to the police.", "She stole from you repeatedly, in spite of your telling her not to. You did a public service, so people know not to trust her. She deserves everything she gets, especially given that she’s not a kid.", "NTA", "Do an experiment with your parents. Take something that they value and hid it. Wait a while and then return it to them. See how they react", "Nta, but your sister probably has a drug problem. Your parents are gonna have a bad time if that is the case and they're already covering for her.", "Right?!"]}