{"id": 10285, "submission_id": "115h37i", "title": "AITA For making my mother lose custody of my nephew?", "selftext": "This morning, I (29M) had a rude awakening by my mother (61F) pounding on my bedroom's door telling me to \"get up\". Got up, went to the kitchen and she told me to sit down, and then she explained how just 15 minutes ago she was visited by 2 police officers and 2 agents from CPS to take my nephew (1M) to a municipal shelter. I was already expecting this to happen but figured I would have a few weeks more of lead time.\n\nIn any case, what happens is, my sister (28F) had a son early last year, and since she was admitted to the hospital giving premature birth, had not done any prenatal care whatsoever and was involved in substance abuse, the hospital reported it to CPS, who took her son away to a shelter. I knew this would happen eventually and I knew my mother would step in because \"he's blood and flesh and you don't separate blood and flesh\". However I didn't expect it would go as bad as it did. \n\nFor starters, my sister decided not to name the father in the birth certificate, despite the guy owing up to it. He helped out for a few months and when he saw he was off the hook, he vanished. At the same time, my mother quit her job to look after my nephew, leaving he brunt of the house's expenses with me. She said my sister would be moving in and would be getting a job. She did move in, put 0 effort in getting a job and even less in helping around the house. Bear in mind, this is old style shared living (boarding house), which is much less than ideal but you play the cards you're dealt.\n\nFast forward to April, my mom has been granted custody over my nephew and he is living with us. Fast forward again to November and my mother has another relapse into alcoholism, skips out on 15 days of work and I report it to the CPS agent responsibly for my nephew's case. Come December I am once again with my finances severely strained and just after new years, again my mother decides that \"a little drink couldn't hurt\", and skips on a whole month of work. Again I reported it to CPS.\n\nIt's now early February, somehow my mother hasn't lost her job, and has started (FINALLY!) seeing a psychologist and a psychiatrist, meanwhile we get a court summons to speak to the court's social assistant regarding my nephew, his care and the current living arrangments. I tell the truth about my mother's alcoholism, how I'm worried that properly caring for my nephew is beyond her capabilities (she's 61 years old, smokes, has trouble with alcohol), how I also cannot look after him (I'm almost 30, barely make enough to keep my head out of water) and how my sister is still unfit (hasn't even bothered getting a job and it's not clear wether she's still abusing substances or not).\n\nThe social services person told me it was very likely they would step in and take him back to a shelter and in the long run, he will likely be up for adoption. This morning they came and took my nephew and I've finished burrying whatever relationship I had left with my mother and sister.\n\nSo, AITA?", "created_utc": 1676732175, "permalink": "/r/AmItheAsshole/comments/115h37i/aita_for_making_my_mother_lose_custody_of_my/", "score": 2350, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) Reported my mom's issues with alcohol and what happens in the aftermath of them, on top of the already huge pile of issues that CPS was already aware of.\n\n(2) Destroyed any chances my mother and my sister had of raising my nephew and, likely ever having any relationship with him..\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "**NTA** you’re the only one actually looking out for your nephew. I’m sorry that you’re having to deal with this, but you’ve done the right thing.", "**NTA** Growing up with addicts as parents and guardians is traumatic and increases your chances of having the same experiences. You may have saved your nephew a lifetime of pain, if not his actual life.", "NTA, it’s the best thing for that little boy.  Hopefully he gets adopted by a family that will be able to provide a stable, loving environment for him.", "NTA. His care and well being is far more important than not separating him from his “family”.", "NTA. It's always right to protect a child from harm.", "NTA Absolutely not! The child's welfare needs to come first above all else.", "NTA. You told the truth. I don’t know how things will go, but in my experience as a therapist working with a lot of people that are involved in CPS cases, if you want to get your kid back they will work with you to make a plan to get your kid back. You will have to show and prove with home inspections, drug tests, parenting classes, keeping jobs etc, but if they want it they can do it.", "NTA. You are actually doing what is the best for your nephew in this case. Staying with your mother and sister will only show him substance abuse and can cause him to feel like they don't love him enough to not abuse alcohol or drugs.", "As an adopted person, sometimes it’s genuinely for the best - for everyone.\n\n\nA child is a privilege. Just because the reproductive plumbing works does NOT magically transform you into a fit parent, and the same applies to grandparents. Being blood related actually means jack shit. No one has a god given right to be a parent if they can’t take care of that child. That’s the harsh reality of the world that almost no one wants to think about but it’s true. \n\nSo don’t feel bad (I mean, it’s a crap situation) but I don’t think you did anything wrong. Personally? You should go NC with these people and leave them in your rear view mirror.", "NTA you did what you were supposed to do", "NTA. You did the right thing. Hell, the only thing you could do for the boy !", "NTA ,  I just hope the child finds a loving family", "NTA\n\nI grew up in a terrible home environment. Some of my first memories are praying to get out and be adopted into a nice family. No one did the right thing for me. You did the right thing for your nephew. Don't feel guilty about helping a helpless tiny human. I hope he gets adopted by a loving family and grows up loved and cared for.", "NTA.   \nYou looked out for your nephew. While foster care isn't ideal for the kid, he at least is still young so much more likely to be adopted by a family unable to have a baby of their own. This will allow him to grow up in a house where he is cared for instead of having the constant battle of a mother and grandmother with substance abuse problems.  \nYou can always check in on him when you have the time to do so and make sure that he is in a good place. It is the future of your nephew that you chose to look out for, and rightfully so.", "NTA. you’re never going to be the asshole for shielding a small child from potential abuse and neglect.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis morning, I (29M) had a rude awakening by my mother (61F) pounding on my bedroom's door telling me to \"get up\". Got up, went to the kitchen and she told me to sit down, and then she explained how just 15 minutes ago she was visited by 2 police officers and 2 agents from CPS to take my nephew (1M) to a municipal shelter. I was already expecting this to happen but figured I would have a few weeks more of lead time.\n\nIn any case, what happens is, my sister (28F) had a son early last year, and since she was admitted to the hospital giving premature birth, had not done any prenatal care whatsoever and was involved in substance abuse, the hospital reported it to CPS, who took her son away to a shelter. I knew this would happen eventually and I knew my mother would step in because \"he's blood and flesh and you don't separate blood and flesh\". However I didn't expect it would go as bad as it did. \n\nFor starters, my sister decided not to name the father in the birth certificate, despite the guy owing up to it. He helped out for a few months and when he saw he was off the hook, he vanished. At the same time, my mother quit her job to look after my nephew, leaving he brunt of the house's expenses with me. She said my sister would be moving in and would be getting a job. She did move in, put 0 effort in getting a job and even less in helping around the house. Bear in mind, this is old style shared living (boarding house), which is much less than ideal but you play the cards you're dealt.\n\nFast forward to April, my mom has been granted custody over my nephew and he is living with us. Fast forward again to November and my mother has another relapse into alcoholism, skips out on 15 days of work and I report it to the CPS agent responsibly for my nephew's case. Come December I am once again with my finances severely strained and just after new years, again my mother decides that \"a little drink couldn't hurt\", and skips on a whole month of work. Again I reported it to CPS.\n\nIt's now early February, somehow my mother hasn't lost her job, and has started (FINALLY!) seeing a psychologist and a psychiatrist, meanwhile we get a court summons to speak to the court's social assistant regarding my nephew, his care and the current living arrangments. I tell the truth about my mother's alcoholism, how I'm worried that properly caring for my nephew is beyond her capabilities (she's 61 years old, smokes, has trouble with alcohol), how I also cannot look after him (I'm almost 30, barely make enough to keep my head out of water) and how my sister is still unfit (hasn't even bothered getting a job and it's not clear wether she's still abusing substances or not).\n\nThe social services person told me it was very likely they would step in and take him back to a shelter and in the long run, he will likely be up for adoption. This morning they came and took my nephew and I've finished burrying whatever relationship I had left with my mother and sister.\n\nSo, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  Your family if fucked and is no place for a baby.", ">AITA For making my mother lose custody of my nephew?\n\nYou didn't \"make her lose custody\". You told the truth about what you saw that could endanger your nephew's safety. She made herself lose custody based on her own poor choices. Maybe she will start making better choices so she can stay in his life. \n\nIf I was an adoptive parent, I like to think that as long as the child's relatives didn't endanger his safety, I would let them remain in contact. Maybe your mother will be able to be part of his life but just not his parent as long as she makes an effort to do so. Maybe that won't be possible. All you can do is tell the truth to protect the children who depend on the adults to help them.\n\nNTA", "It's a horrible situation, but you've done the right thing for that little boy, I hope he gets adopted / placed with a loving family who will provide him with everything he needs in life.", "NTA. Your nephew is the important one here. He needs to be properly looked after with stability and proper care. If your family can't provide that, he needs to be with people who can give them that. You need to move out and find somewhere else to live because this sounds pretty toxic.", "NTA, you did what you had to do for your nephew and it seems you were the only one with his best interest at heart. You should however move out as fast as you possibly can, these two women are wearing you down and preventing you from having a 'normal' life. This may sounds harsh, but they are both addicted and that is not your responsibility to handle. They are adults now and they should look after themselves. You could help them get the help they need, but I'm guessing they are not in the mood right now...", "NTA You're doing what you can to help that baby. None of you are in good position to raise him, nor is it your responsibility as his uncle to do so. You did the right thing by being honest. But now do the right thing for you and get yourself out of there because it won't be good going forward.", "You didn't make your mother lose custody of your nephew. She lost it because she was seen as unfit to take care of him by the authorities. What were you supposed to do? Lie in the court?\n\nI really hope the poor kid gets adopted and gets to live a good, happy life with lots of love.", "You lost me at the fact your almost 30 and still live with you mother.... ESH", "But OP, for your own sake, move out, get away from your Mom and sister. They're choosing to drown, don't let them drag you under with them. Go live a decent life of your own.", "This isn't the US, things work differently here. Prior to being release to my mother's custody he spent the better part of a month in a neonatal ICU, then at a municipal shelter.\n\nSince there is no capable and willing guardian to step in at this time to look after them, they are going back to a shelter to receive adequate care until such a time as they either are released back to the care of a capable guardian or are adopted by a suitable family.", "Did you forget that anyone from around the world can post here?? His story does not sound like BS", "In this economy? You must not live in the US. You're extremely lucky if you're NOT living with family or roommates.", "He is currently the only one with an income and paying for everything. How is he the AH?", "I’d argue she is living with him given the fact OP has been financially supporting the household because of his mother’s relapses with alcoholism. \n\n>Living with Mom at almost 30 is just cringeworthy\n\nBeing this reductive and judgemental as an adult is far more cringeworthy mate. Why bother taking a few seconds to consider the complexities of life and the differences in how others choose to live? Clearly your way is the only way /s.", "Lmao. I'm in California which is more expensive than most states and still managed to move out of my parents after high school.  Living with mom at almost 30 is just cringeworthy.", "If you read the post carefully, you'd see the living arrangment was mentioned, but I suppose that's beyond you.", "NTA\n\nPlease get away from your mother and sister before they drag you down further.  You are not responsible for them or their choices.", "Nta you’re the only one doing the right thing for him.", "NTA.  It was the right thing to do.  You did what was best for the baby, now do what’s best for you.  Leave your mother and sister behind and live your own life.  It’s not your responsibility to support these two.", "Do you even have to ask? Sure, you take the hand you're dealt, but sometimes you're forced by realism to admit the hand you were dealt was a shit one and discard hoping to acquire a new better one in the next round. No, I'm not talking something drastic, I'm talking seeking other circumstances and opportunities and not letting \"family\" keep you locked into a vicious cycle of supporting terrible people.\n\nTo answer your question, your sister had a kid and promptly worked to screw the kid over for life, your mother took the kid, and promptly devolved into addiction. Blood and family and all that doesn't make up for the fact that your nephew's life was already starting off at a poor position entirely due to the **choices** of the people raising him. He'll genuinely be better placed with an adoptive family.\n\nNTA", "NTA You may want to see about some therapy for yourself for abuse since you were raised by your mother. You may then be able to look for training or schooling to improve your job prospects. You did the right thing for your nephew and you are a good person. Best wishes, OP.", "NTA but I am shocked that they don’t have emergency foster homes in your country and that a one year old would go to a shelter.", "NTA\nKudos for trying and having the best intentions…but these are adults responsible for their choices. They are all taking advantage of you. \nPlease look into moving out, you will get much grief and more abuse so be prepared. \nObviously rough for the kid but the current environment is not good for it either.", "NTA - you are the only one to put the needs of the child first. You did not \"make\" your mother lose custody. Her addiction did that.", "NTA", "NTA. what you did was extremely compassionate, extremely brave and extremely moral.\n\nHow are you though? Are you safe?", "NTA\n\nAs much as it hurts you done the right thing.. now to look after yourself and make a fresh start", "NTA. You saved an innocent child. People like your mom and sis always blame the rest of us for any consequences they suffer. Get away from them. Escape. You deserve it.", "NTA... it would be different if your mom and sister made an effort to give these children a good life. But they were not doing even the basics. You needed to do this for the children. They have a chance at getting adopted into good homes. You have a chance at your own life.", "NTA. Hopefully he’ll be adopted soon and on a better path in life. You might want to get away from your family. They must drain all your v energy.", "NTA. You put that kid first. He has a chance at a better life.", "info: you say your mom quit her job to look after your nephew, but then you mention her skipping out on 15 days of work, then a whole month of work, and then 'somehow my mother hasn't lost her job'.\n\nso what's going on? did she quit her job or not?", "NTA.\n\nSad as it is to say, your nephew is much better off now. He is so young that an adoption placement is very likely for him. Do your best to see if you can keep track of him so that if he wants to reach out later in life, he can find you.\n\nTime for you to cut the apron strings with your mother and sister and go live your own life. They have made their decisions as to how they want to live. Now that your nephew is in a safe place, you are under no obligation, blood ties or not, to support their poor decisions.\n\nPlease post an update once things have cleared up, and let us know how you are doing.", "You did your nephew a solid.", "Thank you for giving this child a chance.   Make a plan to do better for yourself.  Don't let family be the death of you.  Good luck.", "NTA, hopefully you saved that poor child from having to live with an alcoholic grandmother who doesn’t show up at work when she’s on a bender and a mother who is too lazy to work at all (and possibly an addict). That kind of upbringing rarely results in a well adjusted, well cared for child.", "NTA difficult situation you did your best", "I’m a former foster care caseworker. You absolutely, 100% did the right thing. Guardianship under your mother was not a sustainable situation. She was not a good or even barely adequate care provider for your nephew. Someone on a 30 bender is not able to provide competent care for a child. Sure, she’s fine now, but how long until the next time?\n\nThankfully, your nephew had you to step in and tell DCFS what was going on.", "NTA", "NTA. You did the right thing for your nephew, but please do the right thing for you now and get away from your mom and sister before they drag you down with them.", "NTA", "NTA - thank you for looking out for your nephew, your mom and sister. This may mean that you will have a strained relationship with them though the reasons were the correct ones. Big hugs and chin up! ❤️", "ESH. Poor kid doesn't stand a chance in this family.", "You are the asshole because you still live there.", "Even if it hurts, OP you made the correct decision. Now, take care of yourself and make a fresh start.", "Yes. Stability is one of the absolute most important things a child needs to thrive.", "Please get away from your mother and sister before they drag you down further.", "This 100%! I’m not adopted but was not in contact with my biological father or his family my entire life until I tracked them down & it was mostly a mistake, they’re all just as messed up & horrible as my mother & her family. The minute they had contact with me they started trying to infiltrate every aspect of my life & were so incredibly toxic & horrible when I told them to back off, that immediately lead to me cutting them back off except for a new half sister because she’s basically a younger version of me & feel the same way about them. Anyone that proclaims “flesh & blood” usually turns out to be toxic & uses/abuses their “family”", "Not every country handles things the same. \n\nMaybe instead of automatically thinking bs. Also it wasnt up for adoption immediately they have been working with the family, deemed them unfit and are now in the process to go further. The child is over a year olds", "I mean \n\n1) op isn’t from the us and some cultures don’t kick their children out at 18 saying F off\n2) op pays for everything in the house so really it’s mommy living with him if you think about.\n3) sometimes adults live with their parents to be caregivers.\n4) op states he’s barley keeping his head above water paying for everything \n\nYeah he should find a place for himself if he can though. He pays for everything there so he hopefully can on his own and maybe be in a better place for himself.", "Why is OP an a-hole ?", "[deleted]", "At least you won't ever see your nephew again. Hopefully the abuse he suffers is only minor", "Children first. Nta", "NTA. You sound like you were honest to the CPS worker and acted in the best interests of your nephew.  You did the right thing, but also the hard thing. I hope your mom and sister get the help they need to overcome their addiction. \n\nFor your sake I think you need to LEAVE the situation if you can. It sounds like you struggle to support them both, and that isn’t fair to you. Would it work for you to live independently, save money and focus on yourself? I know the cost of living is insane right now but maybe you could find roommates.", "You put that kid's wellbeing above everything else, that's a sign of a very responsible person. It came at the expense of your relationship with your family, but it was the right thing to do.", "NTA - I hope your mother and the mother of the boy can be convinced to let him be adopted by a loving family instead of trying to keep fighting to keep him in a - at best - less than ideal situation.", "NTA.  Get away from them.", "NTA did you also tell them your sister is living with you and the child they took out of her custody?", "NTA. Good for you for thinking of what would be best for that baby.", "NTA\n\nYou're a good person for not allowing ties to a shitty family and a shitty situation put a child in harm's way.", "NTA. I'm sorry you are in such a crappy situation, but please sleep better knowing you did what's right for your nephew. And that's the number one priority. I wish you all the best for the future and hope your situation improves.", "NTA. I just hope he can be adopted right away and not get stuck in the system.", "NTA. Child's welfare comes first.", "NTA\n\nYour nephew is young enough that he is likely to find adoptive parents fairly quickly and will have a stable upbringing away from your mother and sister. You are the only person thinking about this properly.", "Look at it this way. What if you didn’t say anything and because of your mother’s drinking something happens to your nephew while in her care, could you live with that guilt?", "NTA- The right thing is rarely the fluffiest fairytale thing, it's often harder to do the right thing than the 'nice' thing.", "NTA he is young enough to get adopted and have a strong chance of it working out.\n\nEven if your mom pulled it together for a while it wouldn't last and then he'd be too old to find a new family and spend his life in the system instead. \n\nHarsh but it's the truth.  Family, blood, whatever means nothing if people don't take care of the kid.  \n\nPlease know you did what you had to do, and his life will be better for it.", "NTA. Someone has to put your nephew first, and thank G-d you’re there to do it.", "Nta The kids are always innocent and defenseless. They must come first.  You know that he has no chance for a safe and decent home with your mother and sister. You've done right by him and deserve to hold your head up high.", "NTA. You looked out for your nephew, which is the best thing you could do for him. I know it hurts right now, but you are completely not TA.\n\nAnd as others have said before me, please move out for your own sake.", "You are not the asshole. The baby's wellbeing is far more important than anyone's feelings. You told the truth.", "Thank you", "NTA. And get yourself out of there as well", "nta", "YTA you have no business taking your mothers adoptive child from her simply because you don't like her drinking.", "You're 29 and live with your mother??  \nI couldn't read past that.  \nYTA", "Did you make sure to tell everyone you were the one calling social services?", "I’m praying that little boy gets adopted by a good family", "The younger he is, the easier to be adopted as well... had OP lied chances are he would just postpone the inevitable and by the time it happens the poor boy would be \"too old\" and stuck in the system.", "Ummm yes they can? It happened to my mother with 3 of her children, my only brothers. She had such a long rap sheet filled with child abuse, not to mention that she already lost 6 kids. When CPS found out she gave birth, they went to the hospital room, told her that her rights were immediately severed, they were taking the child, and they will be up for adoption immediately.", "> take him back to a shelter **and in the long run** , he will likely be up for adoption. \n\nOP did not say the child would be put up for adoption immediately...", "But what about foster kids that get beaten to death? What about foster kids being over medicated with mood drugs and trafficked? CPS and adoption are not 100% safe at all. what if the kids gets abused by the system? At home maybe the sister could get into treatment but now she’s a mess AND lost her kid AND betrayed by a relative. Lots of people drink. Plenty of people struggle. But the grandma wanted to keep the kid. I’m sure she was trying to do the right thing. Who knows what will happen to the kid surrounded by strangers.", "Did you read that OP is the only working adult in the household and the one financially supporting his mother?", "Seeing as he's the only one supporting the poor kid, I'd say he has all the right", "Only 1yo so adoption is a good possibility. If nothing was done at this stage he would definitely have eventually ended up in the foster system.", "He is in the foster system", "NTA.  In fact, you’re the hero in this story because you’re the adult who rescued this baby from what would have been a lifetime of abuse.", "I’m so sorry you’re having to deal with that! NTA good looking out for your nephew.", "NTA. I’m so sorry you were put in this position. I hope you’re able to get on your feet one day soon, and I hope either you’re able to adopt nephew or at least make contact with those that do. You did what was right for him.", "NTA but move out now!", "NTA. you did what was right", "NTA. This was destined for failure from the start. You alone were responsible for everyone and everything and that’s totally unfair", "There are two options.\n\n 1. your nephew is raised by a sixty year old alcoholic who smokes - I am guessing around the baby - and has no resources.\n\n2. Your nephew is adopted by a family which presumably is sober and has the resources to care for a child.\n\nNo one needs to tell you which is the best option. You put the welfare of this child above your mother's wants. NTA.", "Clearly NTA. You’re the only reasonable and responsible adult here.", "Wait until his sister gets pregnant again.", "NTA, protecting the child comes first, period.  But I'd get away from the toxicity of your family before you get drug in deeper.  You don't have to parent your mother and sister, it's time they sink or swim.", "NTA. You did the right thing, by your nephew. Your mother and sister deserve no more breaks.  \nIf you can, go no contact with them.", "NTA. You acted in your nephew's best interest when no one else would. That took courage. \n\nI don't envy your current living situation. I hope you're able to escape soon and move on. Good luck to you.", "I would need to hear your mum's side of the story. Things seemed heavily skewed in your favour.\n\nPeople don't just keep their job after skipping months at a time. You saying \"somehow she kept her job\" isn't a suitable explanation. It sounds as though you're exaggerating because deep down you don't feel responsible for the kid and resent getting roped into their care.", "NTA. What a terrible situation. I'm so sorry. You need to get away from your mother and sister though. Hopefully you can find your own place to live and go no contact with them. Maybe you can still see your nephew from time to time. What a difficult situation. You did the right thing.", "NTA you did the right thing but from your post looks like your problem was the money not your nephew", "NTA. You are the only responsible adult here actually caring for the well being of that poor child.", "NTA\n\nYou are putting the welfare of the child first", "NTA- Social services tries everything to keep kids with family, so if your nephew was removed they think the situation is pretty dire.", "NTA.\n\nYou can't cause somebody to lose custody of a child. You can only report what you see/know. What the authorities decide to do from there is on them, not you.", "NTA \n\nDoesn’t sound like neither of them are competent enough to take care of themselves let alone  a kid. You did right by the kid because eventually he would have been taken either way.", "Protect children NTA", "NTA. You have saved your nephew from the psychological trauma of being raised by an addict, having their needs neglected. I’m sure you know firsthand how awful that can be. You mum and sister are the only people responsible for him being removed. You showed great courage and integrity to do what you did. You should always be proud.", "NTA. Your mother's actions caused her to lose custody. You did the right thing by telling the truth. I'm so sorry you have to deal with all this. I hope things get better for you.", "NTA. You did the right thing for your nephew. I hope you can get out and on your own. Good luck and God bless!", "irmao vc condeno esse mlk, adocao no brasil eh uma piada, ele vai crescer em abrigo ate os 16 anos quando vao por ele na rua e vai ter q virar para o crime, vsf", "Nta and you’re a good fucking person no matter what they tell you. Good job being the only adult in that poor babies life to ACTUALLY do something in his best interest", "NTA - that's a sad situation but you acted in your nephew's best interest. What happened is their fault not yours.", "NTA", "NTA there's nothing there for your nephew. If your sister used a lot while she was pregnant, he's already got the deck stacked against him, and an environment where people can't even take care of themselves will just harm him more.", "YTA if you are planning on staying there and wanted the kid out to be able to continue your lifestyle. You could of told the court about the father and gotten child support to help out. By living with Mom you need to sacrifice yourself to the situation. Your nephew has a high chance of being worse of in the system.", "Nta...you're doing what was best for him. Drop these toxic people out of your life.", "NTA- you were honest about the reality of those trying to care for a baby. It’s not your fault that both your Mom and  sister have the struggles they do. It would be your fault if you lied and something happened to your nephew while in their care.", "NTA", "NTA", "NTA- your mother and sister aren't caring  for themselves never mind your nephew and at 1 yr, he needs proper care.  There are no guarantees with fostor care or  adoptions,  but growing up with addicted adults as your guardians pretty much guarantees a very hard life and likely addictions for him as well.  You also need to remove yourself from the situation,  it is not healthy for you either.  Much peace to you.", "NTA you were the only one who put the child's health and safety first. Now that you've taken care of him, take care of yourself and move out.", "NTA\nSo very sorry for you and your nephew. You need to move as soon as you can. Distance yourself from your mom and sister. You need the only thing you could do for your nephew. Good luck.", "NTA", "NTA. Your mother raising the nephew is not likely to be a very experience for the nephew. Hopefully in time he can be adopted into a good stable family.", "NTA", "NTA.  I'm so sorry you've had an incredibly rough day and hard times before that, as well.  You did the right thing.  You acted in the best interest of the child.  Kick out your mother.  Kick out your sister.  They need to clean up their own lives.  You need to focus on yourself and building your own life.  I'm sure it hurts to lose your nephew, but you didn't cause that to happen.  Your sister and your mother did.  Now that you've read this, wrap your arms around yourself and squeeze tightly.  I mean so tightly you start to hear things pop.  That's me, giving you a hug for doing the right thing.  Doing the right thing is often the hardest thing to do and very often, we don't give people enough credit for having the courage and strength of character to do it.", "Hopping on the top comment to say, OP, all the hugs. I’m sure you’ve been through a lot, and I commend you on being so persistent in advocating for your nephew. You both deserve so much better. NTA.", "Posts like this make me wish that we as a species had to turn on our ability to reproduce rather than turn off. Poor kid didn't ask for this start in life. He deserved to be born to at least one parent who could provide for him. \n\nI agree with you that OP should go NC with these people. NTA", "No, the mother is living with him.", "The mother lives with him.", "OP, you're the only one keeping your mother housed. She needs to live on her own and stop relying on you to pick up the pieces. Unfortunately, to keep your head above water, you are enabling her by allowing her to live with you while she goes on benders and stops working. It's time for some consequences for her actions and, if that leaves her homeless, that's her problem. She hasn't hit rock bottom yet because she still has a soft place to land.\n\nLook for a roommate situation so you can live independently from both of them because they are just mooching off of you. Sister has no intention of supporting herself. Mom is inches away from being fired. Save yourself or they will drag you into the gutter with them. NTA.", "There are lots of great foster and adoptive parents. They want to be there and it certainly isn’t for the small stipend that doesn’t come close to covering raising a child. That’s a myth. There is a lot of background, training, and visits done to become one. The garbage you see sensationalized on the “news” or in shows is not the bulk of reality. Source: former 13 yr foster care cluster leader for 3 towns here. I’ve met some truly awe inspiring people that care.", "he wont, they live in brazil, adoption here is very(extremely) low especially if black skin and expensive, plus foster house only keep you till 16 at that point they throw you out and most teenagers turn to crime", "We know what would happen to the kid surrounded by relatives... all of the things that can happen through adoption and foster care can also happen in a good ol’ normal abusive household. That’s how it be. Now we know there’s little chance anyone in this family can neglect that baby. That’s a good thing. Alcoholics are the same as other substance abusers, always inappropriate and extremely dangerous for an infant.", "Exactly. This could have been the best out of a group of bad options, but let's not kid ourselves that he has somehow protected this child by putting it in the system.", "That’s person’s stupidity aside, if you are broke, you might as well be broke away from that disfunction. Please consider finding another boarding house or something.", "NTA\n\nYour nephew would have had a horrendous life with these two women.\n\nAs a baby, he has a very high chance of getting adopted into a loving family.", "NTA- you saved that poor child’s life. Now you need to save yourself, get out.", "NTA.  If more families stepped up & told the truth fewer kids would die or have life long emotional scars. Hopefully he'll get adopted by a couple who treats him as their own.", "The whole situation sucks.  But you are the least asshole person involved in the situation other than your nephew.   You took the best course of action available.   NTA", "NTA. You did the right thing by your nephew.", "NTA. You did the right thing in getting the little guy out of a bad situation and you should get out of there as well and go NC on them.", "NTA cut contact with mom and sister move on. You did the best possible for your nephew.", "NTA. No one that should be responsible for this child is actually well prepared to have a child. They have a disease and, unfortunately, relapses are part of this disease. It doesn't match a small child.\nSorry for what you're going through.", "NTA, but if you want to have a relationship with your nefew and make sure he's being properly taken care of in foster care (many kida unfortunately are not) then you should speak to CPS and ask for visitations", "NTA, you are a hero.  While you are at work the child is in a house with two adults that have substance abuse issues.  You easily saved this child's life.  Just think of all the different things that could have happened. Think of him sitting there all day in a dirty diaper not being fed because mom and grandma are out of it.  He is safe because of you.", "NTA. You told the truth; none of you were capable of giving your nephew the care he needs. I hope you keep track of him, and I really hope he finds a decent home.", "NTA.  I am so sorry about this sad situation. Neither your mother or sister are capable of providing the care that child desperately needs.  I hope that CPS can find a loving home where the baby is nourished and can thrive.  I would distance yourself from your mother and sister at this point.  You can't do anything about their substance abuse issues and you should haven't t to deal with the issues that users may have.  Take good care of your self!", "NTA you’re a hero\nGet away from that toxic family and thank you for helping that little boy", "Your sister would be able to turn her life around if she really truly wanted to put in the effort. My bio mom got me hooked on p!lls when I was 16yo. I was a full blown junkbox until almost 30yo n then I finally got my head outta my ass n turned my life around for the better. I'm now almost 2.5 years clean, work a full time job, have my own 2 bedroom apartment, shared custody of my 13yo daughter and am about to become a dog mom in a few short weeks. In recovery anything is possible but u have to really want it to achieve it n when u do man there's no better feeling.  And as for you you really need to get out of there. Save ur money up n get ur own room or if u arent able to stay there n save ask a friend if they'd let u crash at there place while u saved up for a place of ur own. Let ur mom n sister clean up the mess THEY THEMSELVES CREATED!! You're most certainly NTA u did right by ur nephew n did what was best for him in the long run.", "nta, you did what is ultimately best for your nephew. yeah the system sucks but not as hard as being raised by an alcaholic relative while living with a deadbeat mom and no dad.", "NTA. A young child whose eligible for adoption has a better chance than a kid in temporary care of an alcoholic grandmother with a drug addict mother not pursing reunification and no listed father. Foster care has its own risks, sure, but this child's options are to be in a known terrible situation with guardians who arent trying to fix the situation, or maybe end up in a bad foster situation and maybe end up in a good one.", "NTA. Did your nephew a solid.", "NTA. You did good by your nephew. You got him out of the house that has drug abusers. Hopefully he'll be adopted by a loving family that will have his best interests at heart and they'll give him the best chance at a good life.", "NTA. Sounds like you're doing your best to make sure your nephew is being properly cared for.  Please consider moving out for your own wellbeing", "NTA. They're both choosing drugs and alcohol over a baby and then crying when people step in to prioritize the baby, up to and including baby's removal from the whole situation.", "NTA. You are a good uncle.", "ETA- the foster care system is ruined and you didn’t give that kid a better life.", "My heart is breaking for your nephew 😢 This is not your burden to bear, OP. You did the right thing. I hope you are able to move on & lead a happy life. \n\nNTA", "NTA, a true hero.\n\nAt such young age, he is highly likely to be adopted by a stable family. He has a chance to be stable and have a solid future because of you. You stuck your neck out and suffered family loss to save your nephew.\n\nAs a person raised in abuse, I have no words. You're You're f*cking hero man! Bravo 👏 👏", "Nah, you were right. That baby’s been through enough trauma. It’ll be easier to get him adopted now as opposed to waiting for her to make a mistake.", "I have to say the foster system probably won’t do him any better.", "NTA", "I really wish I had coins for you. 🥇🥇🥇", "I would not, obviously.", "Yeah, we all know how well that worked out the first time...", "It’s the other way around. His mother lives with him.", "My mom's side of the story is always coming in to sweep whatever mess my sister made.\n\nShe was really happy to have a grandson, but, in fear of losing him, enabled every bad decision my sister made, starting by backing her up when she did not want to name the father in the birth certificate, effectively leading to an extremely slow and still on-going legal battle to have a paternity test done and receive child support.\n\nShe has had problems with alcohol ever since I was a kid myself, sought treatment once, didn't try to again until I first brought all this to CPS's attention back in november when she skipped out on 15 days of work.\n\nI too, am surprised that she wasn't fired for skipping work for the entire month of January. Her boss contacted me a few times asking about her, to which all I could reply was \"It's anyone's guess\". Apparently she was punished with a 3 day unpaid suspension and what was that. I'm not sure what strings she pulled, but I do know her supervisor very much loves her work and was intent on helping her out because of her grandson.\n\nShe has cycles where she is okay for months at a time and then for no reason, goes back to drinking. Usually that ends with her either managing to salvage her job or leaving it entirely. In the past, 90% of these were also triggered by, you guessed it, my sister doing something stupid.\n\nWhile my mother has now started a psychotherapeutic treatment as of the beginning of this month, it's too little too late. It wasn't always like this however, as she was brought up in a household of means, and togheter with my father, threw it all away due carelessness, irresponsibility and inertia. It got so bad that I've been playing catch up for the last 10 years of my life and at this point I'm too far behind to be able to even get a leg up in life.\n\nI did grow very attatched to my nephew and it does pain me to have to do this, but it's legitimately the only chance he's got at maybe having a decent, even a good life perhaps.", "Depending where they live it may already be too late for that, just because the mother has lost custody does not mean that he can just be adopted out, she has to be fully stripped of all parental rights first, and that can take years.", "This isn't the US, and both adoption and participating in foster care here is an extremely bureaucratic process and leaves no stone unturned. Granted on occasion some cases of abuse in the system do happen, it generally is still very low compared to the US foster care system.\n\nBut hey, if you want to take my nephew's place and be raised in a household exposed to substance abuse, subpar living conditions and the coming and going of strangers, because, after all, this is a boarding house, be my guest.", "It sounds as though you are acting out of spite and bitterness. You seem a little bit too focused on what your sister been able to get away with even if you dress is up as caring about your nephew.\n\nMy gut feeling is that YTA. Did you give CPS a balanced view of what your mum is like? Did you let your family know that you reported them to CPS or did they put the pieces together when your nephew was taken away? Do you think your nephew will do better in the system or with a grandmother who is making the effort to turn her life around for his sake.\n\nHopefully he ends up with a decent Foster family. They're not always that lucky.", "Sadly not possible at the time. The other ones around here that I know of are extremely sketchy. This one is not so bad, but still, it's shared living. Hopefully I'll be able to rent a place for myself  within a year or two.", "NTA", "NTA, you did what was best for not just your nephew but you and your family as well.  Your nephew will get the chance to live a healthy and happy life instead of being raised with addicts.  A lot of kids raised in that atmosphere follow their parents footsteps.  You're actions will help potentially prevent that.  Your a hero.", "NTA and #Run", "NTA. I'm so sorry you have been placed in such an awful situation. But you made the best choice for the baby. My hope is your nephew is adopted by a lovely couple who will cherish him. \n\nI have a good friend who waited for 10 years to finally be chosen to adopt a baby boy. The baby was born into similar circumstances. He is my friends' absolute pride and joy and receives services that he needs due to the substance use during his prenatal development.", "NTA. I wish you had been able to move out with and adopt your nephew, but it doesn’t sound like you have the resources to do that. Hopefully the baby will be placed with a good home very soon. If there is a way to keep tabs on your nephew, it might be a good idea.", "NTA. it was only your sisters responsibility to take care of that child and she didn’t step up, and it seems like your mother tried but she wasn’t capable. the child’s safety is paramount.", "You did what was right for that baby! I was raised by a mom like yours & the alcohol & all....It sucks & you never fully get over it. It's a sad situation but you were really brave to do that for him!", "NTA. We are talking about the safety of an infant. That has to supersede all other family considerations. You put yourself in an very difficult position with your family by taking the steps you did, and deserve a heck of a lot of credit for doing so. Thank you.", "NTA.\n\nAnd you did not \"make (your) mother lose custody.\" She did that. You did the right thing. It is actually VERY difficult to remove a child from a home. It always takes more than one person's report. ALWAYS.", "NTA. What you did was difficult but ultimately is the best for the child. That’s not a healthy environment to be raised in. Both you and the child deserves better.", "NTA. This was a terrible situation for a baby to be in. I'm living with a new grandbaby now and see how he soaks up the love he gets. I cannot imagine what damage has already happened to that child living through his first year in a shelter!!! \n\nYour mother and sister appear to be the incapable of taking care of themselves. They both have made and continue to make damaging choices. No child deserves to be around people like them. Your nephew will never in his life thrive as a result of what those two women have forced on him. Getting CPS in the picture is the only way to save that child. You shouldn't blame yourself for giving that baby a better chance at a healthy life.", "NTA - now, take care of yourself", "NTA", "NTA. You wasted 11 years of your life dealing with this bullshit. Just why?", "NTA.", "NTA It's a bad situation. You gave him a better chance at life and only told the truth.", "Why are you still living at home? Sounds like it’s time you moved out.", "[removed]", "Go away DuePresentati. No one likes a bot.", "Thanks. Reported the bot.", "NTA apparently little kids are easier to be adopted out to families, better now than 5 more years of neglect. I hope they find a safe and loving family for your little nephew, I hope he never has to see your mum or sis again. You did the right thing, I'm sure it was hard for you but you were brave and did what you knew to be right.", "NTA\n\nYour family, at least mom and sis, sound like multiple concurrent overlapping train wrecks.", "NTA.  You did the right thing by the child.  Him being raised in the situation will only continue the cycle of poverty and substance abuse.  However, I hope you told the CPS worker the name of the father.  He deserves to know his child is in foster care.", "NTA. You love that baby more than anyone else in this situation does.", "NTA. What else could you possibly have done? The baby needs care, and nobody in the immediate family is able or competent to do so.", "NTA… this is heartbreaking and I’m so sorry you are going through this. I really am. But you truly are trying to do what is best for your nephew.", "Oh, I'm so sad for you right now. You did the right thing for your nephew and likely saved his life in the process. Your mother's alcoholism and your sister's drug abuse is not your doing & not your responsibility.  It's not your job to take on the financial support for them just to barely slow their decline at the expense of your own welfare - materially, mentally, physically, and even spiritually. That may sound harsh to some, but it's true. You cannot solve or fix their pain. But you can and did work to stop the damage that they could inflict on your nephew because of their own pain and the chaos their addictions brings along.  NTA", "NTA. You reported neglectful abuse, saved that boy from an unstable home, made sure to follow through with your morals regardless that it was a painstaking process, got him away from the inevitable trauma that laid ahead, reported to authorities diligently. That baby is going to be raised with (hopefully) a stable family that looks out for his best interest. Also he is very likely to get adopted because of how young he is so it is a very promising future for him because of you. Thank you for not wavering in carrying out the bare minimum this child deserves, it’s all you could do and you did it well. We thank you", "NTA", "two things.\n\n1.) NTA for having your mom lose custody of your nephew.\n\n2.) YTA for enabling your mom and sister by letting them live with you. For letting them go on benders. Your mom and sister will continue to go on benders as long as you let them live with you. It is time to let them go, it is time for them to \"sink or swim\" on their own. Stop helping them and move on.", "NTA You did the right thing. Please move out and away from your family as soon as you are able.", "NTA.\n\nYou did the right thing.", "Can you adopt/foster him?", "NTA, but you will always be the \"bad guy.\" Move immediately.  Don't look back. There's only going to be disfunction in the rear view mirror.  Good luck!", "NTA", "NTA\nYour sister will be given a “service” plan. CPS will give her a list of things to do in order to get the baby back.. get a job, take parenting classes, have safe housing, get monthly drug tests, seek counseling/ rehab if needed, etc\nCPS will work with parents to reunify as the main goal in almost every case. \n\nAlso … if not married, a woman can’t just put a man’s name on the birth certificate. She would have to go to through the courts to get him named as the father. ( Usually this is done by the state in a child support action… Dad can ask for a Dna test.) \n\nEvery state is different but it’s mostly the same procedure. Each state has different time limits of when things need to be done. \n\nIf you had a genuine fear that the child was in the custody of a person abusing alcohol/drugs and neglecting the child, you absolutely did the right thing. \nTelling the truth is never a betrayal.", "NTA and I am so sorry for the trauma you have and will likely continue to endure at the hands of your very dysfunctional family. Your nephew being adopted is the best thing for him. Never feel guilty for telling the truth about this.", "NTA. You showed courage and integrity plus concern for your nephew. These ppl are stealing your life force. Leave and have your own brave and happy life! You're a good person a d deserve much better than what you are giving yourself.", "It's at least a chance that someone nice will adopt him now as a baby as opposed to him definitely having awful shit happen to him with alcoholic grandma and freeloader drug addicted mom. He'd also get put into the foster system later and almost certainly won't get adopted as an older child", "I’m so glad that your experiences in the US have made you an expert on the state of foster care in Brazil.", "Let me rephrase this entire post so it’s easier for you to tell for yourself:\n\n“AITA for telling CPS that my family is falling apart, that I’m not financially stable enough to support a kid, that my sister is abusing substances, and that my mother is an Alcoholic so that my nephew has the *chance* of growing up with a decent childhood?”\n\nBud, you’ve done more for that kid with this than anyone else has in that kids entire life. *Hard* NTA, and anyone who disagrees just doesn’t get it.", "As an adopted child at 4 years old, and adopted with my bio brother who was two, when I got the info about our bio parents when I was an adult I was relieved and grateful that we were adopted rather then being brought up in such dysfunction. Blood is NOT thicker than water and kudos to anyone who cares about the welfare of the children more than not offending family relationships and dealing with family fall-outs.", "NTA... You saved your nephew from this existence and he deserves stability.", "NTA at all.  Bless your heart.  Prayers for your situation and extra prayers for your nephew.  Good luck!", "NTA! Ur making sure he's safe. U can't do that and work plus the house while ur mother isn't even coherent or potentially even present!\n\nGet out and stay away. If u want, see if u can keep contact where ever ur nephew gets placed", "NTA \nIf you can’t or aren’t willing and/or able to take ur nephew urself then it sounds like you’re doing what’s best for him and a chance at a good life", "NTA but if you weren’t financially responsible for those 2 you might actually be fit to take your nephew in yourself if you wanted to.", "NTA at all, You're the only one who truly cared about ur nephew.  You saw the limits on the people responsible for this child, and reported honestly.  \n\nI hope everything is sorted out for your family but just know you did nothing wrong and all You're doing is giving your nephew the stability he deserves.", "NtA, but as always, the real victim here is the defenseless child. May the good lord watch over him and keep him safe.", "I hope he finds a lovely family and wish all of you good things. This was very difficult, but I think you did it for the best of everyone involved. Your mother and sister may not understand or accept it, though, so maybe start looking into cheap housing with roommates as a just in case.", "ESH, damn cold of you to let your nephew go to the shelter but i get it. You aren't the asshole for being the apparently only responsible person in the family, but man, anything CPS is just straight horrible.\n\nKick out mom and sis, adopt the kid, would probably be easier on you. Trust me, he'll be better family in the long run. They are in the situation they are in because of choices they made.  The kid is innocent as are you.", "NTA. Somebody needs to provide the little guy with stability and support, and you need to untangle your money and living arrangements from your mother so you're not the candidate for that. \n\nIt's wrenching, but this is what's best for your nephew. It's a shame the women in your family can't get their addictions in hand with such a precious reason to try but in the meantime, he shouldn't have to suffer, and he's not your responsibility.", "I hope they’re somewhere where kids can have stability in foster care though, that definitely doesn’t happen everywhere in the world", "Sounds about right. My friend fostered her now-adopted-son from the time he was a few months old to a couple years old. That's how long it took the system to decide mom wasn't meeting the requirements to reunite and go through all the remaining family to see if they would be a good fit first.", "To be fair to that commenter though, I had no idea what a boarding house was and had to look it up. We don't really have those around here (Western US).\n\nEdit: you're definitely NTA", "Do what you have to do for now. Best of luck for a future away from all that.", "NTA...yours is a dysfunctional family and he needs stability. I wouldn't even discuss it with either of them.", "NTA but your mother and sister will forever say you are", "Not only are you NTA, you're a fucking hero. Seriously. You saved your nephew from a home where he was being neglected and would likely have ended up abused, too. If you accomplish nothing else in your life, everything was worth it for this one incredible good deed. Do not ever doubt that you did the right thing.", "NTA - your nephew sounds like he was in a very unsafe situation. You just told them the facts. It’s not your fault the facts and their actions are problematic. Reporting actual issues for people’s safety is not a problem. You would be TA if you kept your mouth shut. Please also try and find a way to keep yourself safe and counselling as it doesn’t sound like you would have had an easily childhood either or dealing with their reaction to this.", "It's a difficult situation and you did what you thought was best for your nephew's well-being. It sounds like your mother and sister were not providing a safe and stable environment for him. You also did the responsible thing by reporting your mother's alcoholism and absences from work to CPS, which likely played a role in their decision.\r  \n\r  \nHowever, it's understandable that your mother and sister are upset with you. Losing custody of a child is a traumatic experience, and they may feel that you betrayed them. It's important to remember that they are responsible for their own actions and choices, and ultimately the well-being of the child must come first.\r  \n\r  \nYou should try to maintain a good relationship with your nephew, if possible. You can still be a positive influence in his life, even if he's not living with you. It may also be helpful to seek out therapy or counseling to help you deal with the emotional aftermath of the situation.", "A Nexplanon implant prevents pregnancy for 3 years. It is by far the easiest form of birth control. At 28, and having already had a child, she might have a chance at getting her tubes tied if she found the right doctor. SOMEONE needs to talk to her about her options and make sure she follows through so she doesn't create a situation like this again. Maybe it shouldn't be you because of all the drama, but someone needs to step in and prevent her from conceiving ever again."]}