{"id": 10280, "submission_id": "115d5qn", "title": "AITA for freaking out about my guests inviting strangers over?", "selftext": "My husband’s brother and their partner are staying with us for a few months to relocate and get back on their feet. This is our first house and we’d only been living here for about 8 months before they asked us for help. I’m not asking for any money for this, they’re guests. \n\nI’ve got some pretty simple rules:\nDon’t leave food out, clean up after yourself.\nIf you use something without asking first, be prepared to replace it.\nDo not invite people I haven’t met first to my house and don’t invite anyone over when we’re not home. \n\nI don’t like people in my house, I don’t like being in other people’s houses. It’s just my personal preference, but I’ll make exceptions if asked ahead of time.\n\nI’ve already gotten agitated about coming home from work to find the results of drunken cooking left strewn about.\n\nI don’t have my phone on me except during breaks at work. In the 2 1/2 hours between my last break and getting home I get messages saying they’re having friends over but they’re staying in the garage and it won’t happen again without prior notice. \n\nI’m already very unhappy about this, but then we get home and these “friends” are in the house and it turns out they just met them that day. Complete strangers, liked their vibe and invited them over to the house(around midnight) they are guests at when specifically told not to as an initial boundary. \n\nI realllly wanted to tell them to get out right then. The main reason I’m not is because they have two cats (unaltered males that are making the spare bedroom smell terrible) and it’s not their fault their owners are doing stupid things.\n\nThey apologized and said it won’t happen again, but admitted that they knew I wouldn’t be happy about it. They did it anyway.\n\nI’m extremely introverted and don’t socialize much at all, I’m happier that way. I feel like I’m being extremely nice with the entire situation, but I’m not great at reacting appropriately when it comes to human interaction. So… am I the asshole for being so uptight about my space and boundaries?", "created_utc": 1676719079, "permalink": "/r/AmItheAsshole/comments/115d5qn/aita_for_freaking_out_about_my_guests_inviting/", "score": 552, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I freaked out and spoke to them very harshly. I might be the asshole because I don’t regularly socialize and may be overreacting.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA... inviting strangers at midnight? Someone else's cat pissing in your house? They would be leaving with their new friends if it was me.", "NTA.  Your husband needs to put his brother  out of your house.  I’m with you on having fandoms in my house, where I pay all the bills.", ">They apologized and said it won’t happen again, but admitted that they knew I wouldn’t be happy about it. They did it anyway.\r  \n\r\n\nYou're NTA, they know you're a pushover, would be bothered by this, and did it anyways.\n\n$100 they do it again within a month.", "NTA \n\nThey stomped all over your boundaries KNOWING you would hate to find strangers in your house during the middle of the night. They owe you an apology. \n\n\nYour husband should be dealing with his brother. Ultimatums should be set up. No guests or they are out, or just straight up kick them out. They will do this again since they suffered no repercussions.", "NTA. They have behaved very poorly after you have gone out of your way to accommodate them. \n\n>They apologized and said it won’t happen again, but admitted that they knew I wouldn’t be happy about it. They did it anyway.\n\nTheir apologies and promises mean nothing. If they'd meant what they said, none of this would have happened and they would have respected you and your home.", "NTA absolutely. I do NOT like people in my house. I don't hardly ever have company over. I've had 2 friends to my house, I've known for 11 years and one for 9. That's it. So I deeply empathize with you on that point", "NTA\n\nYour BIL and his partner are huge A.\n\nI don't really understand why you feel responsable for them because it seems to me they don't respect your rules at all.\n\nThey agree with what you say and then they do as they want. They even admit they don't care about your rules. \n\nI would talk to my husband and then tell BIL he has 1 month to find a house.", "NTA. Do not be nice about this. It is your home. \n\nDo they have a timeline on leaving? If not you should make one with the rule that if they break your rules again the timeline is now.\n\nAlso, you should make them deep clean the room with the cats.", "NTA \n\nI would’ve kicked them out", "NTA\n\nYou let them into your home, free of charge and gave them your trust. They betrayed you by going behind your back, inviting strangers to your home knowing that you won't like it. I would kick them out or give them a one week notice.\n\nMaybe I'm a pessimist but I don't believe for a second that they won't do this again. I mean they already lied that the strangers weren't in the the house, when in reality they were. Don't let them stay just because of their cats.", "NTA. You have been very generous to your “guests”. Your BIL and his partner need to leave if they can’t respect your boundaries. Apparently they have enough $$ to party, then they have enough $$ to pay rent.", "NTA You told them what the rules for your house were and they broke them anyway. Btw, they are very reasonable rules.When you saw wat they did, you were disturbed and afraid for your safety and for the safety of your home. \nA simple ultimatum like \"If you at least think about inviting other people to my house, I will ask you to leave\" is more than generous at this point. Be clear and concise.  Repeat if necessary.", "NTA Guests, like fish, begin to smell after three days. Especially their unneutered male cats.", "What is your husband saying about this? This is his brother.", "NTA... I've lived with family, you respect them, thier boundaries and try to be the least amount of hassle possible, especially when you aren't charging rent. You are well within your rights to kick them out. Keeping the peace would be setting a time line, you have two months to find somewhere else. Above and beyond would be give them a final warning and a chance to make it up... but it's a final warning.", "NTA. Your house, your rules. You are clear about it and yet they broke it, the infuriating part is, they are just a guests. It's hard to trust again after what they did knowing the people they invited over were a complete strangers they just met that day.", "NTA. You need to talk to your husband. I think it’s fair to tell them they need to leave if they can’t follow the rules of your house and that one more transgression and they’re out.", "NTA. Why do I think that your husband's brother is never going to leave? The next post will be AITA for refusing to pay my husband's brother $5K to leave. In some places you get squatters rights after 3 nights. No one stays overnight in my home, never ever.", "Nta fuck this get those stinky cats which are spritzing up your house for every local Tom to compete and spray everywhere else and your inconsiderate guests out those people could and are anybody it your home", "NTA. Those rules are fair, it is your house after all. To me, it sounds like it's time to put a deadline on when they should leave. Continuing like this might put the relationship between you and them on thin ice.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband’s brother and their partner are staying with us for a few months to relocate and get back on their feet. This is our first house and we’d only been living here for about 8 months before they asked us for help. I’m not asking for any money for this, they’re guests. I’ve got some pretty simple rules:\nDon’t leave food out, clean up after yourself.\nIf you use something without asking first, be prepared to replace it.\nDo not invite people I haven’t met first to my house and don’t invite anyone over when we’re not home. \nI don’t like people in my house, I don’t like being in other people’s houses. It’s just my personal preference, but I’ll make exceptions if asked ahead of time.\nI’ve already gotten agitated about coming home from work to find the results of drunken cooking left strewn about.\nI don’t have my phone on me except during breaks at work. In the 2 1/2 hours between my last break and getting home I get messages saying they’re having friends over but they’re staying in the garage and it won’t happen again without prior notice. I’m already very unhappy about this, but then we get home and these “friends” are in the house and it turns out they just met them that day. Complete strangers, liked their vibe and invited them over to the house(around midnight) they are guests at when specifically told not to as an initial boundary. I realllly wanted to tell them to get out right then. The main reason I’m not is because they have two cats (unaltered males that are making the spare bedroom smell terrible) and it’s not their fault their owners are doing stupid things.\nThey apologized and said it won’t happen again, but admitted that they knew I wouldn’t be happy about it. They did it anyway.\nI’m extremely introverted and don’t socialize much at all, I’m happier that way. I feel like I’m being extremely nice with the entire situation, but I’m not great at reacting appropriately when it comes to human interaction. So… am I the asshole for being so uptight about my space and boundaries?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You are very much NTA here! Your house your rules and your rules are very understandable and not weird at all in any way. So in order to stay at your home (and for free even) they should abide by your rules. Them not complying with the rules shows they don't respect you and they don't respect your authority over your own home. You are so kind to help them in need and they take advantage of you.\n\n\nAlso what do you mean about their 2 male cats stinking up the guest bedroom? Do you mean the litter boxes stink or are they spraying and/or peeing on things? If it is the second option, perhaps you should also create a rule that in order for them to stay in your home both male cats need to be castrated. That will also help with option 1 btw since their urine will smell less after castration.", "NTA, I would hate being in the situation you are in.", "NTA. They aren't your guests, they are just taking advantage of you. Just as a start, those cats need to be neutered, and the costs of professional cleaning paid by them.", "NTA. You made simple rules and they ignored them. Even people who aren't more extroverted don't want guests leaving a mess in their kitchen and uninvited people living in a spare bedroom! I hope you get BIL and partner out ASAP so they can get back on their feet somewhere else.", "NTA, but you husband needs to deal with them, this should be the last straw and they need a formal eviction notice.", " I think it’s fair to tell them they need to leave if they can’t follow the rules of your house.", "A week tops", "It was supposed to be two months at the very most. Currently at 1 month and 16 days. One of them just recently got a job that they seem like they’ll stick with, the other is still looking. They don’t have the money to get a place by the end of this month, so they’re already going to be overstaying the initial time agreement.", "Spraying. They said when they first moved in that getting them neutered was a priority. It hasn’t happened yet.", "If it were me, I would tell them their money problems won't keep me from kicking them out if they bring any more people in the house period. They already abused the privilege of being able to ask first. \n\nAre you sure they aren't breaking the rules when you aren't there? \n\nI'm sorry you're having to deal with this. You should be comfortable in your own home.", "They're never going to neuter the cats, they'll never follow your rules and they're never moving out. They're moochers and they're counting on you being a pushover... You either accept this or do something about it.", "Oof do you have carpet in that room?", "I honestly don’t know. I’ve thought it, but keep telling myself I’m just being neurotic. This whole thing is tiring and stressful.", "Yeah… I wrote it off as a loss upon agreeing to let them stay.", "Since they have already shown they don't respect your rules, no, you are not being neurotic to worry about that. \n\nRemind them how many days they have left on the original agreement. Hopefully, someone else will take them in if they don't have money for their own place yet. \n\nI'm sorry you're stressed.", "You have to give them a move out date or they won’t leave. Trust me from experience.", "Why do so many AITA posters simply open up their house to people who may or may not treat the place as their own, making messes, inviting strangers (!) over, bringing their cats, etc.?\n\nWhy don't you just say no when they ask to move in? You mention the cat smell, but you let them bring their cats in--what did you think would happen? Animals smell.\n\nWhat do you owe these people that makes you give up your independence to them?", "NTA.", "NTA give them a warning that next time they break any one of your rules they are out. Your home could have been robbed that night.\n\nAlso get a ring doorbell so you get an alert on your phone when someone is at your front door and you can see who enters. If you have a back door install there too.", "NTA but I think you really need to reconsider your decision to not ask them to leave. Their behaviour has just not been good enough.", "NTA.\n\nThey deliberately broke your house rules. If I were you, I would kick them out today. Not at the end of the month.\n\nFinding and keeping housing for themselves and their cats is their problem, not your problem. If they were in a homeless shelter, they would need to follow the rules, or they would be kicked out. The same logic should apply in your home.\n\nThe fact that you've allowed their cats to damage your brand new home is a sign that you've already been far too lenient. They broke a rule that they new would upset you badly. You need to force them to deal with the consequences of their actions.\n\nTheir behavior will only get worse if you let them remain in your home.", "So you basically have bums in your house that make mess while drunk, invite other bums over, and KEEP UNALTERED MALE CATS inside. \n\nDid I get anything wrong?\n\nNTA", "NTA but unless you get rid of them posthaste they're never going to leave on their own accord. They'll always be a few months away from \"getting back on their feet\" and just continue to take advantage of you", "No, no no...NTA, BUT...I'm the same way about my house, i dont like people in my house. \n\nThey would have been gone ASAP.", "NTA.  People staying in your house have to follow your rules, and this one is very unreasonable.  Its not even safe to bring strangers you just met that day back to your house.", "NTA. Where is your husband in all this? Why isn't he dealing with his brother? Why is it up to you to enforce boundaries? They know you're unhappy and keep doing it, meaning they really don't care about what you want. They will continue to do what ever they please no matter how you feel about it. It's time for the big heave ho out the door you go.", "NTA, go ahead and boot them out.", "Tomorrow night", "Kick. Them. Out.\n\nYou do not invite people to somebody else’s house.\nEspecially when that somebody is not there.\nEspecially when that somebody has told you in no uncertain terms not to.\nEspecially when that person is letting you be a guest in that house.\nEspecially when you’re already skating on thin ice for ignoring other reasonable house rules.\n\nKick. Them. Out.\n\nAlso change the locks.\n\nNTA.", "NTA\n\nThey are not guests, they are users.    \nWho invites people over they just met, and at midnight?  Users.\n\nTheir cat situation is not your issue.  If you want, tell them to get out but the cats can stay. Then get the cats fixed.", "NTA. But why are they still there. Get them gone now or they will never leave.", "NTA who goes to a strangers home and takes their cats? Your relatives sound like they have very poor judgment", "You didn't ask them to leave because they have two cats? At this point, when they do it again, and they will, they're just going to shrug at you. Your need to sit your husband down and set a date they need to be out. You need to be proactive. NTA.", "NTA they’re preparing to stay there long enough to get tenants rights so you can’t evict them without paperwork and probably a payout. Get this sorted and them out asap.", "NTA. Kick them out. You could always offer to keep the cats and get them fixed if you want to. But they obviously have an irresponsible lifestyle that isn’t compatible with your quiet and peaceful home.", "NTA You need to establish rules with consequences. You need to say you were very unhappy about what happened and if they do it again they will be out, no second chances. The cats do not have to go just because their owners do. You could continue to care for them.", "NTA\nThey're there because you're being kind and generous to them because they're going through tough times. They should be on their best behaviour. Now, you set very clear and basic rules that they knew of. They still chose to break those rules. If unenforced, that means those rules are basically nothing.", "There are so many of these stories.  Somebody buys a house.  Family member or ling lost friend is about to be homeless.  Homeowner invites down and outer to stay long enough to get on his/her feet.  Stay stretches out for months.  Guests also begin to deliberately defy every rule put in place that allows homeowner to tolerate their presence.  These actions seem to be power plays intended to sideline the host’s rights in their own home. \n\nAsk yourselves what your guests are doing to get beck on their feet?  Why are they relocating in the first place?  \n\nConsider that the news you bought s house was their get out of work card so they packed up and made a beeline to your area.  Their attitude toward you, your property, their status, and their apparent inability to find jobs and save tell you why they got into this mess in the first place.  \n\nGive them a move out date unless they can show you a bank account with regular deposits and proof of wages. \n\nPossible upside; maybe you can claim them as dependents on tour taxes.\n\nYour guests should be so busy finding work and second jobs to get back on track, they have no time to  invite random people in to your home without your permission.  They should not be home during the day.\n\nDrunk cooking?  Where are they getting the money to afford alcohol?", "NTA.  your husband's brother and partner are acting inconsiderately.  Inviting strangers to your house is rude and dangerous.  OP, you are not out of line.  \n\nI would discuss this situation with your husband:  both you and your husband need to be on the same page. How much longer do your in-laws have  until they are re-located?  can they move at an extended stay hotel?", "Your household rules are *far* stricter than anything I would have, so believe me when I say NTA, they are MAJORLY overstepping and you are not being neurotic. I wouldn't forbid guests from inviting other people over, but holy hell I would not be ok with them bringing over 1. people they just met 2. at midnight 3. when I'm not there 4. without asking, only telling me after the fact. They didn't just step over the very clear boundary you gave them, they took a running start and crashed through it like they were playing Red Rover. And they have cats spraying in your new house??? I'm a huge animal person and I was mortified the *one* time my dog peed in somebody else's house and kept an eagle eye out every time we set foot in another person's house to make sure he never did it again.\n\nGet your husband on the same page as you so you have support (you shouldn't be the only one upholding your boundaries, btw! Where is he in this??) and tell them you expect them to be out at the end of the month as expected. Maybe you would have been willing to extend it, but they have shown they don't respect you or the rules you set for your house, they stretched your goodwill too far, and that door is closed now. Don't cave, they'll only keep trampling you.", "NTA. Inviting strangers to your house against your explicit request is doubleplus uncool.", "You are never going to get that smell out.", "Seven months later or beyond and they’ll probably still be there pulling this nonsense if op doesn’t put their foot down *now*", "That’s some guaranteed cash in your pocket", "Hate it when your house gets infested with fandoms. Particularly those Harry Potter ones.", "Actually it is super easy.  Use nature’s miracle.   I had four cats and one of them was a little anxious and peed.  Omg.   But this thing has special enzymes in it.  No smell after using it.   :)", "Just a warning that some cats still spray after being neutered, so don't count on them stopping doing it for sure after the procedure.", "Not if they are just locking the two cats in that room… I used to clean a house where they would lock their cat in the large finished basement and it smelled unbearable ALWAYS. Cleaning pee is different than cleaning a male’s spray", "Also, they need to get their cats fixed now. Landlords are reluctant to rent to people with pets. Unaltered males would be an absolute no. NTA", "I would also be super concerned about them establishing residency and this turning into an eviction type of ordeal. NTA.", "It isnt going to be just the carpet.\n\nIf it is spraying, it will be the subfloor, the baseboard, and the lower foot or more of the drywall... and possibly the doors.\n\nAt a minimum, never let those cats out of that room.", "Time to spine up and make a decision. Charge rent or tell them to move out. You are being walked on like a doormat. You deserve living in your house in peace.", "NTA - time for you to tell your husband to evict his family.", "NTA but they're taking advantage of you. Give them a deadline to leave.", "NTA, guests cannot invite people over themselves.\n\n>They apologized and said it won’t happen again, but admitted that they knew I wouldn’t be happy about it. They did it anyway.\n\nKick them out, they admitted it was better to seek forgiveness then ask permission and the only way to deal with such AH is to make them face consequences for their BS.\n\nLike, you don't even have to discuss this, any guest is \"two yes or one no\" and your yes just became a no so their stay is over.", "NTA They broke your rules and it would be fair to tell them to get out now. \n\nI would also not be okay with strangers in my home, especially when I'm not there. It is an extremely reasonable boundary. If they want to bring home whoever they want they need to hurry up and get their own place. \n\nIf you're not quite ready to boot them, I suggest using this time, while they know they are on thin ice, to initiate some consequences that benefit you:\n\n1. Demand a report on their progress towards finding their own place.  Possibly even make it something they have to do periodically to prove they are on track.\n2. Insist the male cats get fixed. I know in the US there are programs that will help people get them fixed even if the don't have much money. Helped me with my girl when I was a poor college student. Ease the way by looking up the programs first and maybe even making the appointment for them. They either make the appointment or they are out because the cats are clearly pissing in more than their litter box. \n3. Also, they need to clean that up. \n\nNow you also need to decide with your husband if a second strike means they are out. If either one of you feels like that's a yes, then it is a yes. If it's a yes, your husband (not you) needs to tell them this immediately so they know. If it's a no, don't tell them because that's inviting them to do it again because they know they'll still get another chance (plus if the next stranger guest trashes your house or steals from you, you will want to change your mind and don't need to hear from them how they were supposed to get three strikes or whatever.)\n\nIf you can afford it, get a camera doorbell on your front and back doors so they can't easily sneak people into your home. Make sure the camera range covers your garage if you have one. Chances are they have already been sneaking people in and this is just the first time you caught them.\n\nFinally, know that you can just be done with having them around even if they haven't recently broken a rule. It's called overstaying your welcome and I have a feeling if it weren't for the cats they are already there. But with the cats fixed, you can also just choose to kick the humans out. It's much easier to find temporary digs if you don't have a pet and they can work from there towards finding a pet friendly place.\n\nThere is a risk that they will never come back for the cats though. So you would need to make a plan and maybe even have them sign an agreement that after x time they have ceded their rights to the cats and you will rehome them or they're now your cats and no take backs.\n\nGood luck, OP!", "NTA\n\nYour house - your rules. Your guests need to respect that. If they don't then that means that they don't respect you and you should just throw them out of your house!\n\nAlso, who TF brings strangers home??? It's weird. And I'm not just saying that because I'm Swedish and we're an aloof people in general. At least I don't think I am.", "Oh fuck no. “We didn’t ask because you would say no” gets you thrown out of the house immediately.", "Don't even get me started on the Stephen Universe ones.", "Lol well I hope you enjoy your permanent roommates. They are not going anywhere. They don’t want to pay rent somehow else and they know you won’t make them.", "That stuff is graat.", "I got 2 cats thanks for the info on the natures miracle!", "Vinegar is also good.", "They are doing it now", "Yeah. It permeates into walls and floors. If the room has carpet or wood floors, you will need to tear it all out to ever get rid of the smell. May also need to tear out the walls if they're sheetrock as it will also soak into that and be impossible to get rid of.\n\nETA: Pee is fairly easy to get out if you act quickly enough, but it's not the same when a male cat sprays. That's basically a mist that instantly soaks into shit. I had a cat that did it to my shoes and some of my clothes. All had to be trashed because the smell wouldn't come out of the clothes no matter how times you soaked and washed them. You'd think it did, but as soon as you started to sweat a tiny bit in the clothes the smell instantly came back.", "I'd go ahead and give them a reasonable expectation of a date they need to be out by. Seriously. Don't just let leaving your home be a nebulous idea. I realize that you seem too nice to kick them out, but here's an alternative.   \n\n\n\"We're going to need you guys out by \\_\\_(Reasonable Date)\\_\\_\\_ and I need you both to look me in the eye and understand that the next time you break one of the rules, you will be kicked out before  \\_\\_(Reasonable Date)\\_\\_\\_ \".  \n\n\nIf you want to really go for the gold, look around for a cheap neutering place for cats (Already have the place picked out. Most people don't do it due to being lazy/thinking it'll cost too much) and include that they need to get their cats fixed as a condition to be allowed to stay for the extra month or two you're allowing.", "NTA I would have thrown everyone out if I came home to that nonsense. They knew the rules and did it anyway.", "NTA. They’re staying at your house for free. They can follow simple rules like “please don’t invite other people over to our house without asking.”", "NTA.  Your husband needs to step up and throw them out.  You were clear about the house rules.  They broke the rules.  Having strangers in your house is NEVER acceptable.  Tell DH to grow up, grow a pair, and deal with his family.", "NTA....right away on the not litterbox trained cats I'd have shown them the door. The rest of that? Like, ya GTFO. There's no universe that exists where I'd put up with any of that.", "Ask them to move out by the end of the week. Tell them you know they won't like the decision but now it's done as they brought it up on themselves.", "NTA \nThey are beyond rude. You have to evict them. Good luck.", "Never, never, never.", "There's a lot of hiring going on right now all over the place.  Many of those jobs are not ones you'd quit your current job for.  However, if you have **no** job, it's not hard to become employed.\n\nNot sure on tenancy laws in your area but you might start thinking about how you remove them from your home lawfully with force.  Where I live, it requires going to court and getting sheriffs involved, roughly 30-45 days from initial filing.\n\nEven if it doesn't come to this, you really ought to know your rights etc.  Don't just let them push you around and disrespect you anymore.", "When we got our family home as an inheritance, we had to clean up some really old furniture (with some really expensive fabrics) and carpets as there had been cats in the house and we're all allergic to their hair. We got these really strong house furniture and carseats cleaner (it has a kind of plastic brush on top) and used it, had to use it once a day for 2-3 days and all the smell and hair were gone. The trick is to cover the \"soap soaked\" parts with semi wet towels, it makes the dirt attach to the towels and leave everything pristine. The towels are easy to wash if you use a high temperature program in the wading machine. Hope it helps! 😘", "Only if you get to it before it soaks into the floor underneath, cats will also return to spots that smell like pee already.", "Cameras needed ASAP", "My exfiance had a roommate at one point who had an unaltered male cat that sprayed. The roommate left his clothes on the floor to get peed on constantly  and thus he smelled off pee. I don't know what was more ridiculous that they didn't bother to take care of the issue or the fact that no one in that house believed me when I said that male spray was cat pee and that they were letting the toddler crawl on the floor in cat pee. That house was so disgusting. Huge flea issue, to the point that several pets died from anemia. Cats allowed to pee whereever. The untrained dog ripped through the chicken coop and that was a nightmare. The roommates got CPS called on them, and animal control. They'd clean the house long enough for CPS/Animal services to go away then go right back to letting mold grow on the countertops.", "haaah. love your screen name and how appropriate you would know this (cute black cat for non Japanese speakers)!   : )   so the claner didn't damage the fabric dyes? I love this towel idea.  Will keep that in mind.", "I was going to say, white vinegar is great too.", "u/SentenceofJudgement that's why Nature's Miracle is so awesome.  The enzymes actually tear apart the molecules of urine and scenting.  It doesn't clean it as much as convert it into water and gases.   Even after drying.   As long as it can soak through.   : )", "Can confirm. The 1st house I ever bought, the owners had 3 cats. Noticed the house smelled a bit in 2 of the rooms. The owner said it's just the litter box. Really didn't matter anyway, I was going to buy the house no matter what. All of the drywall had to be torn out and replaced in 3 rooms. It was soaked in cat urine from the floor to about knee high in 2 rooms and floor to shoulder level in the living room because the cats sprayed the wall while they were standing on the couch. All the carpet was thrown out. Cat urine HAS to be treated right away, or it will stink no matter how much cleaning you do.", "NTA. They’re going to do it again. They don’t respect you at all and you’re being a doormat. You need to tell them to leave as it’s not working out.", "NTA.  Talk with your husband.  These \"guests\" are acting as if they own your home.  Get them out.", "Throw out the brother and the partner. It's not worth it.\n\nNTA", "NTA like you wrote, they are guests. They need to respect your rules, your home and most of all YOU. They knew you wouldn’t like it and did it anyway. They are staying for free and can’t even be decent enough to respect your wishes? You need to double down and make sure they understand how you feel about there lack of respect. Try nice, get assertive, then kick there a$$ to the curb if they continue. It’s your house!", "You're NTA. They had no right to invite those people over.", "NTA\n\nBut I truly don't understand how having cats fouling up your home is YOUR justification for not kicking the brother, his partner AND the two cats out immediately. \n\nWhy would you have allowed two cats into your home to stink it up in the first place.\n\nObviously this is going to happen over and over again because the brother doesn't give a flying fuck regarding what the \"rules\" are. He knows what they are and doesn't even have the grace to even attempt to come up with any kind of excuse except he wanted to do it.\n\nFrankly you are a kind of asshole yourself for allowing yourself to be treated in this kind of very insulting manner.", "It's honestly time for them to be moving on.  NTA.", "Relocate and get back on their feet - sounds like a lot of spin when they’re out partying with strangers and bringing them back to your place. \n\nIf they’re really in a regrouping and rebuilding phase and living in someone else’s home - they need to be humble and act like it’s not their f’ing house and lay low and be respectful. \n\nGet your partner to straighten this up, it’s not on you. They’re his family more so then yours. He needs to step up and be the face of both of you. Also guests and baby names - that’s a two Yeses and one No decision.\n\nNTA", "INFO: where is your husband in all this?", "NTA - and they need to go. They aren’t respecting your really reasonable rules and they are living in YOUR house rent free… and causing damage to the house while they stay. Seriously, they are taking the piss with all of this.", "With my old cat, I had to rip up the carpet and apply several coats of oil- based Kilz.", "I bought my house two years ago and discovered, when stripping the paint off of the stairs, that the landings were entirely saturated in male cat spray. I sanded, I used several coats of clear KILZ and polyurethane, and I can STILL smell that rank odor when I walk down the stairs. The wood is also totally messed up and was peeling apart while I was sanding. I have to get the whole landing replaced. \n\nOP, get them out. They’re literally pissing all over your investment and you may to need to replace the floors in that room. NTA.", "Two unaltered males scent marking? It’s a deodorizer,  not the second coming of Christ. That will have sunk straight in to whatever it’s landed on. It’ll have to be ripped out or covered in multiple coats of a blocking paint."]}