{"id": 10319, "submission_id": "115p6qn", "title": "AITA For refusing to apologize to my mom’s best friend?", "selftext": "So my dad just recently passed away. It was and still is a very hard time for me to deal with but that’s a different story. On the day that my dad passed, my mom was in the hospital for a number of different reasons and it someone got back to her best friend that my dad had passed and the children were at home alone. For reference, the oldest child is 22 (me) and the youngest was 17. When I was first informed that the best friend who I’ll simply refer to as B, would be coming to clean the house, I had just watched as they wheeled my dad out. The sadness and grief that I was feeling quickly turned to anger and rage as B and I have had issues in the past. To avoid further conflict with B, I walked down to my aunts house and proceeded to space out. That is until my brother, the 17 year old, came and told me that B was here and that she expected us to get out ass up there and clean. I simply stated to my brother that I would not be returning to the house until I felt like it. He returned a few minutes later to tell me that B said she was in charge and my mother until further notice. Something inside me snapped. I had been taking shit from this women since I was 14 and in that moment I no longer could. As I walked out of my aunts house and crossed the driveway to my house, everything this woman had ever said to me and every name she had ever called me came crawling back into my mind. When I got into the house, she immediately acted all sweet and tried to get me to understand that she was my mom while my mom was in the hospital. I couldn’t form exactly what I wanted to say so I simply told her to get the hell out of my house and no one needed to be in it at that very moment. She refused and kept insisting that we need to clean. In not so many words I told her to fuck off because I can’t stand her. She smiled and said that’s okay because she’s my mom’s best friend and I don’t have to like her. For the first time that day I smiled and let out a laugh and said my mom doesn’t even fucking like you, she only tolerates you because your husband is her best friend. Everyone who was there that day is on my side and believes I was justified in saying what I said. My mom is still sort of mad at me for spilling the beans about her secret and thinks I should apologize to B. So, AITA?\n\n\nEdit. I apologize for not paragraphing this as this is my first time on Reddit.", "created_utc": 1676751417, "permalink": "/r/AmItheAsshole/comments/115p6qn/aita_for_refusing_to_apologize_to_my_moms_best/", "score": 313, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Should I have told my moms friend the harsh truth about why my mom tolerates her or should I have held my tongue and dealt with her awfulness for the sake of my mom?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and if I said exactly what I was thinking I'd be permabanned.  \n\n\nI will say it takes a special kind of asshole to waltz into someone else's house, declare themselves the \"mom\" to the adults and quasi-adults who live there, and start making demands of them.  That's before you consider the fact that they literally wheeled your father's body out barely an hour or two before that woman's arrival.    \n\n\nToo bad, so sad, she got what she deserved; and with all due respect to your mother, she should never have subjected all y'all to that woman in the first six places.", "NTA. I literally can't describe how awful this is without it getting deleted", "NTA. Your dad died, and this random lady is worried that your house isn't perfectly clean. That shouldn't be anyone's priority right now - you should be focused on spending time with family and grieving your father. There are things more important than a tidy kitchen.", "NTA and don't apologize.", "NTA  this woman sounds vile.  She's not \"mom\" til your mom comes home; she's a loon for thinking a 20 yr old needs parented.\nStand your ground and don't let her come back over.", "NTA!\n\nIt is pretty entitled of B to think she can go into a house without permission!", "NTA \n\nB was highly insensitive and refused to read the room. How she thought that what you needed was her turning up, cleaning and demanding you clean too, is beyond me. \n\nEven if she did think she was helping, the minute the responsible adult in the house-- you-- told her to leave, she should've got gone, instead of trying to be an authority figure and telling you she was your mother until your own mother comes home.\n\nYou have nothing to apologise for. This woman's behaviour was outrageous. She turned up at a horribly difficult time and proceeded to make a nuisance of herself. Her own unfeeling actions are what led to her being kicked out.\n\nI'm very sorry for your loss.", "If she didn’t leave your house, I would have called the police on her for trespassing.", "NTA. You’re grieving the loss of your dad and your mom is in the hospital. That’s enough of a burden to bare. Having a woman whom you don’t like or respect tell you that she is your mom until further notice? You were a hell of a lot more contained than I would be in this fucked up situation. Take care of yourself and your siblings. I’m sorry for your loss and sending you and yours positive juju to get thru this very difficult time.", "NTA \n\nThe day my Mom died, we got tons of food. Lasagna (2 whole pans of homemade), lunch meat, cheese, and fried chicken. People just dropped off food. No one tried to \"clean.\" No one tried to muscle themselves in at all. \n\nI would have called the police. This behavior is beyond unacceptable.", "NTA, that \"friend\" overstepped. There was no need to clean the house right at that minute and even if there were, you and your siblings had bigger things to deal with. If she really had wanted to help, she should have done the cleaning by herself, not make a fuss and allow you all to grieve in your own way. \n\nYour mom should apologize to you all for letting her come over, especially since she was being dishonest about that friendship and knew very well it was not gonna go down well. The women B should be disbarred from your house and if she is not, she should definitely apologize for being a b\\*\\*ch in your time of grief.", "NTA - I am sorry for your dad \nB was insensitive", "Op, Why didn't you just call the cops and have her removed from your home", "YTA for not using paragraphs", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my dad just recently passed away. It was and still is a very hard time for me to deal with but that’s a different story. On the day that my dad passed, my mom was in the hospital for a number of different reasons and it someone got back to her best friend that my dad had passed and the children were at home alone. For reference, the oldest child is 22 (me) and the youngest was 17. When I was first informed that the best friend who I’ll simply refer to as B, would be coming to clean the house, I had just watched as they wheeled my dad out. The sadness and grief that I was feeling quickly turned to anger and rage as B and I have had issues in the past. To avoid further conflict with B, I walked down to my aunts house and proceeded to space out. That is until my brother, the 17 year old, came and told me that B was here and that she expected us to get out ass up there and clean. I simply stated to my brother that I would not be returning to the house until I felt like it. He returned a few minutes later to tell me that B said she was in charge and my mother until further notice. Something inside me snapped. I had been taking shit from this women since I was 14 and in that moment I no longer could. As I walked out of my aunts house and crossed the driveway to my house, everything this woman had ever said to me and every name she had ever called me came crawling back into my mind. When I got into the house, she immediately acted all sweet and tried to get me to understand that she was my mom while my mom was in the hospital. I couldn’t form exactly what I wanted to say so I simply told her to get the hell out of my house and no one needed to be in it at that very moment. She refused and kept insisting that we need to clean. In not so many words I told her to fuck off because I can’t stand her. She smiled and said that’s okay because she’s my mom’s best friend and I don’t have to like her. For the first time that day I smiled and let out a laugh and said my mom doesn’t even fucking like you, she only tolerates you because your husband is her best friend. Everyone who was there that day is on my side and believes I was justified in saying what I said. My mom is still sort of mad at me for spilling the beans about her secret and thinks I should apologize to B. So, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I would’ve gotten the police involved.  NTA", "[deleted]", "It gets worse. She actually had the audacity to take my house key away from my brother while he was trying to bring it back to me.", "She actually didn’t leave for another four hours. She sat in her car and cried while her husband “cleaned” the house but I didn’t know this until the next day.", "It never crossed my mind to do so. I had already made a lot of phone calls and in the heat of the moment I had left my phone down at my aunts house.", "Apologies, first time using Reddit.", "OP just watched their dead father being wheeled out and was told to “get their ass home to CLEAN” by someone who apparently has never been nice? You seem to be confused on the disrespectful person in this story.", "I can only surmise that this was written by B because of the utter tone-deafness of the reply.", "I literally can’t feel bad for her crying after you told her what you said.", "Conspiracy theory: B has a Reddit account and is going around downvoting because I have noticed several supportive comments have a zero count...", "I didn’t and still don’t care that she cried. I guess she thought I would care or feel bad for making her cry because I’m usually a kind hearted person but 8 years of emotional abuse changes a person.", "NTA I’m sorry for your loss and she did this to you. I’m glad you stood up for yourself. I hope you continue to stand up for yourself. It’s wrong your mother expects you to allow someone to disrespect you. You need to warn your mother this will make you lose respect for her and it will eventually drive a wedge between you. Your mum should have your back.", "NTA. This woman has some nerve!", "Damn how is this woman still alive? NTA", "NTA.  You had just lost your dad and your mother was in the hospital and this woman thought she could tell you, a 22 year old woman what to do!  Tell mom, not sorry, you had been pushed to the extreme.", "Wait, she barged into your house directly after your father had died and tried to force you to clean your own house? WTF? If she wanted to clean that would have been a kind gesture.. but to force the children of the recently deceased to perform manual labor? No. She deserved whatever you chose to say to her. People who are that oblivious need to be corrected.", "NTA.  All of her comments were out of line, as were her demands that you clean on the day of your father's death.   You don't owe this woman anything.", "She legitimately tucked tail and ran two states away before I saw her again.", "She arrived about 45 minutes after they wheeled my father out of the house. I have so many stories about this lady that I could write a book.", "So, on top of everything else, you need to change the locks?  Vile person.  I'm so sorry for everything you are going through.  NTA, obviously.", "That's theft. Report it to the police.", "Probably a smart decision on her part", "You are absolutely not in the wrong here. What you said was harsh and I'm sure your mom is going to have to deal with her friend being bitter in the future, but that lady needed to get out and allow you to process. Also, it was very mature of you to try and remove yourself from that situation by leaving while she was there. Please remind your mom that you tried to avoid her by leaving and that her \"friend\" was actively harassing you. I'm very sorry for your loss.", "Changing the locks wouldn’t do much. Even though she’s moved away now, my mother would still give her a key if she asked.", "NTA. She's definitely not a stand-in mom to a whole adult and soon-to-be adult just because she says so. Did she really think that if she spoke with enough authority that you'd just roll over and help her clean while you're actively processing a fresh loss? Nahhh, she can have fun crying in her car all she wants.", "YTA.  Not for telling her off but for throwing your mother under the bus.  That wasn’t your place.", "Your Mom is mad at you for telling this woman how she is perceived by everyone in your family after she basically tried to dominate a bunch of young adults whose father had just died. No one loves to have their polite fictions aired, but a situation like this allows for a certain amount of truth telling to get an intruder to stop acting like an asshole. NTA", "My mom had a woman like this. She'd show up at our house and bark orders, and that's the tame part of shit she did that made me hate her. My mother was more \"friends\" because she didn't know how to say \"Fuck off\", and after a while it was more out of support for her kids, because the woman was/is genuinely abusive and narcissistic. \n\nNTA", "This is absolutely HEINOUS. My jaw literally dropped. Who the hell does this? I'm so sorry about your dad, and you had every right to get that hag out of your home.", "Call the cops.", "On top of her treating you poorly for years your dad had literally just been taken out of the house after passing away. Who tf goes into a house after that and treat people who literally just had that happen help her clean.\n\nSeems like her leaving would be equal to taking the trash out.", "This!", "Sweet girl 💓 my dad passed in August and I am twice your age. My heart goes out to you and your brother and everyone who loved him. It is not easy. There is no way to handle the death of a parent in the \"right way.\" You did absolutely nothing wrong and B was insanely out of line. Be gentle with yourself and seek out the humans who can support you during this period. They are there, I promise ❤️", "NTA", "NTA. I’m so sorry for your loss. B’s behavior is horrific.", "NTA.\n\nForcing chores on someone in the immediate aftermath of their father's death is freaking bizarre. That woman is batshit insane.", "You should have a tattoo on your forehead to warn others", "NTA \n\nDon't apologize to this harridan.", "op=NTA\n\nBut according to you, the question is should you apologize to B's husband(who is your Mom's best friend).  So maybe, sorry B's Hub for ....you choose the fill in the blank. LOL\n\nAnyone who thinks they can be \"mom\" to a 22 yr old while actual mother is in hospital is having delusions--clearly B is the A-H.", "NTA and what she did was super creepy! Who does that?", "Op, you need to talk to your mom and make sure boundaries are being set.", "NTA", "\nRe:  the family \"friend:  You are NTA.  The \"friend\" is the AH here. You can't delegate family responsibilities and grief at a time like this to someone outside the family.  You had every right to resent it forcefully.\n\nSometimes busy-work like cleaning help distract a grieving person from their loss. Otherwise, they can become paralyzed.  But of course this just delays things.  \n\nBut, you didn't need to drag your Mom into it at that difficult time.\nShe's grieving and suffering too.  Think about her too.\n\nP.S.  It is natural for you to be angry and strike out at what you see as unwanted impositions and intrusions.\n\nEdit:  While I don't think you owe the \"friend\" an apology; whether you might owe your MOTHER an apology is a different story.  Consider doing whatever you can to ease her burden.", "NTA\n\nAnd friends or not, I'd have told her once to leave the house and told her I'll treat her as an intruder afterwards."]}