{"id": 10329, "submission_id": "115y5dv", "title": "AITA for telling my dad and stepmom they will not be invited to birthday and holiday celebrations for their first grandchildren (twins)?", "selftext": "I (32F) grew up with very young parents, who divorced when I was 10. Neither parent handled the divorce well and they refused to be in the same room as one another. As a result, I grew up having separate holidays, birthdays etc with each parent. \n\nMy mom had primary custody, so I spent the majority of my childhood and adolescence with her. I have never had a close relationship with my SM. I don’t talk to her outside of major gatherings and see her maybe 4-5 times a year). My mom and SM/dad live 5 minutes from each other, so distance isn’t a factor. \n\nMy DH (also 32) and I got married last year. It was the first major event that everyone had to attend and play nice at. \nMy mom and dad both promised me that it was my day and they had no issues being around each other for it. They even offered to do a combined speech.\n\nI invited my SM and SS to get ready with the girls and my SM told me that she would be uncomfortable getting ready in a room with my mom, so I assumed they didn’t want to attend this portion. SM then she would be highly offended if I took a photo with my bio family (parents and brothers) because she’s my dad’s wife, my mom isn’t. After this conversation I had major anxiety because it was clear she was was struggling with insecurities and I was trying to make everyone happy. \n\nI “OK’d” everything with SM - the parents of the bride speech, the slideshow (containing childhood photos with both parents), I even had SM and mom sitting at separate tables, facing away from each other. I put in every effort possible to have a drama free day and make everyone comfortable. \n\nAfter the wedding SM told me that I should have done more to include her. I told her about all the effort I put in to make HER comfortable on MY day. She said my efforts weren’t good enough and I should have treated her equally to my mom. She was offended that all the girls got ready together and SM and SS weren’t invited. I reminded her that I did invite them and she told me she wasn’t comfortable being around my mom. We had a huge fight and SM kept bringing up the past and bad mouthing my mom. I asked if they could respect my boundaries and leave me out of any drama they had with my mom. SM threw it back in my face because ‘now she can’t express her feelings to me’. My DH and I ended up kicking them out of our house after boundaries were ignored. \n\nNow we are 7 months pregnant with twins (first grandbabies) and they have been excluded from all celebrations (gender reveal, baby shower etc). It’s been made clear that SM doesn’t want to be around mom, and I’m not going out of my way to accommodate her after the wedding fiasco. \nMy dad has made it clear that he won’t attend any events without SM, so he’s been excluded by default. I told my dad that if they want to be a part of the grandkids’ lives then we can do separate celebrations, but mom will be attending the big celebrations as she is much more integrated in my life. \n\nAITA for telling my dad he won’t be invited to major events?", "created_utc": 1676770886, "permalink": "/r/AmItheAsshole/comments/115y5dv/aita_for_telling_my_dad_and_stepmom_they_will_not/", "score": 45, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my dad and SM that they would not be invited to major milestone events for their grandkids\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta you step mom is playing games. Your dad is an ah for allowing this behavior and your step mom is a major AH", "NTA - your stepmother seems to think that “included” means the same as “in charge”, which is what she really wants to be.\n\nYou’ve been more than reasonable, and if your dad wants to be supportive of you, he needs to expect his wife to be reasonable also, and to think of him and his relationship with you when she starts throwing her weight around. Since he doesn’t seem to want to do that and is trying to emotionally blackmail you into going along with his wife’s whims by refusing to do anything without her, you’re not the asshole for keeping your boundary in place and protecting your relationship with your mother even if it means leaving your father and stepmother out of things.", "NTA. What more could you possibly do?", "NTA.\n\n You went above and beyond at your wedding to try to make SM comfortable. And she threw it back in your face. When they can stop acting like children, maybe they can be a part of your life and your children's lives.", "NTA. You owe your SM nothing and she's completely overstepping. You already did everything you could to have a drama free wedding and she's still not satisfied. You did an amazing job establishing and enforcing your own boundaries very politely.", "NTA. I'm so sorry they couldn't all set their differences aside for you. Sounds like they have some growing up to do.", "NTA Your parents, or rather father and stepmother, can act like adults and plaster a smile on their faces and act civilly at your childrens' millstone moments and events or stay home. You aren't excluding anyone, they're excluding themselves.", "NTA your step mom sounds like a real piece of work the whole \"your efforts weren't good enough\" is just horrid. Honestly they don't sound like the people you want in your life and I would say just be polite but don't feel the need to reach out about anything. Best of Luck with the Twins!", "NTA you tried to accommodate your stepmom before and all she did was complain you had not done enough. She likely wants you to not invite your mom to the events. If you want your mom there then your stepmom can deal and be civil or not go that’s her choice", "Nta and good for you. SM sounds like completely a selfish person.", "NTA. They are the older adults and responsible for acting as such. SM is so selfish it’s cringy. If she could contain herself and act respectfully without projecting her insecurities it would be different but clearly with the wedding experience you *need* to set clear, healthy boundaries and rules for the protection of your family.", "NTA SM is a jerk. She is nothing more than your dad’s wife. You are too old for a SM you have never had a real relationship with. She’s not grandma because your children have a living grandmother. You went out of your way at wedding and it wasn’t good enough for them. Dad made his choice so he can live with the consequences.", "NTA - step mom sounds like a pain in the ass. She wasn't equal to your mom on your wedding day because...  she's NOT your mom. I think your dad has made his choice as well. \n\nSometimes these things happen for the best. Keeping your kids away from a narcissist is more of a win-win in my book. I've had to keep my own kids away from their narcissistic grandparents too.", "NTA. you didn’t tell him he wouldn’t be invited. He made it clear that he was incapable of attending. \n\nThis is all his and his wife’s doing. Not yours. \n\nYou’ve tried your best in the past and they shit on it. No one needs that element in their life.", "NTA and your SM is being a B**** about everything.\n\n>  then she would be highly offended if I took a photo with my bio family (parents and brothers) because she’s my dad’s wife, my mom isn’t\n\nThis is just pure crap from her.  This photo was about the bio family, your mum and dad presumably wouldn't have had to stand together as happy family in this photo.\n\nThen your SM complains about the pre-wedding preps with the 'girls' when it was her choice to exclude herself.\n\nIt sounds like your SM is trying really hard to replace your mum in every facet of your life and you certainly don't have to put up with her BS if that's not how you want.\n\nIf your dad doesn't see what's happening in front of his eyes - or not hearing it because SM is complaining when he's not around then you need to tell him why you're setting these boundaries.  From then on if he decides not to come to these events that's entirely up to him and its a HIM problem and not a YOU problem\n\nAlso, personally I wouldn't be going to the trouble of separate events just to cater to your SM and her bitchy and jealous behavior.  Either she can attend the events as YOU plan and behave herself or she can stay away - that's her choice, and then its your dads choice if he comes or not", "NTA. If they can't get past their issues to come to family events then they shouldn't be invited. You went above and beyond to try to accommodate her feelings at your wedding and it wasn't good enough. I wouldn't cater to her again.", "NTA Dad and SM are imposing greater familiarity onto you than what the relationship warrants.", "NTA. After the drama she's caused and making your wedding about her your SM is lucky you'll even see her at different times. I'd tell your dad he's welcome if he ever changes his mind but if he's choosing to stand by SM and her bad behavior that's on him and he gets to miss out too.", "NTA. He could be invited if he'd either expressed a willingness to attend without his wife or had persuaded his wife to behave. As long as he does neither, you're well within reason.", "They aren't acting supportive or helpful and are being outright disrespectful. You lose privileges when you do that. They forced you to pick and now they aren't happy because they didn't get picked. I think its gracious of you to even offer separate events. NTA", "INFO \n\nWas Dad part of the drama or just SM?", "Posts like this make me so glad my parents had an amicable divorce. \n\nNTA and congratulations. Enjoy those babies", "Your SM is exhausting. NTA", "NTA good on you for trying to accommodate but not being a door mat. You tried, SM is clearly going to cause issues so now you're setting boundaries for yourself.\n\nYou're going to want your Mum around once you have your babies and SM sounds like she will only cause you stress.", "INFO: SM doesn’t really want your milestones to be thought of as 1st, as her children are going to give her all of those. \n\nDoes your Dad realize this is what is happening?", "NTA. Your step mom, and by extension your dad have created a \"rivalry\" situation regarding your mom. You cannot be expected to to cater to their nonsense. Your mom on the other hand appears to be dealing with the situation with a fair amount of maturity and grace.  \n\nYou are the mother of their grandchild. If SM and dad cannot act like reasonable adults, it's really not your problem. Enjoy celebrating your child with your mom.", "NTA. You don’t have to accommodate for anybody not being able to just grow up. That’s some high school BS that you don’t have to put up with. Especially being that you’re pregnant with TWINS. They don’t even have to talk to each other at all of these get togethers. NTA.", "NTA. Honestly, Your SM is the only AH in this whole scenario. Be it her Selfishness, her immaturity, her insecurities or her sheer sense of entitlement. You did enough, you must be thinking about your Husband, your Mother, and most imoprtantly, your happiness now.", "NTA, but maybe try to give your SM a chance to change, if she doesn't then continue this way, but communicate to her that she and your dad won't be invited to things if they can't get along with the rest of your family.", "NTA, but please follow through with the separate visits. They can be crappy parents and still be good grandparents.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (32F) grew up with very young parents, who divorced when I was 10. Neither parent handled the divorce well and they refused to be in the same room as one another. As a result, I grew up having separate holidays, birthdays etc with each parent. \n\nMy mom had primary custody, so I spent the majority of my childhood and adolescence with her. I have never had a close relationship with my SM. I don’t talk to her outside of major gatherings and see her maybe 4-5 times a year). My mom and SM/dad live 5 minutes from each other, so distance isn’t a factor. \n\nMy DH (also 32) and I got married last year. It was the first major event that everyone had to attend and play nice at. \nMy mom and dad both promised me that it was my day and they had no issues being around each other for it. They even offered to do a combined speech.\n\nI invited my SM and SS to get ready with the girls and my SM told me that she would be uncomfortable getting ready in a room with my mom, so I assumed they didn’t want to attend this portion. SM then she would be highly offended if I took a photo with my bio family (parents and brothers) because she’s my dad’s wife, my mom isn’t. After this conversation I had major anxiety because it was clear she was was struggling with insecurities and I was trying to make everyone happy. \n\nI “OK’d” everything with SM - the parents of the bride speech, the slideshow (containing childhood photos with both parents), I even had SM and mom sitting at separate tables, facing away from each other. I put in every effort possible to have a drama free day and make everyone comfortable. \n\nAfter the wedding SM told me that I should have done more to include her. I told her about all the effort I put in to make HER comfortable on MY day. She said my efforts weren’t good enough and I should have treated her equally to my mom. She was offended that all the girls got ready together and SM and SS weren’t invited. I reminded her that I did invite them and she told me she wasn’t comfortable being around my mom. We had a huge fight and SM kept bringing up the past and bad mouthing my mom. I asked if they could respect my boundaries and leave me out of any drama they had with my mom. SM threw it back in my face because ‘now she can’t express her feelings to me’. My DH and I ended up kicking them out of our house after boundaries were ignored. \n\nNow we are 7 months pregnant with twins (first grandbabies) and they have been excluded from all celebrations (gender reveal, baby shower etc). It’s been made clear that SM doesn’t want to be around mom, and I’m not going out of my way to accommodate her after the wedding fiasco. \nMy dad has made it clear that he won’t attend any events without SM, so he’s been excluded by default. I told my dad that if they want to be a part of the grandkids’ lives then we can do separate celebrations, but mom will be attending the big celebrations as she is much more integrated in my life. \n\nAITA for telling my dad he won’t be invited to major events?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your SM and wimp of a dad are the AHs. Complete and total, selfish AHs. Hold to your boundaries hun, otherwise you'll be giving in to their bs every time you have to deal with them. It's exhausting, I absolutely know because my mother is this way but a bit worse. Be strong for you, your babies, and your sanity!", "NTA. Your stepmom has issues and it’s not your job to manage them.", "NTA \nSM is, though. Your father needs to reign in her drama if he wants to be part of his grandchildren's lives.", "NTA. Act like a child, get treated like a child.", "NTA. Make it clear that Dad and SM are still invited, but that you are in control of these events and of your relationships and you will not be changing anything to suit SM. If they choose not to attend, or want to have a separate visit, that's on them. And if they do attend, and make any kind of fuss, they will be asked to leave, and then they really will be un-invited from all future events. \n\nLeave the door open. But be ready to slam it shut if they misbehave.", "NTA, I wouldn’t have separate celebrations for them either, she needs to grow up.", "Your issue is with your stepmom not your dad based on your post....if you havent already you should make it crystal clear he is invited but she isnt and why....if he doesn't attend then that's on him and he's the asshole but, if you ban him based on his wife then your the AH.....wish you the best  🙏🙌", "Only my SM had an issue with the wedding. My dad has since been acting as the ‘middle man’ between us.", "SM’s husband passed, and they didn’t maintain a great relationship with his side of the family. She has never had to deal with the blended family dynamic with her own daughter. If her daughter gets married it will be drama free. \n\nMy dad is trying to see both sides. However, he is really putting the responsibility on me to fix the relationship. I did try and reach out to SM recently to smooth things over and she told me that it wasn’t good enough (again). Dad wants me to reach out AGAIN but I honestly don’t have the mental capacity to do so right now."]}