{"id": 10368, "submission_id": "116fhna", "title": "AITA for calling a teacher a bully and making her cry?", "selftext": "Every other weekend for the last few years, my 11yo son and some adult family friends perform on a promenade for tips. They discovered that if you put a really cute kid (my son) in front of a bunch of boomers and millennial tourists and sing songs from the 90s and 60s like Nirvana or Doors then they'll throw money at you.\n\nA teacher from my son's school saw him and told him he should perform in the school talent show. My son said no way. It's one thing to perform in front of people you don't know and never will see again and then in front of your classmates.\n\nLong story short,  this teacher kept badgering him until my son snapped that he didn't want to be a part of her stupid dumb show. \n\nShe tried to get him in trouble over his response until I got involved. I told the VP and my son's homeroom teacher that my son now feels harassed and \"unsafe\" around this teacher. \n\nThat led to a mediation where the teacher said that she was under a lot of stress putting this show together and there was a lack of talent. That's why she kept asking my son. I told her she was a bully and that caught her off guard and she started to tear up but she apologized which is all she needed to do. The VP and my son's homeroom teacher told me that my comment was out of line. I said if they won't put her on check then I will. She started this by pressuring my kid and all I did was end it. They should be thankful to me because she won't do it again to other students.", "created_utc": 1676821815, "permalink": "/r/AmItheAsshole/comments/116fhna/aita_for_calling_a_teacher_a_bully_and_making_her/", "score": 63, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > A teacher at my son's school kept badgering him to sign up for a school talent show and my son snapped at her. That led to a meeting  where I called her a bully and made her cry.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. The same thing happened to me as a kid. I was maybe 10. The village had a yearly carnival with floats done up by various groups. The lead float was the Carnival Queen. She, and four attendants, were chosen by pupils at school. The CQ and two older attendants always had to be in the last year of school, Year 6 we call it in UK.\n\nAnyway, I didn't want to audition in front of the whole school because I wasn't popular and knew I'd lose. My teacher badgered me and badgered me. It was really a beauty/popularity pageant, not talent. I might have won a talent contest because I played piano. I gave in to the badgering.\n\nI came last. I knew this because they read out ALL the results in reverse order, in front of the whole school, and I got nil points. Absolute fuckers. I went in tears to the teacher and said 'I told you that would happen' and she blanked me. \n\nStand your ground, don't let him perform anything if he's uncomfortable. It messed me up for years.", "NTA.\n\nShe *is* a bully and we need to stop protecting them. Bullies deserve some payback and what you did was right. Children‘s boundaries matter more than a teacher‘s wish fulfillment.", "I'mma go with NTA. Your son quite clearly said 'no' multiple times and this situation is probably going to make classes with that teacher a bit awkward now (her fault, not his). However, I do think the whole 'put her on check' comment was unnecessarily threatening. You got your point across, no need for threats.", "NTA. Don’t bully kids and you won’t get called a bully.", "NTA\n\nYour son said no she should have respected his boundaries. I think \"unsafe\" is a little melodramatic. Not respected, not listened to\n\nHowever if you keep trying to force a child to do something they don't want to. If you throw your weight and authority around for your own benefit then you are being a type of bully", "INFO:\n\nDid your son actually feel unsafe or did you think that would come across better than saying it pissed him off?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEvery other weekend for the last few years, my 11yo son and some adult family friends perform on a promenade for tips. They discovered that if you put a really cute kid (my son) in front of a bunch of boomers and millennial tourists and sing songs from the 90s and 60s like Nirvana or Doors then they'll throw money at you.\n\nA teacher from my son's school saw him and told him he should perform in the school talent show. My son said no way. It's one thing to perform in front of people you don't know and never will see again and then in front of your classmates.\n\nLong story short,  this teacher kept badgering him until my son snapped that he didn't want to be a part of her stupid dumb show. \n\nShe tried to get him in trouble over his response until I got involved. I told the VP and my son's homeroom teacher that my son now feels harassed and \"unsafe\" around this teacher. \n\nThat led to a mediation where the teacher said that she was under a lot of stress putting this show together and there was a lack of talent. That's why she kept asking my son. I told her she was a bully and that caught her off guard and she started to tear up but she apologized which is all she needed to do. The VP and my son's homeroom teacher told me that my comment was out of line. I said if they won't put her on check then I will. She started this by pressuring my kid and all I did was end it. They should be thankful to me because she won't do it again to other students.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. She had it coming. She wanted to pressure your son into a show for the purpose of money. That’s garbage behaviour.", "NTA. The teacher fucked around and found out. You stood up for kid as a parent should. When a kid doesn’t want to do something it shouldn’t be forced onto them. Good on you for defending your son.", "NTA. Talent shows sound like an excellent way to scar children for life who do not want to perform in them.", "NTA", "NTA. He said no.", "NTA", "NTA. Teacher fucked around and found out. No one wanted to tell her anything about it so you stepped in and did. “Lack of Talent” shit doesn’t give anyone the damn right to be harassing a child.", "NTA, lol no\n\nshe wouldn't cry if you were wrong", "ESH\n\nShe shouldn’t have asked your son more than once.  Point taken.\n\nBut “put her on check?”  Wtf does that mean?  Sounds like a threat to me.  Awfully extreme for the situation.\n\nAnd your son performs with adults for tips?  Like out on a street?\nWhere I’m from, that’s panhandling.  Pretty sketchy.", "\"Unsafe\" - INFO please", "NTA\n\nBut there was no point in calling her a bully. You could've just said that you don't want her asking your son anymore and that would've been the end of it. No need to call someone a bully and make that person cry because she's under so much pressure. Being a motivated teacher is very hard.", "YTA \n\nThe teacher isn’t bullying him, she’s pressuring him. It’s not okay but it’s also not the same as bullying. She was apologetic and instead of handling it with grace YOU became the bully.\n\nNTA for being upset and sticking up for your child but YTA for how poorly you handled it.\n\nTeacher is also an asshole so I guess this is more of a ESH situation. \n\nAlso, congrats, now the entire administration is going to dislike you and if you think that won’t affect your son down the road you’re delusional.", "ESH, I’m curious why you put “unsafe” in quotes, as from an outside perspective, he wasn’t unsafe at all and you chose to weaponize v specific language to make the situation seem much more dire than it was. Actually, after typing all of that out, it feels much more YTA. You sound like “one of those parents” (and we’ve all met ::those:: parents)", "**EDIT**: With the way OP wrote her post, it seems the teacher got OP's son in trouble for ***the way he disrespectfully spoke to her.*** She did not try to get him in trouble for not participating in the talent show. This is an important distinction.\n\nYTA\n\nIt's not clear the teacher was bullying your child. All she did was try to encourage him to participate in the talent show, which is something a good teacher should do! I'm not sure what you mean when she \"kept badgering\" him. You mean she asked him multiple times then and there? Or she asked him over a few days? Was she mean about it? (INFO)\n\nIt honestly sounded like the teacher was simply overenthusiastic and unknowingly annoyed your son. I worked with kids for many years, they can often be shy! A lot of them actually *want* to perform, go to the blackboard, etc. when asked. But they say no due to lack of confidence. Teachers are supposed to encourage students to come out of their shell, they wouldn't be doing their job if they didn't.\n\nYes, boundaries are important. And yes, if your son ultimately decides no, that should be respected. But it honestly sounds like your teacher misread the situation. She thought your son needed encouragement. She's probably thinking: \"Oh he clearly likes to perform on the promenade! Maybe with a little encouragement, he'll feel comfortable sharing his talents with his classmates. :)\"\n\nThat's hardly a bully! She misunderstood, she didn't target your kid on purpose.\n\nAnd your son *snapped* that \"***he didn't want to be a part of her stupid dumb show***\"?! That was SO uncalled for from an 11 year old. How does an 11 year old become comfortable speaking to their teacher that way?? 11-year-old me would NEVER. And I had no problems standing up for myself at that age.\n\nYou should be teaching him to be polite, even when he's being firm about his needs. I have no doubt that you're the bully and that he learned his behavior from you.", "Your son \"snapped\", yikes. \n\nAnd you want the teacher to be in trouble.\n\nYTA. Massively.", "NTA at all. You called it as you saw it. She asked and your son not only said no but also gave a reason, which he didn’t have to do. She then kept pushing it. In the adult world, that would probably count as some form of harassment.\n\nAlso, I can see where your son is coming from. He has to go to school with these kids day in and day out. He knows what they’re like and made a judgment about not wanting them possibly ruining his hobby/something he enjoys.", "NTA- NO MEANS NO. End of story.", "NTA. \n\nI’m surprised by how many people don’t see this as a form of bullying. Maybe subconsciously some people don’t think a child has the right to be autonomous in any situation. While there are plenty of things a child can’t have the final decision in, we should be teaching kids that there are times it’s good to say no to adults \n\nIf this has taken place between two adults at a workplace, one in a position of authority, I think there would be less question as to if it was bullying. \n\n\nLike if a supervisor constantly badgered an employee to participate in a talent show, and then, after politely declining numerous times on different days, the employee eventually was like “stop asking I don’t want to be in the dumb talent show!” And after that the supervisor tried to get the employee in trouble for their response? \n\nI googled the definition of bullying:\n\n“seek to harm, intimidate, or coerce (someone perceived as vulnerable).”\n\nShe, an adult in a position of power, wouldn’t take no for an answer when an 11 year old didn’t want to participate in a voluntary activity. \n\nAnd she didn’t do it bc she thought it would be good for him. She did it because she needed more participants for her talent show. \n\nI don’t think the teacher did it maliciously. She was stressed and I’m sure organizing the talent show doesn’t give her extra salary.  But just cause it wasn’t done maliciously doesn’t mean it wasn’t wrong. \n\nAnd when confronted the teacher tried to justify her behavior. It wasn’t until she was called a bully did she apologize. \n\nIf she had just apologized first thing for her behavior, OP may not have called her a bully.", "I feel for you. Getting pressured into something you don’t want to do/be a part of is one of the worst things when you’re that age.", "Teaching a kid that no means no requires backing it up. Agreed NTA.", "How about ESH rather than NTA? How is her threatening any better than the teacher's behaviour?", "That's just stupid logic in general. Anyone who cries is automatically on the \"wrong\" side of any argument? lol okay", "Oh, chill out. Myself and a friend used to play duets (flute and piano) in a picturesque tourist city near us if we needed money. Our parents took it in turns to check in on us every hour or so while they had a day out. It's very different busking for passing strangers opposed to your school friends, believe me.", "What my son does is completely wholesome and he loves spending most of the money buying pet toys, food and supplies and taking them to our local animal shelter.", "Where I am from it's called busking and is completely acceptable. He is not doing it alone there are adults with him.", "This is also my answer. Like everyone in this situation did something uncalled for- his son snapping, the teacher for asking multiple times, him calling the teacher a bully. Definitely ESH!", "He shouldn't feel anxiety at school because he's scared that this teacher who he barely knows will corner him and tell him to sign up for something he does not want to. It's not like a peer where he can tell her to fuck off so he feels like he has to deal with it.", "A pretty good way to not be called a bully is to not be a bully.", "ESH then", "This needs to be at the top, well said!!", "She wasn't the AH until she tried to get the boy in trouble with the school for not agreeing to be in the talent show. Seems like you sort of missed that part.", "Do you have an 11yo boy?", "she was harassing him  by asking multiple times about this talent show, once is enough. op is not ta.. if i was in her sons position when i was that age i would have felt uncomfortable, i don't know about you?", "She didn’t make any threats. At all.", "As said below, the teacher didn't make any threats. I don't think OP is TA but threats trump badgering about school talent show every time.", "You're right, so why not just make that your argument instead of intentionally exaggerating what actually happened? I'm failing to see how that is supposed to help teach your son how to solve these kinds of problems (and trying not to read into the idea that you'd otherwise encourage your 11-year-old to just tell them to fuck off, which is also not a way to solve that problem).\n\nI guess what I'm wondering is whether you're trying to teach your kid how to approach these problems in a way that gets them fixed or how to retaliate toward someone who pisses you off.", "Ok, ESH then. She for pressing too hard (though I still don't see bullying or unsafe behaviour here) and you for overreacting.", "> *\"It's not like a peer where he can tell her to fuck off so he feels like he has to deal with it.\"*\n\nWhy encourage your son to \"handle\" situations in such a confrontational way like this? Your son is obviously talented, so people will naturally encourage him to share his talent with others. \n\nI agree that the teacher shouldn't have continued to ask him to join the show after he told her he didn't want to, but I think it's equally lousy of you to encourage him to lash out and tell others to \"fuck off\" if he gets frustrated. Why promote having such an aggressive attitude like that? You are being super dramatic and blowing this whole situation out of proportion. I don't think it's any great accomplishment to call someone else names and make them cry, even if you are annoyed with them. You could have communicated your stance in a far less antagonistic way. \n\nESH, except for your son because he's just a kid.", "What definition of bully are we looking at here?", "No, she reported him to the VP for his response when he lashed out at her, not because he didn't want to be in the show.", "I didn't miss anything. She got him in trouble for the disrespectful way spoke her. Notice that OP was careful to say that she got him in trouble for \"his response\"\n\nI mean he yelled at his teacher, that has consequences (maybe not in OP's world)", "I have way more experience working with kids for 15 years.\nI see where your son learned to deflect. You're doing it to me now.", "Anyone who \"snaps\" must pay the consequences.\n\nYour child is deflecting the attention ftom him snapping by turning your attention toward the teacher. And you are falling for it. Your son knows you well.", "She is in a position of authority over the boy. Continually pressuring him when he said no multiple times is bullying. She is harassing him. No means no. An adult should understand that.", "he's 9???? come on now, also he barely 'snapped'. he was fed up of being constantly asked about the same thing and he reacted in the same way most people would. he's 9 years old.", "Doesn’t even really seem like he snapped… I’d call someone’s talent show dumb if it was the billionth time I’d been asked after making my stance clear as well", "You owe the teacher an apology."]}