{"id": 10467, "submission_id": "117bo6f", "title": "AITA for not want to trick my friend into going to the psych ward", "selftext": "\nA group of us (25-35) are on a trip at a high altitude. One member has not been able to sleep since we got here 3 days ago because the altitude is messing with him so he is obviously having some psychiatric problem (anxiety, depression) however he is not a danger to himself or others.\n\nHe feels better when we go into town at a lower elevation. He would like to go back into the major city which is an entire mile lower, rent a hotel and get some sleep. Altitude sickness is know to cause sleeplessness. \n\nMy friends (who are not bipolar, have no medical training, and have never been to a psychiatric hospital) are allowing him to think he's going to the major metro.\n\nHowever they have called EMS to emergency room with a psych department 20 minutes away with a similar altitude without telling him. \n\nThey think from talking to relatives (with no bipolar experience, he is having a bipolar episode and needs to go to the hospital).\n\nI have insomnia and bipolar. I have minimally slept since we got here. I have had conversations with my friend and he shows no sign of a manic episode - he is obviously depressed and stressed and over tired.\n\nI have been admitted to a psych hospital multiple times and he's not nearly that unstable. In fact, i have so much stress over psych hospitals that it makes it wpse. None of my friends have ever been in a psych hospital.\n\nAiTA 1) thinking he needs to be told what is going on instead of being ambushed and 2) trying to get him a hotel at a lower altitude so he can sleep?", "created_utc": 1676909496, "permalink": "/r/AmItheAsshole/comments/117bo6f/aita_for_not_want_to_trick_my_friend_into_going/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1)AM i the asshole because I think my friend should know what's going on?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and your friends are out of their minds. They want to traumatize a man who just needs sleep.", "NTA - your friends are AHs. Shouldn’t spring the psych ward on someone especially in a situation like this. If he is having a psychiatric episode, it won’t go away at the lower altitude obviously and then you can reassess his needs. People just want drama", "NTA\nHe just has altitude sickness and needs to get back to a lower elevation and some rest.  A medical checkup is certainly a good idea. But don’t trick him into some sort of psych institution.", "Legally I don't think they can check him into a ward without his consent.\n\nNTA advocate for your friend.", "NTA but your other friends are going ro lose a friend if they ambush him with this. Especially if it's just that he needs sleep from lack of it due to the altitude.\n\nAre you all up there for an extended stay or something?\n\nA medical checkup may be a good idea because you never know but if he's not a danger to himself or others then he needs to be told what they are planning and a recommendation that he does get a check up anyways for his own health and safety. Just in case, but ultimately It should be up to him", "I live in a high altitude city, has he tried to drink water? Not joking, my friend is a doctor here and says a lot of people that get altitude sickness and delirium is due to being dehydrated, that since we’re high up, heart rate is 2.5x the amount it is at sea level. Also NTA because he needs to know", "Altitude sickness sucks.  As someone who gets it at a depressingly low altitude, I'm sympathic.\n\nI'm not a doctor, but my understanding is that the first fix for altitude sickness is to descend.  Why have people let him suffer for three whole days!?\n\nI mean, presumably the high altitude hospital will be used to dealing with altitude sickness, and whatever weird side effects it might have, but even without the possibility of winding up on the pysch ward, isn't this going to be a waste of money and resources, versus putting him on the bus to the major city (hopefully with a friend who can verify that he is in fact okay)? Presumably there are psych wards down there, too, if he keeps showing the same problems after getting some sleep?\n\nNTA for being concerned about this.", "NTA. A ward is not anything anyone should be \"tricked\" into.", "NTA. Your friends are grossly violating his privacy and autonomy. Tell him straight away.", "NTA. Your other friends are the ones that sound unhinged. I mean they had him \"diagnosed\" over the phone by their relatives or from stories? If they tell that in the psych ward I am guessing they would be the ones asked to stay...Tell your friend and help him to get to the hotel and away from the altitude and the crazy of his \"friends\"", "NTA. Without more evidence of an actual mental health crisis, this sounds like lunacy.\n\nWhoever the ringleader of this little caper is, they need to stop playing amateur psychologicist and do what he is expecting.", "Altitude sickness is a real thing and definitely getting him to a lower altitude is important. I’d hope once the hospital sees your friend for themselves that they’ll recognize this is a case of Altitude sickness. Right now they are going by the reports from your friends and who knows what they are saying.\n\nTell EMS what you observed and encourage the sick friend to also report the truth of no history of mania and this all started at higher altitude. Also call friend’s family so they also can advocate for them\n\nNTA", "INFO: EMS is on the way to take your friend to a psych ward without his knowledge and the best thing you can think to do is post to Reddit?", "NTA Protect your friend from those idiots. He does not need a psychiatric hospitalization in his record. It can prevent him from getting jobs. Get him away from them now before they ruin his life.", "NTA to want to tell him or let him get a hotel.\n\nIf someone isn't actually a danger to themselves or others it's not appropriate to send them to the psych ward. I would cut off family over something like that.", "NTA Tricking someone to go to a psych facility just because they're 1. have a chemical imbalance and 2. are quite possibly suffering from just that... altitude sickness is a bit radical. Although the group you're with may be well-meaning looking out for your friend's welfare, perhaps convince them they may be jumping the gun. Though, the only way to be sure is a diagnosis. But, that should be done at a doctor's office, not a psych facility. Let him go a hotel at a lower elevation, explain to them how you feel it's unnecessary at this point and it would negatively impact him if they trick him into this. If your friend is still unwell at a lower elevation, then you should consider their alternative.", "NTA\n\nYour friends are major, major ones though and have no idea how any of this works. It's incredibly difficult to get an involuntary hold on someone. Chances are the psych hospital wouldn't keep him anyway seeing as he's not a danger to himself or others. They're grossly ignorant as to mental health care.\n\nTell your friend what's going on and just get him to the lower altitude. Your other \"friends\" can kick rocks.", "NTA: altitude sickness is real and it's unpredictable who it hits. I have no history of any type of mental problems and I can't deal with high altitude. Even if you mean going down to Denver (5280) from, say Estes Park (7523), that may not be enough. When I did that trip I didn't feel good again until I was back in the Ohio valley where I lived at the time! Even changing planes once in Denver was tough for me.\n\nMeanwhile my wife, who gets dizzy spells at sea level, led a service trip to Bolivia without a hint of a problem!", "NTA don't let them lock him away in psych ward without his consent", "NTA, if he's having altitude sickness and can't sleep, he should definitely go down to a lower elevation. And drink plenty of water. \n\nI absolutely understand you wanting to advocate for your friend, but you aren't his doctor or psychiatrist, and you can't be the one who determines if he is manic or not. Your own experiences might not translate to your friend. I think the best thing you can do is encourage him to reach out to his own psychiatrist right away.\n\nMaybe it isn't the worst thing if your friend does go to the hospital. Not only could he maybe get some hydration, which could help him feel better, he will get to talk to an actual medical provider who can provide an unbiased assessment of his mental state.", "YTA -- for the simple reason that you acknowledge that your friend has been having a medical emergency for several days while you're on your \"trip,\" is obviously not capable of caring for himself, and not doing something to help him sooner. None of you are doctors, and obviously he's having either a psychiatric or medical problem because of the altitude and needs at least to get out of the altitude for more than just trips into town. You're all assholes for putting your trip ahead of your \"friend's\" well-being.\n\nEdit: NTA upon further explanation. Everyone else sucks though.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nA group of us (25-35) are on a trip at a high altitude. One member has not been able to sleep since we got here 3 days ago because the altitude is messing with him so he is obviously having some psychiatric problem (anxiety, depression) however he is not a danger to himself or others.\n\nHe feels better when we go into town at a lower elevation. He would like to go back into the major city which is an entire mile lower, rent a hotel and get some sleep. Altitude sickness is know to cause sleeplessness. \n\nMy friends (who are not bipolar, have no medical training, and have never been to a psychiatric hospital) are allowing him to think he's going to the major metro.\n\nHowever they have called EMS to emergency room with a psych department 20 minutes away with a similar altitude without telling him. \n\nThey think from talking to relatives (with no bipolar experience, he is having a bipolar episode and needs to go to the hospital).\n\nI have insomnia and bipolar. I have minimally slept since we got here. I have had conversations with my friend and he shows no sign of a manic episode - he is obviously depressed and stressed and over tired.\n\nI have been admitted to a psych hospital multiple times and he's not nearly that unstable. In fact, i have so much stress over psych hospitals that it makes it wpse. None of my friends have ever been in a psych hospital.\n\nAiTA 1) thinking he needs to be told what is going on instead of being ambushed and 2) trying to get him a hotel at a lower altitude so he can sleep?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA  tell him or take him yourself to a lower altitude.", "NTA. You need to be honest with your friend. If you do otherwise, you are a crappy friend. I don't see why it's a big deal to take him to a lower altitude.", "NTA\n\nThese people are so uneducated on the topics at hand, they need to not be making such drastic claims. There’s an obvious reason why he’s acting strangely, get him to a place he’s physically more comfortable, and let him rest. Having him committed and possibly medicated with things HE DOES NOT NEED is obviously not going to help the situation.", "NTA\n\nThey aren't qualified to judge his condition, and not his guardians.   What they are planning is a gross violation of his autonomy.\n\nCurrently dealing with a friend that somebody decided needed to be in the psych ward.  No idea who made that call.  It's a long story, but, basically, he and his daughter ended up homeless, living in a motel for a few months.  Daughter died two weeks ago, and it was pretty horrific for him to witness.  Plus, he's 97, and just lost his wife and younger sister within the last couple of months.\n\nFucking mess.  I'm just a bystander,no legal leverage, although I'm supposed to talk to his case worker this week.  He doesn't belong in there, he's still sharp, and he's not suicidal, he's overwhelmed with grief.\n\nMyself and another friend have been visiting him and looking out for him, and, to be honest, it's not terrible in the ward.  But it's pretty traumatizing for him.\n\nYou're a good person looking out for your buddy.", "NTA but please tell your friend what is going on and please - without telling these creepy other people - arrange to get your friend transported to the lower altitude places he wants to be and needs to be. That's just a really creepy betrayal of trust. It's so bizarre that it makes me wonder about their own state of mental health if they think that tricking somebody and having them taken to a psychiatric unit of some sort is a good idea, when there is from what you say, no reason for it whatsoever.  Warn this poor person and get him to lower altitude ASAP please. You will be glad you did and so will he.", "NTA but you're gonna be if you don't tell your friend what's going on and try to put a stop to this nonsense.", "1: NTA, he absolutely should be told what is going on instead of being ambushed. He should be taken to an emergency room, and a medical professional should advise a course of action. If he refuses to go, then you need to make a judgment call if he is capable of making a rational decision.\n\n2: YTA It seems none of you are medical practitioners with the ability to evaluate his condition, so you should err on the side of caution. Sending him to a hotel room alone could be dangerous, and if his condition deteriorates he may be completely unable to take the steps needed to take care of himself. Honestly, ESH - if you have a friend having a medical crisis, it might mean compromising your trip. Someone should go with him to look after him and his care.", "NTA The most likely diagnosis is altitude sickness. A lower altitude and a good nights rest at a hotel will work wonders. If it doesn't, then is the time to be looking at a further diagnosis.", " \n\nThey plan and recommend that he get checked up anyway for his own health and safety.", "No, they can't do so legally. The cops/hospital have the ability to put him on a hold involuntary but I don't think they do the involuntary thing willy nilly. It can be a pain to get out once you get in though.\n\nProbably they'll let him go once they realize nothing is actually going on. And then he'll never speak to this friend group again.", "There are certain situations he can be held against his will but he doesn't meet the criteria.", "Legality of involuntary inpatient psychiatric stays vary by region. In general, it has to be a police officer, medical provider, or judge who involuntarily commits someone. But just calling 911 on a friend of yours doesn't necessarily involuntarily commit them. If it gets them in contact with a police officer or medical provider who has a safety concern and places an involuntary commitment, that's the only way.", "It would depend on the situation (e.g. if he was self harming) but it's highly unlikely he could be forced in this situation. Normally a medical power of attorney would make such a decision if he was incapable of doing it himself.", "We're here until Friday. I agree on the medical check up but not the ambush.", "Honestly, I didn't know about this until very late as night early this morning as I would have suggested moving much sooner. I know how badly no sleep. And altitude can fuck with someone.", "I already confronted my friends about it and they said I was wrong. I've been know to under react so I wasnt sure.", "We're at 10k and would bring him to 5k where he wasn't having issues. I figured it's work a try since he feels better at 8.5k it might not be enough but was worth the attempt.", "I'm not against medical help. I'm against the ambust.", "If this happens in the US it could absolutely be the worst thing. I had someone call 911 once to help me & it ended with me over $3000 in debt and getting abused at the hospital. If they keep him admitted longer than his vacation is supposed to be, OP’s friend could also lose his job and thus lose any health insurance he had, making his stay out of pocket for potentially tens of thousands of dollars.", "His friends don't have any medical training either, yet they are conspiring to get the friend to psych ward without even asking if that's what he wants? Moreover they are actively deceiving him by letting him think he is simply going back to hotel to sleep.", "I don't think you understand. I am advocating for getting him to an altitude here he doesn't have issues and seeing if it revolves in a few hours BEFORE taking him to an ER. I didn't know about any of these problems until this morning. So, no I have been prioritizing the trip. Those who knew have been.", "I dunno.  I have a friend who just go put on a 90 day stay in teh psych ward, and I can't get anybody actually tell us who made that choice.", "your friends would be awful to do that to him if he hasn't shown any signs of being manic", "Go with your gut on this one then. Let your friend know. He will not be appreciative of being ambushed into a psych ward. YOU are NTA. Ambushing friends need to rethink this", "From your other answers, it sounds like you're in the US.  If so, you're talking about a serious expense to get an ambulance ride to the hospital versus a bus or whatever to lower altitude and a night in a hotel.\n\nThis is stupid.\n\nIf people care enough about their friend to chat with his family and arrange this little ambush, don't they care enough to drive an hour, check him into a hotel, and hang with him overnight to see if this fixes it?\n\nUnbelievable.", "And with the word \"trick\" in your title, you're expecting objective responses?", "You sure about those numbers (unless you mean feet, not Kilometers)? Mt Everest is under 9k.", "Completely reasonable.", "Right. They should show some actual concern and take him to a hospital for treatment, rather than trying to get him involuntarily hospitalized at a psych ward so it doesn't interrupt their trip. They sound like a nice bunch of dudes.", "Ok. Your first paragraph makes it sound like you've taken trips into town, he feels better, and then you go back to high altitude. If you didn't know, then NTA.", "When someone shows up, or is dragged there, a doctor of some sort would do an eval. Some medical professional made the call to keep them there that long. I think a court or cop could force someone to do an eval but a person wouldn't be forced to stay if the doc says things are fine.\n\nPeople can stay voluntarily as well. Either way they'll probably get a bill and problems with their job.", "They think he has because he got upset by something they said that was offensive.", "Well, yes. It's being upfront or ambushing him. My friends all think the ambust is correct because they don't know how he will react since it's not what he wants to do and it not what they told him they were going to do. Maybe I'm completely wrong in thinking this is not ok.", "10,000ft. sounds like leadville, CO.", "So, our airbnb is at abhigher elevation, which is why it gets worse.", "wow, so they say something offensive, he gets rightfully upset and then they go \"hmmm since you disagree with us, you must be mentally ill. Mental ward for you.\" jeeeez", "Your friends are major AHs. With friends like these who needs enemies?", "OP, do they know about your diagnosis? I don't think these people are trustworthy and you should not be traveling with them.\n\nIf you are international you might want to send a quick message to your in country embassy that your friends are acting oddly and talking about having your friend committed and give the embassy the name of the hospital.", "That is my exact fear! Someone who doesn’t need to go to a psych ward is obviously going to have a really bad reaction to be tricked/manipulated into going to one against his will. He might act very upset and start to present like someone who is delirious or not in their right mind and get admitted and medicated. If a bunch of people go in there saying he’s bipolar and then he acts erratic, I’m afraid the doctors may not see through it right away.", "You certainly know that being tricked into going into a psych ward is bad. I'm pretty sure you understand informed consent and there's nothing in your post suggesting that your friend is so incapacitated that he's unable to consent, nor do you suggest he's a danger to himself or others?\n\nSo why aren't you doing the right thing - talking to your friend - rather than gathering affirmation on Reddit?", "Ah, 10k feet, those are Colorado altitudes the major city (Denver) is just over 5k."]}