{"id": 10522, "submission_id": "117y1dg", "title": "AITA for asking my parents for their entire estate if they want me to be my sister's guardian.", "selftext": "I (F23) have been told my entire life that if anything happens to my parents I will be my sister's guardian. She is 33 and has some disabilities. She is currently living in a group home. The government pays for a good portion of the cost but not all.  My parents have made sure that they have accessed every resource available for her to make sure she has as good a life as she can. \n\nI was we were visiting her this last weekend when they brought it up again.  They are both reasonably healthy but they both had health scares in the last couple of years.  They once again said that I would be her guardian.  \n\nI have been giving this a fair bit of thought. I have two older brothers. They are both married and established in their careers. They would be better choices than I am.  \n\nI want to go see the world. I am lucky enough that my job can be done from anywhere that I can access the internet.  \n\nWhen we went sort dinner I brought it up and said that I had three ideas.  \n\n1. They make all three of us her guardians so we could split the responsibilities and duties. \n\n2. They leave their entire estate to my sister in a trust that will oversee her care. \n\n3. They leave me their entire estate with the proviso that I become her sole guardian and take full responsibility. Minus sentimental stuff for the rest of my family obviously. \n\nI thought that was fair since it's not like they are rich and their estate will mostly consist of their house and the insurance policies they took out when they realized the long term costs of care for my sister.  \n\nThey said that I'm trying to shirk my responsibility to my sister and that I'm greedy for trying to get everything.  \n\nI had one last suggestion and they really hated it.  I said that they were welcome to cut me completely out of their will.  But that had to include guardianship of my sister.  They could leave everything to her and my brothers but that meant I would be completely free of responsibility for her care.  \n\nMy dad got really angry and my mom was crying when I left.  \n\nMy brothers both called me to say I was being an asshole springing this on my parents. And that I was being greedy trying to keep them and their families from getting anything when our parents pass away.  I asked both if them if they wanted 100% responsibility for our sister in return for the entire estate. I volunteered to sign away everything to them.  Neither one took me up on the offer.", "created_utc": 1676966462, "permalink": "/r/AmItheAsshole/comments/117y1dg/aita_for_asking_my_parents_for_their_entire/", "score": 57, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My sister requires long term care. My parents want me to be her sole guardian if anything happens to them. I might be the asshole because I asked them to make me the sole beneficiary of their estate in return.  They think it's unfair to cut my brother's completely out of the estate but not the responsibility.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nLove how your brothers are mad because you're calling out this sexist BS\n\nSo your parents want you to put your entire life on hold to care for your sister with no actual benefit?? Why would you do that? I mean yes it's not your sisters fault but it's also not your fault. Split 3 wayz is fair", "NTA \n\nSo your brothers want a third of the estate but you do all the care! Because you’re the female!\n\nPffftttttt\n\nStand your ground.", "NTA - your parents sound like they had your whole life planned out for you so you couldn’t even hope to live it for yourself. I’m so sorry. I would suggest going NC, you deserve to see the world and what you can contribute to it. You aren’t a spare caregiver, you’re you, and that’s the only identity you need.", "NTA. If your brothers think it's unfair for you to receive everything they should be jumping at the opportunity to get everything. That's the sign of a really good deal. If someone would take it from you. Your parents are kind of AHs for dumping all of this on a young woman.  Not that you couldn't handle it. Just that it's not fair when there are other family members that could help. You sound pretty grounded though. And willing to advocate for yourself. I hope you have a great life. Good luck with this situation.", "NTA\n\nYour last few sentences say it all. They wouldn't do it even if they got the estate. Don't let them guilt you into doing more than any of them are willing to. Live your life.", "NTA— you came up with very reasonable options and they are trying to put this on you, and using emotional blackmail to make you feel responsible. Why are your brothers not considered equally to take on this responsibility? Maybe there is some sexism to this too, where the “woman” takes care of the disabled sister. Do not let them out this on you.", "NTA. Your parents have no right to just dump such a big responsibility on you with nothing in return. Your terms were very reasonable. Taking care of a disabled person usually means your whole life revolves around that person. It will suck, and there's no reason why it should suck for you in particular and not for either of your brothers. Fight for your interests. Don't get talked into sacrifice.", "You had three different suggestions. If they only focus on the last one, it's a \"them\"-problem. Clearly, your parents and brothers want you to take all responsability without asking for anything extra in return. If I were to guess why they're assuming you'll just put up with this, it's because you're a woman. \n\nGood for you, that you're standing up for yourself, and point out that there are multiple options for your sister's care. NTA.", "NTA, your sister is not your responsibility and it's unfair of your parents to expect that of you. Even if you are noted in the will as her guardian, you aren't legally obliged to and can refuse.", "NTA your ideas seem perfectly reasonable to me.", "NTA and honestly, just remove yourself. Don't even give them a choice at this point.", "\nNTA for being forthcoming about what your sister and your parents assets mean to you. You (or whoever looks after her) should be compensated for spending the rest of their life looking after your sister. The fairest one would just be to put it in a trust, your sister gets looked after and then hopefully you make the time to visit her a couple of times a year.", "NTA. You are being treated very unfairly. Why is it assumed that they can tell you what to do with your life, but not your brothers? Unbelievable.", "NTA, all your ideas were fully reasonable and there is no reason for you to sacrifice your life for your sister. Your brothers are the greedy AHs here, because when you showed your willingness to give them all the inheritance coupled with the care,  they declined. They would want the money but not the responsibility. Shame on them.", "NTA. Your parents and brothers are hoping to take advantage of you and your generosity. Please live your life to the fullest and travel as much as possible. Don’t let your A-H family shrink your world.", "NTA\n\nThe ages suggest that the entire reason they had another child was to take care of your sister (sorry to sound so blunt). The fact that you’re a girl is just another reason - but they told you this all your life in hopes you’d accept it.\n\nStand your ground and be firm on this - your choices are all logical and fair. This is a huge responsibility for anyone to take on and it’s not unreasonable that any finances available are used to support your sister and her guardian - whether that be you or somebody else.\n\nTo be clear as well - you are not trying to shirk your responsibility because you do not have at this time a responsibility to your sister. Your parents have a responsibility to her - but you do not. You are negotiating what it would take for you to assume that responsibility. \n\nI think it’s worth also informing your family what you will do in the event they try to force your hand by, as an example, splitting their estate 4 ways but stating you are to be her guardian - look into options. I would presume that they cannot legally make you her guardian without her consent - so you need to be clear that if they stipulate it in their will as a preference you will not comply and will not do it and that leaves her more vulnerable because there is no a plan in place", "NTA, sounds like your parents had you for the sole purpose of taking care of your sister if something happens to them.", "NTA. OP, you gave three great suggestions. It seems the rest of the family overlooked your first two suggestions and fixated on the last one. They suck. Not you. I feel bad for you and your sister.", "NTA. You're not responsible for your sister. You're 23. Live the life you want", "NTA\n\nAnd I don't believe you can be compelled to accept guardianship of your sister, by the way. Your parents are in fairyland, thinking they can pass this enormous responsibility to you - the youngest sibling with the fewest resources - just because you're the girl. \n\nIf none of the siblings want to accept guardianship I think your parents should will a substantial portion of their assets in a trust overseen by a financial guardian to provide for your sister, and everyone agrees who will have power of attorney for major decisions, medical care etc. Whatever is left can be divided between the rest of you.", "NTA. Its perfectly reasonable. You've offered them options, and I wish you luck in standing by your boundaries, regardless of what they choose.", "NTA and enjoy travel and see the world.", "Nta time to go and see that world and settle down somewhere far away!", "NTA and that's a really unfair position to put you in. I say this as someone who had a much younger brother with disabilities and even though I was a lot older it was still a lot and I'm not sure what I would have done if he had survived my mother. I loved him very much but it's basically giving up your life as you know it.\n\nI think the best option would be for her to continue her quality of life as is, in the group home, and all the siblings look after her to make sure she's always cared for by visiting and making sure her care is paid for. For that to happen I think a trust is a great idea. It allows all of you to continue your lives without undue burden and peace of mind for then that she'll be cared for.", "NTA\n\nYou don't have to be her guardian. You have good intentions, but this is a decision to be made as a family.\n\nBut for all that is good and right this is WAY above Reddit's pay grade. Your parents need to seek professional advice from a lawyer. Screw this up and things could get very financially precarious to cover the care for your sister.\n\nCome up with the outline of a few options with legal advice. Then talk it all over with your brothers' input too.", "NTA. Fuck giving up your life. Look into how to decline guardianship. Nobody gets to put that strain on you.", "NTA.. what a sucky situation to be in. Do what is best for you. Your sister is your parents responsibility. You were honest and you gave them options. They said compromise was not an option. Go live your life.", "nta - understand this:\n\nYOUR SISTER IS NOT YOUR RESPONSIBILITY IN ANY WAY.", "NTA and your offers were totally reasonable. Pretending you’re being greedy is pretty much gaslighting at this point.", " NTA & stick to your guns. Not only is your family sexist & misogynistic thinking because you're young unmarried & not yet interested in kids that means they can shove your sister down your throat. You're going to set some life boundaries now you'll have to stick with. Because if and when you do decide to start your family they'll expect your sister to become your top priority still! You're her sister not her caregiver! If they want one they can either hire one or set up a trust for one after they pass! Tell them they can either accept your terms or leave her to the care of the government after they pass", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (F23) have been told my entire life that if anything happens to my parents I will be my sister's guardian. She is 33 and has some disabilities. She is currently living in a group home. The government pays for a good portion of the cost but not all.  My parents have made sure that they have accessed every resource available for her to make sure she has as good a life as she can. \n\nI was we were visiting her this last weekend when they brought it up again.  They are both reasonably healthy but they both had health scares in the last couple of years.  They once again said that I would be her guardian.  \n\nI have been giving this a fair bit of thought. I have two older brothers. They are both married and established in their careers. They would be better choices than I am.  \n\nI want to go see the world. I am lucky enough that my job can be done from anywhere that I can access the internet.  \n\nWhen we went sort dinner I brought it up and said that I had three ideas.  \n\n1. They make all three of us her guardians so we could split the responsibilities and duties. \n\n2. They leave their entire estate to my sister in a trust that will oversee her care. \n\n3. They leave me their entire estate with the proviso that I become her sole guardian and take full responsibility. Minus sentimental stuff for the rest of my family obviously. \n\nI thought that was fair since it's not like they are rich and their estate will mostly consist of their house and the insurance policies they took out when they realized the long term costs of care for my sister.  \n\nThey said that I'm trying to shirk my responsibility to my sister and that I'm greedy for trying to get everything.  \n\nI had one last suggestion and they really hated it.  I said that they were welcome to cut me completely out of their will.  But that had to include guardianship of my sister.  They could leave everything to her and my brothers but that meant I would be completely free of responsibility for her care.  \n\nMy dad got really angry and my mom was crying when I left.  \n\nMy brothers both called me to say I was being an asshole springing this on my parents. And that I was being greedy trying to keep them and their families from getting anything when our parents pass away.  I asked both if them if they wanted 100% responsibility for our sister in return for the entire estate. I volunteered to sign away everything to them.  Neither one took me up on the offer.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yes, that’s what I wanted to say. Guardianship of a disabled adult in a will is similar to parents designating caters for minor children in the event of their death- people can put it in their will but it isn’t legally binding, no one can force you to do it if you don’t want to or are not physically or financially capable of it.", "NTA. You have no responsibility to your sister. The responsibility belongs to your parents. Don’t let them foist it on you.", "Wow so weird. I am in a similar spot with my twin brother, parents and older brother. They want everything split equally with me taking on my brother full time. \n\nAnd I’m starting to realize the time and money commitment this will be. So I agree with everyone else, NTA, stand your ground. And do it before it’s too late.", "NTA. For so many reasons but mainly because your goals, dreams and life matter too. Guardianship is a big responsibility and it should not be pushed upon someone", "ESH, you're 1 of 4 kids and openly notioned that you take all the money. Not only is it not your decision, but it's also pretty selfish, espicially from your parents viewpoint\n\nYou're parents should not force it on you, and I'm not sure why all 3 of you are expected losely watch sister", "I know. It's like splitting a cake. One person slices but the other person gets the first choice.  I would prefer the slice with no money and no responsibility. I will accept the slice with all the money and all the responsibility.  My brothers want to do the slicing and the choosing.  And my parents want to let them.", "Yes and … what about this was “springing it on them”? They’re really reaching for all the ways in which to make you the bad guy here with (checks notes) no actual justification.", "So she gets part of the estate but 100% of the responsibility and costs for her sister?", "Not only did you ignore the fact that the parents were trying to dump the entire burden on one person, you also overlooked the fact that the estate would in fact be used to support two people. It's not one of four, it's two of four. And it sounds like that money would absolutely be needed in order to provide proper care, whereas the other two kids are doing well on their own without any extra cash.", ">you're 1 of 4 kids and openly notioned that you take all the money. Not only is it not your decision, but it's also pretty selfish\n\nShe offered the entire estate to her brothers or in a trust for her sister with OP receiving absolutely nothing. Only if she accepts total responsibility for all the costs and work responsible for her sister does she expect the estate so she can use it provide for the needs of her sister. Why should she do all the work when there are 3 siblings who are equally capable? Why should she pay for someone else's needs out of her own pocket while her siblings are not expected to contribute anything and just get gifted money? OP was extremely reasonable and fair.", "DO NOT BACK DOWN. This is the hill to die on! Your terrible parents are first of all sexist, but also completely delusional to think they can force you to do this lifelong commitment that will likely negatively impact your life and dreams without proper support and compensation. Which by the way, they should be paying you generously if you were to even do it. But honestly, you deserve better and deserve to live your life to the fullest! Screw your selfish entitled family. Again, DO NOT BACK DOWN.", "You have laid out 3 fair and reasonable options to your parents/family. Do not let them guilt you into thinking otherwise and it is appalling that they are making you feel bad for advocating for yourself. Your brothers sound selfish which is probably part of the reason your parents want you to be responsible for your sister - and if that’s the case why wouldn’t they leave you their entire estate to ensure her care and your stability?? The whole situation they’ve stuck you in is awful, and you are definitely NTA. Don’t stop advocating for yourself and stand your ground.", "While the brothers get cash and no responsibility. The parents can decide what to do with their money but they can't tell OP what she must do with her life.", "There's likely more to it to an extent, am from family where step family contested step-grandfather's will. Solely on this story maybe not so bad, but the audacity of telling parents where the money should be inherited is pretty nasty. \n\nA larger sum of the inheritance, totally fine as a request, but the whole thing 100% is absurd depending on the size", "I'm not planning on it.  I love my sister but I know I would begin to resent her if her care limited my life.", "Did you completely miss the part where she was willing to give up her part of the estate?"]}