{"id": 10579, "submission_id": "118kojv", "title": "AITA for not accommodating my niece?", "selftext": "My daughter, Lexi, had her 8th birthday party recently. We invited some of her friends, and some family, including my brother, sister in law, and niece, Claire (6f). Claire has several allergies, gluten and dairy being the main ones. \n\nFor the party, I had pizza, chicken tenders, and sandwiches for the food. Chips, fruits and veggies for the side. Vanilla cake for dessert. For Claire, I made gluten free and vegan Mac and cheese, bought gluten free chicken tenders from the store, and she could have the fruits and veggies and chips. I got her a vegan and gluten free chocolate cupcake for dessert so she didn’t feel left out. At the party, Claire was upset that she couldn’t have pizza and Chick-fil-A like the rest of the kids and upset that she couldn’t have the “fancy cake”. \n\nI tried my best to include her by getting special food and dessert for her, but my sister in law yelled at me afterwards for not just offering allergy free food and cake for the whole party so Claire didn’t feel as excluded. I get why Claire was upset, she’s 6, she’s still a kid. But I am furious at my sister in law for yelling at me and calling me cold and selfish. My daughter doesn’t have allergies. This party was for her. Most 8 year olds don’t want to eat dairy free and gluten free if they don’t have to. I told my sister in law that I went out of my way to try to make Claire feel included, and as her parent if she wants more, it’s her responsibility to provide it for her child. I understand that it’s hard to have allergies as a kid and feel excluded (I had an allergy that I outgrew eventually), but that’s life and the world doesn’t revolve around Claire’s allergies. AITA?", "created_utc": 1677027786, "permalink": "/r/AmItheAsshole/comments/118kojv/aita_for_not_accommodating_my_niece/", "score": 1650, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I didn’t get more options for my niece to have 2) she felt excluded because of that\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "... You did accommodate your niece.  Your SIL is an entitled parent.  The entire world doesn't have to eat what her child eats.  That's not how life works.  \n\nNTA", "NTA. As somebody with food allergies I can tell you that not everybody will do as much as you did. You went out of your way to make sure that she would have things she could eat. At some point in her life your niece is going to have to deal with the fact that she can't eat the things that other people eat. The sooner that that's normalized for her the better off she'll be.\n\nAlso you should change your title because you absolutely did accommodate your niece.", ">\tMost 8 year olds don’t want to eat dairy free and gluten free if they don’t have to.\n\nMost PEOPLE don’t want to. \n\nIt was your daughter’s party, and it should be about what she wants.  You went above and beyond, in my opinion, for your niece. Maybe next time just don’t invite her. \n\nNTA.", "I was half expecting to read based off the title that you simply refused to make any accommodations, when in reality, you went above and beyond what most would've done.\n\nYou're NTA (not calling Claire an AH because she's 6 but your SIL is a major AH).", "NTA.  Good grief the amount of adults out there that will behave like that is just astonishing.\n\nYou did your absolute best to accommodate her.  If her mom was that worried about her supposedly being excluded, then she, as the expert in what her daughter can eat or not eat, should have made arrangements to have more food options.\n\nClaire is only 6, but she's old enough that, if mom were doing her job properly, she'd have a much better understanding that her diet is always going to be different than others'.  \n\n\nEDIT: Fixed spelling.", "NTA! You were so caring to do everything you did.  Your SIL is totally out of line.", "NTA \n\nWow you did a lot of extra for one child. Claire was not the birthday girl. She was a guest. She was provided plenty of food. \n\nYour sister in law is in for a rude awakening when she realizes that the world isn't going to accommodate her child's food intolerances. She will be invited to other parties and these same issues are going to happen except nobody is going to make everything gluten and dairy free. \n\nI feel sorry for the child because she is going to expect everyone to bend to her needs because her mother is setting a really bad example.", "NTA you 100% did what you needed to you sister in law can suck and egg cuz you made sure she had similar food.", "NTA and I feel so sorry for your niece if her mother is raising her to have such offensively unrealistic expectations", "NTA, it’s the parent’s duty to provide food their child can eat if they are on special diets or have allergies. My stupid aunt and uncle were never bringing food for their kids who had allergies so we had to suffer through terrible food because their laziness. Tell your sister in law to bring food for her kid or not come at all.", "NTA\n\nYou went above and beyond! Your SIL definitely needs a reality check. It sucks for Claire, but there's not much more you could have done at all. We'll done you for doing what you did!", "NTA you did all that you should to include her. Your sister-in-law suck", "Whoa NTA you went above and beyond and were aunt/uncle for making sure she had a lot of options that were similar to everyone else. Yeah I can get a 6 year old being disappointed but at this point she should already be learning why and accepting it. Her mother is a full blown AH. It's absurd to expect everyone else to cater their eating to her 6 year old. Not to mention the added expense because gluten free usually means more expensive. She should have been thanking you for making sure her kid could eat something there.", "NTA. You went out of your way to make sure there was plenty of food for Claire to eat.", "NTA.  You made sure that there was kid friendly/allergen free food for Claire to eat.  You're not obligated to make *your* child's birthday gluten and dairy free for her cousin.", "NTA\n\nYou made reasonable accommodations. Nothing more should be expected of you. If your SIL doesn't like it, just don't invite her and her daughter again", "NTA. You absolutely accommodated your niece and your SIL is ridiculously rude and ungrateful.", "NTA. The way Claire reacted is understandable - 6 year old. Now, your SIL - she's being more of a child than her child (if this makes sense here). You went above and beyond to make sure your niece was accommodated and that is fantastic. And you are right about the world doesn't revolve around Claire's allergies. Your SIL needs to grow up, quit acting entitled, and understand this.", "NTA you totally accommodated Claire’s allergies. She has to get used to the fact that her allergies mean she can’t have what the other kids have. (And I have a GF kid.)", "NTA\n\nYou were way more accommodating than so many on this sub, and all you got n return was a child throwing a tantrum and her mum enabling her behaviour, and I get that she was upset. biut instead of using this as a lesson, in \"i know you were disappointed, but you are looking at this the wrong way, but remember auntie, made all this special food just for you. to make you feel included,\"\n\ninstead, your SIL expects the entire world to kowtow to her, and make YOUR daughter's birthday all about her and her child\n\ni don't know what your SIL is like most of the time, but i have a feeling she likes to lord it over others", "NTA\n\nYou did accommodate Claire.\n\nI wouldn't be inviting her to any more birthdays until she's old enough to understand.", "You are NTA: you did everything in your power to make sure that your niece had options. Her parents should not be so willing to make you the bad guy when you tried to include her. They know, and your niece knows that she can I have pizza and Chick-fil-A. That doesn’t mean that you should deprive the rest of the kids.", "NTA\n\nYou went over and above in accommodating her. Anything more than that should have been anticipated by her parents who know her best, and they could have brought things as well.\n\nYour SIL needs to kick rocks as far as her attitude will take her, and she owes you an apology considering that you absolute did think about your niece when planning the party, but to insist that EVERYONE eat gluten and dairy free for just so her daughter could eat all of the same things is ludicrous. The 6 year old would have gotten over it if her mother didn't put on a whole song and dance ensuring her child will never be responsible for their own food restrictions.\n\nI wonder---does she demand the school cafeteria only serve food that her child can eat so that she has the same exact choices as all of the other students? Does she insist the parents only make lunches that do the same? Life is not fair and she better start teaching her daughter to understand that.", "So you SIL wants you to change the food that your daughter wanted for her party to accommodate one child who, not only had custom and accommodated foods, but it was not her birthday. Entitled much? \n\nNTA you did above and beyond. You SIL can do what she needs for her own daughters party but at your daughters party you need to think of your own daughter first. \n\nShe should have thanked you for doing anything extra at all. You didn’t have to do anything.", "My daughter has food  allergies we discovered them when she was 5.  I never expected anyone to do special things even with family.  She was great with it , as we taught her right away not to make a big deal about it.  You went above and beyond for your niece.  Both need to realize the world does not revolve around them. How is this kid going to handle real.life if they expect everyone to cater to them.  ( I brought food she could eat to parties).", "NTA. You DID accommodate your niece, you went above and beyond to accommodate her. I would be thrilled if someone put that much effort into my child's special diet at an event that wasn't even for her. Your SIL seems like she just wants something to complain about.", "NTA, you went way above what most people would do.", "You are definitely NTA: you did everything in your power to make sure that your niece had options. You went out of your way to make sure that there were foods that she could eat. Your niece and her parents both know that she cannot have pizza and Chick-fil-A, but that doesn’t mean you should deprive the rest of the children. It’s not your fault that she felt left out. And her parents shouldn’t make it your problem. Children with allergies are always going to be subjected to things that they can’t have. Had you not provided options for your niece, they would have a reason to be upset. If anything, you can just tell them that next time they’re not invited or they should bring their own options so that their daughter isn’t mad.", "NTA. You were super accommodating.  It’s not unexpected that a 6 year old would want what the rest of the kids are having, but it’s her parents job to make her understand why she can’t.", "NTA. You DID accommodate for your niece's allergies. But she and her mum were brats about it.", "Absolutely NTA.  Your SIL sounds like a piece of work", "NTA and the fact your SIL was mad instead of appreciative at all the extra thought you put in means she is a shitty human being.", "So I wonder how her mom manage Claires birthday , do the kids enjoy the whole  dairy free and gluten free party ? What if someone has other allergies does she offer no food to the kids because everyone has some other problems with the food.\n\nAm I the only one who noticed how impossible it is to HOST any kind of party or dinner nowadays ? Like all I'm reading is like ppl get upset because it is not vegan or not enough meat or they have allergies ot are on a special diet", "I wouldn’t invite them to any more parties. NTA.", "NTA - your daughter, your party.\n\nShe can have a party for Claire and she can plan around Claire's allergies.\n\nClaire needs to be used to the idea that with the exception of a celebration in her honor, the world does not revolve around her. SIL was way out of line. Best thing to do with SIL is to ignore her.", "NTA. You went out of your way to accommodate her, and since she’s still unable to understand her allergies, her mother shouldn’t have brought her.", "You absolutely DID accommodate your niece? NTA", "NTA, I have a kid allergic to milk, eggs, peanuts, and tree nuts. If (when) someone is so thoughtful as to include my kid the way you did, I am incredibly grateful, this is simply a lesson your SIL missed. One that I've used with the kid mentioned above and my other food allergy kid. \"Life isn't fair. Enjoy what is safe and have fun. Thank Lexi's parents for making sure you had cake and other safe foods and enjoy playing.\"\n\nIn the future, if Claire comes to you at a party, sad about the food you provide, \"oh sweetie, I'm so sorry you can't have so many things. The Birthday Kid asked for certain foods. I still made sure to get tasty food you can have, I hope you like it. If you try and don't let me know, I'll try a different type next time.\"\n\n\nYour SIL is owed no kindness here. She was absolutely the AH for making this about her kid and not the birthday kid. I feel bad for Claire. It's heartbreaking watching my own kids be sad at parties. But, I do try to get him to focus on the fun that they can have.", "NTA, you did more than enough to accommodate her. The kid's not going to get very far in life if she expects everyone around her to never have food around unless she can eat it too.", "NTA \n\nOmg. You did amazing in what you supplied. \n\nShe should have been thankful.", "NTA, you were 100% accommodating and did everything you could above and beyond for your niece. Her mother on the other hand is a major AH… just because her little princess doesn’t get to punish everyone around her for allergies or diets forced by her mom doesn’t mean she can throw a fit about it.", "NTA We have to deal with kids and their allergies all the time at parties by doing these exact things and never once in all my years has anyone reacted anything like this. SIL is just plain wrong on this. You did accommodate her like any reasonable person would.", "NTA. As you say, you went out of your way to include Claire. It was your daughter's party and you chose the main menu for her, but you made sure Claire had something good to eat. It's understandable that a 6 year-old might be upset that she couldn't eat what the other kids were having, but it's unreasonable for your sister-in-law to be mad at you for not making the entire menu to suit her child's needs", "NTA As a mom who has a daughter who has celiac disease, you went above and beyond what you needed to do. My daughter is 7 and knows that she can’t eat the pizza at birthday parties, and we usually send a gf cupcake for her to the party. Unfortunately, that is just part of having food intolerances, and your SIL is doing your niece no favors.", "NTA. You went of your way to accommodate your niece. I can’t wrap my head around what exactly your SIL has to be upset about in this situation.", "NTA\nFor exactly the reasons you described.", "Your sister can make food for her daughter's birthday party that she can eat. Her daughter will come up against this for the rest of her life. It sucks  to learn we don't always get what we want.\n\nNTA", "NTA.  I think you went far above and beyond what most people would have done for Claire.  Your SIL, though - damn, that is a severely entitled human!  This was Lexi’s party, not Claire’s.  The food was Lexi-friendly and you made generous accommodations for Claire. SIL yelling at you - nope, I would demand an apology and even then, I would probably never invite her to my home again.", "NTA\n\nI think you summed it up pretty well yourself. If their daughter needs special accommodations, then it's their job to do those things. It's one thing to appreciate anything special, but it's entirely different to demand it. You went above and beyond what you could have done. You made special food for her out of kindness, not obligation.\n\nI can't really blame your niece for being jealous, but your SIL is ridiculous. The 6 year old has an excuse to act like a child. What's hers?", "NTA. You went over and above to include Claire. There is NO WAY your kid’s bday party should revolve around Claire. Next year, send her the  Claire menu items and tell her she is free to bring additional items.", "I'm allergic to milk fat. I love cheese! I don't eat cheese much. That makes me sad. Breathing makes me happy! She'll donthe same when she's older. Til then? To  bad, mama's gotta deal with the disappointmemt & tantrums. The rest of the world won't.", "NTA. \n\nIt sounds like you went out of your way to accommodate your niece. She's going to have to adjust to being \"left out\" as she grows up, because that's what life is like if you have that many allergies. It sucks, but she's going to have to deal with it. On Claire's birthday, they can make everyone eat gluten-free cake, but it was Lexi's birthday. Enough said.", "NTA\n\nYou were more than accommodating. It was your daughter’s party, not your niece’s. Your SIL needs to get over herself and remember the rest of the world does not revolve around her daughter.", "NTA. Honestly, I would stop invinting SIL, Claire and brother to future birthdays parties and would let all them know that is because you don't like rude people that dont appreciate the effort tou made to accommodate your niece allergies.", "NTA. You did accommodate her, and I guarantee what you did will be more than most parents will do for her.", "Nta. The people I know who have allergies or kids with allergies bring their own food, bc they can't trust other people to be as dedicated, and it's their life on the line.", "\"Well, I guess Claire isn't going to be invited to any more parties here. Since her mother can't parent her properly by explaining to her that she's allergic.\" NTA. It's her parent's problem to deal with this, not yours. This is going to be her life, she needs to accept it as soon as possible.", "I have similar food restrictions to OP’s niece. I have eaten gluten free, dairy free pizza. And while I, an adult, do occasionally eat it, if you’d fed it to me as an eight year old on my birthday, I would have been less than impressed. \n\nIt sucks to be Claire. It’s really awful feeling left out. At the same time, sometimes in life, you’re the different one. It doesn’t kill you. And OP made a greater effort than a lot of people would have to accommodate her and make sure she had enough to eat. \n\nAbsolutely NTA.", "Very much NTA. \n\nMy daughter’s bestie growing up had severe food allergies. When it came time for birthday parties, my daughter—by choice—checked food labels and asked me to send pics of the ingredients to her mom so her friend could have the same food as everyone else, even though friend’s mom always packed appropriate snacks and treats. Mom always insisted we didn’t have to, but we chose to. \n\nYou CHOSE to make several accommodations for your niece. You didn’t have to. Your niece may not have completely understood why but your SIL should have been grateful that you went so far out of your way to accommodate Claire.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy daughter, Lexi, had her 8th birthday party recently. We invited some of her friends, and some family, including my brother, sister in law, and niece, Claire (6f). Claire has several allergies, gluten and dairy being the main ones. \n\nFor the party, I had pizza, chicken tenders, and sandwiches for the food. Chips, fruits and veggies for the side. Vanilla cake for dessert. For Claire, I made gluten free and vegan Mac and cheese, bought gluten free chicken tenders from the store, and she could have the fruits and veggies and chips. I got her a vegan and gluten free chocolate cupcake for dessert so she didn’t feel left out. At the party, Claire was upset that she couldn’t have pizza and Chick-fil-A like the rest of the kids and upset that she couldn’t have the “fancy cake”. I tried my best to include her by getting special food and dessert for her, but my sister in law yelled at me afterwards for not just offering allergy free food and cake for the whole party so Claire didn’t feel as secluded. I get why Claire was upset, she’s 6, she’s still a kid. But I am furious at my sister in law for yelling at my and calling me cold and selfish. My daughter doesn’t have allergies. This party was for her. Most 8 year olds don’t want to eat dairy free and gluten free if they don’t have to. I told my sister in law that I went out of my way to try to make Claire feel included, and as her parent if she wants more, it’s her responsibility to provide it for her child. I understand that it’s hard to have allergies as a kid and feel excluded (I had an allergy that I outgrew eventually), but that’s life and the world doesn’t revolve around Claire’s allergies. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.", "NTA at 6 years old she's old enough to understand there are certain foods she can't wat and accept it. MY daughter is 4 and my son 8 and they can't eat gluten. My daughter started advocating for herself at 3.5 and my son has been asking if things were gluten free for years and understands when he can't eat things other kids can. If we're invited somewhere I check the menu ahead of time so I can make sure to provide alternatives for my kids. They're fine with it. Furthermore, my best friend's son is allergic to dairy, eggs, and many other foods. He just turned 6 and is well aware of and accepting of his food limitations and understands that he can only eat what his mom brings him to parties. You did the best you could and went beyond what was necessary to provide suitable alternatives to the items on the menu. That's more than most would do. Your sister is an AH for not ensuring her daughter understands her dietary restrictions. The onus is on her for not helping your niece understand this.", ">vegan Mac and cheese\n\nWhat in the all might world of food is this ?!\n\nJoke aside, NTA. Claire is a 6 y/o it's \"ok\" for her to behave this way. But your SIL throwing a tantrum as well, naaaah.", "NTA, and you know it. I went into this after reading the first paragraph thinking you were gonna reveal that she had the fruits and veggies and that would be enough, but you went and provided her with a taste of everything at the party that she could have. Good on you. The ONLY thing I could think of that could have gone differently would be that you could have gotten her some of the grilled chicken nugs from chick fil a (delicious btw), but still you provided plenty!", "I was thinking that this child is going to grow up expecting people to cater to her because of the example mom is setting. I feel sorry for her.", "I don’t even want to eat gluten free and I have been gf for ten years. It sucks.", "It had better be a dairy free egg!", ">You were way more accommodating than so many on this sub\n\nYep, I'm always shocked at how many on here think it's reasonable to expect invited guests to bring their own food if they have medical/religious needs, or are vegan or vegetarian.", "Sad thing is she is old enough to understand. My kids have understood their dietary restrictions since they were like 3.", "If I invite someone who starts listing items they can’t eat I tell them this dinner party isn’t for them and move on.", "It is crazy to me that SIL pulled this nonsense.\n\nI was allergic to milk as a kid back when allergies were not really taken into consideration.  I missed out on ALL the sweet stuff at every party ever.  I never really cared too much about it because the food part of parties lasted 10 minutes, and then we got to return to the having fun part of parties.  I certainly never cried about it, or felt excluded.  I knew from a really young age I simply couldn't eat/drink certain things, or I would get very, very sick.", ">If their daughter needs special accommodations, then it's their job to do those things. \n\nNo, it's the host's job to make reasonable accommodations for medical/religious reasons, and for vegans and vegetarians. Which the OP did, so they're not an AH. But you can't invite someone to your house for a party, knowing in advance that they can't eat anything, and not be the AH.", "I also think it's possible her mother planted those ideas in the first place. If her family framed it correctly, she wouldn't feel the way her mother reported her to be feeling about it all. \n\nThat report sounded suspiciously like an adult. \n\nYou're NTA.", "A grocery subscription sent me gf cookies and they were so bad I think I'll have to throw the gf muffin away without trying it. I can't handle that texture again. \n\nSorry you have to do that, blech.", "Lol", "I mean, that’s kind of a dick move", "I don't agree with that one bit. She wasn't obligated to make anything. She shouldn't have to plan her entire menu around one person. It's the parents' job to make sure their child has something safe they can eat. If she hadn't made anything, then it would have been the parents' fault for not communicating and planning ahead of time.\n\nIf my kid had an allergy (let alone several), I'm not going to storm up to the host and demand they make special food.", "It's one thing with medical restrictions, but dietary choices I.e. vegetarian, vegan, and religious restrictions are 100% on the attendee. Attending a party and expecting your personal, moral, or religious restrictions to be catered to (unless it's a party being thrown for you) is asinine.", "I could see a 6 year old wanting to eat what everyone else was eating. \n\nI don't understand how this allergen issue hasn't happened yet, though. I mean families get together, friends get together. People eat.", "Why? I’m not changing my menu for one person. I invite them back when they can eat what I serve. I’m not an ass about it. No one has dumped me yet.", ">She shouldn't have to plan her entire menu around one person\n\nI agree, but if you invite someone to your house for a meal or a party, you should be prepared to offer them something that they can eat. (Which is what the OP did, and why they're not the AH). And if you host a catered event, you should ensure that all reasonable accommodations are met.", "Right, and this isn't the first she's experienced this. So I get it, but I still think it sounds like this is encouraged by her mother.", "NTA. Claire wasn’t excluded she had plenty of food options. Sounds like SIL is being entitled and needs to realize the world won’t cater her daughter. \n\nI have dietary restrictions ( not due to allergies but other health issues) but my extended family rarely remembers or accommodates me. Like they always pick restaurants ( mostly pizza places) that I can’t eat from when they come to visit. Thankfully they don’t come around often so I just suck it up and eat small amounts.", "NTA.  And your SIL is raising your niece with expectations that won’t be met.  You did a great job of having things included for her.  Mom’s behavior will end with her daughter not being invited to outings.", "Nta, I say this as a mom of a kid with food allergies. It was nice when there are options period.  I brought things to parties or sometimes just taught my kids about life. Sometimes you can't get everything, but it's still a good life.", "NTA - how was all of this not accommodating your niece! It stinks for Claire but it’s the reality for people with food allergies", "NTA. Fellow allergy mom myself, and while it still drives me crazy that my kid's school is constantly sending her home with allergen foods (previous school was not free so not an issue there) I raised my concerns and they are well aware that it is an allergen food for her and she is never offered it even if it's actively in the room with other kids which is honestly more like how things will be as she grows up. My family is very conscious of her allergy, always giving me boxes to check the ingredients if there's even the slightest chance when they are doing something fancy. My husband's family, not so much. My MIL, love her to death, but the concept of reading the labels when buying special treats for the grandkids seems to skip her mind every time. But I always double check, my 5 year old daughter knows to ask and knows that is the answer to is this peanut safe isn't absolutely certainly yes, she can't eat it. She might then immediately ask if there is another treat, but she's never thrown a fit about it and I definitely don't yell that they were inconsiderate when they didn't check. We're constantly getting invites for birthday parties, first this I say is she'd like to come, but we have a peanut allergy. Would you like me to bring a separate snack? That way it makes it clear that I'm not expecting them to do additional work for my kid and I'll make plans accordingly if there will be food that my kid can't eat.", "Nta", "NTA.  You went above and beyond for your niece.  Her mother is an entitled ass of a parent teaching her kid to be the same.", "NTA - You did accommodate your niece, your SIL thinks the world should revolve around her.  I also question if your niece actually has these allergies or if your SIL just decided she does. It seems to be the fad for everyone to have gluten and dairy issues anymore.", "NTA. You did accommodate your niece. Absolutely no one will make their entire party allergen free to accommodate one person unless it's the guest of honor.", "NTA.\n\nYou got her her own, allergy friendly cupcake, How is that not a mini-cake!?", "NTA and next time they can stay home.", "NTA,  you tried to accommodate the special diet of a child..\n\nI have an acquaintance who's child has PK, they can't have any protein.  This child at 3 years old knew she couldn't eat what everyone else can.  The mom always brought food she could eat and never expected others to make special meals for her.  Not that we didn't try to make stuff for her, usually fruit and veggies, we even bought sorbet for her when the other kids were eating ice cream.  But her mom never expected it and she definitely wouldn't want everyone else to be forced into her daughter's special diet.", "Next time don’t invite Claire. If asked, tell the Mom you understand her daughter only wants to attend birthday parties where all the food is gluten free, etc., \nYour daughter’s birthday party can accommodate a gluten free guest but cannot impose gluten free on your daughter and other guests.", "Nta. Your sil is an entitled AH to the max though", "NTA. Wild to me that Claire's mom ostensibly wanted Claire to not feel alienated, and so she... made a scene in front of everyone over chicken tenders? I will only very slightly amend my opinion if in a follow-up with your SIL, you learn that in fact what she was worried about was cross-contamination somehow? I've definitely had celiac friends who had to be careful about cutting boards and pasta strainers and stuff that their gluten-eating roommates had used. But if her issue was literally that it was unsafe for any allergens to be served at all at the party, she had the chance to communicate that clearly beforehand! Uff, I'm so not on your SIL's side here.\n\nEdit: oops, corrected it to sister-in-law, not sister!", "Honestly, I am an adult with food allergies and I don't expect anyone to accommodate me. But for a 6-year-old child that is close to you and not just some random party guest, I would have made the party as safe for her as possible. \n\nInstead of buying two different chicken tenders, why not just buy one type that was safe for everyone to eat?  You didn't have to have a parallel menu where you duplicated everything for your niece. \n\nThere's tons of food that kids like that is naturally gluten free. \n\nIt is really emotionally hard for little kids to feel othered.  It's not a situation where the kids picky and will only eat one thing and is trying to be difficult. It's not like the kid who eats everything then decides that they're only going to want dinosaur chicken nuggets for 3 weeks and not eat anything else and scream and yell if they don't get it\n\n.", "This! Definitely NTA.  I go hungry at a lot of events where people don’t accommodate and also don’t want me to bring my own food.  (My former in laws did this to me.)\n\nHaving those options for her was a great accommodation.  \n\nAlso? Dairy and gluten free products are expensive! I don’t make everything gluten free when *I* host a party.  I just make myself something because it’s less expensive to feed a crowd food with typical ingredients.", "Not only that, gluten free & vegan versions of stuff tend to be WAY more expensive. To feed an entire party of kids that stuff? Good lord.", "Also, wouldn‘t it be more expensive? Thankfully, I do not have a gluten allergy but one of my co-workers has 3 out of 4 kids that need gluten free and she said her grocery bill skyrocketed.", "Because it was her daughter's party and her daughter was the one that needed to be cater.\n The foods were the foods her daughter wanted. \nShe was cool enough to be acomodating in a level. \nSIL is an entitled woman raising an entitled kid.", "I would like to add, this all depends on how many are attending.\n\nA large group where multiple can’t have the food is MUCH different than a smaller gathering where only a couple people or just 1 cant", "It’s the phrasing. “This dinner party isn’t for you” is such an odd thing to say. It’s one thing if someone doesn’t like what you are making, but if they literally can’t eat what you are making I don’t think it’s a huge deal to make a little extra something so that person can attend.\n\nYou don’t have to go all out like the mom here, but doing even a little something so someone can go have dinner with you goes a long way", "As a lactose intolerant Celiac with Celiac family members (including a similarly aged niece) you are NTA! \n\nEverything you did was EXTREMELY thoughtful, and you did so much for that little girl. It's unfortunate for littles to learn to cope with it, but it's also something they NEED to learn to cope with, and shame on her mother for not helping her daughter with that. I can confidently say that my siblings would have been thankful for going out of the way to cater to their child's restrictions like that.\n\nYou did good, OP, and I would be thrilled and gracious to have a host go through that much effort to cater to my dietary restrictions.", "I can understand the child being upset (and that should totally be validated) but you are absolutely not the asshole OP. You tried. And I’m sorry it went unrecognized, that’s really sad.", "NTA. I’ve worked with kids both in scholastic and in daycare like settings, and the one sure way to get children to exclude One particular child is to force the restrictions of the one onto the many.\n\nWorked at a center where they had loads of animals and everyone loved them.  \nKid started that was allergic and their parents forced the center to get rid of all the animals aside from fish. No adult told the kids anything but it took them less than a week and they knew Who they could ‘thank’ for losing all the animals. \nNobody wanted to play with the poor kid for months. It didn’t ever really get better so in the end even the dumbass parents  realized that they better find a new center to join. \n\nSame happened another place where a kid had a dairy allergy. They tried to get anything dairy banned. Which failed because the kids were bringing individual lunches and we couldn’t police 200 kids lunches every day, so they tried to ban dairy from the community meals we did. And also banned kids from having dairy in what they brought to celebrate their birthdays. No more cake, no more ice cream and so on. NOT popular. \nAgain kids find out kids get angry kids won’t play with the poor kid.\n\nChanged it so the kids parents brought a bunch of safe treats for the kid and we stored them and gave the kid those instead when there a communal meal or a celebration. \n\nKids got their treats back and everything was forgiven and forgotten.\n\nSorry for the long examples, but the point should be clear: the only one with a restriction should not dictate the rules on any occasion where they are Not the actual focus.", "NTA you accommodated her way more than you even had to. SIL needs a reality check.", "NTA! As an allergy mom, I’d be so touched if someone took all that time and effort to accommodate my son’s allergies in every way that you did. My youngest (4) has several allergies that we have to watch out for. \n\nOur friends and family will let me know what foods are not safe for him at their parties then it’s on me to make sure he avoids it. There’s no expectation that they’ll bend over backwards to accommodate us. Most will check with me though to make sure they have at least a few things he can eat, including a dessert, but again, the whole party isn’t catered to his specific dietary needs. Which is shouldn’t be.", "NTA. As a mama who has a son with life threatening food allergies, I have to say you did an amazing job. I pack my son his own special foods so he doesn’t have to worry about what he can eat without needing to be stabbed by his epi-pen. \n\nI NEVER expect anyone to accommodate him and his dietary needs. It honestly isn’t fair to others. And he would rather be safe than sorry by eating the foods I send with him. He knows exactly what will happen if he eats something he is allergic to and he would rather avoid the hospital at all costs.", "NTA. It seems like you put a lot of thought into accommodating her. That was super sweet and you didn't deserve to be yelled at.", "NTA and your SIL better get a grip", "NTA", "NTA. Gf food is $$$ I’d never cater a whole party with it", "Nta", "NTA.\n\nYou made sure your niece had food she can eat.\n\nI would hope that at your niece's birthday parties, her mom provides food the other kids like, and her daughter isn't further alienated. \n\nAs a side note, as someone raised with a younger cousin who was disabled since birth, please do be mindful about how you talk about your niece with/in front of/around your child(ren). Her needs are valid, even when her Mom is being T A. I'm approaching 40 and I'm still unpacking the ableism I inherited from my family due to me being exposed to their conversations about my cousin.", "NTA. You did accommodate more than any other party your niece will go to in life. She needs to see not everyone will always make her the center of attention for food. Her mother is going to raise her with the wrong perspective and expectations for life like this. I would talk to your brother about it to smooth it over. You WERE accommodating, but this party wasn’t for your niece.", "Nope, NTA.  Why should all the other kids have to suffer because one has allergies?  If you had not provided other options I would still say not the AH because it is on her mother to make sure her daughter's dietary needs were met.  Does she expect the school to only serve foods that her daughter can eat, does she expect restaurants to not serve anything Claire can eat.  Would it have been better if she had been allowed to eat everything the other kids were eating and got sick.  Tell her that when Claire has a party, she can dictate the menu, but for your child's party, you are going to serve what the majority would like.", "NTA-you did all you could. Serving gluten and dairy free to all involved would be unfair to them.", "Your SIL needs to learn how to parent. \n\nNTA", "NTA You went above and beyond to accommodate her", "NTA You went out of your way to provide food your niece could eat. Gluten-free cake almost always tastes horrible. I feel badly for people who can't eat gluten but most gluten free foods (with few exceptions) are like sawdust. As a vegan, I would say dairy free alternatives are about half and half, some are hideous while others taste like the real thing.", "NTA Your child's birthday party does not need to revolve around someone's else's child's allergies and feelings.   \n\nIn the future, tell your SIL what food you are ordering for any occasion and tell her that if it will be difficult for your niece to be there and not eat that food, then, while she will be missed, she should stay home.", "You are definitely NTA. You did a lot, above and beyond, to accommodate your neice. It doesn't sound like her own parents did anything to help ensure their own child's party experience as it related to the dietary issues would be a pleasant one, for example bring special allergy safe food or discuss with the daughter ahead of time the possible food she might encounter that would be tempting but off limits to her. You can give yourself a lot of credit for what you did as Auntie.\n\nOn the other hand, a lot of commentors say that the solution is not inviting this family again. I disagree. Calling you cold and selfish is completely untrue because you obviously behaved in a way that was the exact opposite of that in this instance. What I suspect is that your brother and sil are having a hard time dealing with their daughter's foid allergy. Maybe instead of just cutting people off you should address the issue to them. I don't know what your relationship is like with your brother, but if you have a pretty good relationship with him, I would start there. Begin by talking about the topic of the food allergy. Ask questions about it. Get to know what it feels like for them on a day to day basis, then without bringing negative emotions into it, let him know that it was difficult to hear sil say the things to you she did that represents you yourself as being uncaring when you took time to provide special food for the occasion and oftentimes it's the parent's who provide for their own children in these scenarios. Remain resolute in getting your point across but don't let it devolve into blaming or anything negative. Gauge your brother's response. Maybe he will discuss it with his wife and bring her to reason. It's important to find some balance in extended family relationships where you feel heard and have your actions not be devalued by others. If your brother and yourself don't have a close enough relationship to have the conversation I mentioned, then you need to try having it directly with SIL. Keep in mind she may not even realize that the reason she lashed out at you like that is because she herself is struggling with this parenting challenge. Discuss the issue with her in a supportive way, but don't accept blame that isn't yours. If she doesn't budge in her position or attitude let her know that she didn't do enough to accommodate her daughter in this situation and she will encounter a lot of different situations in life where her daughter will be accommodated even less when outside of her immediate family and if she as mom doesn't step up to the plate her daughter will suffer unnecessary distress because of her own actions.", "Definitely NTA, as someone with celiac disease I find it very seldom that people fully accommodate my needs in the way you did. I usually bring my own desserts to family events and being snacks in case there is cross contact between the foods. I've bene burned a lot. The kid obviously has been dealt a crappy hand for food allergies and maybe her parents do a lot to accommodate but I know if I were sending my daughter to a party and she had similar issues I would be sending food she could eat and not expecting others to make modifications.", "Wait, what? I have a kid with food allergies and I don’t even modify our family meals by much. I provide an allergen free version and the rest of us eat whatever. For school lunch I sometimes have to provide an alternate meal too. I’m surprised Claire is not pretty used to this when she’s not at home. Your SIL is dreaming. NTA.", "NO. I am allergic to a lot of stuff and I do not want people not eating their favorites because of my wacky body chemistry. You went out of your way to make food to include her. This is Claire's entire life. People aren't going to change their entire diets for her, much less remove gluten and dairy. NTA. Her mom was out of line.", "NTA \n\nYour SIL sounds like an indulgent parent(someone who never wants their child to experience the slightest sadness or inconvenience). Unfortunately, this parenting style makes for shitty adults. \n\nYou did accommodate your niece, you didn't accommodate your SIL", "Nta", "NTA. you went out of your way to make accommodations - dietry foods can be expensive as hell. you could have easily just given her snacks that are gf like potato crisps, fruit, etc, but you went out of your way to make sure she had similar foods.", "Good lord, you went above and beyond with the food you bought and made for Claire. Definitely, absolutely NTA!!!  Both SIL and Claire need to learn that not everything revolves around Claire and her allergies. This was Lexi’s party, not Claire’s-at Claire’s party SIL can have everything revolve around her precious (and I have a feeling mom wouldn’t have a problem telling guests with allergies not accommodated by the food she had “too bad, so sad”)", "NTA. My 4 year old son is allergic to dairy and most kids party food is cheesey pizza, cheese sandwiches and milky cakes, it's normal to expect that. He has never moaned about not being able to share the food. And I've always called the parent of the birthday kid beforehand and ask about the food situation. If they accommodate by getting special food just for him I'm always very very grateful, organising a kids party is hard enough without thinking about separate food etc. If they can't then I always say I would bring something for my son so he can still come to the party.\n\nIt's not easy being a parent to a kid with food (or any) allergies but the entitlement of your SIL is just sad. She's the AH.", "You are absolutely NTA but your sil sure is. I also eat gluten free and mostly plant based. I never expect people to go out for their way to accommodate me. I've also been in plenty of situations where I was told there would be food for me somewhere but then there wasn't and I end up going hungry. I now bring my own food/snacks to a lot of places I go. I've even taken my own dinner to a wedding before, which felt awkward but everyone understood.\n\n I've also accommodated different allergies at my daughter's parties and parents are usually beyond grateful for any accommodations made. You went above and beyond to make sure your niece had a great meal and a dessert too! The entitlement from your sil is insane. Why should your daughter have to sacrifice what she wants for her party for one kid's restrictions? Your sil needs a major reality check.", "NTA\n\nAs someone who is celiac you’re absolutely NTA. For a friends birthday I bought him a cake and brought it and had to watch everyone eat it, but that’s because I understand not everyone wants to eat something gluten free. A real cake tastes so much better and it was his day not mine. Of course you should prioritize the birthday kid and it was incredibly kind of you to go out of your way to have gluten free options for your niece! Just the fact that she had her own special treat should have been enough. That would have made me overjoyed personally so I don’t understand why your family was so upset.", "IF you had said that you didn't get your niece anything to eat and only had what you said you had for the party'i would've gone with TA\n\nBut\n\nYou did try to accomodate your niece...you brought her food and dessert and juices that she could have\n\nYour SIL IS ACTING ENTITLED ITS YOUR CHILD'S BDAY NOT HERS\n\nTHE WORLD DOESNT REVOLVE AROUND HER\n\nNTA", "[deleted]", "This. OP, maybe don't invite them next year since they need to have all events catered around them. When they ask why, tell them.", "Also gf stuff is way more expensive than regular stuff! She would have tripled her spending - at least - for stuff that doesn't taste as good.", "Yeah, but OP is TA for getting Chick-fil-hate. Bigots shouldn't be supported.", "[removed]", "[removed]", "[removed]", "Glutino chocolate covered pretzels. They are the best gf thing I have ever eaten. (I am not gf but I had several friends and co-workers that were so I tried a ton of stuff to find things for them.)", "I generally don't do gf but it was a friend's birthday and she's gf so I decided to make her some chocolate chip cookies (idk why bc I'm terrible in the kitchen lol) and they were actually super good. I ended up using a recipe on the back of a bag of cup4cup flour", "Look for flour free recipes. I have one for peanut butter kiss cookies that are delicious.  They have peanut butter,  eggs, and sugar in them. Plus a Hershey's kiss on top. They can be made in large batches because they freeze well. And they never get hard.", "Wow\n\nYou actually went way out of your way to include her and did nothing wrong.\n\nYour sister is a big entitled A.\n\nYou cannot punish a whole party for 1 kid who already has alternatives.\n\nEdit to add judgement NTA", "NTA", "My daughter just turned 7 and she has several food allergies. We have always taken on the responsibility to either provide food for her or for family functions to make sure there is at least one or two things that she can eat. You went above and beyond to make sure she was she was included. At 6 years old your niece should clearly understand that SHE has food allergies but that doesn’t mean the rest of the world does. From the way you describe her reaction, I would have guessed 3 or 4 years old rather than 6. My mother in law bitched when I made my husband a German Chocolate cake for his birthday without nuts, because, “it just doesn’t taste the same.” So, there’s your answer, even if you were to have made all of the food “allergy friendly” good chance someone would complain. Your sister should teach your niece that the world doesn’t revolve around her, but of course your sister would have to own up to that fact first.", "Oh please...you bought and accommodated the niece, the mother should have done the work instead of blaming others. NTA", "NTA it wasn’t Claire’s day and you went above and beyond to accommodate her needs. She will need to learn to live with her allergies, because few peoole are this accommodating.", "Gluten- and dairy-free products are *expensive*. I know because I’m lactose intolerant and cow dairy is way less expensive than almond milk. Had you catered the whole party to your niece’s strict dietary requirements, you would have paid a small fortune. As it was, you accommodated her fairly and it still was not good enough. Your sister-in-law is not preparing her daughter to be introduced into the real world. What will happen when niece begins school? Will your SIL take the cafeteria by storm and demand that only specific ingredients be allowed? When niece begins her first real career, will mummy dearest crash into the building and scream to the rafters that all employees must adhere to darling daughter’s highly restrictive diet? You were a polite host and you are NTA.", "NTA, because I agree with that:\n>I told my sister in law that I went out of my way to try to make Claire feel included,", "NTA. You in fact accommodated her perfectly.", "NTA and tell the mother that if she is that rude to you again her daughter won't be invited.", "What you did was more than accommodating and shows that you do care very much about making sure that she has something similar to eat while still allowing for your child to have a party that they enjoy. And it shows that you set aside extra time and budget specifically to include her kid and the fact that she doesn't recognize that makes her an asshole.", "NTA", "NTA you did everything exactly right. You made sure she had reasonable access to a main course, snacks, and a dessert. As a person with a limited diet, I often find myself in a position where I’ll get 1 or 2 of the three courses, but never all three. I think the kid was upset because honestly it fucking sucks to have the lots of the food world be inaccessible to you and seeing people enjoy foods you can’t have but really want is always a bummer. You did a really good job by making sure she had an equitable option for every single “course” of the party meal", "op=NTA\n\nYour sister needs to teach her child to manage her expectations.  The rest of the world isn't going to stop eating food they can eat and only serve/make/eat foods that are safe for her.\n\nYour sister was/is the A-H for yelling at you and trying to make the your daughter's party about your niece.", "NTA. You did try to accommodate her to the best of your abilities. I honestly dread the future because I fear when all these kids are going to be adults and expectations will run high. Of course it’s sad and bad and mad that Claire cannot have the same things and at 6, it feels the worst thing in the world that you cannot and others can, especially if it’s yummy food. But the reality is that the world will not always accommodate and the people, who care and are decent, will try but I still don’t hold the opinion that you should cater every food to accommodate the person with allergies (if it’s not deadly to a degree that even proximity to the allergen will cause a reaction). I honestly don’t understand what is wrong with providing dual options - allergen free and with the allergen; everybody can choose what they want then; those who don’t have to pick the allergen free, can take that option and those who actually want the allergen free food or need to, can take the other option. \n\nI honestly feel sometimes like it’s going to the other end of the extreme. Like if you don’t fully 100% manage to accommodate someone then you’ve failed, because you obviously don’t care about that person, when in reality, real life is not going to be other people accommodating you - it’s you fitting the other people most of the time. Harsh, but a reality.", "NTA", "NTA. At six years old it's very easy to not feel included so I understand it being difficult for the kid; but your sister-in-law should've spoken to her about it to try to make her feel better and included, not to blame you for not making all the food dairy and gluten free. Speaking from personal experience, a lot of gluten-free food is fine these days, but cakes, brownies, etc.? They still usually have a noticeable decline in quality. If you're used to it then it's fine, but if you went from a normal cake to a gluten-free one, you'd dislike it. Having your daughter's cake be gluten-free, something none of the other kids are used to, would mean no-one except your niece likes it.", "You are definitely NTA.  You \\*did\\* accomodate your niece.  You got her gluten-free and dairy-free food, so she could eat with the other kids.  Your SIL was way out of line.  She should have appreciated that you got the food her daughter needed at the party!", "Ugh. As a coeliac with a one in ten chance of having passed it on to my daughter, birthday parties are honestly something I dread if she can’t eat gluten. But you did amazingly in my opinion to make sure your niece had lots of food to enjoy. If she’s got to live with it then your sister needs to be helping her towards understanding and accepting it not expecting everything to be changed for her.", "NTA. Don't invite them next time.", "YTA. Understandable mistake as far as allergies go. But you’re wrong with the opinion that most 8 year olds, “don’t want to eat dairy free or gluten free if they don’t have to.” Most 8 year olds don’t care, that’s stuff that adults care about, who’ve been conditioned to think that sort of food = nasty. \n\nThere’s probably tons of food you already eat that’s dairy free and gluten free that’s delicious. \n\nAlso, I just don’t respect anyone that kills animals unnecessarily in order to “celebrate”. With buying chik-fil-a, how many chickens had to violently violated and essentially be sacrificed, for your 8 year old daughters birthday celebration? That’s a lot of unnecessary violence. \n\nAs epicurus said, in order to enjoy a meal, what’s more important to our pleasure is who we eat with, than what we eat. Your 8 year old kid will probably remember being with their friends and family more, than the meal they had, a few years from now, and being around friends is probably what makes things more enjoyable, more than anything else. \n\nBest wishes. Thanks for reading.", "NTA. The SIL should have had a conversation with OP about her rediculous expectations *before* the day of the party instead of blowing up after the fact. She should also have explained to Claire what to expect at the party in order to avoid a meltdown.", " I'm in a group for people with a specific medical food restriction, and what OP did is what I see a lot of parents of kids with my diagnosis talking about as best practice, or what they wish their family would do. Most people I see post who have kids with these restrictions, pack their kids their own separate meal for any event outside of the home, to make sure the child is safe. OP was very welcoming", "Reread the post. It was OP’s daughter’s birthday, not the niece’s. The niece was a guest.", "Dude 8 year olds want birthday cake and chic fil a. OP’s 8 year old probably requested it because it was her birthday.", "*yawn*\n\nCarry your entitled opinion to the back. \n\nWait, already at the back. See your noise doesn't matter.", "Ah yes the moral superiority complex people have arrived.\n\nGet a real problem to solve.", "Thats what I was thinking too. SIL wants everyone to eat what her kid can eat, she can bankroll it.", "What about ppl in the LGBTQ+ that still eat there, I have several friends in the community including my best friend that still eats there", "Chicken", "I understand this all too well! The in-laws are pretty good with accommodating my allergy these days, (only took about 15 years...), but they are still terrible with my intolerances. By that I mean food that makes me physically sick.\n\nEven when they are 'accommodating' they're not. Christmas dinner for them was a nut roast with cranberries, which I am full on allergic to. So they 'accommodated' me by having some plain chicken strips. I have no idea what they did to that poor chicken, but I could tap out morse code on my plate! A strip of chicken breast is supposed to BEND! These had sharp corners!", "[removed]", "Gluten free is not a fun diet, especially since it's medically necessary for people with celiacs. All the fun easy food is basically poison. It's very limiting on what you can eat and where without puking your guts out.", "Whoops, thank you. I must be tired.", "8 y.o. won't know the difference between a vegan, gluten free cake or a non-vegan, gluten cake, because there's pretty much no taste difference, the former is just harder to find and more inconvenient. \n\nI don't believe in animal sacrifices for celebrating, as far as it relates to chik-fil-a because \"it's a birthday\" thing. Chickens are killed on average when they are 6 weeks old, and their natural lifespan is 6 years, meaning they live about 2% of their natural lifespan before they are killed. In human terms, that would be if we killed a 21 month old baby. So I don't think it makes sense to sacrifice an animal's life. Could have just fed the kids a peanut butter sandwich, and spent that money saved on something fun.", "I don't feel entitled to an abused and violently violated animal's severed bodypart. \n\nWho really has entitlement issues here?", "Unnecessary animal stabbings are a real problem. \n\nAnd I'm not the one who considers myself so superior, that I believe sentient beings should be violently violated for my taste pleasure.", "u/ImpossibleWitny is a comment stealing bot. https://www.reddit.com/r/AmItheAsshole/comments/118kojv/aita_for_not_accommodating_my_niece/j9hn6bk/", "u/ImpossibleWitny is a comment stealing bot. https://www.reddit.com/r/AmItheAsshole/comments/118kojv/aita_for_not_accommodating_my_niece/j9hojb8/", "u/TieAccomplih is a comment stealing bot. https://www.reddit.com/r/AmItheAsshole/comments/118kojv/aita_for_not_accommodating_my_niece/j9hx4jq/", "u/FunKeu is a comment stealing bot. https://www.reddit.com/r/AmItheAsshole/comments/118kojv/aita_for_not_accommodating_my_niece/j9hob7v/", "NTA the world doesn't revolve around your niece, she's not your kid and you are not a fecking restaurant.  Your SIL is a total arsehole", "Also, no one is pointing out how much more expensive GF and DF stuff is compared to other foods. You would have tripled the food cost of your party. NTA", "NTA\nYour SIL is not doing her daughter any favors by instilling this entitlist attitude. Schools won’t offer her a special menu. Her future employer will not have a special menu for her when providing meals for special or PD days. I mean the list goes on and on.", "NTA\n\nAnd I say this as a parent who with a child who had severe food restrictions that were often very disappointing.  And you know what, we coped.  We brought or sent the required food for the kid, and they understood before the age of 6.  I swear, if a hostess had accommodated my child the way you accommodated Claire, I would have kissed her feet.\n\nYou did accommodate!  You are a rock star of accommodation!\n\nClaire's mother, on the other hand, is completely unreasonable, which is pretty bad.  But what's worse is that she isn't teaching Claire to accept her health issues and to cope with them.  \n\nIt is very dangerous not to teach a child with severe food allergies or medically-based food restrictions how to cope, how to ask questions about what they're being served, and how to deal with their disappointment that someone else has something that looks really good that they can't have.  I don't see how you can send your child to a playdate or to school safely if you haven't been working on this very diligently at home.  It hard, and it's sad, not gonna lie, but it's absolutely necessary.\n\nFrom the sound of it, with Claire's mom's expectation that if Claire can't have a banana, the whole world around her must be banana-free (which is not how the world works), I'm willing to bet she's not working with Claire in a way that will make Claire safe (assuming Claire's allergies are authentic). Poor Claire.", "NTA \n\nWhat is your sil on???? You did accommodate your niece to the best of your ability and did include her with what restrictions you had to work with. Most people wouldn’t even go as far as you did, the farthest they would go is letting the people with those types of restrictions bring their own food.", "NTA. A party is suppose to be geared towards the person it’s for not for one single guest. Your SIL is crazy if she thinks this behavior is going to go over well with everyone her daughter meets. I feel bad for your niece because she’s not going to be invited to many parties if SIL continues to behave this way.", "As a parent, with a child with celiac, you went above and beyond. Wow what a wonderful aunt you are. \n\nI personally bring my daughter food for all parties and anywhere we go, as it is safer for her and most people don’t understand cross contamination well enough to keep food safe for her. \n\nHonestly I can’t believe the entitlement of you SIL you absolutely NTA", "NTA. You did accommodate her. Her mother is just awful. I have 1 sister who can't have gluten and another sister who can't have dairy. If we ever have a party, we'll always make sure there's a spread suitable for all types, but both of them always bring their own options just in case. \n\nThat 6 year old is going to grow up a spoilt brat.", "... but you DID accommodate her. You just didn't build the entire event around her allergies. It's awfully entitled of your SiL to expect the birthday girl to have to give up what she might have wanted for HER birthday for one guest. If it's not the sort of allergy where being *near* somebody eating it will cause a problem, she ought to be happy you went out of your way as much as you did instead of telling your SiL she had to provide her own damn food.", "NTA", "NTA.  SIL is being very entitled, looks like to me.  Claire is gonna have to learn how to deal with her allergies eventually, coddling her won't be doing her any favours.  sounds like you put quite a bit of effort into finding the kid things she could eat.  if she's still bummed anyway, that's too bad, but it happens.  one day she won't be in mum's house any more, so what is she gonna do then, throw a hissy fit because the world isn't ordered to her taste?  not gonna get very far thinking that way!", "NTA. You did a great job at accomodating her diet. Your SIL is being unreasonable. Unfortunately  your niece will stop being invited to things if SIL keeps up the entitlement.", "NTA you did accommodate your niece in that you provided plenty of options for her to eat. Mommy should be modelling gratitude and self control to Claire, not entitlement that everything suit Claire. It would serve her better to prepare her for the real world at school and other parties, learning to look for her food and thank host for providing safe foods. These are usually more expensive and taste different, so I completely support normal food for the majority. Unless niece has an anaphylaxis response to being close to foods in question, her mom's request was unrealistic and just plain rude.", "NTA at all and if SIL really did care that much she would have reached out to talk to you before hand or even brought her own stuff", "I have celiac and I would be delighted if someone did half of this for me. Your SIL is entitled and needs to learn now that her daughter is going to have to accept the world doesn’t revolve around her. It sucks having allergies, but making everyone else suffer for her is just teaching her that misery loves company. You did great, NTA.", "NTA i think allergy free food for all party would cost a lot of money also", "A six year old is going to cry maybe SIL should have taken a stand with daughter and kept her home. In her party she can serve gluten free everything", "I am doubting between YTA and NTA, while NTA for not accomodating too much, your niece is not your kid, and she will probably need to learn that she is different in that way, she can't have dairy or gluten, and other people can, and according to you, she was fine during the birthday party, so she doesn't have a severe allergy (she couldn't even be present if there are allergens). I would say YTA also because kids are kids, sometimes in birthday parties they play 'food contest', so eat this or that, Claire can't eat it, and I am not sure what kind of kids were there, but a game like that could have put Claire at risk.", "Cold and selfish?\nyour SIL needs to grow the f up.NTA", "NTA, you did your best and unfortunately the world\nis not going to change to accommodate your niece, they have to learn to live with the allergy.", "[removed]", "Yeah NTA. I used to belong to Bunko group but quit when at least half the woman were either on some super restrictive diet or decided they wouldn’t eat gluten, dairy, carbs, sugar etc but when you host you’re expected to provide dinner for the group. It became way too exhausting with some of them complaining at the lack of options and spread. Idk what they were expecting when all that’s left on the list is veggies with a dairy free dip and fruit.", "She was accommodated by having not just one but several options that are gluten free. What is not clear Witt the fact that the world doesn’t stop for her?", "NTA. Honestly, I would stop invinting SIL, Claire and brother to future birthdays parties and would let all them know that is because you don't like rude people that dont appreciate the effort tou made to accommodate your niece allergies.", "i’m convinced gluten is the magic that makes food not taste disgusting", "Partial comment stolen from u/tatersprout\n\nu/obvious_reading_9185 is a bot", "Amen to that, I'll definitely second that assessment.", "The owners use their profits to send \"advisors\" to developing countries to help pass laws making lgbtq+ ppl's existence a capital crime; I don't care if an entire Pride parade marches through the drive thru line, I won't give them a dime and I would absolutely cut off a friendship over it because \"agree to disagree\" doesn't cut it when lives are at stake.", "My niece is now gf, she made the most amazing meatloaf ever, till she had to go gf. She invited us when she first tried it. My husband told her it was just as good. She gave us leftovers. He damn near cried in the car on the way home it was so bad lmao. Our dog wouldn't even eat it. My husband finally fessed up to not particularly liking it and surprise! she hates it too. It was hilarious watching them mourn gluten 😂", "I'm trying to work out how you'd invite someone. Like in the OP's case, if you were organising an 8th birthday party for your child and you knew that one of your kid's friends was vegetarian. How would you phrase the invitation?\n\n\"You're welcome to come to the party, but there will be nothing for you to eat.\"", "Vegan versions of traditionally non-vegan food taste like absolute shit. This is known. Vegan versions may taste fine if you haven’t had the original in a while. I know because when my youngest was diagnosed with a dairy and egg allergy, I had to go from eating good food one day to eating nasty crap the next day.", "It's not unnecessary, it's providing sustenance for people. You believe it's unnecessary because of personal choice. You clearly do consider yourself morally superior based on your attitude about it. When in reality you are nothing more than a whiner.", "There's nothing wrong with vegan versions of food. They absolutely don't taste like \"shit\". And as you mentioned yourself, taste is subjective and adjusts. \n\nSentient beings shouldn't be stabbed and violently violated for unnecessary reasons. Pleasure is not a legitimate justification for violence in pretty much any serious ethical framework.", "You could eat plants for sustenance, so eating animals is absolutely unnecessary. \n\nNot to mention that due to the trophic level effect, animal agriculture quite literally reduces the worldwide caloric food supply. Food is literally an input of animal agriculture, not an output; which makes the cruelty involved even more barbaric and absurd.", "So does soy. Soy does unimaginable damage to farmland hence why more wildlife has to be cut to plant soy since it's previous farmland has ruined the soil.\n\nEating plants isn't necessary, you could eat animals for sustenance.\n\nIn the end a large majority of these vegan/anti-meat people do so for social clout, they claim to care about the environment when the only thing they do towards bettering it is trying to force change in others.", "NTA. I wish we could take allergies and shoot them outta of a cannon into the sun.", "NTA you did accommodate her. You knew of her specific allergies and made special food. If you had given that to everyone, there could’ve been other kids who couldn’t eat that (lots of vegan stuff is made with nuts). You worked with what you knew.", "Don’t invite your SIL over.  NTA", "I'm gluten-free, and what you did was above and beyond. This was accommodating and inclusive. NTA all the way.", "NTA. I was expecting a completely different story but you did a hell of a lot of work for your niece to be included. Sounds like you did an amazing job and went to a lot of trouble. You’re definitely NTA but your SIL is.", "NTA you did include Claire. It was not her party. SIL and Claire are entitled leave it alone. Let them cry somewhere else you did a fantastic job. Do not let them ruin the great job you did..BRAVO", "You did your best\nAs you said, the party was for your child and planning a party for an 8 year old is already a lot of work.\nIf her mom wanted morez she could have done it or ran it past you first.", "You already took an extra step and bought her food that she could eat. Another EXTRA extra step would have been to get everything the other kids ate but glutena nd dairy free, and that would be a little much, considering it's not your child. You could have also just made Claire eat just fruit and veggies, but you didn't. So NTA.", "NTA. \n\nI really understand Claire's point of view since I've been that kid. It is difficult to watch others eat something you can't over and over again and it makes you feel so excluded and lonely. It was even harder since back in the day there wasn't much choices to choose from. I always had my own box of treats. \n \nSo I get that Claire is frustrated and watching your daughter get sad and frustrated is not easy for a mother but she shouldn't have taken it out on you.", "NTA, you went above and beyond accommodating your niece and her entitled mother didn't appreciate it. Unfortunately your niece will probably learn this behaviour from her mum, which sucks. It's unreasonable to provide food that probably nobody would like for the entire party because of one person. I'd consider just not inviting your SIL and possibly your niece to anything in future.", "When it’s Claire’s party, the whole thing can be catered around her diet. It wasn’t Claire’s party. You went above and beyond already. NTA", "Absolutely NTA. Claire was a guest and you made sure there was appropriate food to accommodate her allergies. This wasn't her party.", "NTA", "NTA You did accommodate her. What they have to realise is this isn't her party", "NTA You accommodated her the fact they feel entitled for you to  plan the entire thing around them makes her TA. Tell SIL either appreciate the effort or they can be left out.", "NTA - you were MORE than accommodating. This was a party for YOUR child, not your brother's child. Imagine changing everyone's diet for one child when the day isn't even about her.", "NTA - you did enough. Not the child’s fault but no way should you and your daughter - who’s actual birthday it was - be forced to make and eat GF and dairy free food - let alone a whole party’s worth of other people. She was catered to and it could have been spun as her getting special food all to herself that she could eat and enjoy because her aunt cared about her but instead it was made into -,auntie doesn’t make someone else's birthday entirely about me and thats definitely going to be a problem going forward. SIL is an idiot.", "Definitely NTA. You did good mommy, your SIL needs to learn to manage her expectations.", "NTA. I think you did very well.", "NTA.\n\nEven as an adult I don't like eating gluten free and dairy free because the alternatives are awful. You did accommodate her needs, even going above and beyond.", "NTA", "You did accommodate her!  Nta.", "NTA\n\nI have worked.with that age group in the past, and some having similar/same allergies to the one you're mentioning. 99% of the time they were happy with the alternatives and could vocalize (without fit throwing) why they couldn't eat the same thing as everyone else. However that probably boils down to the fact that their parents probably explained to them that they can't always eat/drink the same as everyone else.\n\nOP you did what you could and while it doesn't make it right I bet your SIL is being hypersensitive that her kid isn't like everyone else. She's taking her frustration out on you when you did everything reasonable in your power to include your neice.", "You have provided a lot of options for your niece, as someone who has a lot of strict food restriction, I can relate that she is sad about it, but you did your best and you SIL is entitled. Even if all of the other kids eat the non diary, gluten free options, what would happen if Claire gets to different group of children anywhere else? People won't eat the same as her for the rest of her life, is better to help her to live with it than be entitled to others. \n\nNTA", "NTA you made all the accommodations necessary for her child. Don’t invite them again.", "NTA. \n\nMy niece has complicated allergies. She came to my son's party and I made sure I had good food (like not just a salad, which has apparently happened to her several times, as a 4yo child) she could eat, just like you did. Even my normally awful and entitled SIL thanked me for including her. \n\nYour SIL is over the top. You *did* accommodate your niece. And honestly, a kid with that many allergies and intolerances is just, unfortunately, going to have to learn that there's gonna be a lot of party food she won't be able to eat in her life. It's not her fault, and people *should* try to have *something* for her, but many won't. You did fine.", "Yea clear as day **NTA** You accomodated your SILs kid really nicely yelling at you is entitled and uncalled for.", "SIL is a piece of work....you made reasonable accommodations for your niece which is actually more than a lot of people would have done especially on Reddit. LoL. NTA", "NTA. I see it as she will have to, for the rest of her ,  not be able have certain food catered for her.\n Even if everyone else is having food, you can't. Kids learn this all the time.  You start at this age, so it's ingrained in them. Not just allergies.  Diabetes kids\n This way, when she gets into rebellious teen years, she has some awareness when out with friends", "NTA I am GF myself you did everything appropriate to include her", "For like ten percent of people food allergies are a way to be pretentious and bougie and controlling. Like your sis. NTA", "NTA.  Tell SIL that the world does not revolve around your niece, it revolves around your own children and they come first.  You did accommodate her child.  That was the minimum expectation.   You are not going to make the party \"gluten free\" to accommodate one person.  It's not her child's birthday. It's your own child's birthday.  Tell her to stop being selfish and get over herself.  She is being very VERY entitled.  Add that the next time.  Your children and husband first.  Everyone else can take a number.", "My daughter is allergic to dairy as well and I wouldn’t expect to come to another persons party and have accommodations made for her. If any were made I’d be grateful. NTA", "NTA - my son is a food allergy kid, now 18. He regularly doesn’t eat at parties or eats separate food. It is very kind when people go out of their way to have separate food so he can eat, but definitely not expected. He does NOT want people to go out of their way for him. He has a friend who is gluten free and whenever the boys order pizza they order a separate personal size gluten free pizza for him - they do not all eat GF pizza! \n\nSister in law and niece need to get a grip. As long as there aren’t cross contamination issues that put her health at risk (like if you cooked her pizza on the same pan as you had cooked the regular pizza) they should STHU.", "Claire needs to learn the world doesn't cater to her allergies, and there will be people around her having foods she can not eat. It sucks, but that is the real world, and her parents are not doing her any favors, keeping her in a bubble.\n\nNta\nYou were more than accommodating.", "NTA. This reminds me of a child in my daughter's 3rd grade class. The child was allergic to many food triggers including dairy. At school events/celebrations, the mom would demand that the entire class eat based ONLY upon her daughter's restrictions. This eliminate most goodies children love. Think: carrot muffins vs cupcakes.\n\nThis reached its flashpoint with the annual year ending \"make your own ice cream sundae\" social. The mom tried to insist that her daughter's ENTIRE class settle for apples and oranges while the rest of the school had the ice cream treat. Enough was enough.\n\nI did feel bad for the daughter. Unfortunately, her daughter was not popular.", "NTA you did accommodate your niece. However your nieces allergies do not get to dictate your child’s party. You sil is entitled!", "NTA.\ntitle is misleading because you did accommodate your niece. not only that you went above & beyond by getting her her own dessert too", "NTA, your title was deceiving because you not only accommodated you provided her with options.  SIL is a jerk", "Absolutely NTA. As someone with a gluten allergy, I would have been so happy to go to a party and not have to take stuff with me. \nThe majority of people are not that accommodating, and gluten-free food is expensive. \nYour SIL is very entitled, I feel sorry for your niece, she needs to know from a young age that she won’t be able to eat the same as everyone else all the time, and why she can’t eat it.", "NTA , however your SIL is a massive one. you already went out of your way to accommodate your niece's allergies and your sil should have been grateful that you did give special attention to her daughter's needs instead of behaving like an entitled jerk. honestly, with your SIL's behavior, I hope your niece won't be left out on other kids parties simply because her mom thinks everything revolves around her daughter and everyone should plan events based on her daughter's allergies.", "INFO: Is Claire within first year of diagnosis by chance? I don’t think you were the A but if this is a new thing they are all having a lot of Feelings right now and it’s hard for a lot of people so torn about whether your SIL is an A or not. Family especially needs to give them grace and space to grieve.\n\nAs an aside, if she’s celiac there is no chance she’s going to grow out of this, which is a bit different than your experience. I’m also going to note that while I think you went above and beyond, most 8 year old kids don’t care if something if gf and dairy free, just whether it is tasty and there are loads of options that taste great now. Don’t get me wrong: many people with allergies would provide a special meal due to the expense, and there are definitely still crap products out there but your take is dangerously close to coming across as GF DF food is inferior and that is not only often untrue but also unhelpful. \n\nIf niece has a true allergy or celiac btw, chips or veggies etc in communal bowl are not safe to eat while others are also eating cake and pizza and chicken tenders. That’s a cross contamination nightmare. So hopefully you had that separately for her.\n\nAnyway if it’s a new dx I would give it time and not necessarily change my approach. Don’t forget a stage of grief is anger. Next party talk about your plan upfront, maybe even with the kid. But they will have the feelings they have, even if they are unreasonable and I suspect that family is a safe place to express those feelings. Also sometimes we have expectations of family we might not have for non family, especially if the family is close.\n\nI think your approach was a lovely gesture.", "As soon as I got to the part where she said she made and bought foods specifically for Claire, I said, \"WTH.  She *did* accommodate her niece!\"\n\nI don't have food allergies, but I am on the spectrum.  I am fully aware that the world will never, ever become autistic friendly, simply because it can't.  SIL is doing Claire a terrible disservice by misleading her into believing that the world will accommodate her at every turn.  NTA.", "Absolutely, the amount of effort op went to was fabulous. Some folks would have given kiddo an apple for dessert. \n\nCan I mention that allergy free stuff is more expensive and again not fair to all the other kids, including birthday kid? \n\nI'm amazed that SIL thinks that someone else's whole birthday party should cater to her child. The chuppah on that lady has been sitting amazed. 😳", "I'm willing to bet the child could have eaten the regular food fine and the allergy is BS.", "The problem is that people like that woman feel the world should bend to the needs of her child and everyone else be damned.  To say that to OP, she should be totally embarrassed.  Op was very accommodating.  I would have told her, my children and my husband first, everyone else takes a number.   Your child is not the center of my universe.  I did my best to accommodate her. This is my child's birthday, not yours and I've told you this already.", "They don't let you bring your own food?! My kids have allergies and we always bring stuff for them.  Sometimes it's all they can eat. \n\n\nWhen this child starts going to school parties this mom better bring a gf/ dairy free cupcake or her child will not be getting any. Many people won't accommodate this allergy.", "Well I would still extend the invitation because its not the niece’s fault her parents are not nice but I would always extend it with the caveat that they’re not going to accomodate the niece more than they already have and if they have a problem they can provide more options, they can make a gluten free cake and gluten free pizza if that’s possible and of course have it available for everyone  to share of course. NTA.", "Not the kids fault though.", "No, that's poppycock. Poppycock was discovered in the 19th century, and has been used to add flavor to all the hooey-free foods we enjoy today. The good hooey, not the bad hooey.", "Amen!", "NOT true. Gluten is a protein, however its dairy, let me explain, these assholes companies just mix vegetarians gluten free and lactose free, WE ARE NOT THE SAME, gluten is like an allergy and these flashy diets are just way less important. If we had our own food, it'd be way better. FUCK THE DAMN LACTOSE FREE AND VEGANS, WE'RE NOT THE SAME.", "Instead of going after people who eat meat, why don’t you focus your energy on the companies who process animals in an inhumane way? I am a vegetarian but my husband and dogs are not. I researched and found certified humane meat sources local to my area. I would never try to take away their food choices so this was an option that I could stomach.", "Bravo! I’d love to continue along this vein, but I don’t have the quick wit for it. Hopefully, someone will come along…", "LOL.. do you know what the gas companies do with their money when it comes to LGBT rights?  Have you been to the middle east?   Have you given up buying gas?  I love how people cherry pick ONE SINGLE Company to embody all the world's troubles and decide THEY ARE EVIL! I HATE THEM ... but nah, I'm not going to give up every other company that does the exact same thing because that would ACTUALLY inconvenience my life. \n\nGood for you for having principles... only when it comes to chicken. Such a BOLD stand.", "Gluten free chips and crackers can also be very tasty, even better than the non-gf versions.", "It's a South Park reference and I'm grateful to Technical-Plantain25 for the reminder and the laugh this morning.\n\nhttps://youtu.be/3CC22ZwIEIM", "I found this and was like I KNOW ppl dont know about all these https://www.hrc.org/press-releases/200-major-u-s-companies-oppose-anti-lgbtq-state-legislation", "A friend makes a flourless chocolate cake - I believe the only ingredients are dark chocolate, butter, sugar and eggs. It is super rich like chocolate truffles. \n\nProbably not suitable for a kids b-day party though.", "Thank you for that wonderful point! You are actually correct, that soy does do damage to the ecology of the planet. https://wwf.panda.org/discover/our_focus/food_practice/sustainable_production/soy/\n\n> In fact, almost 80% of the world’s soybean crop is fed to livestock, especially for beef, chicken, egg and dairy production (milk, cheeses, butter, yogurt, etc). \n\nSo if you are against the damage that soy production does, that's another wonderful reason to become vegan."]}