{"id": 10626, "submission_id": "1191awh", "title": "AITA. Husband doesn’t think I should get a new car because he doesn’t think I can take care of it", "selftext": "I (46f) was talking to my husband (46m) about my car yesterday.  It’s going on 13yo.  As much as I love my car, it’s getting up there in years and will not remain reliable.  I’m not suggesting we replace it tomorrow, but it would make good sense to start planning now for a new car in the next year or two.  Hubs said he didn’t think it would be a good idea, I should think about a used car.  Ok, cool.  New or used, I don’t really care.\n\nThen he said it was because I don’t take care of the car.  Umm, excuse me??  What the hell does that mean?  He’s the auto mechanic so he’s the one who’s responsible for maintenance.\n\nHe then goes on about a few occurrences that has happened in the past with the car.\n\nScenario 1:  \nI was leaving a store and backing out of my parking spot.  I saw in the rear view that someone else was backing out of a spot behind me.  I slam on the brakes and hit my horn, but dude had gunned it outta there and we hit.  Younger guy with his wife a baby in the car.  He was really apologetic and said his kid was screaming and was just trying to get home.  I’m an insurance broker, so as much as I hate that this happened, I know how it’ll work out.  We were both reversing in a parking lot so at best it would be deemed 50/50 at fault.  I told him as much.  I had a small crack on the side of my bumper and he had a large scuff.  With a sigh, I suggested we just shake hands and go on our way.  It only took him a split second to grin, shake my hand, and get the hell out of there.\n\nI drove with that cracked bumper for close to a year, until…\n\nScenario 2:\nI took my kid camping.  It was a mother/son weekend so hubs stayed home.  Had a pinhole leak in my air mattress on the first night and woke up cold and on the ground.  I couldn’t find the leak to patch it and I’m not dealing with this all weekend.  Jumped in the car and drove us into town to buy a new mattress from Wally World.  Came out and what did I find?  You guessed it… someone hit my car (same spot) and took off.  Bumper is now severely damaged and the tail light broken.  Hit & Runs are considered not at fault, but still cost us the deductible.\n\nScenario 3:  \nI used to work at an office with a very sweet lady.  Her and I were pretty friendly with each other.  One day, she parked beside me when she returned from lunch.  The wind took her door from her and hit my car.  She made a bee- line to my desk to let me know what happened.  She was very apologetic and offered to pay for the damage.  My car was probably close to 10yo at the time and already had door dings.  The damage she did was not much greater than that so I told her not to worry about it.\n\nSo in the span of 13 years, these scenarios are the best that my husband can come up with.  Am I the AH for suggesting a new car?", "created_utc": 1677076924, "permalink": "/r/AmItheAsshole/comments/1191awh/aita_husband_doesnt_think_i_should_get_a_new_car/", "score": 127, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Husband thinks I shouldn’t get a new car because of damage that occurred on the old one, over the course of 13 years\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. In 13 years three issues, 2 where you are entirely blameless, one where, let's be honest, you realistically also weren't at fault.\n\nThe blatantly condescending nature of his comment aside, what's his history with motor vehicles? How many issues has he had? Is his motoring history entirely spotless?", "NTA. \n\nBut I suggest buying back and front cameras for future accidents, not only for insurance purposes but to get him to shut the hell up.", "NTA.\n\nGet yourself a new car. His comments were completely unnecessary and irrelevant.", "INFO: why didn’t you ask your husband what he meant by what he said?", "NTA.  You work, you drive, you need a car.  You want a new/newer car?  Start making yourself car payments in a savings every month, as if you are making car payments.  Once you get a good lump sum saved up, trade in your car, put down that big fat down payment and drive away happy.  And if your husband doesn't want to maintain the car, take it to his competitor <G>", "[removed]", "No. Nta. This is life and things happen.  You can't expect to have a car 13 yrs and it still look pristine.  Especially w children.", "NTA. Cars get bumps and scratches no matter how hard you try to stay safe. Doesn't mean you shouldn't get a new one after your old one has finally kicked the can. Your husband sounds like a jerk.", "NTA\n\nIf he’s worried about you not “taking care” of the car, lease a new one, tack on the warranty and repair shit, done\n\nNothing to worry about then", "NTA\n\nI've had my car for 10 years. I've been rear ended twice, had someone \n ding my door at IKEA, found a lady *sitting on my trunk in jeans with rivets chatting*, and other stuff.\n\nShit happens. A car is a tool, and tools get worn down.\n\nIts not like you never changed the oil, never rotated the tires, etc.\n\nYou work, you need a replacement car, and you deserve one. A modest used car is 100% reasonable for any working adult.", "I'm chuckling as I read this post, because my sister has had waaaay more accidents than you... In a single year.\n\nNTA. Your husband is being weird.", "NTA.  Your husband’s comment seems totally unnecessary under the circumstances.  Is there a different (and real) reason he doesn’t want you to get a new car?  Does he often say you are careless when you don’t think you’ve been?  \n\nThis could be just a one-off, or it could be another sign of something bigger.  I would try to figure it out.", "NTA. Your husband has odd standards.", "His objections don’t really make sense (unless you are also quite rough on cars while driving…?) I might make sure this isn’t a cover for another objection like money not being what you think it is or he wants a new car and doesn’t think two at once is ok. NTA", "I almost wonder if he's not trying to set OP up to get his current car as a \"new\" car so he can go get a new one. NTA all those examples are invalid because not one shows you as an irresponsible party; parking lots suck.", "NTA - but your husband surely is!!!", "NAH you clearly don't care if your car looks brand new so there is no point in paying for the \"new car smell\" premium, I'd suggest the term \"replacement car\" instead, plus as a car mechanic he could stumble on a deal at work that you could take advantage of.", "NTA...what does your husband drive?  Is it pristine and has he never had any occurrences? \n\nI personally lean toward pre-owned cars (2-3 years old), but that is for you to decide.  Your husband is being an AH and trying to control what you are allowed to have.  Does he have other control issues, or is it just cars?", "Jeez when you said he did the maintenance, I thought your examples would have been blowing the engine up or something. He's being ridiculous. I've had atleast 2 similar incidents and hit a deer. What a goon. Nta. Get yourself car", "NTA\n\nThat’s not much in 13 years and none of them were really your fault. He’s being an ass", "Sounds like he is upset you keep telling people to forget about taking any responsibility for damaging your car. In a way I don’t blame him, so soft YTA.", "INFO: What aren't you telling us?\n\nSwimming against the stream, I feel like you're probably gilding the lily a little bit here. This screams unreliable narrator", "YTA.\n\nYour husband is right. You aren't taking care of your car. You're letting your niceness get in the way. Of your three scenarios, the first and third should have gone through insurance. Not going through insurance is you not taking care of your car.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (46f) was talking to my husband (46m) about my car yesterday.  It’s going on 13yo.  As much as I love my car, it’s getting up there in years and will not remain reliable.  I’m not suggesting we replace it tomorrow, but it would make good sense to start planning now for a new car in the next year or two.  Hubs said he didn’t think it would be a good idea, I should think about a used car.  Ok, cool.  New or used, I don’t really care.\n\nThen he said it was because I don’t take care of the car.  Umm, excuse me??  What the hell does that mean?  He’s the auto mechanic so he’s the one who’s responsible for maintenance.\n\nHe then goes on about a few occurrences that has happened in the past with the car.\n\nScenario 1:  \nI was leaving a store and backing out of my parking spot.  I saw in the rear view that someone else was backing out of a spot behind me.  I slam on the brakes and hit my horn, but dude had gunned it outta there and we hit.  Younger guy with his wife a baby in the car.  He was really apologetic and said his kid was screaming and was just trying to get home.  I’m an insurance broker, so as much as I hate that this happened, I know how it’ll work out.  We were both reversing in a parking lot so at best it would be deemed 50/50 at fault.  I told him as much.  I had a small crack on the side of my bumper and he had a large scuff.  With a sigh, I suggested we just shake hands and go on our way.  It only took him a split second to grin, shake my hand, and get the hell out of there.\n\nI drove with that cracked bumper for close to a year, until…\n\nScenario 2:\nI took my kid camping.  It was a mother/son weekend so hubs stayed home.  Had a pinhole leak in my air mattress on the first night and woke up cold and on the ground.  I couldn’t find the leak to patch it and I’m not dealing with this all weekend.  Jumped in the car and drove us into town to buy a new mattress from Wally World.  Came out and what did I find?  You guessed it… someone hit my car (same spot) and took off.  Bumper is now severely damaged and the tail light broken.  Hit & Runs are considered not at fault, but still cost us the deductible.\n\nScenario 3:  \nI used to work at an office with a very sweet lady.  Her and I were pretty friendly with each other.  One day, she parked beside me when she returned from lunch.  The wind took her door from her and hit my car.  She made a bee- line to my desk to let me know what happened.  She was very apologetic and offered to pay for the damage.  My car was probably close to 10yo at the time and already had door dings.  The damage she did was not much greater than that so I told her not to worry about it.\n\nSo in the span of 13 years, these scenarios are the best that my husband can come up with.  Am I the AH for suggesting a new car?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta", "Idk about any of his but 13 years isn't that old for cars anymore. Back in the day a car would last for maybe 100,000 mi or 160,000 km but it's reasonable to expect double that from anything made this century. 20 years isn't that old for a car anymore.\n\nThey don't make em like they used to, they're substantially and significantly better.", "NTA. Those accidents weren’t even your fault, and you took care of them after they happened. Your husband’s comment was rude and condescending.", "NTA", "‘Took my kid camping’\n\nSeriously your husband considers you not responsible enough for a car but responsible enough for a child??\n1. You’re a grown ass adult,  not his child.\n2. All the reasons listed are external incidents and only one you would even entertain the notion of being partially responsible for.\n3. Seriously he thinks you’re AOK with a child but can’t manage a car - and gives 0 examples where you abused or misused the car or showed bad driving. \n\nNTA - show your husband the comments, he’s an AH and Reddit will not be nice about it.", "NTA, but your husband is a dick. Get yourself a new car. Fuck him.", "NTA. Get yourself that car. His comments were unnecessary and shitty.", "NTA", "I did.  He just said that those examples clearly showed that I didn’t care what happened to the car.  He then said that he was sure he could think of more examples if he stopped to think about it longer.  It was probably the dumbest argument I’ve had in a long time", "Her husband sounds jealous that she's planning to get a new toy and he isn't.", "Ahh ok, I took you saying ‘what the hell does that mean?’ as an actual q that you hadn’t asked him what he meant.", "The funny (not funny haha) thing is I had a similar accident in a parking lot. I thought similarly to you wrt involving insurance. My car was way more banged up than his, and the impact was on the diagonal back passenger side/ the side of my car than a direct hit square in the back. It showed I was more into turning than he was. I was willing to just call it a mutual fuck yo, but he insisted on calling the police, which also was fine but it screwed up my day.\n\nI got my car fixed, told the insurance people that it happened at Publix, and they have cams outside. A month or so later, I got my deductible back in the mail because the location of the hit, coupled possibly with the footage (idk if they got it), proved that I wasn’t at fault and his ins paid up.", "Yes, it is dumb. My friend's family car is old and busted as well. Scratches, dings, cracks, it has them all. Like you, they probably decided at some point that it wasn't worth putting money into cosmetic issues on an old car. There's nothing wrong with that. It's not like you're driving under influence, or crashing into others every month. The only explanation I can think of is as a mechanic, hubby doesn't like seeing cars in anything other than pristine condition. That's a him problem, not you problem.", "Yer not wrong…", "Nta, I thought this was going to be maintenance related or you braking super hard or chirping the tires etc.  \n\nThis has nothing to do with taking care of a new car these are things that happen to new and old cars.  Your husband is just being a bit of a dick because he probably treats his cars like gold", "NTA.\n\nBut lady, you have a job and are a grown adult. If you want a damn car then go get a damn car. You dont need your husband's permission to get a damn car. You an adult. Do what you want.", "NTA. Accidents happen. No one plans on getting in accidents. Three in 13 years is not bad. Regardless of that, though, the car is 13 years old and is becoming unreliable. You need a car that will be reliable to get you to point A to point B safely. Your husband's concern on if you will take car of the care is pointless since you will still need a car that can be reliable.", "NTA, I thought he'd be talking about changing oil, changing a flat tire, you know maintenance stuff. My husband was a mechanic when we married and still works on cars as a hobby. He made air I could do all of that, I don't need to, but I can. \nWhat he's talking about, all but 1 were out of your control.", "Nta husband is.", "NTA. I think 99% of drivers have had some sort of accidents, and that’s what they are ACCIDENTS. Is he such a perfect little angel that has never even had as much as a scratch on any of his cars? Even if they were an accident, according to your husband accidents mean you can’t take care of your car so if he has then tell him to stfu, he sounds like grade A 🔔end", "NTA, although I think you should buy a used car because a new car will depreciate in value the minute you drive it off the lot.  I’d look for a year-old car with low mileage.  I’d also ignore my judgmental husband who can’t tell the difference between at-fault and not-at-fault.  It must be tiring to be so perfect.\n\nOn the other hand, if you’ve never had a brand new car and you want to experience it, DO IT!  Enjoy that new car smell.  Either way, it should be your choice.", "NTA\nAnd if you're in the US, used cars are crazy high in price right now. Better off getting new", "NTA - seriously reconsider this relationship with him tho,  is he always this condescending and dictatorial?", "NTA.  Your husband is.  And it sounds like you are in an excellent position to explain to him about this wonderful thing called \\*insurance\\* that covers the car, he seems a bit clueless about that aspect.", "NTA This has nothing to do with your driving. \n\nYour husband is either trying to exercise control over your (shared) finances or your (individual) transportation or both.\n\nWhat other reasons would he have for doing that that he couldn't be willing to share with you?", "NTA if you are doing regular maintenance. Oil changes, part replacements as they age.\n\nThe people who are suggesting to start to put a month's car payment away now each month is a good idea, have a nice down payment on a car. Plus, if the current one does give out, you will already have a little bit towards a new or new used one. \n\nHusband is full of shit.", "None of these situations suggest that you're unable to take care of your vehicle, these are all total freak accidents that happen to anyone. And only 3 accidents in 13 years? That's a GREAT track record. My family bought a new car in October and it got totalled two weeks ago (no fault of our own; another vehicle failed to brake in poor weather conditions). Before that, we had a car for 7-10 years with 0 accidents or damage. Shit just happens!\n\nNTA at all. It's more than reasonable to replace a 13-year-old car.", "NTA. But your husband is - what you have described is minor (and in two cases, entirely out of your control).  If he's using this as an excuse because he has other concerns he doesn't want to talk about (e.g. maybe he has money worries), then he needs to tell you what his real concerns are.", "You're husband is a cheap AH.", "Even if she did have one or two incidents that were her fault that’s just life, accidents happen and a few over the span of 13 years can hardly be considered reckless. Her husband is an asshole.", "Wait: these are cosmetic issues. What about the mechanicals? How many miles /km? Are there reliability issues?\n\n1. These excuses for not buying a new/used car are lame.\n\n2. OP’s reasons for wanting a new car are just as lame. \n\nCars are an expensive tool. I’ve owned 6 cars in 40 years of driving. Each one well over 100k miles. Some bought new at the end of the model year (very good discounts!) several bought used. \n\nOP sounds like a careful driver, though I question the need/want for a new car - additional expense - higher insurance etc.\n\nAttitudes and reasons both suck. Rephrase the conversation NAH", "Didnt upvote as you did not give judgement.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", ">A car is a tool, and tools get worn down.\n\nI agree with this. I get annoyed when people say a car is an investment.", "Check your finances/savings.  There may be less in the family resources that you have been led to believe", "I mean, no? They're safer now, they're better for the environment as far as pollution goes, but they're not better. My dad's cars from my childhood in the 80s and 90s never had less than 350k miles before replacement. They were also much easier to fix yourself.", "This is the only thing that makes sense to me.", "A new car is, generally, going to be reliable for longer than a used car.", "On the other hand … they are married & car payments, and higher insurance impact the family budget. \n\nWe drove old cars, used cars, said no to remodeling the kitchen for our family budget.", "So you get a car every six years, but you don't think OP should get a new (to her) car when gets is 13 years old?", "6 cars in 40 years of driving is a new car every 6-7 years. OP’s doubled that amount of time between cars. A new car is warranted by your standards.", ">OP sounds like a careful driver, though I question the need/want for a new car - additional expense - higher insurance etc.\n\nHer current car is 13 years old. A newer vehicle would be safer, more reliable, and more efficient. Add in all the other amenities newer vehicles have and it totally makes sense to want a new vehicle", "OP doesn’t have to justify wanting a new car to *you*. A 13 year old, dinged up vehicle is a totally reasonable thing to want to replace.", "It this day and age, late model cars are often not that much cheaper than current models. For example, when buying my last car (Subaru Impreza) the late model cars in my area ended up being more expensive than a new model because they were all of a much higher trim package than I wanted.", "She said she would be fine with a used car as well.", "How old is your husband’s car? Is he perhaps eyeing up some shiny new thing in the dealership’s window for himself?", "My husband and I both drive cars that are 10+ years old, and will probably drive them as long as we can. But I am really looking forward to some of the amenities that are basically standard on newer cars, like back up cameras!"]}