{"id": 10779, "submission_id": "11alsef", "title": "AITA For not giving my step sister a family heirloom", "selftext": "My (F 20) step sister “Abby” (F 20) has moved out since our grandma gave me her diamond necklace. \nMy mother married Abby’s dad. My stepfathers parents both passed not too long after they got married.  Abby has always hated going over to my grandparents, and she’s not always nice to them. She has no desire for them to have any type of a relationship.   \n  Abby and I were super close growing up. But something changed after high school.  I left for college and she stayed home, then dropped out of community college to pursue another opportunity, but it fell through. \n\nWhen I came home for Thanksgiving break I could tell things were off between us. She’d blow me off and wouldn’t talk to me.  Then the same thing happened over Christmas break. I’ve sent texts and calls all read but none responded to. I then reached out to my mom to see if she knew anything, and she said she figured it was jealousy, so i gave her space. \nHer birthday is right around the first of the year. So that day I sent her flowers, ordered her food on doordash, and sent her a corny text message. I didn’t do any of it for her to “praise” me, but I did expect a text back. But I got nothing. \n\nFast forward three weeks to my birthday, I flew home so my family and I could have dinner together. Abby opted not to come. At dinner my grandmas gave me a diamond necklace that was a family heirloom. She wore this necklace everyday and had promised me since I was a little girl that one day it would be mine.\n\nAbby was in the living room when we all walked in from dinner, immediately she saw I had the necklace on. This is when all hell broke loose. \nShe jumped up from the couch and got about 3 inches from my face screaming that I knew she loved that necklace. And that she had begged for it to be left to her. So I snapped back and said it was a family heirloom and that it has always been mine. \n\nShe then said I implied she wasn’t family and how I was a self centered bitch. I told her she didn’t want to start with me. And she said since the necklace is supposed to be given to the first granddaughter we should sell it and split the money so it’s fair. At this point I had enough, and I told her no and that she just wanted the necklace for the money and she didn’t care or couldn’t begin to appreciate the history behind the necklace. And that she didn’t even love my grandparents, and that they were just money signs to her. Abby then stormed up stairs packed a bag and left. \n\nShe’s now not returning anyone’s calls and says she will come home after I agree to split it with her or give her the necklace. My mom and stepfather think I took it too far and that I was a jerk. And I should just split the necklace with her to end this nonsense. I refuse, so am I the asshole?", "created_utc": 1677224749, "permalink": "/r/AmItheAsshole/comments/11alsef/aita_for_not_giving_my_step_sister_a_family/", "score": 1210, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel as through I may have said some hurtful things. I may also be selfish because I refuse to compromise.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "She is your step sister with NO BLOOD TIES to Grandma. She doesn’t like them and treats them unkindly. She does NOT deserve any part of the necklace. It is yours-wear it with love!", "NTA --- My advice to you would be to get a safety deposit box at a bank and put your necklace in there or one day you are going to discover it's \"missing\" along with your stepsister.", "NTA.  Watch out.  She'll steal it.", "NTA. Your grandmother gave it to you, not Abby. You're not obligated to sell a family heirloom given to you as a gift. It's outrageous that she would even ask.", "NTA. She doesn't get to be rude to your grandma, and then demanding family heirloom after not wanting to have any kind of relationship with her. She herself clearly doesn't see your grandma as her family, and now she is accusing you of implying she is not family.  \nTo be honest, she sounds to be extremely entitled person.  \nPlease, make sure she doesn't get her hands on that necklace.", "Sounds to me like this is not the first time your stepsister has been difficult given the fact your mom/step dad aren’t handling her behaviour themselves.\n\nGet a safety deposit box for the necklace. I’d maybe even go as far as getting it appraised and having some insurance on it just in case something should happen to it as you know she’ll either steal it or purposely destroy it. \n\nNTA", "NTA what the fuck? Obviously something is going on with her, could be jealousy or shame or something more that you arn't being told, idk, but none of it makes any of this your fault OR responsibility. Your grandma literally gave you the necklace, even if it wasn't a family heirloom it is still her choice. Don't sell or share it, and keep that thing very safe and far away from Abby AND your parents for the time being just to be on the safe side because they should not be advocating you have joint custody over a peice of jewelry because she's throwing a massive tantrum.", "\"You know i loved that necklace, so we should sell it\"\n\nThats completely logical\n\nNTA", "NTA.\n\nAbby wins top prize, and your parents are a close second for even entertaining the idea you should split the necklace just to keep the peace. I’m guessing this (non-)approach to conflict resolution in the family is why she feels she can even make that demand.\n\nFind somewhere safe for the necklace. Yesterday.", "NTA, you recognized exactly why she wants the necklace, don't back down. I mean could you have been nicer during the fight and not thrown those things at her head during the fight, sure, but sometimes emotions just boil over...", "NTA. \n\nShe was an a-hole. She never wanted to have a relationship with her grandparents and now when the necklace comes into the picture she suddenly is interested ? \n\nAnd don't sell it or split it ! It's a family heirloom and you realise it's importance and that's why you are cherishing it. Meanwhile she seems to be wanting the money/ just jealous that you have it. \n\nAlso be careful.. if she can go to the extent of not coming home wanting the necklace ..i believe she can do something further...just saying.", "NTA. Your step sister is an entitled piece of work. Get a safety deposit box at a bank and lock that baby up. She's dangerous and she will try to spite you. I'd be careful wearing it around her, she may try to ruin it.", "NTA, your Grandmother passed on a sentimental necklace to you, unfortunately she’s your step sister and is no way entitled to anything your Grandmother gives you. I’d be hiding the necklace, and telling your parents If it’s about the money they should be happy to give Abby some!", "NTA - It was a gift to you from your own grandmother.  She has her own grandparents to leave her things (which I don't think she would be sharing with you), and apparently didnt want a relationship with your extended family.", "Nta and nope.\n\n\nNever bring that necklace near to her.", "Nope, that necklace is yours period.", "NTA. Don’t give her s***. She can not come home then and shame on your mother and stepfather for siding with her.", "Get that necklace somewhere safe. You can not trust your mom not to take it and either give it to your SS or sell it. She treated your maternal grandparents like shit. If she had treated them well, while she still wouldn't have been entitled to a family heirloom, she might have received something. NTA, that would be your stepsister and your mom & stepdad for siding with her. Everything you said about her was true. She has no claim to the necklace.", "NTA. Your grandma wanted you to have it", "NTA. Like you said, it's a family heirloom. You deserve it, she doesn't.\n\nGo NC with your mom untill she apologises for even asking you to sell it. She's a bigger asshole. And your step-dad is a joke.", "NTA", "nta\n\nshe is not blood-related and didnt even try to create a relationship.. so i dont see any reason why she should get it", "NTA Hell no. That necklace belongs to you. Your grandmother intended for you not Abby. Abby is self-centered and thinks only of herself and money. She never even liked your grandmother. Do not let go of that necklace otherwise you'll regret it. Remember it came from the heart of someone precious to you.", "NTA.\n\nHeirlooms seem to cause quite a few conflicts.\n\nSelling it will destroy the heirloom. That would be the dumbest thing to do.\n\nGuard the thing well, so it doesn't dissappear.\n\nIf its really to be split (only your grandmother can decide that) then I guess you could buy her share of the necklace... but that's giving in to her tantrum.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (F 20) step sister “Abby” (F 20) has moved out since our grandma gave me her diamond necklace. \nMy mother married Abby’s dad. My stepfathers parents both passed not too long after they got married.  Abby has always hated going over to my grandparents, and she’s not always nice to them. She has no desire for them to have any type of a relationship.   \n  Abby and I were super close growing up. But something changed after high school.  I left for college and she stayed home, then dropped out of community college to pursue another opportunity, but it fell through. \nWhen I came home for Thanksgiving break I could tell things were off between us. She’d blow me off and wouldn’t talk to me.  Then the same thing happened over Christmas break. I’ve sent texts and calls all read but none responded to. I then reached out to my mom to see if she knew anything, and she said she figured it was jealousy, so i gave her space. \nHer birthday is right around the first of the year. So that day I sent her flowers, ordered her food on doordash, and sent her a corny text message. I didn’t do any of it for her to “praise” me, but I did expect a text back. But I got nothing. \nFast forward three weeks to my birthday, I flew home so my family and I could have dinner together. Abby opted not to come. At dinner my grandmas gave me a diamond necklace that was a family heirloom. She wore this necklace everyday and had promised me since I was a little girl that one day it would be mine.\nAbby was in the living room when we all walked in from dinner, immediately she saw I had the necklace on. This is when all hell broke loose. \nShe jumped up from the couch and got about 3 inches from my face screaming that I knew she loved that necklace. And that she had begged for it to be left to her. So I snapped back and said it was a family heirloom and that it has always been mine. She then said I implied she wasn’t family and how I was a self centered bitch. I told her she didn’t want to start with me. And she said since the necklace is supposed to be given to the first granddaughter we should sell it and split the money so it’s fair. At this point I had enough, and I told her no and that she just wanted the necklace for the money and she didn’t care or couldn’t begin to appreciate the history behind the necklace. And that she didn’t even love my grandparents, and that they were just money signs to her. Abby then stormed up stairs packed a bag and left. \nShe’s now not returning anyone’s calls and says she will come home after I agree to split it with her or give her the necklace. My mom and stepfather think I took it too far and that I was a jerk. And I should just split the necklace with her to end this nonsense. I refuse, so am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA insure that necklace and keep it locked up.\n\n&#x200B;\n\nEDIT your grandma kept her promise to you to give you the heirloom necklace.", "Huh? So she is treating you like crap for some time now, doesn't talk to you and doesn't even say a word when you send something over for her birthday, yet when you receive a present from YOUR grandma she demands at least half of it and your mom and stepdad are on her side?\n\nWhat the hell is wrong with your stepsister and even the rest of your family? Your stepsister was way out of bounds with her demand and behaving ridiculously. Mum and dad better tell her to stop this nonsense. \n\nNTA", "NTA\n\n\nYou know who took it too far? ABBY!\n\n\nYou know who is being an entitled jealous toddler? ABBY!\n\n\nYou know who is enabling Abby's behavior? Your mom and step dad, and anyone else supporting her ridiculous demand.\n\n\nThis was a family heirloom from your grandmother, who not only is your blood relative, but who has been in your life and you in hers since the day you were born, so regardless of who is older or who is blood, YOU ARE THE FIRST GRANDDAUGHTER.  \n\n\nAbby wanted no relationship with them, didn't see them as grandparents, BUT she expected to inherit from them.   The fact is, this isnt about the necklace, this is just her excuse to attack you and make her to be the victim.  Why?  Because she has been cutting you off and treating you like dirt, because she is jealous of you because of her own life choices. Your getting everything SHE WANTS AND ITS NOT FAIR!\n\n\nLet me guess, she didn't like that she couldn't afford to go to or couldn't get into better schools?  Is that what she is jealous of?  Or was it that she expected you to not go off to college and do what she did?  Or did she just make the choice to stay back and then drop out for no good reason, and she now resents you for making better choices and is projecting onto you?\n\n\nI think she came at you thinking you would just take it off and give it to her, she knows you have been trying to connect with her, what she didn't expect was for you to defend yourself and tell her the truth, this is a family heirloom and it was always meant to be yours.  She is still part of the family, and you weren't saying she wasn't, but it would be like you demanding a family heirloom from her dad's mother, it's different.  Not to mention, even if she was close with your grandmother, your grandmother promised it to you.\n\n\nIn the end it doesn't matter.  IT WAS NEVER HER NECKLACE TO DEMAND!!\n\n\nSHE CHOSE TO CONFRONT YOU!!\n\n\nTHIS ISNT ABOUT HER WANTING THE NECKLACE. IT'S ABOUT HER NOT WANTING YOU TO HAVE IT, WHICH IS WHY SHE WANTS TO SELL IT!\n\n\nSo let her have her tantrum while you travel back to school WITH THE NECKLACE (or put it in a safety deposit box, cause if your mom holds it, it will go missing).   Tell your parents that they need to see the situation for what it was, that it's not your fault her feelings were hurt, that she didn't care about your feelings for all this time and she didn't care about confronting you and starting this.  That she isnt entitled to treat you like this or to demand anything.\n\n\nPlease don't sell it, if you do it won't solve her issues and it would make you TA if you did.", "NTA and I dont think you should continue to think of her as a sister. She isn't acting like she thinks of you as family and it sounds abit like she might me into some stuff that other might not approve of with the way she is distancing and only caring about monetary value of your family's sentimental pieces. (Drugs, sounds like drugs) dont trust her and yay keep the necklace with your person when at your parents or put it in a safety deposit box along with any other valuables you wouldn't want her stealing. Abby is in the wrong and your mom and step dad want to keep the peace by pretending everything is fine and its not fine. Sisters don't ignore each other like that. Not even a thank you or a hey Im busy is complete bullsheet.", "The way your parents are reacting to this unreasonable request by your stepsister could explain how at 20, she's still acting like a 5-year-old. Have they always given in to her tantrums? There is absolutely no reason you should have to split a GIFT with her. NTA and maybe give yourself some space from your parents and stepsister. Take steps to ensure the necklace is safe and documented as yours. Enjoy the gift and memories, and live your life. If they bring it up, shut it down and let them know you are done talking about it.", "NTA Keep the necklace safe, away from your mother especially. She's not on your side.", "NTA\n\nShe’s acting like a spoiled brat. Absolutely do not give her that necklace nor sell it. Keep it someone where safe in case she or someone else tries to take it from you. And stop begging for her attention. If she doesn’t want to talk, fine. Continue to live your life. And be firm with your mom and her husband and let them know that what they are saying is not ok and you don’t appreciate how they’re taking her side when they see how she’s been treating you.", "I was thinking the same thing. \n\nNTA and your mom needs to quit trying to placate her husband and stepdaughter and step up and do the right thing. Tell your grandma they are trying to demand you sell the necklace. I am sure she would love her daughter is trying to force you to sell a treasured family heirloom to make her new family happy.", "This is a fact I came here to state, Abby seems too spoiled, with 0 prospects of any future, probably why she's so desperate for the cash...", "I'd go as far as saying you're obligated to not sell a family heirloom", "Yea her parents are 100% enabling.\n\n\n\nShe hates OP cause she GETS EVERYTHING ABBY WANTS!", "I find it funny that she had no close relationship with the grandmother, yet said she had already asked for it to be left to her.\n\n\nLike did she ask the grandmother she had a distant relationship with for her diamonds?  Or was this a case of her telling/demanding to OPs mom that she wanted it.  I bet anything OP doesn't realize that Abby always knew it would be OPs, and that she and Abby were not as close as she thought.", "But why would she even buy her stepsister’s share on the necklace when she literally has no share in it. She has zero claim, zero entitlement, zero anything to the necklace and gets zero out of it. Sounds like pure jealousy.", "> only her grandmother can decide that\n\nThat's why that phrase is in my comment.\n\nAs soon as the grandmother decides she has a share in it, she has a share in it...\n\nNot that that would be a good thing though.", "[deleted]", "NTA and DO NOT SELL THAT NECKLACE. Abby is not a blood relative and has no rights to family heirlooms. If her grandparents had left her something, you think she’d turn around and say let’s sell it and split it because you should have inherited it too? You damn well know she wouldn’t, nor would your step father. \n\nScrew them all. Tell your grandma what happened and make sure that necklace stays safe while you’re around your family.", "Don t you even think of \"splitting\" it, that's just crap. \nI think you were too nice in your response, she was aggressive, entitlement and unreasonable, so tell your mother and SD to cut the crap. No the SS is an adult and by no means it's a good idea to enable her trashy behavior\n\nThe necklace was promised to you, no matter the relationship between SS and grandmother. End of story\n\nKeep it safe and never let her borrow it. She will ruin it out of spite. Also, keep it safe from your mother and SD\n\nNTA", "The entitlement here is crazy....", "NTA. Do NOT sell this heirloom and do not give it to Abby!! Please keep it and keep it safe from her.", "NTA. Your grandmother had told you it would be yours since you were a child. She’s not entitled to the necklace. Especially since she apparently has no relationship to speak of with your grandmother. You absolutely shouldn’t give her the necklace or sell it and split the money with her. Keep it. But if I were you I’d pay close attention to your necklace to make sure she’s not going to steal it.", "Begged who? Your grandparents she doesn't like? NTA. \n\n>And I should just split the necklace with her to end this nonsense.\n\nThe necklace isn't theirs so that's too bad for them. Can you go stay with your grandparents over holidays? I'm sorry you flew home on your birthday to have to put up with this nonsense.", "NTA- She’s not blood family and only wants it for the money. Get the necklace out of your house ASAP.", "NTA. They’re YOUR grandparents by blood and if it was promised to you and given to you, then it’s yours a no one else has a say in that. \nYour step sis is projecting *HARD*. Don’t give in, don’t apologise. If it turns out she doesn’t want to be in your life then it’s no loss to you, since she’s incredibly selfish and self-centred.", "How about you have a cheap copy made  ang give it to her? And then you put the original one in a safety deposit. NTA", "NTA\n\nYour grandma chose to give her necklace to you, not her.\n\nAs others have said, make sure you keep it somewhere safe where she nor your mom and step dad can not get access to it.\n\nAlso, in the future, when she gets married, do not let her borrow the necklace for her wedding as she will then claim she should keep it for sentimental reasons, and you will never get it back.", "NTA. Is she in financial difficulty or involved in something sketchy? Or just jealous at your different paths in life? Neither is your problem but you clearly still care about her, so understanding why she's behaving like this might make it easier to step away from her and get some healthy emotional distance.\n\nPut the necklace somewhere safe away from your house. Deposit box has been mentioned or maybe even ask your gran or another trusted family member to keep it safe for you. If your mother and stepdad want things to be 'fair'  they can buy your step sister her own necklace.", "NTA why do people feel so damn entitled these days? Its absolutely ridiculous.", "Nta and please HIDE that necklace. She is literally being a brat", "NTA. And OP, I hate to say this but with a drastic change in personality like this it makes me think either drugs or some kind of sudden onset mental disorder. I wish you the best and hope you someday get your step sister close to back to the way she was.", "NTA hide that necklace. they’re going to steal it. i’m", "100% THIS, OP!  If she's already causing this much drama over the necklace, you need to do whatever it takes to protect it.\n\nDo not give in to her BS, either.  Your grandma wanted YOU to have it and that's a huge honor, don't squander it by doing something against her intent.  How would splitting it even work when you guys won't always live together?  Do you really think she would even give it back for your turns, or would she \"mysteriously\" misplace it?", "Agreed, but also don't tell your mom and step-dad where you put it as well. You never know if they decide that this necklace is causing a \"petty argument\" and just decide to take it upon themselves to get rid of it to end the argument. Whether or not it's by giving the necklace to her or selling it outright and giving her half the money from that. Protect that necklace. NTA", "And I would not trust mom or stepdad either.", "Grandma did decide, she gave it completely to her biological granddaughter not to her step granddaughter.", "Couldn’t agree with this more! Tell no one! I’m shocked that the parents are on Abby’s side. NTA.", "That's a good idea.  Grandma should know what's going on.  Maybe she could even keep the necklace safe for OP until they move out, if necessary.", "Then she will not need to buy out her stepsister.", "ABSOLUTELY NTA! Your mom has lost her mind. I’m thinking it’s time for LC with your family.", "Give her two rocks and tell her to kick them. A diamond will appear some day. Nta", "NTA. It was a gift from your grandmother and was never going to be hers. She's just jealous.", "NTA", "NTA! Absolutely under no circumstance should you spilt or sell the necklace for Abby, her father, or your mother's sake. Abby needs to find heirlooms elsewhere. 🙄", "Nta! Do not sell or split! What is wrong with your mother?!?  That would break your grandmothers heart. Let Abby storm off. Where is she going to go? It doesn’t sound like she has a great job or anything so not sure what her plan is but do not give in. She is absolutely in the wrong here", "NTA but you need to lock it in a safe along with any of your other valuables. \n\nAlso stand your ground. Sounds like she's been rude and jealous and thought throwing a tantrum would get her what she wanted", "NTA. \n\nBut your either going to need to put it in a safety deposit box until you have a secure home of your own with a safe you can store it in when you visit your mom. Step sis cant break in and steal it. \n\nOr your going to need to can give her a fake that looks exactly like yours. \n\nI'd be petty and give her the fake so she can pawn it like she wants, because she just wants money. Then I'd keep the real one and when she asks, just say it's a fake and you gave her the real one.", "NTA. put an inconspicuous tracker on it in case she tries to steal it or steals it.", "nta", "NTA\n\nI can't say what abby is without getting my comment removed but she's far worse than an asshole. However it seems she's done everyone a favour by pissing off and cutting contact so leave her to it. Make sure that necklace is kept somewhere secure too, just in case she tries something", "NTA hell no you should not sell it!", "NTA she clearly doesnt care about the necklace and only sees the dollar signs, Its a family heirloom its sentimental value is probably worth 10x the material value", "NTA - go get you a lock box at the bank if you can and leave it the necklace there for a little while until this blows over.  It is yours!!!", "NTA but I have a feeling that Grandma probably didn't treat Abby like a grandchild.  Her feelings of not being wanted must have come from somewhere if it's not from OP and her mom.  Wouldn't be the first time a step, adopted, or foster kids was being treated differently by the family.", "NTa\n\n&#x200B;\n\nThis is YOUR neclace, and a gift.\n\n&#x200B;\n\n\"She’s now not returning anyone’s calls and says she will come home after I agree to split it with her or give her the necklace. \" .. R**efuse to let your AH parents force you to do this.** TELL YOUR GRANDMA, and go no contact with your parents until they stop this.\n\n&#x200B;\n\nYour parents are major AHs.", "Make sure she and your parents never have an opportunity to make that necklace go missing. I am including your parents because they are taking her side.", "NTA it's your necklace you got it from your grandmother and she doesn't even treat her nicely", "NTA.  Took it too far?  What, by telling the truth?  That girl has issues and it's with more than a necklace.  She is NOT entitled to that necklace.  It is a family heirloom and she's not the family of your grandparents -you are.  To even suggest selling it and dividing the money proves that she has no respect for what that necklace represents.  Stay away from her.", "NTA. I'd look at getting a safe deposit box to keep the necklace in just to be extra safe.", "NTA, and your Mum and step dad should have stopped her the second she got in your face.\n\nEntitled is the word you are looking for.", "NTA— but you need to get that necklace in a safe, or safety deposit box where no one else knows where it is ASAP.", "You’re NTA op do NOT split that necklace with your sister. She’s acting entitled and doesn’t deserve anything. Let her move out, life will be much nicer without her. You appreciate the history and sentiment and it was given to YOU. If your gran wanted it split she’d have done so herself, but clearly sees who out of the two of you will appreciate it and look after it’s legacy.", "NTA - but curious to know what you meant when you said she wasn’t replying to your messages and your mum said ‘she’s just jealous’ jealous of what? Sounds like something else has gone on and she’s eventually blew up but that still doesn’t make you TA. Her dad should speak to her, sounds like he needs to find out what’s going on in her life", "NTA.\n\nNo, she isn't family as far as your Grandma is concerned as far as heirlooms and inheritances go.\n\nIn blended families, sometimes some of the kids have to see the others get more due to relatives they don't share.  That's one of the complications which have to be worked through.\n\nDon't \"split\" the necklace.  I can guarantee that if you do, it will take legal action to get it back in your hands, and all heck will break loose once your Mom and Stepfather are gone.  Your Grandma would probably have a fit.  What happens if both of you want to use it at a major event you're both attending?  Unfortunately, considering her attitude, I'm talking about not even letting her use it as her \"something borrowed\" on her wedding day.\n\nAmazing that she ever even thought she was in the running to get it.", "NTA \n\nShe has no emotional ties to your grandparents, apparently from her own choices. She loves the necklace so much she wants to sell it?? Nope.\n\nPut it somewhere safe that your mom can't access.", "NTA. Put it somewhere safe", "NTAH- it’s ONLY when she sees something of monetary value she decides to speak- DO NOT sell the necklace - DO NOT split any money . Treasure the necklace and the history and love that went with it being gifted to you. \nAnd stop asking someone who has shown you how selfish, abusive and hostile they are to care", "NTA You aren’t obligated to share a family heirloom given specifically to you.  But it sounds like Abby is fixating on the necklace as a symbol of preferential treatment from the family at large (not just grandparents).  She probably gets a lot of shit about “why can’t you be more like OP” given how her education shook out.  (And maybe, on reflection, you might find you were the golden child before that?)  I think that’s closer to the root of the problem than the money really.  Especially because things were off between you for a long time before the necklace incident.", "NTA\n\nYour step sister is an entitled AH. As you say, she wouldn't give your grandparents the time of day. She obviously only  loves the cash the necklace would be worth, not the actual necklace, that's proven by her insistence it be sold and her given half the money.\n\nThe necklace was a gift to you from your grandmother. Your grandmother probably gave it to you now to make sure you actually got it, and because she's sick of your step sister asking to have it left to her.\n\nIt's your necklace, you don't owe her anything. Your grandmother is free to give it to whomever she pleases. Don't let your step sister blackmail you into giving her the necklace.", "NTA. Holy hell your mother agrees you should sell it? 🤢 wonder how your grandma would feel about that", "Nta. Please do not dishonor your grandma like that. She has done nothing but push them away. Not to mention how she treated you. Its really messed up that your mom would even suggest that you sell it & split it. Everyone seems to want to cater to her tantrum", "NTA", "NTA\n\nAbsolutely do not sell that necklace, you shouldn’t even be considering it!\n\nThere are generational items left to specific people, and that is the right of those giving those items. To deny it is to insult those doing the giving, as well as the recipient. \n\nAbby seems to have lost her way. And she’s upset because things aren’t going her way, maybe, when things fell through. Not your fault and certainly not your grandmother’s fault. And by no means should a family heirloom be sold in some misguided attempt to correct her path.", "Bring the necklace to a reputable jeweler for an appraisal, picture, and any identifiers in case it ever goes missing. Then take out an insurance policy. Never leave it unattended at your family’s home, honestly I would likely not even bring it back there even in a safe. \n\nNTA. The necklace was given to her biological granddaughter. Perhaps she’ll also give your stepsister something but that was intended for you from the moment of your birth.", "OP is definitely not the AH and I think she has no right to claim a family heirloom from someone she has no ties with.\n\nHowever, I can't help but think that there's something that we don't know about how grandparents treated step sister, something that OP isn't aware of.", "I suspect Abby might try to steal it. Put the necklace somewhere safe, OP", "Reading between the lines, I think that it might be that OP is also getting money for college from her bio family and Abby is not. Sounds to me like Abby is a combo of jealous and struggling and acting out because of it. Which still makes OP NTA, but I do think more might be going on.", "Yes grandma needs to know. I have a feeling when she finds out how greedy the stepdaughter, mother and stepfather are they will not inherited anything. Which is what needs to happen. It’s not right to demand something that isn’t yours to begin with.\n\nWhen they ask why you told that tell them you don’t agree with selling it and they told you to the right thing to keep the peace. So the right thing is to give it back to grandma or ask her is she wants to put a price in it so you can sell it per their demands. I have a feeling they will not like the results of this.", "The grandma is still alive so Abby should take it up with her.  The grandma can do as she wishes with her possessions.  IMO, Abby wants money, not an heirloom or she wouldn’t want the necklace to be sold.", "NTA, nope, nope nope. She a greedy cow who only wants money. She is not related to your gp's at all.", "NTA\n\nGood grief, absolutely don't give it to her or sell it!", "Hell, NO NTA.  Your grandmother, her necklace, and her choice to gift it to whomever she wants.", "NTA. Grandma was there and had nothing to say on the matter?", "NTA.  Do NOT sell your necklace or split it with her.  Your grandmother meant for you to have that necklace from the time you were a small child.  If your stepsister had built a relationship with your grandmother, your grandmother might have given her a gift as well.\n\nBoth your mother and stepfather need to grow up and support you.  Your stepsister started this mess.  You weren't a jerk.  The fact that they apparently tolerate her behavior is exactly why she has such a sense of entitlement.", "NTA for not splitting the necklace - it's yours. Maybe TA for the things you said, depending on how you said them. It's clear that she's not interested in the necklace as much as the money though. \n\nWhat are the odds she's developing a drug problem? Sudden behavioral shift, desperate desire for cash seems like a solid flag for a potential addiction issue. That or a mental health problem.", "So, Abby moved out and won’t return until she gets 50% of that necklace? Lol, ok. She’ll be back after you leave OP. Your parents are being enablers to her entitled and aggressive nature it seems. Keep the heirloom safe. From even your parents. And maybe lay down some boundaries for your parents if this is how they handle the situation.\n\nNTA", "NTA Abby doesn’t care about the necklace, your grandparents or family. She just wants money. Keep that necklace safe somewhere no-one in your family is aware of. It is rightfully yours given to you by a grandma who loves you.", "Ridiculous. Don't cater to her nonsense for even one second. F that noise.\n\nNTA.\n\n\n.", "NTA.\n\nLike you said it is a FAMILY heirloom. She is not biologically family and has never even liked your grandparents. So why does she even want it?\n\nI'll tell you why. She either wants to sell it as diamonds are valuable or she just doesn't want you to have it. Either way it was your grandmothers choice to give it to you. She needs to respect that. Period.\n\nYou should tell her that jealousy is an ugly look on her.", "NTA. Do not placate this behavior.", "NTA. She didn't even show up at a family event. Please make sure you keep the necklace somewhere secure. \n\nYour grandma handed you the necklace, if she wanted it to be split, she would have said so.", "NTA\n\nYour grandma promised you the necklace ever since you were little. Your stepsister probably wasn't even in your lives yet at that time. So technically yiu ARE the first granddaughter, even if you and your step-sister share the same age, because you were their first. Also, step-kids are just as much full kids as the non-step-kids, except when it comes to heirlooms. Unless the step-kids have been legally adopted into the family.\n\nAlso it is your grandma's necklace so she decides who gets it.", "GET THAT NECKLACE SOME PLACE SAFE, PRONTO OR IT WILL COME UP \"MISSING\"!!", "NTA. And F her. She has absolutely positively totally no claim to that necklace. It is your grandmother’s necklace blood relative, which is you so it should only go to you. Do not even entertain the thought that it should be shared. That is like a slap in the face to your grandmother, that you would sell her necklace instead of keep it as an heirloom to pass on to your daughter. She can go dig a hole and bury herself in it. She is so selfish.", "NTA. Your sister and your parents are though. Tough shit she moved out because she didn’t get something that was never hers. Your parents suck for being cowards", "NTA You and Abby are like the mothers in the Judgment of Solomon. He found out who the real mother to the baby was when one of them was fine with having the baby chopped in two. You showed yourself as the real owner of the heirloom when you refused to sell it for easy cash. \n\nAs others have said, get yourself a safety box in a different bank than your parents use, or you will find the heirloom will suddenly have moved over into your stepsister's jewelry box, just like the baby was switched from one crib to the other.", "NTA she has no claims at all the necklace amd is an ahole for suggesting she dose.  Don't give in smd don't leave it anywhere it could be taken.  To the point if you need to move home put it in a bank security box till you have your own place.", "NTA but lock your necklace away and make sure she can't access it. Don't ever let her \"borrow\" it. And don't wear it at your mom's house anymore because I bet your mom and stepfather will pressure you to share it with her or even try to take it from you.", "Your mother and step father only want a peaceful life and it costs them nothing for you to surrender all the time to this kind of drama.  They live with her and deal with this more frequently than you do.\n\nNTA and don't imagine this is going to be the first thing of yours she will want.", "NTA it was given to YOU wth would you need to give it away or share it with anyone especially not a blood relative!", "NTA I suggest secretly getting a safe deposit box at your bank or else your step sister will steal it.", "NTA!!\n\nDear God the entitlement!! Your step-sister has shown you her true colors so please do not apologize. Your step-sister doesn't get to treat your grandma like crap and then get angry that she didn't get something that WAS NEVER HERS!! Tell your mom and stepfather to back off, they have no say in what your grandma gives you and you are not selling them just to pacify your stepsister. It does sound like more is going on with your stepsister then just this though.", "Don't split the necklace. Keep refusing. Don't do what they want you to. \n\nSo she can't stand your grandparents and made it clear that she didn't want a relationship with them, but then somehow feels entitled to a necklace that belonged to your grandma? No, no, That's not how it works. \n\nPlus, grandma can totally refuse to see her as a granddaughter as well, why would she give her the necklace, then? \n\nPlease, make sure the necklace is safe, I wouldn't put it past her to try and get it in any way. \n\nNTA at all.", "NTA. Also, it's really shitty your own mother is saying to hock it. Probably why grandma gave it to you and not her.", "Clearly nta, it is not important what your stepsister wants…it is important what your grandma wants and she wants you to have the necklace and pass it on. That’s the only thing you need to consider.", "NTA in the slightest. Gran gave it to you for your Birthday, because its a family heirloom and wants to give it to her Grandaughter. Its yours to do with as you want and in no way should you feel guilty about keeping it and should not sell it. Remember never negoiate with terrorists, especially emotionaly maninpulative ones.\n\nYour Sister, Mum and SDad are AHs. Its your Sisters loss if she wants to throw a strop over this. Shes clearly going through something and isn't doing anything about it and for Mum and SDad to tell you to sell yiur Bday gift off your Nan is a disgrace.", "nta, she sounds very troubled.", "NTA. She only wants It to sell It. \n\nOf i was your grandma, and found out that you sold It, i would disown you that instant", "The thing is, though, she's not your grandma's family. NTA. And even if she were, your grandmother can give it to whomever she wants.", "NTA. She sounds like she’s desperate for money, for one reason or another. Your parents sound like useless enablers, too. Your grandmother gave it to you. It’s yours. I echo others’ advice to get a safety deposit box, or insure it, if you can.", "NTA.  This  is an heirloom, money cannot replace that. \n\nYou are the biological granddaughter and your step sister hasn't been nice to your grandparents. She is just seeing dollar signs.\n\nKeep the necklace and enjoy it. You will regret selling it to keep the peace, and furthermore you might hurt your grandmother's feelings by selling it.", "NTA 100% from what I read.\n\nBut also... something in the back of my mind isn't quite comfortable with this:  \"So I snapped back and said it was a family heirloom and that it has always been mine.\"\n\nYikes. Is this a taste of what Abby's dealt with all her life? That she wasn't a \"real\" grandchild to these people? Could there be more to the story of her not treating the grandparents kindly? Maybe she never quite felt welcomed. Hmm.", "NTA, grandparents gave it to you. Also she didn't deserve if she didn't spend time with the grandparents", "NTA. Abby  is greedy and the AH.", "If your grandma wanted her to have it she would have given it to her NTA", "NTA. Its yours, it always has been and her initial reaction is a major over-reaction.\n\nThis is the hill your step-sis has chosen to die on, so to speak.  And that is not on you, at all. If she chooses to paint you as the villain in her story, that's on her.\n\nTo keep the family peace, I would apologize (via text) for saying anything that upset her.  Then I would let it go - it's up to her to respond.  But I would take the advice in this thread and put it somewhere safe.  Safe deposit boxes are ridiculously affordable and putting it away until you live elsewhere is probably best.", "NTA. Your mom and stepdad should be having your back on this as well. Make sure you keep it safe and maybe even get insurance on it. I have a feeling they may try to take it behind your back.", "NTA - tell your grandparents and ask them to look after the necklace, but put in writing that it’s yours. Maybe even get a safety deposit box at the bank and hide it there, since no one at home can be trusted. \n\nYour parents shouldn’t be pandering to her, I would tell them if they ever say anything about selling and splitting with Abby again, you may consider LC with them, since your feelings don’t matter.\n\nIf she ‘really loved that necklace’ the thought of selling it would never have been suggested.", "NTA AT ALL. Your step sister sounds deranged", "Nta", "NTA. Your grandmother gave it to YOU. Probably because she was close to you, not Abby.\n\nGet a safety deposit box and put ALL your valuables including the necklace there.  You need to worry that Abby will try to steal what she wants, and there are those on her side that might help her. Instruct the bank that they must require an appointment IN ADVANCE, call you and do a full ID check on anyone opening your box, in case she also steals the box key.", "NTA. This is part of your family history. It's a lovely way to have your female ancestors right there with you. Jewelry value does not rely on the money spent on it, but on the memories that it carries.", "Stepsister isn’t the only risk factor. I wouldn’t put it past the parents to steal the necklace, sell it, and split the money “to keep the peace” and/or “out of fairness”.", "NTA and great advice. I was thinking the same. I wouldn’t be surprised if the necklace suddenly came up missing.", "Why the pity post in the first half. I’m not tryna be mean but literally no one cares", "Splitting it meant sell the necklace and split the money, not share the necklace", "Doesn’t matter in the least, the necklace was not left to her", "Please stop. Why reddit always try to find something bad in a step parents or step grandparents when there's NOTHING to indicate that in the post? OP didn't even say a word about how her grandparents behave or their personality. Kids can be an AH, just because someone is a parent or a grandparent doesn't mean they're always the reason for kids doing bad things. Believe me, people can absolutely be mean just because.", "Or the stepsister is an addict. The rage, the fixation on selling something quickly for the cash, the job/education falling apart...\n\nHide you valuables, OP. And your ID, birth certificate, etc.", "There really doesn't need to be in this situation. They were close growing up, but *right before* they really blended the families through marriage Abby lost both of her grandparents.\n\nThe post says they were close through high school, so I imagine young teen/pre-teen years are when the marriage happened and Abby missed her grandparents. Then seeing your new step-sister continuing to have the relationship with her own grandparents is gonna make that sting a bit more.\n\nI know people like to try and find \"good\" reasons for why people do stuff, but sometimes it's just a situation made bad due to timing. Maybe Abby wouldn't have tried to just completely dismiss OP's grandparents had hers still been alive when the families were blended, maybe she would have started acting this way if her grandparents passed sometime later, or maybe this situation is completely unrelated to the necklace or grandparents specifically but just has to do with Abby being envious of OP.\n\nYeah a lot of times people are shitty behind the scenes, but I don't feel like Abby would claim to have \"begged\" for the necklace from people she was uncomfortable interacting with.", "What makes you think you can speak for everyone? I care and found it incredibly sad and interesting.\n\nIf you don’t care, that’s on you. Don’t shit on someone for sharing their experience. Just pass it and move on.", "Stick to getting scammed and whining about it online", "I bet it's not even worth that much. I sold a 2 carat diamond bracelet to a jeweler and got nothing for the diamonds. Only the gold had any value. Unless this is a huge solitaire or something from Tiffany, it's probably not worth very much, aside from the sentimental value. \n\nNTA", "I would guess these are her mothers parents, i'd tell grandma that her daughter expects you to sell her prized heirloom necklace and split it with your stepsister! I'm sure grandma and grandpa may have some words for your mom and stepdad!!!", "The \"Give it to my or sell it and split\" stood out to me. It's so Important but she was ok with just selling it. Yeah no that raises my spidey senses with my experiences with addicts.", "I would tell grandma but I would still put it in a safety deposit box. What would prevent any of them from stealing it from grandma", "NTA\n\n> she just wanted the necklace for the money and she didn’t care or couldn’t begin to appreciate the history behind the necklace. \n\nA fair comment, considering she expected you to sell it.\n\n> And that she didn’t even love my grandparents\n\nBased on her disregard for them, this is also a fair comment. She has never liked them. Never wanted a relationship with them. Wasn’t nice to them.\n\nBut thinks she is owed an heirloom that has been promised to you since you were little?\n\nSo how exactly did you take it too far?\n\nWho’s the person who screamed? Who’s the person that called someone a bitch? Who’s the person that made an outrageous demand, and then drama flounced from her home? Who’s the one not returning anyone’s calls, and wants to use her presence as leverage to force you to sell the necklace, or give it to her? (Who’s the person who couldn’t even bother to say thank you for a gift.)\n\nWhich conveniently sets up other people working to pressure you.\n\nShe’s an adult, if she wants to live elsewhere let her. Don’t give up a loved gift from YOUR grandparents because someone else is having a temper tantrum.\n\nThe person pulling the nonsense is her, you shouldn’t be expected to pay her off. It’s clear Abby is struggling, but taking it out on you isn’t okay.", "Nta. Red flag red flag!!!", "NTA. It was given to you. It's a family heirloom that she does not value for anything but monetary value. Keep the necklace on and safe.", "Don't you dare give her the necklace. Abby is selfish and jealous of you. Imagine the audacity of her demanding it be split, and what the hell is wrong with your mom siding with Abby? Don't give in, don't you ever give in  let Abby stay away, it will be a nice break for you. She'll be back soon when she runs out of food. But in the mean time, keep the necklace at your grandparents house because I don't trust Abby, her dad and sadly, your moms. Cut ties with Abby, completely, until she apologises and acknowledges what an AH she's been.\n\nGood luck.", "NTA\n\nDo not do anything with the necklace because it is yours.\n\nBUT I'd question your stepsister's mental health...", "NTA It wasn't given to her. The giver is not her blood family and it is an heirloom passed down through blood. You want to keep it, she wants to sell it. Keep the necklace and don't be bullied into giving it up. You might have to rent a security box for it. If they take it from you call the cops.", "So it being a family heirloom is irrelevant to everyone but you.   She badly wants to be primo and you to be the step child.  Keep the necklace but insure it and out it somewhere she cannot get to it.", "NTA so she loves it so much she immediately wants to sell it??? Nah she just wants the cash and doesnt care about what it means or your grandmother.\n\nDont wear it infront of her - she might even rip it off you. And never keep it in your mothers home ever. She will steal it.", "NTA. You all really need to start asking yourselves why does she want the money so badly.", "NTA. DO NOT SELL THE NECKLACE. It was given to you by your grandmother. If she wanted her to have she would have given it to her", "NTA", "Your mom and step-dad are TOTALLY OUT OF LINE! YOUR grandmother passed it down to you. Plain and simple. Stepsister does NOT have a valid claim. NTA.", "NTA.\n\nIt clear that your grandmother and stepsister don't have any family bond (neither blood ties or affection) and she give you the necklace to yours.", "It’s your necklace and the parents shouldn’t give in because they are tired of hearing her scream.", "Nta... it sucks that your mom didn't stand up for you... and you would figure your mom would understand it a heirloom or at least be sentimental about it because it her own mothers.. but no she wants you to sell it to pacified step sister... so don't sell it and lock it up somewhere.", "YWBTA if you gave in to her pathetic demands, your grandmother gave it to you and she is not even blood related to your step sister, your parents need to intervene and tell her to stop.", "Absolutely NTA. Also this behaviour change and sudden desire for money is very worrying, like secret drug problem, worrying.", "NTA\n\n* While you and stepsis were close growing up, she has a history of not always being nice (e.g., to your grandparents).\n* Now, your stepsis is struggling with her transition to adulthood, which may make her want to keep some distance from you. But that is no excuse for her to be completely rude and dismissive of you.\n* She has no claim to the necklace (by any stretch of the imagination). Coveting someone else's property does not entitle anyone to that property. It was never promised to her; she doesn't even have a good relationship with it's owner. The owner (grandma) had sole power to decide who she wanted to give the necklace to.\n* Abby's entitlement and hostility (even physical hostility) to you is beyond the pale.\n* Please do not let your parents influence/pressure you. They are completely out of line for multiple reasons:\n\n1. They have absolutely no standing to tell you that you should give up a gift from your grandmother. The gift was from your grandmother to you, an adult. They have no say.\n2. Caving into Abby's demands is not going to \"end this \\[her\\] nonsense\". It's only going to embolden her to make more demands.\n3. Your parents should be working with Abby to (1) tell her to STOP HER NONSENSE; she has no claim to the necklace and (2) work with her (maybe sponsor some counseling) to help her sort through her current struggles.\n\nEnjoy that necklace guilt-free, but it's probably wise for you not to wear it when you are visiting your parents (for now, anyway).", "NTA in any way possible.\n Keep the heirloom, No not many of us get them.\n\nStep siblings come and go, harsh ad it may sound, but grandparents are forever.", "NTA\nI have no idea why your parents would take the position that your a jerk. Kinda makes them jerks. Your grandma gave you the necklace. It's yours, full stop. Good luck.", "NTA\n\nSounds like this grandparent has no blood relationship to Abby.  The fact that Abby is demanding it or the money from it says a lot to me.  Greed is the issue here.", "NTA - and don’t you dare “split” the necklace or ever let her get her hands on it.", "What a spoiled little brat", "NTA\nPut the necklace in a safe place, not where your parents can ever get it. \nThat’s crazy! The SS is beyond jealous of you. Be careful, don’t leave anything you value at home.", "NTA - Absolutely do not sell the heirloom, and shame on your mom and stepdad for even suggesting that.  It is a special gift from your grandmother and she would probably be hurt if you sold it, especially to give money to someone that doesn’t even like her.  Your two sister is an entitled gold digger and the parents are approving g of that behavior.    Stand your ground and make sure that necklace is securely locked up when you aren’t wearing it.", "NTA bro. Your step-sister is dumb", "That is so inappropriate.\n\n1) you were promised it as a child(which was likely before stepsister came into your family?)\n\n2) she doesn't even try to have a relationship with them but wants the necklace.\n\n3) Your grandma gave you the necklace, that is her right to give.\n\nYour stepsister is showing a very unattractive side of her personality.  Keep the necklace safe.", "Oh hell to the no. NTA. Your SS is a host of names and needs to step off. The parents too. Holy shit the GD NERVE of them. If my kid acted like that, I’d go nuts", "NTA your mom and stepfather are idiots don’t listen to them", "What the hell is wrong with your mom? She seriously thinks that you need to split a family heirloom from her own mother with her stepdaughter who wasn't close to them? Your mom and stepfather are as big of a$$es as your stepsister. I would tell Abby to feel free to come home since you won't be there ever because of the lack of support for you. For them to call this \"nonsense\" shows just how much they want a peaceful ending to this so it doesn't make things uncomfortable for them. Just WOW.  NTA", "NTA\n\nYour grandmother, not Aby's in any way since Abby didn't bother to build any kind of relationship with her. This was Abby's decision.\n\nI guess Abby's never coming home. Again, Abby's decision.", "NTA your grandmother gave it to you. That’s that. No more explanation needed. \n\nSounds like your stepsister has things going on that you don’t know about. I don’t want to speculate but her actions and reactions are not normal. That doesn’t mean you should give in to please her. Money from a family heirloom is probably the last thing she needs right now. Your parents need to do a little parenting though.", "Absolutely NTA and do not leave that necklace anywhere step sister can get at it, because she will take it.  That necklace is from your Grandmother, no relation to her and she doesn't even like her.  Be careful with that necklace.", "NTA Keep the necklace.", "NTA. **You defended yourself.  Stepsister took it too far.**  \n\nShe's now doing a classic manipulator tactic, the silent treatment.  She's removed herself to get the parents to be her flying monkeys and get your compliance. It's working on them.   **They are wrong to do this to you.**  She's taught them to comply, and they are trying to force you into this, too.  \n\n***It'd be reasonable to just not discuss this with them again,*** because they are wrong to do this to you.  **\"I'm not discussing my gift with you again.\"**  \"You have brought this up three times today, so this visit/call/chat is over.  Love you bye.\"  \"Every time that you bring up how SS wants to take my gift, I'll be ending the visit/call/chat with you.  Love you bye.\" \n\n**You were given a gift.**  On your birthday.  From a relative that isn't her relative by birth. \n\n**Immediately, she starts** screaming and creating a scene, **basically throwing a tantrum.**  She claims it's because she wants your gift, which is yours.  Everything she says about it, other than this, is to manipulate the parents, which works.  **Her tantrums work on them, and they rush to comply with her demands, just to stop the tantrum.**  She's manipulative. \n\nThis is your gift.  She wants it.  She's \"always\" wanted it.  And you are supposed to \"know\" this and comply with her demand.  She's manipulative.  She doesn't even want it, just to take it away from you.  She wants either the whole thing, or some of the money.  But **I think mostly she wants to take it away from you.**  All those words are aimed at one thing:  her getting control over you.  Look at the action, not the words. \n\n**I suspect that she also wants to ruin your birthday for you**, and to find a way to give herself all the attention on your birthday.  That also worked for her. \n\nHer reasons for her behavior are probably not what she's saying they are.  Her real reasons have a lot more to do with hurting you, and getting what's yours away from you, and getting your parent to work with her parent to force your compliance.  **That's about control,** not about her actual desires.  The real reasons are for her to work out and handle in therapy.  What you have to deal with is her actions, not her words or her thoughts or her reasons.  \n\nYou aren't responsible for her feelings, even though she's trying to make this into your responsibility.  **She's already succeeded in making the parents be responsible for how she feels, as shown by how quickly they try to appease her, and sacrifice you to do it.** \n\nComments are right, you need to **take this gift and protect it**.  Don't wear it when you visit them.  \n\n**Don't stop there, though.**  This person is showing that her control over you is the main issue. She's not going to stop being abusive or manipulative in your direction.  So, **protect yourself from her behaviors, in every possible way.  You are more important than the necklace.  You don't deserve to be treated this way by your parent.**\n\n**Her behavior is enough to set a boundary that she doesn't come to your home.**  You don't have to tell them this, just enforce it for yourself.   Instead of inviting her enablers, the parents, to your home **for future visits, meet them somewhere public.**  Meet halfway, or get a hotel and stay there and meet in public places for holidays and birthdays.  If they come visit in your town, they stay in hotels, and you meet them in public places instead.  \"No, that's not going to work for me this visit.  Let's, see, I could meet you at Place or Place or Place, if that would work for you.\"  \"Oh, it doesn't work for you to meet me at a choice of twelve places that I've offered?  Okay, I guess I will see you next time you visit my town.  Love you bye.\" \n\n**Her behavior is bad enough to just not go to holidays with them, or vacations, or any event that is about you that she could ruin for you by another tantrum.**   \"Sorry, can't make it.\"  \"I'm not available this year.\"  \n\n**That your parent is going along with the idea of you giving your gift to her, that's truly appalling behavior.  It's enabling the manipulator,** and contributing to the abuse of you.  You are just as much family as this stepsister.  The parents ought to be respecting you, not telling you to comply with the manipulator's demands.  They are damaging their relationship with you, making her the golden child and you into the scapegoat.  Check out r/raisedbynarcissists or r/justnofamily for more help in how to cope with parents that behave this badly.\n\nYou deserve better.", "NTA.  And keep it safe outside the house.  It is crazy that even your parents want you to sell and split it.", "Do Not sell the necklace your family gave to you with love. It’s a family heirloom that solely belongs and was destined to you!! NTA", "NTA You would be a fool to give that ungrateful stepsister a $1.00. She has no interest in your grandparents and everyone knows it. If your father and stepmother had some objection they could have voiced it at dinner to the givers of the necklace. It is not your problem. If they want to appease her, her mother can go buy her a necklace and start their own family traditions.", "NTA.  Grandma gave it to you.\nWhy would you sell it and give her money.  I’d make sure no one has access to it.  She sounds like someone who let opportunities pass her by and is miserable about her life.", "Don’t and I repeat Don’t give in to her crapload of entitlement. YOUR grandmother left you this family heirloom that has NOTHING to do with your jealousy infested step sister. Keep the necklace and cherish it and pass it to your daughter or granddaughter in the future. Absolutely NTA", "DON'T GIVE HER THAT NECKLACE.  It was promised to you since you were a little girl & it's yours.  There's no reason to sell it, as you said it's an heirloom.  Keep that necklace & let her sulk about it for as long as she wants.  And as for anyone else telling you to sell it or give it to her, tell them to f off.  It's yours. PERIOD.", "NTA rofl your mom and step dad and step sister are so offside, they are clinging to the edges of the next solar system.", "NTA, seriously, wtf. She doesn't like your grandparents, she just wants a free diamond necklace. A necklace you were promised in infancy!", "An appropriate reaction for someone you care about, getting something they care about, even if you like it too, is to be happy for them. Feeling a little jealous is fine as long as it is not the overwhelming sentiment. She does not care about you. She is acting like a spoiled selfish brat, and if you give in you are only showing her that her actions worked, so it will be easier to do it next time. NTA", "NTA and make sure your grandmother knows about the issue. I’m concerned that your own mother agrees that you should sell the necklace  and split the proceeds with your step sister- why is she willing to placate her??", "NTA - It is grandma's necklace to do with as she wishes.  No one else gets a say here.", "NTA - she’s literally not related to your grandma outside of paperwork lol", "You can keep the necklace OR your can give it back to your grandmother and not be an AH-- if you sell the necklace OR give it to Abby then you will the the AH.  You don't liquidate family heirlooms OR hand them over to people who plan to sell them.  Regarding the argument (which I'm literally praying wasn't in front of your grandmother) neither of you behaved well-- though Abby's behavior was by far worse. Given the changes in her behavior you mentioned (and her literally having a meltdown over getting the necklace or half the money) has anyone considered the possibility that she has some sort of substance abuse problem?", "NTA.  Get a bank deposit box and put your valuables & ID in there.  Abby's response was way over the top, and your mom's reaction is to placate her?  Please don't trust them.", "NTA. Don’t give in! It’s rightfully yours.", "NTA, your mom is.", "NTA.\n\nWhere was Solomon when you needed him?", "NTA!!\n\nYour stepsister has absolutely no right to the necklace.  She's way out of line, as are your parents.  Hold strong and keep the heirloom.", "OP, do not and I mean DO NOT sell the necklace to make peace with this brat.  She's not close to your grandparents and had already pulled away from you before all this.  You did everything to reach out and otherwise maybe smooth over whatever her issue with you is.  You said nothing untrue and if you took it too far then it was only because she went too far in trying to take something that was always meant to be yours.  I do not understand why any stepchild or stepparent comes into a relationship and believes they are entitled to heirlooms or anything from the family that they married into that is normally passed down to relatives.  A new tradition may be started to smooth over any negative feelings, but that is up to the parents.  NTA", "Photos/insurance and Will might be good idea (not implying that Stepsister would kill her, but simply direction if she passed on where necklace would go--a cousin?)", "OP 100% follow this advice.  \n\nAdding to that, you may want to have it appraised so you have a paper record of its value and ownership, and potentially get it insured if it’s a significant value.", "NTA, OP. I hope everyone actually remembers to vote so Reddit can count it. Please keep the necklace always on or in a safe to which only you have access... I wouldn't want your family to \"help\" in this situation by selling it to end the fight sooner. You do you and you enjoy (& protect) your beautiful heirloom. They can take a long walk off a short pier.", "<<NOT WANTING YOU TO HAVE IT>>  Very valid point", "If I were Op I would secure that necklace anytime step-sis is around. With that sort of reaction you know she will try and steal it.", "Or it is that Abby has two recent \"failures\" (college and the other opportunity) and OP is moving on with her life. If Abby's life has no focus then OP's successes/direction then likely every action OP does is \"rubbing it in her face\" even if that isn't even close to true. Abby might need some counseling to figure out where she is going in the future because stagnation and depression aren't good for anyone.", "Ah, misread split or give it to her as split the money or split/share the necklace.", "I'm not super surprised. OP seems to be getting on with their life while Abby is looking a bit \"failure to launch\" and the parents are realizing that they might be stuck with her forever. If they cater to her, that will \"keep the peace\" and since it seems like she still lives with them, that is more important in their immediate life than the feelings of their other daughter.", "<<*Or the stepsister is an addict*\\>>  \nYou're right that might explain the drastic personality change(towards OP) and the dropping out of community college.", "I mean, I had 1 grandparent growing up and I was jealous of my friends and cousins that had grandparents but I never acted like THAT.", "Yeah, diamonds are not nearly as valuable as we want to think they are. There's a huge markup at point of sale and they aren't really as rare as the De Beers company wanted people to think.", "You make a great point with this. Her parents are disappointing for their reaction to this situation.", "Solomon’s baby verdict here", "Did you live with them in a family unit, and visit their grandparents pretty much every time that they did? Step-siblings are different than friends and cousins, because there's normally less separation of their time with *their* grandparents and you.", "Under-rated comment", "NTA especially since she just wants the cash.  With this sudden change in behavior and need for money, I'd be concerned she's got an addiction or something happening?  And shame on your mother and stepfather for trying to force you to cater to her ridiculous demands.  \nYour grandmother gave it to you, her grandchild, and knows you will appreciate it.  But given the situation, you may want to keep it somewhere very safe for a while, like a safe deposit box at a bank or something.  Sounds like Abby would steal and sell it if she had the chance.", "NTA. ITS OBVIOUS you step sis is not a good person. BE CAREFUL, its very possible she might try to steal it as we've seen in endless posts almost exactly like yours. I'd keep it under lock and key.", "Um absolutely not. That necklace is YOURS. It was given to YOU not her. It was promised to YOU since you were a young child. She has no claim to it. It is a family heirloom and should stay in the family. The fact that she thinks she is entitled to it and wants to sell it for money means she doesn't care how precious it is to your family. The necklace has been passed on to you, it is your responsibility to keep it safe and ensure it gets passed on to the next generation of the family. Besides she isn't a blood relative, and clearly doesn't even want to be considered as part of the family unless she gets her way and gets whatever she wants when she wants it. You are NTA, she is.", "NTA\n\nDo not and i mean it do not give in to the pressure...she just wants it because you have it and because she knows it's special to you so she wants to ruin it for you\n.don't sell it you'll regret it for the rest of your life... narcissists do that they create such a scene that all the family members have to side with them just to keep peace\n\nThe worst thing you can do in this situation is doing what she wants it'll set a very unhealthy precedent", "NTA this is as you said a family heirloom, given to you as part of tradition, not some trinket to sell for cash-I've never had a particular attachment to any bills in my wallet ever. It sounds like she was already drifting away and this is just reaching a peak.", "NTA Even if your sister had some blood ties to your grandmother, your grandmother wanted you to have it. That's what matters. Your grandmother wanted you to have it, and you want to keep it. Sounds like mom and stepdad just want to steady the boat at your expense. Nope. Let Abby have her tantie. If she's willing to throw your family away over that, that is her choice. But don't give into her emotional blackmail.", "NTA. Whatever she is going through, it is not really about you. Somehow, she has made you a stand-in for her own feelings of inadequacy. You didn’t make her do that, and her treating you aggressively is not ok for any reason. She raged. And rage isnt normal anger. It is triggered and out of control. If you think about it, you’ll likely realize you felt something coming-tension building. You tried to diffuse it with a kind gift. Good move. Didn’t work. Further evidence this isn’t about you. The stuff she said isn’t about you. It isnt. Even if it’s sometimes true (most of us aren’t perfect), you did not make this happen with her. You aren’t responsible for whatever she is spewing at you. If it helps, think of anger and rage as different things. Anger is when you get pissed off, maybe complain, say something pissy, even raise your voice. Rage is when you lose it, spew hateful things, break or throw something. Rage is not just huge anger. Rage leaves recipients feeling like we just got hit by a tornado, and shocked. Her behavior isn’t just intense anger, “very angry at me”. She isn’t “very angry at” you. She is triggered. What that means is there’s no point in any response you can have to this other than somebody helping her get to therapy. We own our triggers, and it is our responsibility to be aware of them and manage them. She can do that now, or when she’s 40 after it has cost her relationships and even jobs. Point is, you can’t do it for her. You aren’t responsible for her triggers, and you cannot manage them. This means you aren’t obliged to discuss your part of this with parents or her. This wasn’t about you. And do yourself a favor and view her as “clearly wounded” instead of making judgements about who she is based on this.  Most of us have some triggers and behave poorly on the rare occasion we get triggered, but we aren’t hateful, awful people. The way she acted was not ok, not reflective of her genuine feelings toward you, not about you, and not under your influence.  “it’s so worrisome that she is so troubled by things that she’s acting that way. I know she would never want to hurt me. Maybe it’s time for a counselor”.  Say the same to her if prompted. Be humble- everyone has a strong feeling wash over them without invitation, causing them to overreact or under react dramatically at least once in life. She needs to talk about what’s bothering her- get to the bottom of it and address that instead of puking it up on your feet. leave the necklace alone. All it did was serve to trigger her. It is not the problem.", "NTA\n\nYou may want to get a safe or something to store the necklace when you're home. Something isn't right.", "NTA", "OMG don't do it.  Do Not give it to her or sell it.  That is something that means so much to your Grandmother and now you. Please don't do it, you would regret it for the rest of your life.", "Hell no NTA!!!!!! You ARE the first granddaughter so no weight in that argument and all your points were spot on!", "Nta shes insufferable", "NTA she clearly just wants the money. Why would you give it to her? You should hide it, she might try to steal it", "NTA. tell your mom & step dad to piss off if they think you are going to bow to that little shits demands and you’ll be LC/NC as well if they try to force it.  She has zero blood ties to the family and doesn’t even like them.  It’s all about the money for her.  Your parents are shit for even suggesting it, especially your mom.", "Something is sketchy here….Sister suddenly dislikes you and thought the necklace would be hers and the parents are on her side. Sister also claims you aren’t family rather fast. Is there something your parent or step parent might have said that made her so jealous or feel entitled?\n\nAnd what is the “opportunity” that fell through? I think you’re NTA but something feels like it’s missing context wise for where your sister suddenly got all these ideas and why the parents are on HER side…?", "Nta!!! The A-holes are your parents and step sister!", "DO. NOT. SPLIT. THE. NECKLACE. or sell it. It was a gift to you and you pointed it out perfectly that it was a gift with sentimental and historical value. She treated the grandparents poorly (I don't know whether they are your Mom's parents or your Dad's, but either way), so she cannot expect to be treated the same as you. Keep it safe from your stepsister to ensure it does not go missing. Also your mom and step dad are AHs for expecting you to split the necklace. \n\nGood luck and NTA", "NTA!!! Hide that necklace and don’t ever bring it around her or your stepdad because it will accidentally get lost and you will never see it again… she is a brat !! I would go NC with her", "NTA. Just block her and live without unnecessary drama. She is an entitled greedy AH.", "How can you split a necklace? That’s ridiculous. They have it to you!  End of story", "NTA Step sister sounds freakin nuts! She's jealous. She has no right to anything from your grand parents. She is acting like she is entitled to things from people she has not blood ties to and who she was never interested in. She's just greedy and if she stays away from you, good for you. Keep every single thing your grandparents give you. they are called heirlooms for a reason.", "NTA\n\nIt's just a fact that your grandparents were loved by you, and rejected by her. So, why would she feel entitled to the necklace. Hmm. Entitled. Where have we heard that word before?", "NTA your grandmother was fulfilling a promise. Abby was never given any indication that it would be hers, she's just jealous and angry. She needs therapy, not jewelry", "NTA and don't listen to your mom or stepdad either. She is an entitled and selfish person. Your grandma always promised it to you, it's yours.", "Yall both need to grow up. Dont split or give it to her. NTA why the hell do yall need her to come home so bad? Shes an adult, she can come back if she needs it. She'll be fine.", "NTA.  None of the relationships matter, bio or step or whatever.  Grandma owned necklace.  Grandma gave necklace to OP.  Now, OP owns necklace.  If Grandma gave it to her next door neighbor, then the next door neighbor would own it.  Grandma can give her property to anyone she dang well pleases.", "Nta", "So heres what you do.\n\nHow much is necklace worth.\n10,000 units value.\n\nHave parents give you 5,000 units no strings attached.\n\nGive the 5,000 units to Sissy.\n\nYou get necklace\nSissy gets money\nParents get peace.", "NTA\n\nYour Mom and SF are delusional if they think you should just sit and roll over for your SS.  \n\nYou ought to suggest that your SS seeks professional therapy for her mental issues.\n\nYour SS is envious of you.  Envy is a sin for a reason.  Jealousy is:  I want what you have.  Envy is:  I want what you have, I don't want you to have it, and I will take it from you if I can.\n\nYou'd better buy a home safe, take photos of it, and insure it.  Or it may just disappear one day.", "Grandma gave YOU the necklace. All the other bs is just noise. \n\nNTA for keeping A GIFT (or for anything else).", "NTA. But you better insure that necklace or never let it out of your sight. I wouldn’t be surprised if she tries to snatch it when your head’s turned.", "> I love that heirloom necklace, it should be left to me as the eldest since I'm part of the family\n\n...\n\n> Sell the necklace and split the money\n\nThese two thoughts run in very different directions.\n\nNTA", "NTA-and your parents are being dumb. That necklace is YOURS. Treasure it and the history behind it.", "NTA - whether grandparents were all lovey dovey with step grandchild or hated her guts doesn’t really matter. It is a person’s right to give a belonging to the person of their choosing. That is what the grandmother did. End of story. OP has no reason to sell her grandmother’s diamond necklace and give her stepsister half the proceeds. She has no reason to give her money at all. If the stepsister’s parents want her to have money they should give it to her. Otherwise, end of story. If her stepsister chooses never to speak to her again, that would be sad; however, this sometimes happens.", "NTA. I would put the necklace in a safe deposit box until either you move out or she does. If she wants that necklace or the money, bad enough, she will take it.", "NTA\nIt’d be one thing if she actually was close to your grandparents and wanted the necklace for sentimental reasons, but since that’s not the case she has no right to it.", "NTA, step-sister certainly seems to be greedy and demanding.  It's probably best to maintain a no-contact with her.", "ESH.  I have a feeling a lot is missing, like how your grandparents didn’t treat her as a grandchild like they did you.  You also conveniently leave out how old you two were when your parents married.  The implication was that you were young since you grew up together.  You may not have been present or just have been ignorant, but I will bet your grandparents stopped treating her like a relative after you left.  You went too far on the she didn’t love your grandparents.  She may well have until it became apparent she didn’t get it back making her feel rejected and not a part of the family all these years especially after losing her own grandparents.  You are entitled to the necklace since they can give it to whom they want.", "This!! And never wear it when she's around or she may \"accidentally\" break it.", "NTA. OP, you basically have zero relationship with your stepsister, because of her own doing. Her own jealousy has ruined your relationship. Now, she's continuing her jealous behavior to make it worse. You don't sound like you live at home, so go back to your home. Your stepsister will eventually come back to your parent's home when she gets sick of sleeping on someone's couch, or maybe she'll stay out and become an adult. Either way, it isn't your issue.\n\nAnd, you should have a serious talk with your mom. Make it very clear you are never going to give up your grandma's necklace, and that they should do what they can to get her into therapy, or on a better path. She's an adult now, but if she keeps living with them, they should do what they can to make sure her jealousy doesn't continue to fester.", "Lock it up somewhere or it WILL go missing! NTA. She wants the money only. She's selfish and self-centered. Good riddance if she thinks she can blackmail you for a necklace that was always going to be yours.", "Abby’s grandparents died years ago, so she doesn’t have anyone similar gifting her things", "this was my first thought. I've seen it so many times before that I can smell it in the air.", "Yeah but mom said just sell it and split the money - really!!\nPlus, Abby’s been blowing her off for a while now.", "Guess we see why it skipped mom."]}