{"id": 10822, "submission_id": "11b2ujk", "title": "AITA for not letting my roommate’s girlfriend use my washroom even though she had an emergency?", "selftext": "Basically this. So I (22M) am a college student and I share an apartment with Max (23M) Max and I aren’t exactly best friends but we live together because it’s convenient for both of us. I have the room with the attached washroom (I pay a bit more rent for this) while Max has the smaller room and uses the common washroom. \n\nSo like 5-6 months ago, Max got together with this girl, Ashley (24F). Ashley has practically moved in with us, she’s always here, her stuff is in Max’s room, she rarely ever goes back to her own apartment and acts as if she owns our place. I didn’t care much about it earlier because she used to be in his room most of the time, and it wasn’t causing me any inconvenience. \n\nAround 2 weeks back, when I came back from my classes for lunch, I noticed that the door to my room was open. I panicked cuz I thought it’s some burglar or something but turned out it was Ashley who was using my washroom as Max was using theirs. I was naturally very upset and told her that she shouldn’t have entered my room and used my washroom w/o my permission. She then proceeded to tell me that this *wasn’t a big deal* and she thought i would be okay. I told her that I am absolutely NOT okay with it and that this is a very gross invasion of my privacy.\n\nInstead of being apologetic, Ashley tried to gaslight me into thinking that I was making it out to be a way bigger deal than it actually was and that I was selfish for not wanting to share the ‘good washroom’. By this time, Max had come and I told both of them that if this was repeated again, I would have to talk to the landlord. \n\nYesterday, Ashley had to pee real bad, and again, Max was taking too long in his washroom, so she knocked on my door and asked if she could use my washroom. I was still pissed off about the incident earlier and about her lack of apology, so I told her she cannot. Long story short, she had  to go and use a public restroom nearby. Apparently it was raining. \n\nShe came back and she was crying. Max was furious at me and called me a heartless asshole. People in our friend circle are divided over this, some feel I should’ve let her use my washroom. Others feel I’m in the right. \nAITA?", "created_utc": 1677274631, "permalink": "/r/AmItheAsshole/comments/11b2ujk/aita_for_not_letting_my_roommates_girlfriend_use/", "score": 48, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I didn’t let my roommates girlfriend use my washroom even tho she had to pee real bad and the other washroom was busy. \n2. This might make me an asshole because she then had to go out of the apartment building and use a nearby public restroom while it was raining.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nShe doesn't live there. I hope she's contributing to rent and utilities.", "Nta. She had time to go down the street to pee before Max was done? What's he doing in there? Is he OK? Could she not pee in the shower or sink while he's in there if she's that desperate?\n\nBack to you, it's your washroom that you pay for. I wouldn't be cleaning for someone else too.", "YTA. Gaslight does not mean what you think it means.", "NTA. She totally invaded your privacy without your consent.", "YTA, by your own admission it was an emergency. \n\nShe is the AH in other regards to the living situation overall but that is no excuse for you to have acted with no common decency.", "I guess peeing while her boyfriend's showering is a no no? Otherwise, does he always stay in the bathroom for half an hour? She doesn't ask to pee before he camps in there?\n\nAnd I DON'T wanna know what takes that long if he's not showering!\n\nNTA", "NTA. I don't want anyone in my private spaces. Does roomie have intestinal issues or what? It sounds like he could use some psyllium seed husks, or lay off the lactose or something. If he was on the toilet, that's way too long for anyone.", "Hmm let’s see. Shes gaslighted, been dismissive, doesn’t apologize, uses without asking, and stays without paying. Let me see. NTA! The Y T A’s are right about you being immature. Be mature like they say and tell the landlord, that’s the mature thing to do honestly.", "NTA. Needing to pee is not an emergency. Speaking from experience: if she doesn't pay rent, she can get bent.", "NTA\n\nYour room incl. bathroom are off-limits to them.", "NTA", "ESH. \n\nShe's TA because she shouldn't have invaded your privacy and she should have apologized for doing so. Going into your room without your permission absolutely deserves an apology. \n\nYou're TA because in this case, she was asking, and she had to pee, it's embarrassing to pee your pants. You could have had some grace and let her use your bathroom.", "ESH. She acted like a child, but denying her the access to the bathroom feels like a petty thing to do imo.", "NTA. Get a lock for your room and advise your landlord because it isn’t free she’s living at your place running up electric water and heating bills.", "What was Max *doing* in his own bathroom that he couldn’t stop for a minute and let his GF Ashley pee?  Was he showering? He could let her in to pee. Was he primping in the mirror? He could still let her pee. Was he on the toilet himself??? Unless there is an emergency intestinal deluge, he could, (as my mama used to say), shit-or get off the pot. And then he could let her pee!\n\nAshley needs to take this up with Max.  You could have let her use your bathroom but her nonchalance and entitlement to your bathroom annoyed you, so … no, Ashley,  you have to go down to the public bathroom in the rain.  NTA", "NTA - if she hadn't entered your room earlier without your permission then I'd feel differently but she did and wasn't even apologetic about it.\n\nAlso, it's her boyfriend's fault for taking his sweet ass time in his bathroom when he was aware that his girlfriend had to pee. Not your fault that he was probably taking a leisurely shit and playing on his phone instead of hurrying up so his girlfriend could use the bathroom.\n\nAnd if you don't already have one, I recommend putting a lock on your bedroom door and locking it when you aren't home. Obviously, they have no boundaries and I doubt that was the first time they've been in your room while you have been gone.", "ESH\n\nMax for taking too long, after HIS Gf told him she used to use the toilet, Ashley for moving in without moving in and for making a huge deal about it, and you because if she really needed to go, she needed to go.", "ESH you were right to be mad about her going into your room AND bathroom WITHOUT your permission. And she was wrong for gaslighting you. And your roommate was wrong for not making sure that his guest doesn’t understand boundaries (although with her practically unofficially living there you guys suck at boundaries). But this time she did have the opportunity for your permission, allowing you the time to hide your undies. You could’ve been the bigger person.", "NTA\n\nWhy couldn’t she just use the same washroom as Max? Are they that dense?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBasically this. So I (22M) am a college student and I share an apartment with Max (23M) Max and I aren’t exactly best friends but we live together because it’s convenient for both of us. I have the room with the attached washroom (I pay a bit more rent for this) while Max has the smaller room and uses the common washroom. \n\nSo like 5-6 months ago, Max got together with this girl, Ashley (24F). Ashley has practically moved in with us, she’s always here, her stuff is in Max’s room, she rarely ever goes back to her own apartment and acts as if she owns our place. I didn’t care much about it earlier because she used to be in his room most of the time, and it wasn’t causing me any inconvenience. \n\nAround 2 weeks back, when I came back from my classes for lunch, I noticed that the door to my room was open. I panicked cuz I thought it’s some burglar or something but turned out it was Ashley who was using my washroom as Max was using theirs. I was naturally very upset and told her that she shouldn’t have entered my room and used my washroom w/o my permission. She then proceeded to tell me that this *wasn’t a big deal* and she thought i would be okay. I told her that I am absolutely NOT okay with it and that this is a very gross invasion of my privacy.\n\nInstead of being apologetic, Ashley tried to gaslight me into thinking that I was making it out to be a way bigger deal than it actually was and that I was selfish for not wanting to share the ‘good washroom’. By this time, Max had come and I told both of them that if this was repeated again, I would have to talk to the landlord. \n\nYesterday, Ashley had to pee real bad, and again, Max was taking too long in his washroom, so she knocked on my door and asked if she could use my washroom. I was still pissed off about the incident earlier and about her lack of apology, so I told her she cannot. Long story short, she had  to go and use a public restroom nearby. Apparently it was raining. \n\nShe came back and she was crying. Max was furious at me and called me a heartless asshole. People in our friend circle are divided over this, some feel I should’ve let her use my washroom. Others feel I’m in the right. \nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. You should’ve been the bigger person and let the girl use the washroom. It’s not easy being a girl having to run around trying to find public restroom that is safe and hygienic. While it is raining.", "Info: how is this different than a revenge story?", "NTA - Plenty of people live in one-bathroom homes and they manage to share a single bathroom.   All she had to do was bang on the door and tell Max to hurry the hell up. \n\nIf she had time to leave the apartment and go to a public restroom it mustn’t have been that big an emergency and her actions were purely for dramatic affect.   \n\nI feel like this was a test of your boundaries following the last incident to force you to give her permission to use your bathroom in “emergencies” (which would turn out to be whenever she felt like it).", "NTA. She’s his guest, not yours. She should use his bathroom, not yours.", "> she rarely ever goes back to her own apartment and acts as if she owns our place.\n\nI have no sympathy for Ashley. **NTA**. \n\nAlso, put a lock on your door if possible", "YTA - \n\nWanting someone to ask your permission to use your personal bathroom isn't what makes you the AH here, however:\n\n>Very gross invasion of privacy\n\nWhat? She walked through your room to use the restroom. She wasn't rummaging through your personal belongings. She was literally using the restroom. \n\n>She shouldn't have used my washroom without my permission.\n\nShe asks for permission the next time to use it and you deny her the right to use the restroom and make her walk in the rain to find a public bathroom elsewhere. I literally couldn't imagine denying someone the use of the restroom and in turn forcing them to have to leave the home to find a public bathroom elsewhere, especially in the rain!", "I’m going to say ESH very light on you because it was a dick move to make her go use a public bathroom. But what exactly does Max expect? You can’t just all of a sudden move someone in without a conversation, especially if she’s not paying rent or utilities. I would explain that to Max and I’d think about putting a lock on your door", "YTA. She followed your rules about asking, and you were petty", "NTA. I would also tell Max that you signed up to room with him only. If he wants his gf there all the time, they should either get their own apartment or she should start contributing to expenses.", "NTA. You pay for the extra bathroom. If it was the first time and she really needed it and asked - it would be YTA. But here, she invaded your privacy and didn't apologiced, so no you had no reason to let her use your bathroom again. Maybe also look your door if you are not around, so she can't use it anymore. \n\nAnd she is a grown woman. She should know when she has to pee or hold it. Like if her boyfriend has to go to the toilet for a while to tell him, she has to go first or hold it for - how long can it be? max half an hour? Or knock at his bathroom door and tell him he should hurry up. What would she do, it there was just one bathroom?", "NTA. I mean, the girl entered your room w/o your knowledge and wasn’t even apologetic about it. If this isn’t the consequences of her own actions.", "Eh. Would it have been nice of you to just let her use it since she asked? Yes. Would she have respected your space had you not been there? Doubtful. She hasn't really apologized or shown she won't do it again. I'm going NTA and would say get a lock for your door when you aren't home. She's probably used yours quite a bit and just never gotten caught.", "NTA.\n\nIf the earlier incident did not happen or If she had at least apologized about it, it’s a different case. You’re not her boyfriend and if it was that urgent, Max could’ve let her use the bathroom he was in.", "ESH, but I'm sure the sub will disagree with me and say N T A because they are petty teens and you are acting like one. I get that you were pissed off but \"they invaded my privacy by using my bathroom\" isn't a good reason to deny access to something they need and doesn't cost you anything. She is being melodramatic idiot of course. To me it seems like you are envious of Max and are lashing out at them.", "Op I think it’s time to reconsider this. It’s going to be divided no matter what but at the end of the day it’s your space and she clearly didn’t respect you or your privacy enough to care(considering that she still berated you for it)", "NTA but that is not what gaslighting is.", "Yeah, YTA. I completely understand being mad about her using it while you weren’t there. You shouldn’t have told her that she can’t use the washroom without your permission, you should have just told her she’s never ever allowed to use it bc that’s obviously what you meant. It seems that you are just a little booty hurt about how she handled it.  Like if she would have been more apologetic you would have allowed her to use it. This is petty. If I were her I would have peed in the backyard, the sink or some other communal area so if you ever tried to complain to the landlord they could just let them know that you wouldn’t let her use the restroom and she didn’t have a choice.", "NTA.\n\n1. She entered your room without your permission. That is a violation of your privacy. And then she used your bathroom, again without your permission. If I were you, I'd have been furious.\n\n2. Her lack of apology shows that she is an entitled AH. You were right to deny her permission again.\n\n3. If Max is so concerned about the well being of his queen then maybe he shouldn't take too much time in his bathroom.", "Afaik she’s not.", "That’s gaslighting", "I mean most of the apartments I lived in (and my first house for that matter) only had a single bathroom and we managed to make it work.", "PSA that psyllium seed husks (metamucil) is life-changing if you have gastrointestinal issues. Just saying. lol", "You had me in the first half, not gonna lie.", "Be the bigger person = be the flatter doormat.", "But it is easy to hold it in for 5 minutes :/", "Unfortunately the design is such that it’s not possible for me to put a lock on my door. I would’ve if I could.", "Having someone who is essentially a stranger come into my room would not sit well with me.", "She walked into my room and used my washroom when I wasn’t even in the apartment. I mean, for me, entering someone’s bedroom is a gross invasion of privacy, let alone using their washroom.", "I mean, I would’ve let her if she apologised/was apologetic about entering my room and using my washroom when I wasn’t even in the apartment.", "Not sure if you know how toilets work, but only one person can use it at a time", "Well . It does cost him more because he pays extra to have the private bathroom.", "I mean as a guest in their house she probably should've been nicer to OP if they want OP to share things with them.\n\nHaving to hold peeing is a thing all adults have to do sometimes. It sucks but isn't that hard.\n\nHaving to share things with folks who are rude to you isn't a thing anyone is required to do.", "Your bills would have gone down surely if she was.\n\nSorry I mean bills gone up, but your contribution gone down. Since its being split 3 ways not 2.", "She told him he’s making a bigger deal out of it than he is, which is her opinion on the situation. It’s a valid opinion and I agree with her.\n\nI’m not sure when people started using a word for a very specific type of psychological manipulation as a colloquial term, but it pisses me off every time I see it.", "I get the husks themselves online. It really is life changing.", "You can't switch the doorknob out for one of the passcode/fingerprint knob systems?", "He's been practically living with this person for half a year. How exactly is she a stranger?", "I mean, you gotta go you gotta go. If she's been practically living there for a while she probably just assumed you'd have no real issue with it. And most people wouldn't I'd guess. \n\nShit, if you had been there she likely would have asked and you'd probably have said yes. Gross invasion of privacy seems a bit much for something you'd probably have said yes to if you had been there at the time.", "You're NTA, if she wants to use your things she should be nicer to you simple as that. Terrible guest behavior on her part.\n\nYou should just get a door lock for your room.\n\nAlso what's he doing in there that she can't go in and pee? How long could he possibly be using the toilet?  If he's showering then she could use the bathroom.", "The girl was able to go to a nearby public restroom but couldn’t wait 2/3 mins for Max to finish or ask Max to hurry up so that she can go?", "Would it be nice to not have to wait for the toilet? Yes.\n\nWould it have been smart to be nice to the person who pays to have a bathroom to themselves so you wouldn't have to wait? Double yes.", "That's why they have sinks. LOL", "Ah yes, because they pay slightly more rent it justifies them being a petty baron. Grow up. This sub isn't \"Am I technically right in the narrowest interpretation of property law,\" It's AITA and denying someone who needs to use the bathroom is an AH move.", "I agree she was being melodramatic, thats why I made it ESH. She could have pissed in the alley or come back without crying. \n\nAnd yes he wasn't required to let her use his bathroom but he could have showed some basic human compassion for someone in need. You know what I call someone who lacks compassion? An Asshole.", "I meant, we still divide the utility bills 50/50. Im not sure if she’s contributing in Max’s half or not.", "Demonstrating that you clearly do not understand what gaslighting is.", "I don’t think so.", "Clearly he isn’t comfortable with someone coming into his room especially unannounced it’s his room and he gets to decide", "Bc she doesn't pay rent and has been living there.", "Because most of the time she was in Max’s room and not causing him any inconveniences aka he never had to deal with her.", "Exactly - it can’t have been that big of an emergency.", "But why should OP be inconvenienced when the solution was for her to ask her own boyfriend to vacate his own bathroom? \n\nAnd by your logic, should OP allow every random friend his roommate has visiting to use his private bathroom just because they need it? \n\nHe pays for the privilege of having his private space, he's allowed to say who has access to it. And if they were\ta bit more polite and apologised for trespassing after OP raised the issue the first time they wouldn't have been in this position in the first place.", "I mean she didn’t show compassion for him so why should he? Not that it’s not something people shouldn’t do but he can do what he wants since he pays to live there. I don’t think he’s particularly jealous of max either. I wouldn’t want someone just entering my room without permission. Besides what is taking max so long in the toilet that his gf can’t even get her chance to pee there?", "That would still mean you're paying part of her added expenses to the household (electric/water)", "OP, did she confuse you? Did she make you question your own sanity?", "I mean most doorknobs come off with a few tools like a screwdriver so maybe look into it?", "Glad you read the first part of my comment when I told him that wanting this isn't what makes him an AH 🙃", "Not paying rent somewhere you've been staying doesn't make someone a stranger, what? A mooch maybe, but that's certainly not the definition of a stranger.", "Because sometimes life is inconvenient? Because sometimes more than one person needs to use the bathroom at once? \n\nAnd yeah, if his roommate has people over and the main bathroom is occupied and someone needs to go it would be the decent compassionate thing to let them use his bathroom.\n\nI agree with that last point hence, all of them are AHs.", "I feel like I'm repeating myself here and replies like this are proving my point about this sub being full of petty people who don't understand that paying more money or being pissed off about something that happened two weeks ago doesn't exempt you from being a decent human being. My judgment was ESH. They are all AHs.", "I don’t think the landlord will allow that. I’ll try asking.", "My bad for not continuing what I was saying but seriously. Dude is paying for the bigger room gets insulted by someone who doesn’t pay rent and somehow has to be a the kind one? Personally I wouldn’t be the kind one I don’t know about you. But letting someone live in the house rent free without saying anything and then getting disrespected like she has the right to do what she wants just because her bf is the roommate clearly doesn’t make any sense don’t you think? Note: incase I sounded passive aggressive or angry I’m neither.", ">Because sometimes life is inconvenient?\n\nAgain, how come only OP has to be inconvenienced? She practically lives there even though she doesn't pay for the place, acts entitled, invades OP's personal space without asking, acts entitled again and doesn't apologise, tries to invade his space again and then acts entitled again. \n\nIn the meantime, her bf must be giving birth in the other bathroom or rubbing one out, because he's been in there long enough for her to get desperate about using the toilet and go all the way to find a public restroom. \n\nSorry, but I see absolutely no reason for her being OP's problem.\n\nSame with other random friends, I wouldn't want strangers in my bathroom. Sorry but I don't clean toilets after people I don't know, or like.", "If the entrance to your room is inside a private apartment, they wouldn't know (and if they need to know, I genuinely don't think it would be a problem. ESPECIALLY if you explain why; most apartments have laws against extended guests, so they probably would have an issue with her being there so much). ANYWAY just save the original doorknob and re-install it when you move out. My BF did that at his old place and had no problems.", "Go for it! Because it's not the main lock to the apartment, as long as you hold on to the original doorknob and put it back whenever you may end up moving out, it may not be a problem at all. It's definitely a more proactive and adult sounding approach than just telling your landlord you want him to chastise your roommate like a child because his girlfriend wants to pee in your bathroom 🤷🏼‍♀️", "Instead, speak to your landlord about the third *de facto* tenant in your apartment who isn’t paying rent.", "As I said, I would never deny someone the right to use the restroom, even if it meant needing to go through my room when I wasn't home. Not saying Ashley has the issue, but needing to use the restroom can be painful sometimes and I'm not going to ask someone if they're experiencing such an issue. If they need to use the restroom, then use it. So long as they're not going through my things in the process or making a mess to use the restroom, I wouldn't care. \n\nWith that being said, OP told her to ask for permission. She asked for permission as requested, just to still be denied? It was a childish powerplay.", "Definitely childish but his room his rules. I don’t get to dictate what he does and neither should anyone else. Sometimes being selfish is an absolute piece of work but unfortunately that’s how people are like", "But it begs the question of why ask someone to ask for permission in the future if you're just planning to deny that permission? If you don't want someone using your restroom in the future, bluntly tell them it's off limits, don't give an option of permission just to deny it. It's silly.", "I agree but I think through the post you can see that OP was mostly not confrontational. It does raise questions but I can’t say for sure what the answers are since I am not OP."]}