{"id": 10833, "submission_id": "11ayc2s", "title": "AITA for agreeing with my aunt that she put a lot of food on her plate?", "selftext": "Hi Reddit, my family is torn on this so would like your opinion. \n\nMy aunt is probably the vainest person I know. Growing up I would hear stories from her youth over and over again. How she was the prettiest girl in town, how everyone wanted to date her, how she had the best style and personality. More offer than not she would subtlety put my mom down when comparing their teenage years. \n\nMy family lectured us not to say anything because that was my aunt’s way to cope with gaining weight and losing her beauty over the years. Fine.\n\nMy aunt managed to lose a lot of weight recently and became obsessed with it. When we have family dinners, if no one brings up the her weight loss she’ll force the subject somehow. One of her ways of doing it is by putting a RIDICULOUS small amount of food on her plate and then loudly complain about it being too much. The people around her start parroting how that’s not true, she barely put anything of her plate, how she already lost a lot of weight etc. \n\nMy aunt obviously knows that’s not a lot of food because she always eats everything and then quietly goes for seconds (a normal amount of food this time). \n\nOn to the issue at hand. We had a family dinner recently and my aunt sat beside me. She processed to complain about how her eyes were bigger than her stomach this time and she won’t be able to finish her comically small portion of food. This time, however, instead of doing the usual routine of “ha ha you silly skinny aunt, that’s no food at all” I agreed with her. I said you’re right Aunt, that’s a lot of food, and if you can’t eat everything I’ll help you with the leftovers bc I didn’t put too much food on my plate.\n\nShe was visibly upset and left shortly after eating, which is something she never does.\n\nSo, AITA? My parents think I am.", "created_utc": 1677263397, "permalink": "/r/AmItheAsshole/comments/11ayc2s/aita_for_agreeing_with_my_aunt_that_she_put_a_lot/", "score": 242, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I knew I was being petty when I agreed with my aunt. She clearly has problems with her weight and it was arguably insensitive of me to provoke her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. This is gold.", "NTA. You’re allowed. Especially if she was digging on your mom. It’s funny how certain family members become “untouchable” and they’re feelings are prioritized above others. It was petty, but it’s also not healthy for her to live on “Fantasy Island”. Thanks for the smile.", "NTA - Honestly, you kind of knocked it out of the park. Insecurities suck, but those who CONSTANTLY project their insecurities onto everyone else in the room/space ***really*** suck. Especially when it's someone who fell off... just pull yourself back together in silence, way more respectable.", "NTA. and LOL!", "NTA\n\nShe’s fishing for compliments, and you didn’t bite this time. You didn’t even say anything overtly rude, unless your tone conveyed it that way.\n\nDoes she expect everyone to pander to her forever?", "NTA. This is epic! Good for you shutting this thing down. Just because everyone else goes along with the stupid game doesn't mean you have to.", "NTA\n\nHer manipulative behavior is detestable. Please don't reward it anymore by playing along. This kind of delusional self absorption drives the worst kind of entitlement. Maybe there would be fewer selfish ass hats running around in the world if their initial attempts were shut down at home.", "NTA. If she has issues with her weight she should stop bringing it up.", "NTA.  Pompous and ridiculous people get called out eventually.", "NTA hopefully she will give up the ridiculous charade now.", "YTA. I think your aunt may have an eating disorder or then she’s just a very insecure person but however you shouldn’t have said that because it clearly hurt her feelings and she might even start doing more extreme diets or something else. I do get it that you we’re pissed because it seems like she really wanted some attention and just like people telling her that she’s not really that ugly but you still should’ve concidered thinking before you said it. I think right now you should really apologize to your aunt and tell her that you didn’t really mean it and that you were just pissed off because she gets all the attention all the time and all she does is complain and that it actually ruins the atmosphere. Also you might wanna concider getting some help for her since she may have an ed.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi Reddit, my family is torn on this so would like your opinion. \n\nMy aunt is probably the vainest person I know. Growing up I would hear stories from her youth over and over again. How she was the prettiest girl in town, how everyone wanted to date her, how she had the best style and personality. More offer than not she would subtlety put my mom down when comparing their teenage years. \n\nMy family lectured us not to say anything because that was my aunt’s way to cope with gaining weight and losing her beauty over the years. Fine.\n\nMy aunt managed to lose a lot of weight recently and became obsessed with it. When we have family dinners, if no one brings up the her weight loss she’ll force the subject somehow. One of her ways of doing it is by putting a RIDICULOUS small amount of food on her plate and then loudly complain about it being too much. The people around her start parroting how that’s not true, she barely put anything of her plate, how she already lost a lot of weight etc. \n\nMy aunt obviously knows that’s not a lot of food because she always eats everything and then quietly goes for seconds (a normal amount of food this time). \n\nOn to the issue at hand. We had a family dinner recently and my aunt sat beside me. She processed to complain about how her eyes were bigger than her stomach this time and she won’t be able to finish her comically small portion of food. This time, however, instead of doing the usual routine of “ha ha you silly skinny aunt, that’s no food at all” I agreed with her. I said you’re right Aunt, that’s a lot of food, and if you can’t eat everything I’ll hell you with the leftovers bc I didn’t put too much food on my plate.\n\nShe was visibly upset and left shortly after eating, which is something she never does.\n\nSo, AITA? My parents think I am.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA Seconds for you!", "Thanks for the laugh!  Well done!  NTA", "ROFL - NTA! Your family has a very weird reaction to this aunt and her narcissism. Every single person in my family would be laughing at her and expect her to laugh at herself too. You did it in a hilarious way but honestly ALL your family should stop handling her toxicity with kid gloves.", "NTA", "My exact reaction", "My family would just blankly stare and change the topic or interrupt her when they know the garbage that is about to come out her mouth. I would love to see the reaction if she is flat out ignored or talked over. That makes narcs lash out and is really funny.", "NTA. I had a classmate in school like that. It was with Everything. She wanted to be told she was good and great.\n\nI just went ‘I’m not doing this.’ And would refuse to engage. She would get all pouty and huffy that I wouldn’t fluff her feathers for her.", "op=Justified A-H LOL \n\nthat was cool burn! LOL", "I know I’m seeing this a bit differently. First, how old are you? The other is family should love, accept and respect each other. What harm is there with showing your aunt compassion? Maybe she has depression, low self esteem etc. You could have made her day with a quick remark about how good she looks, instead you chose to hurt her feelings. A smile and a kind word can make someone’s day. YTA", "Nta bloody hell wish Id been there", "NTA. Love it haha!", "NTA comedy gold", "LOL. NTA.  She had it coming.", "Nta. Laughing so hard", "NTA\n\nCackling with glee here. 🤣🤣🤣🤣 You handled it like an absolute boss.", "NTA\n\nYour Aunt has only gotten away with her toddler behavior because the family has allowed it. \n\nShe's an adult. Adults are responsible for their decisions. Aunt decided to make a stupid comment and finally got told off for it. Her feelings don't matter whatsoever and they don't excuse her acting like a child.", "NTA. This is \\*chef's kiss\\*"]}