{"id": 10841, "submission_id": "11b1z1u", "title": "WIBTA if I travelled while my wife took care of a 3 month old baby?", "selftext": "Hello, I (28M) work at a company that has headquarters based in Europe. \n\nMy team at work (6 people total) is being flown out to Europe for 2 weeks to coordinate and prepare a product launch with our colleagues there. While we are there, my team wants to do some sight-seeing, hiking, etc. I have no had the opportunity to experience another country before or travel to this extent.\n\n\nThe issue is that after our company announced this trip, we found out my wife(29F) is pregnant. We are very excited for this new adventure. The trip will be around the time our baby is 3 months old. My wife thinks that this is not a good time to go on this trip. It is possible for me to do this work remote, so it's not that I have to go to Europe. \n\n\nMy wife will not be working at this time so child care is not a concern. Our in laws both live within 10 minutes so we are also not without a support system in the 2 weeks. \n\n\nI am conflicted because on the one hand I would love this experience, but I also know it would be unfair to leave my wife to take care of the child for 2 weeks while I'm away having fun.\n\nReddit, WIBTA if I still went on this work trip?", "created_utc": 1677272487, "permalink": "/r/AmItheAsshole/comments/11b1z1u/wibta_if_i_travelled_while_my_wife_took_care_of_a/", "score": 196, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took is that I am deciding whether I should leave a newborn with my wife to go on a work trip. \nThis may make me an asshole because I am making my wife do all the work of taking care of a child.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "“My wife thinks that it’s not a good time to go on this trip” \n\nThat kind of says it all. If your wife was cool with it, it’s fine. If she doesn’t, don’t go. 3 months is still young and she may be nervous.", "\"WIBTA if I left my postpartum wife to take care of our first child by herself for two weeks, after she carried them to term, gave birth to them, and dealt with the genuinely terrifying things that come with giving birth? I mean it's not like she needs my support in this crucial time at all. \n\nI mean, I might be her spouse but she has in-laws around, I don't even really have to be a father during the night so my wife can get some rest. And honestly, it's not like she ever needs a break from being a first time parent. She should be fine with little to no sleep with a newborn, constantly getting up and down to feed and change them through the day and night, with no relief from me, the spouse who claims to love her but doesn't really understand what the big deal is\"\n\n\nYou're so right, OP. What could go wrong if you take that trip?\n\nYWBTA. You already know it, you just came here hoping someone would say you wouldn't be TA so you'd feel better about it.", "YWBTA. If I were your wife I would be really pissed off. That's gonna be her memory of the first few months of having the baby - you sodding off to have a lark in Europe. \n\nI wouldn't do it if you want to retain the good favours of your wife.", "YWBTA. The timing is off. Your wife will still be healing. Your child may not be sleeping through the night yet. Feeding may not be going well. I would be hurt, and angry, that you would choose to have fun instead of staying home to take care of your family.", "YWBTA. \n\nI promise you will feel VERY differently about this once your baby is born. This is not something you can even try to wrap your head around right now when you haven't experienced the \"4th trimester\" for yourself. \n\nYour wife will carry this baby for 9 months, literally rip her body open to get it out, and then be tortured through sleep deprivation while she's trying to heal. So the first 3 months, it's your job to take care of HER and the baby. At 3 months she may be just starting to physically feel normal again.  That's about the time I started being able to shower AND brush my teeth in the same day! Hooray! But there's a good chance she'll be dealing with postpartum mental health issues. That is NOT the time for you to voluntarily leave the country for 2 weeks. \n\nFor context, Prince Harry left the country for 24 hours for a charity event when his son was a month old. He was vilified in the press for leaving his newborn and his wife. And that was 24 HOURS!!", "YWBTA. You will have a newborn child - you can work from home. This sounds like it’s your first child, and I promise you, your wife is going to need the support.", "YWBTA \n\nThere could be complications, she may take longer to physically recover than you think and you don’t know if PPD will be an issue or not.\n\nPrioritise your wife over a trip to Europe.", "YWBTA if you went, especially since you said you would be able to do this work remotely.", "[deleted]", "YWBTA that’s way too soon to be going away, you have no idea what might happen with the birth or if any complications will arise, what your partner’s recovery will look like, etc. Stay home, and bond with your baby, two weeks is intensely long with a baby that small.", "YTA. First off, why do you call YOUR child “A baby”. This is YOUR baby, not A baby. Will your in laws be living in your home 24/7 during this time? No? Then that’s not a support system for a newborn and mother. This is more than a work trip and you know it. Come on, you know what the right thing to do is", "YTA if you decided to still go. Your circumstances have changed, you have a child on the way. Don’t ruin your relationship for a trip to Europe.", "INFO - does your wife get a 2 week vacation after you while you stay home and watch the baby? If the answer is yes then go have a good time", "It might have to be a game time decision. But you should make a plan and backup plan now. There's no way to know before your wife has the baby whether it will be okay to leave for 2 weeks or not. Can you tell work that you want to attend in person, but if there are complications with your newborn that you may have to switch to remotely supporting the launch?\n\nIf she has no complications from labor and the baby is doing great and eating and sleeping well, then she might be okay. But on the flip side she could have a really rough birthing with complications and the baby could be having a hard time too or there could be emergencies. Regardless, she and the baby will likely need some extra hands help if you're gone. \n\nTalk with your wife, tell her you will respect her final decision. Talk with her and make a contingency plan and see if your family can stay with her and the baby if you decide to go so that she is not alone and has help.", "I’m going against the grain but NAH. It’s much harder to do work if you’re the only one remote. You miss out on those informal talks. Do you have to decide now? Can you wait until it’s closer? At three months, I would’ve told my now ex to go ahead and just had our parents take turns helping.", "INFO: do you have a plan to ensure your wife has enough support and help during the two weeks you're gone? \n\nThis means, 1) in a hypothetical (altho extremely unlikely) situation, if she also has to go on a work trip during these two weeks, she also gets to go if she wants to instead of prioritizing *only* your career. After all she gave up much more than 2 weeks in her job to give birth to your child\n\n2) she will not go through any emotional distress during the time when you're gone - i.e. you've given her enough security and comfort she doesn't feel abandoned (esp during the emotional period post pregnancy) \n\nRemember your job does not equal to your career, and you are not married to it (I hope not). These two weeks will not be the *only* chance that builds or breaks your career like some other comments implied.", "NAH as long as your wife abs baby are doing okay after delivery.  And also if you set up some help for her.  You need a sitter , her mother or one of her friends come to help out.", "Lol how much you wanna bet he still goes", "Yes YWBTA YTA\n\nYour life situation has changed. You need to be home to take care of your newborn. \n\nYou should be expecting to contribute 50% to childcare and housing chores when you're not at work, as your wife does the same. \n\nYou can plan a trip when the child is a bit older.", "YWBTA if you go. Your wife has already expressed her concern and discomfort with you traveling so soon after she gives birth. It’s great that you have supportive family close by, but your wife wants *you.*", "YTA\n\nBut only lightly. I get wanting to go on this trip because it is a nice opportunity, but there is a major sleep regression that happens around 3 or 4 months with babies. It is absolutely miserable for the parents, and sometimes the kid is even extra miserable. If you can do this all remotely and it won't impact your career I would strongly recommend staying home. Europe will still be there when your kid is older, or you can take a trip with the family.", "NTA. I’m honestly surprised at all of the comments suggesting otherwise. Your wife will be a SAHM and yes it will be a rough 2 weeks but she’ll have plenty of other support from family. I was a SAHM until recently to a 6 year old and 2 year old and I would not have denied my husband this experience and hope he’d do the same for me. Maybe plan a trip in the future that your wife can go on while you care for your child. Unless she or the baby have any health complications I personally don’t think you’d be TA.", "NAH.\n\nI remember with our first, my husband had to go out of town for a 3-4 day work trip when our son was also 3 months old. I cried.\n\nIt was really hard for me, but I told him to go anyway and had my mom come stay with me. I also hadn’t gone back to work.\n\nTwo weeks is a long time. Can you cut that time in half, do half the time there and half at home? It’s also tough to decide now as you don’t know what kind of baby you’ll have (good sleeper, eater, etc.) or what kind of birth and healing your wife will experience.\n\nHonestly I’m not sure there is a right and wrong here. Good luck.\n\nIf you truly think being there would be super important for your career, then talk to your wife about it and try to make it happen. If you feel it’s not actually that important and you’d just like to be there, consider staying.", "NTA - I would tell my spouse to go but it would be contingent on someone else staying with me and baby to help. I think that’s a good compromise. \n\nMissing a major product launch in-person is a legitimately big deal that can’t be truly experienced remotely.", "I’m a mom of 3 with a husband who travels for work (although typically not more than 4-5 days at a time, and he comes home on weekends if it’s a multiple week thing) and I am torn on this one. I think NAH and I’m not sure what the right answer is. When do you have to decide? And I know your in-laws are close, but does your wife feel comfortable enough around her and/or your parents for them to really be helpful in the early postpartum time period? Do you have friends with kids who could be part of a wider support system for her while you are gone? There are just so many factors to consider.", "YWBTA.\n\nA three month old child requires care 24/7 . \n\nI would read up on pregnancy and babies in general.\n\nhttps://mamadidit.com/the-best-pregnancy-books-for-dads/", "> I am conflicted because on the one hand I would love this experience, \n\nYTA - you have responsibilities.", "Info: what are your career goals and plans with this employer?  Can this project have career implications for you?  Also, what is the company culture like at your job - even if you CAN do the work remotely, will it reflect negatively on you?  Is this a decision you have to make NOW, or can you play it by ear?  \n\nI am leaning towards NAH.  I understand your wife´s point of view if this is your first.  But honestly, I did it.  I was alone with my 2 little ones for the first 3 months of my youngest´s life with hubby and my family 14 hours away.  But, I am very independent and not one to ask for help anyway.\n\nI‘ve also spent many years working in HR, so I do understand the implications on careers of things like this.\n\nI would say talk again, keep talking, talk with her parents and especially her mom.  Talk through what support would be needed if you did go and make sure grandma is up for it.  Talk to your employer and make sure they are ok with making a decision closer to the date of the trip.", "Nope, nta. I’m a mom of 3 and if my husband had this opportunity I’d encourage it. Especially if family lived so close. It’s only two weeks. After 3 kids I can say newborns are hands down the easiest stage. I even had one with colic. Prob gonna get a lot of hate but idc. I say go for it!!!!", "YWBTA you should help your wife with your newborn child", "As your wife has given her opinion. YWBTA", "YWBTA unless wife sincerely changes her mind.  There is A LOT of stuff that comes up in that time period even if the situation is \"perfect.\"  Sorry dude, but your family and baby in particular are #1 right now.  It is perfectly understandable wife wants/needs the help and presence of OP in particular. \n\nIf wife said OK or if not going was going to place OP's job in jeopardy I would judge differently.", "NAH because yeah that's a great opportunity and it's work related. Are there going to be issues if you opt to work from home instead? I know it's an option but with time differences, etc will it make things more of an issue? Will you work from home or the office during that time? \n\nAnd can see wife not wanting you to leave as well but a good support system is in place so she wouldn't be alone.", "I already knew you were the AH because in your title you said “a” baby instead of “our” baby. Think about what your priorities are.", "My husband used to work out of town every week. There was some that it would be 2 weeks. Was it hard? Yes. But I had his family as a support system. If she’s comfortable with your family helping, then go for it. Europe is an amazing opportunity. Just make sure you plan something out for her to have some time away too. Being a momma isn’t easy", "Nta. As a mom - if i had a support system close to me id tell my hubs to have fun and send me pictures.", "YWBTAH if you went anyway when your wife disagreed to it, and you didn't talk to people beforehand. I would say if this were something you seriously want, and it can be great for your career talk to in laws about possible helping for those 2 weeks because you're going to be far away during that time. If they are able to and willing to even live with her talk to your wife, then and let her know she will have live-in support. If she still feels uncomfortable with it.... don't go.", "This is tough. Two weeks is a long time. I don’t know what position you hold in your company, but I know being the only one working remotely isn’t always best for your career. I think you are focusing on the sightseeing activities because that’s what you feel particularly guilty about. \n\nTalk to your wife. Really look into her support options while you would be away. And know that, if you do go, you owe her one!\n\nGood luck!", "NAH\n\nTotally understand you wanting to go. What an opportunity!\n\nAlso, I understand your wife being anxious about it. \n\nI'm assuming this is your first child? It's really hard to predict how it will be, especially when baby is 3 months old! \n\nHow long do you have to decide to go or not?\n\nI would say maybe try to work with your wife about why she doesn't want you to go...fear of the unknown? Could a couple's therapist maybe help you guys process the decision? \n\nI hope you get to go, but only of everyone feels good (or mostly good) about the decision!", "NAH. Go in details about what her concerns are and see if they can be otherwise addressed though. Maybe having the house professionally cleaned, meals prepared, a night nurse, ect. for alternatives", "NTA\n\n That's a trip of a life time she can handle the baby a few weeks then when you get back maybe she could go on a girls trip or something.\n\nProvided that baby is healthy and mom is healthy and not suffering with ppd no reason you can't go", "Yta your wife is telling you she needs you and you can do it remotely.  Being a parent means not always getting to do what you want to do. \n\n 3 months is not a long time to have recovered from childbirth, and many women need their partner during that time.", "Oof. Two weeks is a long time. But OTOH there are lots of single mothers who manage fine without a partner and with parental support, and being involved in the trip might mean a better chance of promotion later.\n\nThinking back to when I was in that position as a new mother... I would want him to take the trip AS LONG AS things were fine with me and baby. You need to make that choice along with her.", "YWBTA\nIt's not the lack of childcare support, it's the inherent unfairness of you going to Europe solely for the fun parts. As you said, the work can be done remotely, so that would not be your reason for going to Europe, but the nice parts would. While your wife sits at home caring for the child you had equal parts in making.", "Ywbta\n\nBecause it's not required.  Short trips are okay and required trips for work are unavoidable.  But generally I think dads should default to the moms opinion because it is her body that goes through the trauma.  Epically if she is nursing.", "YTA it's basically a holiday and you don't have to go so yes you would be the AH.\n\nShe's done over 9 months of taking care of the child and you want to abandon her after 3 months? What do you mean the child care is taken care of 😂 you are so not ready for a child.. or a wife for that matter", "NTA. It's primarily work, and the activities mean the rest of the team will form deeper relationships, so it could damage your prospects if you don't go.\n\nA lot of mothers go back to work at 13 weeks or start using a childminder for a couple of hours a day. You have time to plan this so that your wife has a good time. For example, would some of her own family like to come a stay and get to spend time with your baby?", "Mmm NAH\n\nIt’s a work thing, and while you could sightsee and hike at the same time, you wouldn’t be there if it wasn’t for the work aspect, and while working from home is an option, I found myself that it’s not ideal when working with a crew, easier to ask questions in person or show them something in person\n\n\nBut I get your wife’s situation too, it’s a new baby, and healing and learning to care for a baby takes a long time. Especially a first baby, and while your parents are all around, it’s not the same as having your partner be there.\n\nIf you went after she’s already said no, you’d be the AH, but talk to her about it again, explain why\nYou think it’s a good idea, and ask her to talk to you about why she doesn’t\n\nIn the end, if she still says no, that’d be it, especially if there is that option to stay home. \n\n\nIf it were my partner I’d say yes, go, but I’m not your wife", "NAH\n\nHonestly if i were in this situation I’d love for my husband to go lol BUT, since it is y’all’s first child, then I understand why she wouldn’t want you to. But it’s just 2 weeks, so 🤷🏾‍♀️. Again, that’s me.", "NAH, but in my opinion, you should stay home with your family. Your team will understand. Yes you'll miss out on some fun activities, but spending time with your new child will be just as fun (well, maybe not fun, but important).", "YWBTA - Your wife has told you that she wants you to stay home so listen to her. Having a new baby in the house can be a stressful time and it's perfectly reasonable for her to want you there with her. Yes, it sucks to give up a cool work trip but your wife is also sacrificing a lot to have this baby. It's part of the deal.", "NAH. It's not wild to leave your wife and baby for a couple of weeks, people do it all the time for many reasons. Both sets of grandparents are available to help, best case would be for someone to actually stay in your home with your wife.\n\nI see that you *could* do it as work-from-home, but you're naive if you think that it wouldn't benefit your career to work and socialize with your team in Europe.", "YWBTA", "NAH\n\nShe is afraid of taking care of the baby alone, but it sounds like she has a support system.\n\nThis is a work trip that you will have free time on to explore. It's not a vacation. I think that's a big difference. \n\nIdk where you live, but women are okay to return to work after 6 weeks where I live. The baby will be 3 months old and that's enough time for your wife to recover from the birth. She will still be home. I don't see a problem.", "Yes. If you need the internet to confirm this to you, you really are an arsehole.", "Because your wife doesn't feel ready to be alone at 3mo, YWBTA.", "Think about how you would feel if she were the one leaving you for two weeks to care for your child.  I'd be resentful as hell.  Why not take her and the baby along?  Do the sites with her to thank her for the amazing gift of a baby she has brought into the world.", "Yta unless the wife is on board with you leaving. It is very stressful dealing with a new born in the first months. If you can hold off on a decision until after the baby is born might be best.", "Honestly it depends.\nNTA for WANTING to go. But IF you do go it should be with your wife's full and honest consent (no guilting her or pressuring her into saying yes).\nYou should have a FULL plan of support for her, not just in-laws but also paid help since she'll be the one waking up in the middle of the night continuously to take care of the crying/screaming baby.\nYou should make sure that you can cancel the trip at any time since you have no idea what things will be like after the birth. Your baby could be one to get sick easily, your wife could suffer from postpartum depression. There are many possible circumstances which would make you the a-hole if you don't cancel. Also, staying a few days would be okay (again, if she says yes) but just a few, not a week or two.\n\nAlso, after your baby is born, it's very possible you won't even WANT to go.\n\nIf you go without proper planning, without her consent, or in spite of problems with your wife/baby after the birth, then you'll be a massive giant A.", "Your wife would prefer you to be there for her and the baby. You need to seriously take that into consideration.\n\nEurope isn't going anywhere dude. You can take a trip another time. Loyalty should be to your family, not a company. There will be other opportunities to \"network\" and socialize with colleagues.\n\nYou'll never get this time back with your first born. Stay home. Otherwise, YWBTA.", "INFO: How much of a choice is this? How would turning it down impact your career?", "NTA it’s a work trip. Although you do need to make sure you are appreciative of the work your wife is doing at home and it would be nice to send her somewhere for a weekend when you get back (if breastfeeding isn’t a factor that can’t be overcome) to give her a break. If she is nursing so can’t take a weekend away be considerate and ask her what you can do to help support her-", "NTA Your family is important. When it comes time for a raise/promotion, you don't want to be remembered as the one didn't go. Absolutely GO. It's ok to have fun bc you'll be networking while you do and building professional relationships that will pay off later. The grandparents will love hanging out and helping in your places at home. Just be sure to support you wife if she gets a similar opportunity in the future.", "NTA\n\nThis is a WORK trip, not flipping around Europe for fun with your buddies.\n\nCareers are made and broken on these trips (and the behavior of the employees on these trips).\n\nThe baby will be 3 months old.  Your wife will have help when/if she needs it while you are gone.  You can still talk to her and see the baby through video calls.\n\nCommit to the trip.\n\nGood Luck", "yes indeed YWBTA. Two weeks alone with a newborn is a long time. Then think about complications. There will be other trips abroad in t he future. The first months of you first child's life are irreplaceable.", "YWBTA \n\nIt’s able to be done remotely and you could stay home and help your wife with the child you helped create. It’s not your in-laws and parents responsibility to help her. \n\nI’m sure your wife would love an experience like that too so the only way I’ll change my vote is if she gets to go on a 2 week vacation before yours.", "YTA given the baby will be 3 months old and your wife will be struggling.  If you plan on being gone on 2 weeks which is a bad idea at least hire a cleaner twice a week and make her life easier.  Just know your wife may not forgive you for this which is understandable.", "INFO: Is this your first baby? It may not arrive on time and could be late. Do you have family nearby? If there are complications with the delivery or the baby, are you sure you could handle being a continent away?", "YWBTA- she’s your wife, and that’s your baby. What the priority? If you can work remotely, do it. Buy in.", "Do you want to be the guy who goes to Europe when he doesn't have to after his wife expresses that she's anxious about the idea OR do you want to be the guy who takes his wife in his arms and tells her there's nothing more important than being together at a time when she's feeling vulnerable? \n\nDude...there will be other trips. \n\nP.S. You always have to be a father. This is your life now. Embrace it.", "[deleted]", "I mean I think YTA but the only person whose opinion matters on this is your wife. Maybe you should get off reddit and have a conversation with her about it", "I'm gonna go off the trend and say NTA simply bc his paternity leave would be well over. Unless she some form of mental problems after birth  Ie postpartum depression postpartum anxiety postpartum psychosis ect then it should be fine.. it's only 2 weeks and it's not like you guys don't have family within 10 minutes.but in turn your wife also should get a 2 week vaca as well. to keep it fair.", "As a wife and mother NTA. If you’re working your working. Even if it can be done remotely. There are benefits to seeing and working with people in person. Does it suck for her? Sure but she has support.", "YTA if you go even when your wife doesn’t want you to.\n\nTwo weeks is a long time at that stage, and you’ve said you can do the work remotely. And admitted that the main pull is the extra activities.\n\nNAH if she agrees you shouldn’t miss the opportunity and you can both set up supports well in advance.\n\nDon’t let FOMO make your decision here. With your company’s headquarters in Europe, there may be similar opportunities in the future.", "**NTA**   This is a work opportunity, and could have implications for your career.   The idea that you would get the same benefit from staying at home doing the work remotely while the rest of the team is bonding on a two week trip is not reasonable.\n\n\nI really do not understand all these posts about 2 weeks being too much, many many people just do not have a choice.   Military families for instance, deal with this all the time.   You will be home for the delivery and early stages.   She will also have a support close by.    Would her going to stay with parents be an option?", "Yta", "NTA. She have support and 3 months is enough to get routines in place. Speaking with experience with a now 2 year old. \nI stayed home WITHOUT support while hubby had to work 6 days out of 7 and was gone most of the day.", "I understand your feeling, but trust me being their for your family is worth it. You can take her to Europe later in and have an amazing experience then.\n\nPlant seeds for the future, trust.", "op=YWBTA \n\nand you know it but you came here hoping to get a pass.", "Just go! Don't ask. It's best for your career", "\"...A 3 month old baby\"? That's YOUR baby, mister. Yes, YWBTA.", "You are already the asshole for contemplating that and dismissing entirely the very uncertainty that the peripartum/ perinatal period is.\n\nYWBTA", "This depends entirely on what you decide with your wife. Given the circumstances with your in laws living nearby and it being a new opportunity, I think it is doable without being an AH. But if your wife does not feel comfortable with you leaving at that time then yes, YWBTA. You have some time to think it over together and ask your family for help while you’re away. This is a situation very specific to your own family.", "If your wife is not comfortable with the idea then don't go. Maybe the chance will come later again. If it was me I would say yeah go.. and when you come home I get 2 weeks away.", "YWBTA your wife already said no she needs you so listen to her", "YTA", "NAH. It’s a work related trip, not a vacation.", "NTA. As long as you ensure she has help it will be ok.", "Gonna say NAH and here’s why:\n\n1.  You (probably) work in tech, and those product launches are not a cake walk. This is something that’s probably been years in the making and your company isn’t rewarding you “super fun awesome trip”, but seeing it as a strategic necessity to collocate the launch team and drive this sucker to the finish line. To back out would be potentially damaging to your career at this company. \n\n2. You’ll have time after the workday to eat out and maybe check out some sights during the weekends in between. That’s your overlords throwing you a bone - “Hey look we let you check out an art museum on Saturday instead forcing you to grind away in a conference room for 10 hours without a piss break.” This is hardly a vacation. Recognize that for what it is.\n\nWhat I would do, though, is be loving and understanding of your partner’s worries about your absence. Yes, it’s needed. Yes, it sucks that you’re not gonna be around. Acknowledge that. Capitalism presents these shit situations all the time but we gotta push through begrudgingly anyway.\n\nYou’re paying the bills for now, and that’s a responsibility you gotta prioritize too. Kids are freaking expensive man. Much love to you and the fam, and congrats on baby number 2.", "NTA\n\nIf i were the wife and i have support from family, i wouldn’t take out my husband’s opportunity to that work experience for free.", "YWBTA for all of the reasons already mentioned", "If your wife is on board you WNBTA. I know it goes against grain here, but sometimes doing what's best for your family isn't easy. Yes the trip has perks, but it also sounds like it's a really good experience for your career. You'd also be able to contact your wife too, and it's just two weeks.\nThis is speaking as someone who has been left home for months with a tiny baby while my husband is away for work, and we're planning on another baby soon, knowing full well that he'll have to be away for months again. I'm an independent person though and okay with it.", "NAH, if this is what your job requires and your wife has support.\n\nDifferent thought - could your wife potentially go with you? We travelled oversees with our baby when he was 4 months old and it was one of the easiest ages to travel with kids. They’re not mobile yet and just sleep a lot, so we were able to carry him in a carrier or bring him along in a stroller everywhere we went. It could be a neat little family trip if your wife is up for it.", "can you smellllllllllllll what the rock is cooking.......A DIVORCE ywbta", "YTA. Your wife will still be recovering from childbirth. She will need your help and support. You can't just do whatever you want anymore. You're a parent now and so you must put your child and wife first. Don't be so selfish.", "Going against the grain here but I  am going with NTA. I am a single mom by choice, had my son via c-section. I had my mom with me the first 2 weeks then did everything on my own. I know that is not OPs circumstances but just wanted to do a counterpoint to everyone talking about wife being incapable of doing it on her own for 2 weeks with help 10 minutes away. But wife will resent him leaving so he has to keep that in mind.", "YTA, it took me 3-4 months to have energy to do something other than looking after the baby.", "NTA. But. It's not a black and white situation. You never know how the baby turns out. They might sleep through the nights and consistently during the day, waking up only to feed and change. Or they may wake up 10 times during nights, and sleep very inconsistently during the day. They may only sleep while nursing. Or they may sleep all on their own. \nThey may develop a predictable routine that makes you both think it'll be fine if you go. And they may throw that routine out the window the very next day because of sleep regression, a developmental leap, or something else entirely. With a newborn, you never know what tomorrow brings. And let me be very clear on this. While you two have the most wonderful time ahead of you, it'll likely be the most difficult thing you've ever done- adjusting to the new life. If the adjustment comes with severe sleep deprivation, no new parent should be alone during this time. The toll it takes on your mental and physical stamina is something else. \n\nCongrats on becoming a father!\n\nSource: I have a 15month old daughter who is just now beginning to sleep properly.\n\nedit: Downvotes. Who did I offend and how?\n\n\nedit2: I figured the downvotes must be due to me voting NTA while demonstrating I understand the difficulties that come with a newborn. So it comes down to what sort of an arrangement they come up with, and how important is the trip. My goal was to provide OP with some context so that they can make an informed decision. If they have a sister or a brother, a mother or a father, a family member who could help out while OP is on a business trip- that might be an acceptable compromise. I was a SAHD for the first 6 months of my daughters life, we shared as much of the load as possible. After 6 months I slowly transitioned back to working full time.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHello, I (28M) work at a company that has headquarters based in Europe. \n\nMy team at work (6 people total) is being flown out to Europe for 2 weeks to coordinate and prepare a product launch with our colleagues there. While we are there, my team wants to do some sight-seeing, hiking, etc. I have no had the opportunity to experience another country before or travel to this extent.\n\n\nThe issue is that after our company announced this trip, we found out my wife(29F) is pregnant. We are very excited for this new adventure. The trip will be around the time our baby is 3 months old. My wife thinks that this is not a good time to go on this trip. It is possible for me to do this work remote, so it's not that I have to go to Europe. \n\n\nMy wife will not be working at this time so child care is not a concern. Our in laws both live within 10 minutes so we are also not without a support system in the 2 weeks. \n\n\nI am conflicted because on the one hand I would love this experience, but I also know it would be unfair to leave my wife to take care of the child for 2 weeks while I'm away having fun.\n\nReddit, WIBTA if I still went on this work trip?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Ash her.  Plan a spa day for her to be pampered while you watch the baby. If the answer is no and you have the ability to work remotely then stay home.  Put your, understandable, desire to see Paris aside and out your family first.  That is what being a loving husband and father should do.  Show her that she and the baby are more important than any site you could ever travel to.", "WBTA if you don't communicate with your wife what you want and what she wants then reach a compromise. I would say, as a SAHF of 3, that I would be okay if my wife had/wanted to leave for work for a week or 2. However in my circumstance my wife never has to leave for work so if it's a consistent thing that she's gone for work I would say leaving for 2 weeks with a 3 month old would probably be a no. It's all about communication make sure your wife knows that you are excited about the trip and that you really wanted to go and that you were also conflicted because you don't want to leave her you don't want to be away from your child. Communication is key in a relationship and lacking that communication intentionally or unintentionally causes us all to BTA.", "I promise you, nothing in Europe is worth the way you make your wife feel if you go. YTA", "I agree with this - judgement is only important from the wife. If I were the wife I personally would be cool with it but she’s not me and clearly isn’t and that’s what matters.", ">If I were your wife I would be really pissed off.\n\nSame. I would be pissed off and so incredibly resentful that he tossed aside his parenting duties within months of our child's birth.\n\n I would also feel completely betrayed - at three months, her body will still be recovering from childbirth. OP is the person she is supposed to be able to rely on to take care of her during this time, not friends or in-laws. If she has a c-section, she will literally be juuuust healing at that time if there are zero complications. She will also be dealing with things like bleeding, cracked nipples if she's breastfeeding, the frustration of struggling to figure out how to soothe a new baby while completely exhausted, and the hormone dump that is why the three months after birth are referred to as the fourth trimester. He is the one supposed to be there to hold her and share ~~of~~ in this struggle, not to ditch those responsibilities ~~as~~ at the first opportunity.\n\nIf my spouse abandoned me after childbirth with our newborn to go on an optional trip...I honestly don't think I'd still be there when he got back. Fuck that.\n\nEdit: typos", "No 3 month old sleeps through the night. Not a single one in the world. And people who say they do are the same ones whose babies were taking their first steps and saying their first words around that age too, lol. They might be getting a long stretch, but the parent usually is not.", "The entire team wouldn't be going to Europe if they could do it at home.", "Doing the work remotely is not the same. You can do the bare minimum remotely. For events like this, everyone will be collaborating and OP will miss that and miss out on networking opportunities which will benefit his whole family in the long run. OP's wife needs to learn teamwork", "OP said in their post that they could work from home", "Prolly means he thinks all child care is on his wife", "It’s not that deep calling a baby a baby doesn’t have hidden meaning", "This 👆🏽, does she get a 2 week vacation? If she wants it? Does she have a close friend or family member that could stay with her to help out? \nI think YWBTAH but if you’re wife is on board and she gets her 2 week break . Then it’s still doable", "This is the way.", "It's almost like he doesn't consider he is equally responsible for taking care of the baby.  He would probably refer to taking care of his child as babysitting.\n\nIn my opinion, you are telling your wife you consider her and a trip to Europe to be of equal importance.  Yikes, that would hurt.\n\nYWBTA", "This!!!! I agree with this comment 100%. You never know . Birth could be super easy or super hard. My first Birth i got very sick after giving birth, I couldnt move by myself and needed my husbands help to evem stand or sit, second baby, i was full of energy vacuuming 2 days out of the hospital it a baby strapped to my chest. Baby could be super easy or super hard. If its important for your career to be there in person you should have a conversation with your wife about it and try to compromise. If its not going to do anything for work, and you just want to experience Europe, maybe you should do it remotely to support your wife and child. I think you should also discuss with your boss the possibility of planning to go but making final decisions after your chold is born so you know more what your wife will be dealing with.", "Same. I am in the minority looking at all these answers, but as long as it’s not a colicky baby or a baby with medical conditions, 3 months is an easy age. Both of my children were easy babies so it would not have bothered me.", "I wonder if it's possible to do 1 week there and the rest from home   maybe skip the fun stuff?", "Women go back at 13 weeks because they have to. Maternity leave in some countries is atrocious. \n\nThe baby at that age will most likely be dealing with sleep regression. If you’re cool with dealing with that alone while your partner goes sightseeing then you’re a champ.", "Tell me you haven't been sole carer to an infant, without telling me you haven't. 2 weeks alone with a newborn is not a \"good time\". Having the in-laws stay, to pitch in for OP is just awkward for everyone.\n\nEurope will still be there in a few years time.", "What has the ability to return to work got to do with being the sole carer to the newborn, 24/7, for a fortnight while hubby goes on vacation? These are two completely separate considerations.\n\nAlso, speaking as someone who has actually had a child (pretty obvious you haven't), there are good reasons that midwives and dictors now talk about the \"fourth trimester\". The first few months post-partum are an extremely challenging time both physically and mentally for new mothers. The idea that most (if any) women are totally recovered after 6 weeks is utterly laughable. Any midwife will tell you that it takes on average about a *year* for a woman's body to recover from pregnancy and birth.", "Having to return to work at 6 weeks and being okay to are two very different things.  But at 3 months, I agree with you.", "She is very unlikely to want to travel with a 12 week old child and spend two weeks in a hotel without the comforts of home.", "He literally said he wants to go because it'll be fun and he wants the \"opportunity\" to travel.", ">while the rest of the team is bonding on a two week trip is not reasonable\n\nBonding with coworkers is far less important than bonding with a newborn.\n\n>many many people just do not have a choice\n\nBut OP *does* have a choice and has made it clear the work can be done remotely.", "It’s 2 weeks not 2 months. The dramatics are astounding in this thread. Let Reddit tell you women are helpless hormonal idiots incapable of doing anything.", "Mine did at 9 weeks. He literally slept for like 8-10 hours at a stretch. (Only my middle child, neither of my others.) Freaked me out when I’d wake up and realize he hadn’t woken me and I was terrified there was something wrong.\n\nI assure you now at 6yo I’m seeing the trade off for such a relatively easy baby, LOL\n\nBut yeah, he is absolutely a massive outlier. My third didn’t sleep consistently through the night until 15 months without waking up at least once. I was so tired I was crying by the end of it.\n\nThis isn’t the time for a TWO WEEK trip, OP. YWBTA.", "He said he can do it remotely though. So yes some of the team are needed but he doesn't need to be there.\n\nAlso I think the client will understand that he has a 3 month old", "lol networking. ppl are so work-obsessed. yes who cares about bonding with his baby when he could NeTwOrK.", "OP's wife is by necessity doing ALL of the reproductive labour associated with bringing a child into this family. She's the one dealing with 9 months of discomfort and disruption to carry it. She's the one who will undergo birth, which is no picnic no matter how it goes. Pretty sure she's got a concept of teamwork, sport.", "If you work for a company that doesn't understand that you may need/want to be home with a newborn then he should find a new job.", "OP will be Completely out of the loop Everything is happening face to face 5-8 time zones ahead.", "Thank you, somehow I missed that. My bad.", "If OP hasn't been passed over at work and still has a job. You know how customs asks if trip is business or pleasure?  This is Business", "Yes! I was 11 months postpartum before I even remotely began to feel like myself again. And there's no way for OP to know what complications his wife will have. Will she be recovering from a C-section? Postpartum depression? Postpartum anxiety?", "I gave birth to 2 children and have a bonus kid. One of them only slept for an hour at a time and it was a full year before he slept all night. 2 weeks of taking care of one 3 month old baby isn't that hard.", "The first few months *can be challenging. It’s not an absolute that they will be challenging. I’m a mother of 3 and I breezed through my postpartum time with all of them. \n\nI’m going with NAH. My husband had my blessing to go on a week long vacation to the DR with friends when we had 3 kids under 10 and I was a full time student. It was hard, but we made it work. \n\nIf OP can afford meal delivery service, a housekeeping service to pop in once or twice to clean the house and she has family help, she may be perfectly fine while he’s gone.", "I never said I agreed with it. Having to go back to work, wanting to go back to work, and being medically cleared for it are all different things.", "No kidding. And a 12 week old baby doesn't have an immune system yet, so bringing that young of a baby on a plane unnecessarily would be downright irresponsible.", "It's still work and a benefit to his career.   In the months following the trip, those who went will be a new cohort within the company and they will be looking out for each other while you will be stagnant.", "And what’s wrong with that? There’s nothing wrong with doing both, it’s still a part of work.", ">Bonding with coworkers is far less important than bonding with a newborn.\n\nHe will not be abandoning his child, he will be there for the first 3 months and for months afterwards.\n\nAnd doing the work remotely doesn't equate to having the same career experience.   He will be meeting others who may be useful in his future work.", "The team wouldn't be going to Europe if it could all be done remotely. OP will not even be In the Loop. They will be 5-6-7-8 hours ahead of OP and in face to face meetings.", "Then his team sucks at communication. Besides, he could adjust his hours to gain more synchronous working time while staying remote so he’s more available for meetings. His sleep schedule will be fucked anyway.", "I work daily with teams in Tokyo, Tel Aviv, Mumbai and Rio. It works fine.", "lol if his employer fires him bc he has a newborn then why the fuck would he want to be loyal to such a shit ass company in the first place", "Thank god the arbiter of being a mother has spoken", "I find it pretty astounding that as someone who has given birth twice, you minimise the recovery period so much. Maybe you were very lucky. In any event, what matters here isn't your opinion, but OP's wife's opinion. She doesn't want him to go, and that's perfectly fair.", "Yeah well leaving your wife home with a newborn isn't a benefit to anyone.", "Not many people are going to agree with you on this one. OP hasn't said that this is going to be some great thing for their career, they just want to go to Europe. If you think that's more important than being with your newborn, most people are going to disagree with that prioritization.", "OP literally says the work can be done remotely.", "This is a sub to give judgment based on opinions, but I don't need to tell you that. Everyone can give their opinion. Your opinion matters as much as mine. People come here looking for different perspectives. I gave mine.", ">OP hasn't said that this is going to be some great thing for their career, they just want to go to Europe.\n\nGiven the skewed demographics of AITA, I doubt that many commenters understand this kind of thing.  An international assignment is no just a travel benefit.   No one is selected just because they happen to be doing a job. They are being evaluated for future placements.   18 months from now when the others have been promoted or reassigned  to jobs with more promotional opportunities, the OP will still be in the same spot.", ">Given the skewed demographics of AITA,\n\nI'm literally 46 years old, have a 25 year software career, and think that placing more importance on a business trip than your own child demonstrates incredibly skewed priorities.\n\nI have never once, in my entire career, seen somebody passed up for promo because they didn't go on a business trip due to paternity leave/having a newborn. Perhaps your industry is different but you seem to have a very exaggerated sense of the importance of business travel. \n\nAnd your comparisons of OP's situation to the military were flat-out dishonest.", "Someone else on Team will have to carry the Load for OP. Have you ever seen anyone passed over that couldn't carry their share of the load? At what age of child will it be OK for OP to travel for business?", ">seen somebody passed up for promo because they didn't go on a business trip due to paternity leave/having a newborn. \n\nNo one would ever frame the outcome that way...they wouldn't be passed over because they declined to go, they would simply not be part of the momentum gathered from the trip.   And as I said, an international assignment is usually a big thing, much bigger than a random business trip.\n\n> And your comparisons of OP's situation to the military were flat-out dishonest.\n\nIn what way?   I was pointing out that many families deal with less than optimal situations.   The emphasis on 2 weeks for a 3-month old is extreme here.", "He said he can easily do the work virtually so this is false.", "I have two kids less than 2 years apart. I would have been fine for my husband to leave me at that time for a trip like that. \n\nYou would be the ass is your wife states she really doesn’t want you to go - and you go anyways. You would not be the ass for stating that you really want to go and kindly and appropriately stating things from your point of view.\n\nI would not be fine now days cause of the risk of bringing home COVID. But that doesn’t seem to the be the objection here.", "NTA. Two weeks is not a really long time.", "Nta, however be flexible for complications...most women however are well recovered at that point, albeit very tired. If she has help available then it should be fine.  Sweeten the deal?  You hire a housekeeper once  week those two weeks, help set up a meal service..and a massage or spa day right before you leave so she can get some pampering and feel rested before u go. So if house is clean, meals done and geandparents alternating so she can nap, etc then ahe will be fine...i say this because this may impact your career if everyone goes but you.  Your bosses may agree  to remote but may frown on it really. If bBy was a month old, maybe...but by 3 months you may be eyed different, barring complications.", "NAH. \nI can understand where she’s coming from, I was terrified when I had my first child. But it’s a few months in, which means routines will be established. \nBut this trip seems important on both a professional and personal level. I’d want my husband to go, especially with a support system in place. It will be challenging, so I would plan for it in a way where the support system is fully utilized, and your wife is onboard with it.", "NTA. This is a career move, and the opportunity of a lifetime. Working remotely will not be the same as being an active participant. \nJust because it is going to be exciting and fun does not mean it wouldn't directly affect your career in a positive way. You have almost a year to plan and organize family to come stay with your wife and new baby and 3 months after the birth to spend time supporting your wife and bonding with your child. It's 2 weeks, not months and months. \nIf this was a woman saying her career opportunity was in jeopardy because her husband refused to take two weeks off to stay with their newborn, they would have him tarred and feathered just like they are doing you right now. The hypocrisy is real.", "NTA if you were traveling strictly for sh*ts and giggles that'd be one thing, but work assignments are a horse of another color. As much as you want to be there please consider if it is worth the hit your career will take. People often forget you have to have the income to feed, clothe, and house your family", "When my daughter was 2.5 years old and my son was 3 months old, my husband (who is a lawyer) had the opportunity to do a trial (aiding much more experienced lawyer).  I was a SAHM. I said yes to him doing it. And I meant it.  It was a huge opportunity. He worked very late for an entire week before the trial (so no helping with kids) then was gone for two weeks. Home two days and gone another week. It was hard, very hard.  Baby was up 3 times a night then.  My in-laws lived literally around the corner and did not offer to help.  So I understand OP’s situation but your wife needs to be on board to do it. By the way, my husband was gone for another trial when baby was 9 months and daughter was 3 and it was so much easier.", "Info what does your wife think about this? My husband had to go away for a week when my first born was 3 months old and 2 weeks when my second was 3 months old and really the only opinion that matters is how your wife feels about this. Can your in laws and parents help? Is she supportive of you having a European experience? By 3 months your baby may be sleeping through the night (both mine were) and while it was tough it was still doable with some grandparent help\n\nEdit just saw in your post your wife isn’t thrilled about it. It’s your call but I can’t call you the AH because I don’t think it’s the end of the world if you do go and I don’t think your wife is wrong for not being stoked about it. NAH", "No you are not.  You are working to provide for your family and children are expensive.  Business trips are excellent way to climb the corporate ladder, make more money and be able to buy your wife an SUV with leather interior.  Kid puke is easier to clean with leather.", "YWNBTA. My kid’s dad traveled a lot for work during the baby’s first year. He cried about it more than the baby did.", "NTA. Go on the trip", "I think nta if u make sure someones with her for the 2 weeks then when u get back she gets equal time off if my husband was leaving me for 2 weeks id demand he fly my mom out to stay with me lol but yta if ur just gonna leave her come back tell her all about ur great work trip and then back to normal", "YWBTA\n\nOf course you’d love to go on a trip to Europe, who wouldn’t? I bet your wife would too. And you’re going to have a newborn, so no you cannot. \n\nYou even acknowledged you can do the work remotely. Parenting is about changing your life around the child, which - yes - affects vacationing options.\n\nEveryone is different, but often the first ~6 months are a rollercoaster and nightmare. The shock to the system from sleep changes, schedule changes, and responsibility changes… it’s A LOT. Not to mention that *pregnancy and giving birth and breastfeeding* (if she chooses that are A LOT A LOT. Your wife cannot do this alone even with nearby in-laws. I mean, she “can” - but not without irreparable harm to your relationship (imo). Sometimes in-laws are actually more stressful than helpful! \n\nI have a 4 month old, I speak from immediate experience (my own experience at least)… my husband is a full time stay at home dad, and some days he can *barely* make it to when I get home from work to relieve him for a few hours so he can shower and be a human for a minute.\n\nConsider this your first opportunity to learn parental sacrifice, because it’s the first of so so many. It’s okay to grieve the lost opportunities and freedom, but at the same time you have to choose your wife and kid unless you want to lose them.\n\nAs a tertiary detail, hopping around Europe and taking multiple long plane raids is NOT a great idea for your 3-month baby’s health… the obvious COVID aside, there’s all kinds of illnesses people pick up while traveling and can be devastating to a developing newborn without a well established immune system", "Your wife said no. It's not a good time. Stay home.\n\nYWBTA", "YTA OP, first for saying your wife won’t be working, anyone who has dealt with babies knows that a 9-5 is wayyyyy easier! \n\nAlso mentioning that both sets of parents are within 10 minutes- so?? Where will you be?? Oh that’s right on a “work “ trip…", "I’m going to say NTA.\n\nYou’ve got plenty of time to prepare and line up support.\n\nBeing the only one on a team that doesn’t go on a business trip could end up having career implications.\n\nMany families in the US have both parents back at work by the 3 month mark.  Not saying it’s right or doesn’t need to change, but having one parent at home 24/7 is better than many of us can afford.  If one parent has to go away for 2 weeks to help ensure that can continue, so be it.\n\nThis all changes if there are unforeseen problems, so prepare for that too.\n\n\nIt’s funny how many NTA mention their own experience as parents, and so few of the YTA’s do.  Expectations vs reality.", "Not everyone woman needs the same amount of support. I was happy for my hubby to leave for a few weeks when child no. 1 was a couple of weeks old.  But we talked about it and decided together.  Had I asked him not to go,  he wouldn't have.  After child no. 2 was born, I left hubby with the newborn and toddler and worked away for 5 weeks. It's different for every family.  I think,  at the moment,  it's NAH. IF your wife doesn't want you to go, THEN you fall into arsehole territory. Make the decision closer to the time based on your situation then.", "NAH. I think your wife would be alright if has support close by. You aren’t the first nor the last to be gone with a newborn (military deployment, business, illness, etc) \n\nBut it would be best to maybe shorten the trip and decide closer to the time if it’s right.", "Don’t do it. \n\nMy ex-husband did this, and I was cool with it at the time. I ended up struggling REALLY badly while he was gone - not just caring for the baby, but also the mindfuck of feeling fat and ugly and matronly while my ex was out partying overseas. It did a lot of damage to our relationship.", "NAH\n\nSome people here are bonkers! Calling op a bad father when the baby hasn't even been born yet! Jesus!\n\nOnto my judgment\n\nThere are no arseholes here at the moment, though that could change.\n\n1. If it will have long-term complications on OP's career path and may stand in the way of a promotion. The work may be able to be done from home, but not going could affect work relationship dynamics. If this is the case, then N T A, and OP's wife would be TA as it could be beneficial to their future. \n\n2. If it's just for fun and if fine to be done at home with no repercussions, then op should stay home since the first few months are important.\n\n*edit - a word", "I think I’m going against the grain here. I’ve had two kids and by 3 months I was totally healed, going about my normal life although obvs with a baby and then with a toddler and a baby. 2 weeks on my own would have been hard but not impossible. Esp with parents only 10 minutes away. My hubs worked full time anyway, except for his two weeks paternity, so, apart from doing bedtime routine and giving me a bit of a break, him being away for 2 weeks wouldn’t be a massive difference. By 3 months you’re in a routine and going to baby groups. \n\nI dunno. \n\nMaybe NTA", "I'll go against the crowd and say NTA, if this is a rare opportunity for you then I think it would be fair to go. Then when it's a time that suits perhaps you can treat your wife to a holiday away with her friends. \n\nAlso, if she has family support for the 2 weeks then I don't really see a big issue.\n\nThis is coming from a woman who has a 6 month old baby. I would have been sad if my husband was away for 2 weeks but if it was for an opportunity like this I would want to make it work for him.", "NAH. First of all, OP is considering whether to do this at this point. Secondly, there is probably an effect on OP’s career if they go, and a different effect if they don’t go. The coworkers who take this trip together will bond and develop relationships that OP will miss out on. If any of them are or become managers that could be the difference between getting a promotion and not down the road. A big part of success in business is befriending and socializing other people within the organization.\n\nOTOH 3 months is pretty young to be leaving for two weeks. When my daughter was 10 months old I went from being a SAHD to working full time. When I came home from my first day of work my daughter refused to look at me because she was (presumably) pissed that I had abandoned her for 10 hours with nobody but mom and grandma to keep her company. When I was a SAHD I think my wife went on a two night trip for work and while it was doable, it was a little difficult. It was probably around the 3mo mark actually. We lived in a foreign country so we had no support network around and not having a break for two days was rough. If OP is going to be gone she will need t friend or family member to either stay with or have stay with her to give her a break a couple times a day.\n\nOP and his wife need to sit down and take about all of the angles to this WRT OP’s career and going on the trip is a sacrifice they should be making.", "Personally I wouldn't have had a problem with it, I pretty much did all the care anyway including taking care of two teens (my nieces so not even my own) schlepping them around.\n\nBut your wife isn't confortable with that thought. You guys need to both be on board with you going and if you can't then I fear it's a no go.", "YWBTA dude it's not A baby it's YOUR baby", "Are you planning on giving her the opportunity to take two weeks off as soon as you get back while you provide 100% of everything your baby needs? And sending her on a trip she really wants to take? I know that's not the same as a work trip, but you won't have given birth, either, so it's a fair trade. If that doesn't sound completely reasonable to you, then it's also not reasonable for you to go, and YTA.", "Another thing to consider, if you work remotely, with the time differences and such an important project how much help would you actually be to your wife?", "Q", "NTA. Go! I stayed home with babies ( we have 6 children) often while my husband traveled for work. It was much more fun when he got to sightsee as well! All the stories and pictures! At first I had my mom to help me out. Then we had to move, but I made friends with a neighbor. \nI honestly know that being a new mom is difficult, but you'll be back.", "Around the time she gives birth and the months after are hard, and if the baby has colic for instance, you’re not gonna have a good time. Hard to say when it’s some time away. She might be scared, which I fully understand. \n\nMy baby was 4 months when we were alone for the first time, and that was for a whole week and it went great! You never know, but you have to listen to your partner. \n\nI can understand this job and launch and opportunity is important, but not more than your family. I suggest a backup plan. If it goes well after birth and your wife thinks it’s ok, then go. If not…don’t. Ask your company. \n\nYou might be TA.", "so she’s the default parent and your role is baby sitter from time to time…. Yes you would be the AH\n\nIf you really want to go on this trip would it be hard to assume that your wife would probably love to go on the same trip and have a break?", "YWBTA if you go when your wife already told you she didn’t want you to. Only her opinion matters, not random Redditors.", "YWBTA for all the reasons other people have given. In addition, here’s something that doesn’t seem to have occurred to you. YOU may not want to leave your new baby for 2 weeks. You may find you miss the baby terribly and that there is nothing going on in Europe that means more to you than being with your child. And if you say that you’ve taken business trips before and you missed your wife but it was fine and you were able to enjoy whatever there was to enjoy, I’m telling you that your new baby is a whole different thing.", "YWBTA. It’s concerning that your wife, the pregnant one, has already expressed her needs but you’re still here asking for opinions.", "Depends on your wife really, I have watched our newborn for some time while my husband does work travel and he has also watched the kids while I have work travel. Depends more on your own situation and what you and your partner are comfortable with.", "NAH. But I feel like you won’t want to be away from your new baby and wife for that long, so soon. Give yourself an out at 2 months pp. \nI remember thinking that going back to work 8 weeks pp would be a piece of cake, newborns are boring. But I really felt distracted from her.\nYour wife will be alright, grandparents will step in. You’ll all just miss each other a whole bunch.", "Situation,  no. Problem is that from the title, you read like an AH. This is not just A BABY, this is OUR BABY. You are distancing yourself psychologically, and already plan to distance yourself physically.\n\nGo to Europe, sure, and I am positive your wife would be fine. But really rethink the support you give now and up to that time. Hey, maybe find a way for wife and baby to go!", "Your wife said she isn’t ok with it - ywbta", "YWBTA. \n\nYou can work remotely. You don’t need to go hiking and sightseeing at this very moment. You need to be with your wife and newborn. You don’t know what complications could arise. She could require a C-section or have ppd. \n\nGoing on this trip I believe would be very damaging to your relationship with your wife.", "YTA - Europe will always be there, this isn’t a once in a lifetime opportunity but the birth of your first child, supporting your wife and being with them as a newborn is. You said in your post travel is not compulsory and you could still complete your work/be part of the team remotely. Your possible regrets (or Fomo) of not going to Europe can easily be fixed with a single plane ticket but the resentment your wife might harbour could be irreversible.", "NTA. I think with planning it can be done.  We all deserve to do these things you would be able to do if you go.  The chance to do them while being paid make me say do it.  As someone who carried, delivered, and cared for 2 children within 18 months do it!  We had no extra funds and for one of us to take a trip it would have been amazing.\nAs much as wife will want and need you home you( note I said you, not she) can arrange assistance for her with both sets of grands( in advance)and maybe schedule her a spa day too.  The grands will love being able to have the time with the little one.  \nJust do not expect her to want to hear about it all.  She will be stressed and you have to respect her moods/ feeling too.  Down the road she will want to hear about it.  Make sure you have everything taken care of and go, enjoy.", "YWBTA. Being a parent means giving up things for your child and family. This is something you are better to accept sooner rather than later.", "Ywbta. 3 months postpartum with my last baby, I was still full on sobbing several times a day from exhaustion - and that was with my husband working at home and able to help me out.", "Yes. You’d 100% be the asshole. I promise your wife ‘not working’ and therefore not needing childcare is not the cakewalk you think it will be. I also am positive that your wife would rather lean on you for support and learn how to function as a family of three with you rather than in laws.", "You already seem like an AH by trying to justify doing this to your wife.", "Can you wait for the baby to be born and see how it goes before deciding? Babies that sleep through the night are rare but it happens. It also depends how your wife will be.", "You would be the massive AH if you take off when your child is 3 months old, yes. MASSIVE. You’re a family. Your wife shouldn’t need to miss sleep and solo parent while you gallivant. Parenting is a cooperative effort. Your in laws and parents don’t need to take over your parts. You’re a married person of 28. I cannot believe you’re asking this. 😂\n\nDo your part remotely. Don’t create (very valid) resentment in your relationship because you want to travel. Jesus.", "My son is six months and not sleeping through the night yet what happens if their are medicos issues with baby and baby is needed to stay longer in hospital are you really that of an asshole you would leave your wife like that", "YWBTA. \n\nYou don’t have your wife’s blessing. If it was a 100% mandatory or once in a lifetime opportunity or would have potential for MAJOR career growth I might personally be inclined to say “I’ll manage.” However I am not her and if she is not okay with it absolutely 100% do not go. And don’t try to coerce her into a yes either. She will still resent you. Also, just because her parents live closed that doesn’t mean they’re available to play daddy for 2 weeks. \n\nAnd let’s be real, no one wants to sit at home after healing from the most physically demanding thing they will ever do in their life while constantly getting woken up by a newborn only to see that their spouse is having the time of their lives exploring somewhere that they might have always wanted to go themselves. There could also be complications that would make her situation even worse. Not to mention the stresses of being a first time parent. She’s probably very excited but also super anxious about being a parent, and not providing emotional and physical support will absolutely impact your relationship negatively. \n\nIf you work somewhere where they’re willing to send you on this trip now, odds are you have a fairly decent income where you can take the trip later with your wife and kid, or you’ll get another opportunity in the future. Europe will always be there, but if you fuck up with your wife, she will not be. \n\nI would also be careful about being a parent and  leaving a newborn that early. I know that it’s been proven that separation from the mother at a very young age can have long term psychological and developmental impacts, but you should look up how that impacts a baby. It could not only be upsetting to your wife, it could be causing long term damage to your child.", "Ywbta. Not a tough choice, family first. Theres always next time.", "YWBTA unless you get her someone to help her while your off on your work adventures. I mean like someone to cook, clean, watch the baby so she can shower, someone who could let her nap since they don’t at that age. I mean I guess you wouldn’t do that anyway maybe she get get a mister on the side.", "Yes, YWBTA. This is not the time to be taking superfluous trips and having travel adventures. You have no idea what your family's post-partum life will be like.  Maybe next year.", "YBITA. Having kids means making sacrifices. Congrats, you have just learned what your first major sacrifice will be.", "YWBTA, and I do hope this is to quiet the parts of you that want to go instead of trying to find an excuse to leave your wife. If you had to be there for the deal then came straight home, providing for your family is important. Having a tourist experience when your wife just had a very large growth removed, which screams and often needs wiped, is very much not important. Be a good dad, and the three of you can hopefully go to Europe later. Go to Europe now, be at risk of not being a dad anymore.", "You literally said you know it would be unfair. YWBTA 100%", "YWBTA because you would be leaving your wife to raise your newborn and firstborn alone...also who knows the complications (not speaking illness in took existence) she could have during and post pregnancy. This is bad timing. From the sound of your occupation you may make enough to plan a similar trip with your wife after the baby. How about like 9 months after to just reconnect after having a baby? Then you wouldn't be an AH but a loving caring father and husband.", "I’ve been to Europe. \n\nIt’s DEFINITELY not as fun as not having to dig yourself out of the mile-deep shit pit you will find yourself in it you ignore your wife’s request that you not take this vacay when she’s 3 months out from pushing screaming human life out of her vag.\n\nThis will be the most expensive trip to Europe you ever take. Don’t do it.", "My husband took a month off for paternity leave and honestly I was spiraling after he went back to work. My daughter is 11 mo now and I still count down the hours til he comes home. I would have absolutely resented the shit out of him if he got to go on a trip, even if just for work! I am already jealous he gets to have adult conversations with random people and leave the house on a regular basis! Seriously dude, stay home.", "YTA !!!!!!! Big time!", "NTA. It’s a work trip. Your wife has tons of support around her. She should be supporting you in this adventure.", "I have an ex husband like OP", "“She works from home so childcare is not an issue….”\n\nI am so angry on the wife’s behalf. What an AH. This sub really makes me hate men sometimes.", "🏅", "This is why most people should not have children.", "and this early stage is important for fathers. this is when the bonding starts.", "If I had an award it would go here.", "The only person whose opinion matters here is OPs wife. He's getting a paid once in a lifetime trip to Europe?? I'm a woman and with parents nearby, even with a newborn, I wouldn't ask my husband to pass that up.\n\nBut I'm not married to OP. He needs to ask his wife, and ask in a way that lets her know she can be truly honest. Then he needs to respect her decision.", "Lol my baby is almost 6 months and still isn’t sleeping through the night", "Clearly not a parent. No 3 month old child sleeps through the night. Literally none. \n\nComment sections like these really show up who is a parent and who isn't", "His wife his currently pregnant with their child - she has not had him/her yet - this trip is well into the future, so he has talking in future tense. He didn’t refer to the baby as his baby because it’s not his baby yet - it’s his fetus. Weird thing to get upset about.", "I’m pregnant, I call them “the babies”, so does my husband. They’re abstract at this point. I’m excited, but they’re still the babies. Heck, I refer to our dog as “the dog” most of the time. It means nothings.", "He says “our baby” where did your quote marks come from. And also if the in-laws and/or his parents need to live in the house for a couple weeks, it doesn’t seem like that bad a solution for two weeks, they only live a few minutes away", "Exactly.", "He’s such TA it’s unreal dude. Would be the end of that relationship imo!", "Lol it’s funny he thinks loving the experience fuckinf matters. His wife’s healing and comfort is what matters. What a sicko and TA", "This would actually be such an amazing way to do it. You two need to work together to come up with a solution. It needs to be addressed if she’s feeling anxiety right now. Maybe have a contingency plan? Yes, you’ll have a baby, and that baby journey is different for every parent, and even differs per baby. Figure out what would make her comfortable for you to not have to potentially sacrifice your career, as well as a goal that you and your team have been working for. I was left alone with babies who didn’t sleep more often than I can count, and honestly, I actually found it easier to be in total control alone. I also enjoyed traveling with babies, although I hear that’s not the norm lol. \n\nNAH. People literally do this all the time. They figure it out. Compromise is what relationships and parenting are all about.", "Seriously. She spends 9 months doing ALL the hard work and then HE gallops off to freaking Europe. The resentment in me towards him on her behalf is the size of Neptune.", "It's 2 weeks when the baby is approx 3 months old.", "It’s so mind boggling how men can just abandon women during their fragile periods and somehow think they will have a relationship when they return. I hope the wife leaves him if he does this.", "A weekend?  Why not two weeks?", "Congrats, no one cares that you feel like you don’t need help. Obviously HIS wife is bothered by it and he needs to take that into consideration. YTA op", "The trip is when the baby will be approx 3 months old and he states both their families are close by to help.", "Lose your family? Cause that’s what will happen.", "Poor baby.  Poor everyone else on those flights while the baby copes with the pain in its ears, and the dangers of travelling as a new baby during a pandemic that's still raging.", "Y i k e s. I'm glad he's your ex husband.", "Same", "It actually says she won’t be working.", "It says she won't be working.... not that she works from home.", "Same. I literally despise them after being here for awhile. The fucking AUDACTIY", "…or doesn’t.", "I align with you! I would not want my partner to give up that chance, nor would I want to feel like I had to give it up. People love differently I guess!", "I slept through the night my first night home, apparently. I also got a Best Napper award in kindergarten. My mom was always super thankful I was a good sleeper and I just wanted to share that!", "Yes, they do sometimes from 2 month old, but it doesn’t matter", "Mine did once right around 3 months. I had to wkw her up because my boobs were gonna explode.....Then she  never did  again until she was like 3 😂", "All 3 of my kids slept through the night since they were born. I prayed that they would get the sleep gene, and they did.\n\nI should have instead prayed for the easy teenager gene. Because I would gladly trade sleepless nights with an infant for the complex shit I have to deal with now.", "My mom and grandmother both say I slept through the night by three weeks old. Out of 19 grandchildren I am the only one to has done that without an extenuating cause. It's definitely not common and we should absolutely not tell parents to expect it, but  an 'easy' baby should be warned about. Those little fuckers will convince you to have another one sooner than you originally planned. Then the next thing you know you've got 3 under 3, and you're hiding in the bathroom to eat chocolate.", "My older two kids both slept through the night from the day they were born. It might not be super common, but it does happen. As far as my last baby, she was a NICU baby, so I have no idea.", "Mine did at six weeks.  Until she was a toddler then her sleeping went to hell and hasn’t been good since:/", "All 3 of mine did, and without crying it out, I know I was lucky but it does happen!  My 3 rd was sleeping 8 hours + at 2 weeks.", "Could you imagine waking up for the 6th time that night at 4am to a screaming infant who will not be consoled and you get a fucking text from your husband like “Here’s me holding up the tower of Pisa LOL so strong 💪 love you miss you!”", "I would also leave for this. There is NO way he’s trodding off to fuckinf Europe when my vagina is still healing and my exhaustion from birth isn’t gone. He needs to wise up now.", "Teamwork?!?! She is going to be suffering physically from doing ALL the work. Team work would be him fucking staying home and sharing the consequences and priorities of parenting. He’s TA 100%", "Boo hoo hoo", "I agree with the fact it can mean nothing. I have a toddler, we refer to her as “the child”. \n\n“What the hell is your child doing”\n\n“Are you going to pick up the child”.\n\n“The child needs changing”.\n\nSo you might still refer to them as “the babies” even after birth 😂 though we don’t call her “the child” to her face, then she is “precious bum”😂", "I refer to my 5 yo as \"the boy,\" \"your grandchild,\"and my personal favorite \"this child.\" So you will most definitely still say \"the babies. \" Hell at 32 yo my dad still say \"your child/daughter\" when talking to my mom.", "He isn't on holiday, it's a work trip. How dare he enjoy it, though!!", "Me too!", "Eh that doesn’t make his comments any better imo", "Fuck ye.\n\nComment as being edited. \n\nThis comment original said. \"I hate all men after being here for awhile\".", "FIFTEEN MONTHS?!?!?!?!?!\n\nI’ve never been so glad I met my stepkid when they were 10!\n\nETA OP, obviously you WBTA for all of the reasons everyone who reads this will point out!", "Your newborns went 6-8+ hours without feeding?", "Your doctor didn’t tell you to wake them up? I was told to wake my kids up (born almost 6 years apart) if they managed to sleep more than 2-3 hours at a time. I remember vividly trying to wake them and nurse while half asleep myself. It was awful", "Okay, so. I had an emergency c-section and hemorrhaged so badly I needed three blood transfusions. I was home from the hospital for three days (so my son was a week old) when I ended up back in the ER with a uterine infection and pulmonary embolism. I spent 12 days in the hospital.\n\nThose significant complications seriously delayed my recovery and my son was two months old before I could even pick him up without pain.\n\nIf OP’s wife has an experience even remotely similar to mine, she could very well not be okay to be left with a needy three month old for two weeks. He needs to plan to be around, otherwise he’ll be back here going “AITA for going on a work trip because it was already paid for even though my wife almost died having our child”.", "Ha! And what? The husbands have no responsibility when it comes to parenting? Woman do ALL of the heavy lifting until weeks after the baby is born and then they need to recover while their support does some of the heavy lifting.", "2 weeks solo parenting a 3 month old might as well be an eternity", "That's nice to say but IRL it's not always possible. Wife has both her parents and his close by. His career helps the whole family.", "That is a fair comment. BUT is that a strong enough reason to leave his wife taking care of his 3 month old for 2 weeks? \n\nAt the end of the day… when you look back 5 years from now, will the wife have built up resentment because she felt unsupported at a very crucial time in their lives, or will she be happy that her husband had a successful project? \n\nPersonally, I would have been very upset. 3 months after the birth of our first child I was a mess. The house was a mess. I was just starting to find my feet. I really needed my husband once he got home from work every day.", "I frequently call my four month old son “the baby”.", "Ya not really, I agree.", "Yes it does, because he is actually providing for their family. I don’t see people pissing off about soliders going oversea longer than two week, leaving their single wife taking care of their kids", "Just replying to the comment that I'm obviously not a mother.\n\nBut thank you for the snide remark.", "He’s not a soldier", "You don’t? There are plenty of people who don’t support that. Myself included.", "His work trip is optional and not at all comparable to a deployment.", "YTA. For most of that I was going to say not, it sounded like a necessary work trip and the sightseeing aspects weren't going to take away from time at home.\n\nThen you got to the bit where you said you could do it remotely. Which changes it entirely. You're no longer going for work, but just for the sightseeing.\n\nYou have NO IDEA what issues might arise in the first 3 months. Your wife could suffer from depression. Your child could be sick. Your child could be struggling to settle and your wife might be struggling with sleep. It's not the same or even close to the same as having your partner to have your parents or other relatives and friends helping. This is YOUR responsibility and you want to go on a holiday?", "YTA come ON.", "\"My wife will not be working at this time so child care is not a concern\" - this one rubbed me majorly the wrong way. You should WANT to be there to help her parent this child YOU helped create. Not because taking care of infants is fun but because you guys are a team.   \n\n\nNow is not the time to go on a european vacation (and the way you describe it, it IS a vacation. You can do the work from home). YWBTA, majorly. Parent your child. Your poor wife. She is not \"childcare\" she is the child's mother, and you are the child's father - STEP THE FUCK UP.", "Info what happens if you don't go on the trip? Will it leas to you getting fired?", "I think the best solution would be if it is possible to postpone the decision. \n\nMaybe the pregnancy and delivery is very easy. Maybe the baby starts sleeping through the night at 8 weeks and brestfeeding is easy. In that case, your wife might be happy to let you go on the trip.\n\nBut if something goes wrong, if her body is messed up, if the baby is fussy and you both are struggling with sleep deprivation, then it is unfair to leave her for so long in this situation.\n\nCan you book the trip and then cancel if needed?", "YTA.  \n\n\nOne thing is to also consider what might not go well.  Which is the birth.  Ideally, yes, it's a perfect, easy, no issues birth.  \n\n\nBut...it could be premature.  It could have problems.  She could have major Post Partum Depression.  She could die.  (That -is- a possibility with birth.)  \n\n\nPlan for the worst and pray for the best.  Don't be gone if you don't have to.", "If he goes when he gets back she should get to leave for 2 weeks let him stay home and take care of the baby.", "It’s a work trip. It will help you network and get promotions in the future. It is okay to be ambitious and sometimes you have to make difficult choices. Everyone wants to provide their child with a better and comfortable life. With the support system your wife has nearby, it’s okay for you to go. NAH.", "YTA Mr. Asshole, why would you even want to go? Do you imagine that sightseeing around Europe is somehow a more worthy life experience then meeting and bonding with a person you helped bring into this world? Not to mention supporting your partner who grew your child and pushed them out? This isn't about your wife, this is about you as a person and your values", "Even if she is feeling healed and good by this time, it’s still gonna suck for her to see you get to go off and have freedom while she’s stuck at home.", "YTA my ex fiancé used to do stuff like this to me which led me to start resenting him over time. It was always something special coming up and after a few friendly why nots from me it became a habit. When our baby was a newborn He felt he didn’t have to take his family bonding time just yet while I instead of staying home I was to be taking the other kids to school, practices, games and was constantly in and out of the car (baby hated carseat btw) and in the summer with a not so great vehicle while he drove the better working one cause he would have an hr drive away or whatever and I was just exhausted and angry all the time at him. \n\nLike he really couldn’t have just helped me and took his family bonding time and did all that extra stuff I was doing while healing from giving birth to our baby? Smh it’s almost as if that was his scapegoat on avoiding being a parent. Must be nice to be a dad lol.", "YTA, good job thinking about a support network and I understand it is a nice oppertunity. However, 3 months is way to early.", "Not the AH for asking your wife about it, but she has said she isn’t comfortable and considering you’ll have a 3 month old first kid by then, you listen. Going after she said she isn’t comfortable would make you an epic AH.", "YWBTA", "YTA- if you have to travel for work, that is fine, you should go for that portion. But the ‘fun time’ not so much. My husband and I both travel abroad for work, we have 2yo and 3yo kids. We focus our travel on the bit that is work focused, obviously that does include some fun staff, but we don’t take up the ‘stay for the weekend and enjoy yourself’ bit. And with such a young baby, my advice, even if you have an amazing support system, that little baby will grow so quickly, dont lose those days with your baby as you never get them back. You can go travelling a later time, but you will never get to experience that time with your newborn again", "NAH", "My job has a very high travel rate. I have a work trip at the 4 month mark. But my wife is ok with it. We are flying my mother in and she will be helping my wife the entire time.", "NAH", "“I also know it would be unfair to leave my wife to take care of the child for 2 weeks while I’m away having fun” you already answered your own question, yes, YWBTA.\n\n“We are also not without a support system in the 2 weeks” - by “we” of course, you mean your wife, since you yourself will be having fun in Europe and not in need to said support.\n\nSkip the trip dude.", "Women used to be able to look after babies for years on their own, so long as their husbands provided them with sufficient money to run the household. Have they lost that ability? I don't know, Perhaps you're an AH. I don't know. It really depends what your wife thinks I guess.", "NTA\n\nBeen there, done that as a new mom myself (years and years ago). It's hard, but I would never make my husband miss out on such an opportunity. I would just ask a relative or friend to standby if I needed help.", "NTA Go on the trip, your wife is not an invalid, she has family close by, the baby will be three months old, not necessarily newborn. There is absolutely nothing wrong with you going.", "Does she work from home or is she planning to stay home and care for the child? Because both of those are full time jobs and most WFH jobs expect you to have child care. If you’re leaving her at home to work AND take care of a newborn by herself then yeah YWBTA. This should be a discussion with her though. Communicate with your spouse and figure out if she’s still on board with this trip, and even if she is, know that it might change after actually having the child.", "NTA: I say this because my cousin just had a baby and he has 2 older boys( school age), he asked if he could come visit us for 2 weeks because he’s like to see Hawaii one last time since it’s way too expensive and problematic to travel from Germany to is. His wife said go have a good time! I’ll have my mom stay with me and we will also have a good “vacation “ here. It’s 2 weeks baby is 3 months old she has support system, hell military wives do it ALL THE TIME! Hell I did it for 10 yrs. Civilian wives are so spoiled sometimes it’s like they are soooo helpless.", "I do not agree with all the YTA judgements. Three months is plenty of time for both of you to get used to a routine with the baby. Your spouse dnes have a support systém nearby. It soundtrack like a great opportunity for you and I believe you should go, especially if it is likely something like this might not be possible in the future. Two weeks is not that long.", "NTA\n\npeople are bonkers\n\nunless you're planning to go nowhere in this company, you go on the work trip.  yes, you'll get a chance to do some sightseeing, but it's still a WORK trip.\n\nit's not ideal timing, true.  while a 3-month-old is challenging - if your wife has help while you're gone, it should be doable.", "NAH. She’s not wrong to not want you to go. But if it were me, I wouldn’t want my partner to miss that experience. 3 months is a reasonable amount of time to generally get the hang of taking care of a newborn, but it’s absolutely still challenging to do it by yourself.", "NAH\n\nMother of 3 speaking.\n\nThis sounds like a great opportunity for you. I would not want my husband to miss something like this.\n\nThe baby will be 3 months old at the time. Your family lives close. If everyone ist healthy, I think you should go.\nI would make sure a lot of help ist already pre-organized. Pre-cook healthy meals and store them in the freezer, ready to go. Have your family check on your wife regularly (Phone calls / visits). Maybe they can go for walk with the baby a few times so  your wife can rest. Or they come over and clean the kitchen / vacuum / do laundry.\nActually, at 3 months I always enjoyed going outside with my baby / kids. Handling them was never an issue. The household was the thing I needed help with. \n\nOf course, if there are complications during pregnancy / birth / post partum that require your presence and help at that time, you should blow the trip off. But you cannot plan those things ahead of time and surely everybody at work would understand if this would be the situation.\nAnd fortunately, most babys and moms feel good at 3 months post partum.", "INFO: How much of a support network does your wife have? How damaging to your career will it be if you don't go?", "I say go for it.  NTA. \n\nMy husband went back to sea for 5 months when our son was 4 weeks old.  I had my mil stay with me for 2 weeks when he first went away and that was more of a hindrance than a help. I had no local family once my mil went home and got on with life.  \n\nIf she has as good a support network as you say then go for it.  Not like it’s a pure pleasure trip but work based.", "I agree, if the wife thinks it’s to early then it is. Personally, now, as a second time mom I would be ok with this, especially with family close. As a first time mom I would have felt very uncomfortable being left alone that soon.", "Same here! I didn’t feel human until around 3+mo. and was finally able to up my showers from 1x/week to the occasional 2x/week.", "He didn't frame it well, but I would think making money for the family is taking care of responsibilities.\n\nThe only remote person at an off-site literally does not work.  They miss out even in the meetings they video call into because when a group of people are in a room, they dominate the conversation.", "He needs to go to parenting classes as well.  And all this assumes that the baby isn't special needs.", "Agreed except that \"helping your wife with your newborn child\"  is on a par with \"babysitting your newborn child\".  Ity's called parenting, and it's an equal responsibility in the 21st century.", "Or one of his relatives or friends.", "Yuck gross. Expecting your partner not to be a shitty person isn't spoiled or helpless maybe you just have really low expectations. OP isn't going to war he wants to go hiking. Why would you compare service to hiking? I bet many veterans would have chosen to be with their baby and wife if they could have. Why would you compare this loser to them?", "They will hopefully have so many chances to go to Europe and to go together. Europe isn’t going anywhere (at least I hope not!)\n\nAlso, OP, rather than just saying ‘Europe’ you can mention the specific country(ies) - we prefer that :)\n\nYWBTA", "100% this, so glad I’m not the only one! If the baby were due during the trip so there was a risk of him missing the birth it would be a different story… but I went back to work 3 months after my oldest was born, his wife should have settled into motherhood enough by then to give her husband a chance to have this amazing experience.", "Sidenote but surely if a trip to Europe is considered a \"once in a lifetime\" sort of thing OP should not waste that on a work trip? It should be something he works for and saves up for so he can take his wife and kid (once the kid is older). Who wants to waste such an important occasion on work? \n\nYou are right that his wife's opinion is the only one that matters, but if you read the post again you'll see that she has expressed her concerns and doesn't want him to go. \n\nOP, YWBTA if you went. Your wife has expressed her concerns, neither of you knows how you will actually be feeling when the kid is 3 months' old, and having in-laws 10 minutes away is no substitute for having her husband in the same house to share nighttime feedings, getting up when the kid cries and just general support including emotional for your wife (I'm presuming there will be a noticeable time zone difference so if you might not even be available for calls if she just needs to speak to you about feeling stressed). Plus just think about what this will say to your wife about your priorities, I can assure you she will remember it in years to come. No work trip is worth causing this sort of dissention in your marriage.", "My niece was sleeping 10 hours a night uninterrupted at less than a month old. It might not be the norm, but it is possible. My parents say that my siblings and I also slept through the night very quickly. One of my brothers slept through the night immediately after he was born, and the nurse would tell my mom to wake him up to feed him. My mom told her that she had given birth and raised 4 healthy and happy kids before him and she was gonna let him sleep because if he didn't wake up, he wasn't hungry. He's now 24 and healthy as a horse.", "I must have the miracle child then. Unfortunately I’m still waking up a couple times a night to pump for the sleepy guy.", "Glad he is free then", "Then they complain about the divorce later and only getting weekends", "BUT THE LOVELY HIKING!!! And his \"childcare\" is taken care of!", "Abusers often show their true colours when their partners are locked in - marriage, pregnancy, first child.  Let's hope this is not the case here.", "My first slept so badly it was torture, but he is the easiest, sweetest teenager. Maybe it's a trade off 😁", "Working a job. As if raising a newborn isn’t work.", "But she's just grown and given birth to an entire human being and is now in the fourth trimester.  He's just growing... his career?  Why should she not get two weeks off?", "My friends kid is 9 and has never once, not one  single night of her life, slept through the night.", "Lol mine is 16 months and wakes up about 4 times every single night. I hope one day to sleep again.", "My kid was a preemie and would have slept through the night if I had let him but I had to wake him every I think 3-4 hours. It was miserable.", "Ooh this gives me hope. I’m currently chronically sleep deprived with a 16 month old who needs me every two hours. I feel like I deserve a good teenager!", "Mine would have too! He actually slept better than my first baby, but because I had to wake him up every couple hours, I was even more exhausted because it required more effort to wake him up and convince him to eat lol", "There is hope!! \n\nNothing so far has been as tough as those first sleepless years. Good luck!", "Every single man on here taking vacations just before/after wife gives birth is TA. 😂😂there’s soooo many of you guys out there lol the type of father that will go fishing with his boys while their child is graduating high school 😂😂lame ass dude.", "YWBTA", "YTA\n\nIf she doesn’t get to go to enjoy Europe, why should you? Why should she have to stay home for 2 weeks by herself taking care of your child while you get to have fun abroad? \n\nYour excuse that she’s not working and the in laws are around are just you justifying getting to go. \n\nAlso, those few months postpartum are so exhausting and necessary for bonding. \n\nYou’ll get another chance sometime down the road to go to Europe. Maybe wait till baby is old enough to either be babysat or go with you and mom can go too.", "It entirely depends on your situation and how solid you can make childcare. \n\nWe had the same thing come up ourselves we worked it out and it was a good experience for everyone but we had solid support and good childcare in place for respite and emergency. \n\nIt's a no right or wrong answer but certainly not something that can be answered before baby even arrives. \n\nNAH", "YTA . Stay home with your family , your son and your wife needs you . It’s very hard to mind a newborn", "As said before, reddit's opinion doesn't matter, just the mother of the new baby. But OP is not the *only* person who can support the new mum. \n\nOP needs a serious conversation with his wife, and probably with the extended family, to see if the wider support network could be switched on for the two weeks. Can you arrange for MIL to come and stay overnight on set days during the fortnight? Are there other friends and relatives that new mum has a good relationship with who could also help? \n\nAll this, *as well as* some serious stepping up both before and after the trip to take on a good share of household requirements. And if new mum decides this isn't going to do it for her, then don't go on the trip. \n\nYou should only go with her agreement, so trying to make sure she'd be well supported in your absence is the only way you might get that. \n\n(That said, if I were the mum in this situation, I wouldn't want to prevent you from going. Being there physically would be better for OP's career than him only working remotely.)", "NTA - it’s a work trip that just happens to be somewhere you can do some sightseeing. Go take advantage of the situation it’s only 2 weeks. This seems like an opportunity that it would be a shame to miss out on.", "I’m a woman, had my first child by cesarean, went back to work FT when baby was 3 months and for the first 9 months my husband worked two jobs. That meant in addition to working FT I cleaned the house, did the laundry, made the meals and took care of the baby by myself. Oh btw I was also pregnant again by time my baby was 2 months. Do I think YTA for missing out on this opportunity, no I don’t think so, but I can understand your guilt. Perhaps you can compromise with her wife and take a week or two off work once you return to send her on a well deserved trip while you stay home to care for your child.", "YWBTA", "Two whole weeka? You would def be ta. Two days is fine, but two weeks?? Hell no.", "YTA", "Sounds like a sacrifice you will have to make for your family. Your job doesn’t rely on it and I’m she wants/needs you home at this time. You asked, she said no don’t be TA and stay home. I also wonder why you want to be away from your newborn child unless you had no other choice? Don’t you WANT to experience as much of that first fleeting year?", "NTA, work trip= not for fun", "YWBTA supporting your wife and 12 week old baby is what should matter", "It's a one off opportunity.\n\nBy three months the wife will be well and truly past post partum issues and if isn't this is unusual and in the nicest possible way, life goes on!\n\nIf she's a sahm, then it's not like he's asking her to go over and above what she will have been doing. By that point most babies are more settled, colic has passed/eased. If breastfeeding routines are established.\n\nFor most 3 months to 6 months is when things are the easiest! Settled in to routines. Know what's going on. No weaning yet. Baby is still not mobile. Perfect timing versus the early days when it's all new.\n\nAnd being honest, if she's not capable or willing to manage to parent the evenings/nights alone for two weeks, then that says more about her capabilities. And the fact that the husband has to even consider back up support is, imo, concerning. Because really, if she would not be capable of this, how would she be capable to parent alone in the day? \n\nNta.\n\nGo.\n\nEnjoy.\n\nMy only other consideration would be whether it's possible/appropriate for your wife and baby to be paid for by yourselves to accompany you?", "YWBTA OP. Take the remote working option while your wife heals. Be there for her. Projects come and go but this time of caring for your wife is more crucial.", "YWBTA. If only your wife could go sightseeing in Europe for 2 weeks, too bad she hasn’t had the opportunity to experience another country or travel to this extent /s. You know you would be TA. You CAN do the work remote. So why go on vacation when YOUR WIFE won’t be able to go on this do take care of YOUR CHILD.", "The title stated \" a 3 months old baby\". It should have been \"our 3 month old baby\". Quite the disconnect there. Ouch.", "NTA, i don’t understand how ppl can’t single parent for a little bit. Single parents do it all the time!  To be fair, she should be able to go on a vacation herself when she wants to and I know it’s different as in she literally cannot go on vacation soon but for goodness sake. Relationships shouldn’t be a tit for tat.  Just prepare everything beforehand, like stock up the kitchen, get all necessary baby supplies so she doesn’t have to run to the store in a hurry", "This post could only be made by a father to be, if the baby was here, he wouldn't even be asking this question. \n\nI'm a musician, and me and my wife both agreed it would be ok to agree to a few one off gigs a few months after the baby was born. I've never regretted anything more, and that was just going away for one night. Nothing can prepare you for what will happen in the first six months of having a child. Don't expect to be able to, or plan to do anything. You will regret it", "I wouldve been fine caring for our baby on my own for 2 weeks at 3 months old, because she was an easy baby and I was feeling great physically. \n\nBut you dont know that. Plan for the worst. I also couldve had major complications, PPD and a colicky baby. Just sit this one out and take the next trip.", "> He was vilified in the press for leaving his newborn and his wife. \n\nConsidering we know how the press feel about his wife that says something", "What about the experience of being a new dad?!", "Maybe the downvotes are because OP has done nothing to demonstrate that he is a father? He is planning to leave his newborn baby to sightsee around Europe. He may as well have been a sperm donor at this point- I mean if you are a sperm donor then yeah go to Europe no big.", "My family has a delightful family video of my mom kissing my two month old face goodbye so she could go on a business trip to Germany. My father and I lived through it. 3 months is a decent amount of time to adjust and recover. But if she’s going to be upset about it then that’s what matters.", "My baby was sleeping the whole night at 1 month. She'd wake up every so often but for the most part she was the easiest kid.\nI personally wouldn't have a problem letting hubby go on this possibly once in a lifetime trip. If your wife is okay with it then it's fine. If she says she doesn't want you to go then you probably shouldn't.", "My first slept through from 6 weeks, my second is 4 and still not sleeping through the night", "At 3 months, mine usually woke up once at night, sometimes twice, sometimes not at all. I lucked out with an easy baby. At 5, he’s still a good sleeper (other than the fact that he’s an early riser), but other than that, I would say I used all my luck on easy back in the newborn stage.", "Parent here. Mine did sometimes, and almost never woke up more than once at night.", "He literally said he can do it remotely.", "Maybe. I think situations like these depend a lot on what works for both parties. While business trips in my experience are indeed just business trips, I wouldn't hold it against someone if they made use of the opportunity to catch some local sights, especially if it's a first for the OP. Having said that, both the mother and the baby must be provided for during this time.", "If he can save up for it, it would be twice in a lifetime. If it’s for work, I’m assuming they’re paying for it. Giving it up isn’t going to get him anything, let alone more of a chance to go later.", "I had 2 unicorns that slept through the night at about 4 months. Both were excellent nappers--1 did nap or quiet time until 4. The almost 3 year old would still nap if he could, but then he'd be up until 9. At 5 and ~3, they both go to sleep at 7 and wake up at 6/630. I am calling it karmic repayment for my years of insomnia.", "Congrats on the award!", "Exactly. Did anyone notice that OP only referred to his baby as \"a 3 month old baby\" and \"the child\"? He never even identified the baby as HIS child. He's mentally and emotionally so far removed from fatherhood, he might as well already be in Europe. What an AH.", "If it was working for both parties OP wouldnt have posted in the first place. The baby is a 'first' for both OP and his wife. And OP will be a 'first' for his baby who knows nothing but mum and dad. This baby is a person to be loved not a plant to just be 'provided for'. Having to be away for work to put food on the table is one thing but wanting (!) to leave your newborn to see some old stuff in europe? I mean i can't imagine that is an indication that someone is going to be a good father.", "The baby will be 3 months not 3 days, and obviously he shouldn’t honor she’s sick", "It’s 2 weeks and it’s not like it’s a boys trip. Millions of people do it everyday.", "Millions of people donut every day", "You are now arguing in bad faith and picking on semantics. Where you think 'provider for' means having a roof and food, to me it means making sure the mother and the baby have everything they need for those 2 weeks, including help and support. I don't know what the main motivation for this trip is, it could be work, it could be 'seeing some old stuff'. I try to make as few assumptions as possible when passing judgement, so as to not introduce personal bias. And I'm well aware of what the baby and the mother need in the beginning, because I've lived it, I'm still living it."]}