{"id": 10930, "submission_id": "11c3a0n", "title": "AITA for telling my mom 'no' for a church thing?", "selftext": "I (32f) have dealt with my mom (61f) volunteering me and my things for most of my adult life. If someone reaches out to ask for something she says I can do it and then texts \"call me, it's not an emergency, but important.\" Most of the time I just give in and do it, but constantly remind her how much I detest being \"voluntold\" to do something. If the person needs something that I can help provide, they can reach out to me themselves.\n\nToday, I had two missed calls and a text \"call me, not an emergency, but very important.\" So, I called her back. She told me that the youth pastor was needing another easel for the service that the youth was putting on and she said that I had one that I could bring. She asked if I would be okay with that. I said 'no.'\n\nThis immediately ticked my mom off. 'It wouldn't hurt you to bring it.'\n\n'I am not dragging it all over the place.'\n\n'It would be a big help to me.'\n\n'It would be a big help to someone else that you could have told to text or call me about it. You don't have the right to volunteer my time and my things to other people.'\n\n'What about all of the things we do for you?' For this she was starting to list off a bill she is helping me pay, and the fact we went to dinner for my birthday, or lunches that we occasionally get. I helped remodel her house, I fix her computer all the time, I clean her house, I do yard work for her because my dad is unable to, I house sit when they are on vacation (which is a lot), that is just listing a few things that I do for them.\n\n'You don't get to try and guilt trip me. The answer is no.'\n\nThis youth pastor has access to multiple different routes to get an easel. She does production work with one of the schools as well as the community theater. All that would have a spare easel (used for show postings and such) that she could borrow for the day.\n\nI don't want my things damaged or loaned out to people to wait weeks or months to get back. If the youth pastor had texted me or called me, I might have been inclined to oblige and figure out how to get my easel (which is not a small or collapsible) to and from the church. However my mom simply said that I would be happy to take it without asking me beforehand. My sister said that I don't have to readily lend my things if I don't want to.\n\nAm I the asshole for putting my footdown?\n\nUPDATE: First of all I want to say thank you for all of the suggestions and kind words of encouragement. Got through church today and not one mention of the easel. They had gotten what they needed.\n\nThe youth pastor does have my phone number, but even she goes through my mom to ask if any member of my family is available to something, even when I'm literally standing right there. It is frustrating, but I'm definitely going to work on setting my foot down more.", "created_utc": 1677379349, "permalink": "/r/AmItheAsshole/comments/11c3a0n/aita_for_telling_my_mom_no_for_a_church_thing/", "score": 2404, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Saying no to something that would help out with a church event.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  Your mother won’t stop doing this until there are consequences for her.  She wants to be the hero that helped, which is why she doesn’t direct them to ask you.  Tell her that the answer for these relayed requests will always be no, but people are welcome to contact you directly, and stick to it.  But do expect a tantrum from her when you do that.", "NTA. Time (past time, actually) to set boundaries with her.", "NTA.  You need to draw a firm boundary.  Suggest you tell her going forward anything she voluntells you will be an automatic NO.", "NTA. It's a long time coming, imo, and it sounds like your mother has no problem inconveniencing you for the benefit of other people.", "Nta. \"No\" is a complete sentence. Keep setting boundaries and being consistent. I know it's hard when it's your own mother, but it's all the more reason to keep it up. Your time and property are not hers to offer.", "NTA.  your things are your things, not hers.  you are not here just to make her look helpful.\n\nremind her that \"no\" is a complete sentence.  she needs to learn to respect your boundaries and not just use you as other peoples' labor.", "NTA.  Your stuff isn't your mom's to hand out. You can always say no and mean it. Just tune out the yelling and eventually she will stop volunteering you.", "NTA and stay the course. You cannot change her, but you can change your reactions to her. She'll be pissed. She will pout. Don't give in. \n\nRemember that she knows how to push your buttons because she installed them. Good luck.", "NTA...I think we have the same mom!? Good for you!", ">You don't get to try and guilt trip me\n\nShe does as long as you keep allowing her actions to affect you that way.\n\nNTA. But please just stand up for yourself.  Make it clear to her you are not willing to loan anything that belongs to you or volunteer your time unless the person in need asks you directly. You can choose whether to say yes or no based on the request.\n\nAnd then once you've made that clear, stop having this conversation with her. You can't control how she feels, nor can you control her actions. You can only state your own \"rules\" and then act on them.", "You're doing great. This is exactly how to set boundaries. High five.\n\nNTA", "NTA & keep working on setting & holding those boundaries. Stop allowing her to voluntell you to do things. No is a complete sentence. You don’t need a reason.", "NTA. You should stand your ground here. They are your things and not hers to give away. She needs to respect your time and your property.", "NTA\n\nI think you've trained your mom to believe you'll always say \"yes\" whenever she volunteers you or your things for something.\n\nIt is time to re-educate her. You do not have to lend your things if she wants you to do so. You do not have to give your time if she volunteers that,\n\nThis will be difficult, but keep telling her \"no\". Keep telling her to have the pastor (or neighbor, or whoever) call you themselves if they need your stuff or your time so badly. You might even have to tell your mom that the answer will automatically be \"no\" if she has said you'd loan something out.", "NTA\n\nSTOP BEING A DOORMAT\n\nNO MEANS NO", "NTA. You are absolutely right to tell her no.", "NTA for finally standing up for yourself.  I know how hard that can be; this random internet stranger is proud of you.", "While your mother is used to you obliging, she is in no way entitled to your answer being a \"Yes.\" when she volunteers your time. \n\nFurthermore, shes a fully functioning 61 year old, not a senior that isn't mobile anymore. She can come pick up the easel herself if she's so fussed about it.\n\nThe fact she claims you somehow owe her for all the things she supposedly does for you makes it worse.\n\nNTA. \n\nYou're entitled to spend your time however you want.", "NTA. You’re a grown-ass adult and you do a lot for your mother anyway, which is nice. All of the sudden, you say no to a single request and this is so much to ask?! Hell no. Your mother is being WAY too petty about this. So she does a few nice things every now and then? That doesn’t mean you owe her your life :| \n\nOnce again: NTA", "NTA.  I went through a similar thing with my mom.  She used to volunteer me for events that I didn't know about and had no interest in.  It was a lot of family stuff with relatives I'm not close to.  I would just never show up.  I think all those people hate me now because I haven't been volunteered in 5 years haha", "NTA, the reason she doesn't tell them to call you is that your mom enjoys being the one who does the favors for people without having to actually do any of it and instead trying to force you to do it.  And then to guilt trip you after you've told her repeatedly to stop doing this is really manipulative, yuck.  Stick to your guns, and if you feel like bringing the issue to a head, call her out on the fact that she is clearly trying to reap the credit for doing favors for people and not doing any of the giving herself - how un-Christian of her!", "NTA. She's not entitled to your time or your things or your energy.", "Totally NTA and well done setting and sticking to boundaries! Keep it up!", "NTA to saying no for anything you don’t want to do. Adulthood has perks.", "NTA. If anything, you should have done so sooner. No one has the right to volunteer you, your time or your stuff.", "NTA. Your mom is way out of line with that BS. You should keep it up.", "NTA! It's your stuff, and it sounds like your mom has boundary issues", "YTA for letting it go this long.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (32f) have dealt with my mom (61f) volunteering me and my things for most of my adult life. If someone reaches out to ask for something she says I can do it and then texts \"call me, it's not an emergency, but important.\" Most of the time I just give in and do it, but constantly remind her how much I detest being \"voluntold\" to do something. If the person needs something that I can help provide, they can reach out to me themselves.\n\nToday, I had two missed calls and a text \"call me, not an emergency, but very important.\" So, I called her back. She told me that the youth pastor was needing another easel for the service that the youth was putting on and she said that I had one that I could bring. She asked if I would be okay with that. I said 'no.'\n\nThis immediately ticked my mom off. 'It wouldn't hurt you to bring it.'\n\n'I am not dragging it all over the place.'\n\n'It would be a big help to me.'\n\n'It would be a big help to someone else that you could have told to text or call me about it. You don't have the right to volunteer my time and my things to other people.'\n\n'What about all of the things we do for you?' For this she was starting to list off a bill she is helping me pay, and the fact we went to dinner for my birthday, or lunches that we occasionally get. I helped remodel her house, I fix her computer all the time, I clean her house, I do yard work for her because my dad is unable to, I house sit when they are on vacation (which is a lot), that is just listing a few things that I do for them.\n\n'You don't get to try and guilt trip me. The answer is no.'\n\nThis youth pastor has access to multiple different routes to get an easel. She does production work with one of the schools as well as the community theater. All that would have a spare easel (used for show postings and such) that she could borrow for the day.\n\nI don't want my things damaged or loaned out to people to wait weeks or months to get back. If the youth pastor had texted me or called me, I might have been inclined to oblige and figure out how to get my easel (which is not a small or collapsible) to and from the church. However my mom simply said that I would be happy to take it without asking me beforehand. My sister said that I don't have to readily lend my things if I don't want to.\n\nAm I the asshole for putting my footdown?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Your mother is out of her lane here,  offering your time and resources, but this behavior will continue as long as it continues to work for her. \n\nStand your ground.", "NTA. For future situations get the person's number who your mom is trying to loan out your time and services. Tell them to not listen to your mom and call you directly. Even if you're available sometimes you need to say no. 1-so they don't take advantage of you and 2- and more important...you need to learn to say no", "NTA.  My mother used to volunteer me all the time, I hated it.  It’s one of the reasons I live so far away now.", "NTA. She's making promises on your behalf.  You've set a boundry, and please stick to it.", "NTA. And I’d suggest you not even offer to have the other person call you. \n\nBe kind, but be persistent with your mom. Craft a response to the guilt tripping and stick with it — something like, “I’m grateful for all you & Dad have done for me. And I’m glad to help the two of you when you need me. But please stop volunteering me and my things to other people.” Then stop. If she goes on, repeat your same words. \n\nIt’ll be hard. But you’re doing the right thing for yourself in an unfortunate situation.", "I have let it go on longer than it probably needed to, but a lot of times it boils down to picking battles. She manipulates everyone, not just myself, into doing things for her. What I do (not the voluntold things) is a way to pay back for things she and my dad have helped me with. The fact that she tried to use that as a guilt trip - when I have more than paid them back - is what prompted this resounding no.", "I hate judgments like this. If you have lived a certain way your whole life, it takes time, emotional energy, and support to break free. Its not easy and it doesn't happen overnight.\n\nNot everyone has been blessed with capable, caring parents.", "NTA. You have to establish a boundary somewhere.", "NTA stay firm and stop all the help you are doing for them and stop accepting anything even gifts.", "NTA. Boundaries are a good thing, your mom clearly needs to know yours.", "NTA by a long shot. That's OP's boundary-blind mother.", "Nta\nLet your mother buy him one.", "NTA. Start saying no every. Time. You can let her know you'll be doing this, let anyone who brings it up know that any request that isn't directly to you is an automatic no, but hold firm. You're in your 30s. It is SO past time for people to be going through your parents to arrange things with you", "NTA. I thought this was my MIL for a second. Checked the age and realized you aren’t my SIL.\n\nPlease set boundaries. It will be the healthiest thing you do for yourself.", "NTA. For your own well being, please either quit answering her messages/texts about doing her favors like this, or keep saying no. \n\nYOU DESERVE YOUR OWN LIFE.", "NTA. “No” is a complete sentence. I would also tell her you weren’t aware her love was transactional and she was keeping score. Consider going low contact for awhile for your own peace.", "NTA.  You don’t even need to ask this question.  And what the heck does her doing anything for you have to do with her making herself look good by volunteering you?\nFeel free to point that out to her.  And why can’t she clean her own house? Quite frankly they appear to be taking advantage of you.  You need to set limits on what and when you are available.", "NTA. Your mom is showing you how little respect she has for you with this pattern and her response. You need boundaries, but be forewarned that she’s only going to get meaner until she understands that you’re not backing down.", "NTA\nYou are a grown up, you get to decide how to spend your time and how to distribute your items. Keep saying no. Stop responding to calls like this. Your mother is using you to make herself look good, you don't have to comply.", "NTA my mom used to do this it got so bad i stopped going to church. It took awhile for her to understand because her mom did it too. But after awhile we got passed it and I started going back to church and she stopped volunteering me.", "NTA perhaps she can learn to respect your time", "It’s for a church honey. Next!!", "NTA It is your stuff and you mom isn't going to pay you if it gets damaged. (Or if she does it will be added to the list of stuff she does for you as if it wasn't her fault to begin with.)\n\nIt's time to stop giving in to any voluntolding. No matter how small. No matter if you might have agreed to it if you were asked. Giving in sometimes ensures that the cycle of being voluntold will never stop. Also, stop calling her back when you get those texts. Just text her that if she volunteered you or your stuff again, the answer is no. She's making you call her so she has more time to convince you (I _am_ guessing you would not just hang up on her). But there is no need for that when your answer is always no.\n\nBe proactive. Decide how you want to be asked for favors from now on. I imagine you don't want everyone having you phone number so you need to train your mother to text you first to ask for the favor. Let her know your preferred method and stick to the no answer unless she uses it.\n\nAnd if these phone calls are the primary times when you and your mom talk, be sure to call her on your own and make plans too spend time with her. You're not trying to cut off contact with her, just the voluntolding.", "NTA. I’m a firm believer of you teach other people how they should treat you. Pay close attention to how they react when you set boundaries. Your mom clearly cares more about what other people think of her or how things will benefit her. Good on ya for finally putting your foot down.", "NTA. Your mom is also putting other folks like the youth pastor in a tough spot. It’s always uncomfortable when someone volunteers another person to do a task, in the youth pastor’s case it would be impolite to ask your mom if she’s sure you’ll bring the easel, and they have no direct contact with the person doing the favor.", "Plus this will help \"train\" other people to not expect OP's mom to speak for OP.", "NTA\n\nThe reason she keeps doing this is because she knows you'll cave. Maybe finally growing a spine and telling her no will have an effect. Only time will tell.", "You stood up for yourself. Nothing wrong with that.\nJust hope your mom backs off.", "NTA. And I can’t believe when parents try to guilt their children into thinking they owe them anything and everything in exchange for having raised them. And this wasn’t even a favor for her, it was for someone else. You’re NTA but your mom is.", "NTA. Keep holding those boundaries!", "No not at all an Asshole. This same thing happened to me, until I moved far, far away.", "NTA and stop complying. You are teaching her how go exploit you by continuing to be available. You say no consistently to her voluntolding and she should get the message and stop.", "Why do you treat yourself so badly? \n\nSaying that you object to her volunteering you but you do it to keep the peace has just trained her that you think it's okay.\n\nMy wife used to do this to friends and family. If they needed a hand with something, she used to say \"NAME will do that for you\". The fuck I will. I did it a few times to 'keep the peace' but it was severely pissing me off that my time was being volunteered for things I didn't know how to do or simply didn't want to do. The only reason it stopped was because we had a chat about it and I told her that I would no longer do the things she volunteered me for. If she did so in future, she would have to explain why I wasn't going to do it.\n\nYou are NTA but you need to put your foot down with your mum, stop being a walkover and don't let her guilt trip you about 'buying you a meal' once in a while. In fact, it might be a good idea to stop allowing her and your dad to buy anything for you at all. She will have nothing to barter with", "NTA\n\nAnd I would like to suggest that you look up stuff about narcissistic parents and see if anything resonates.  She sees you and your belongings as an extension of herself and is overreacting when you say no.\n\nSomeone with reasonable boundaries would respect you and your autonomy and *ask* you nicely *before* confirming anything to the pastor.  And respect your clearly stated 'no'.\n\nAlso please pay attention to this bit.\n\n>>'What about all of the things we do for you?' \n\n>For this she was starting to list off a bill she is helping me pay, **and the fact we went to dinner for my birthday**, or lunches that we occasionally get. \n\nYour birthday dinner should be a celebration, and it's revealing that she thinks of it as an *obligation* to hold over your head at a later date. :(", "Absolutely NTA. I hate these kinds of people. Birthday dinner, lunches, things of that sort are gifts - Same with helping to pay bills unless different terms are previously specified. My grandma and mom would try and do this, and when I told her no (I was much younger at 16), I told her the same thing. My life, my time and my things are mine, not for her to use at her discretion with the snap of her fingers. There was a lot of tension for awhile because I refused to help with anything until they stopped voluntolding me. Eventually, it worked. Now, if they need help with something, they ask and if I say no, we either work something that works for the both of us, or they find another option. Best of luck, these people can be exhausting and it'll likely continue if you don't (continue) to put your foot down.", "NTA", "NTA you do plenty to help it sounds like. Mom needs to learn some boundaries.", "NTA. Doesn't matter who it's for, you do not have to do anything you don't want to. If you have the contact details for the person your mom said you'd help just call or message them yourself, say your sorry but your mom lied, you're unable to help because you're too busy/what she promised isn't feasible/ you weren't informed before she volunteered you and your things and you aren't able to commit to someone elses promise. Then if you really want to be petty you can take it further and say \"don't worry though, I'm sure mom would love to pay for (whatever she promised you'd do in this case a brand new easel for the youth group) just for you.\"", "NTA. Someone needs to learn to ask that person first before saying \"X can do this\".", "NTA", "NTA. Stop calling her back when you get a message like that 🤷🏻‍♀️", "Mate your 32. Tell your ma to do one she's TA here not you", "Absolutely NTA. You have made your point, now stuck to it \n\nYou've got your mother's script, so begin to work out answers and rebuffs of points she brings up repeatedly. The \"after all we've done for you\" line is insidious and hard to beat. But with the easel for instance, you might remind her that the youth minister, or whoever, hasn't done much for you. And tell her that you don't live in tit-for-tat relationships anyway.", "NTA\n\n\" However my mom simply said that I would be happy to take it without asking me beforehand. \"\n\nBetter be ready to protect and lock up your stuff, as well as potentially taking legal action if necessary.\nShe literally just admitted to what she plans to do.", "NTA. And holding your own birthday dinner against you is manipulative, toxic behavior. I would take a step back from the relationship for a while.", "NTA. Glad I moved away from parents when I was young. Far away. Many states. \n\nAdvice; stop answering her calls.", "NTA. But she's got used to the fact that you always say yes, despite telling her not to do this - so why would she stop?\n\nYou need to train her out of it - say no even when you *could* help, every time she goes this route of voluntelling you. Only say yes if/when a) she or someone else genuinely *asks*, without the assumption step that is currently happening, *and* b) you actually want to help.", "NTA.\n\nYou're clearly a good, generous and compassionate person. You're not obliged to be, but you are.\n\nSaying \"no\" one time doesn't change that.\n\nSaying \"no\" as often as you need to doesn't change that. \n\nSaying \"no\" as often as you *want* to doesn't change that, either! \n\nYou have boundaries, and you get to judge when and whether helping other people is appropriate for you in any given set of circumstances. \n\nYour mom is trying to help, and means well, but needs to understand that she can't assume that you will be ok with her ideas.", "NTA", "NTA\n\nMy mum did this to me. \n\nI started saying no. \n\nShe complains that it makes her lose face. \n\nI told her my time is not hers to offer.\n\nRinse and repeat. \n\nMake her lose face enough times and she'll start asking.", "NTA. She’s going to try manipulating you when you say no, because she’s not used to hearing it and won’t like it that you’re escaping her control. Don’t let her win! You don’t have to do what she wants. Consistently say no, and she’ll stop asking you in order to save face with the people she keeps letting down. Stay strong, and good luck!", "NTA. You allowed it to go on far too long and its best You figure out a way to pay that bill on your own, there’s no need in having someone throw what they do for you in your face every bumpy road.", "Definitely NTA, but your mother is!", "NTA. \n\nThe people who scream the loudest about you setting a boundary are the ones who have benefited by you having none.", "NTA. But at the same time, she continues to do these things because she can. She can because you always comply. Simply put, your decisions to not maintain boundaries has trained her that this is acceptable and is your role in the relationship to the point where she doesn't even recognize there is an issue. Set boundaries and don't reward her for inconsiderate behavior.  You aren't her property, your possessions aren't her property, and it isnt your responsibility to make her look good for other people at your expense.   Patiently persevere... it takes a long time to reverse these things.", "Yta she's helping you out but you can't help her out.", "Boundaries are super important in this situation.", "I’ve saved this – “She knows how to push your buttons because she installed them” is SO powerful. Thanks for this!", "Wow. I never thought if it that way.  But you are dead on target.\nI've had a lifetime of boundary issues, shame & guilt were my automatic responses for almost literally everything. \nI figured all that out and have been working on it, but the way you said \"she knows because she installed them\".\nIt clicked.\n\nThank you for that.", "Like OP doesn't help at all right. /s", "Found the mother.", "I help the people in my life for free, because I care about them.  They don't need to pay me back.  Your parents, as, well, your parents, should be _at least_ as kind to you as I am to _literal goddess-damn strangers sometimes_.", "Haha, most amusing", "You stood up to her stealth control of your life. Good for you!", "NTA. From now on, even if it’s a small request, DECLINE. Eventually she will start to be too embarrassed from having to pull out of deals she made to ask. Or people will catch on and quit asking her. But no more voluntold gigs no matter how small or easy", "If people want your help they can contact you directly. Definitely NTA. Mom wants the perks of helping without doing the actual work.", "You need to set some boundaries with your mom. She makes you the bad guy if you don’t “volunteer “.", "NTA OP.  My father actually told my boss that I would be willing to come in for an extra shift when he knew damn well I was doing other things that day.  I worked the shift, but I was furious with him for volunteering me.", "don't engage your mother in this matter at all anymore just say you're done doing any volunteering that she chooses for you. And if the guilt tripping continues stop doing things for her also. nta", "NTA. Your mother wants to be thought of as the reliable one, always able to help. Sadly, she is volunteering you and not doing the work herself. As others have said,  No! is a complete sentence. \nSure, she will use guilt, shame and whatever other tactic she can to push back on your boundaries,  but stay true to yourself and keep saying no. It gets easier the more you say it", "NTA you should of put your foot down years ago.", "NTA, you're 31, no one \"voluntells\" you. If your mom wants your help to make her look good with the pastor she can ask you like an adult.", "NTA. You have the patience of a saint in all honestly. My mum is fairly similar and I think I was 12 or 13 when I went ballistic at her for trying to do the same to me. 32 is well past time. Well done for standing up for yourself. Next time she sends you such a text, rather than call her back, just send her a simple text \"no\".", "NTA.  Putting your foot down is the only chance you have of putting an end to this nonsense short of moving too far away to make your mom’s behavior practical for her to continue.", "NTA-your moon is manipulating you. It’s not healthy. Boundaries are good. Painful at first but good.", "NTA \n\nIf you don't push back, there is no chance that she will stop.", "NTA and tell the youth pastor your mom lied. \n\nShe seems to think you're an extension of herself and therefore volunteers you, your stuff and your time over and over again.", "NTA", "NTA.  I'd be tempted to get in touch with anyone she does voluntell your services to, and tell them personally that you are unavailable for that, as she didn't ask you before offering to confirm your availability, and that if she offers your services in future, please assume it's been done without your permission.  \n\nThat should get round pretty quickly, ensuring people know what she's doing.", "NTA", "NTA you had to start enforcing boundaries at some point.  At 32 you were well overdue.  Don’t feel bad, hopefully your mum will now stop this nonsense.", "NTA! My mom she was always offering my work to my aunts when I was growing up. You need a babysitter “don’t worry my kid will be there!” Oh, you need a cake/ pie/ dessert for a party “don’t worry my kid will bake”. She saw me as an extension of her and not as a separate person.", "NTA.  You should tell your mom you won't respond to future requests from her.", "NTA. And the term \"voluntold\" is absolute gold!", "NTA and I’m totally stealing “voluntold”", "NTA. Boundaries are basic. It's time to start enforcing yours.", "Not at all. You said no. I would never volunteer my brown kids for anything. You all have your own lives.", "Nta and you're nicer than me.  Nobody volunteers me for something like that.  Or anything for that matter.  My life, my choices.\nYou are the same way.  Put ur foot down and stick to it", "Pushing back is definitely the right way to go here, because the consequences for the mother is then that she is the one who people will see as the liar, or unreliable, or not delivering on \"her\" promises. And her only defence then is having to explain to these people that she hadn't actually asked OP first and is making promises without consulting OP. Either way, it becomes her reputation on the line.", "Agree 100%. Just to add that OP should remind Mom that family life isn't transactional. \"I had lunch with you, therefore you owe me your time to volunteer you for...\" isn't the way things work. If she thinks they do, it may be time to cut those off to deprive her of ammunition.", "NTA I agree with what you said but the only thing I'd do differently is tell her to tell others... I'll see what I can do... then ask you.  This way random people aren't bothering him and it saves him the hassle of saying no or being guilted by others.\n\nAlso.  LOVE the term \"Voluntold\". I'm going to add that to my vocabulary.", "Nah, have dealt with that, the consequence is that she will make you the villain. You'll either have to rectify the story every single time or move far away.\n\nI would still do it because in the long run, people need to see that she's a problem, for her to learn that she's a problem.\n\nIt's really a shitty situation", "I think you need to reread. OP *wants* people to directly ask her if they want her help. OP doesn’t want mom acting as a middleman all the time.  I suspect she also doesn’t want her mom constantly pressuring her to do favors for others, which would continue with your suggestion.", "NTA. Your mom likes the feeling of being the \"hero\" when people need help. But she needs to stop volunteering other people. She can help if it's that important.", "nope she is for asking.", "NTA. My mother does this all the time to my father and me -- she is happy to volunteer our time or expertise if it makes her feel like a helpful person, but it's exhausting for us.", "Your mom is one of those \"does none of the work, but wants all the credit\" type of people.\n\nYou should begin every conversation, phone call, and text message with \"No, I won't do whatever it is\" until she learns to respect your time, your effort, and your basic worth as a person.\n\nNTA.", "\"No....I don't have to explain why.  The answer is no.\"\n\nNTA", "NTA\n\nYou have no obligation to help out anybody, especially not help that you were volunteered for without your knowledge or consent. \n\nOn a side note this brought to mind a post I once read here about the OP's mother taking food from *their* house to donate to charity.", "The only way you will put a stop to your mother's behaviour is by saying no.\n\nMum, in future when you offer out my property and services I will say no.\n\nThen say no.\n\nIf your mother then brings up what you did for your birthday tell her you refuse to make your relationship with her transactional. No is a complete sentence.\n\nNTA.", "NTA\nNo. Your mom is being inconsiderate. My guess is she is trying to Ingratiate herself with everyone at your expense. Does she also volunteer your sister's time and things? Or does she just pick on you? Good luck. The longer you tell her no the sooner she will stop.", "NTA\n\nYou need to answering these kind of calls with \"No\" and if she starts complaining, reply with \"No is a complete sentence\" and hang up.", "NTA", "NTA\n\nThat's an example of not helping her out, but making her look good/helpful.\n\nTotally different and yeah, zero obligation imo.", "It was a long time coming. Probably too long, but we only worry about things we can change here.\n\nGood for you. NTA.", "NTA but it's high time you learn to set and enforce some boundaries, aka 'say no to mommy'. You're 32, not 12.", "No your not but it's time you put up boundaries with your parents on volunteering your time for someone else's projects", "NTA and the fact that she put having dinner on your bday on the list of favors she did for you is really sad. Maybe stop doing so much for her, so she has a chance to notice and properly acknowledge your value.", "NTA", "NTA Your mom seems not to value what you do for her at all. If she pulls that crap again (what she does for you) I'd ask if she wants a bill sent to her for what you do.", "NTA.", "Not the AH. It's long past time you put your foot down. It may take time for your mother to accept your boundaries but stay firm.", "NTA. Your mom is TA.", "NTA- if you don't put your foot down, she'll never stop doing this.", "nta", "OP's Mom is the \"GO-TO\" Gal to get anything done.  Just call on OP's Mom!  She's amazing!  Always willing to help, donate, etc.  What a GREAT PERSON SHE IS!!!!!  Start the parade NOW.", "NTA Get the contact the pastor.  Find out what is needed and then say yes or no and why.  Also, inform them if they need something or help call you directly not your mom.  Tell mom the next time she does this, she can do it herself.", "Time to set boundaries. Draw them out, be consistent, and stick to them. You're going to get a LOT of push because of it, be prepared.\n\nNTA", "The whole repeat scenarios sounds infuriating! Poor op NTA", "Ah, yes, the “broken record” technique. I’ve used it myself multiple times. It works.", "Did you miss all the things OP does to help out her mom?", "Mom will talk about it bad daughter and how she does so much for the daughter and all she is asking is for this one thing….  It won’t blow back on her.", "She's not entitled to your time or your things or your energy.", "Exactly. Especially since OP is posting here, seemingly checking whether putting her foot down this way was okay. It’s unfortunate that someone recognizing a toxic dynamic and trying to change it is being discouraged for not doing it earlier.", "Likely OP will NOT be asked to do these things.  Mom is jumping up and volunteering her every time.  No one needs to ask Mom, she will just volunteer her daughter when there is a need.  I've met several of these types of people.   AAF!", "Church heros. My folks did this plus more to my brother and now he's NC for 10 years.", "NTA – your mom seems to think that she has the privilege of access to you and your things. What I mean by that is that your mom thinks she is entitled to have control over your life and your things.  She thinks this because she helps you out from time to time. \n\nThe idea of privilege to access to people is why certain employers think they are entitled to workers to work at minimum wage or less than a living wage. It is why certain parents think they are entitled to access to their adult children or grandchildren.  It is why certain parents think they have a right to inject their opinions about how you are raising your children, and they even believe that they are entitled to have that opinion, validated, and followed.  It is also why certain people believe they are entitled to sexual partners.  \n\nIf you convince the world that you are entitled to access to other people, then you do not have to comply with the standard rules of economics that dictate all human interaction, which require that you offer something of value in exchange for the value you seek.\n\nFor example, an employer must pay a living wage if they want to hire employees.  Similarly, if you want to be attractive to the opposite sex, you need to work to make yourself attractive to the opposite tact, rather than simply bitching about not being able to find somebody.  Parents of adult children need to realize that simply bringing a child into the world does not entitle you to their time, things, and attention.", "NTA\n\nThat’s a boundary that needs to be (re)set and you are setting it. Good for you!", "NTA", "NTA.  Your sister is right.  Your mother expects you to obey her every demand.  Keep telling her no.  Stand firm on your boundaries.  Do not give anymore of your time and stop lending things to strangers because she offered them.  Go low contact and learn to gray rock.\n\nPay the bill back as soon as possible.  Pay 50/50 when going out to lunch.  If birthday dinner wasn't a gift, she should have said something. Stop cleaning her house.  Stop housesitting.  Do the yardwork only if you want to.  Perhaps tellt that she hire someone to help with the yard.", "NTA. Your mother acts really rude towards you.", "My mom would do this to me all the time. Especially when she knew I was at work. And that is why I no longer speak with her.", "NTA- she wants social cred but doesn't want to actually do the work needed to get it, so she volunteers you. That isn't good.", "NTA.\nAnd I’m happy to see your sibling supporting you in your decision. Tell her she’s a good ‘un. ❤️", "NTA. It’s perfectly okay to have boundaries with family.", "NTA. My dear,  you should have put your foot down years ago. Keep putting your foot down now!!!", "Nta you need to tell her from here on out you won't be voluntold to do anything.", "NTA. I would inform your mom that your answer will be no each & every time she volunteers your time or belongings. You've laid out your terms of being asked by the person in need directly, so she cannot be part of the equation any longer. And if anyone asks you about this just tell them the truth. \"My mother oftens does this without remembering to ask me first. Perhaps she needs to see a doctor.\"", "NTA at all, this is ridiculous on your mother’s part", "Your mom sounds exhausting. Can't believe it's taken you this long to draw a firm line. NTA", "NTA", "NTA. My grandma was horrible about doing this same thing to our whole family. Mainly to her church which none of us attend. Mostly our time but sometimes things. My aunt finally contacted the pastor of the church and explained that unless we ourselves volunteered it wasn't going to happen. Then I took my turn and Grandma got signed up for every pancake and chili feed around town. It got the message through loud and clear.", "NTA\n\nMy mother lent my good easel (heavy duty, meant for art) to a friend of hers to display a poster at a one night event.  It was 8 years before I got it back.  This was just one of many times she's done something like this.  I've had to put my foot down in recent years as she also started doing it to my husband and child.  It's part of why our relationship is now quite strained.", "NTA. First. Remove yourself from these religious nut jobs. Two, stop being your mothers maid. You have a life of your own, go live it.", "NTA", "They're a church. If they need an easel they can ask their god for one.", "NTA.  It’s good you finally stood up to her. It would have continued as long as you allowed it. You don’t owe her anything. You have the right to not loan out your stuff. Hopefully, she will get the message this time and not make you have to go through this again.", "You're the asshole because you could've been more transparent with your mom also the way you talked to her is kinda mean. TBH. Peace", ">I think you've trained your mom to believe you'll always say \"yes\" whenever she volunteers you or your things for something.\n\nWay to victim blame asshole.", "Knew there would be at least one salty mommy when I read this.", "It's a powerful sentence", "Turn it around on her. The next time she offers to buy you lunch say “thanks but no thanks, you’ll just hold that against me the next time you volunteer me to do something.” Keep a scorecard: every time you clean her house is 4 times she can’t volunteer you to do something, same with yard work and computer repair. The next text message just text back “No”. Don’t even call her because you know what’s coming. \n\nText her the definition of “manipulate”.", "Lol I have no children. I'm married. So I'm not a mommy yet. I just am close to my parents.", "Yes, that is what the OP said, but I'm not sure she's thinking it through. Personally I would much rather tell a family member  than someone outside the family. We have to take the OP's word for it that putting the outside person in touch with OP would be fine. But the poster above you is correct, the proper and polite thing to do is to not commit or comment at all before checking with OP. Then no uncomfortable conversation needs to occur. In other words \"hey OP, at the service today the pastor was asking about borrowing a spare easel, I think you've got one, if it's convenient for you to bring it you might want to give him a call.\".", "i read it but I think a better option if he doesn't want to interact is to have mom get back to them before committing.", "When I was in grade school I apparently liked to volunteer my mom to be a chaperone on field trips. But I left that behavior behind many decades ago. Now I only volunteer myself.", "Your mom takes credit for the things she makes you do. Her image is more important than your time and property. NTA", "NTA. This is called establishing a boundary. Boundaries are not only needed, but necessary for healthy and productive relationships, including family.", "NTA If someone voluntells me the answer is always no.", "NTA.  I say this as a mom who used to volunteer my kids for church things.  Which was fine when they were younger but now that they are getting older, they have a right to say what they want to do with their time.  \n\nYour mom is probably a bit of a people pleaser and feels the need to fill in a gap, any gap.  Once she realizes that she doesn't need to be the one to say yes all the time, she will feel so much freedom in saying no or just not speaking up to begin with.  Source:me  \n\nAlso, my kids happily volunteer with me now teaching Sunday school.  We do it together and I have a fun class/age of kids and my middle may even decide to do something in life with that age group b/c she also likes the ages and is loving what she is doing.  However, SHE DECIDED and asked if she could come help.  And she can not do it any time she wants.  \n\nDon't back down on this.  Give your mom some tough love and let her know it's ok to not help all the time.  It gets exhausting.", "NTA. But you should've put a stop to this years ago, she sounds like she has no boundaries or respect for you whatsoever.", "NTA but how are you 32 and still having trouble setting boundaries? Your mom doesn’t have a right to volunteer you for things. You’ve given in to her for 32 years? “No” is a complete sentence.", "NTA\n\nWell done for telling your Mom where to get off.\n\nLive your life.", "NTA. I would have put my foot down a long time ago. Also, I thought I was the only one who uses the phrase \"voluntold\". I am voluntold at work all the time. Lol", "NTA", "This isn’t tit for tat. All the things she has done for you was supposed to be bcuz she wants to not for leverage or exchange. NTA.", "NTA  OP's mother wants to get the credit for OP's efforts.  OP should be able to determine her own life, preferences, what's done with her possessions, etc.  Telling mom no now is the start.  OP will need to be consistent with no when she doesn't want to be voluntold.  OP might consider scaling back on the amount of time she spends with her mother and how involved in her life her mother is.  Her mother is treating her as unpaid help/a slave.", "NTA. If she truly believes all things are possible with god, what does she need you for?", " But you’re doing the right thing for yourself in an unfortunate situation.", "It's time to set boundaries with your parents about volunteering your time for someone else's project", "NTA. Just stop. Every time, tell your mom, \"Oh, have them call and ask me!\" Then YOU can decide what to do. If your mom promises something and you don't do it, you can tell the person, \"Oh, you should have asked me yourself. My mom doesn't know my schedule, so never take her word for it.\" Lather, rinse, repeat.", "NTA - your sister sounds like she's been there done that with your mom and is over it. Your mom is getting praise and seen as accommodating and she doesn't have to do anything except volunteer her daughter's time and personal belongings. Don't fall for the guilt trips. They will never end, but they are not your burden.", "NTA.  On your next birthday when she invites you out for dinner, get her to sign a written release that it is not a \"transaction\" and the dinner is offered free of all encumbrances or stay home.", "NTA. It would be no every time. She doesn’t respect your boundaries. And she has no real respect for you. She thinks because she birthed you she owes you something and that’s just not the case. You are more than her child. You are a human being deserving of respect.", "NTA. \n\nYour mother needs to stop volunteering you for stuff. And when she tries to start saying what she does for you, then you can start saying what you do for her and your father.  \n\nI hate it when people do that.", "I HATE it when people make plans for my time...or my things.\n\nNTA", "NTA More importantly than your stuff is your time. Draw that line now, and don't spend your time and energy doing things that don't benefit you or give you joy.", "> I detest being \"voluntold\" to do something.\n\nSame here. She wants to look good without being the one to actually do the work. NTA.", "NTA. You teach people how to treat you. If they can’t figure out how to respect the boundaries you define, then there is some deeper pathology.", "NTA", "Absolutely NTA. With a person like this you need to make specific deals. I'll help you with your computer and you pay my ___ bill. I'll help clean your place and you can buy me lunch. This is the only way to deal with someone who uses you in this way but who you do care about and don't want to disconnect from. \n\nAnd yes, she needs to tell the pastor to call you personally. By just volunteering you, she involves the pastor in her power trip. If the pastor asked and you didn't want to loan your easel you could have helped her connect with someone who would. \n\nAny time she wants to \"volunteer\" you, she must give your contact info to the person and have _them_ call so _you_ can decide. Tell her you will no longer accept assistance/lending requests unless you talk to the person first.", "NTA. \n\nAnd stop giving in some of the time, that just encourages her to keep doing this. Say NO, never again and stick with it! After HER promises of your help blow up in HER face enough times she will stop doing this. \n\nWhen she calls next time, say no, hang up, block her for 24 hours. No argument, no listening to her list of what she does for you, just hang up!", "NTA And stick to this boundary!", "No should be your new favorite response..NTA", "Hey, good point, I didn't even think of this.", "THIS is so important. Training people to not see mommy as your speaker anymore. I'm almost 40 and my immediate family is just now starting to comprehend this. It took missing holidays for 3 years, missing 2 weddings, a couple funerals before they learned to just communicate with me and my husband instead of playing telephone with my mom.", "I fixed this issue with my mom by getting about 2 inches from her nose and screaming to \"STOP FUCKING VOLUNTEERING ME FOR SHIT\", which was followed by a 10 minute tirade of how she never once asked me to do anything, and only told, and that if it didn't stop, our relationship stopped.", "Yep. Admittedly, I only thought of this because of seeing other posts on Reddit about people being volunteered for things and thinking to myself that I would never NOT talk to someone to get their approval or okay for something. I would think it very odd if an adult's parent told me they would do something or volunteer for something; I would think \"no, let me talk with the adult first\" and not rely on mom or dad to give the \"okay\".", "NTA", "NTA, like my parents, always told me , you don't do charity with other people's money. (nor time, things etc) she could always ask you, but you're always within your rights to say no. I would personally not let her do those things anymore, just because you know they come with strings attached, even if they are as small as a lunch. When she questions it, be forward and explain exactly that , and that if she wants to be generous, she should volunteer her own time and things. Its no sacrifice to appear as mother Teresa when someone else is doing the work.", "NTA  - your mother needs to treat you like an autonomous adult and show some respect for you as a person - there are these little things called boundaries -she should learn about them.", "Try giving her a taste of her own medicine. Find a friend and talk this over with him. Then get him on board with helping you. Call your mom and  voluntell her that you're friend doesn't know how to make fried chicken. You told him that she would do it. Then wait three, maybe four days, and do it again with another meal. Then do it again, and say that he really has a hard time getting his dishes clean, and you told him that she would do them. After she experiences that a few times, she'll get the picture.", "My mom kept making me go to church classes and volunteering me for stuff meanwhile I was going to college and worked 40 hours a week. I have to be an asshole and just keep saying no over and over again until she stopped bothering me about it.", "NTA and you should have done it years ago. If you had, it wouldn’t be still happening. But even so, still NTA.", "NTA for setting boundaries with your mother.  She has taken advantage of you for so long she will naturally kick back, but stick to your guns and insist she ask you before volunteering you for anything- or your answer will be no on principle.\nYou have zero obligation to say yes to anything, church related or not, that you don’t want to.\nGood for you for finally standing up to her. That took guts!", "I think you should make this firm boundary. Otherwise she may try to convince you that THIS time it’s not a big deal. \n\nIt will be hard to tell her no and deal with the consequences (her freak out). Remember, you’re an adult, you don’t live with her, and you can walk away. I had to go to therapy to learn to set boundaries with my mom (who I later realized had BPD) but it made my life so much better.", "The problem is that her mother volunteers her without asking OP. That’s disrespectful.", "I informed mine that the next time she volunteered me for something I just wouldn't show up for it, by that point having realized that my mom was one of those for whom death was preferable to public embarrassment", "NTA and it’s telling that the first thing your mom does when you say no is try to guilt you and lost off things she’s done for you as if they are all transactions to be repaid rather than done out of the goodness of her heart. She has no right to volunteer your time of your give away your possessions. A petty reverend would be to start volunteering her for stuff or telling people they could have her stuff. But maybe that’s just too much, your response was good already.", "Boundaries were already set, they just need to be enforced.", "When people call OP for things she’s been voluntold, all she has to do is sigh and say, “I don’t know why my mother always does this.  She tells everyone I can do things or lend things without checking with me first.  I’m sorry, I (or the thing she promised) am/is not available.  The next time she promises you something, you’re welcome to ask, but don’t take her word about whether it’s possible.”", "That’s why mom’s volunteering OP needs to start failing.  If mom volunteers OP and OP never shows, mom feels (and looks) like an over-eager fool.", "We really should trust OP, because OP knows herself (and her mother) and we don’t.  With the way OP’s mother turned this request into whinging about how she does all these things for OP, so OP should do this for her, it seems very likely that OP’s mom will do that same highly annoying pattern every time she is met with a no.  It’s a lot easier to be unavailable to people who accept a polite “sorry, not available” without making a fight out of it.", "She didn’t say she doesn’t want to interact.  She said the opposite - she wants direct contact from the favor-asker.  And OP is female.", "NTA.\n\nGood for you, OP!\n\nIf you're able, start voluntelling your mother for things and see how she likes it.", "NTA tell ur mom to do it since she's cares so fucking much about other people over her child.", "Or the mom can get her own darn easel to lend out.", "My English teacher use to volunchoose people basically just force someone to do stuff If No one participated", "Even better."]}