{"id": 10964, "submission_id": "11chdx7", "title": "AITA for being mad and telling my sister and mom it wasn't fair she got to go to a concert?", "selftext": "So, my (F25) parents are on a 10 day vacation and they asked me to come to their home to look after the house and the dogs. This is usual and has been happening ever since I'm 18. My sister (F21) lives with them at the moment.\n\nI've been talking about this with my therapist - they seem to think I'm the responsible one and they don't trust my sister with anything, and she lives her life as if she were still a teenager. When I told my mom it wasn't fair that I had to look after the house while my sister did nothing and was already living there, she told me I was right and that she would ask my sister \"to help\". I don't think I need to explain that \"help\" shouldn't be the word - I think we both should take equal responsibility.\n\nOne of the dogs is diabetic. He needs to be injected with insulin two times a day, around 9am and 9pm. My sister has never injected him - she doesn't even want to try. So the responsibility is mine - however, it's almost imposible to do this task alone because he always moves and barks and growls. The injection doesn't hurt him, he's always been kind of a grumpy dog. So we always need someone to hold him while the other injects him (and keeps the needle in for at least 10 seconds, which is the hard part). \n\nFirst few days, my sister was nowhere to be seen during the morning and I did my best alone. Later I started calling her or waking her up (she sleeps until 11am most days) and asking her to help me. Thing is, I've been planning my life this last 10 days around this task - I know I need to be home 9am and 9pm every day to do this. She hasn't - she goes to her boyfriend's, a friend's, and if I don't ask her she doesn't really seem to care.\n\nWhat would happen if I acted like her? - like, I had my boyfriends's birthday, and I went late because I had to wait until 9pm - what if I had left, like she has done several times, and left her to inject the dog by her own? I won't do this, of course, because I love the dog and I don't want to harm him in any way. But this isn't fair, isn't it?\n\nSo, yesterday, my sister wanted to go to a concert out of town. I told her she could go, but only if she was home by 9pm to help me. She didn't know if she was going to make it and didn't decide to go until the very same day at the last minute. I was talking with a friend when she texted me \"hey I'm going to the concert, mom says it's fine, I'll be back at 10pm and mom told me it's okay if we wait an hour to inyect him (the dog)\". I was busy and I trusted her. So she went.\n\nShe wasn't home until 1am. She says there was a lot of traffic. I had to ask a friend to hold my dog while I injected him the insulin, and it was OK, but thing is I shouldn't have. My sister should have been here. It's only 10 days she needs to be more responsible and not party/go to concerts.\n\nI've just texted my mom \"next time, I'll schedule a concert the very same day you go on vacation and leave my sister alone to care for the house, sounds OK?\".", "created_utc": 1677418744, "permalink": "/r/AmItheAsshole/comments/11chdx7/aita_for_being_mad_and_telling_my_sister_and_mom/", "score": 254, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole for send that text to my mom when I was angry - and I will probably say something similar to my sister when she wakes up. My mom wasn't responsible for this, per se, but she told my sister she could go, she gave her \"permission\" (even though both my sister and I are both 20+ years old).\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nNext time, just say no. You're 25. Your parents don't seem to get that you're an adult who is helping them because you're a good person who makes kind choices. What would they do if you weren't there?", "NTA. Your parents could also board the dog or hire someone to come over if your sister can't / won't handle it.", "I dont get why you keep helping them but NTA", "INFO if you’re 25 and don’t live with them why are you doing any of this?", "NTA.\n\nYour parents are never giving your sister a chance to grow up or I even think they are not giving her any house chores even though she is staying at home. This way she will never learn any responsibility. And just because you are the responsible one, it is not okay for your parents to take you for granted and leave your sister out of any duties. Next time just say NO and see what will happen. I bet that they will still blame you, that because of you they had to cancel their plans!!!! And even I hate the work 'help' when it is definitely not help and it is her part of chore.", "NTA. Don’t help them next time. You’re busy.", "NTA\n\nSay no next time and let them sort it out. Especially if the injection is a 2-person job. Your sister needs a wake-up call to grow up, and it sounds like your parents are enabling her big time.", "ESH. You know the situation. You know it’s all on you. Tell them you can’t house sit anymore or stop expecting any help from your sister. Your parents should start budgeting dog boarding into their vacation", "NTA-  you are 25 and need to let your family know that yes you don’t mind helping, but your sister can help to.  You can’t put your life on pause because your sister won’t take responsibility.  But also I think it’s acceptable for you to make your own plans and force your parents and sister to adapt.", "Listen, the answer should be no. Your sister LIVES there, yet YOU have to go out of your way to take care of their dog.", "ESH. Yes, your sister sounds very self-centered. But, also, no one made you agree to help. Like, this post reads like you had no choice but to help out, and you definitely could have told you parents \"no\".", "NTA, but this is one of those \"no one can take advantage of you without your consent\" moments. \n\nWhen your parents ask you to look after the house and dog, tell them you will not be available.", "NTA, but you have to accept some blame here. Why are you agreeing to come stay when your sister still lives there? Time to draw some boundaries, and this is one. \n\nYou will always get the scut jobs, because you say yes.", "ESH- not sure why you “have” to go do this unless you’re still somehow hooked to your parents financially or something.  Also - your sister is an adult and doesn’t need your permission to go to a concert.  You don’t control her.  If you don’t want to deal with this shit then don’t. Nobody can make you. Set boundaries and stick to them. No need to be snarky to anyone about it either.  Quit putting yourself in this situation.", "Nta - your parents can pay to have the dogs boarded and they can give the diabetic dog the insulin injections. Enabling the enabling is what's happening and you just end up frustrated.", "Nta. You shouldn't be sharing the responsibility because none of it is your responsibility.", "NTA.  It should be your sister's responsibility to do such tasks because she lives there.\n\nNext time, don't even agree to coming to their house. They will either have to sire a sitter or your sister will have to stop being an AH", "NTA. You keep letting your parents stick you with doing the necessary stuff while your “golden child” sister gets to shuck all responsibility. Next time they call tell them to hire a petsitter. Perhaps if they actually have to pay $$ they will wake up to how lousy their parenting of you verses your sister has been.", "nta and holy shit your sister needs to learn to be an adult or shes gonna have major problems later in life.", "NTA. Give your parents notice that you will not be picking up the slack for your sister ever again.", "Your parents need to hold your sister accountable and make her do this or pay 2 people to come in and do it.  They should also acknowledge its a 2 person job. \n\nBut you also have to find your backbone here. Start saying no clearly. Not that passive aggressive stuff. Just be upfront: it’s a 2 person job and sister isn’t reliable. You must pay someone to come do it. \n\nNTA\n\nFix your autocorrect please\n\n“injections” not “inyections” \n\n“inject” not “inyect”", "I mean you are definitely NTA and it’s unfair as all heck. The thing is you kinda have to choose what you feel is more important the dogs health or making your point. Would your parents be willing to hire a dog sitter?", "You don't even live in the house!\n\nYour parents need to pay for the dog's care next time they go away. NTA.", "NTA. It sucks because if you said see ya later she probably wouldn’t give the dog his insulin and you’d feel so guilty (because you seem like a nice caring person who’s an animal lover, not because you’d have a reason to be guilty)", "NTA but you have to stop agreeing to look after their house and dogs if you want anything to change. As long as you’re doing what you’re doing now, there’s no incentive for your parents or sister to change the situation!", "NTA\n\n&#x200B;\n\nThis is easy: either agree to do it, or refuse. Your sister has NOTHING to do with that. \n\n&#x200B;\n\n\". It's only 10 days she needs to be more responsible and not party/go to concerts.\" .. **You are WRONG. You agreed to do the dogsitting, your sister did NOT. So your problem does not concern her, this is between you and your parents.**\n\n&#x200B;\n\n**This is a YOU problem. If you do not want to do it, learn to say NO.** But IF you agree, YOU need to do it. YOUR responsibility, not your sisters. She does NOT have to help you with the thing YOU agreed to do. Your sister is much better at managing her life than you are - stop harassing her about that.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, my (F25) parents are on a 10 day vacation and they asked me to come to their home to look after the house and the dogs. This is usual and has been happening ever since I'm 18. My sister (F21) lives with them at the moment.\n\nI've been talking about this with my therapist - they seem to think I'm the responsible one and they don't trust my sister with anything, and she lives her life as if she were still a teenager. When I told my mom it wasn't fair that I had to look after the house while my sister did nothing and was already living there, she told me I was right and that she would ask her sister \"to help\". I don't think I need to explain that \"help\" shouldn't be the word - I think we both should take equal responsibility.\n\nOne of the dogs is diabetic. He needs to be inyected with insulin two times a day, around 9am and 9pm. My sister has never inyected him - she doesn't even want to try. So the responsibility is mine - however, it's almost imposible to do this task alone because he always moves and barks and growls. The injection doesn't hurt him, he's always been kind of a grumpy dog. So we always need someone to hold him while the other inyects him (and keeps the needle in for at least 10 seconds, which is the hard part). \n\nFirst few days, my sister was nowhere to be seen during the morning and I did my best alone. Later I started calling her or waking her up (she sleeps until 11am most days) and asking her to help me. Thing is, I've been planning my life this last 10 days around this task - I know I need to be home 9am and 9pm every day to do this. She hasn't - she goes to her boyfriend's, a friend's, and if I don't ask her she doesn't really seem to care.\n\nWhat would happen if I acted like her? - like, I had my boyfriends's birthday, and I went late because I had to wait until 9pm - what if I had left, like she has done several times, and left her to inyect the dog by her own? I won't do this, of course, because I love the dog and I don't want to harm him in any way. But this isn't fair, isn't it?\n\nSo, yesterday, my sister wanted to go to a concert out of town. I told her she could go, but only if she was home by 9pm to help me. She didn't know if she was going to make it and didn't decide to go until the very same day at the last minute. I was talking with a friend when she texted me \"hey I'm going to the concert, mom says it's fine, I'll be back at 10pm and mom told me it's okay if we wait an hour to inyect him (the dog)\". I was busy and I trusted her. So she went.\n\nShe wasn't home until 1am. She says there was a lot of traffic. I had to ask a friend to hold my dog while I inyected him, and it was OK, but thing is I shouldn't have. My sister should have been here. It's only 10 days she needs to be more responsible and not party/go to concerts.\n\nI've just texted my mom \"next time, I'll schedule a concert the very day you go on vacation and leave my sister alone to care for the house, sounds OK?\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Good move. Your parents have been enablers and it is now too late to get her to be responsible. NTA.", "NTA", "NTA. Tell your parents that you're no longer their house or dog sitter.  You and your sister are BOTH adults.  She should be able to handle it and you should be able to speak up for yourself.", "NTA. OP, after reading your comments, I understand you don't want to stop helping your parents, and I'd probably feel the same. It's also clear that if you say no, they'll either stop vacationing or they'll rely on your sister and she'll 100% fuck it up with the dog, who doesn't deserve to not be cared for.\n\nSo next time, offer to take the dog to your house, if you can; if you can't, tell them you'll drop by their house at 9am and at 9pm to give the dog the shot, and that is it. Leave the rest of the house to your sister. If they find a mess when they come back, maybe they'll start demanding more from her, instead of expecting everything from YOU.", "You're NTA\n\nIf your parents are expecting you to shoulder more than 50% of the responsibility then make very clear with them that you expect more than 50% of the inheritance when they die. If they're not willing to do that, then you shouldn't be expected to do more than 50% of the work.", "NTA because I get it I do but you could have been less snarky in the text because that's only going to make your mom defensive and is not going to help with the problem so good luck its sound like a tough situation", "NTA. You need boundaries. Serious boundaries. You need to stop enabling your sister, and hopefully your parents will too. They should kick her out, honestly. I hope you're at least getting payed for house sitting, and if not then DEFINITELY stop doing this.\n\nAlso, probably an unpopular opinion, if your parents and sister can't take care of the dog then it either needs to just die or get put down. Some might call me cruel, but keeping that dog alive seems more cruel to me. It shouldn't be your sole responsibility to keep their dog alive.", "Your sister needs some serious help. You're parents should be kicking her out or forcing her to get a job", "I know, but they don't have the money to hire anyone like that.", "Mostly because I love them, I want them to have a good time on their vacation and also because I love the dogs and enjoy spending time with them. And also, I want to make sure the dog gets his injections, I care about his health.", "There was a point during my teenage years when my parents had no money (but they still gave me everything I wanted and needed). I saw how difficult that was for them. Now that things are different and they can afford to enjoy themselves, I'm happy to do anything in my power to help them. I'm not sure why - I love them, I guess, and I like seeing them happy.", "If I say now they just won't go on vacation - and I'll feel guilty. They won't really blame me - they'll just be sad.", "The sister is better at being an adult than OP.", "This are the PARTENT'S dogs, and this has NOTHING to do with the sister.", "Sorry English isn't my first language. I'll correct it now.", "I don't think so, no. They'd rather not go on vacation - which means, if I don't agree, they can't go. I keep saying yes because I love the dog and want him to be cared for - and I don't trust my sister to do it (I guess it's the same my parents think, which creates this whole problem and nobody trusts her).", "I mean, yes. The dog is 11, which means we've had it since I was 14. It's my dog too and I love him a lot. It's not just \"my parents' dog\", it's our family's dog.", "Yeah, it doesn't mention it in here, but it's totally possibly sis is just deeply uncomfortable holding a dog down for a shot or doesn't really have much of a relationship with the dogs in the first place. Both of which are pretty valid reasons to not agree to do this. Just because she lives there doesn't mean the parents are entitled to free pet sitting and medical care.", "I don't care about the inheritance - and also, in my country all siblings get the same amount, it isn't possible by law to decide who gets what. It's all equal.", "I mean, they had money for a 10 day vacay. Seems reasonable they could also find the money for this", "But they have money for a ten day vacation? I feel like if they won't enforce your sister helping you ( as she is living there rent free) then they should figure out another solution.  I have animals that require more work than just filling their food bowl so I know part of my budget for my vacation is pet care. Many people have to do this. They are lucky they have you but I would tell them now: I am willing to help you next time but my sister HAS TO help me,  otherwise you will need to find another solution.\nEdit: word change", "If they can afford a 10 day vacation, they can afford to board the dog. They need to just factor in that cost when they're saving up for their vacation. It's just cheaper for them to make you do it.", "NTA.  Stop saying yes.  I’m sure you have a life. Sister lives there or they can pay for s pet sitter.I’m sorry if they can vacation for 10 days they can pay for a pet sitter. Stop letting them take advantage of you.", "When we plan a vacation we factor in the cost of boarding our dog, that's part of being a good pet owner. Lots of kennels will take care of dogs that need meds.", "NTA, that sounds like a them problem! If they can’t be bothered to give you the basic things that you need to help them why should you be bothered? You’re doing them a favor. Honestly next time just say no I’m sorry I have other things to do and the last time I try to help you guys you couldn’t be bothered.", "You need to stop enabling your parents and your sister. It's not easy, but let me be the voice of reason here. Your parents clearly have the ability to pay for a house sitter or a dog kennel. Your sister should be able to be totally responsible for the house at 21. You are trying to be the good daughter and be loving, but they are taking advantage of you. If they are paying you then that's one thing, because then you're basically working for them, but if you're doing this for free then you're actually doing harm by letting them get used to relying on something they shouldn't be relying on. You're giving a drunk a drink. \n\nYour sister needs some serious help. You're parents should be kicking her out or forcing her to get a job and do some chores if she doesn't want to move out, and you need to let them learn the consequences of their behavior. You're being used, and that's not what happens in a loving relationship. You don't need to be a jerk or anything, you're heart is in the right place, but you have a one sided toxic relationship and you're getting walked all over. Learn to say no. They shouldn't be relying on you to go on vacation when your sister is at home, and if they do and they try and make you feel bad then that is toxic and controlling and you need to tell them so. I hope you are able to work things out, and I hope your sister learns her lesson.", "Your parents can pay for the dogs to be boarded.", "I think you really need to set boundaries for all your benefit. Otherwise it could get to a situation where they're constantly expecting stuff from you you don't want to give, and you're resentful about it and it no longer pleases you to make them happy", "So do that, but stop harassing your sister about it.", "I mean NTA for what you said but it’s meaningless that you said it.  Nobody cared and nobody will change their behavior here unless you stop enabling it.", "But it will always be you feeling guilty and never your sister. So let her take the responsibility next time and maybe then she/your parents will understand how much you are helping.", "If they choose to not go on vacation because they won't be getting free care for their diabetic dog, that's their problem. Don't feel guilty for what your parents *choose* to do.", "Not your responsibility. If they can afford insulin for your dog they can afford to pay a house sitter. Stop feeling bad for your family's dysfunction. It's a miracle you turned out to be responsible.", "This is a YOU problem, and does not concern your sister.\n\n&#x200B;\n\nStop guilting your sister for your inablity to say NO to your arenpts - they are very good at guilting you. Luckily for your sister, she is better at refusing to be manipulated by your parents - AND by you.", "NTA but it doesn’t look like you want to set boundaries you don’t want to refuse their requests. Unfortunately you can’t expect your sister to magically change.  So ask them to hire help next time at least for a portion of their vacation.", "The sister is a grown-ass woman living in her parents’ house. She has to do her fair share of domestic labour, especially if, as is very likely from OP’s post, she’s not paying rent. Thus it is more than fair for the parents to expect her to help take care of the dog.", "Next time maybe the answer is \"my sister is an adult, it's time she started acting like one. I'll come each day to make sure the dogs are cared for and medicated but sister needs to do everything else\".", "Would they be willing to issue her an ultimatum? \n\nIt’s kind of extreme depending on how far they take it but it seems like she is kind of using them. Unless she is currently in some kind of schooling, working her way towards a job, or paying rent than she needs to have some kind of responsibility given to her and expected to keep it with consequences if she doesn’t.\n\nTell them that they are probably setting her up to always need their help. Im one possible result of what they are doing though Im on the opposite spectrum as her. Instead of partying I stayed at home all the time. My parents let me thinking I would grow out of it and eventually grow a need for independence. \n\nInstead it and all my other mental problems slowly got worse. Now I *am* starting to feel the need for independence and Im honestly not sure I see a way out of my problems at this point…", "Sure. Didn't mean you insist on it, but rather show your parents that it's unfair. But if everything is split equally by law, it's less effective. \n\nAnyway, NTA.", "This is simple: the sister is better at setting boundaries, and actually manges not to be guilted into saying yes.", "That's a terrible take, lol. Yes she needs to say no to her parents, but her sister is obviously a lazy bum who does nothing but mooch, so she should in no way be praised for \"saying no\". If she's living there then she should be completely responsible for watching the house when the parents are gone. Are you kidding me? She is 21 for Peet's sake!", "The arrangement was that we both would be working together to care for the house. I mean, first thing they asked me, then I asked why should I go if my sister lives there, and then there was this conversation about them asking her to \"help\" me. So she agreed to help at least.\n\nI'm not even asking her to feed them or take them for walks or anything, I'll happily do that. She just needed to be here 9am and 9pm to hold the dog so I can inject him the insulin. Before the concert we had discussed that it wasn't a good idea that she went - there was no way of being sure she would come back in time. However, at the last minute she decided to go, my mother \"let\" her, and with that permission she went.\n\nI guess having a good time with her friends and boyfriend in a concert was more important than her promise.\n\nBut whatever. I get your point tho - this is definitely a me problem. My sister can do whatever she wants, she's an adult. I can't change her.", "She's not paying rent but it's currently summer here, so she's on a break from college. She had a job last year but she lost it and is looking for a new one. She has been living with my parents for a few months (since she lost her job, around November).\n\nDuring the academic year she lives with me and pays her share (at least when she had the job). It was an adjustment to demand her to do chores.", "And sister is fine not to do it.", "I live 2 hours away. This would be a great compromise, but sadly it's not feasible.", "But my point is, if it is for a short period of time and the sister is staying with her parents, then is it not expected of her to helo? Don't take this in the wrong way, But I am not from the West and there is not much boundary concept for our parents really. So my question is, either the sister has to stay at her own place and set boundaries or if she is staying with her parents then has to take care of some household duties? Because where we live, we don't move out of our parents house as soon as we turn 18 and we help out with whatever we can. We can't have the best of both options is what I am saying. Hope I am clear.", "The relartionship between her sister and her parents is NONE of OP's business.\n\n&#x200B;\n\nThe parents asked OP, and OP AGREED to do it. So it is HER responsibily. She could have refused, then it would not have been.  ... She is an AH to expect her sister to do the things SHE agreed to do.", "Rights, so she owes your parents chores, whereas you don’t.", "Ahhh yeah. That does make a big difference there.", "No: Especially when someone else had agreed to do it. It is reasonable to let THAT person do it than, just as they promised.\n\n&#x200B;\n\n\" So my question is, either the sister has to stay at her own place and set boundaries or if she is staying with her parents then has to take care of some household duties?\" ... Yes. But refusing to take care of a diabetic dog needing special treatment is a reasonable boundary.\n\n&#x200B;\n\n\"We can't have the best of both options is what I am saying.\" .. This is something between the sister and the parents, and THEY seem to be fine with it. So sister CAN have it the way they have agreed on. This has NOTHING to do with the promise OP made to her parents to take care of the dogs. And that promise does not concern her sister, she did not make that promise, so: NOT HER DUTY.", "Okay I understood the point here. Her accepting the tasks is her responsibility and not to be passed on when the other person who has not accepted or promised to take care of them.\n\nThank you for the clear response as sometimes it is really difficult to think in other ways when there is cultural/regional difference on how certain things are perceived!! 😊", "ESH\n\nOP you need to talk to an outside professional. As an overachieving oldest child myself, I hear you, but you need to break this cycle/habit. It also wasn’t cool to text M&D on vacation after you agreed to do the job. \n\nYour sibling will grow up, given the chance. Or your parents will find a another option (kennel) and continue to enable her.", "Listen, gently, YTA. \n\nYou just can’t have it both ways. You feel used and singled out because your sister is a shit show. Fine. It’s the truth. However, you either do it and stop complaining because you’re agreeing to it knowing what will happen OR you just don’t do it. But this cycle of doing it but then whining about it like there’s some new information when there isn’t doesn’t have a positive impact.", "NTA\nYour sister however is the AH. If it weren't for the dog you could just tell your parents No. You of course have to be responsible for the dog's injections because clearly won't be. Good luck.", "NTA, they could hire someone to watch the house and take care of the dogs.", "NTA look into how much it would cost for a vet tech/pet sitter to care for the dog. Either your parents or your sister need to pay you to care for the dog since your sister is living there rent free. Otherwise next time let them know you have plans and can’t do it.", "nta tell your parents to pay a professional dog sitter or train your sister", "NTA. Either don't pet sit anymore or at least demand a heavy fee.\n\nAlso the needle does not need to stay in 10 seconds...", "You know why they act like this? Because you let them and they have no reason to change. NTA but learn to say no to them so they have to figure things out on their own.  They won’t change if you always come in to do everything", "Nta.", "Nta", "NTA grow a backbone and say no to house sitting", "NTA. But also a little YTA. Who tf comes back from a concert at 9pm? The show is barely starting. Honestly you also sound a little jealous. But still, NTA.", "YTA for agreeing to it when she lives there. You put yourself in this mess.", "NTA.  And may I say, as a child of a champion guilt-tripper, that your parents are adults who have many options for dog and house sitting besides you.  They are trying to make you responsible for their responsibilities because it’s easier on them to abuse your mental health than budget or make a few phone calls.  This also goes for your sister, by saying she should help you, they want you to parent your sister into getting more responsible.  I suggest just being unavailable for any help that makes you feel resentful.  You are now an adult and will have a happier future with them if you decide and enforce your boundaries early and constant.", "NTA\n\nTell your parents that next time they are on vacation, you will not be available. This is telling them right away that you are done, no matter when that vacation is. They have raised a very entitled princess, and now they are going to have to deal with it. They will have to hire someone to look after their house and pets when they are gone.", "No, next time say NO to watching the house and pets.  Don’t be available.  You do get that you are essentially being punished for being responsible, right?  And that your sister counts on it because she can do whatever she wants with no consequences because she knows you’ll take care of it?  If you don’t stop this cycle right now, this will be your life always.  You will be angry, resentful, and your family just won’t care because you are the responsible one.  NTA but stop letting them walk all over you.", "You have two choices here.  You can either say NO, which is a complete sentence, or you can say YES with the understanding that you won't have help.\n\nThis isn't about your sister. This is about you either setting boundaries or accepting the reality of your choice, which is you won't have any help from your sister.", "NTA but I think it's pretty clear your sister won't change any time soon, and your parents aren't going to push her either.  So the only person you can control here is yourself.  \n\nIf it bothers you that much, no longer agree to watch the dogs and their home.  They can board them, or hired a pet sitter, one experienced with injections, to come take care of them.  That's part of the cost of going on vacation when you have pets.  A lot of times vet techs do that as a side gig - they should ask.", "NTA Vet here: I don't understand why the needle needs to be kept in for 10 seconds- please check with your dogs vet about this. This is not a thing.", "Stop house sitting and dog sitting. Your parents have a live in helper to do that. \n\nTell your parents that you will no longer help to enable your sister. If they don't trust her, the will have to make other arrangements. And if they don't want her mooching off of them when she is 30, they'd better change their ways.\n\nNTA", "NTA, you should have put a stop to this a long time ago and her parents aren’t doing her any favors. She needs to learn to be responsible and how to take care of herself and live life. Tell them if God forbid something happened to them both you not playing the parent to your sister.", "Your parents or sister have no incentive to change the situation!", "That's what every veterinarian has told me, and also the pharmacy that sells them. I don't use a needle, technically - I use some kind of pen, I don't how what they are called in English, where you just put the dosage and press a button.", "We use some kind of pen, not really a needle. I don't know how they are called in English. It's one where you select the dosage and press a button. Several vets have told us to keep it in at least 10 seconds to make sure all the dosage got it.  I don't know, that's what we were told.", "If they stopped boarding their 21 year old adult daughter, they'd be able to afford to board the dog. Taking care of a giant child is expensive", "Then they don't have the money to go on vacation.\n\nThe total cost of a vacation for them includes the cost of taking care of their responsibilities while they are gone of which the biggest one is taking care of the diabetic dog.\n\nRight now they are dumping the cost of that on you and that is a substantial burden.\n\nYour mistake is trying to manage your sister's relationship with your parents. You only get to manage your own relationship with your parents. You have only one lever to pull here, which is to say \"no\" to your parents the next time they ask you to do this.\n\nYou're 25. You get to live your own life. You could, for instance, take a job in another geography. That's a normal thing for people to do.\n\nIf you did that, your parents would have to find another solution for the dog. Which they would - or if they couldn't, they'd have to rethink their vacation plans, which isn't the end of the world. Maybe that solution would be your sister, maybe it wouldn't, not your problem, up to your parents to solve.\n\nSo, figure out if you're willing to pull that lever or not. You're well within your right to say no. But whatever you do, stop trying to manage your parents relationship with your sister. It's not your place, and you will only end up frustrating yourself and them.", "But that’s not your problem. Your letting your parents put your sisters lack of responsibility on you.", "So maybe next time they take a 7 day vacation and use the money for the other 3 days to board their dog. Regardless of how they solve the issue of pet care, it is THEIR issue to solve. \n\nNTA", "Maybe they should charge your sister rent so they can afford it or pet sitting is her cost to live at home.", "Then they can't afford the trip, can they? That's not your problem.", "If they don't have anyone then tough, no holiday. Or go away less often and save that money for pet sitters. Stop pandering to your parents and your lazy sister.", "that sounds like a them problem. they don't need to go on vacation.", "Sounds like your parents use money as an excuse so they can rely on your free labor. If they can't afford to take care of their responsibilities while they are gone, then they can't afford a vacation.", "Then they could make your sister help. Until you say no they have no motivation to change\n\nNTA", " \nSee how much it costs to take care of a dog at a vet / pet sitter", "That’s sweet of you, but that’s also what they’re counting on. I assume that your parents also love the dogs, even if your sister doesn’t. So let them figure out what to do when your not available by not being available. You have a life and you do not have dogs. So the next time they ask, just say you are busy. ideally, schedule somethings so that you *truly* are busy. A date night with your bf, or friends. An overnight trip. A fitness class. A seminar course. Doing your taxes. Whatever it is, just be busy. They need to figure out another plan than just having you do it. Think if it as being for the dogs’ benefit because at some point you won’t be there and they’ll need to be cared for.", "Hi, if you want to help them, good for you, but you know the situation, you are not going to change the situation. You need to adjust your expectations or not do that. It is your choice, but this are the only two options NTA", "If you say \"no\" and they choose to not go on vacations because of it, that is on them. 100%.\n\nMultiple commenters have pointed out that they could & and should be including the cost of boarding the dog (dogs, really, cause if boarding one, why not the other).\n\nThis is not a make or break thing to do with a vacation. All it means is that they might have to take a little longer to save up for the vacations, scale them down a little or a mixture of both.\n\nResponding by going \"well I guess we'll never go on vacation again\" or whatever their equivelent would be is manipulative. It would be blaming you, just by oblique methods.\n\nSuppose you had an opportunity to move a long distance away for work. If you were no longer living close by, do you suppose they'd stop going on vacations because you weren't there? Or do you think they'd figure it out?\n\nThey'd probably figure it out. But, if they did stop, just because you weren't there... well, I don't think I need to say what sort of picture it would paint about them and their character, other than that it would be a pretty ugly one.", "You’re the doormat child that’s why this keeps happening to you.", "That's still a fucking guilt trip to get what they want.\n\nYou need to recognize that they're not going change what *works* for them; you need to make decisions for yourself based on the reality that your sister won't step up and your parents put more on your shoulders. Most folks won't changes their habits unless they *have* to. So you need to control what you can: yourself.\n\nNTA. But recognize that you are part of the issue by enabling and rewarding their bad behavior.", "That's a them problem. No reason to feel guilty. It will be the consequences of their choices.", "So let them be sad. \n\nIt's their fault for not letting the child who lives with them look after the house and dog. It's their fault for not insisting the she be an adult.", "So they are manipulating emotionally. They won't be able to go on vacation without their 'responsible' daughter taking care if the dog? They have another daughter whom they should be getting ready for adulting. When will they start trusting her-when she's forty? All of you are doing a disservice to this child woman by not letting her grow up. Stop enabling her and give her some responsibility.", "Yup, when you plan a vacation you plan for all related expenses. Maybe they needed to shorten the vacation in order to afford the dog boarding. Just like when you plan to go out to dinner you include the tip in your budget. If you can't afford a good tip, you can't afford the meal.", "Agreed if you don't have enough for everything you don't have enough to go.", "Hard agree, can't afford a 10 day vacation + boarding your diabetic dogs? Sounds like it needs to be a 7 day vacation. But I agree with another post, OP would need to kindly but forcefully stand up for themselves."]}