{"id": 11046, "submission_id": "11d9t72", "title": "AITA For asking a week off from my parents.", "selftext": "I (26F) am still living with my parents, my house is being built with the help of my parents. They are helping me financially 50/50. They own a restaurant that I have been helping out everyday (yes also every weekend) with ever since I was 13.\n\nI'm also working a fulltime job for 5 years as well now, which is an hour away drive from the restaurant.\n\nSince I rarely take a day off and every holiday I have, I basically help my parents even more out. I decided to ask if I could get a week off around Easter to see my bf (I am in a LDR been dating for 7 months now and they are aware of it, he has also visited them during Christmas and helped a bit out as well). \n\nMy parents and especially my mom got furious about the question and told \"that is the most stupid question you can ask, you know we don't have enough personnel and you dare to even ask?!\". \nThis basically continued to the rant of that I am an \"ungrateful, selfish and egoistic child\" who doesn't even care about their parents. \n\nLike I get it is harsh times, but I've been hearing this \"we lack personnel\" for over 8 years now and everytime no one comes in they just tell me \"ye you are cheaper and family so least you can do is help us out\" or they tell the person who wants to work \"we have enough personnel\". \n\nI'm just really mentally and physically drained as I work more than 10h a day +2h travel time and need some time off but they tell me \"well back in my days I had it way harder than you!\" so I just start to wonder if I really am just asking too much. And if I really am that selfish child. \n\nSo... Am I The asshole for asking a week off?", "created_utc": 1677497983, "permalink": "/r/AmItheAsshole/comments/11d9t72/aita_for_asking_a_week_off_from_my_parents/", "score": 172, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my parents if I could take a week off from helping them out in their restaurant as I've been basically working there my whole life with no breaks (1)\nThey don't have enough personnel for years and I dared to ask for a week off (2)\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  Currently, there are never enough personnel to fully staff a restaurant.  They’ve been saying this for 8 YEARS?  Remind them of that, and say you are taking the day off and someone else will have to fill that spot.", "Ferengi Rule of Acquisition, 110: Exploitation begins at home.\n\nYour parents are using you and your labor for their own gain. The fact that your mother would react to such simple and reasonable request because they are short-staffed is their problems as business owners. \n\nNTA", ">  I've been hearing this \"we lack personnel\" for over 8 years now \n\nYour parents are not competent enough to run a restaurant. They need to sidestep paying employees to make their restaurant run.\n\nNTA", "NTA. you aren't responsible for your parents business", "NTA. They need to hire more staff if you aren’t able to have a break. Unfortunately, given you are financially tied to them, they will probably try to hold that over you, but it’s doesn’t make what they are doing unreasonable", "NTA\n\nSo, basically you've been working a full time job **and** \"helping your parents out\" with their restaurant.   You haven't had a single day off in **eight years**.\n\nHonestly, if your parents can only keep the restaurant in business by ruthlessly exploiting slave labor (i.e. you), the restaurant should go under.  The restaurant business, as you know firsthand, is brutal.   That doesn't mean you should have your entire life ground under its gears.\n\nYou absolutely deserve some time off.  More than a week in eight years.", "A very big NTA but they could annoy you with your home", "NTA - sounds like you help your parents a lot so aren't ungrateful for their help.\n\nYes they are helping you with the house and letting you live with them, but you are still entitled to a small break every now and then.", "NTA, they've been putting you to work since you were 13? People need time off, it's not healthy to be working pretty much all day. They seem delusional.", "NTA - you'll find that you aren't making minimum wage. If you're working 70+ hours a week. If you got two jobs you could probably make much more than you are currently. \n\nDon't get me wrong. It's good to obey your parents but at the expense of your relationships, career and future? \n\nYour parents own a business and it's down to them to make it work out. If that business fails and you are outside and earning your own money you can help them out. If the business fails and you are all in it together then you all get thrown onto the streets together. \n\n\nIt may feel terrible but making your own way will not only make everything stronger but improve your life.", "NTA\n\nEverybody has the right to have a hollyday. Its common in a lot of countries to have those. Its also for taking care of your mental health.\n\n\"ye you are cheaper and family so least you can do is help us out\" -> WTF\n\n\"well back in my days I had it way harder than you!\"-> Even if this is true, thats no reason people need hollydays. We know better these days.\n\nAnd how are you supposed to maintain your relationship if you don't visit your BF. It can't be all onesided. Maybe that is the issue that your parents are afraid to loose cheap labor. I know that is a wild gues but i might be something to consider.", "NTA, you should be grateful for the help they give you and they should let you live your life how you want it. \n\nPaying half of your house doesn't make you their slave", "NTA - You help them for years and never ask anything but your phisical and mental healthy are asking for a break", "NTA.  You need some time off sometimes.  If they haven't staffed up in 8 years....do they expect you to wait another 8 years to ask for time off???????????????", "NTA \n\nYou’re not selfish. You need & deserve a break. I grew up in the family restaurant business.... no one gets to leave without ridiculous amounts of guilt & drama. \n\nYour parents are never going to willingly allow you to go on vacation, you’re going to need to go without their permission. Should probably wait until your house is done. Good luck!", "Absolutely NTA.\n\nStart charging them the average wage for someone your age in your country or state and tell them you believe they should be grateful for your help as an adult now that you live on your own and work over 40 h per week, adding to that 7 days per week of free work for them (that's not normal?!) or subtract the average wage to the money you owe them for the house they help you finance. \n\nJust prepare for the worst consequences because they help you financially at the moment and you are staying at their house for the time being.", "NTA. They are trying to get away with using you like a slave.", "NTA. What is with your parents. Do they think you're their work horse? It is not selfish to wat to take a vacation, It seems like you just want the time off, not necessarily away from them specifically, but either way we all need a break now and then.", "You're being exploited. Stop letting them dangle a house in your face like a carrot on a string. NTA and I hope you find independence", "NTA but if you want a half free house, you’re going to have to suck it up, I’m afraid. When those apron strings aren’t fully cut, there is usually a price to pay.", "NTA you are being used and now with the house they will be more insufferable. Good luck", "NTA. You have to set boundaries. Otherwise, you, your husband, your five children, your in-laws, and your ten grandchildren will all be helping in the family business because of lack of help.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26F) am still living with my parents, my house is being built with the help of my parents. They are helping me financially 50/50. They own a restaurant that I have been helping out everyday (yes also every weekend) with ever since I was 13.\n\nI'm also working a fulltime job for 5 years as well now, which is an hour away drive from the restaurant.\n\nSince I rarely take a day off and every holiday I have, I basically help my parents even more out. I decided to ask if I could get a week off around Easter to see my bf (I am in a LDR been dating for 7 months now and they are aware of it, he has also visited them during Christmas and helped a bit out as well). \n\nMy parents and especially my mom got furious about the question and told \"that is the most stupid question you can ask, you know we don't have enough personnel and you dare to even ask?!\". \nThis basically continued to the rant of that I am an \"ungrateful, selfish and egoistic child\" who doesn't even care about their parents. \n\nLike I get it is harsh times, but I've been hearing this \"we lack personnel\" for over 8 years now and everytime no one comes in they just tell me \"ye you are cheaper and family so least you can do is help us out\" or they tell the person who wants to work \"we have enough personnel\". \n\nI'm just really mentally and physically drained as I work more than 10h a day +2h travel time and need some time off but they tell me \"well back in my days I had it way harder than you!\" so I just start to wonder if I really am just asking too much. And if I really am that selfish child. \n\nSo... Am I The asshole for asking a week off?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", ">my house is being built with the help of my parents. They are helping me financially 50/50. \n\nWhen it is finished, will you own it 50/50 or will you own it 100%?", "NTA your parents are exploiting you.", "NTA - you are entitled to some time off! You are being taken advantage of massively here. If u were you I would just tell them you were taking a week off after 8 years, like it or lump it.", "NTA", ">my house is being built with the help of my parents. They are helping me financially 50/50.\n\nI don't understand why you went along with that. I don't know how to judge this because I don't know what you agreed to in exchange for the house. Wait, they loaned you half the money. Are you working for free to pay that off? Like if you work 29 hours a week, what they should pay you goes towards that loan? \n\nBut they won't even pay your petrol for deliveries? And they say it's because your family. How long has this house been \"being built\" for?", "NTA\n\nYou need to sit everyone down and set boundaries. It’s time to be an adult and draw that line in the sand now so you can be comfortable and not work yourself to death. \n\nThey’re relying on you as a sure thing and not bothering to hire enough staff because they can count on your cheap labour. If you keep letting them do it, they’ll keep doing it. Their management flaws are NOT your responsibility. Even if they’re helping you build your house.", "NTA. But they bought you with a house. Is it worth your life? If not, sell it, give them their share and be on your own.", "NTA and what they are doing is super illegal. If you work for them you should be paid. They are the selfish/entitled ones. Document everything they have you do, how much they owe you in unpaid wages and how much the cost they are paying of your house would be. If the cost they covered is less that the wages they've not given you then you owe them sweet F all.", "They aren't going 50:50 on the house. I bet if you calculate every hour you've put in to their business times that by minimum wage where your live. Add in overtime (for the days off your should have had if you were on a proper contract but worked instead). Depending on where you live add in extra for seniority (I'd be shocked if all you did there was minimum wage things).\nAdd all that up and I expect it's more than they're spending on your house.", "NTA \n\nFinancially untangle yourself from them and quit the restaurant. It may take time, but make that your goal.", "YTA. They are paying for half of EVERYTHING right now, you’re 25. Gain some independency or deal with your parents events. As long as you are financially dependent on them its your problem.", "When I remind them of that I basically get at least 5h of nagging of how ungrateful I am it's like a tedious talk how shitty I am as a person...\nIt's just weird that other people see them as \"nice\" because we do have 2 other people working for them but that's not enough, and they can just take days off but when I do I just get a full load of nagging.", "My parents are basically telling me that my benefits are that they can help with the house and I have a place to live in.\nI also have to do deliveries with my own expenses. They won't pay for my petrol either... Because we are family... And we should \"help\" each other... I'm just lost I'm sorry", "Ye they basically say it's a LDR and it wouldn't work out and if he really loves you he should come to you and you not to him.", "Why staff up when they get OP to work for free? Parents make more money that way.  And don’t even pay for OP’s petrol for deliveries? More profit for parents.", "I have to eventually pay it back, I'm already paying the interest as well as we speak...", "Even if they own it 100% it will be held over their head until they die. Not a smart move.", "What kind of written agreement is in place? Is it interest free? Do you pay back money or working hours? Are you the only person owning the house  or are they on it as well?", "I basically believed when my parents said \"we will help you out so you can have your own life\"\nI basically work on paper 2h a week. Except I work more hours and I should be thankful for them that I'm even getting paid in the first place. \n\nBut I think it's really getting off topic since well.. I only asked for a week off", "How does the parents paying for half of the house being built mean that they cannot be considered assholes with the way they are speaking to their child?", "> YTA\n\nBullshit. Everyone deserves time off.", "A week is not that much to ask for. And OP is been working for them since 13 years old. They just want cheap labor, they said so as much. Just because they're helping with the house it doesn't make them entitled to enslave OP.", "Yeah because forcing your kids into indentured servitude is completely fine.\n\n/sarcasm", "Paid slavery is still slavery", "Then walk out the door.  You don’t have to listen to the nagging.  Honestly, your family relationship sounds very difficult, and them helping you build your house makes them think they own you.  Of course that’s why they are doing it: you will be their slave for life and they will bring up that house for the rest of their lives.", "I know this word is overused, but your parents seem very narcissistic. They guilt you into doing something that benefits them and use stuff...like the house to hold over your head. You, as in your overall wellbeing, doesn't seem to be a consideration in all of this. \n\nI can't see putting my child through this. Of course you deserve vacations off. I've never understood the entitlement of others when it comes down to someone else's time. If my child brought this to my attention, I would hear them out, try to work out something we both can agree with and make the necessary adjustments in my business.", "With all the hours worked since 13, you could own an apartment complex. NTA", "Is your house in your name only? Do you get paid or is your house their hostage payment?", "Don't be confused - your parents are massive assholes. They think of you as a slave. You're an extension of their lives, not an individual. Your time belongs to them because they pooped out a baby and now they own its entire existence.\n\nYou don't see it clearly because you've been wearing chains so long you're used to them.\n\n\nStop asking. Start telling. If they pull support that's on them but you need to escape this situation immediately. They will literally use you up like toilet paper and suck the life right out of you, if you allow it. Stop allowing it. Tell them to schedule someone else that week and if they complain, ignore it.\n\nYou'll never figure it out if you keep letting them control you. Bounce. You might also consider an honest discussion where you scream at them at the tip of your lungs that they're shitty people and deserve to get fucked. But that's optional.", "So they don't respect your relationship either, no surprise to be honest, your parents seem like a lot of work I'm sorry about that. I mean even if he came to see you, you'd still that time off, right?", "> I have to eventually pay it back\n\nSo they aren't GIVING you half a house? Then what's the point? What's the advantage of a loan where they extort so much work from you? This is madness.  \n\nSell the fucking house and RUN FAR FROM THESE EXPLOITERS", "Have you ever looked into the numbers to see of this is a good deal?", "Can they call the loan if they get mad at you?", "Oh yes, but if OP owns it 100% then OP can sell it and run. To co-own it would be suicidal.", "I am not OP\n\nbut all good questions", "Then just tell them you're taking a week off. When they shriek, tell them you are an adult and need time. Are they going to fire you? No. Are they going to be as mean as possible about it? Yep! because they installed buttons in you not to value yourself so they can use you as much as they need and they're going to push them until you get away from them. Sorry. \n\nI was trying to figure out if there was some kind of financial agreement you made that necessitated you **asking** for time off.", "OP says they aren't even paying half, just *lending* OP half. They are appalling people", "Shes getting time off, just not a whole ass week", "It's hard for me to walk out of the door because I basically have nowhere to go... My bf is already looking for apartments closer to help me out since he can work online but I have to work on site.. But to find an apartment here nowadays is hard...", "If he came to see me, he basically would see me work ye, if that's what you mean. He tries to make my work a bit \"lighter\" which I really really do appreciate.. But I don't think it should be like this..", "It is basically a family mortgage. As long as I pay (which I already am doing) I didn't break any rules", "Exactly. I feel bad for op they're about to be stuck in a worse situation with this house.", "I missed the lending part. They are appalling, with how they are treating their own child!", "And you think, for some reason, she shouldn't have a whole week off?", "Then tolerate this mess until you can break free. And honestly, rethink the whole idea of that house.  I would let that go in exchange for my freedom.  I would even abandon whatever money I had put into it. Having that house held over my head, for the rest of my parents’ lives would be miserable.", "It really shouldn't, you deserve actual time off not \"lighter\". Everyone deserves proper rest.", "Go read your mortgage and see if there is an acceleration clause or if the lender can declare default for “feeling insecure” about repayment. If so, either get a second mortgage to pay off your parents’ or suck it up and deal with them until it’s paid off.", "Much. Turns out they\\re not even giving her 50%, just loaning it!!", "yup\n\nthey basically bred OP to be profitable livestock", "Ye I was actually thinking to just sell it all off and idk.. Move... I am just confused that asking for a week off can explode like this", "I mean, it's not like I can't pay it off, all I'm asking is a week off.", "Oh double yikes! She needs to find a way to get out of that situation immediately.", "Yep.  As you found out, they think of you as a slave.  Good luck!", "I apologize if I might be judgemental or racist, but you sound like you come from an asian household. I come from one and the stories sound all too familiar.\n\nThis is emotional blackmailing / manipulation and unfortunately, it sounds as if your parents will not likely change. Please do sell that house off as soon as you can and try spending time by yourself and be independent.\n\nNot saying to go NC, but sometimes the only way people like this could learn is when they feel they no longer have control over you. Based on your situation, physically distancing yourself from them could work.", "You’re missing the point. If you can pay it off do it so your parents have no control over you. *That’s* the point. A mortgage through them means they control you. A mortgage through a typical lender means your freedom.", "I get a very strong feeling this is an Asian family. And with many Asian families, there is a moment where the child comes to a crossroads and has to decide whether to become fully independent and therefore cause a scene in the family or bow fully to their parents' control and live the rest of their lives only following their parents' will. That decisive moment seems to be very close for you. \n\nThere are so many strings attached to your job, the home they're building for \"you\", your schedule. It seems they're not looking out for you. \n\nOnly you can make the right decision for you. But there are consequences. And it's going to be fucking hard. Either bear the difficulty now for a short time as you become fully independent or bear a lifetime of difficulty always catering to your parents.", "I suspect you CANNOT pay it off ever. When I needed money after buying an apartment my mother promised to help me with, I had to sell her my high interest saving books which still had a few years left for EUR 100 more than the bank  would have given me. When I ask why she would not give me more, she told me she was not an idiot giving out handouts. She needed Investments too.", "Great!", "You are not wrong my parents are both Asian, I guess this is quite a stereotype...\nI will keep your words in mind, thank you", "They will always control  her and bring out their good deed when they want or need something. And she will always feel indebt to them", "She than expected me to always help her as she have me money. I was naive. She still talks badly about my character  and what a weak person I am and what she did for me to anyone who would listen. At least I do not need to listen anymore, cut the umbilical cord after 4 decades of financial abuse. Should have done that years before. No one had believed me and some still do not.", "I'm so sorry, I wanted to be wrong but this just solidifies that your parents may never change. They will always hold family ties as the main reason why you should do what they want.\n\nYou seem responsible, hard working, and self-sufficient if given the chance. You may thrive more than you know when you're no longer under your parents' influence.\n\nI wish you all the best and good luck. And if it wasn't clear, you're definitely NTA", "If they explode at you for trying to do the right thing, what the consequence if you do what you want? That's the position you are in. You wont change them; decide what you can live with.", "Just run and leave it behind. Others will always Talk.", "NTA Find another job as soon as you can. Start sending out resumes as soon as possible.. when you do get another job offer, quit working for your parents. Use the money to atleast rent a room for a while til you can find your own place or a roommate you actually like. Time to fly the coop and let your parents fend for themselves. Maybe having to pay someone else full wage, they'll finally appreciate you more.", "Are you their daughter or a work horse? NTA.", "I personally understand what you’re going through because I am living in a similar situation. I know you want to help your parents out, but you need to start helping yourself first because they don’t seem to care about your wellbeing. If your name isn’t on your house then take your loses and move somewhere else. If your name is on the house then sell it and give half of the money back to your parents. Or you could start paying them back little by little because they do not value the labor you give them. You are NTA to them but Y T A to yourself for not taking care of yourself", "NTA it's time to go NC. Honestly just tell them to forget the house or sell it when it's ready. Cut your losses and move on. I understand it might be hard but you can find a place out on your own. And if their business fails it's their own fault they can't be bothered to hire actual employees.", "NTA: Just inform your parents you are taking the week off. Don’t ask. They can‘t afford to fire you!!  If they hold the house over your head be prepared to take your half and walk away. But where is the house anyway? Are they helping build a house near them while your boyfriend is LD? Don’t you want to move away to be with him eventually? And do they pay you when you do work for them? If not you’ve paid that house many times over. Time to stop being an indentured servant. Work out the actual costs and benefits to you of the restaurant. Might be time to move.", "NTA. Take the week off. And please disentangle yourself financially from your family.", "NTA everyone deserves time off.", "NTA you're not an on call employee and unless they wanna pay you like one they can hire an adequate number of fucking staff. \n\nSorry but your parents have pissed me off. If you can't afford to adequately staff your restaurant without forcing unpaid labor on your children, guess what? You can't fucking afford a restaurant. Hire staff and pay them, or fuck all the way off. I would genuinely never eat at your parents place now, knowing this is how they choose to do business.", "So this is illegal. If you’re working they have to pay you, the same rate they pay their other employees. They must also provide the same benefits and vacation time they provide the rest of their employees. Contact the department of labor.", "NTA - unless you've got some kind of contract of employment, I think you'll find you don't need to ask for time off, you tell them you are going to take time off.", "NTA.  If your parents aren't paying you I wonder how many labor laws they're breaking....", "NTA but you’re also 26 and need to pay for your own way if you don’t wanna hear their bullshit", "NTA and you are basically slave labor.  No compensation, days off, or bonus pay.  You say they are helping you 50/50; If you haven't had time-off in eight years, they are not doing you any favors at all.", "YTA. They are buying you a house pay for 50% of your life? So do the work. Or give up the house and money and go spend time with your bf. But you want the money with no work?", "NTA You have never established boundaries. You don't ask, you tell them. Remember all abusive parents use these words, 'you are selfish, you are a bad son/daughter, you are lazy, you do not deserve money, time off or whatever else, you owe them, you are ungrateful, you do not care about the future, you have never been any good, you do not care about them/love them etc etc. Nice parents do not use those words with their kids, ever. Only parents who want to use and control their kids do. They are using them on you and are not a sign of real feelings, they are just words to control you with.", "Oh I wish I had an award for you. Take my pesant award Grand Negus 🏆", "Ferengi are such glorious bastards", "How is it exploitation if she is paid fairly for her labour? You think other restaurant workers are buying a new house on their minimum wage salaries? It seems OP is paid gloriously for the work she does.", "Please read 'When I Say No, I Feel Guilty.'", "May the Blessed Exchequer deem you worthy to enter the Divine Treasury!\n\n*that will be five slips of latinum*", "They said she's cheaper than other workers because she's family. Of course, paying for half a house is definitely something, but not sure how it balances, working 7 days a week for 13 years. Employees also get vacation time, which her parents don't want to allow her to have.", "Find some female college students and see if you can rent  a room for a little while til you can find a place of your own. I know its hard but things aren't going to get better with your parents.. you're going to have to rip the bandaid off or keep doing what they want you to do.... you need to make a choice. Either way it's going to be hard.. but if family won't even treat you with the respect most employees deserve...", "OP, you are working two jobs right now. One with an hour commute, the other at your parents' restaurant (unpaid and - from the sound of it, where you're verbally abused).  It's no wonder you're physically and emotionally exhausted. \n\n\nAs your employers, your parents owed you salary/wage.  That money they spent on your house was  salary/wage owed to you. They also owe you time-off so you can rest. You have been working for them since you were 13. At this point, the salary/wage owed and time-off owed to you is probably much more than what they paid you for the house and that week-off that you're asking for.\n\n\nYou know what people can do when their employer is being unreasonable and unfair about employee wage and compensation? Quit.\n\n\nI know it's not that easy, what with all the emotional manipulation and guilt-tripping your parents have instilled in you all your life, but you are entitled to your own life. You don't have to keep giving in to their manipulations."]}