{"id": 11075, "submission_id": "11dkilo", "title": "AITA for giving my friend a phony potential baby name so she’d quit asking?", "selftext": "Throwaway for privacy.\n\nA good college friend of mine “Roxy” married my husband’s cousin, and our kids will share their last name. We’re now in our late 20s. I’m 29 weeks pregnant and Roxy just gave birth to her first, a daughter.\n\nBeing friends, Roxy and I compared notes, but she also kept asking what I’d go with name-wise. I told her she’ll find out when my baby comes. Once I found out I’m having a boy (no, I won’t say his name), she got more incessant about what girl name I’d picked, saying “it’s not like it matters now” as if I won’t have another kid. I got annoyed and asked my husband if I’d be wrong to just give a fake name to shut her up. He suggested “Mierda” which is Spanish for “shit.” I said that to Roxy when she asked me for the ninth time. No exaggeration, that’s how many times I remember her asking. It may have been more. \n\nThey went with that name, but guess what? Their OB/GYN speaks Spanish, and informed them exactly what that name was. My husband’s cousin called – yes, CALLED – me to cuss me out, saying I am a “heartless b\\*\\*\\*\\*” for “embarrassing him and Roxy” and ruining what should’ve been the greatest moment of joy in their lives. I didn’t think of that angle and realized I wouldn’t like it if someone did that to me, so AITA?", "created_utc": 1677526301, "permalink": "/r/AmItheAsshole/comments/11dkilo/aita_for_giving_my_friend_a_phony_potential_baby/", "score": 142, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the AH because I did not consider how giving them a vulgar name would embarrass them when they found out the truth and ruin what should have been a moment of joy.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA!!!!\n\nWell played, btw. As someone who also has toxic family like this, I tip my hat to you. Lol", "NTA. I've heard so many stories of people \"stealing\" baby names from family and friends. You have the right to privacy.", "I don’t understand. She was willing to name her daughter literally anything you said? That makes 0 sense… does she hate you? So random. NTA", "NTA. They couldn't figure out a name for their child before it was born? Seems like their genius plan was to get your friend to pester you until you gave them a name to steal. It'll be hilarious if they put that on the birth certificate.", "NTA\n\n \n\n>CALLED – me to cuss me out, saying I am a “heartless b****” for “embarrassing him and Roxy” and ruining what should’ve been the greatest moment of joy in their lives\n\n How did you do that?? Lol, some people are tstl", "So let me get this straight… she asked you for your girl name and you thought she might steal it so you gave her another one and she stole it without even googling it and she’s mad at you? Wow. NTA.", "I don’t understand the point of stealing someone’s baby name. So tacky. Wouldn’t you want your kid to have a name that’s special to *you*? Not somebody else?\n\nNTA", "Laughing so hard\nNTA", "NTA. They didn’t even bother looking up Mierda?! They deserve the embarrassment. Sounds like they straight up wanted to steal your name and did it without any actual consideration for the baby. That’s just dumb. \n\nIt’s not your problem. You should just say - Oh, I didn’t realise that is what Mierda meant in Spanish. Thanks for telling us. - and call it a day.", "NTA. Look up a name before giving it to a kid. Especially if it's a language you don't speak.", "NTA", "NTA. This is basically a FAFO.", "HAHAHAHA. NTA. She was basically asking you so she could steal the name. She got what she deserved. also, she doesn't really sound like a friend.", "INFO: Did she name her kid Mierda? If so, that's fricking weird. If not, why did that name come up at her OB/GYN appt? I'm so confused. Still NTA.", "God, I hope this really happened! Lmao", "NTA it is astounding how often idiots reveal themselves by not taking a few minutes to use a search engine before making a fool of themselves.", "NTA. She was asking you what you would have named your baby if you had a girl, not for name suggestions for her baby.", "Nta", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway for privacy.\n\nA good college friend of mine “Roxy” married my husband’s cousin, and our kids will share their last name. We’re now in our late 20s. I’m 29 weeks pregnant and Roxy just gave birth to her first, a daughter.\n\nBeing friends, Roxy and I compared notes, but she also kept asking what I’d go with name-wise. I told her she’ll find out when my baby comes. Once I found out I’m having a boy (no, I won’t say his name), she got more incessant about what girl name I’d picked, saying “it’s not like it matters now” as if I won’t have another kid. I got annoyed and asked my husband if I’d be wrong to just give a fake name to shut her up. He suggested “Mierda” which is Spanish for “shit.” I said that to Roxy when she asked me for the ninth time. No exaggeration, that’s how many times I remember her asking. It may have been more. \n\nThey went with that name, but guess what? Their OB/GYN speaks Spanish, and informed them exactly what that name was. My husband’s cousin called – yes, CALLED – me to cuss me out, saying I am a “heartless b\\*\\*\\*\\*” for “embarrassing him and Roxy” and ruining what should’ve been the greatest moment of joy in their lives. I didn’t think of that angle and realized I wouldn’t like it if someone did that to me, so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, your food college friend is really not as good as you think. To be so intrusive just to steal a baby name and then be so stupid not to look up the meaning, it so ridiculous and pretty funny actually.", "I smirked at Mierda. When I got to the part with the OBGYN who speaks Spanish, I laughed out loud so hard I scared the cat. \n\nMy sister had her kid 10 days before I gave birth. She STOLE the only baby name I planned on; a special combo meld of our Mom's names that I invented and proudly revealed as my only choice. Having her child first, sister put it right on the birth certificate. Though I love my niece, I have never forgiven sister for that bullshit move.  I wish I'd had your forethought. You are a rock star with Supergirl moves!", "She had you make the decision for her own child's name thats a first. Seems like that girl idolise your opinions or something. NTA", "NTA. So they just decided to steal the name and do no research on it? That's hilarious", "NTA\n\nso her plan was to steal your (fake) baby name and that's what she gets. I would laugh in her face and hang up on her.", "NTA\n\nWho the fuck uses their friend's cast-off baby name? The only real reason to ask/know is to avoid using it. And simple curiosity between friends is understandable. None of that would justify haranguing you about it.", "NTA, if she wanted you to name her baby she should have asked. You told her what you’d name your baby, not what you thought she should name hers. If she wants to play stupid games, she wins stupid prizes.", "Majestic princess fluffer puff the 2nd (the first being the dog). See her face when you tell her, we did it to my SIL.", "NtA. You did not embarass them. They embarrassed themselves.", "LOL I usually say I hope this story is fake to ppl who write exaggerated horrible stories but I really really hope this story is real cause it's damn hilarious 😂👍. Oh and NTA she got what she deserved.", "NTA. Shouldn't have stolen the name.", "Ummm she harrassed you for your baby name then tried to claim it??\n\n\nWhat a dummy!\n\nPlay stupid games win stupid prizes", "ESH\n\nI think you knew she was asking in order to steal the name. If nobody involved spoke Spanish, she very well might have legally named her daughter that. But she sucks for pestering you with the intent to steal your baby name.", "Did they acknowledge the fact that they were “stealing” the name from you?\nI’m guessing they totally glossed over why you “played” the joke in the first place. It’s not like you tried to set her up. She 100% asked for it and did this to herself!\nNTA", "NTA- your \"good friend\" deserved every bit of that embarrassment because she obviously only asked with the intent to use your chosen girl name on her baby. Lol, that's hilarious...", "NTA. She knew what she was doing, and you knew too. She thought she was being clever, but everyone has now learned that she’s not.", "YTA. You clearly had a discussion on what vulgar name to give them. You knew what you were doing.", "NTA\n\nLmao that’s on her for trying to use someone else to name her damn kid. \n\nNot to mention she was stealing a baby name", "\"They went with that name\"\n\nAnd no one on Reddit was surprised!\n\nNTA  She earned it.", "NTA, your \"friend\" is oddly intrusive and, quite frankly, who picks a random name without researching at least what the name means. You threw a name out during a moment of frustration. You never knew that that it would go this far. You said, \"I wouldn't like if someone did that to me,\" but would you have actually harassed someone to give you the name they chose?They called yelling because they were embarrassed, not because they were \"robbed\" of a special moment.", "NTA Roxy got what she deserved", "ESH\n\nShe really used the name you chose? That’s a massive AH move. Like you said, what if you had wanted to use it for your next child? It’s definitely an unspoken rule that you shouldn’t use someone’s baby name, at least without asking. Her behaviour is kinda crazy. \n\nYou’re less of an AH for sure, but why couldn’t you just say “I’d like to keep our potential name choices private”? Why play these silly games? As an adult (and a parent) you need to be more assertive and learn to shut people down when they don’t take no for an answer.", "NTA\n\n**LOVE your husband's sense of humor!!**\n\nAnd these entitled non original AH's got exactly want they bargained for by pestering you and stealing your (fake) baby name!\n\nWhat would have happened if the OB/GYN hadn't spilled the beans....", "Why couldn’t she pick out a name herself? And if the cousin can cuss you out on the phone, he can handle his baby’s name being a cuss word. NTA.", "NTA first of all that's hilarious, second of all she sucks for clearly trying to steal your baby name and doing no research at all beforehand.", "NTA. Ha ha ha", "It’s hilarious but people really are like this. We have a “friend “ who married another friend’s ex bf “cause he was available”. Picked the same dress another friend had picked, but that friend was like fine, I’m getting married first so people will see it first on me and wonder why she’s wearing the same dress. And she picked the same invites that another friend was taking a day to confirm with her fiancé that it was what they wanted. She just told her to her face at the store she was going to choose that invite. Our friend had enough and just quietly picked something else without saying anything so that girl couldn’t say she wanted that instead. Truly insane some people out there.", "NTA. OP, next time you should tell someone this pushy that your kid's first name will be \"Smitty\" and the middle name will be \"Werberjaegermanjensen\". That should shut them up.", "This is awesome.  Well played.", "Let me get this straight... she bugged you and bugged you to find out what you'd name your potential daughter with the clear intention of \"stealing\" it (no one can really steal a name but it can still be an AH thing to do) and then got upset when it turned out you were joking (kinda)? That sounds like her problem. \n\nIf she really cared about the name I think she'd at least look up what it means before deciding on it. That's why I think she only wanted to use it to spite you. Stupid games, stupid prizes.\n\nNTA", "NTA it’s not your fault that they purposely used a name they thought you wanted and were to stupid to research the meaning", "INFO\n\nSome things aren't adding up here for me. \n\n>Being friends, Roxy and I compared notes, but she also kept asking what I’d go with name-wise. \n\nWhy aren't you sharing this with your friend? \n\n>I told her she’ll find out when my baby comes.\n\nThat implies to your friend that you have at least one name in mind. \n\nIf you simply didn't know yet, then why not just tell her that? This seems like withholding information but for no reason? Of course that's going to annoy your friend. \n\nI'm not opening the jar of worms that is the fake name and then your friend using that name for her own kid, but it seems like the crux of this post rides on that earlier interaction.", "NTA.    That was funny.  She just wanted the name you picked", "NTA Karma. Reap what you sow. My mother told my brother what I was going to call the my baby, but his wife gave birth first and they stole the first and middle name! it is 30 years later and I'm still salty. Guard your baby names people!", "NTA\n\nI almost convinced someone to name their daughter Jezebel for the same reason.", "NTA. She demand an answer and you gave her one.", "NTA\n\nYou reap what you sow. Totally not your fault here.", "I felt a little guilty laughing at this story, but since this woman seemed determined to steal your \"girl name,\" I think it's hilarious. \n\nHonestly, most moms-to-be will at least Google a name, *even those they stole.* Guess Roxy missed the memo!", "NTA. Wow they sound like horrible people. Good for you and your husband tho!!!!", "NTA but you don't sound like you're really friends.\n\nA real friend wouldn't pester you to death about something this ridiculous and certainly wouldn't steal the name out from under you.\n\nShe got what she deserved.", "NTA - She was only asking to steal the name. This has honestly made my day that she got comeuppance for what she thought was a slick move.", "NTA  \nToo bad they found out early though, this would've been even more hilarious had they actually tried to register that name  \nThis is brilliant.", "NTA I'm currently 32 weeks pregnant with a girl. We picked out names and people have asked. The only reason why our families know the name is because I'm the only one having a baby. They asked about a boy's name and I told them. No one is willing to steal it since it's my SO's name with the junior title. I don't know why people think they should use a name someone else picked out. It is so idiotic.", "NTA", "NTA and that’s hilarious, did they actually put that on the birth certificate ?", "Is she really that insecure that she chooses to steal “your” name instead of going with the name she likes herself? It is not for a new hamster but FOR A BABY! You want to choose your own baby’s name right? \n\nI get you gave her a fake name. In my country almost everyone keeps the name a secret until the baby is born. It is even considered rude to ask a parent to be the name of the baby. \n\nSo big NTA. And I hope Mierda loves her name given by her mom in a petty move.", "NTA, and I'm still laughing!", "A case of fuck around a find out.. done so amazingly well. \n\nNTA. The dildo of consequences never arrives lubed.", "ESH. What she did or didn't do with the name doesn't change the fact that you were an asshole. You could have simply said \"I would prefer not to say, let's drop it\" and that would be the end.", "NTA, karma's a bitch", "No. You didn't know she was going to steal the name. If it wasn't a bogus name, and you gave the real one - I'd be pissed they used my girl name. So no, it's on them. They should have looked into the name meaning before actually deciding on it. I was picky about names - looking at initials, thinking of nicknames, alternative meanings, etc. They were lazy and stole a shit name. Not your fault. Nta", "NTA. you probably should have confronted her directly about her… pestering, but it gave me a giggle to read. karma is indeed a bitch.", "I totally chat names with my OBGYN and her nurse. I ask her what’s popular this week. Not unheard of to share the name. \n\nSounds like friend just wanted to name steal. \n\nI’m the opposite, I’d like to use something someone else isn’t.", "Im guessing after the cousin gave birth her ob asked if they had a name picked out. They probably shared the name and the ob informed them of its means.", "I kept my sons name a secret my entire pregnancy. My OB office asked me EVERY visit what his name was. It’s not unusual. It’s conversational and most people want to talk about it.", "I'm right there with you lmao", "Honestly though did the friend seriously not look up the name. Even though I don't have kids if close friends or family members have babies I get curious and look up the meaning of the name. The friend in this situation is more to blame for 1 pestering about a baby name and then not doing research on it. Not to mention blowing up at OP when they didn't do anything wrong.", "🙄🙄🙄", "Yeh exactly, she sounds like a terrible friend. OP I would just cut ties and call it good. I wouldn't want someone like that around me and my family. I can't stand people who act like life is a competition. Which is why I never make announcements, for anything. I just make my moves. That way if I change my mind no one can say shit about it, and this right here, people are shady. She acted with full blown malicious intent, and then tried to play victim. NTA.", "A LOT of people don't share baby names before the baby is born, for a multitude of reasons. Some don't want other people \"stealing it\". Others don't want people judging it. Or they just want it to be private between them and their partner. They don't want monogrammed gifts. They want to reserve the opportunity to change their mind at any point. There are people who pick out a name and then when the baby is born go \"No, I think he looks more like an X...\"", "My wife and I have just had a beautiful daughter, we told only our parents the sex and nobody knew the name beforehand. This was because it was something special for us and made no difference to anyone else.\n\nWhat you name or intend to name your child is nobody else's decision but yours (mother and father). \n\nThe \"friend\" should have been respectful in the boundaries created by not mentioning a name. And this is the kind of joke I'd say to someone too... oh yeah I'm gonna call my son Bort, or something equally ridiculous and jokey.", "Given that Roxy stole the fake name, don't you think maybe OP wasn't willing to tell Roxy the names because she knew that would happen?", "She did at least 8 times before giving a fake name on the 9th ask. NTA", "Exactly what I wanted to say  ;)\n\nAnd sorry, but isn't mierda or it's french version merde a pretty well known word worldwide?", "I never said two words to the OB that delivered my baby. But I'm hoping for the kid's sake that this conversation happened before the birth certificate was filled out.", "She says she asked 9 times. She does not say she ever asked her to drop it. There's also the moving parts of eventually finding out she was having a boy in between.", "Any reasonable person would get the hint to drop it after that many times. The friend got what she deserved.", "Doesn't matter. So this person might not be reasonable, OP still acted like an asshole.", "It isn't OP's fault \"no\" wasn't taken for an answer and friend kept pushing.", "OP's not responsible for whatever insecurity a grown woman has that causes her to desperately ask a friend her baby's name and then use that name herself without even trying to find out herself what dignificance that name has. It's clearly not an English name, so if she was curious of the meanin, she could have looked it up herself. Don't act as though the friend has no agency to be able to make decisions herself."]}