{"id": 11070, "submission_id": "11dgbug", "title": "AITA because I won't cancel my vacation to attend my sister's surprise wedding?", "selftext": "My sister and her fiance plan on getting married in a couple of weeks. That's great. He makes her happy. They sprung this on us about a month ago. They don't want a big production so it will be a small wedding and reception. Maybe 40 people all told. \n\nI have spring break in a couple of weeks. I have been planning my trip since last fall. \n\nI told her I could not attend. She asked why. I said I was going to be on vacation that week. \n\nShe thinks I'm being an asshole for thinking my vacation is more important than her wedding. She got our parents involved. So I told them I would cut my vacation short to attend the wedding if she paid for my theater tickets I'm not going to use and any cancellation or rebooking fees. They said that they would pay.using some of the money they were planning to give her for the wedding. She said I was being petty taking their money. So I said fuck it and I'm not changing my plans.", "created_utc": 1677516223, "permalink": "/r/AmItheAsshole/comments/11dgbug/aita_because_i_wont_cancel_my_vacation_to_attend/", "score": 41, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My sister planned her wedding for the time I would be on vacation.  Now she wants me to cancel my plans. Our parents agreed to help me pay what it costs to cancel. But they were going to use money they were going to give her for her wedding.  I might be the asshole because she said I was pretty to accept the money so I'm just going on vacation.  I'm not changing any plans or taking any money.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA  An invitation is not a summons.\n\nYou asked for a reasonable compromise and she chose to show her ass.  She can have her wedding without you.\n\nSend a nice post card letting her know you're thinking of her.", "NTA. This is why you don't do surprise weddings.", "A short-notice wedding is the same as a long-distance wedding - inconvenient for people and you can't expect everybody to be free at short notice, the same way you can't expect everybody to be free/want/afford to travel. If you being there was important to her she should have liaised with you about the date. People getting married need to understand everybody else's lives don't stop just because they are getting married. NTA", "NTA, she's making lots of demands for something that's supposed to be not a big production.", "NTA. Your parents were nice enough to offer a solution to this conflict your sister created.  Since you mentioned spring break but also an expensive trip I assume you are a teacher or maybe a working student? So your sister couldn't have been surprised that you would have plans for that time.  You could offer to attend if she rescheduled.", "NTA.  You offered a compromise and she rejected it.  Maybe she should grow up and realize weddings are usually announced months in advance for a good reason.", "It's not about whether it is \"more important\", it's about it being a *prior commitment*. If she can't see that, the hell with her. Expecting everyone to drop everything at such short notice is absurd. \n\nWhat's the big hurry anyway? She up the duff?\n\nOh and NTA obviously.", "So it's so important that you be there until it costs her money, and suddenly you caring about money is petty. \n\nDefinitely NTA. Enjoy your holiday!", "NTA, and stay firm and don't go, it'll be a much more enjoyable week that way.\n\nThere's a reason wedding invites typically get sent out 6-12 months in advance depending on the circumstances.", "NTA\n\nYou made a good decision.", "NTA\n\nDepending on how much changing plans will cost you, you could also make it your wedding gift.\n\nHaving said that, \"No,\" is a complete sentence and answer to unreasonable demands.", "NTA, and this is why people send out \"save the date\" so people can plan their time. I had a baby just a couple of weeks after my cousin. We discussed christening dates since we had cross over guest lists. Like normal caring people.", "NTA - if she wants everyone to attend, she needs to let everyone know with more time in advance.", "NTA! Why would you change your plans in the first place? You’ve had this vacation planned for months. If you scheduled a vacation after you knew the date of her wedding, then I would say you are being an ass. I’m sure as soon as you learn the date you let them know that you were going to be out of town. They didn’t check with you in advance to see if you would be available. Why do people make this assumption that we are at their beck and call? NTA for real. Go on your vacation.", "DELETED: Forgot Spring Break is an American academic break with fixed time.", "NTA. Surprising everyone with a special event means accepting that you may have guests unable to attend. If you want someone special to attend it’s best to casual ask what plans they’ve got coming up and planning around them. \n\nThis is going to be brought up at every opportunity tho so be prepared.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister and her fiance plan on getting married in a couple of weeks. That's great. He makes her happy. They sprung this on us about a month ago. They don't want a big production so it will be a small wedding and reception. Maybe 40 people all told. \n\nI have spring break in a couple of weeks. I have been planning my trip since last fall. \n\nI told her I could not attend. She asked why. I said I was going to be on vacation that week. \n\nShe thinks I'm being an asshole for thinking my vacation is more important than her wedding. She got our parents involved. So I told them I would cut my vacation short to attend the wedding if she paid for my theater tickets I'm not going to use and any cancellation or rebooking fees. They said that they would pay.using some of the money they were planning to give her for the wedding. She said I was being petty taking their money. So I said fuck it and I'm not changing my plans.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  I guess she got the surprise.", "Look, technically NTA. \n\nBut this is the hill you want to die on? College spring break? This will be brought up for the next 20 years. \n\nLet your parents pay the difference. Do the half vacation. Go to your sisters wedding. Or don't, but be prepared to never stop hearing about it until you're both in your 80s.", "ESH - yes you're absolutely allowed to go on your previously planned vacation, but most would consider it an AH move to skip a major family event like a sibling's wedding.\n\nShe should have checked with immediate family around timing if she was going to make this big of a deal about it.", "NTA.And you did the right thing. Hope you have a good vacay. What's the rush on the wedding? It seems very odd that a wedding would be thrown together so quickly.", "NTA on the basis that you tried to find a reasonable compromise. Family is important, but that also means your sister needs to treat the rest of you as important too. If she have you guys a choice of dates to make sure everyone important could attend, that would have been ideal. But they were thoughtless and now need to pay the price.", "NTA, and  pretty sure spring break is one of those events that everyone should know about. Yes, it's different weeks in different areas, but it's still happening. It's curious that your sister didn't consider something like spring break for not just your attendance but others as well.", "Ha!  Probably an \"I hate drama\" person too, who yet somehow is  always surrounded by drama.", "Fixed is generous here - could be any week in March.", "It does not sound like your typical college spring break. They have theater tickets, not wet Tshirt tickets. Depending on the show it could also be a once in a lifetime event.\n\nNTA. If the sister wanted all her family there, she should have consulted them before planning her last minute wedding", "Of course. I hate drama but for whatever reason there's always drama around me 🙄.", "That's it!"]}