{"id": 11248, "submission_id": "11fi1cb", "title": "AITA for essentially leaving my family in poverty?", "selftext": "My husband and I moved in with my parents about 5 years ago when we moved home from out of state. The plan was for us to stay (not for free!) for a few months while we looked for a place. However, we quickly found out my parents were in a major financial bind and were at risk of losing their house. We all agreed that we would stay for a couple years and split bills 50/50, allowing them to catch up and us to save for a down payment to buy a home instead of renting. \n\nMy husband and I fronted about $2500 to catch all the bills up. We gave my mom a set amount monthly towards bills. Multiple times, we would find out that the bills were not paid and things were about to be shut off, and have to pay large sums to keep things like the electric and water on because my mom didn't have the money. \n\nFast forward to now, my parents have divorced. My mom left my dad (55M) with the house, which he wanted, and my brother (32M) moved in. When this happened, my husband and I took over all the bills except the mortgage, which results in roughly a 45/55 split, with us paying 55% of the bills. My dad doesnt work and hasn't for about 7 years since he was laid off, because he claims he is disabled. He has a hard time getting around and is in a lot of pain most days. He has tried to get disability assistance from the government and keeps getting denied. My brother works full time, but choses a lower paying job because \"it's easy and he has a too much of a temper for anything else\" (his words, not mine). \n\nWell, my husband and I are done. We want our own space that we control. I must say it has not been a peaceful five years. My dad wants complete control of everything in the shared living spaces, and it always has to be his way. He doesn't respect us as equals. We also want to have children in a few years, and I cannot (or will not, anyways) raise children living in a basement.\n\nThe reality is that my brother cannot afford this house alone. They are consistently broke now, paying less than half. When I move out, I expect that utilities will decrease some, but not entirely of course. I will essentially be leaving my brother and my dad in poverty. My dad makes comments all the time about how no one will \"help\" him; but people have been for years and the reality is with inflation people can't afford to finance them. He often asks me to buy him things he wants for sale online or to buy him takeout food. He's not very appreciative and thinks because I am his child I owe him the things I have. He guilt trips me when I say no. My brother is perfectly fine sharing finances with him but I'm not. I want my own life and my own family. \n\nWe are planning on moving in November or December. To be clear, we are moving. I am beyond over this living arrangement and I think my husband would grow to resent me if I asked him to stay any longer (rightfully so, IMO). So- AITA?", "created_utc": 1677704696, "permalink": "/r/AmItheAsshole/comments/11fi1cb/aita_for_essentially_leaving_my_family_in_poverty/", "score": 55, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the asshole for getting a home with my husband when doing so would leave my dad and brother in a bad financial situation?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, Save yourself and your growing family from the toxic situation. They are aware of the living arrangements that are changing and have 8-9 months to make adjustments.", "NTA - You helped out beyond what should have been expected from you and they have proven that they cannot handle their finances or support their lifestyle.\n\nIt sucks that they will lose the house, but getting a job could prevent that. They made their decisions, now they have to live with them.", "It sounds as if you and your husband have gone above and beyond and have been very generous. NTA.  Get out of there!", "NTA. They can sell the house once you move out and get a smaller place or a rental. My fiancée and I recently went through this with my mother. Take my advice, get going asap and don’t look back.", ">My mom left my dad (55M) with the house, which he wanted,\n\nNTA your dad wanted the house, he can figure out how to pay for it.", "NTA. You’ve already gone above and beyond to help out. You and your partner are certainly entitled to find a place of your own, and your father is not entitled to keep you where you are (or to anything you have). \n\nYou’ve spent 5 years helping out, and he hasn’t found a solution other than to keep depending on you. Time to move on with your life.", "NTA you need to do what’s best for yourself and your husband and your family needs to learn to pay their shit themselves.", "NTA. Especially because you're giving them MONTHS of advance notice. It's completely understandable that you're over it. It sounds like your parents were draining you of money and there's no way of knowing where it even went sometimes. You don't owe them that.\n\nI wish you the best of luck with your move and I hope it eases your frustration completely!", "NTA. Not sure you even need to stay so long given the situation. Let them know you'll be leaving so they can try to work something else out (like finding a tenant/housemate). \n\nGo enjoy your life with your husband.", "NTA. Your parents are adults. They had time to figure things out. You are not their bank or retirement plan. Something like this happened to my family and my sister unfortunately gave in. It was a major factor in her divorce, and she almost went bankrupt. Protect your marriage and future. Make hard boundaries now and stick to it.", "NTA....I don't see how any of this is your problem. Move out and enjoy your life.", "NTA. \n\nYou have helped them so much, and your father still does not treat you with basic respect? I value taking care of my family above almost everything, but even I would have left that situation long ago. He cannot expect you to pay for most of his expenses and not even give you equal say over what you are paying for, that's ridiculous. It's unfortunate your brother will be in that position now, but he has the option to move on and start his own life just as you are. \n\nDon't set yourself on fire to keep your father warm. Don't sacrifice your own life to subsidize his.", "NTA. Run far and run fast.", "NTA\n\nIt's tough that your family is in this financial situation, but it isn't up to you and your husband to subsidize your father and brother's living situations.  They are adults, they need to figure out their own finances.\n\nAside from that, it realistically doesn't make sense for you to stay considering your future plans to have children would lead you to move out at some point in the near future anyways.  \n\nI'd just say make sure you give them a good amount of notice so that they have some time to figure out what they are going to do moving forward (they may need to get a housemate or sell the house or something).", "You spent five years of your life helping, and you didn't have to do that. You certainly don't have to spend any more time subsidizing your family.\n\nI've been in a similar situation, and I understand the feeling of guilt -- at the same time, everyone in this situation is an adult with full control over their lives and 100% their own agency. It isn't your responsibility to take care of your brother or your father, it's their responsibility to take care of themselves.\n\nIf they can't afford this house, they can *sell it and buy one they can afford.* It's likely appreciated considerably in the five years you've lived there, paying the mortgage without getting any equity of your own. They'll be fine, and you're NTA.", "NTA - wow that is awful. Your parents were leeching off of you and being manipulative of your good nature and sense of obligation. Enough is enough.", "NTA, You have done more than most to help, they have for whatever reason not kept up with things, even with you paying the bulk of the bills.  It is up to your father to figure this out and not put your life on hold any longer.  Your not obligated to maintain your father and brother when they aren't doing all they can to take care of themselves.  It really seems as though they think of you and your husband as their cash cows.", "This was never intended to be forever, and you are giving 8+ months of notice. Many, many people end up having to sell their home when they get divorced, and it sounds like your father is about to join those ranks. It is always hard to have that happens, but that is a function of your parents' divorce, not your move. Divorce sucks, but it isn't the kid's fault. NTA", "NTA\n\nYour father needs to tell your brother, he needs to swallow his bullshit excuses and find a better job, and pay more if he wants to live there.\n\nHas he tried to get a disability lawyer to help him get disability? If not he needs to do so and find one that only gets paid when he gets approved.\n\nOtherwise they are adults and not your problem. \n\nYou need to do what is best for you and your husband.", "NTA- You did your best to help out your family, but it's time for you to do what's going to be best for you and your husband.", "NTA. Move sooner and be prepared to cut your family fully off for quite a while. \n\nIf any bills are in your/your husband’s name, start getting them moved into your brother’s/dad’s name now. \n\nWhatever your dad’s actual issues are, he and your brother are leeching off of your work and they’re going to have to either step up or fall farther down, but they need to do it for themselves.", "NTA\n\nYou have given them plenty of notice you are leaving which gives them lots of time to figure out a plan. They can also find someone to rent the basement once you are gone, and that should help with income.", "NTA and I'd plan to move much sooner than that so your family can't sabotage you.  Move important stuff to a storage unit and make sure you've got password protects etc on all your financial accounts.  Run your credit reports and make sure your family didn't take out anything fraudulently in your or your husband's names.  Get a po box fir your mail so they can't intercept it", "One does not have children to be a piggy bank later.\nNTA.\nThey reaped what they have sown and you gave them 5 years.", "NTA, I had to bail my parents out of many financial problems as I got older. They lost their home. I ended up buying a two family and they lived with me. Had to pay for my parents to keep their car because they were so far behind. It caused me so much stress. My mom died a couple years ago and I told my dad i couldn’t do it anymore. I couldn’t keep taking care of him. After a lot of toxic behavior I had to cut him off completely. You’re not responsible for them, you tried your best. Take care of yourself.", "NTA. As a mother, I would never expect my daughter to take care of me. And it sounds like they are not good with money which is not your fault.", "NTA \n\nRun. Now. Focus on your husband and marriage. Get away from your Father. He can work it out", "NTA. Run. Run now.", "Nta...", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I moved in with my parents about 5 years ago when we moved home from out of state. The plan was for us to stay (not for free!) for a few months while we looked for a place. However, we quickly found out my parents were in a major financial bind and were at risk of losing their house. We all agreed that we would stay for a couple years and split bills 50/50, allowing them to catch up and us to save for a down payment to buy a home instead of renting. \n\nMy husband and I fronted about $2500 to catch all the bills up. We gave my mom a set amount monthly towards bills. Multiple times, we would find out that the bills were not paid and things were about to be shut off, and have to pay large sums to keep things like the electric and water on because my mom didn't have the money. \n\nFast forward to now, my parents have divorced. My mom left my dad (55M) with the house, which he wanted, and my brother (32M) moved in. When this happened, my husband and I took over all the bills except the mortgage, which results in roughly a 45/55 split, with us paying 55% of the bills. My dad doesnt work and hasn't for about 7 years since he was laid off, because he claims he is disabled. He has a hard time getting around and is in a lot of pain most days. He has tried to get disability assistance from the government and keeps getting denied. My brother works full time, but choses a lower paying job because \"it's easy and he has a too much of a temper for anything else\" (his words, not mine). \n\nWell, my husband and I are done. We want our own space that we control. I must say it has not been a peaceful five years. My dad wants complete control of everything in the shared living spaces, and it always has to be his way. He doesn't respect us as equals. We also want to have children in a few years, and I cannot (or will not, anyways) raise children living in a basement.\n\nThe reality is that my brother cannot afford this house alone. They are consistently broke now, paying less than half. When I move out, I expect that utilities will decrease some, but not entirely of course. I will essentially be leaving my brother and my dad in poverty. My dad makes comments all the time about how no one will \"help\" him; but people have been for years and the reality is with inflation people can't afford to finance them. He often asks me to buy him things he wants for sale online or to buy him takeout food. He's not very appreciative and thinks because I am his child I owe him the things I have. He guilt trips me when I say no. My brother is perfectly fine sharing finances with him but I'm not. I want my own life and my own family. \n\nWe are planning on moving in November or December. To be clear, we are moving. I am beyond over this living arrangement and I think my husband would grow to resent me if I asked him to stay any longer (rightfully so, IMO). So- AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Run as if your pants were on fire.", "Nta. Time for your brother to get a better job. And for your father to go back to work. Not your problem. Leave by this summer.", "NTA Time for your dad to sell the house and get something he can maintain with your brother.", "NTA. You can't save ~~idiots/~~people from themselves. Your dad & brother are adults & will have to figure out how to live. Not your circus, not your monkeys.", "NTA. Your mum left already, I don't think you're obligated to stay and foot the bill either.", "NTA brother can use the next few months to work on his temper and get a better job. Dad can find some kind of job, too, even if part time. You don't need to sacrifice your future for people unwilling to work. Mom escaped, you should, too", "NTA you let this go on for way to long.", "I am going against the grain and say ESH. Them for mooching and being unappreciative, you for how you essentially say your father isn’t disabled (use of the word claims) and that your brother is just useless because he can’t do a higher paying job, implying this is just an excuse and not something he genuinely struggles with.", "\\^ This 1000%. All of it.  If they're faced with losing the house, desperation may make then do \"unthinkable\" things."]}