{"id": 1143, "submission_id": "ylx3ah", "title": "AITA for throwing my moms stuff out after she insulted my sons sexuality?", "selftext": "Starting off this off strong with my mom being a very conservative “jesus loving” woman, the apple fell far from the tree with me. \n\nMe (male 40) and my mom already have a little bit of a rocky relationship because of my religious beliefs, I am agnostic,(when someone believes they do not know wether god exists or not) \n\nMy mom is the type of person to try and trap you in her beliefs, \n\nWell, *despite all that*, she’s divorcing my dad and going through the divorce now, and she left the house, she came at my doorstep the other day while my son was at school asking to stay. \n\nI wanted to say no, but against my better judgment I let her, I don’t think I should’ve let her in the first place. She would only be staying with me for the night so she can go see her family in Connecticut. \n\nMy son is bisexual, and has a boyfriend, his boyfriend usually come over after school. They study here, and it stupidly crossed my mind that he would be coming over. \n\n he ended up coming home, with his boyfriend, he’s aware of my mothers belief. \n\nI was stuck, trying to avoid an argument I just said that they would be studying together and left it at that. \n\nWell I guess when he was leaving they kissed and my mom saw it, came to me fuming asking if I knew about these “sins” going on under my roof. I reminded her under this roof those aren’t “sins” and it’s my house? \n\nMe and my mom went back and forth, the argument consisted of her saying that this was way to far, he is only 16 and these phases shouldn’t be supported, and me just saying to zip it and act like an adult about this and not traumatize a child or don’t let the door hit you on the way out. \n\nIt wasn’t until she decided to go to my son impulsively in the middle of my argument, telling him he is unmanly and emasculating himself acting like a woman, She said that he needs to stop trying to use woman’s people for themselves (no clue what that meant) and that he looks like a fool spreading the image that he’s some feminine *male*, she tried saying he’s going to hell but I walked her out of his room. \n\nI told her to get her stuff and find a new place to stay.  She argued that she was just saying it like it is it’s a sin, I said if she wanted to focus on sins focus on hers with divorcing her husband  and we went back and forth for over thirty minutes of me trying to get her out of my house. \n\nFed up,  I grabbed her bags, put all her stuff in them, tossed them outside and told her to get out or I’ll get more extreme with this. \n\nI called my sister to come pick her up, she was waiting for 15 max, moms made it a point to tell the whole family, and they told me that doing that was an asshole move because they made *her* uncomfortable because we knew her beliefs. \n\nI don’t think that’s right at all, their reasoning is a no IMO, but solely for what I did, AITA?IMO my only dumbass move was letting her in", "created_utc": 1667563151, "permalink": "/r/AmItheAsshole/comments/ylx3ah/aita_for_throwing_my_moms_stuff_out_after_she/", "score": 2185, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My asshole move could’ve been throwing her stuff out and making her sit out in my lawn because she wouldn’t leave.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Absolutely NTA!!! Respecting someone's beliefs doesn't mean you have to let them do whatever they want when they're in your home!", "NTA.    Your last line made me laugh.", "NTA but you know that. Good job mom", "NTA it is your house and good for you standing up for your son. Hope he is ok", "NTA.\n\nShe is family though, you could extend the olive branch. At a drag brunch. Lol", "Moderate conservative here (libertarian), NTA. You’re allowed to have whatever rules in your house that you want. Your son is allowed to date whatever sex he wants as well. \n\nYour mother tried to impose her own thoughts and feelings on another person while being a guest in your house. It’s her fault she has to find somewhere else to stay.", "NTA\nGrama sucks.\nGet a rainbow flag for the front porch.\nMaybe it will work like garlic works on vampires and she'll stay away.", "NTA\n\nMy 16yo is gay and I'd kick anyone out of the house who acted this way towards her, my own mother included. Thankfully my mom is an ally as well. \n\nGood for you for standing up to bigotry and your son.", "NTA. Good on you for standing up for your son. Your mother is a typical loudmouth 'christian' complaining about others' sins and ignoring her own.", "NTA x 1,000  I am so glad that your children have you as a father.\n\n\nEdit to correct the OP's role.  I didn't read closely enough, and as a mom, I assumed.", "NTA. She claims to be a Christian but clearly skipped the verses about not judging or loving one another. \n\nI'm glad your son is raised by a parent like you and not her.", "edit: THOUGH in all fairness, I literally don’t know what else I could’ve done \n(despite not let her in At all) \nwithout getting police involved.", "NTA. Bigots get the boot. Think of it this way--at least now it'll be much easier to go NC after this. And your extended family told on themselves.", "NTA. Next time tell your mom that the Bible says to follow the rules of the land and while on your land you make the rules.", "NTA. There's a hypocritical choosing beggar AH in this story and it's not you.\n\nShe disrespected your rules in your house, even while you were doing her a favor. She couldn't zip it for 24 hours. Even if she disapproved she could have went to her room and shut up until the morning. Or left of her own accord.", "NTA. Good riddance and good job, mom.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nStarting off this off strong with my mom being a very conservative “jesus loving” woman, the apple fell far from the tree with me. \n\nMe and my mom already have a little bit of a rocky relationship because of my religious beliefs, I am agnostic,(when someone believes they do not know wether god exists or not) \n\nMy mom is the type of person to try and trap you in her beliefs, \n\nWell, *despite all that*, she’s divorcing my dad and going through the divorce now, and she left the house, she came at my doorstep the other day while my son was at school asking to stay. \n\nI wanted to say no, but against my better judgment I let her, I don’t think I should’ve let her in the first place. She would only be staying with me for the night so she can go see her family in Connecticut. \n\nMy son is bisexual, and has a boyfriend, his boyfriend usually come over after school. They study here, and it stupidly crossed my mind that he would be coming over. \n\n he ended up coming home, with his boyfriend, he’s aware of my mothers belief. \n\nI was stuck, trying to avoid an argument I just said that they would be studying together and left it at that. \n\nWell I guess when he was leaving they kissed and my mom saw it, came to me fuming asking if I knew about these “sins” going on under my roof. I reminded her under this roof those aren’t “sins” and it’s my house? \n\nMe and my mom went back and forth, the argument consisted of her saying that this was way to far, he is only 16 and these phases shouldn’t be supported, and me just saying to zip it and act like an adult about this and not traumatize a child or don’t let the door hit you on the way out. \n\nIt wasn’t until she decided to go to my son impulsively in the middle of my argument, telling him he is unmanly and emasculating himself acting like a woman, She said that he needs to stop trying to use woman’s people for themselves (no clue what that meant) and that he looks like a fool spreading the image that he’s some feminine *male*, she tried saying he’s going to hell but I walked her out of his room. \n\nI told her to get her stuff and find a new place to stay.  She argued that she was just saying it like it is it’s a sin, I said if she wanted to focus on sins focus on hers with divorcing her husband  and we went back and forth for over thirty minutes of me trying to get her out of my house. \n\nFed up,  I grabbed her bags, put all her stuff in them, tossed them outside and told her to get out or I’ll get more extreme with this. \n\nI called my sister to come pick her up, she was waiting for 15 max, moms made it a point to tell the whole family, and they told me that doing that was an asshole move because they made *her* uncomfortable because we knew her beliefs. \n\nI don’t think that’s right at all, their reasoning is a no IMO, but solely for what I did, AITA?IMO my only dumbass move was letting her in\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You are a good mom and youre proyecting your son from her toxic beavior.\nShe its Lucky you don't call the police because she dont wanna go outside your House.", "No no - you're NTA. Your responsibility was to your son and you took the action necessary to not just protect him, but to make sure he knew that you would. Your mother sounds horribly toxic - unfortunately like a great many people of my religion. \n\nHold the line here - it will no doubt be more difficult moving forward.", "NTA WAY TO GO MAMA! You have every right to kick her out of your house", "NTA. You are a *fantastic* parent. All parents should stand up for their children like you have, even if it is to the child’s grandparents. \n\nYour mother was in *your* house. She had no right to be spouting her homophobic beliefs to anyone while she was your guest, especially after you told her to stop. And, once you told her to leave, she was trespassing. \n\nJust remember this in the future if she ever asks for anything again.", "NTA. Homie you defended your son. Your son and boyfriend can feel safe in your home knowing that you will look over them. You did good dad. Some damage control is for sure possible but I think you’ve got it.", "NTA, you are the mother all kids need.  Your mother and family on the other hand are major assholes. Seems like it is time to go NC.", "NTA by a country mile. Your son will be really glad to know he’s got you in his corner and will remember you standing up for him this way. Great job and I wish more LGBT+ people had parents like you!", "NTA. Protect your child. It doesn't matter what she believes, if she is coming to your home and asking for a favor, she doesn't get a say in how you live or how you raise your kid. \n\nI can kind of understand that she believes you're harming your child, but we both know better.", "NTA , i wish my mother is like you . i a teen male  from India closested is proud of you and hope one day my mother get same spine as you . \nNTA *10000", "NTA. She chose to die on the hill of her religion. While also picking the parts of it to suit her beliefs. You chose to protect your son. Well done. Homophobes don’t deserve a roof over their heads if they can’t keep their mouth shut.", ">moms made it a point to tell the whole family, and they told me that doing that was an asshole move because they made her uncomfortable because we knew her beliefs. \n\nThey just don't want her to have to stay with them. NTA", "NTA, but sorry i have to say your mom is one.", "NTA. You are doing what good parents do. Protecting and supporting your child. Your mother is an abusive, ignorant nasty old homophobic bigot. Keep her poison away from your son.", "NTA  \n\n\nThank you for protecting your son. You are correct that your only dumbass move was letting her in.", "NTA - Amazing job dad 👏👏👏 Thankfully my mother (nor grandmother) are like this. She's honestly lucky it was ONLY her bag being thrown on the lawn. If it had been me, mother or not, she would've been thrown out of my house like a drunk out of a bar. I hope your son is comfortable with himself and laughs this off, or is at least okay. People like her disgust me, you can have your beliefs but when you start berating others you either shut up or be shut down", "NTA\n\nAs a member of the LGBT community who grew up in an extremely conservative home.. thank you. Your son will remember how you went to bat for him.", "NTA.\n\nYour only mistake was letting her in.", "NTA. Your mother is a beggar, trying to choose. In your house, your rules go, and if you shouldn't protect your son, then who should? People are absolutely right to have no respect for \"religious\" people, who cannot behave as decent human beings. Unfortunately, your mother seems to be such a person.", "NTA. The only thing you did wrong was letting this woman inside your house in the first place, but this you're already aware of. Good standing up for your son!", "NTA. You're a good parent, and you supported your child appropriately.\n\nYour mother, on the other hand, is very much the asshole here. Good riddance.", "As a christian, theres nothing more infuriating than seeing other christians being homophobic and racists when we're supposed to spread love and positivity. \n\nNTA and congrats for being a great dad!", "OP is male. It says so in the post.", "Is there a reason you shouldn’t have done that, if she refused to leave even after having had it pointed out to her that she had no reason to assume you’d be on board with this idea, let alone show up without communicating with you first and just expect that to work out?  I’m sorry it took this to help you find your spine, but hopefully it’ll serve as inspiration to just say “nope, take this somewhere else; I’m not having it” once the ridiculousness starts up.  Like, say, with everyone chewing you out over not having rearranged your household to her liking when you never wanted her there in the first place, and *they* can take her in if it’s not a problem for them.", "Get the police involved next time or don't let her in.  She's verbally abusing your son in his own home.\n\nThe cat is out of the bag so it's time to place a line in the sand - either you unequivocally accept and celebrate my son for who he is, or you get out of our life.", "Op is male but yes good mom.", "OP is a male.", "OP is male. I’m not angry, but I’m curious to know why the assumption is OP is female. You’re the third person I’ve seen that assume he’s a mom despite saying he’s male. Why is that?", "I'm from India too. \nWe deserve such mothers😢", "Most people have a hard time calling the police on family. :/", "My bad…WAY TO GO PAPA!", "NTA\n\n&#x200B;\n\nWELl DONE. Great parenting. You protected your kid from that AH.\n\n&#x200B;\n\n\"IMO my only dumbass move was letting her in\" .. you are right there. Apologize to your son, and tell him she is unreasonable, and you support him.? (He will know anyway.)", "NTA, she may “love Jesus” but she sure doesn’t understand what he’s about!", "NTA at all, is your son OK? Good on you for standing up to her for him.", "As a parent of gay children, thank you for sticking up for your son. That's all you need to be concerned with, not some judgmental hag who can't even deal with her own relationship. If anyone came into my home and degraded my children, there would have been no 30 minute argument. Their ass would have been shown to the door very quickly. \n\nNTA", "NTA, good for you for standing up for your son.", "NTA for kicking her out and rightfully so. Definitely a soft TA for letting her in knowing her beliefs but I get it. She was desperate and you were hoping she would bite her tongue for 1 day until she left but now you know like most other hypocritical religious people she's a do as I say, not as I do type of person.", "NTA. You don’t have to respect or pander to bigots and their “beliefs”. They certainly never show any respect for those of others.", "NTA\n\nGoodbye grandma. Time to cut ties with her.", "NTA. \n\nAnd your family’s logic is flawed- if you should not have kicked her out because you knew her beliefs, the only logical conclusion is that she should have kept her mouth shut because she knows your beliefs. \n\nIf her imaginary sky daddy has a problem with gay relationships/ mere existence, that’s a her problem, not yours nor your son’s.", "Jesus condemned divorce, but didn't say a word about homosexuality. Point your mother to Matthew 7:5. NTA", "As a Bi guy, the \"Women's People\" part had me howling 🤣\n\nYou showed far more patience with her than I would have.  At the first sign of her holier-than-thou crap, my response would have simply been, \"In this house I AM God, now grab your bags Lucifer, we're casting you out.\"\n\nIf your family keep giving you lip, just tell them that you did her a compassionate act: You removed her from a place where such \"sins\" are tolerated.  If they try to say that your son should \"just stop being Bi\" then just count up how much money you'll save on Christmas cards and use it to buy yourself a celebratory burger or something.\n\nNTA x100.", "NTA. You're protecting your son which is exactly what you should do!", "Praise god! But keep bigoted mama away. When you are a guest in anyones home some respect is warranted and you got religious lectures. She should be more sensible at her age. NTA", "NTA\n\nI'm getting the vibes that mom likes to pick and choose which sins count, magically none of hers ever do.\n\nYour a good Father, you fight for your kids right to be themselves and happy.\n\nas for those in the family saying about her lack of comfort, she had food and shelter. As that is not her home that is as much as anyone should expect. Your son on the other hand (whose comfort doesn't count to them apparently), that is his home and he should never face insult to who he is whilst there.", ">Well, despite all that, she’s divorcing my dad\n\nAh, the \"do as I say, not as I do\" christian. Always a classic", "NTA\n\nYes it was wrong of you even letting her in the house.  If she was so uncomfortable then she should've just called your sister and told her to pick her up.  She didn't have to say a damn thing to you or your son.  Since she decided to act a fool that's on her, you did nothing wrong.\n\nGood for you for standing up for your son.", "NTA…why do religious people use that as an excuse to be homophobic? The bible is mistranslated from man shall not sleep with boy on purpose because of some homophobe paying off the translator. Im real tires of religion being their reason", "NTA\n\nIsn't divorce considered a sin, too? OK, maybe not in every flavour of their sky daddy book, but still the hypocrisy baffles me.", "Nta good for you sticking up for your son.", "It sucks when you grow in to your own person with your own beliefs, especially if you have a parent or parents who are religious like that. I'm in the same boat, except I do believe there is a definitive God, my mom is Christian and here and there will tell me she is sorry and hopes I change before the end times. It bothers me that my mom contemplates that I'll go to hell for not sharing her same beliefs but i still lover her. Gotta be honest though when I say i wouldn't want a gay son, but if I ever found out my mother was telling her own grandchild they'd go to hell for being gay I'd throw her out before her stuff. You're Not TAH.", "NTA  you protected your children from your mothers  evil ignorance. Goldstar, dad you are.", "Nta you protected your child. I mean, you could have said to her before the kid got home that he is bisexual.. So you Two could have talked about it. But for her to berate your child, no gotta go, Mom. N the fact she crying to the family they can all go fuck themselves too. \n\nBeing gay, bisexual, or anything else with your sexuality if it is a sin. It's between them and God. The lord was not passing out applications for people to judge others. \n\nThey need to mind their P's and Q's!", "Thank you. Thank you for standing up for your kid and his right to be who he is with the person he cares for in his safe space. \n\nNTA. Tell the people coming for you that they don't get to dictate either your house rules or your beliefs. They are welcome to take mum in themselves and if they don't like it, they should take a page from the book they claim to love so much. Judge not lest ye be judged.", "NTA\n\nI'm glad you are standing up for your son. You are a good parent. You did nothing wrong, aside from letting her move in.", "Well you have learnt one thing, don't let her over the doorstep next time, an she us certainly blind yo her own faults", "NTA I agree the only thing you did wrong here was letting her in", "NTA. Heavily religious people need to go fuck themselves", "You're right, the mistake you made was letting her in.\n\nSo much NTA op!\n\nYour son is in a safe space and it's kinda brilliant that his safe space is home!!!\n\nAnd please forgive yourself for that momentary lapse of judgment.", "NTA\nShe got a help in a moment she needed and decide to shit in it. Your first obligation is with your kid, you did great and I support you!\nEven if it was a sin, it's not her house. Those \"I call it like I saw it\" are a masking way to bring toxicity to everything near you.\nAnd she is first commiting a sin against her religion. Believe me if you really want to put on her level, the bible is more against divorce than homosexuality.", "NTA at all, I’m glad your son has such a supportive and accepting father. I really hope you talked to him after this and made sure he knew that what your mom said was bs.", "Nta, is divorce not also a sin?", "> we went back and forth for over thirty minutes of me trying to get her out of my house.\n\nIs she a sumo wrestler or something?\n\nNTA.", "As a bi woman, I thank you for standing up for your kid. NTA.", "NTA  Don't ever let her in again!", "the only A H move you did OP was letting her in.  \n\n\nNTA for kicking her out", "NTA-mom is though\n\nShe was in YOUR HOME, your sons home.  This is a safe place, a place of refuge and she defiled it with her \"beliefs\".  I applaud you for standing up for your son, your home and your beliefs.  and extra kudos for calling out her \"sinful\" divorce.  Keep setting and enforcing your boundaries.", "your son is beyond lucky to have a father like you! & he is going to remember/appreciate you sticking up for him for the rest of his life. NTA", "NTA. Thank you for standing up for your son and not letting him be victimized and disrespected in his own home.", "NTA- I LOVE how politely you put her out. 🤣\nYou accept and love your children and that is admirable. Even gma can’t bulldoze that relationship.", "NTA.", "Wow, it honestly warms my heart to read how you defended your son, even tho the situation was very unpleasant for you im sure, so many kids in the LGBTQ community are forced to deal with conservative grandparents constantly abusing & belittling them. And then otherwise “supportive” parents will tell them to just suck it up or ignore it because grandma is old, is from another generation etc. \n\nWell now that I’m an adult, I know there are tons of bi gay and trans people in older generations, tons of older folks (even Christians!) who are supportive, and there’s no excuse for being hateful! \n\nIt means a lot that you would stand up to your mom on your son’s behalf and I think he will be able to look back on this experience and feel grateful for having a dad like you. You gave mom a chance and she completely let you down, acted like a jerk in your home & insulted your son. No one should have to put up with that shit. \n\nThanks for being an ally. NTA", "We are all sinners. If she thinks other ways, that is blasphemy.  Does she eat pork that is also an abomination just like?  Does she wear slacks like men ?  He who is without sin may caste the first stone.  Ask if her actions are Christlike.\n\n Just telling it like it is.  NTA", "NTA sign her up to all the pride marches etc, whatever it is put her details down. \nPamphlets are bonus points", "NTA She also knew your beliefs. Didn't stop her from wanting to stay. The fact is, you stood up for your kid, which is vastly more important than her comfort. Personally I wouldn't have cared if she had to walk to Timbuktu, I'd have done exactly as you did.", "NTA.  You stood up for your son and for your beliefs.  Your mom is well aware of your beliefs.  She should have kept her mouth shut and been thankful you took her in in the first place.\n\nThere is no hate like Christian love.", "NTA. Tell them all she's free to practice her beliefs in her home because her blatant disrespect for your child will not happen in yours. Then block them all (including Mommy not so dearest) because they obviously agree with her and her horrible mentality.", "NTA Family does not have a right to hurt you. She should respect that it's your house, and his life to live how he wants. You tried to show her compassion, and she responded by insulting you and him.", "ESH except for your son. You suck for exposing him to her and she sucks for her double-standards.", "Nta.", "NTA.\n\nBye, mom, we'll be making a PFLAG donation in your honor....", "Nta. Your mom is the type of Christian tgat picks and chooses what suits her to believe in. \nShes filled with hate and judgement, when she should be focused on being a vessel of love and kindness. In the Bible, Jesus traveled with the worst of people and used his message to spread kindness and change the hearts of sinners. Your mom is more focused on her self righteousness then what it actually means to be a good Christian", "definitely NTA\npeople like this deserve to be alone for the rest of their life tbh", "NTA, your mom sucks very hard and she's a disrespectful guest.", "NTA Op your home should be safe for your son and his parent. Your mother made her bed so she can lie in it as long as it’s not your house again. Just for security concerns I would change the locks in case she copied keys or got a key to the house. Because of her thinking the way you all live is somehow wrong please get cameras in case she does something. With an entire family like your mother you will definitely need new locks and nice cameras if you can afford it. At the end of the day the safety and well being of you and your child matters more than the feelings of a bigot and so on.", "NTA bigots should always be discarded", "> to zip it and act like an adult about this and not traumatize a child or don’t let the door hit you on the way out\n\nExactly this,  at the very base minimum, beggars can’t be choosers. NTA", "Well done for being a fantastic father to your child. Nothing to discuss here. You did the right thing.", "NTA\n\nGood for you for kicking her out and supporting your child.", "NTA\n\nWhat you have is a bunch of people who are \"boat steady-ers\".  Your mom is entitled to disagree with how someone else chooses to live their life, but not entitled to not face consequences and repercussions of her yelling at people she disagrees with.    \n\n\nAll of these family members see that there's drama, boat-rocking, and they simply say \"Just appease her, just apologize.  Just steady the boat with us.\"  You don't negotiate with terrorists or grown adults acting like toddlers.", "It would have been so sweet if you had yelled “taste the rainbow, b*+ch!” as you threw her crap outside. I’ll never understand why some people weaponize the Bible and it’s teachings for their own purpose.  Whatever happened to love thy neighbor?  God dislikes hypocrisy and ugly. Nana stinks!", "NTA and thank you for protecting your son. He will always remember you protecting him. 🤍", "NTA\n\nYou did the right thing for your son. Your egg donor can go kick rocks.\n\nJust make sure she's never allowed back in your house or unsupervised around your son ever", "NTA. You extended kindness but your mom though being a hypocritical bigot was more important. Support your kid and let your mom seek help from her flying monkeys.", "NTA.", "Nta, simply say if she is such a godly woman, she shouldn't be getting a divorce.", "NTA.", "NTA but your mom and relatives suck and stop dealing with them and subjecting your son to their nonsense", "There’s no hate quite like Christian love 🤷🏽‍♀️ NTA. Thank you so much for standing up for your son", "Your house, your rules. NTA.", "You're correct. Letting her in was the only thing you did that you shouldn't have done. NTA. \n\n>they told me that doing that was an asshole move because they made her uncomfortable because we knew her beliefs.\n\nOh poor adult mom being harmed so badly by seeing a child living his life.", "NTA.  I would have thrown her stuff out and called the police while looking her dead in the eye and telling them a woman visiting your house who you had told to leave repeatedly, refuses to do so, and you need someone to remove her.", "NTA You're a good father and a good person. Also, your house, your rules.", "NTa\n\n\"Buh-bye. I'm sure since you did what god wanted he'll help you find a place to stay.\"", "NTA\n\n&#x200B;\n\nI always bring up that the phrase \"saying it like it is\" is just codeword for \"I want to bully and verbally harm them but not be held accountable for my actions.\"", "Excellent parenting, OP.  You fully became your son’s hero today, if you weren’t already.", "ESH except your son\n\nYou saw this coming and didn't do anything to prevent it. You could have reminded your mother of the ground rules.\n\nYour family believe your mother's discomfort is more important than your son's ability to live without judgemet or shame?", "NTA!! Not at all!! You are the supporting, loving parent your son needs. Go no contact with your Mom. Keep being kickass. \n\nFro. The queer adult still in the closet: the world needs more people like you.", "NTA at all, protecting your son from the hate and vitriol of his grandmother was and always will be the right thing to do and if the rest of the family doesn’t like it, tough luck!", "NTA.\n\nBigotry should be met with total and unrelenting intolerance.", "NTA\n\n\nI'm Christian but she clearly doesn't listen to the whole Bible. A good verse to remember is where Jesus said \n\n\n\nHow can you say to your brother, 'let me take the speck out of your eye' when all the time there is a plank in your own eye?    Matthew 7: 4\n\n\n\nWhy is she trying to call out others for sinning when she has her own sins to figure out. I don't call anyone else out because I still struggle with sinning daily. Your mother sounds like one of those judgemental \"Christians\" the type that gives Christianity a bad name.", "NTA. Good on you for drawing a hard line and defending your son!", "nta", "100% NTA - your house, your rules and good on you for sticking up for your son. If your mom was uncomfortable she could have got up and left, that's what sane people do.", "NTA. Similar to other Christian fascists, your mother isn’t very christ-like.", "NTA\n\nYour mother is a bigot and your family is full of BS. “But they were making her uncomfortable, wah wah wah!” Homophobes shouldn’t be coddled that way.", "NTA\n\njust... NTA. be that mama bear your son needs.", "NTA\n\nYour mother was an AH here.  You did gold supporting your son.", "NTA and you definitely learned a lesson- don’t let mom in!\nI’m sorry your son was treated like that by his grandmother, that is inexcusable.", "NTA. Your only mistake was originally agreeing to let her stay overnight. You knew how she was.", "Oh, dear. You are a wonderful father. You did nothing wrong. I’m sorry for her that she will have to miss being with you and your son. It is so sad that her religion will deprive her of that joy.", "NTA. Your mother and your family siding with her are the homophobic assholes.\n\nGood job standing up for your son, and please be aware he's now outed to the extended family if he wasn't before. Depending on how that side of the family is, think twice before going to family functions.\n\nYou're not the asshole for protecting your child. And certainly not the asshole for throwing out a homophobe from your son's home (what is supposed to be a safe place for him to come home to) who just happens to be his grandmother.\n\nI agree, your only mistake was letting her in in the first place.\n\nDon't open your door for her anymore. She's not worth it.", "NTA, and your mom and the rest of the family can get stuffed.  She was rude and presumptuous and nasty to you and your son in your own house.  Why does she deserve hospitality or respect if she gives none?\n\nAnd kudos to you for standing up for your son and making it clear that you have his back.  I have a trans son and some of his friends have no family support and it makes them miserable.", "NTA, sorry their grandmother passed so suddenly and they will never see her again.", "NTA\n\nShe acted as if she was in charge in your home. Your obligation is to protect and nurture your son above all.", "NTA. You stuck up for your son in his own home. Good for you!", "NTA. Thank you for standing up for your son. She made her Grandson uncomfortable by being a judgmental religious bigot. If they have so much of a problem with you not keeping her, why haven't they taken her in.", "NTA. who would want someone berating their child because of a weird belief. next time don't hesitate to Supplex her out that door.", "NTA honestly what is wrong without \"religious\" people? Don't answer that, I know it's a control thing, it's just insane to me that people are so lacking in self awareness", "NTA well done for sticking up for your son! What could have been a traumatizing event will hopefully now be a story about how you had his back. Every kid needs that.", "NTA.  I didn't see the part where your family was willing to take her in despite her beliefs.  I'm sure she was quite liberal with the \"my house my rules\" while you were growing up given her wackadoo beliefs.  Well, she set the standard.\n\nAlso, you are a fricking ROCKSTAR for supporting your son, especially letting him know that you'd go to mats for him no matter who it was.", "NTA\n\nMom’s religious beliefs do not extend to you, your home or your child.", "NTA, tell your family you realized you made a mistake and corrected it.  It is one you won't make again, as your mom will not be allowed around your family until they figure out how to fix their bigotry.", "NTA. If my mother acted like that about my child, I wouldn’t have even argued with her. I would have thrown her stuff straight out the door and told her to get TF out of my house.", "\"Those who bring trouble on their families inherit the wind. The fool will be a servant to the wise.\"\n\nProverbs 11:29\n\nYou did the right thing protecting your son from hypocritical bigotry. NTA.", "NTA.  Good job sticking up for your son.", "NTA!  How is the kid going to learn that there are consequences to actions?", "I’m going with a soft YTA, mainly because you let her inside of your home where she could criticize your son and his life. While it was nice of you to step up for him, the fact she was able to do it at all is shameful. \n\nYou are a good dad, but this reads as though you weren’t thinking about your sons well-being when you impulsively let her in.", "NTA. I hate it when people use their religion as an excuse for homophobia and bigotry. Thank you for standing up for your son. He needs you more than she does.", "NTA, do not let that woman back in your house or anywhere near your child, she is an abuser.", "Oh yeah, nice one. Religious muslim here, grandma can, with all due respect, shut up. Your entitled to your own beliefs, but you’re not entitled to force them upon others. How could someone treat their grandson like that?", "NTA. I am so sick of people trying to force their religious beliefs down everyones throats. And using it as an excuse for their horrible behaviour.", "NTA - it’s actually the opposite argument that your family should be making. She knew YOUR beliefs and still acted asked to stay with you. She should not have stayed with you if she couldn’t keep her opinions yo herself. You also have her a warning when she first came to you.", "NTA. She should not have gone after your son, period.", "NTA\n\nWhy are her beliefs and her comforts more important than yours and your son's ESPECIALLY in YOUR home?\n\nSeriously. Ask all family members who are calling it an asshole move.", "NTA - she was under your roof and rules not hers(since she doesn’t have one at the moment).", "NTA, you absolute legend 🌈 \n\nAs a bisexual person myself, thank you. The world needs more people like you. \n\nColette x", "NTA\n\nI think it's weird that some religious people get so offended when seeing LGBTQ couples together. God gave us free will for a reason and he's the only one who is supposed to judge people. Let people live their lives the way they want to as long as they aren't hurting anyone else and let God be the judge of what they do. I don't see how that's such a hard principle to understand.", "NTA. Though tossing the bags outside is a bit too far imo.\n\nFirst, she's a hypocrite. Unless she's divorcing for marital violence or cheating, the divorce isn't biblical.\n\nSecond, it's your home. Tossing the whole LGBTQ issue aside, this is someone disrespecting your home, how you run it, and your children. I'd act the same on the flip side of this issue if I let someone into my home to stay, and they started bringing over someone to have pre/extramarital affairs with.", "NTA Do not EVER let her move back in EVER. And limit any contact with your son. \n\nAnd dear Gods, make your screw up in letting her move in to your home up to your son ASAP.", "NTA\n\nWe live in a shitty world with a lot of shitty people who are held to a lower standard than good people.  Your son will always face adversity just for being who he is.\n\nBut he will always remember you going to bat for him and know that no matter what, dad is there for him, even against other family members.  That feeling of security is invaluable.", "NTA\n\nEverything about your mother is terrible, including the “just telling it how it is” (which is the most bullshit defense for misogynistic, homophobic, bigoted nonsense) attacking your kid, and then refusing to leave.\n\nShe should be uncomfortable with her beliefs, and your son deserves to be comfortable and protected in his own home. \n\nYour mother is lucky you packed for her.", "NTA - You protected your queer child from a religious bigot. \n\nA+ parent. I wish I had a parent like you growing up.", "Nta. Cut all contact.", "Honestly. I'm more tempted to say ESH, except your son and his boyfriend. \n\nYour mother sucks for the obvious reason of being a bible-thumping bigot. \n\n*You* suck for knowingly letting said bible-thumping into your home with a bi-son and thinking nothing bad would happen.", "NTA\n\nOh the urge to run up to people like this with a cross painted in Bisexual Colors while screaming \"Bi Catholics Rule!\" And \"God is Queer and loves all!\"", "NTA. You're a good father!", "NTA thank you for being a good dad and standing up for you son", "NTA - she sure talks a lot for a Bible loving woman. Doesn't she know she's not permitted to teach or exercise authority over a man?", "NTA. This sounds like it's your cue to go no contact. She's willing to get bigoted with your son in his own home, she should no longer be around.", "NTA. Glad you took the trash out asap.", "NTA for kicking her out but letting her in in the first place was unwise, though you seem to realise that. But hopefully by taking a stand against prejudice, you've shown your son that you have his back.", "NTA.  You acted like a supportive and protective parent.  Your mother is trying to inflict her religious views on you and your family. \n\nHindsight is 20/20, and  you should have told mom \"no.\"  But you did allow her to stay; heck she is your mom.  She couldn't be kind and appropriate for 24 hours?\n\nYou're being a terrific parent.", "NTA you are a wonderful parent. Your son will appreciate this now and always.", "That's a mighty big glass house she's throwing rocks in.  I guess when she commits a sin, it's perfectly ok.  The rules are for thee, not for me.\n\nThe hypocrisy of thumpers is something that will never be in short supply. They like to pick and choose which parts of the bible serve their personal agenda.  NTA", "NTA.  Your house your rules.  Intolerant people need to be met with similar intolerance.", "NTA. You're an excellent parent and your son will be better off now. Both because he knows how far you will go to defend him and also because he doesn't have to put up with that bigot.\n\nThis is a situation where you should not accept any communication other than a full apology and after saying that once you should ignore/block anyone who continues defending her.", "Bravo dad.  NTA", "Easy NTA. Grandma should go to church and pray for her own sins of breaking the vows of marriage. Good job defending your son.", "NTA. You've shown your son that you truly, deeply love him. That's the greatest gift you could give him.", "NTA, you stood up for your child and that is what matters the most here. A lot of people use religion as an excuse to be/act disgusting and when this happens, they need consequences for their actions. She likely won't learn from her actions, but your child will grow from your actions.", "well the christian faith states that they do not support divorce soooooo", "NTA and I applaud you for defending your kid", "NTA,\n\nYour Mom is an awful human being! You put your son first, I’m proud of you! You did a great thing standing up to her! Your son is lucky to have you 😃", "NTA. You protected your son from her toxic insults.", "NtA\nGood dad. Support your kid. Screw the homophobic fake ass Christian that is your mother. Or wait until she gets and boyfriend and/or remarries and constantly remind her that the Bible says she's committing adultery", "I do believe that homosexuality isn’t right, but I believe that your mother STRONGLY overreacted. We are to, as Christians, tell others when they aren’t doing what’s right, so that we are not in the wrong for not telling them, in a kind and loving way. This was not kind and loving. Her screaming at your son was unreasonable. It happened in your house. YOUR house, YOUR rules. She should have said her piece in gentle kindness, and then dropped it, and respect his choice, and continue to love her grandson, no matter what his choices. Christians are called to love and serve, and that is what she should have done. NTA", "NTA for kicking her out … one for letting her move in knowing what she is like.", "NTA", "NTA. You did the right thing", "Your mom is an AH, delusional and completely out of touch with reality.  I suggest getting her some help.  \n\nYou, are NTA.", "Nta good for you sticking up for your son and yourself. As for your family I suspect they don't treasure your mom's company as much as she thinks. They can stand up or suck up to her however they like.", "NTA in any way ! Your a great dad ! 🏳️‍🌈", "Your mother is a typical christian. Cherry pick the big book of bogus bullshit to support her own bigotry and outsource the hatred.\n\nNTA\n\nToss her and her hate permanently.", "NTA.   \nIf I look at it from every possible sides of views - from homophobic view, from basic hetero view, from religious view, your mommy dearest needs therapy.   \nBecause not every hetero is homophobe, not every homophobe is religious fanatic and not every religious fanatic is hetero.", "NYA and thank you for supporting your son. Though he shouldn’t have had to deal with her degrading insults and I hope he is ok", "NTA, bigots don’t get to have their beliefs catered to.", "NTA", "NTA\n\n*they told me that doing that was an asshole move because they made her uncomfortable because we knew her beliefs.*\n\nAnd she is welcome to practice her own beliefs in her own home (except she doesn't, thus the divorce).  But in YOUR house, YOUR family will practice YOUR beliefs, and you will always protect your CHILDREN from bigots who try to attack them.", "Hope you’re son is doing ok after all that.", "Absolutely NTA and you should NOT feel like an AH for one millisecond!\n\nYou did right by your son and you should be proud of yourself!\n\nI hope your son doesn't feel bad in any way after the horrible things she must have said to him. No one should feel bad for being themselves, especially when being themselves doesn't actually hurt anyone.\n\nIf she has a problem with another person's sexuality, that is her problem, and her problem alone.", "NTA. Well done for protecting your son. He shouldn't have been subjected to your mother's prejudice. But at least he is assured of your devotion to his freedom to be himself.", "NTA. She was a guest in your home and blatantly went out of the way to insult your child. You protected your kid and his partner. Kudos to you.", "NTA. Thank you for standing up for your son, in your own house. If she won't respect your family, she should not be in your house.", "NTA. Your mother is a piece of work. Your son will forever remember that when she made him feel wrong and small, you threw her out of your house because it’s NOT okay to tolerate that kind of hate from ANYONE.", "This is a no contact situation.\n\nNTA", "NTA. Go NC with her.", "NTA. as a dyke i salute thee", "You did what any good parent SHOULD do and protected your kid. NTA.", "NTA, your house your rules….mom needs to find her own place where she can live however she wants.", "NTA you protected your son. I'm sure there's something in the Bible about that", "NTA\n\nThis is fantastic parenting\n\nI think you and uour kiddo might like the cartoon on Netflix Dead End: Paranormal Park. It had a character going through something similar to your son and shows his parents handle it wrong, but you did the right thing", "YTA for letting her in your home and allowing your son to be treated as less than human by your womb donor. \n\nNTA for kicking her out the way you did. I would have been petty and threatened to call the cops for hate speech. \n\nDon’t let her or any other members of your family that think you were in the wrong back in your life; it is your job to protect your child from people like that. “Jesus” would be ashamed of her.", "NTA.  I have no patience with bigots.", "You stood up for your son. What else could you do? You couldn't let her go on bashing him and if she'd stayed in your home any longer that's exactly what would have happened. Your home, your rules. I know the religious believe their ideas are correct so I cut them some slack regarding their vehemence about it but reason needs to also be brought into play and reason would say you don't insult someone in their own home. You did the right thing. Mom had to go.", "NTA\n\nShe came into your home and attacked your son when you were doing her a favor. She's a rude bible thumper than thinks her religion somehow gives her the right to hurt people for no reason. Thanks to evangelists almost every corner of the planet earth has heard about christianity, including your son. It's obvious he would know what the bible says.\n\nYour mother is a bully and she literally leapt at the chance to bully a child. She isn't a good person.", "NTA, not even in the slightest way.  You stood up for your son, and demanded respect for him from your horrible mother.  Your son is lucky to have such an amazing Dad.  And he will always remember this too, you're a hero!", "NTA and you never will be for protecting your son. The day you became a father is the day his protection became your most important job, no matter who it is you are protecting him from.", "Yayyyy! Go Dad!! NTA", "NTA. She was a guest in YOUR home, she should act like it.", "NTA. You're a good dad to your son. You love and accept him for who he is, without judgment. I am the mother of a gay son. I have removed people from my life who make homophobic remarks whether directed towards my son or not. You are NOT in the wrong here.", "100% NTA...and these comments are HILARIOUS! Good for you standing up for your some.", "NTA. You are the kind of father & Dad all children need. I (44F) was raised Christian but questioned lots of it since I was like 10 so I grew to have my own beliefs. My mom (76F) is a person I call a \"Pure & True\" Christian because she does not allow \"negative\" so-called Christianity. What I mean is my daughter (22F) came out to my mom when she was 14 & what my mom said to her grandbaby was \"I may not agree with what you choose but your choices in life are not for me to judge. I will love the woman you one day choose as my own granddaughter & remember nothing will ever change my love for you. Agreed?!\" My daughter broke down in my mom's arms for over an hour because she thought her grandmother would reject her. I told my daughter she should know that her grandmother would NEVER do that to her but my daughter based it on her grandmother's deep Christian beliefs & studying her grandmother's S. Korean Old School Culture upbringing. I even cried a bit when my daughter repeated to me word for word what was spoken to her. I highly love, respect & am constantly in awe of my mom's \"purity\" as a person, mother, grandmother, devout Christian.", "My house my rules my beliefs.  Your house your rules your beliefs.", "At this point you know your judgement. Also, you now won't make this same mistake twice. I recommend LC with this egg donor.", "NTA for kicking her out…you’re right the only dumbass move was letting her stay. If your other asshole family members have an issue, then they should let her stay with them. Also, christians like to spout their beliefs and speak on what’s a sin or something not being “Godly” all the while living doing unGodly things. Your mom is a hypocrite and I wouldn’t have her back in my home. I wouldn’t apologize to her either b", "NTA.\nYou are an Awesome mama bear protecting your child, as you should!", "NTA.  Good job protecting your son.  Ask your relatives, why are they condoning her behavior for viciously verbally attacking your son (a minor) in your home and why they consider it inappropriate for you to protect your child from her abusive behavior?", "NTA\n\nYou're never in the wrong for defending someone against a bully - especially when that someone is your child. 💕", "NTA, you are a legend.", "NTA and you're a good dad.", "Gonna go against the grain YTA. All it would’ve taken to ensure nothing like that happened would be to tell your son and his boyfriend about the situation beforehand and have them just pretend to be friends while around her. That way you wouldn’t have had to kick her outta your house and your kid wouldn’t have to deal with her either.", ">under this roof those aren't sins\n\nThe sky is going to stay blue regardless of if you believe the sky is blue or not.", "NTA. \n\nAdult comfort and ease matter less than kids’ happiness and well-being. Always, full-stop, no matter who the adult in question is, and even if I agree with their values—which, in the case of your mom, I absolutely don’t.\n\nTreating LGBTQ+ kids like your mom just did, and like she apparently expects you to, risks their safety, well-being, and mental health. Expecting you to put up with it is exploitative of him and of you.\n\nThe absolute best and most appropriate response is the one that you made—you kept your kid safe from an adult who cares more about her “right” to never have her beliefs challenged, than she does about her grandson’s well-being, or her relationship with either of you. Why on *earth* would you neglect your child in favor of that person, regardless of how many genes you happen to share?\n\nYou made the right call. Your mom’s an adult; her life is her own problem.", "[removed]", "Hahahahaha I need to remember that one “maybe a pride flag will work like garlic on vampires”", "“BE GONE FOUL BIGGOT- THE POWER OF GAY COMPELS YOU!” *flag flowing in the wind* omg I love it, please deck the whole place in glorious rainbows!", "Good idea but I would add a salt circle around the house just to be extra safe", "Agree your house  is your son safe space and SHE was the intruder.  Beggars  can't  be choosers  \nNta good on you for defending  your son.", "Or just hit her with the classic \" My house, my rules\", I lay serious odds she has used that one more than once while OP was growing up.\n\nNTA", "Fwiw, we hung one up on our front porch and we haven't gotten a single missionary since. Can definitely recommend this approach. \n\nVery proud of my VERY big, bald and bearded Retired Navy NCO hanging it up there in the first place. :D", "Like with those Mormon solicitors who didnt even bother ringing the doorbell when they saw the homeowner’s pride doormat.", "For more fun might I suggest the Satanic Temple pride flag? Rainbow and Satan all in one. It should really keep her away.", "Make sure RuPaul will open the door next time she visits in full drag mode.", "Or whatever was on that doormat that made those mormon kids do a runner.", "Wait, what about a string of garlic painted in the rainbow flag on the front door?", "Unfortunately it works more like fly paper or a bright light for mosquitoes.", "As a member of the Christian community... I agree with you.", "[removed]", "\"In this home we may not be Christian but we follow the values Jesus preached by loving one another and not judging others.  If you can't act like the Christian you claim to be you're not welcome in our home with your blasphemy and ungodliness.\"\n\nThe religious argument for bigotry is a loser, don't buy into her crap.", "Thank you for protecting your son. You showed him he can trust you, and that his sexuality isn't \"wrong\". You can bet he will remember it", "You did what needs to be done, she needed to go.", "I agree and you might want to  tell your  relatives  that if they want to be berated and ordered  around  in their own home  they are welcome  to invite  your mother over.", "Hi. Christian here. *The* Christian, actually. You know, the one who is constantly disgusting with other \"christians\" and is always apologizing for their idiocy.\n\nHonestly, agnostics are the most sensible group. Atheists can't prove there is no god. Christians can't prove there is. Both groups of us are just agnostics in denial. That's honestly kind of the point of faith. \n\nI'm sorry your mom is an idiot. NTA, you're actually a legend for protecting your son from her harmful bullshit. Next time you won't even let her near him and you'll be even more of a legend.", "I mean next time you just need to get the police involved, an adult is not allowed to go after your kid in his home. If someone is in your house going after your kid and they refuse to leave, call the police", "He's a dad. But completely agree NTA and thank you for supporting your son! I'm sure it means the world to him!", "The bible also lists as sins: owning a mixed breed dog, cutting your hair, eating pork and shelfish, wearing mixed fabrics, and drinking wine in church. \n\nWe all sin everyday. All sins are equal in the eyes of god.", "For a second OP forgot the grandma loves being a homophobe more than she loves her grandson. And that is what you reply with. That you were sharing your home out of the goodness of your heart for a family member and in turn she couldn't be civil and not harass your son for one night. When it comes to housing your mum - who had other people she could turn to and did - or protecting your son from hate. You protected your son. Be proud.", "Right! At no point did Jesus say anything about sexual orientation. All that BS came later", "Right?! How many times in one book can it say to love thy neighbour??\n\n\nOP you rock and your kid's always going to remember this. NTA; but don't err a second time and let that looney back in your house.", "Thank you for being a good example for Christianity. So many people use their faith to spread hate, so it’s wonderful to see that some Christians are really kind and supportive.", "OP is the dad?", "I believe in Christianity the Bible considers divorce a sin.", "I'm questioning my religion rn but that is my favourite way anyone has ever referred to Christianity 😂", "Op is a guy but is still a great parent.", "OP is male. It says so in the post.", "I’m not going to tell my son that he can’t be himself in his house because of someone disapproving. \n\nDid it cause problems? Yes, but telling my son when someone disagrees with the way he chooses to live causes long term problems, I care much more about problems with my son than with my mom. \n\nLetting her in caused problems, I shouldn’t have let her in in the first place. \n\nHim being bisexual is going to cause problems with many people because people are shitty but that doesn’t mean you just stop being who you are because someone has an opinion that they feel entitled to sharing. That’s not what I try to teach my kid.\n\nThose issues started with me letting her in, I admit that, I accept that, but I’m not going to stop being a supportive or even just decent parent to avoid confrontation.", "This is a stupid opinion. That is the kid’s home. She doesn’t come in and start demanding her beliefs get obeyed because she’s there. That’s how you show a kid they don’t have a safe place to be. Grow up.", "All it would've taken to ensure nothing like that happened would be for the OP's mother to shut the fuck up.", "Huh?", "So are you saying you think it’s a sin or what…", "This has to be the most terribly written metaphor for justifying hate that I've ever read.\n\nIf that's not what you intended, then you'll need to provide a better explanation. Troll.", "I  want to be your friend Doodle Brush 🤣🤣🤣", "OMG I LOVE this response too much!!!", "🤣🤣🤣🤣", "💀💀", "🏅", "This is the most amazing comment to ever grace Reddit, or ever will. I wish I had awards to give ❤️", "Best response! Also NTA I wish my father would have reacted like that but sadly he was a bigot like your mom [Edit: spelling]", "Double sided? Or one of those monster hulk dildos?", "Remember much like vampires have no reflection bigots can’t see the hypocrisy in themselves. I like this comparison of homophobes and vampires.", "Attach garlic to the pride flag. You cant be too careful! lol", "Isn’t a crucifix, ironically, a more apt comparison?", "[removed]", "[removed]", "Yes!!! 🌈🌈🏳️‍🌈🏳️‍🌈", "💕", "I believe for homophobes you use glitter in place of salt 😆", "Use pink salt", "Use lube instead of salt", "🤣🤣🤣🤣", "But he KNEW her opinions ! /s", "[removed]", "My neighbor had a problem with Mormons.  For some reason they decided she was a good conversion prospect so they stopped by twice a week.  She asked them to stop, but they didn't.  So one day she answered the door stark naked.  She said she has never seen  two men run so fast in her life.  And they never came back.  I'm hoping they were traumatized.", "Haha, this reminds me of a story my husband once told me. He had a friend who was both gay and a nudist and would go to the nude beach where he had a donut cart. \n\nJehovah's Witnesses kept bothering him at his home by knocking on his door constantly on weekends and evenings and he started getting tired of the harassment. One day they knocked, and he opened the door completely naked. \n\nAnd they never came back again. I never met this guy, but he sounds like he was an AWESOME guy!", "Ha! A person with taste! *applauds*", "Dear god yes!!", "/u/Rarortgaggjx is a comment stealing bot. Original comment here:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/ylx3ah/aita_for_throwing_my_moms_stuff_out_after_she/iv0sf9x/", "I love this answer. I will now use it all the time", ">I’m sorry it took this to help you find your spine\n\nWhat do people in this sub get by being miserable pricks like this?", "Spoken like someone who’s never been stuck in a difficult situation. \n“iM gLaD yOu FoUnD yOuR spine…”\n\nJesus Christ.", "The sexual orientation came before Jesus. It comes from Leviticus 18:21 and Leviticus 20:13. Leviticus is from the Old Testament along with the 10 Commandments. Jesus serves to simplify the 10 Commandments to 1 simple Commandment that no one is his church has ever been able to follow: \"Don't be an asshole\".", "I hope you all get them some day. Whether yours turn out to stand up for you, or a different one takes you in.", ">How many times in one book can it say to love thy neighbour??\n\nApparently nowhere near enough since no one can get it through their heads and follow one simple line", "The amount of \"Christians\" spreading hate, homophobic and racists views makes me question if I'm the one who didn't get the message after spending 8 years in Christian schools.", "piggybacking on this, also curious", "Damn, I ned to pay closer attention. Thanks.😩", "Alright I can respect that, thank you for responding OP wishing you the best!", "Damn, I couldn't have said it better myself. Holy shit you are an amazing Dad!", "Thank you for responding!", "Ignore her crazy shit. NTA", "Me too!", "And vampires, like bigots, need to be invited inside.  Obviously, why would you ever let a known blood-sucker into your home?", "I think a glitter bomb would be both more appropriate and more effective, myself.", "Oh yeah; just alternate which side is up depending on the situation: right-side-up for vampires, upside-down for Christians.", "[removed]", "Bad bot\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/ylx3ah/aita_for_throwing_my_moms_stuff_out_after_she/iv1qzwb?utm_medium=android_app&utm_source=share&context=3", "Bot? I don't know how to report.", "Only the super fine glitter though. The kind that haunts you years later after you've cleaned and vacuumed many times, and you see a sparkle out of the corner of your eye.", "I know  the She  =grandmother", "Not true. Otherwise all those people in mental distress wouldn't be getting killed.", "Right, like OP IS NTA, so why you gotta put him down??", "I have a tendency to take things literally and leviticus confused me when I was younger. \"Man should not lie with man as he does with woman\" O.k, that's not physically possible, so what's the problem?", "Glitter by itself is so old school. Give the religious bigots glitter with sparkly Christian confetti and guilt them for being upset at someone spreading  religion at them\n\nEdited to add: Ooo can you specify you want RAINBOW glitter?", "Calm down, you war criminal lol :P\n\nSeriously, love the way you think!", "Bad bot! Partial comment stolen from u/nated135.", "Click on the \"report\" button and select \"Spam\" and then \"Harmful Bots\"", "A friend's daughter calls glitter the herpes of crafts 🤣", "What?", "Because being a garbo person on the internet is free, I guess.", "“‘Man shall not lie with man as he does with a woman’\n\nYeah he has different parts, flip him over. “\n\n*Steve Hofstetter*", "Thanks!!", "I think u/glittering-cellist34 is referring to people in the US who call police for a mental wellness check (or whatever it’s called) on someone else, the police show up, and murder the person who’s experiencing psychological distress.\n\nI will never understand why people on this sub are so keen to get police involved in every family conflict at the drop of a hat. Don’t you read the news - ever? Do you think American police carry deadly weaponry at all times because they make for a pretty decoration, and would never dream of actually using them?", "Hey you leave Garbo fans out of this. She was one of the most naturalistic actors of the silent and early talkie eras and built an amazing art collection.", "My apologies! The world we be better if we had more of *those* Garbo people.", "AWW.  Those that are giving you shit, tell THEM to house mommy.  BRAVO for standing up for your son.  BRAVO FOR giving mom the heave HOE!", "Your most important responsibility is to love and accept your son for who he is, full stop.  If your mom can’t show love and compassion for your son then she has forgotten one of the most important teachings of Christianity, “love one another as I have loved you.”  Nowhere in the New Testament does Jesus put any limitations or qualifications on that statement.  Next time she dares to speak her mind just remind her of that simple truth, hopefully it will render her speechless.", "NTA", "You’re absolutely right about you letting her in was the only wrong move. Even that wasn’t wrong it just didn’t work out well. Your home, your rules. That applies to how children behave and that applies to any adult that walks through that door. I personally would explain it once to everyone and tell them that if they don’t like it, you can go no contact with anyone that doesn’t respect your rules for your house. As a Christian I say it’s wrong. But you’re not a Christian and even if you were, it’s not worth alienating your child for that belief. My daughter broached that subject with me when she decided she was curious. She already knew my views on it. I reminded her once but after that I left it up to her. I wouldn’t have ever kicked her out for it if she would have tried it. Your son being attracted to both sexes doesn’t make him feminine and your relationship with your son will always be much more open and honest than those parents who stick to it being a sin and shutting their kids out by doing it. I repeat your son isn’t unmanly. Just the opposite I would say because he’s strong enough to admit his feelings!", "NTA, good on you for defending your kid!! Your mother might not agree with it but if she's under your roof she should just be quiet about it, scoff to herself or hey, better yet: accept her grandson's sexuality?! Wild, I know!\n\nI may be a bit paranoid from reading too much Reddit xD but I'd suggest getting some cameras for the house and be careful of retaliation from your mom and some cronies", "NTA, if I were in your place I would have threatened to call the police. There is no way she should be allowed to make your son feel unwelcome in his own home.", "NTA\n\nAlmost an asshole for not telling grandma to fuck off faster.", "🤣🤣🤣🤣🤣🤣. The rainbow flag for the front porch is epic!", "I think it could be projection.", "nah sometimes the assholes just barge in or copy a key or etc. then you get to call the cops.", "🤣🤣🤣🤣🤣🤣", "Ok now that’s the way to get multiuse out of an object! 🤣🤣🤣🤣🤣🤣🤣", "[removed]", "NTA. You are an amazing father though", "NTA. I’m agnostic as well and my biggest pet peeve with people who happen to follow a religion is those that try to put their beliefs on others. It drives me insane. You are entitled to believe what you believe but what you are not entitled to do is insult a child and tell them that they are sinning based on your beliefs. Also the fact she is getting a divorce is just the cherry on top.", "Uggg sounds like my FIL who s complains how 'the gays ruined the rainbow\". We now have a daughter who is transgender and he's not allowed in our home. NTA and good on you for standing up for your son", "Sadly I know very few Christians that give their faith a good name.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Rainbow genital confetti"]}