{"id": 11454, "submission_id": "11hxptn", "title": "AITA Going through my partner's drawers to find the TV remote?", "selftext": "We had been missing the TV remote for a long time (a few months). I knew I didn't have it in any of my personal areas, and I repeatedly asked my partner to check his bedside cabinet drawers for it.\n\nI know when he cleans he throws most things in there, so I heavily suspected the remote was hiding in one of his drawers. Each time I needed the remote, it reminded me to ask him to check his drawers and each time he said it wasn't in there, without checking. He got angrier each time so I slowly stopped asking.\n\nEarlier today I was cleaning our bedroom and he was out. It was one of the very rare times I had the house to myself because of our social lives and shift patterns. Temptation got the better of me so I opened his top drawer where most things go when he tidies, lifted a couple of papers at the back, and the remote was right there. I was just happy to find it after all these months.\n\nWhen he got home he asked where I had found it. I said I checked his drawer and now he's fuming with me.\n\nAITA?", "created_utc": 1677931642, "permalink": "/r/AmItheAsshole/comments/11hxptn/aita_going_through_my_partners_drawers_to_find/", "score": 664, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My partner is angry I went through his drawers to find the remote because he had asked me not to check his drawers. They were his private space, but he wasn't checking them for me to find our lost TV remote.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Why does he need control of the remote? And why was he so upset you looked in his drawer? D this the only thing he likes to control?", "NTA. He's being ridiculous and his behaviour suggests he's being dishonest.\n\n It's okay to want and expect privacy...But if he had nothing to hide..and the only reason you opened his drawer was to retrieve a tv remote - normal people understand this and would  be like ...'my bad for putting  the remote there' - they wouldnt blame you. \n\n'But my privacy' , nah that was void the second he put the tv remote in the drawer. \n\nMakes me wonder what he's trying to hide from you OP.", "NTA.\nBut your partner is. Dollars to donuts he knew it was in there.  The only real issue is whether it's a jerk power play or an immature avoidance of being found to be in the wrong.\n\nEither way, don't accept any of his fuming as being in any way your fault.", "NTA.\nSimple ! Don’t put the remote in your drawer and I won’t open it 🤣.", "NTA. You gave him multiple opportunities to search for it himself. Why did he never bother to look? That’s what baffles me. I’d search everywhere until I found the remote.", "Nope. NTA.   \n\n\nThere is a reasonable expectation of privacy in a relationship. But it doesn't extend to, you can never go here. It's like, you WBTAH if you were searching for signs of infidelity. Or if you regularly went through his stuff to check up on him. That would be controlling and weird. What you did was look in his drawer for a common item. You found it and then stopped. That's normal behavior.   \n\n\nHe's an a$$ for not looking in his drawers when he said he would look. That's all on him.   \n\n\nSo, now I'm starting to think this guy does have something to hide. His behavior is weird. Dresser drawers aren't so sacred that another person would never go there. Heck, the other day, I opened my partner's drawer because I was just curious. She's sloppy and I was wondering if anything was actually ever put away. I opened it, confirmed that indeed, there's little in there and it's not organized at all, and closed the drawer. I have no problem with her knowing this and she would not be offended. It's not really my business so I didn't bug her about her mess.   \n\n\nThe fact that he's \"fuming?\" I mean, why???? What's going on in this relationship?", "NTA, if he wants people to not go in his drawers then he shouldn’t put other peoples or joint property in them period. His fault and ridiculous that he would not even check in there for months. Nothing wrong with not going into them as long as the contents are his only.", "NTA, but also, he knew the whole time.  This was done with a level of intent.", "NTA but sometimes a little white lie to avoid confrontation is OK.  You coulda told him it was under the bed or something.  I have a couple drawers that are mine that I don't want people going through, like my desk drawer that I keep all my medical MJ stuff in.  It's in a locked case in the drawer so I wouldn't be terribly upset someone did go in there, but I'd rather they didn't", "NTA\n\nWhy in the world would your partner **care** if you looked in a drawer to find a remote?  That you had been looking for for **months**.\n\nHe's being weirdly territorial over a drawer with a partner he lives with.  I'd wonder **why** he's acting that way.   \n\nSaying \"it's my drawer\" **is no justification for his behavior**.   It comes across to me as a control issue or power play.\n\nHe's being a total AH here.", "NTA. Invest in a key finder for the remote.", "NTA, something is very wrong here. Is this the only time partner has made you feel less than and uncomfortable about something normal?", "NTA. Even if he was convinced the remote wasn't in there he should have checked at least once. The sheer number of times things can be found in a place you are certain they were not put requires a check.", "NTA. Why are his drawers forbidden territory? I'd wonder what else he is hiding in there...", "NTA and this is very weird. Why is he so intense about the drawer? It’s been MONTHS and you just now looked there? Would you get in trouble for daring to open a drawer in your own room? Why does he get to get away with that for months…?", "NTA\n\nHe knew it was in there and ignored you every time. \n\nLeave this AH", "NTA. You found the remote, didn't you?", "This is going to be unpopular, but ESH\n\nPartner for not checking his drawer and for lying about checking his drawer.\n\nOP for violating his trust and checking the drawer.\n\nTo those who wonder why he doesn’t want anyone looking in his drawers—it is his nightstand. I keep my journal in my nightstand and I’ll bet other people keep private stuff there, too.\n\nI’d be mad as hell if my partner was digging around in a place that I had told them was off limits.\n\nOf course, I would also have checked the damn drawer for the remote ages ago.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe had been missing the TV remote for a long time (a few months). I knew I didn't have it in any of my personal areas, and I repeatedly asked my partner to check his bedside cabinet drawers for it. \n\nI know when he cleans he throws most things in there, so I heavily suspected the remote was hiding in one of his drawers. Each time I needed the remote, it reminded me to ask him to check his drawers and each time he said it wasn't in there, without checking. He got angrier each time so I slowly stopped asking.\n\nNow I know how chaotic he is, but I also know his patterns. Earlier today I was cleaning our bedroom and he was out. It was one of the very rare times I had the house to myself because of our social lives and shift patterns. Temptation got the better of me so I opened his top drawer where most things go when he tidies, lifted a couple of papers at the back, and the remote was right there. I was just happy to find it after all these months. \n\nWhen he got home he asked where I had found it. I said I checked his drawer and now he's fuming with me. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nI get weird about my partner using my space or taking things from my drawers without returning them.\n\nBut that means when I’m asked to look for something in my drawers of office I do.", "The TV remote is notoriously a non-trusting situation every.single.time. There's memes about it for a reason.\n\nI trust NO ONE when the say they are not sitting on the remote.  Stand up, I bet you are on it, even if you \"looked already\". Yes, I am going to check drawers, even ones I am not technically allowed in. \n\nHe should have been apologizing for hiding the remote for so long, not getting mad you went in his super secret drawer. \n\nI don't touch my spouse's wallet, even when I know he has the HSA debit. Babe, check your wallet.  \"i don't have it\".  Babe, check your wallet. \"Its not there\".  Babe, check it in front or me or I will do it myself.  Hey, look, we found the debit card!\n\nNTA", "Look him in the eyes and say:  \n\n“You have absolutely no reason to be angry with me. The real question is, why did you intentionally lie to me about this several times, over a period of months?  \n\n“I’m going to be paying close attention to your behavior now, because I can’t trust you like I used to.”\n\nNTA", "He had asked me repeatedly not to go into his drawer. He's fine in most other ways. Just a bit funny about me opening his drawers.", "To a man the remote is a bit like an orb and sceptre, symbols reflecting his status as King of the house.", "Yeah this is freaking weird behavior. \n\n1. To put a remote in a drawer of all places.\n2. To be freaked out when your partner opened your drawer even though they didn't take anything that was specifically yours.\n\nRed flags ahoy.", "This.", "Why would she be TA if she was searching for signs of infidelity? I mean, yes of course she would be if it was just something she routinely does or has a history of doing regardless of partner. But if it's out of the norm for her I wouldn't be so quick to assign AH status. Every single person I know who suddenly got the urge to \"snoop\" on a partner when they didn't have a history of doing so before, were actually being cheated on (except for the one case where the partner was hiding a raging addiction).", "Grow a spine you doormat, he obviously knew what he was doing.", "But why? What does he have to hide? Where there’s smoke…", "Most men would enjoy their wife going into their drawers 😂😂😂", "by not allowing using it even himself ? I don't understand the logic like for months", "The king needs to be dethroned then", "We all keep personal things. I can understand not wanting to have things rummaged through, even by someone really close to us. I like having privacy too! \n\nBut I was mindful of this when I went into his drawer. I didn't look at anything. Just lifted a couple of papers to find the remote exactly where I thought it would be.", "He could’ve avoided this if he had looked for it, as you repeatedly begged him to. I’m also big on having my chaos untouched but context matters.\nNTA", "He hid the remote for MONTHS and gaslit you rather than simply bring it back FROM WHERE HE PUT IT.\nAfter MONTHS, you finally took it back. He used your consistent respect for his privacy to invalidate and maintain your discomfort and frustration because HE hid the remote. Even giving him the benefit of the doubt, that maybe he thoughtlessly tossed it in his private drawer, his failing to retrieve it from the first time asked is a-hole behavior. HE messed up months ago, and kept it going until you finally put a stop to it.", "Yah. This is weird. You said it's what I call a junk drawer - it's the place he puts things when he doesn't want to put them away in a real place yet. Junk drawers aren't places you get mad when people open them.   \n\n\nIs he controlling in other areas of your life? This is starting to feel like an abuse red flag.", "NTA.\n\nLook, either your SO has a bizarre, burning need to maintain complete control over the remote at all times and so purposely hid it from you, or he's just a lazy AH who couldn't be bothered to look in his own drawer. Either way, ***he is solely responsible for this entire situation.*** \n\nIf he doesn't want you going through his drawer, then he should have checked his drawer for the remote when you asked him *the first time* – or just not been a thoughtless AH and thrown it in there in the first place. \n\nIf, on the other hand, he did it on purpose, then he's just an AH for being controlling and dishonest. \n\nRegardless, he's got absolutely no room to complain here. He created the problem, he actively prevented any solution, he's an AH and he needs to STFU. Now.", "NTA. Sounds like he is hiding something else. Also, he can't accept being wrong. And can't respectfully do something that you ask.", "NTA. He has every right to request privacy, but if he's dumping communal remotes in there then he loses that privilege. \n\nIf the tv is fairly new, you can look up the model number and purchase extra remotes on Amazon. I did that with our main tv so both spouse and I had remotes. I also put them into neon silicone cases because we could lose an elephant in a studio apartment.", "There is nowhere in my home that I am not ‘allowed’ to look. That’s because my husband isn’t a creep.\n\nNTA.", "NTA but it’s funny all the wild assumptions everyone is making that your husband is abusive, gaslighting, potentially cheating, etc. More likely he’s just a scatterbrain who honestly thought the remote couldn’t possibly be in the drawer, then got embarrassed when you proved him an idiot and he lashed out at you because of it. Is that healthy behavior? No, but it’s not the red flag smoking gun the rest of y’all are calling it.", "NTA\n\nYour boyfriend is acting very strangely. This goes beyond just a privacy issue. Keep an eye out for more red flags!", "NTA. \n\nHe’s hiding something. His reaction is not normal.", "I'm all for having privacy. But privacy also comes with trust. \n\nI trust my partner to use my phone, for instance, because I know he won't go through it looking at my private stuff. And vice versa. The only reason I wouldn't want him using it is if there was something on it I was specifically *hiding* and feared him finding by accident. If he *did* break my trust and go snooping, I would feel a little violated but I know there's nothing damning for him to find. \n\nIn most cases, wanting privacy is more so to have a safe space/some boundaries so you can exist freely outside of your partner's gaze. It does *not* mean deceptively keeping things from your partner. \n\nHe's acting like he is keeping things from you. Things that are more serious than just some stuff he prefers to keep personal and private. If you found the remote and didn't touch anything else and have no intention of going back through his stuff, that isn't some big violation worthy enough of wrath. But that he is so angry about it is a little bit telling. \n\nSo no, you're NTA. But I'd be questioning his reaction.", "NTA. If he didn’t want you to look in his drawers he should have done it one of the million times you asked him to check.", "NTA Though it would have been fun to say \"Where do you think it was?\" and watch him edge around knowing and still being mad you looked because he knew exactly what he was doing.", "NTA.  You have a dick for a husband.\n\nAlso, get yourself a universal remote.  The next time he hides the remote, whip it out and keep on moving.  Life is too short to be dealing with shit like this.", "NTA. You asked him to look for it. It’s possible that he was just being a lazy shit and not looking, but most likely he was HIDING IT FROM YOU. For whatever reason, he knew it was there because he put it there on purpose. He’s just mad because you found his hiding place and probably correctly assumed he knew it was there.", "that was a power play \n\nNTA \n\nget away from that man though", "Is this the only time partner has made you feel less than and uncomfortable about something normal?", "It sounds like he was doing some kind of relationship 'test' to see how long it would be before she went into the drawer.", "Then he’s not ok.  This secretive & controlling behavior will escalate.", "Yeah, he knew where the remote was the entire time.", "[removed]", "The parent comment was made by Educatidfggh who has multiple copycat comments in their history. This particular comment is likely copied from [here](https://www.reddit.com/r/AmItheAsshole/comments/11hxptn/aita_going_through_my_partners_drawers_to_find/javon5t/).\n\n---\n\n^(🤖 I detect copycat bots. Report the copycat comment with `Report` > `Spam` > `Harmful Bots`) ^🤖 ^[Why?](https://redd.it/102euvj/?u=Educatidfggh)", "This is the answer. NTA....he is.", "have you seen OP’s responses? they keep excusing his behavior and saying he’s in the right. \n\n the gaslighting is strong in this one…", "[removed]", "BOT", "NTA. If he is putting JOINT items in his drawers, they are no longer his drawers, they are joint drawers. \n\nMy guess, he is embarrassed because he looks like a fool for not looking in there and is covering it up with his anger.", "Oh hunny \n\nNot the ass,  but there is something  going on here.\n\nEithier he hid the remote on purpose for months ( super werid ) and is now angry he was caught\n\nOr there is something really bad in those drawers. Since it was papers I'd think financial things ?  \n\nYou asked him to look he  refused time and time again this is on him.\n\nAlso maybe it's just me but I think it's really werid  that there is a place in your house  your forbidden from going into like in horror movies where people open a box they never looked in and find all the evidence that their partner was a serial killer ( like their trophy's ) \n Maybe your cool leaving the box closed but me I'm opening the box  .... If rather know then not", "There is a simple solution to all of this... Just set up the TV remote app on your phone. Easy peasy and no more having to hunt down the remote your SO so conveniently couldn't find in his \"special drawer\".\n\nNTA but the real problem is your controlling ah SO!", "Thats his dumb fault for not looking in the drawer in the first place. NTA.", "NTA. He’s got something to hide if he’s this mad about looking for a tv remote.", "NTA.  He should be ashamed of himself, the issue is not privacy, it’s pettiness.  He should be apologizing not fuming. If this is his mountain to die on, that his drawers are sacrosanct and not to be opened even when he is wrong, then you need to think about how that behavior seeps into other aspects of your relationship.  Does he ever admit he’s wrong?", "NTA. His drawer? I get having specific drawers for storing your things, but nothing in my house is off limits to me.\n\nIt's my house.", "NTA but we know who is", "NTA. What is he hiding?\n\nEdit: does he complain about you watching TV? does he try to stop you watching what you like?\n\nMy dad doesn't like my mom watching TV because in his opinion she should be focused on him.", "The side table drawer next to my husband’s bed is like a magic portal for lost items. Also, he can have something directly in front of his face and not know where it is. On the other hand, a lost remote inspires panic in my household and it would be all hand on deck after a day of missing one.", "This is what I think. He is very scatterbrained. In my original edit I said something about him being chaotic, but also me knowing his patterns (like putting everything in that drawer). But I cut it in an edit because I thought it didn't make much sense without a huge explanation on the side. \n\nHe can be a bit gaslighty at times, but never abusive.\n\nNice to know most people don't think I'm an asshole though!", "It's not about the remote!", "Encouraging OP to lie to spare their AH partners  feelings despite MONTHS of the remote being in his drawer? That’s some bullshit. He didn’t need to be so sensitive about this at all and if he reacted as any normal person would, this wouldn’t be a big deal. OP shouldn’t have to make themselves smaller for their partner’s sake. OP, NTA you did absolutely nothing wrong.", "I don’t like people going through my personal space either. I have nothing to hide, it’s just mine. I don’t hoard shared property in there though and give anyone a reason to rifle through it.", "Also: The post suggests that he got angry whenever OP asked him to look for the remote. Getting angry when your partner asks you to help look for a lost item is really out of line. It sounds like he has an anger and control problem and I wonder if he wasn't hiding the remote on purpose.", "If that’s the case, it’s not a good relationship.", "Maybe \"where there's smoke\" is even somewhat literal if what he's hiding is drugs", "He created the issue by refusing to take out the remote himself. He's either incredibly lazy or was hiding the remote deliberately for some reason. The fact that a shared item like a remote was present in the drawer makes it not \"personal\" space but rather general purpose storage.", "As all kings.", "A few possibilities in order from least to most devious:\n\n\nOption 1: He's actually did take a quick glance in there at some point and didn't see it. Then became increasingly annoyed that she kept insisting he look there. \n\n\nOption 2: He's kind of lazy and it's easier to push the button on the TV than search for the remote. He meant to check next time he was near the drawer, but he only thinks of it when he's already sitting in front of the TV. Every reminder just makes him feel dumb for not remembering, especially when it turns out, it was in there the whole time.\n\n\nOption 3: For reasons unknown he has purposely hidden the remote and is actively lying about its whereabouts, as part of a wider scheme of abuse and manipulation. \n\n\nOption 3 really doesn't seem like the most likely one here.", "Oh come on, you're on Reddit. Of course it's number three. And the bedside cabinet drawer is also where he keeps his mistress. (/s, at least half)\n\nPersonally, I think it's a mix of options 1 and 2. He probably took a glance, didn't see it, and is kinda lazy. But with all the bad stuff you see on here, r_a, and relationships, it's easy to assume option 3.", "One way we could have known this if OP had said that she simply ordered a new remote when Hubby asked. If Hubby looked at the drawer, that meant he knows it was there. If not then He didn't know.", "I think we are all puzzled about why your 'partner' would hide the TV remote for MONTHS?  Is he claiming it is 'HIS' tv and only he can decide?  were you watching something he didn't like or did he want to watch something you didn't like?  Do you watch TV on your laptop and he doesn't have a laptop?\n\nYou call this man your partner but he sounds very suspicious to me.  Are there other things that he controls? money? transport?\n\nI live a life where only I make the decisions about money, assets, work , travel etc and I can't imagine some man telling me I can't watch TV", "NTA  -  Is this not a red flag to you? He refuses to look, tells you it's not there, does nothing to find it, appears to have hidden it, and you make excuses for him?  Life is too short to be treated with this kind of disrespect from your \"partner\". I don't think that word means what you think it means. You're not living with a partner. You're living with a person who doesn't value you, can't take a couple of minutes to show you that the remote isn't in his drawer, and then gets pissed when you find it right where you thought it would be. I'm guessing that this type of behavior has probably happened in other aspects of your relationship.  \n\n\nTime for you to find a partner who truly wants to be a partner and not a controlling asshole.", "NTA.  What is his issue with you getting the remote, and why is he hiding it?? Something weird going on there.", "NTA. It would never occur to me to wait to ask my husband if I could look for something in his dresser; I would just go look. What could he possibly have in there that wouldn’t be safe for my eyes?", "The feels very ‘don’t open the box of olives’ to me.\n\nNTA. Either he’s lazy, or he’s hiding something. Or just doesn’t like to be proven wrong. Either way, he’s a jerk.", "NTA. \n\nWhy wouldn’t he check the drawer himself?! Weird behaviour from your partner.", "NTA. He could have checked there himself.", "NTA he should have looked himself. What is he hiding in that drawer he didn’t want you to see. That’s just weird", "NTA. His credibility is toast. You had good reasons to not trust his claims. Tell him that while you respect his privacy, he cannot secret common property in his privacy zones without the expectation that it compromises his right to privacy.", "NTA. If he doesn't want you going through his private spaces he needs to lock them and STOP tossing communal property (i.e. the TV remote) into his private spaces.", "You should be fuming with him! He either hid the remote or carelessly forgot it and didn’t bother to help find it. This seems like a game he’s playing. \n\nWhat would happen if you demanded an explanation? How come the remote was in his drawer? Why did he not look there before? Was he hiding it or is he just stupid?", "NTA. It was in his drawer. Even if you don't consider it suspicious (and hell, even if he's just a giant baby and not being controlling) it's a dick move of a very high caliber to put other people's shit in your mess and throw a conniption when they get it back, ESPECIALLY after a few months.", "What else is in his drawers? Something like [this](https://www.reddit.com/r/copypasta/comments/ppbxrw/am_i_the_asshole/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)?", "You can buy a spare remote in any big box store and cue it to your tv.", "NTA.   Gaslighting IS abusive!", "NTA. This reminds me when my stbxh got really mad that I checked his phone and violated his privacy. He tried completely flossing over the fact that he was cheating😠 as I had suspected which is why I checked his phone. He's still mad I violated his privacy!", "> He can be a bit gaslighty at times, but never abusive.\n\nAbuse isn’t just limited to physical abuse & someone who is “gaslighty at times” is being abusive. Why else would he be “gaslighty”?", "How long has he been grooming you to accept this abuse as ok? It sounds like you've been completely brainwashed into complacency, which indicates a long history of abuse. Do you have a therapist to help you out here?", "Gaslighting is abuse.", "Eh sometimes you gotta just keep the peace.  She got the remote, he thinks his drawer was undisturbed, everybody's happy, get on with life.", "She admitted he’s “gaslighty at times” but he’s also “not abusive”", "I believe OP is also a man", "Seriously, people are being a bit over the top here. My fiancé is so unobservant when it comes to this kind of thing. He'll lose things and 99.9% of the time, they are exactly where I suggested he look and says he looked. There have definitely been a few situations like this where I've repeatedly asked him to check a certain spot, he gets irritated claiming he looked, and then I find it in that spot. I no longer ask a second time and just check myself.", "hm...sorry, I didn't catch that. I'll make my comment neutral. thanks for letting me know", "That's probably true, but do we really have any reason to think he's hiding it on purpose? The personal drawer thing is a little odd, but plenty of people like having their own personal space. \n\n\nIf there was something like they had a big fight over what to watch, or he was always telling her she watched too much tv, then that would at least be some reason to suspect it was deliberate. But I see no reason to doubt what op said. He absentmindedly fired it in there while cleaning and forgot. Then for some reason looking checking it became a petty sticking point.\n\n\nI suspect he really was sure it wasn't there. For some reason it was a pride thing where he didn't need to check because he KNEW he didn't lose it, and looking would be admitting he wasn't sure if he remembered right or something. Which also isn't great, but it's a far cry from deliberate months long deception.", "> He can be a bit gaslighty at times, but never abusive.\n\nYeah, it’s option #3", "NTA. I was feeling some suspense of what he's hiding in there that's making him so keen on you not looking through it. I now want to know the contents of his drawer. He is TA since he didn't ever look in his drawer for it. I dislike lost remotes as well and they are typically under my husband's butt.", "op=NTA\n\nYou have equal right(if not more) to be Angry at him for NOT even looking after you asked how many times.\n\nHowever, a few options for the future.  1) next time LIE about where you found it 2) buy a universal remote, so you have a spare.  3) get a remote tag(they are cheap) that will give you beeping to track it(Unless you want to upgrade to the gps locator type).", "You're NTA for getting your remote back. You shouldn't make excuses for his behavior though. Yes, everyone is entitled to some degree of privacy, but nightstand drawers isn't that. And the fact that the remote was just chilling right there the entire time just goes to show that Really isn't his private stash spot. If it was, he would have known the remote was there.", "The Stockholm syndrome is strong with this one...", "NTA. He was testing you…what a horrible thing for him to do !", "NTA, you just wanted to find the remote   not like you wenthrought  all his stuff you just went through  the one drawer. And you wouldn't have to look for it if he checked.", "Strange relationship but NTA", "Sweetie, please seek therapy. NTA", "NTA. If he has a private life to hide, don’t put community property in the same drawer he hides crap in. Plain and simple.", "NTA he is hiding something if he doesn’t want you finding a remote in his drawers. I would find out what it is.", "Your partner has serious issues if you can't look in a drawer.... maybe want to take a closer look at this guy.....", "Sometimes the remote magically appears under someone's butt. You'll stand, it won't be there, sit back down, rummage the surroundings, stand back up and it's under your butt.", "Or he did look, didn't see it, and didn't take account that it's EXTREMELY common for the thing to be there where it already looked anyway. \n\nMy mom and I can both attest to numerous situations where we asked someone (partner or child, generally) to look in a place for a thing, they say it's not there, they *swear* it's not there, and then we find it exactly there. I have occasionally had other people find things in places *I* already looked. I've even found things *myself* after already looking in that place two or three times. It's just a human thing.\n\nThis is probably the most likely situation because in my experience almost everyone is overconfident about their searching abilities. But he's still a little bit of an AH for not giving any credence to the idea that maybe he just didn't look super well, compounded by getting mad about it.", "[deleted]", "I AGREE THIS IS ABUSE. OP GET OUT RED FLAGS EVERYWHERE. REMOTIAL ABUSE AND DRAWERISM.", "That’s a dangerous argument against any sort of privacy for anyone in any relationship", "Sorry but you are giving him excuses, I've been with my hubby for 12 years and if he ever acted that way about a damn drawer u would go through just to make sure he wasn't hiding that he was cheating, doing drugs or something else illegal. YWBTA if you don't get to the bottom of this when you live together.", "He lied to you for months. Why?", "He obviously knew it was in there if he got angrier each time you asked and he refused to check it. Girl run", "Whoa whoa whoa-  the guy expects a smidgin of privacy and now he’s a drug addict with something to hide?  \n\nThe fact the remote control was hidden in there for months (months?!) is all sorts of problems but expecting a your cupboards to be your own is not an issue is it?", "It baffles me after months that no one bought a couple of cheap replacement remotes. \n\nThat being said, he's being a bit weird, and the fact that she described him as gas-lighty is troubling. \n\nBut, like, it's a remote. Just get a new one, and while you're at it, see if you can't get a phone app to do the job in a pinch.", "The part I find concerning is the angry reaction to being asked to check the drawer. I’m the kind of person that misplaces items like this, and when I eventually find it, it’s in a place I searched multiple times before. The difference is I wouldn’t get mad at someone for asking me to check my drawer again. If something’s missing I just keep checking places repeatedly until it shows up. \nGetting upset about that is a major red flag. As is not apologizing after it turned up in that exact location.", "Please see a therapist about this.", "Sounds like he's a control freak.", "NTA, don’t be concerned about the remote…why is he so defensive and secretive? How long has he been cheating? 🥸", "NtA. And also, this guy seems shitty for so many reasons: 1) out the remote in a drawer you shouldn’t check (??) b) is annoyed when you ask him to check drawers c) is angry when you double check- he’s either not bothered to value your inquests or is intentionally deceitful- either way: shitty. D) mad because you revealed he was shitty", "NTA... Um, my husband won't go in my purse, I think his mom taught him that and it stuck. But there are no drawers we can't look into when we are looking for a lost item. I still wouldnt read his phone without permission, but even that's not locked and I know I am welcome to.", "Your husband sucks! The fact that you can’t go in his bedside drawer sounds like there’s more of an issue going on here and you don’t even know it! You went months without the tv remote all because you wouldn’t go in his drawer because you knew he’d be mad about it! That’s sad and he is controlling! NTA but your husband surely is!", "lol this is get the fuck out behaviour \n\nNTA obviously", "Does he not actually wear underwear because I can bet you, he’s seen it in there after months if he does? This is ridiculous. Gaslighting is abuse. He knew exact,y where you found it when he asked. Next time say under the bed, and see how he responds.", "There is a bigger problem here.", "OP was pregnant at one point so is likely not a man", "half sarcastic, or half the mistress?", "They post and comment in the askgaybros sub and their name say James William so I'm assuming they're a man.", "\nYour bf is an AH for not looking for/hiding the remote\nYou're an AH for going into a private drawer", "I’m just glad nobody got hurt", "NTA sure he doesn’t like going through his stuff, weird but sure. However, you ask and asked and it’s been months.", "I would be looking in that drawer again because he is acting like he has something he is hiding in there", "Get another remote. Also, NTA", "Wrong question. Is this acceptable to you? He has you conditioned to make excuses for him, so this relationship is working for him. It isn't working for you, but you can't see it. Get some therapy, you aren't the problem here.", "Our newest TV only turns on via remote. There are no buttons on the side. For whatever reason, we are ALWAYS losing that remote. Part of the problem is we have three neurodivergent kids who use the remote and absently set it down, make no memory of where they put it, and then romp around the room so it falls in cracks and crevices. We actually bought a second remote for the TV, and then my husband washed it and cracked the sensor, so we're back down to one that's probably lost more than found. If the TV is left on, we can control it from Google, but if it's off, no dice. A replacement remote was only $15 on Amazon. \n\nOP, if I were you, I'd but another remote to keep in your drawers. At best, you never have to look for the remote again. At worst, you'll find that your partner's behavior was telling more about himself than you, if you suddenly find that your remote is missing.", "I don’t consider a book a place within a home. \n\nIf my husband had a diary, and asked me not to look in it, I wouldn’t. Just like my husband would never go in my wallet without permission. \n\nThat said, if I lost my car keys and never looked in my purse, he would definitely check there. Just like I would go in his bedside table if I was looking for something. The fact that OP’s spouse is acting the way he is, is very suspect.", "It's his personal drawers he doesn't need to be hiding anything to expect people to stay out.", ">What does he have to hide? \n\nHe doesn't necessarily have something to hide.  Why do people always go there?  It's his drawer and he may have personal, private things there that he doesn't feel comfortable sharing with anyone. \n\nPersonal space is just that - personal.  He doesn't even need to give a reason unless he feels like it since sometimes giving a reason gives away what you're trying to keep personal (not hidden).", "Eugh is she really? Just from the one above you can see she's an enabler. Narcissists love this personality.", "I just got whiplash!", "Very possible that they are trans and gay.", "If you have an open and honest relationship than you can open a drawer. Like yes privacy, and don’t eat the last potato chip. But a drawer in a shared space… weird if you ask me.", "NTA. He could have just actually checked when you repeatedly asked him to. But it’s weird that he’s so triggered, if he doesn’t have something to hide. It’s a drawer, it’s not like you were reading his personal diary or something? The paranoia combined with the lying and defensiveness are all red flags.", "INFO: Then why didn't he just look in his now draw instead of spending months without the proper remote?\n\nDid you not ask him?  If so why not?  If you did then why did he refuse? \n\nYes, everyone deserves privacy but from what you say it seems like it's malicious on his part to hide things from you.", "I hate to break it to you but gaslighting is a form of abuse and will make you start to question your reality.", "Okay, keep private things private, that's fine. But he knowingly had shared property in his possession for months. 🙃 Even if he didn't know it was there, he didn't bother humoring you and checking himself. It's pretty rude.\n\nNTA btw", "Was waiting for a response to jump to something like drug addiction. Suddenly wanting privacy with your bedside drawers means you're hiding crack cocaine or something. Though his behaviour is definitely problematic.", "I definitely think the not apologizing is shitty, but I'm split on the getting mad about being repeatedly asked. It gets annoying, I get it. I think it's only a red flag because with hindsight, we know he was wrong to react that way."]}