{"id": 11477, "submission_id": "11ico5u", "title": "AITA for calling a friend “ran through” after she made fun of me for being a virgin?", "selftext": "I went to a small get together with my friends last night as and we got a little drunk and the topic of body counts came up.\n\nSo for context I am a virgin. I’m the only virgin in my friend group and they sometimes rib me about it in a playful friend way. I haven’t really had much luck in that aspect of my life and I’m in a pretty intensive degree program so I don’t have much time to party or meet women. \n\nOne of my friends is a bit promiscuous and is weirdly proud of it. When I say a bit I am very much downplaying how much she sleeps around. Now that’s none of my businesses and I have no right to judge what a woman does with her body, but if you asked me honestly, I’d say I just wish I didn’t have to hear about how much sex she’s having.\n\nSo we were talking about numbers and some of us admitted to our numbers. One of the guys made a comment that he wouldn’t date a girl with a body count over 5. I said I would agree with him and the aforementioned girl got mad. She had previously admitted to having a body count of around 75 so I think she took offense to what we said.\n\nShe snapped on him called him out on preferring a woman with a smaller count as he said he’d been with like 15 women. Now whether he deserved that or not is up to God, not me. But where I felt that she crossed the line is when she came after me because, as I’ve said, my body count is not near 5.\n\nShe told me I had no room to talk about what I want in a woman since I’m 22 and a virgin so clearly I am not at all what any woman wants in a man. So I won’t lie, my feelings were hurt so I popped back off. I told her that I’m more normal than she is considering she’s a ran through hoe that’s been with damn near 80 different men. I also think I may have called her fatherless, but I don’t exactly remember it happening that way. \n\nShe was either so upset or so hurt that we started crying. I felt bad, but not like I was in the wrong, she provoked my response after I did nothing to her. All the girls there were mad at me and called me misogynistic for saying that and the party ended pretty abruptly after that. I feel like she kinda deserved the clap back.\n\nAITA?", "created_utc": 1677962644, "permalink": "/r/AmItheAsshole/comments/11ico5u/aita_for_calling_a_friend_ran_through_after_she/", "score": 51, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole for telling someone that they are a ran through how and saying that they are fatherless\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Y’all are all childish af 😂 anyone who still thinks it’s a fun little topic to discuss sex numbers with friends is weird.", "ESH. Both her comment and yours were pretty shitty. Shaming others for their sex lives is beyond rude.", "This is a hard one! First I want to let you know there’s nothing wrong with being a virgin at your age and there’s definitely nothing to be ashamed of! We live in a weird culture where losing your virginity at a young age is a huge deal but it’s not! Losing your virginity is for when you decide you’re ready, not when someone else thinks you should. \n\nNext point, judging people off their body count is a bit skeezy. Obviously as humans we all have our preferences but to say someone is less than because they’ve had too little or too many sexual partners is rude. As you’ve said it doesn’t feel good when she takes shots at you for your lack thereof so it’s safe to assume it hurts when the opposite point is made. Now should she brag if she doesn’t want that point made? Probably not because people that get hurt or just don’t like you will always use that against you. \n\nNow last point, she took the first shot and you took one back. She shouldn’t dish out what she can’t take. Was it immature for the both of you? Yes, definitely! This just seems like it’s a topic you guys should stay away from as a group cause you guys can’t be nice to each other and there sounds like there’s some judge-mental people in the group.\n\nOverall, I’d say you are not TA for sticking up for yourself. However, how you handled it makes it an ESH situation.\n\nEdit to add: I missed the last tid bit about the dad comment which I feel was a bit fucked up and off topic. I still stand with my original judgement though.", "Okay, true revelation here.  I am not anywhere even close to my 20's.  I point that out because I do remember them.  I hung out with a pretty wild crowd in my younger years and I can tell you we never talked about \"body counts.\"  I'm telling you this because maybe you should consider the same in the future.  It's no ones business but yours, and a nice girl would be appalled if her name came up in a discussion of \"body counts.\"\n\nQuite frankly, I think everyone sucks here.\n\nESH", "ESH.\n\nY'all need to learn how to grow up and shut up.\n\nYour comment was certainly misogynistic, and the truth is you really have NO idea how many sexual partners she's had as it's very possible she has exaggerated herself.  She had no business shaming you for your sexual history (or lack thereof), though yours was absolutely the lower blow.\n\nUnless you are talking about criminal activity, people's sexual histories are their own business and all of you need to stop treating them as a basis for judgement.\n\nEdit to add:  If this \"friend\" ever speaks to you again and she really is telling you stuff you don't want to hear, THAT is the appropriate time to address it and let her know you don't want to discuss her sex life.", "ESH. You and that other male friend suck and were second hand judging her after she just said what her number was. What’s wrong with men and always putting women’s worth into how many men they’ve slept with?", "Remember, kids: you can't spell \"YEESH\" without the ESH.", "ESH. And you claim to be friends? You clearly don’t like each other.", "ESH. Your comment was shitty and so was hers.\n\nHope you can all be kinder to each other - maybe you could have a radically candid convo about how weaponising sexual histories is a poor choice amongst friends, even in jest.", "ESH. body count is dumb, all that matters is being safe.", "ESH: Y'all sound very judgemental", "ESH here. You certainly do sound very judgmental.", "You're all ridiculous", "ESH\n\nEveryone stop talking about everyone's sex life in a negative light damn it\n\nAlso if you went into such a rage you called her fatherless your worse too far  .... But she also sucks a bunch", "ESH. You are all dumb talking about numbers with each and more so teasing each other about it, the guy with 15 is an hypocrite for his opinion and you don't now waht live will bring so your opinion is pretty much baseless but she should not have insult you for it, but your response was over the top and you could had shut her up with a much less harsh response.", "ESH.\n\nI was tempted to go through each person and talk about *how* each was the AH, but frankly, it just seems exhausting.\n\nESH.  There's nothing inherently wrong with being a virgin at 22, and there's nothing inherently wrong with having a \"body count\" over 80.  To hell with judgmental asses.", "ESH. Here’s something that has stood me well for decades. Never get involved in discussions about sex politics or religion unless your are certain that everyone involved is going to be able to remain civil about it and not take offense at general statements.", "esh y’all act like freshmen in highschool", "ESH. OP is mad at friend for judging him on his sexual experience, friend is mad at OP for judging her on her sexual experience. Judging anyone on their sexuality is an AH move.", "ESH \nit’s called private life for a reason. 0 or 1000, if it’s a choice, it’s fine. Repeat until you believe it. Cause just like her, you are EXTREMELY judgmental.", "ESH", "ESH.", "ESH", "YTA.\n\nYour friend is a misogynist. Having a high count but expecting women to have a low count is the very definition of sexist.\n\nIf you do not speak out against misogyny in our society, your are complicit. It’s no different than if you sat there agreeing with racist things a friend said to another friend. You have to speak up.\n\nAlso, the fatherless comment was completely uncalled for. *She* is not at fault for her father’s poor choices.", "ESH. She shouldn’t have ran her mouth if she couldn’t handle the clap back. There’s nothing wrong with being a virgin and it doesn’t mean you’re undesirable. You’re not necessarily TA for coming back at her but your are for “I also think I may have called her fatherless”. That was off topic of body counts and had nothing to do with it and was uncalled for. You should have stuck to just calling her ran through.", "Honestly I’d say your both in the wrong. She had no right to say what she did and get mad about it as your comments were not directed at her and you had no right to say what you had to her. \n\nI understand in anger (trust me I do the same thing) you can say things that are mean and hurtful in the heat of the moment but still both of you shouldn’t have said anything to each other. \n\nI’d say if you both are willing to apologize to each other and explain your side of things to each other it may help make you both feel better and hopefully move past it.", "ESH\n\nI know i am going to get downvoted for this.\n\nBody count is stupid. The idea someone is more or less experienced based on the number of people they have been with is flawed. The idea that someone is pure or “damaged goods” depending on the number of people they have been with is flawed. \n\nYou clearly do judge her for her promiscuity/body count and you told her as much when you agreed with you “already has banged 15 girls, but only wants to be with women who have had sex with less than 5” friend. You were slut shaming every woman with a body count over five. \n\nSo while other people are saying she started it, you and your friend did with your slut shaming. Then you proceeded to openly slut shame her. That is why all the women there called you a misogynist. She should not have attacked you, but you decided to clap back and, in doing so, announced to everyone that you are the very much the sexiest incel she suggested you were.", "ESH. Her comment and your comment after weren't okay. It's okay to have preferences, I wouldn't want a guy with a body count over 5 because of many different reasons, it's like saying you wouldn't date someone who has blonde hair because they're not your type. Either way, let's be honest, if it was the other way round people would be completely fine with the comment, double standards anyone?", "ESH here, but mostly you. she's judgemental, but you're 10x more so and in denial about it, while also being a sexist. plus, anytime someone says they \"might've said something super hurtful in an argument but don't remember\" means they definitely did exactly that.", "NTA. If she didn't want people comments she should have kept her mouth shut.", "YTA. You got stupid just like she was getting stupid, and you had some feelings behind what you said. Good to examine. This culture of feeling ok with stooping to somebody else's shitty level is a losing, virtue-less game. Don't be an asshole.", "YTA. You insulted her first by agreeing with your sexist friend.", "YTA and a misogynist.", "Technically you’re NTA — if you can’t take it, don’t dish it. HOWEVER, whether you did so intentionally or not, you came off as very judgmental, as did your male friends. Y’all seem to have hypocritical and misogynistic viewpoints and that makes y’all assholes (although that wasn’t what you were asking here).", "Nta, dont dish it if you cant take it", "Hey man, you have a right to your preference. I am similar. I used to be very uncomfortable with my sexuality, my inability to trust this very important and intimate act with people I haven't known for very long, and my body. I started seeing a therapist. He gave me wisdom that I would have never been able to get elsewhere and has made me feel better in my own skin. \n\nIf you have that preference and feel uncomfortable giving yourself away to people, you don't need to feel insecure or bad about it. You are likely a mentally and physically private person and want someone who has the same values as you (I am the same way). Keep your chin up. She shouldn't have made fun of you for it. She had no right.\n\nHowever, you shouldn't have said what you said about her either. Some people use sex as a form of validation. Based on her reaction to what your other friend said, this is likely why she got mad.\n\nYour friend said something that made her mad. She said something that hurt you. You said something that hurt her back. This sounds like a normal fight between friends in their early 20s. \n\nI have plenty of friends that are promiscuous (male and female). They know how I feel about sex and my virginity. I know their views on sex. We understand each other. Try to understand her point of view. Maybe she uses it as validation or maybe she just likes having sex. Both are completely fine and well within her right as is yours to not pursue sex as both of our friends have.\n\nI am gonna say NAH. Everyone deserves to have their preference. Is your male friend hypocritical? Yes, but everyone is to some degree. I would never date a woman with anxiety. One of us needs to not be able to freak out over small, everyday life lol. You guys need to talk this out. Share your feelings. It may be hard as a man to do that (It was and still is for me) but it makes life easier and then your friends know what hurts you and what doesn't. \n\nGood luck friend. I hope things work out. \n\nTLDR - NAH", "Definitely not the AH. It’s her preference to sleep around with whoever she wants. It’s your preference to want to date someone with less sexual experience. Neither of you are wrong.\n\nHowever, she took your comment personally when she shouldn’t have and she lashed out at you. You responded in kind and then she acted like a victim. \n\nShe’s the AH, not you.", "NTA \n\nOP remember this quote “I refuse to apologize for responding to your provocation(s)”", "NTA\n\nShe started it by insulting you first so she had it coming. If she really thinks there is nothing wrong with sleeping around that much then she wouldn't have gotten so upset. I despise people who can dish it out but can't take it when it comes to insults, teasing etc. If she doesn't want to get clapped back she should keep harmful comments to herself.", "NTA, speak about a pot calling a kettle black. She shouldn't pick on you about your virginity and then be all Picchu face when her 75+ comes into play. What you said was harsh but she provoked you first, plus, if she takes pride in her sex life, I don't get why she gets mad when people point it out", "NTA. All cards are on the table when somebody comes at you (within reason).\n\nKinda funny how she’s trying to flame you for being a virgin. That’s 10x more desirable than someone who was ran through.\n\nYou’ll get tons of “YTA” or “ESH” because it’s Reddit, you’re a man, and she’s a woman. Flip this around and should it be a woman asking the same question, it would be a resounding “NTA”.", "NTA. you gave her a taste of her own medicine.", "YTA. You have incel energy and clearly were never really a good friend to her since you always thought so little of her.", "NTA.\n\nAll bets are off if someone opens that kind of door. Don’t dish it out if you can’t take it.", "NTA. No one would have any issues saying this is the sexes of everyone involved was switched.", "YTA", "NTA. She is probably self loathing and taking it out on you. Her lack of self esteem is medicated by sleeping around. Everyone has their own vice. Sex must be hers.\n\nSide note: Referring to it as a \"body count\" is a rude way of people distancing themselves from what they are really doing by playing fast and loose with their own body. Stop calling that and recognize it for what it is really is. There is nothing empowering or good about abusing the body this way or in using people for sex.", "Why do a lot of women get mad when a man expresses their preference? It's something that puzzles me. The friend said body count no higher than 5. That's where the situation started. She was wrong for getting mad at that. That's what kicked the situation off. She was in the wrong.", " NTA tbh. Absolutely nothing wrong with being a virgin.", "NTA\n\nYou’re not misogynistic so don’t even listen to that she literally shamed you first when you said what you preferred everybody is allowed to have a preference she should’ve never said something and dished out when obviously she can’t take it back. She had no right to feel the need to shame you and tell you that you’re not what any woman wants because you’re a virgin that’s not right. The reasons for you being a virgin is your business and your business only just like her having a high body count is her business only however, she brought everything out on the table when she decided to shame you first so that’s on her.", "NTA.  Truth hurts", "NTA. Don't dish it out if you can't take it.", "75 bodies is crazy", "ESH. But you’re not wrong. 80 men? In her early 20s? Jesus.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI went to a small get together with my friends last night as and we got a little drunk and the topic of body counts came up.\n\nSo for context I am a virgin. I’m the only virgin in my friend group and they sometimes rib me about it in a playful friend way. I haven’t really had much luck in that aspect of my life and I’m in a pretty intensive degree program so I don’t have much time to party or meet women. \n\nOne of my friends is a bit promiscuous and is weirdly proud of it. When I say a bit I am very much downplaying how much she sleeps around. Now that’s none of my businesses and I have no right to judge what a woman does with her body, but if you asked me honestly, I’d say I just wish I didn’t have to hear about how much sex she’s having.\n\nSo we were talking about numbers and some of us admitted to our numbers. One of the guys made a comment that he wouldn’t date a girl with a body count over 5. I said I would agree with him and the aforementioned girl got mad. She had previously admitted to having a body count of around 75 so I think she took offense to what we said.\n\nShe snapped on him called him out on preferring a woman with a smaller count as he said he’d been with like 15 women. Now whether he deserved that or not is up to God, not me. But where I felt that she crossed the line is when she came after me because, as I’ve said, my body count is not near 5.\n\nShe told me I had no room to talk about what I want in a woman since I’m 22 and a virgin so clearly I am not at all what any woman wants in a man. So I won’t lie, my feelings were hurt so I popped back off. I told her that I’m more normal than she is considering she’s a ran through hoe that’s been with damn near 80 different men. I also think I may have called her fatherless, but I don’t exactly remember it happening that way. \n\nShe was either so upset or so hurt that we started crying. I felt bad, but not like I was in the wrong, she provoked my response after I did nothing to her. All the girls there were mad at me and called me misogynistic for saying that and the party ended pretty abruptly after that. I feel like she kinda deserved the clap back.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH", "YTA. The concept of body count is very misogynistic.", "Man some people think it’s funny ok to make fun of people’s sexual history and then when someone does it to them they….. take it like an adult? No, they start crying. \n\nGreat example of not throwing stones if you live in a glass house.", "ESH. You all were rude to each other here. I don't get everyone's obsession with sharing their sex lives with everyone who will listen and trying to shame each other for it. If you're a virgin there's something wrong with you. If you sleep around too much, you're a bad person. Our culture shames people for everything and that can't be healthy. Maybe we should all try to be a bit less judgmental and crappy toward one another.   You know what? Being a virgin is fine. Having had 75 partners is fine (as long as you're being safe). Who cares.", "NTA, she wanted to give shit she couldn't take back. If having her actions called into question bothers her, then she knows she's wrong.", "I feel like if the roles were reversed, and you were a woman who insulted a man for being a virgin after he first shamed her for having a high body count…all the comments would say “you go girl!” and “queen” and there would be a lot of upvotes. \n\nSo I’m gonna say NTA for you.", "NTA. It's like people want to do stuff and not deal with the consequenses. If she provokes and pushes you, then she will get a response. Simple as that. \n\nAlso, next time, don't sit with her in those games, or simply say to your friends that you don't want to be a part of that anymore since they obviously takes pride in hurting you - playfully or not. \n\nOh, and also, you're not wrong for being a virgin, if you question that.", "NTA, so she can shame you for being a virgin but nobody's allowed to say anything about her? I\"m a woman and I'd much rather be with a virgin than with someone like her who has sex with everything that moves. If she's so proud of her choices then why does she get so triggered by the fact not everybody's gonna want to be with her because of it? People are allowed to have standards. Clearly she just doesn't like the fact actions got consequences.", "Eh, 75 could be a lot. And I guess where you're coming from, but don't low blow it. And what about saying something like fatherless? Huh? Y'all need to get your shit together and admit y'all need to take a little hit for what you said. Preferences are fine but seems like the first guy was definitely taking a jab but she had no reason to react like that. I'm not like other girls and I like my 1 body count to stay that way. So I'll say no more. This is on you budd.", "ESH you all need to grow the fuck up", "Not true promiscuity breeds disease in most cases in the literature.", "“I just wish I didn’t have to hear about how much sex she’s having”. \n\nI have great news for you, OP! Next time your friend starts talking about her sex life, you simply say “Hey friend, I’m glad you trust me with this private info but I actually don’t like hearing about my friend’s sex lives, so let’s change the subject.” \n\nYou are an active player in your life, not an object that things happen to.", "I agree with you but my only take away from this is while it is her own business she is making it everyone else’s by constantly talking about it. If you want it to stay your business keep it to yourself so comments like these aren’t made.\n\nEdit to add: Her comment was also a very low blow, she was very clear with her intent and purpose to damage his self esteem by saying “you’re not at all what any woman wants in a man”. It was childish on both their ends.", "We said nothing about her.\n\nShe took offense to a comment we made about our own personal preferences. Obviously our feelings have no impact on her ability to attract men", "This right here... I also almost wanna ask old school virgin or the one where you consider yourself a virgin just because you haven't slept with anyone.", "This. ESH. She crossed a line but so did definitely OP.", "That was one of my dads “rules” growing up (waaaay back when) it was said so many times- it was never discuss religion or politics with relatives or at the dinner table", "Yes! This😂", "I wasn’t judging her though. Not until she judged me", "What if a woman was asking this same exact question?\n\nWhat if a woman came on here saying that she was roasted for being promiscuous for no reason and decided to respond by making fun of the perpetrator’s virginity?\n\nIt would be a resounding “NTA”. This is a double standard that is being exposed. OP never insinuated he was referring to the friend or ridiculed her for her decisions. He merely stated he had a preference. \n\nOP’s friend decided to go bananas and make this about her. She’s the AH here. *Everyone is entitled to preferences and OP was merely expressing his in a conversation everyone was willingly engaged in*.\n\nActions have consequences. Clearly they don’t judge her for her decisions, they’re still her friend. The simply stated that wasn’t their **preference**. There’s nothing wrong with that. \n\nOP’s friend made this all about her. That’s her problem. Clearly she’s a bit self conscious because nobody even came at her. She opened the door to it and didn’t like what was on the other side.", "Umm op doesn’t sound judgmental or mysat all. What’s good for the good for the gander. Ole girl should’ve sat there and ate her food", "I disagree. She decided to take offense to something that didn't even involve her. Her and others in the friend group started it with constantly making jokes about OP being a virgin. She is the dumbass for making it about her", "They are a sexist just because they personally choose for themselves that they wouldn't wanna date a person with a certain body count?\n\nWhat kind of nonsense is this.", "OP was getting flamed by his promiscuous friend for being a virgin for no reason at all. OP has every right to defend his choices and decisions, as does his friend. The difference is OP’s decisions are much easier to defend and his friend knows that. The only reason this is an issue is because OP’s friend knows they’re right and is deflecting. OP’s friend also knows that being a virgin is hardly an insult, regardless if she’s trying to make it one.", "Its not insulting to not want to sleep with someone because of their personality traits", "You’re kidding right?", "I disagree that she provoked first. OP and his friend who wouldn't date/have a relationship with someone who had more than 5 partners did.", "Maybe consider why, in your mind, someone being a virgin is better than having had multiple sexual partners.", "I’m not an incel and I was friends with her, like I said it’s none of my business. I don’t see why she felt the need to make my sexual history her business and come at me like that", "reason?", "Because its misogynistic. Men are not held to the same standard.", "Well, for most people it's a lot.  However, I think it's reasonable to say that any young woman who's not clearly unattractive, who likes to have sex without having a relationship and who's not afraid of letting guys know, can easily get to 75 per year just by hooking up with a different guy every Friday and Saturday outside of periods.", "It is https://srh.bmj.com/content/46/2/100", "who cares", "How is it ESH? She came at him first? I’m a firm believer that the retaliator is never the asshole (within reason).", "Shaming people about it isn’t a cure to the (non-relevant to this discussion) problem you raised.", "Having a lot of sex doesn't mean you don't use protection ding dong", "People's sexual histories should not be the basis for judgement, period.\n\nIf she's oversharing, he needs to call her out on it, but in the end, treating someone as if they are worth less as a human being solely because of how many sexual partners they have (or haven't) had is just plain wrong anyway.", "Okay, so if she started talking with another girl who was present, saying she'd never be with a virgin because they're probably awkward and awful in bed, would you not feel like that's an inadvertent dig towards you?", "Okay. Let's play this out. Why don't you want to be with a woman who has had more than 5 partners? What difference does that make to you? What are you thoughts and opinions about women who have had more than 5 partners?", "It seems clear from the way that you worded your post that even if you don’t intend to consciously, you passively look down on this friend for her sexual endeavors. For example, you have the preference to not sleep with a woman who’s had over 5 partners, but how does that effect that hypothetical woman’s worth? Or her quality as a partner? Or how good of a person she is? It’s clear that simply based on your friend’s body count, and her “promiscuity”, and your need to “downplay how much she sleeps around”, you look at her as less of a woman and less of a person, even if that was never what you intended. \n\nShe’s absolutely an AH for being rude to both of you, but you and all your friends are the ones talking about body counts and sex  in the first place! If you don’t want to hear about sex, say “hey, I’m feeling a little weird about all of us talking about our sex lives, let’s change the topic,”. Also, you admit to maybe calling her fatherless, which is rude, unrelated, and a really messed up low blow when you include it in reference to body count and sex. \n\nYou say she judged you first, but, if you’re talking about body counts and how any woman with over 5 past partners is not good enough for you, that feels a little bit judgy, especially when she’s in the room. In the future, just don’t talk about that stuff. It’s weird and it saves drama. ESH", "By saying you would prefer someone with a low body count you were judging people with a high body count, which is what your friend took offense to. If you really weren't judging, you would have said body count didn't matter. Her response was very judgy and inappropriate too. You all acted very immaturely, so I stand by ESH.", "If your preference is to have a woman with a low count when your own count is high, that’s not a preference, that’s misogyny. \n\nI was married to a man like that. Had over 100 partners yet preferred women who had less than 5. It was 100% absolutely rooted in misogyny and beliefs that women with higher counts are damaged, yet it was OK for men. \n\nI have no empathy for either of them. If they’re gonna say dumb things like that around women, they can’t act all sad and shocked when they are called out on it.", ">Clearly they don’t judge her for her decisions, they’re still her friend.\n\nJust because they're friends with her doesn't mean they're not judging her. \n\nHer comment re: OPs friend being a hypocrit was completely correct. I don't know why shes gone off at OP though.", "I think it's only sexist if that number is lower than theirs, that is a double standard. If 2 virgins decided they had a preference to only sleep with each other, it wouldn't be a problem for these people saying it be judgemental to have a preference of a body count", "OP wasn't \"getting flamed\" for no reason. Like I said, he insulted her first by agreeing that 5 was the maximum acceptable body count. That was clearly aimed at her. Yes, she lashed out at him. But given how judgmental he is (and you are too, by the way), I don't blame her.", "What personality trait does having more than 5 partners signify?", "They provoked her by talking about their boundaries? Are you for real? People are allowed to have standards and she's the one who got triggered by the simple fact not everybody would be okay with dating someone like her. That's on her. Actions have consequences", "The number of sexual partners determines a lot and, imo, a representation of their morals. \n\nAccording to studies, people who have had higher numbers of sexual partners, or have impulsive tendencies, are more likely to cheat.\n\nWe’re not talking about a few partners here. We are talking about a girl who had been ran through. There’s a big difference between 3-5 and 50+ sexual partners.", "Don’t listen to this guy the word incel gets thrown around on Reddit like it’s fucking confetti. You are entitled to lose your virginity when you are ready,  not on someone else’s time line! And you definitely shouldn’t be shamed for it either.", "Incel means involuntarily celibate\n\nYou mentioned all the women think you are a misogynist after what you said so it’s a good thing your celibacy is voluntary because it doesn’t sound like anyone wants to be with you now they know who you are. \n\nSlut shaming is unattractive even to women with low body counts", "There is nothing misogynistic about preferences.  Women will often have a laundry list..certain height..income..body type etc. Attraction and preferences are linked. No women gets to decide a man's preferences. As the saying goes \" my body my choice\"", "That’s terrible behavior why would you want to do that it’s disgusting", "That's a weird study, comparing people with 10+ sexual partners throughout their lives to people with 0-1 partners. Where do they find the 0-1 people?", "Technically he and the other friend came at her first when they said they wouldn't date anyone with a count over 5.\n\nBut even if you ignore that, his was the much lower blow, with the \"fatherless\" remark that went completely beyond the (inappropriate) topic of conversation.", "Well your opinion is yours if you stamp it out at the source it wouldn’t be an issue and this question wouldn’t be asked so it’s quite relevant", "I cannot agree with you more! They both did the same thing, she shamed him and he shamed her back. It’s just on polar opposite sides. They’re both in the wrong.", "There’s nothing wrong with preferring someone you date to have a low body count. It just means you both probably have similar views on sex and don’t view it as a casual thing. It’s not shaming people that have high body counts, but just wanting someone that views sex similarly to you.", "I would ideally prefer be with someone who is also sexually inexperienced as there’s less pressure to perform and we can grow together.", "God why do you feel like policing people's preferences? Someone with such a high body count clearly views sex as nothing and not everybody is comfortable with that, if for me sex is something that matters and that I want to share with somebody I love, then I will choose somebody with similar views or I'll feel like just another name on their list. And I'm a woman so yes it goes for men too, so don't even try to accuse me of being mysoginistic. Stop trying to turn promiscuous people into victims just because they're not everybody's preference.", "Having a preference for people who have not slept with a lot of people is not judging IMO. I, as a woman who has slept with more than 5 men wouldn't want to sleep with a man who has slept with 75 women, that's gross to me. If someone wants to sleep with that many people, more power to them, do you. Now the problem is when the double standard comes in, like the friend who has slept with 15 women but doesn't want a woman who has slept with more than 5. That's where the misogyny comes into play.", "How? I also prefer taller women, is that judging short women?\n\nI wasn’t judging her. I made a comment about my own personal preferences and she decided to take offense to it", "OP said like a dozen times that he is a virgin. What the hell are you even talking about?", "Yeah, funny thing. I’m a virgin. Why is it misogynistic for me to want to be with someone who has had a similar number of sexual partners as me?", "How did he insult her by expressing his preference in a conversation everyone was a willing participant in? It’s not like he said, “yeah, I’d never dare [OP’s friend’s name] because she has an astronomical body count”.\n\nEveryone is entitled to preferences. OP’s friend made this about her. That’s her problem. It was merely a discussion that she blew up and thought was about her. Kinda narcissistic.", "I don’t want to date her at all regardless of her body count. How could it be aimed at her.", "That you view sex as casual and don’t ascribe to a traditional system of personal morality.", "Because sex feels good and there are lots of safe ways to have sex with people! Hope that helps", "No one says you have to do it, but stop being judgemental about other people's lifestyle.", "Are you setting me up for the filthiest joke in history?", "They didn’t come at her at all. Them stating their preference is not then coming at her. She obviously has a problem with her own promiscuity, because she had absolutely no reason to come at Op like that. Everything isn’t a slight", "Clearly Reddit disagrees", "Except OP specifically stated that it started with the friend who did NOT have a similar body count, she was calling out the double standard.", "What on god’s green earth?  A ton of people who have slept with <insert whatever number here makes you uncomfortable> don’t view sex as “nothing.”  Good for you for only wanting to have sex with people you love; go nuts (or don’t!).  But don’t sit there and make a value judgement on how people view sex just because they’ve had more of it than you.", "You don't think 'gross' is a judgment? Of course it is.", "The fact that you can say you weren't judging her when by your own admission you called her \"run through\" (regardless of \"who started it\" - are you 5??) shows you DO judge her. You can have personal preferences all you want, that's fine. But clearly, by the way you wrote your post and the way you responded to your friend, you do judge people who sleep around. Your \"friend\" was unkind to you, and you were unkind to your friend. It makes you both assholes in this situation. If you think there is nothing wrong with how you reacted and the things you said to your friend, then you are just not a very nice person.", "They aren’t responding to OP. They’re responding to a specific comment. 🙄", "Read what I wrote more closely. You refusing to speak up against your friend for his misogynistic viewpoints is the problem.", "If you met someone who was perfect for you, you got on super well, had similar values (sex aside), got on great with your family, supported and encouraged you- but then you found out she'd slept with, 30 - 50 people would that stop you from continuing the relationship with her?\n\nPersonally, I can understand wanting to be with someone who's had similar levels of sexual experience as you. However I wouldn't automatically rule anyone out because of it. \n\n For example, i would be put off being with a guy who was a virgin, or who had only been with 2-3 people because, in my experience (and this is no offense to you OP) guys with less sexual experience tend to be more judgemental & closed minded which is not my bag. But if they were otherwise great for me and didn't have the qualities I don't appreciate then I'd continue the relationship with them. \n\nFor my verdict - ESH. Your friend deserved it but I don't know why she came after you like that, YTA for going to that level with her. \n\nIf I can give you some advice - go talk to her. Apologise for getting like that with her and tell her why you did it. I would also tell her you feel uncomfortable hearing so much about her and others sex life - take some time to think about derails your uncomfortable hearing and tell her that - you're allowed to have boundaries about other people's sex life", "Because judging a woman for her body count is gross, no matter how undignified you might find her open discussion of her sex life.", "No one's saying you have to date her. But given the way you told the story, it seems clear she felt targeted by your friend imposing a 5 body maximum on women, and by you agreeing with it. That's a very sexist position to hold (especially if he thinks it's ok for his count to be 15) and you both sound like misogynists.", "I want to hear that joke as long as it is not sexist.", "It's not OP's responsibility to correct what other people say. OP merely agreed that he had the same preference of a low body count. Is that guy a hypocrite? Yea, seems like it. But OP doesn't have to be a white knight 24/7 correcting other peoples behavior. If that guy was being an asshole directly at OP, I'm sure OP would've dished something back. But because Ms. Body Count Higher than IQ decided to insult OP, OP decided to just throw the same shit back.", "I have news for you, majority of men would prefer a woman who was selective about her sexual partners. \n\nDon’t let the downvotes fool you. Go ask any dude on the street. 95% would agree with that statement.", "I was talking about myself and my own preferences she has no reason to take offense to my own preferences. I happen to know she doesn’t like men who have full lips. I have full lips. Does that give me license to attack her?", "Actually, when men are misogynists, it is the responsibility of other men to call them out on it. \n\nIf the friend had said something racist in the presence of a POC, OP would have been responsible for saying something. The same principle applies.\n\nAlso, the fact that OP called her “fatherless” as an insult shows he is just as misogynistic. When a female is fatherless, the blame is 100% on the father, it is not an insult towards the female.", "Wow, most men have bad opinions about women’s sex lives? I’m shocked! Thanks for setting me straight.", "Being attracted to certain features in a person isn’t the same as judging a woman for enjoying sex. Glad I could clear that up for you! Also, you should maybe think about why all the other women were mad at you too.", "I’m sure there’s a high percentage of women that wouldn’t want to be in a relationship with a guy who slept with 80 women by the age of 22 as well as they’d consider him a playboy etc. Everyone is entitled to their own opinion. Whether we agree with it or not. I personally am of the opinion that whoever a partner has been with prior to being in a relationship with me isn’t my concern but I don’t force my belief onto others.", "More sexual partners = less overall value. \n\nNobody is eager to wife a woman up who has 50+ sexual partners at 22. That’s gross. These type of women often move away to find their love or get a man who doesn’t ask / care.", "I never judged her for enjoying sex until she judged me for being a virgin", "No one actually gives a shit that you're a virgin! Men aren't stigmatized for being virgins the way women are stigmatized for being promiscuous. It's not even close. The things you called her are far worse than anything you had to deal with. And again, every other woman in the room recognized you for the misogynist you are. So look, if you came her for valorization, there are plenty of men in these comments who will give it to you. But if a group of women all agree that you're being sexist, then you're being sexist. Deal with it.", "That isn’t how it works\n\nThat’s like saying “I am not racist because I only used a racial slur after they attacked me” \n\nMaybe you didn’t openly judge her for enjoying sex, but the slut shaming came out pretty easily."]}