{"id": 11491, "submission_id": "11iipr5", "title": "AITA for telling my(28f) husband (28m) that his daughter is ugly", "selftext": "So my husband has two kids (7f and 4m) from two different long term relationships in which he ended up being cheated on. When we were dating, I used to keep a diary in which I would disclose every detail of my thoughts and emotions.\n\nMy husband found my diary and took it upon himself to read it. He was really upset one day and I asked him why. He finally went on to say that he read my diary and didn’t know if we should even be together because I wrote in there that his daughter is ugly. I did not out right say that to him. It wasn’t for him to ever read. I haven’t written in my diary since but I really hurt his feelings. I think she’s a kind and sweet child. But she’s not pretty to me at all.\n\nWith our own child here now, he likes to say “I’m batting 3 for 3” while looking at me for confirmation. I don’t say anything but I think to myself “1.5 out of 3 ain’t bad”\nI never say anything bad about his other kids and I treat them like my own. AITA\n\n\nEdit: I appreciate y’all bullying me online and in my dms. Y’all probably got bullied as a child by other kids/parents/stepparents etc and this is a trigger for you. I understand that.\nEveryone has thoughts. Anyone who’s had a diary knows most entries are a form of therapy and used to figure out your own thoughts and emotions which is why it is so private. My husband and I have moved past this incident. As I have never mistreated our kids and never will. My opinions have/will never overshadow me pouring into the kids to make them strong and confident in themselves. They won’t ever hear such negativity from me because I know the damage it can do and have seen it first hand. \n\nThank you to those not acting like they never thought a person was not “pretty”.", "created_utc": 1677977326, "permalink": "/r/AmItheAsshole/comments/11iipr5/aita_for_telling_my28f_husband_28m_that_his/", "score": 2543, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the AH because I think his daughter is ugly. Was it wrong to write that in my diary?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH. Yeah, he shouldn’t have read your diary, but why on earth would you comment on a small child’s looks in your diary?", "ESH. What kind of a grown adult writes in their diary that a 7 year old girl is ugly? That’s so weird.", "ESH\n\nHe definitely shouldn't have invaded your privacy.\n\nBut also my god, I cannot fathom any context that would justify you saying something so cruel about a child's appearance.", "If it had just been him reading your diary, I would say n t a, but your comment about “1.5 out of 3” means you are actively still comparing your children’s looks and that is super icky (+ your math doesn’t add up). YTA for that.", "He shouldn't have read your diary. But absolutely YTA because your \"1.5 out of 3 ain't bad\" says a lot about you and how you categorize those kids, and whether you want to admit it or not, they will eventually realize this about you. I don't blame him for questioning his relationship with you.\n\nSomeone is definitely ugly in your house and it isn't any of the children.", "Everyone sucks here\n\nHe shouldn't read your stuff not his too read\n\nYou shouldn't talk that way about a kid and the everytime he says I'm batting 3 out of 3 and your like 1.5 ain't bad ( so I guess you think his other son is what .5 okay looking?  \n\nYou judging kids looks in journals or in your head or outloud make you an ass", "ESH.\n\nGross, gross, gross, all of this.", "ESH.\n\nBut seriously, you’re a grown woman, spending your free-time writing in your diary about how ugly a 7 year old little girl is. You have some serious issues with yourself.", "ESH-He had no business violating your privacy by reading your diary but only an asshole finds a child so ugly they have to write about it.", "ESH.\n\nHe’s very clearly in the wrong for reading your diary. But who the hell thinks about children like this? Especially children that you claim to love.", "Can you explain the 1.5 out of 3 comment?", "I’m going to go with ESH. You’re entitled to your private thoughts and your husband had no right to read your diary.\n\nI don’t understand why you felt you needed to write that down and I hope your SD doesn’t pick up on those feelings but I’m guessing you’re not as sly as you think you are.", "Eventually, most diaries get read by someone other than the writer.  Writer dies, diary continues to exist.  Stepdaughter might well inherit this book of yours.  That’ll be fun for her.", "The math ain’t mathing.", "So let me get this straight period you thought so much about how his daughter was unattractive to your ideal aesthetic for a small little girl that you felt the need to write it down in your diary period you got about this so damn much that you wanted to permanently document it somewhere create and then comma because you don't seem to be the smartest cookie in the package comma your site to go on the internet to try to get validated for documenting that little girl was ugly. And you don't even try to hide the fact that you still think that in your head. And the only reasonable explanation you give according to you is that people are allowed to have their opinions? My guess is that you Harbor a lot of hidden jealousy for first baby mama. Maybe she's more attractive than you. Or maybe she's A different race than you and you're racist? Is the daughter's skin a little too light for your taste or a little too dark? Are you threatening that that daughter has a father and the mother who love her dearly? Are you afraid that her daddy loving her is going to take away from your little goblin? You know what? I'm going to go ahead and call you a bad mother for this. You are a bad mother. Look in the mirror. What you were looking at is a bad mother. Because there is no way in hell anybody who wants to be a good mother and a stepmother will go through the trouble of a documenting down on paper the fact that she thinks a little girl is ugly. You're shameful. YTA. Do your child a favor and get some therapy before you mess them up.", "You both are TA. \n\nWhy you look at a child & start judging them is crazy. And then to write it down. Imagine if she ever came across those. \n\nHim bc he had no right to read those journals.", "He shouldn't have read your diary, but tbh I would also question my relationship with someone who felt the need to write about how any 7 year old child is ugly, let alone their own stepdaughter, so y'know, ESH", "ESH, he read your diary, you feel so strongly about a seven year old looks to write in your diary, that she's ugly. Poor kids, I hope you both treat them better than this post suggests", "ESH. y'all are children", "\"1.5 out of 3 ain't bad?\" What kind of weird, mean-spirited crap is that?  I don't even know how to rate this because it's just such a bizarre question.\n\nESH. Him for reading your diary, and you for \\*gestures broadly at all of this\\*", "ESH\n\nA diary is suppose to be a personal, and private, book to write your own personal thoughts and feelings. Him snooping through that is a deep invasion of privacy. But honestly I don’t know if I totally blame him for having insecurities or trust issues after being cheated on twice by his last two partners.\n\nYou also suck for even mentioning that his kids are ugly. They’re kids ffs. Also, wtf is, “1.5 out of 3 ain’t bad,” even mean? It’s like you don’t think your step kids are worthy of even half a point. Jfc. The hell is wrong with you OP? You’re showing clear favoritism to your own child.", "ESH \n\nYou two are well matched.  He has no respect for privacy, and you have no compunction about writing down shallow and cruel thoughts about a child. Imagine if she had found your diary.", "While no one should invade the privacy of others, what kind of grown ass adult writes about the appearance of a small child? How empty is your life that this is what you choose to write about in your diary?", "YTA. I think we know who the real ugly person is here… (hint: it’s the evil stepmom that posted this)", "YTA. Not for writing it in your diary. That’s your business and he had no right to go nosing around. But for the 1.5 out of 3 crack. Even if it’s in your head. Let me guess, your kid is the 1. The step son is the .5 and the step daughter is a goose egg. \n\nThat kid deserves to live with someone who sees the beauty they have, and she does have beauty, I’m sure. But you’re shallower than a puddle on a hill.", "ESH. He shouldn't go through your diary, and while they are your private thoughts it does seem a bit assholeish to judge a CHILD's appearance so much that you felt the need to make a note of how ugly you find her.", "\"1.5 out of 3 aint bad\"  \n\n\nAre you doing the math incorrectly or are you trying to say that his other kid is only half good-looking?", "ESH - Hubby shouldn't read your diary for any reason. You on the other hand, while allowed private thoughts, seem pretty shallow to be writing about a child's looks. Were you a mean girl in school?", "Jokes on you.\n\nHe means he’s batting 3 for 3 for terrible choice in partners.", "Just FYI, your kid isn't as cute as you think it is, either. It's just mom hormones. So GTFO of here with that \"1.5\" BS.", "ESH - \n\nHe absolutely should not have read your diary. That was a gross invasion of privacy. \n\nThat you are vain enough, and obsessed with appearance enough to judge children that young regularly on their appearance….You need therapy. Serious therapy on body image issues. Even if I was incline to give you pass on your initial reaction to your step-daughter’s appearance (because appearance can be more important before you know someone enough for personality to come into play), I can’t. That you felt the need to detail in the post that you regularly think about BOTH of his children as being unattractive (1.5/3) means you definitely don’t deserve the benefit of the doubt. \n\nYou both qualify as TA, and just a heads up, this has probably done irreparable damage to your marriage.", "Yes, he sucks for reading your diary, but my god, what is wrong with you that you would call a little girl ugly, even in private? \n\nYTA", "Why would you even write that about a child, regardless if you thought anyone would read it? ESH - him for reading your diary, you for ugly thoughts", "ESH. You are as shallow as a saucer. \n\nShe’s a child! One who is almost certainly becoming aware of how you see her. \n\nYour husband sucks for reading your diary but you need to realise that people are worth so much more than what they look like. \n\nOne day you will be old and nobody will think you look good anymore. I hope you remember how you thought of this child when that happens", "ESH. He shouldn't have read your diary, but it's gross and weird that you felt the need to write that in the first place. What was even the context of it? \"Had a lovely day with husband and his daughter today(btw she's ugly)\"", "Personally, I could not be with a person who ever said one of my children is ugly, it would just give me the ick.", "I think this issue is far secondary to the fact that your husband read your diary, which is very concerning.", "YTA for judging a child's appearance. But why does he say he's \"3 for 3?\" Unless I misunderstood, it seems like physical attractiveness is important to both of you. I don't get it. There are so many more important things in life.", "There's always the chance that his fourth babymama won't have the conscience of an insect, so there's hope for the supposed \"ugly\" child yet.", "YTA. The thoughts you choose to practice inform your actions in implicit ways that are invisible to you. The fact that you even choose to give thought to evaluating the attractiveness of a child tells me what kind of role model you are for those children.", "Girl this is embarrassing for you, a child really? I mean ESH because he shouldn't have read your diary but damn", "YTA. My jaw dropped reading that you think he’s batting “1.5 out of 3”. Are you so shallow and stupid that you think physical appearance determines a person’s value? Character and intelligence matter too, and you seem to be lacking both.", "ESH. He shouldn’t have read your diary. But seriously, you actually think his kids are ugly? What the hell?", "ESH. He broke your trust by reading your diary but you more than him because you have HS bully vibes with a 7yo.", "ESH, he's TA for going through your private diary, you're TA for not keeping those thoughts to yourself, and by that I mean in your head. Honestly, it's a good thing your husband found the diary and not the daughter, I'd hate to think how upset she'd be if she found out what her stepmother really thought of her.", "Weird as fuck. Why would you even comment this in your diary? Or anywhere? Like why do you care what a child looks like? Writing it down in a private place may not seem like a big deal, but that thought is always in your mind and memorialized. You may be the only adult woman in her life. What would she think knowing you said that? Even if it’s true in your mind, just keep it there. There is no positive to writing this out.\n\nI just never saw a young child and thought to myself “Wow, that is a very pretty/ugly child.”\n\nAnd your last sentence is concerning. You you never say anything bad about his other kids? Does that mean you still say bad things about the daughter? I am not sure why people are saying NTA here. OP sounds like she belittles her step children. Not cool.\n\nHe’s an asshole for looking through your private stuff.\n\nESH", "Yeah ESH…\n\nI was going to rant about him invading your privacy but that last paragraph shows your true colors also…neither one of you come out of this story as good people", "My step mom for sure thought I was ugly, and tried to gently help in a few ways. I am still a bit insecure about it. She was also a pretty caring step-mom though, and tried to keep her own issues from affecting me.\n\nIt's not a great thing but it's only a small part of the whole of how you conduct yourself with your step-daughter, is what I'm trying to say. Don't let this be a big part of your relationship, or it'll suck more.\n\nI don't have a judgement, just opinions here lol.", "There is so, SO much wrong about this entire post. I just can’t even. You are both epic jerks.", "ESH i mean, it was wrong of him to invade your privacy but it is assholeish of you to write down how you think his kid is ugly. I mean she IS your stepdaughter, she is part of your family too you know.", "The pettiest shittiest meanest way to criticize someone, especially a child, is through their appearance. First, no one can control what they look like. Second, beauty is subjective. Your husband is a jerk for reading your diary, but you are one too, for judging the girl on something so radically out of her control. ESH, but mostly you.", "YTA. I don't think it's wrong to think a child isn't that pleasing to the eye, but I wouldn't write or say that my husband's child is ugly. No one should ever look in your diary though, but that's a really nasty thing to say about your stepchild.", "YTA for thinking “1.5 out of 3 ain’t bad” years after you wrote about your stepdaughter being ugly. I honestly doubt your husband would married you if he knew you thought about this enough to commit to paper.", "Given your other comments (he goes above and beyond for his other 2 kids) and you’re pregnant with #2 it really sounds like you resent them and the time he spends with them. He should not have read your diary, that’s an invasion of privacy, but ESH with the whole situation", "I’m going to go with NTA. You’re entitled to your private thoughts about whatever you want. \n\nI think everyone saying you’re TA because of what you wrote your diary is being dishonest with themselves. We’re human, we don’t look across a crowded room and admire someone’s personality. Thinking/writing in your diary is a different level from saying it out loud.", "ESH. He shouldn’t have read your diary. That’s a given and tbh I would break up with someone for that kind of invasion. But while others have said your own private thoughts are your own, what kind of person feels the need to note in their diary that a young child is ugly?? You have ugly thoughts, OP.", "This has to be fake.", "ESH but you’re shallow and it will catch up to you.", "I don't think he should have read your diary but why are you concerned with how a 7 yr old looks??", "OP, how would you feel if you found out that your husband thinks your own kid is ugly? You KNOW you’d be angry.", "ESH. He shouldn't have read your diary. That's a huge invasion of your privacy. The whole point of a diary is to write personal thoughts you don't want to share with anyone else. If you read anyone you know's diary, you're very likely going to walk out feeling offended, be it personally or on behalf of someone else. \n\nYou never said anything negative about his daughter to him and if it's true that you don't ever treat her or her brother differently than your own child, then you're ok in that regard. But I personally think you do suck a bit for fixating on a little girl's appearance and judging her for it, enough to feel the need to write it down in your diary, and enough to still make snarky remarks about it to yourself when your husband brings up your children's appearance. \n\nGranted, we all think some people are ugly, including children of all ages. But I can honestly tell you I don't remember having ever put enough thought on a child I thought was ugly as to write it down anywhere or have recurrent negative comments flooding my mind about it.", "ESH he shouldn’t have read your diary.\n\nAs for you: stop judging your stepdaughter’s appearance! Not only do you write about her being ugly in your diary (obviously you can write what you like in your diary, but if you’re going to write stuff like that you need to find a hiding place where no one ever finds it), you’re standing there while he is telling you how great he thinks *all* your kids are and you’re thinking “yeah except for that ugly one”. Sheesh lady, she might not have the prettiest appearance, but you have ugly thoughts.", "Hard to believe someone could write this without realizing they were in fact a giant AH. \n\nWho writes in their diary that the toddlers of the person they are dating are ugly!?!? Like seriously WTF????\n\nI wonder how you treat your ‘ugly-stepchild’.", "I see this is getting a lot of comments, but I hope you’ll read every one. \n\n\nI cannot emphasize enough how completely and totally bizarre it is for you to have the thought that a 7 year old child is ugly, let alone find that thought innocuous yet important enough to _write down_. **it is not normal** I can’t even fathom wasting the energy on any part of that process. \n\n\nGod forbid his child have found your diary instead. I’ve seen some weird shit on this sub before but this is pretty high on the list of my-god-you-have-serious-issues-you-don’t-even-realize posts.\n\nEdit: let me be clear: we all have passing, intrusive thoughts like “hmm that child has crooked teeth”, but it’s fucking strange to hang in to those thoughts long enough to include them in your diary, let alone fixate on and rate your children’s attractiveness when compared to each other.", "YTA the kid wasn’t some stranger on the bus, she is your daughter. For now.", "ESH- you for judging a child. Your husband for violating your privacy.", "lmfao girl what. she is 7. who thinks that about a little girl??? yes?? YTA?? do you even really have to ask?\n\njust because the assholey thought was private doesn't mean it's not assholey. yeah people shouldn't read other people's diaries but that doesn't mean ur attitude and thoughts about this little girl aren't weird and mean. could you imagine finding out that your stepmom thought you were ugly at SEVEN YEARS OLD? are you the stepmom from cinderella? the hell?", "ESH.  He violated your privacy.  But the fact that you think something so horrible and actually wrote it down is disgusting.  You’re 28 and a mom.  Grow up!", "ESH. If it stayed a thought, fair enough. Why you thought it was so significant that a child doesn't look how you want them to that you just HAD to make a note of it is honestly kind of sickening.\n\nYour husband shouldn't have gone through your private things, but I don't understand why you would want to keep secrets like that anyway.\n\n\"Ah, better write this down so I can look back in 20 years and remember that I was *almost* a bully, haha!\"", "ESH. He violated your privacy. You insulted his child. I don’t see this marriage lasting.", "ESH yeah he shouldn't of looked in ur diary but why the hell are you thinking that a child is ugly and writing it down. What are you, 12?", "ESH. He has no right to read your diary, and you suck for thinking his kid(s) are ugly to the point where your mind immediately has to contradict him every time he compliments his own children. God help the kids if you end up subconsciously putting that on them, like the world isn't shallow enough.", "ESH. He shouldn't have read your diary, plain and simple. But the fact you're evaluating a child's attractiveness to the extent that you feel the need to externalize it in some way is weird AH behavior.", "YTA and thank heavens your husband found it and not the seven year old little girl. What’s wrong with you? Why would write something so ugly?", "ESH\n\nClearly he's an AH for reading your diary. But what in the hell would ever make you write about his daughter being ugly?? You need to do some soul searching FOR REAL. ICK.", "ESH, christ...", "ESH\n\nWriting a note on how your husband’s daughter is ugly is mean-spirited, and your husband had absolutely no right to invade your privacy.", "Everyone is beautiful but you ain't you are ugly inside and out for that", "ESH\n\nHe obviously violated your privacy, but who even thinks and writes that about a child?", "Both are assholes. Who writes down that a small child is ugly? He shouldn’t have read that, but imagine if the kid had read it, which is so possible considering you have small children in your home? Bad mother. \n\nI had the misfortune of looking at your comment history and it makes me just hate you. You’re an ugly person. I would put money on you being physically ugly too given how hard you try to act like you’re beautiful and perfect. Very rarely do I meet another persons kid and think they’re cute, just isn’t me. Kids are beautiful to the parent. But they look awkward to a stranger 90% of the time. For you to not see that is wild. It’s giving narcissist in an unhappy life.", "ESH. Why are you, a grown ass woman, judging a CHILD? Are you trying to compete with her? You’re the adult here, at least should be", "YTA\n\nNot because of wrote in your diary but for how you think. I understand diary’s are a sacred place to get your feelings and you wrote it a while ago, but really? Thinking 1.5 out of 3 about your husbands kids? That’s Asshole behavior, stop being this judge mental", "ESH \nYour husband for reading your diary and you because it's giving Regina George and the burn book. What are you, 12?  Grow up.", "ESH\n\nOkay, he shouldn't read your diary but who talks about little girls like this? Why does it matter to a girlfriend or wife how attractive she thinks his children with other women are?", "ESH. Clearly you need to get some therapy so you can find an appropriate outlet for this hideous bitterness that seems to live within you. “1.5 out of 3 ain’t bad”? I can’t write what I would like to in response to that, or I’d get kicked off this site. Grow the fuck up.", "ESH he should have never read your diary but that is a super harsh thing to write about a child, even if you feel it's true", "ESH he totally, epically violated your privacy.  \n\nYTA for commenting on a child’s appearance.", "ESH you called a kid ugly which is a universal dick move but he shouldn’t have been reading your diary.", " Eh, on the one hand you didn't tell him that or ever intend for anyone to know you thought that. On the other hand, you're a mother now so you can probably understand how knowing your loved ones think your child is ugly would affect your feelings.", "EHS\n\n>With our own child here now, he likes to say “I’m batting 3 for 3” while looking at me for confirmation. I don’t say anything but I think to myself “1.5 out of 3 ain’t bad” I never say anything bad about his other kids and I treat them like my own. AITA for saying his daughter is ugly?\n\nI cringe every time I read this. She still has so much growing up to do. She’s not an adult whose stuck with her features. Maybe she’ll get pretty one day, or maybe she won’t. But you can always pay for her plastic surgery when she’s older so you can finally battle 3 for 3.\n\nHe shouldn’t have read your diary, but he’ll never forget you called his daughter ugly. There’s nothing you can do about that.", "ESH. He shouldn’t have read your diary, but you sound like a high school mean girl. Bullying a child in your diary? Really? Come on man, you have to realize how that sounds", "NTA. Wtf. Lol like these people have never seen an ugly kid. BS", "NTA \n\nEveryone's allowed their own private thoughts. That definitely includes diaries. Sometimes private thoughts can be shitty but that's why decent people keep them private. That's also why you don't snoop in diaries; not for you.", "NTA but don’t be with someone who’s got so little respect for you or just basic common decency to Not read your freaking diary.\n\nAnd while, no it’s not kind to say anyone is ugly. 1: you didn’t actually Say it to anyone you wrote it in your Private Diary. \nAnd 2: some people Are objectively ugly. Inside and/or outside it’s a fact of life.", "NTA", "NTA!!!! I cannot believe these comments! He read her private thoughts that were never meant to be shared. He invaded her privacy!", "Okay… so.. I say this as someone who prefers authenticity especially when writing down my thoughts. \n\nI get why people are calling you an AH because you wrote that a child was ugly… but let’s not pretend all kids are cute… or that we all haven’t had the thought ourselves about a person be it a child or adult. \n\nYou were writing in your own personal diary & didn’t expect your privacy to be breached the way it was. You didn’t verbally tell him your thought & as long as you don’t verbally express the thought & make the daughter feel like less than a person because of it & you really do treat her well.. then NTA. Is it an ugly thought to think? Sure. Is it an awful judgement? Probably.. but if we all could read each other’s thoughts & minds we’d all be going to hell.", "ESH.\n\nYou for writing that cruel comment; your husband for reading your diary.\n\nI’m just so glad it wasn’t the little girl who read it.", "Why would you even write that down? Like he shouldn’t have read your diary, he’s def an AH for that. But like, what made you even write that a seven year old is ugly? ESH", "YTA. What does 1.5 out of 3 even mean? Your bio child is perfect? Doubt it.", "Ew. YTA. You're calling a 7 year old ugly.", "god you people are fucking horrifying you hate children to the point you defend this shit", "Just to let you know ugly ducklings tend to turn into swans. And even to write that in your diary is mean. That said your husband shouldn’t have read your diary. That shows no boundaries. What a relationship no boundaries and shallow", "She’s 7 years old...”she’s not pretty to me at all” what is your problem ? Find something more interesting to wright about u seem kind of shallow for thinking about a 7 year olds looks so hard to the point ur journaling about it 😂", "NTA.  My husb found my journal from college (23 YEARS AGO) where I professed to a crush and his insecurity was so bad we almost got divorced.  Don't read things that don't belong to you.", "ESH. Him for violating your privacy, and you for thinking a *child* is ugly. Yes we’ve all gone through that awkward phase. A “glow up” is definitely a thing. But ffs, that shouldn’t apply to a child. She’s a kid. She shouldn’t be held to the same standards as adults.", "YTA. I cannot say ESH even though he should not have ever read your diary.\n\nDude. Wtf kind of person thinks “my partner’s young child is ugly” let alone WRITES IT IN THEIR DIARY? Seriously w. t. f.\n\nYou can think what you want, but your thoughts ARE cruel and disgusting, and I don’t blame him for being hurt. I would leave someone who said something like that about my child, even in private. It’s just gross.", "This is why I will never have a handwritten journal. I've started journaling for mental health and it is a password protected online journal. \n\nNTA. You didn't say it out loud to him or her. But I do wonder why her looks matter to you.", "ESH, but you far more than he. He violated your privacy and you just sound downright mean and unpleasant to be around. You sound like a high school mean girl, not a grown mother of “1.5”.", "Technically NTA because you can write what you want in a diary but damn\n\nGenerally you do seem like an AH.", "ESH but I’ve never been a fan of diaries or journals. At least not the ones that the author writes their deepest and darkest thoughts. If it exists in writing the chances of someone eventually finding it and reading it are almost 100%. The only way to keep people from getting hurt is to never say it (or write it). It’s like a secret, once you’ve told one person, it’s no longer a secret.", "ESH him for reading your diary \n\nYou for literally judging a child's look. You said a child is ugly. How is the not AH territory. Idc if it was private you thought it and thought it enough to write it in a diary.  I just I have words I want to say but they aren't nice.", "I think an adult spending this much energy to actually write in a diary rating how a child looks in attraction is pretty much lower behavior bordering on creepy. \n\nIn addition, the mental caveat you add ‘1.5’ when he mentions all the girls looking nice….really puts you on the creepy weirdo list. \n\nYTA\n\nPeople having private thoughts can still be awful. It doesn’t matter if it’s meant to be private.", "I'm going to be eaten alive for this, but NTA.\n\nYour journal is supposed to be the one, very private place where you get to be the worst person ever ... so that you can be the much better person ever in real life. This is where those horrible thoughts go, where anger goes, where you get to be childish and immature and utterly awful ... and burn off that steam so that you can pull yourself together for the outside world.  Journals are where you get to be ANYTHING, and talk to yourself so that you can sort it out.  You get to say what you want ...\n\nBecause nobody else is supposed to read it.\n\nJournals are a fabulous coping mechanism so that you can talk out loud, to yourself alone, without judgement. \n\nY'all on your high horse about not thinking a child is ugly?  I wonder how you've lived on this same planet that I have, because I've seen some kids who were not at all attractive.  I didn't CARE that the outside wasn't esthetically pleasing.  It was the inside that I liked. The inside is where they are smart, and funny, and thoughtful and all the things that I am crazy about in kids.  The same holds for adults too.  And, folks, I'm not winning any beauty contests, myself, so I appreciate those who love me for my insides.\n\nSo OP ... He shouldn't have touched your journal - huge betrayal of trust.  Thinking that the child is ugly, in your journal, is fine, as long as that kid knows that you love her insides.  And I get the feeling you do.\n\nI'd say that you should be having a good sit-down chat with him.  He really screwed up.", "Why would anyone ever think a child is ugly? Let alone one close to them AND THEN write it down for record. Definitely an arsehole. Husband also an arsehole for reading your diary. That was never going to end well.", "Okay. Yes, your husband invaded your privacy by reading your diary. Maybe he did not know what it was when he initially flipped through it but the second he realized what it was he should have stopped reading it.\n\nThat being said, what is wrong with you? She is 7 years old.\n\n>I treat them like my own.\n\nSorry, no loving mother would ever think this about their child. You are awful.", "So I’m no expert here but usually when people write in their diaries it’s about personal things that have happened or like just thoughts about themselves. I don’t think I’ve ever cared that much about someone’s appearance to write it down since I was 7. Her appearance has literally nothing to do with you at all and should not affect you in any way. The only reason I could think that you’d have such a problem with how she looks is either you’re jealous or just very insecure. Dude shouldn’t have looked in your diary but I’m sure nobody would expect to see their partner shitting on their child.", "YTA apparently he's also batting 3 for 3 in bad relationships", "YTA and we can see how ugly you are inside by this post.", "ESH\n\nHim for reading your diary, you for even thinking enough about her looks to write it down.", "ESH Him for reading your Diary, and you for actually thinking it was worthwhile to write that his daughter is ugly. Shame on you.", "ESH! You for writing that, him for reading you diary.", "ESH - but you suck more. You felt so strongly about a child’s appearance you wrote about it in your journal..how often were you even writing about this/what were you saying. I wouldn’t feel comfortable with a woman who is so bothered by my CHILDS appearance they’re calling her ugly in their journal and saying 1.5 of 3 kids are good looking after this long. I’d be worried about what weird issues you’re going to give this girl as she grows up, consciously or subconsciously. \n\nIt’s weird and it’s giving insecure. Please do some self-reflection.", "I’m not gonna drag you, but I will say, to seriously look at a little girl and one of the first things you think is “Wow, she’s ugly!” that speaks volumes about who you are as a person. I don’t ever view anyone as ugly upon meeting them. \n\nYour husband also shouldn’t have read your private diary. Red flags all around.\n\nESH", "What kind of person judges a young girls looks?! He shouldn’t have read your Diary but I’m not sure I would want you around my kids if I were him. What’s ugly is you thinking it’s okay to judge a child on her looks. \n\nYTA", "Why are you speaking this way about children? Let's start there", "Bros really 28 talking trash about her husbands daughter. You’re giving Regina George vibes.", "YTA\n\nIt's really creepy that you're that obsessed with how ugly you think your stepdaughter is that would would write it in your diary. How often do you write about it since he found it pretty fast. I'm assuming he didn't read tones of your diary to get to it. You said you write about everything in your diary, so given what you said, it much be a quite big. How did your husband stumble on this one damming excerpt? Seriously, how often do you write about your 7-year-old step-daughter's appearance? \n\nAnd you didn't even stop with the diary, it's still something that's actively on your mind when you compare his other children to your future child. That's horrid that these kids are getting an evil stepmother.", "ESH.  I do not understand why a grown ass woman would write that a child is ugly.  What kind of person even puts that in writing?  Your husband is TA too, for reading your diary.  But honestly, in 2023, you have kids in the house.  How long did you think that diary would be safe?", "ESH - He shouldn’t have read your diary, and OBVIOUSLY YOU ARE AN AH for calling his kid ugly!!! \n\nI’m glad he at least thinks she’s beautiful!! \n\nSome thoughts are better left unsaid / UNWRITTEN, like seriously I can’t picture justifying writing this even privately, what the heck.", "In what context were you calling his daughter ugly? Like that is just so strange to me. Calling his daughter ugly in your journal entry... so what... you could like read it in the future and go \"Haha man. She really was ugly huh\" 🤦🏻‍♀️\n\nI want to say Y T A because well... yeah. But in fairness of the game... ESH. He shouldn't have swooped.\n\nETA: As a mother yourself, I truly hope you take the time to understand why calling a child ugly in your diary wasn't cool.", "YTA. So weird to be actively thinking about this this as ugly. Lady, you got issues.", "YTA - let’s not look at 7 year old kids and make judgements on their appearance.", "The fact that you even thought it strongly enough to write it makes YTA.", "YTA\n\n\nI find it weird that her looks bothered you so much that you even felt the need to write it down. \n\nSomething seems wrong with you. Genuinely. You're allowed to think a kid isn't adorable, but the fact it seems to bother you so much is....not normal", "ESH.\n\nTbh you probably only think that bc she looks like her mom, right? \n\nHe shouldn't have read your diary, but what was the reason for putting that in there? I think my bfs kids are really good looking people, so I say it to him. He often talks about how beautiful their half sister is, which I do not personally agree with, but I would never write it in a diary!! There's no reason to do such a thing.", "lol what kind of human looks at a child and asks themself \"is she pretty or ugly\" I literally do not even have those thoughts. That's super toxic of you. YTA", "Lmafo this post is so trashy. \n\n&#x200B;\n\nYou both deserve one another.", "He’s definitely THE AH but ur also kinda an AH too for even writing that out, like that’s such a weird thing to have in mind to the point that u put it in ur diary. But it’s YOUR diary, no one else is supposed to read it. Ever. The fact that he feels comfortable going through ur stuff and getting mad at u for him searching through ur things is concerning.", "Seriously recommend you go visit a therapist. Just gonna leave it at that.", "YTA, who cares if she is pretty or not, that was a cruel and heartless thing to say!", "She's 7 ffs. YTA. What is wrong with you? Thinking of a kid like that.", "YTA…you were a mean girl in school I bet…", "YTA what kind of AH judges a child based on their looks.", "I don’t understand the asshole votes here. If having less-than-complimentary thoughts about someone makes you an asshole, I am pretty sure we’re all in trouble. You can’t control whether you think someone is aesthetically appealing. That’s generally an observation your mind makes immediately upon seeing someone. It’s what you do with the opinion that makes you an asshole or not an asshole. Treat the person differently because you think they’re ugly? Asshole. Tell the person that you think they’re ugly? Asshole. Tell all your friends that you think the person is ugly? Asshole. Keep it to yourself and write it in the place where you record all your other private thoughts? That’s your business. NTA. If your husband goes snooping in your private thoughts, he assumes the risk that he might not love everything he reads. That’s why they are expressed there in your diary, not in conversation with him.", "> AITA for saying his daughter is ugly?\n\nLeaving everything else aside (he’s quite the asshole for looking in your diary but that’s not what he asked) - YTA.", "Your both assholes", "YTA. You thought it was important enough to write down and then you continue to think it with your 1.5 out of 3 crap.  He most definitely shouldn’t have read it, but I just don’t think I would ever write something so disgusting.  Newsflash, your husband is 0 for 3 in the baby-mama department.", "NTA you're allowed to write whatever you want in your personal diary even if it's \"mean.\" Reading someone's personal stuff is so much worse than calling someone ugly.", "So he invaded your privacy and read your diary? \n\nFor that, NTA \n\nBUT\n\nchildren change and grow a lot. People do. Passing judgement on a young child for their appearance is trashy. \n\nUltimately ESH.", "ESH. Listen, I’m sympathetic that he invaded your privacy, and that’s definitely wrong, but I can’t wrap my head around insulting a child’s looks. Who thinks about kids that way? If anything, I feel it’s some subconscious animosity you may hold over his children that aren’t yours.  Kids have a hard enough time coming to terms with the world and it’s fair to say in the future his little ones will grapple with insecurity over their looks. I hope you learn from this and become less shallow for their sake.", "NTA. Just because you have mean thoughts doesn’t make you a mean person. We are not our thoughts. Your husband is TA", "Imagine someone saying/writing that about your child. Disgusting.", "Beauty is only skin deep, but ugly goes all the way to the bone.\n\nBut it's not your husband's daughter that's ugly. It's you. YTA.", "ESH.\n\nHim for violating your privacy & you for writing down such an awful thing.", "Ok, let me unpack this.  He is shitty for invading your space..no debate there ..  however, what you wrote about his daughter is on par with an immature and petty 13 year old teenager with terrible lack of insight.  Im appalled at your behavior.  ESH and YTA...", "Op didn’t ask if they’re an AH because husband read their diary.  So that is not the issue here. \n\nThe issue is op is such an inwardly ugly and unkind person they think it’s appropriate to judge a child as “ugly.” Hard YTA Op. more than I’m allowed to lay into you on this sub. There is something deeply wrong with you and I fear for that little girls future with you.", "YTA.  Beauty is subjective.  Beauty is in the eye of the beholder.  She may grow up to be a beautiful young woman.  I get your diary is private but it doesn't negate what you thought/think about her because you actually wrote it down and now he has to deal with this in the back of his mind that this is what you think of his daughter.  That's pretty hard to get past.", "ESH", "Yta. His daughter is 7. Why tf are you making comments like that at a 7 yo regardless if it wasn’t a private thought written in your diary. Ya he invaded your personal space by reading your diary but you should have never even wrote that about a child.", "EsH No he shouldn't have read your diary but you should have never married a man when you think their child is ugly.  As someone else pointed out It's bad enough you thought it but worse that you felt the need or desire to write it down. You are lying to Reddit and yourself  by claiming you treat his kids as your own. There is no way you could love or treat his daughter as your own and feel that way about her looks. Knowing how you feel about his daughter I don't see how he could continue being married to you. If I  were him I would be worried about every interaction you have with his daughter.  I would be worried  you are telling her she is ugly when he is not around. I would worry that you would mistreat her when he isn't there I don't see how as a parent he can continue you to trust you to be around his child. As a parent I couldn't imagine staying married to someone who thinks my child is ugly.", "NTA. Thought crime isn’t a thing. It’s not very nice, but you’re allowed to think the kid is ugly. As long as your ACTIONS towards her weren’t any different, than who cares what you think? Him snooping through your personal belongings IS an asshole move, though.", "NTA. Journals are for your deepest thoughts, observations and feelings - things you wouldn’t admit to anyone else. It was a violation for him to read it.", "ESH you’re a mean girl! Maybe you’re not as cute as YOU think.", "Hmm now I see why a majority of children don’t care for their step-parents. YTA.", "YTA\n\nYou treat them like your own?  So you'd call your own daughter ugly?\n\nI just can't fathom how a grown woman about make that sort of judgement about a child who was obviously younger than 7 at the time.  Was she a bridesmaid when you married her father or was she too ugly for the photos?", "ESH for some reason i feel like this might be fake. \n\nbut anyways, yes he shouldn’t have read your diary, but why would you feel the need to write about his own daughter being ugly? that’s so mean and if she ever finds out about that it’s going to be really damaging for her.", "It always baffles me when adults take the time to look down on children. The fact that you married him after feeling that way about his child is weird af to me. \n\nYou may think you're not treating the kids differently but by you thinking that child is ugly you're singling her out and who knows how you treat her without even realising it, you're already comparing her to your bio kids smfh!! - If it wasn't clear, YTA.", "You literally sound like a mean girl in high school, are you 14? Lmao. YTA", "NTA. He read a private diary. Just break up because he'll never get over what you wrote and he broke your trust. I don't understand everyone freaking out that she thinks the kid is  ugly, she didn't say it to the kid or the parent.", "Wait until she grows up to be a rich supermodel and doesn’t want anything to do with you.\n\nKids go through awkward stages and as a mother, you ought to know that. And it’s really shitty of you to write that down *anywhere.*\n\nESH.", "About the dairy part ? No \n\nAbout the looks absolutely yes , you are still making comment to him . Also who says that about a child ? Who just goes , “today was great got a bagel , also my S.O child is uglier than a Christmas sweater” , how are you going to feel when the child gets older and might have body image issue or gets bullied ? Jut go : “well they’re right you face is hideous” like seriously?", "ETA\n\nno one should read someones personal diary\n\nyoure an ass for even writing that though\n\ni mean come on are you an adult or a child? seriously grow up. youre ugly inside for doing that.", "NTA\nUnless you are handing your diary to another person, it's content should not be relevant to anybody but yourself.\nEven though I don't keep a diary to write it in, I think alot of children haven't quite been blessed with beauty and I don't feel bad about it. I don't feel like it of any relevance though, unless it's also affecting health.", "I suspect your insecurities are showing…in the worst way possible", "ESH. He shouldn’t be reading your diary and should be respecting your privacy but You shouldn’t be calling his daughter ugly.", "YTA.", "Ewww. Yuck.", "You can think a kid is ugly if you want but feeling so strongly about it that you write it in a diary is kinda horrible. Most kids aren't pretty lol they're growing into their bodies, they'll get cute later.", "YTA you're really obsessed with how peoples kids look, you even have a comment in ask men talking about how you wouldn't date someone if their kids are ugly you're really weird.", "YTA absolutely.\n\nYou don't even need to be thinking that.  You need to learn to see beauty in all people whatever the outer covering looks like.\n\nESH, him for reading your diary, but unless your diary has a lock that you use that should not be an issue.  \n\nHowever it is more weighted toward you for even thinking that.", "\\*sheesh\\* your thoughts are horrid. \n\nYTA indeed. If you can't have charitable thoughts about the kids in your life, you have a much bigger issue.", "Honestly a lot of kids are fucking ugly and that’s just how they are. Maybe they grow out of it maybe they dont. Everyone on the internet wants to be like “oh no everyone is beautiful”. It’s a lie bc some people are just ugly and that’s okay. As long as you never say anything to her face or treat her different I don’t see a problem. NTA", "ESH. Him for reading your diary, you for writing that down. I get that it’s a journal, but why even put that in writing? What if his kids found your diary? What if they found it many years from now after you pass away? Not every thought needs to be expressed.", "NTA. I’m shocked by all the people who think you should not be allowed to put down your most personal thoughts, which he invaded and is judging you for. Are we pretending we don’t see people’s appearances and make judgments constantly? And that the violator is OPs partner who read something highly private but is punishing her for it and we’re judging her for stuff that should have never been seen, and she never expressed? No. If you’re calling OP TA, youre advocating for utter lack of privacy and punishment for thoughts that WERE NEVER MEANT TO BE PUBLIC. No.", "NTA You DIDN'T call his daughter ugly. Thoughts in private diaries never meant to be shared with anyone do not count towards ANYTHING. I'm just baffled that you're still with someone who disrespects your privacy and tries to make you the bad guy.", "YTA this is such a weird way to talk and think about a child. If it were me I wouldn’t want you anywhere near my kids, I don’t blame him.", "NTA I think. Let's not be hypocritical, we all have private thoughts about other people's appearances, the most important things to gain about writing a diary/journal is self-reflection, you write whatever that's in your mind, you read it in the future and you realize how wrong or right or cruel you are, it's meant to be private, it's meant to be honest, not right. But getting into someone's diary is definitely an asshole move.", "You are just an exceptionally horrid person.\n\nYTA", "NTA", "[removed]", "\nInfo:  how much does his daughter look like her mother???\n\nYTA. Simply because you evidently found her looks such an issue you wrote about it in your journal. Me thinks you are a bit preoccupied with her looks.", "NTA. He snooped and now he’s playing thought police.", "I'd say NTA because you never said it aloud. That being said, you're ignorant as hell for not only judging a child's looks, but writing about it in a diary like a 10 year old. Grow up.", "YTA you have issues…", "esh writing in a diary ain't bad but if i was your husband i'd think you're an asshole too.", "If you were my second wife and told me one of my kids was ugly, the next communication you'd have from me would be from my divorce attorney. If you really didn't want him to see your diary, you would have put it someplace more secure.\n\nYou're not only the asshole, you're what comes out of it.", "YTW for judging a child’s looks like that. it’s very bizarre and you sound unhinged", "NTA, I know I’m kind of an a**hole for saying this but I think it’s actually kind of funny. Some kids just are ugly. Now I would probably not keep a journal anymore because you never who will find it but I believe writing your thoughts down and getting them out is helpful. I would shred these papers once you wrote it all out. I actually do the same. Your husband will get over it eventually.", "It's funny how people on this thread are acting like they've never looked at a child and thought they were ugly. Everyone has seen at least one kid who wasn't cute and possibly even hard to look at. NTA. There's nothing wrong with thinking that or even writing about it in your *private* journal. We all have less than nice private thoughts from time to time. As long as you keep it to yourself you are not an ah. Your husband is the only AH here for reading your journal. It was a huge invasion of privacy. He got mad about something that you didn't share with him and never intended for anyone to see.", "ESH. There are some things that you just never say out loud... Or write down in this case… Once they’re out there in any form they’re out there… \n\nNo he shouldn’t have read your personal diary… but still. You never should have put That into words… come on they’re a kid..", "ESH him for violating your privacy, and you for judging a child’s physical appearance, that’s just gross", "Yes, you are an ass.  YTA and you know it.", "Y’all are kidding yourself if you don’t think kids are ugly, and she wrote it in her private journal. My kid looked like a potato when he was born and I think he’s adorable now but I’m sure some people don’t think so….it’s whatever. She didn’t say it to him. He read her private journal. NTA.", "YTA.  *They are children*\n\nYou, on the other hand, are 28.  \n\nThat is way too old to be gossiping in your diary.\n\nYTA", "YTA. Why are you judging the physical appearance of a literal child? Therapy, pronto.", "ESH. He should not have read your diary. But who TF calls a seven year old ugly? Even in a diary? I mean, what's it to you? \n\nI'd get if you called her annoying after a stressful day. But why are her looks so important to you that you have to mention it in a diary?", "How can you even THINK of writing something like that? They're kids for crying out loud! Yes, he's the asshole for reading your diary, but you need to have a serious conversation with yourself.", "NTA. Whatever you write in your diary for whatever reason is your business. It doesn't matter why you wrote she was ugly, it was supposed to be private and I'm assuming it's something you were planning to keep to yourself and not share with other people. Your husband is completely in the wrong and he has no right to be angry, he stuck his nose where it doesn't belong and got burned. \n\nIdk why everyone is saying ESH. It's not like you told her she was ugly to her face.", "YTA ugly on the inside is still ugly", "I'm probably going to get downvoted but NTA. It's your opinion and you kept it to yourself until he invaded your privacy and confronted you about it.\n\nIt's fine to think someone is ugly. It's a matter of opinion. Being ugly is not a bad thing, it's not a judgment on someone's value as a person. It's just a thought.\n\nI find it highly unlikely that anyone here saying y t a has never thought someone was ugly.", "NTA. I don’t know why people in the comments are acting like you should monitor what you put in your diary. The entire point of a diary is somewhere to put your unfiltered thoughts, so you can literally put whatever you want in it. He completely invaded your privacy by reading it.", "A diary or journal is an extension of your mind. He knew what he was looking at and chose to read it anyway. It would be no different than reading your mind without permission. I can't believe so many people on here with a “holier than thou” mindset acting like they’ve never had a thought that they knew wasn’t exactly nice. Everyone has those thoughts and sometimes people have them while they are journaling. You never did anything with the thoughts other than write them down so you are absolutely NTA!", "NTA- You had your opinion and kept it to yourself. Not everyone is going to like that opinion, and seemingly, you knew that because you never told him. You never said it to his daughter, and he violated your privacy and got his feelings hurt. He's the asshole for reading your diary without your permission.", "ESH. Like wtf lol", "My mom always told me to never write anything you want private. Nta.. all these it's a child blah blah.. there are some unfortunate looking people in this world and some of them happen to be children. This is akin to when someone asks you to give an honest opinion then get all bent about the answer.", "ESH - You for being randomly mean AND writing it down (you could have kept it in your own head lmao) and your husband for reading your personal diary.", "Why are you asking if you're the asshole? People are allowed to have private thoughts and opinions, and you did the correct thing by keeping them private when you knew they would hurt your husband. My question is--why aren't you more upset that your husband intentionally and knowingly read your diary? \n\nDoes your husband often violate your privacy? Go through your phone or similar behaviors? Did he previously mention disliking you having a diary in any way or for any reason? Because he's now successfully prevented you from recording your opinions and feelings, a habit which is healthy self-care and which you should protect. NTA.", "NTA\n\nThere is nothing wrong with writing down your private thoughts for yourself and yourself only, ever.  It is therapeutic to millions and millions of people.  The only AH here is the person who read it.  Your husband showed far more of a lack of respect to you than you ever did to his daughter.", "I was going to say that I'll reserve my judgement until you post a picture of yourself, OP. I'm imagining a cross between Angelina Jolie, Miss Universe and Margot Robbie here.\n\nAfter all, you must think so very highly of your own looks to write such vile things about a little girl in your care.\n\nI hope your husband leaves you, and finds someone who possesses a character of substance. I feel sorry for your own child, because I imagine you will have a disgusting fixation on their own looks as well.\n\nYou are a bad wife, a bad stepmother, a bad mother and just a terrible all round human being. YTA.", "Yeah. There is no situation where you can do that kind of damage to the fam psych and walk away Clean.", "INFO: How did he come across your diary?", "What happens when your own child goes through the awkward stage?", "YTA and I look forward to reading this again on r/AmITheDevil.", "NTA\n\nYou didn't tell your husband anything. It's not wrong to be honest with yourself about your thoughts and feelings. Your husband foolishly read your unfiltered thoughts. Shame on him.\n\nThis is why I never want to read the diary of someone I know. People have good reasons for filtering themselves.", "NTA. Diaries are for thoughts you want to get out of your head and not all thoughts are sunshine and rainbows. He violated your trust and privacy by reading your diary.", "YTA for saying it, he's the asshole for invading your privacy without consent. So you both suck!", "YTA x a fucking million. You are a horrible stepmom. It sure as hell doesn't sound like you treat those kids as your own. Also, you lied to us all in this post. You admitted to calling your stepdaughter ugly but then at the end of the post said that you never said anything bad about either of your husband's kids. Wanna try again?", "I was always taught that pretty is as pretty does, and writing things like this make you not very pretty either, honestly. Sounds like this little girl is gorgeous…on the inside, where it really counts. Beauty fades. Goodness, inner light, and joy..those are eternal.", "Normally I’d say husband sucks for reading your diary, but what you wrote is so much worse. YTA. You’re bad and you should feel bad.", "Omg yes YTA you sound like you were a mean girl in HS", "ESH.", "post a pic of you and your kids and let us decide what we think of you. you are definitely not a nice person YTA", "YTA and you’re a way uglier person than his daughter could ever be.", "Christ... ESH. Your husband should have respected your privacy, but you sound like a real piece of work. I'm sure there won't be any psychological damage done to a child by a step mom that actively judges her to be ugly... /s. If not being an AH is where you'd like to end up, please seek therapy to address your mentality. If not, please just get the divorce now so you aren't there to do harm.", "ESH", "ESH. \n\nYou suck for writing about his daughter like that.\n\nHe sucks for reading your shit", "NTA. No one should be reading anyone's private thoughts and whoever wants to pretend they only ever have kind thoughts needs a reality check. It's not like OP acted on them or ever said anything aloud to anyone, so I have no clue why people are acting like it's criminal to write your own thoughts somewhere private. Whoever reads it and gets upset only has themselves to blame.", "YTA. And you need to get a life. Talking about your partners kid's looks in your diary? That's all you've got going on? Oof.", "YTA and wtf is wrong with you? I'd keep you far from my kids after learning your opinion. Why does a child need to be attractive to you? What a judgement to pass onto a kid. You're the ugly one, regardless of your appearance.", "Wasn’t an ugly baby a Seinfeld episode?  ESH. Him for that very gross invasion of privacy and you for putting those gross thoughts to paper. Even if the kid is ugly in your eyes it never needed to make its way to words, on paper or verbally.", "You didn’t tell your husband or his kids. He read your diary full of *private thoughts* and got angry. If he hadn’t invaded your privacy and then brought it up, you probably would’ve never mentioned it. NTA", "This is pretty tough but I'll go with ESH slight N-T-A. It's a terrible thing to say a child is ugly but we can't pretend like those thoughts don't flash through our minds sometimes. What makes it worse is that it's your step-daughter and she's so young.", "YTA this is his daughter.  I’m sure there are many that think you’re ugly.  Why even write petty stupid stuff like that down.  I hope the girl never finds it.", "NTA, I don’t think anyone here acting Oh So Holier Than Thou has really *never* thought someone was ugly. You said that you write every thought and feeling, people are entitled to private thoughts and private thoughts don’t and shouldn’t need to cater to other people’s feelings. He’s right, you shouldn’t be together. You shouldn’t be with anyone who violates your privacy like this.", "All these people saying Y  T   A  are massive hypocrites and need to get off their high horses. We have all thought similar things at one point or another in our lives, and those who deny it are liars. It was a private thought in what was supposed to be a private journal for no one ever to be read.\n\nNTA", "NTA.\\\n\\\nYour diary is for your private thoughts, and what's in there is nobody else's business; as long as it's not affecting how you treat the child then - no harm, no foul. Your husband shouldn't go rummaging through your diary if he doesn't want to come up against any uncomfortable opinions.", "YTA for having such a thought AND writing it down, why would you even feel the need to do it honestly?", "NTA.\n\nAnd misleading title.\n\nThe fact he invaded your privacy aside.\n\nFor there to be \"beautiful\" people there have to be ugly people. It's literally relative.\n\nSome kids are really ugly. Facts", "Ok so how is everyone overlooking HE READ YOUR DIARY??? This seems to me to be the much bigger issue. Sure maybe it’s not a great thing to think, nonetheless write. But HE READ YOUR DIARY. NTA.", "When you snoop, don't be surprised to learn something you would be better off not knowing.", "NTA. You didn’t “say” the kid is ugly, you put it in your DIARY, which is private. People think things all the time they wouldn’t say out loud and come on, there are ugly kids and ugly adults out there. Not everyone is beautiful to everyone. Yes we need to be kind and it’s very wrong to tell anyone that they’re ugly, but you didn’t do that. You wrote it in your private diary which is only for you to see and reflect. I think there’s a bigger issue of your SO feeling entitled to actually read your private thoughts. That’s strange and I’d address that. I journal frequently and would HATE and feel absolutely VIOLATED if my husband read it. That’s where I write all the things I wouldn’t say and it’s for no one but me. Despite what people post here, I do not think YTA.\n\nAlso- you should feel free to write whatever you like in your diary but know that children can find it and read it and you can’t expect privacy on paper. If you really need to keep it hidden, lock it down somewhere because that kid might find it and read it one day.", "NTA- It’s your diary you didn’t say anything. you can keep a journal and write anything you want I’m surprised by all ESH here, and much more by the YTA. OPs husband went through her journal that’s an invasion of privacy. OP didn’t do anything wrong by writing down here feelings, it’s not like she is going around telling everyone that her husband’s daughter is ugly.", "NTA which I know we're all supposed to be oh that poor girl pearl clutching but if my husband read how I feel about my step daughter and the shit I've written while trying to process a very complicated and fraught relationship he'd be appalled and probably leave. He has no appreciation for all the moving pieces and expectations on us to be permanent love filled heart type mothers but not too much mother because lord forbid you execute imperfectly in someone's eyes that keeps you in a permanent cross hair. I highly suspect calling out her appearance in a petty way in a PRIVATE space is very likely a simplification of that mess I'm referring to. Also 7 year Olds can be ugly which is oftentimes a whispered observation between adults so this GASP is super extra from my eyes.\n\nHis massive invasion of your privacy is of course hugely ah and unacceptable.", "[deleted]", "NTA for writing this but assholeish thought to have about a child.", "NTA\n\nIt is not your fault he read your diary. However, just because you are not the asshole does not mean this isn’t bad for your relationship", "NTA, that’s the point of a diary. letting out thoughts that you want to keep to yourself. if he didn’t want the truth, he shouldn’t have read your personal thoughts.", "Yta \nIf you didn't want them found you should of hidden them better or burnt them. I would of walked then and there, you think my child is ugly that's fine rather a physically ugly child then a superficial wife who's looks will disappear in 10 years.", "Omg haha this isn’t true!", "My husband has some ugly kids. But he has eyes.", "NTA. They're your thoughts in your own private diary. He's TA for deliberately snooping and breaking one of the most basic and obvious boundaries there is.\n\nIgnore the pearl-clutchers who are complaining about you writing privately to yourself about the child being ugly. Literally everyone on the planet has seen a child and thought *wow, that's not a cute kid*, because we're human. Just like we see different adults and think \"that person's good-looking\" and \"that other person isn't good looking.\" It's why there are people who swoon over Benedict Cumberbatch and others who think he's one of the most unattractive creatures they've ever seen. They're only writing that you're TA because they're trying to look good online, and I *guarantee* that they're lying hypocrites.", "The context of what you wrote would help here. \n\nIf your diary includes such thoughts and is in a place others could find ans read it I'd suggest putting it elsewhere where they cannot.\n\nPersonally I'd be more angry that he'd found and decided to read a personal diary without permission. That is not his to read, he knows this, he's not an idiot I assume. \n\nTo think it is fair, we all have thoughts we may not be proud of. To write it is perhaps a little cruel because she has the potential to find it like her father did. \n\nHowever, based on his decision to read it without your say so and then have the ordacity to make you feel bad for it, to me is a big of a red flag. So I'm gonna go with NTA", "NTA. You can write whatever you want in your diary and he is the AH for invading your privacy. Some of my friend's kids I think are super cute and there are some I think are ugly. I would never say it to their face and you never did to your husband nor have you ever treated his child bad. He needs to get over it, honestly I was an ugly kid and didn't have a glow up till I was in my 20s.", "YTA she's a child", "NTA- you didn’t say it to him and those were private thoughts….and kids can be fucking ugly 💀", "YTA for saying a child is ugly.\n\nIt doesn’t matter how he found out, him invading your privacy is irrelevant to the judgement being sought, but if you’re wondering he is TA for reading your journal. \n\nYou shouldn’t be judging a kids looks…", "NTA. He invaded your personal thoughts.", "YTA. Now he knows your real thoughts about his child, I think he has thinking to do.  Of course, he should not have read you private journal, but he has.", "YTA.  She is a child. Have a heart. Think about how you looked as a child. Lol", "OMG, YTA, and not just an asshole, but a fucking, flaming one! What if the girl found that? You're far, fucking, uglier, even if no one can see it!", "NTA - Diaries are meant for our deep and truthful thoughts that aren’t always society approved. So what if she thinks the kid is ugly? I think that all the time. I’d never ever say that to a kid but not everyone is pretty. Those books we right are for the worst things we may think of but wouldn’t say out in the world because we are aware it cruel/wrong etc. They are PRIVATE for a reason. Your husband did the physical version of “ask stupid questions, get stupid answers”", "YTA. He shouldn’t have read your diary, but what possesses you to judge the appearance of a little child in that way and then feel compelled to commit it to paper? Please do some self-examination so you can become better before you infect your child with your perspective.", "NTA! Diaries are for PRIVATE thoughts and are an extremely helpful tool for all kinds of therapy. If you feel inhibited in what you write you’re missing the point. (Not saying OP was using journaling for therapy, but even as a solo practice it is helpful to process thoughts and emotions.) \n\nThere’s no way everyone on here saying you’re the AH can honestly say that they’ve never thought a child was ugly. You didn’t say it to anyone and your husband had absolutely no right to read your diary. You’re entitled to have opinions. Obviously if you treat his daughter differently because of how you perceive her that would be an entirely different story.", "I'm going to say NTA bc your thoughts are your own. You didn't shove it in his face you put it in a private diary. You can't help your thoughts but you can help how you act on them. It seems like you didn't so...", "NTA. He shouldn’t read your diary and some kids looks like trolls. \n\nAs long as you don’t say it to the kid or treat it badly", "Peer not through the keyhole, lest ye be vexed. NTA. Hopefully he learned a lesson. I also saw someone else comment saying that all kids are beautiful--that ain't true. I've seen plenty of ugly kids", "No doubt your husband sucks for readin your diary but YTA here. You might find her unattractive on the outside but you're ugly on the inside which is far worse to be.", "NTA you never ever read someone’s diary. Diaries aren’t 100% happy times, they contain some of our biggest fears, insecurities, intrusive thoughts, internal struggles and many more deeply personal information that should absolutely never be read by someone else without the writers consent.\n\nPeople can use diaries to help expel negative intrusive thoughts instead of cataloging their life, thoughts you’d never want to say to anyone but whether you like it or not they’re there. If anyone’s sceptical about this then please read up about using diaries as a method to manage negative thoughts. As someone who’s dealt with extremely negative thoughts and used diaries to help with that in the past, you are not a bad person, your thoughts aren’t you, your actions are what matter. Everyone here is caught up on the fact you have bad thoughts and being honest with them in your own private diary rather than the actions your husband took violating your privacy like that. I am not going to sit here and say that they were good thoughts but a diary is the best place to help deal with them. \n\n\nHere’s a really good article as to why reading someone’s diary is disgusting and it puts it in better words than than I could:  https://icytales.com/why-reading-others-diary-is-wrong/", "NTA! And everyone on here saying that you’re the AH will never admit that they have thoughts just as bad. We all have thoughts like this every day, what would make you an AH is if you expressed those thoughts out loud or treated her differently because of them. Your diary is.. sorry, WAS a safe space to let those thoughts go. Your privacy was violated, end of story.", "NTA. You think his child is ugly and wrote down your private thoughts in a private place. He had no business reading your diary and is now trying to police your thoughts. Some children ARE ugly as long as you aren't saying that to the child or treating the child differently because of what you think, it's not a problem.\n\nIt's only a problem if you're abusing the child in some way and ruining the child's self esteem. \n\nThinking a child is ugly isn't a crime. Your husband needs to learn about boundaries.", "NTA. I’d dump him for reading my private stuff & he had no right to confront you about it.\nAny man that reads your private stuff is not a keeper or not to be trusted.", "YTA and kids aren’t ugly or beautiful unless you’re into kids. That shit stays that way if they are your kids as well. Can it be used as a compliment, sure, but it is weird when written or done at the wrong time/place or wrong way.", "That's disgusting OP. ESH.", "YTA\n\n...OK I'll just say it - I don't find someone reading their spouse's diary THAT big of a deal. It's not cool, but far from divorceable like some people in the comments are saying. \n\nMore importantly, it's fucking weird how you were so fixated on this child's appearance that you wrote this in your diary with such conviction. \n\nThat's... quite disturbing. And frankly, if the genders were reversed you would NOT be getting any sympathy in this sub.", "NTA \n\nYour husband doesn’t trust you and read your journal. You have nothing to explain. He got cheated on by his exes. Ok. You’re not them. He needs to work through that and treat you like an individual not a cheater. \n\nYour not a jerk for writing down your thoughts. The people judging you are sitting on a very high horse and it’s gonna hurt when they fall off. Maybe they should start journaling too. It’s good for the mental health.", "I'm going to go against the grain here and say NTA but only just. I genuinely think all new born babies are ugly (including my own) and sometimes I think that my own gorgeous little gremlins are looking worse for wear. If they are sick or extremely tired, or intentionally pull a face. But I would never write it down or say it out loud.\nTheir looks don't matter to me in the slightest. I don't think you are wrong for perceiving this child as ugly because it happens, we get brainwashed into thinking a certain way about different physical attributes.\nI don't think you should have wrote it down incase this child ever found it, it could affect their self esteem. As long as you aren't pushing your bias onto her or thinking she needs to change in anyway then 🤷 Love your little step kid how they are and move on.", "Nta- some kids aren't cute. He went looking and got his feelings hurt. Maybe he'll learn to not read people's private thoughts.", "YTA and i wish you the worst in life genuinely", "NTA \nYou know what's hilarious to me? \nIf he snooped in your journal and found that you confessed to cheating, most of the comments would be on your side, that he's to blame for snooping and \"fucking around and finding out\" .\nBut since you spoke to yourself and expressed your personal thought in it you're the AH here. \nWhat if OP is going through things and journaling her thoughts is helping her? How do you know she wrote it out of malice? If she did, she would've expressed it to the child as well to ruin her confidence. \nOP has grace to keep her thoughts to her and is entitled to her own privacy, that asshole of a husband shouldn't put his nose up in people's business.", "NTA, we ALL have shitty thoughts that we shouldn’t. But you suck for not putting your diary in a more secure place. God forbid your step daughter come across it one day.", "NTA.  Had he been respectful of your privacy, this never would have come up.  You never volunteered this information.", "If you SAID she was ugly then Y W B T A. But writing it in a journal that HE read?? NTA. \n\nIt’s not like you don’t like her! We all have these thoughts.", "Yta. It's always the ugliest people telling the gorgeous ones they're unattractive", "YTA, the only thing ugly in that house is your attitude. Yuck!", "NTA some kids are ugly. We're not gonna sit here and act like they don't exist! You didn't say it, you wrote it down in a safe place and he violated that privacy. Does it suck, sure, I guess. But you didn't say it TO him. \n\nBut he does suck for invading your privacy.", "NTA - I can't nor do I think anyone should judge your thoughts.  If those thoughts lead to actions either consciously or unconsciously, including if you  knowingly communicate them, thats a different story.", "ESH", "Yta..there is no way you love that child as your own.", "NTA. Just because you had an unkind thought about one of his kids at one point in time doesn't make you a monster. ~~If he doesn't like what you write in your diary,~~ he needs to stay the fuck out of your diary.", "YTA.  And you probably need therapy.  “1.5 out of 3 ain’t bad”.. are you serious?", "YTA. He shouldn't have read your diary. What a shitty thing for you to be fixated on. If you had done any self reflection on just how shallow and hateful you are for judging a child on her appearance, you might be less of an AH. But the 1.5 snark? Seriously? Your husband has terrible judgement in women, but I hope he's learned enough to know not to have the poor child anywhere near you.", "NTA. You had a shitty thought, but thoughtcrime isn't a thing. Your husband however read your diary, which you presumably told him not to. You are also at fault here for not securing it in such a way that nobody could look at it, considering you're obviously writing some risky stuff in there.", "NTA, but your husband absolutely is.", "Absolutely NTA. There's a reason diaries exist. They're for your own personal and private thoughts regardless of what they are. People saying ESH must also believe in thought crime at this rate.", "NTA it's your diary. It's not meant for anyone to read but you.Some thoughts aren't great and we all think things like this from time to time. I would have been way more angry about this. Why did he feel the need to invade your privacy?? You should be the one rethinking whether or not you want to be with someone who doesnt respect your privacy.", "How is this what a 28 year old woman needs to write in her diary. \n\nGo to therapy. YTA.", "NTA. What he did is equivalent to reading someone’s mind and being surprised that their thoughts are ugly. We all think dastardly/nasty things. No one should invade someone’s private thoughts and not expect to see something horrible. \n\nI could’ve said E S H for thinking the child is ugly but I have had worse thoughts and so has everyone else.", "NTA. you could have been softer, but these are your own private thoughts, and sometimes you have too write stuff down, but he read it, big invasion of personal space and boundaries.", "ESH. My bet is that you have jealousy issues with the mom of the child you deem unattractive.", "YTA", "YTA.  Your husband is insecure because of being cheated on previously and that’s sad for him, you should be sharing your private thoughts with him.  I look at my kids with rose tinted glasses and understand that they may not be pretty to others, but look at some supermodels childhood photos.", "NTA. He shouldn't have invaded your privacy. His actions caused him to stumble upon the information that offended him, which is different than you intentionally saying such a thing to him or anyone else. \n\nAnd as a child, I knew I was considered ugly among my peers by conventional standards, just like I thought certain other kids my age were more or less attractive.  That's just reality, not everyone has a conventionally attractive face.", "NTA. He shouldn’t have read your diary for one. For two, the truth hurts. If she’s ugly, she’s ugly.", "NTA he shouldn’t have read your diary if he couldn’t handle what you thought. It would be weirder if you thought she was attractive.", "what does a kid's appearance have to do with you? it's really weird that you just wrote that in your diary. in most cases, i would say that anyone who reads another person's diary is in the wrong but just because you seem to have not guarded the diary and like you actually wanted your husband to read that specific content, i'm going to say yta.", "NTA\n\nWho told him to read your diary? He did it to himself. Now he wants to act offended. People saying yta are glossing over the fact that he violated your privacy. Again NTA", "NTA a diary is private and you are supposed to be able whatever you're thinking without having to worry about anyone reading it.\n\nalso LOL at all the women with fragile egos voting YT.A", "YTA- you messed up. Diaries get read. Don't write anything that could betray you.", "NTA everyone's entitled to their opinions. Everyone has biases. I'm sure everyone on Reddit has seen one ugly child here and there. The problem is you put it in writing some thoughts are just meant to be kept in your head. \n\nLearn your lesson never write anything on paper keep things on a secured computer with a password.", "NTA. Your husband read your diary? SO NOT OK.", "YTA. Look inward. Search yourself. Be a better person.", "No. And you know what? I believe the kid is ugly, I mean, she must be if it offends you so much that you wrote it in your diary. I think he is kinda of a jerk for reading your diary so if he is butthurt that’s on him, and you’re not responsible for his feelings. Some kids are just ugly. I was an ugly kid. Grew up and learned how to make myself less ugly. I hope she learns some tricks to make herself cuter in the future. Lol", "I have looked at kids and thought to myself, oh, how unfortunate. Or even, yeah, sure hope that poor kid outgrows their looks. Sometimes it just can't be helped. I would never say it aloud, or have any reason to put it in writing. However, I would also never read someone's personal diary or journal. NTA. \n\nHubby on the other hand, broke your trust and instead of trying to make you feel like the bad guy, needs to reevaluate the situation and see where he made the poor decision.", "YTA", "NTA. He invaded your privacy. You’re allowed to think whatever you like and write whatever you like in a diary. Sometimes kids are ugly and it’s fine to think it and to write it in your private journal. Did his exes really cheat on him or did he do dumb stuff like this to them and they just decided he wasn’t worth the trouble?", "NTA and i feel like i'm going insane reading the rest of the replies here. You are never wrong for writing anything in your diary, period end of story. He's TA for violating your privacy and the people here calling you TA are 100% wrong.", "Nta. It’s your opinion and he shouldn’t have invaded your privacy. I remember how horrible it feels for someone to step all over your boundaries and have your privacy invaded.", "NTA. People are allowed to have private thoughts", "Yta if you think you treat that child the same while writing down in your diary that she’s ugly you are as crazy as you are shallow. Btw kids who are awkward looking often turn out far more attractive grown then kids that were adorable when they were little. He should not have t read your diary but I can’t blame him for his reaction once he did.", "NTA but he is for invading your privacy", "Not an asshole for writing it down imo, weird and bad and intrusive thoughts are something that happens sometimes and writing them out in a diary  can be therapeutic especially if it helps you reflect. He's an asshole for reading your diary without your consent. \nYour comment about thinking to this day that he's batting 1.5 out of 3 is a bit weird and you might want to think about the criteria you are valuing his and your children on. Even if you are only thinking these things, left unexplored they will impact on your actions without you realising and you may be showing favouritism to one child over another.", "NTA!!! People are entitled to their own thoughts. A diary is personal. He never should have read it. I'm assuming you never would have said this aloud. You might be shallow, but he is intrusive", "NTA\nThe issue here is he read your diary", "NAH she ain't an asshole for writing what she thinks. He ain't an asshole for feeling bad that she thinks his daughter is ugly (didn't have to snoop though, mate). But you both are part AH for snooping and calling a kid ugly.\n\nThis is rude, yes. But, man, make sure the kid never knows.", "NTA- you didn't say anything. He did.  \n\nYou wrote your private opinion based on your own beauty standards and plenty of other personal thoughts in your own diary or journal. \n\nYour husband is TA for opening it without your consent, reading the contents without permission and then had the cheek to tell you that he had invaded your privacy in this manner & then tried to guilt or shame you for privately holding an opinion that he disagrees with.", " NTA. You had a negative thought and wrote it in your diary as a method of processing the negative thought and emotions attached to it. He chose to violate your privacy and tried to guilt you over things you never said and never acted upon since he clearly had no inkling you found any of his kids ugly.", "i wonder if it’s like those therapy ideas you write it down so you take it away and compartmentalize it", ">saying\n\nBut she didn't. She wrote down her private thoughts", "I also loves how she thinks her own child is perfection. Wonder if others view him the same way and how she would feel reading that someone thought he was ugly.\n\nAlso, if she goes as far as writing that her step kid is ugly and thinking 1.5 out of 3 ain’t bad, there is no way that her contempt doesn’t filter into her interactions with her step-kids.", "And that was before I got to “1.5 out of 3 ain’t bad.”\n\nESH", "This is the only answer. Everybody sucks except that poor child having to deal with all these adults bullshit.", "Who calls a seven year old ugly, even privately??? Jesus.", "Yes, OP has issues, but have you considered that writing them down might have been her way of processing them, and her husband not only ruined it, but is actively making the problem worse by constantly throwing it in OP's face?", "She’s a loser full stop idc.", "Yea I'm baffled. I journal and I can't fathom writing a thought like that. I've journaled about being annoyed by behavior of other girls in my daughter's ballet class, mainly their parents not doing anything about the behavior. That's as judgy as I have been about children. I can't imagine writing something so mean and so superficial as an adult...about a child...that I'm supposed to love. Wtf.", "lol thank you for saying this", "Poor little thing.", "Right? Just weird", "It would cause a total loss of trust that he thought it was ok to read it AND he then turns it on OP and blames her for his wrongdoing. \n\nAnd some kids look like trolls", "She thinks his other kid is only half pretty too. Seriously, who thinks this way about kids, especially ones they care about.", "I would question my relationship with someone if they read my diary! That’s a huge invasion of privacy.", "Yeah. Math's not my strong suit, but I can't figure out the 1.5.", "That's what it seemed like to me. 1 being OPs kid.", "That’s the point of a journal. To write down your ugly thoughts.", "Yeah...OP doesn't even realize that she's damn close to being ex number three for him.", "OP clearly is not mature enough to have a kid. This is some petty elementary school level shit.", "And like, writing it down? How does that even come up in a diary entry?\n\n\"I was having a great day today but then I came home and saw SD and was struck by how ugly she is\" \n\nLike wtf?", "Yes, and now two people know what she thinks about the little girl: op, and the girl's father. Hopefully,  they will not let it slip out during a quarrel.", "I feel like this is the right answer here. Invading anyone’s personal privacy like that is baaaad (🐑). But who the hell calls a kid ugly/judges their looks?", "On the flip-side my stepmother insisted I was NOT ugly and I absolutely was.  Now that I'm an adult (and got surgery to fix the issues) she'll even admit it.  Teeth outside my gum lines, cross-eyed, stocky, skin was an absolute wreck -- I was unfortunate.  She basically made me feel gaslit for my entire childhood because she simply refused to acknowledge that I was not pretty. \n\nIt's harmful to not acknowledge it when it's true, too.", "This! You can’t help your thoughts, but writing it down in a diary? About a young child? That’s something I would expect from a 13-year-old asshole, not an adult woman about their step child. Good grief!", "Yeah that's the part that got me. Dad's all, \"3 out of 3,\" like -- \"hey I've got 3 awesome kids, how great\" ... doesn't sound like he said anything about their looks. But for OP, it's like the fact the one girl is \"ugly\" just completely negates her value as a person? \n\nIt's a really gross mentality. \n\nESH", "It's even *worse* when you read the last line... 1.5 out of 3.  Are you kidding me?", "Know what yes. This is the one that should be seen.", "This is the right response, although I’m going with ESH except these poor kids!", "She has an outlet it’s called a private diary she’s allowed to have thoughts and write them down not every child is beautiful", "OP is giving off mean girl vibes.", "Babes a romantic partner  being jealous over a crush from two decades is not the same thing as finding out your wife is journaling about how ugly your daughter is. Let’s use our brains.", "you're fucking crazy if you think it's okay to see a child as ugly or be concerned about their looks at all", "This was beautifully written unlike the op’s diary entries.", "Someone was bound to read it. Could be her own daughter reading that in 60 years when she's going through OP's stuff posthumously. My MIL kept her mom's journals and reads them to feel close to her. I had a family member die recently and my mom read through their journals and discovered a lot of messed up stuff.", "Not that it's okay he violated her privacy but at least it was him who read it and not the daughter", "I was looking for a Burn Book comment!", "Thought about this too. I’m glad it was the husband that found it, because I loved snooping as a young kid, and imagine how awful that little girl would have felt if she found that.", "Totally agree about that, but curious why not ESH — you don’t think he’s also the A for choosing to read her diary? That’s so invasive which is also pretty toxic", "They really do.", "Man, you know a kid is unfortunate looking, when you look at it. Your diary is sort of the one place you should be able to acknowledge that kind of thinking, isn't it?", "I don’t know if I could look at my partner the same knowing that they’ve said something so cruel about my young child. He shouldn’t have read her diary but I don’t blame him for being unsure in the relationship after that. If someone thinks my daughter is ugly enough that it’s a topic in their diary, I don’t want that person around to cause any real damage to my kid’s self esteem.", "She didn't say it! She never indicated it to anyone or shared it with anyone!", "And she said she wrote this when they were dating, and they're married with a kid now, so the poor kid was even younger then. \n\nThe fact that there's any N.T.A. comments here is *insane*. This person didn't just think in passing that this child was not the prettiest, they felt strongly enough about it that they needed to write it down, still think it's justified bc they just don't find this 7 year old kid pretty, and apparently still think to themselves every time their husband says how beautiful their children are that only \"1.5\" of their 3 kids are pretty. That's just needlessly cruel", "Do you write in your diary that someone's physically  though? Unless you had a pretty negative emotional thought about them?\n\nThe only time I ever say someone's ugly i's when I don't like someone.. so yeah ESH but OP more", "Regardless of what she wrote the husband is an ass for reading the diary. He broke her trust. \n\nMeanwhile she recorded private thoughts in a place she believed her spouse would respect. Sure they're very judgemental and shallow thoughts, but they are hers, and should have been hers alone.", "I’m worried about if the daughter sees the diary. Because, you know, kids are curious and will get into things they shouldn’t. Her self esteem would be utterly SHATTERED to know her step-mom thinks she’s ugly. That would cause YEARS of psychological damage and even more in potential therapy. Obviously, that’s the worst case scenario, but not a risk any reasonable parent would want to take.", "She's still hung up on the poor child's looks. He shouldn't have read her diary but I sure wouldn't want her around my kid if I were him.", "Don’t people put the weirdest things on their diary?", "Lol so if your SO wrote down they hated you and you were ugly in their private diary that’s ok? You shouldn’t leave them or be sad about it?", "yeah what's with the 1.5/3 thing too. Sounds like she resents the older kids. I could be way off base, but I agree that it's a weird and harsh way to think about children. I feel like we're not getting the whole picture here, and this all makes more sense if OP has some kind of generally negative feelings associated with the kids.", "Thats fair, and husband is TA for snooping. However if I learned that info about my wife, regardless of how, tough pill to swallow.\n\nYou are NTA OP but you might have a very tough road ahead of you. Of course so does your husband if he were to want to earn your trust back. This will require care on both of your ends", "This line, right here,  is the worst.   “1.5 out of 3 ain’t bad”.  She's saying the other kid is ugly too", "While I agree that it sucks to think of a kid like that, she didn’t say it. She wrote it in a private journal. Maybe he shouldn’t have read it.", "Yep some look like trolls. \n\nMy nephew looks like a human version of Shrek - actually Shrek is cute in comparison. The kid is hideous, takes after his dad.", "Have i thought it? Yes. Have i ever written it down or said it aloud to some one else ?  No, because i am not a raging asshole and I have more common sense than that.", "Seriously this holier than though shit is awful, there's a whole episode of Seinfeld about an ugly baby and people thought it was hilarious for crying out loud.", "Whaaaaaat, no one here has ever had a mean thought ever!! This is clearly a comment section full of 100% pure of heart angels, can’t you see?", "and what's the point of writing about it in a journal? that's weird af to write about your stepkid's appearance in your diary.", "The kid she was talking about was his 7 year old daughter. That’s just messed up.", "That's your kid though, I highly doubt if your kids relative or teacher was like \"goddamn your kids ugly' you'd be appreciative of it", "Writing in a private location NO ONE ELSE IS MEANT TO SEE is the opposite of gossiping. Gossiping inherently involves sharing things that shouldn't be shared and spreading or causing rumors.", "Calm down. It wasn’t meant to be read by anyone", "You write whatever you want in your private journal.", "This is a child, homie. She wrote it down. In a private place, yes; but kids are nosy. What if the daughter had read it and not the husband?? Wtf. OP is a colossal asshole.", "I mean, some people are commenting like there were pages and pages of the diary talking about the kids look- that would be signs of a pretty shallow/warped mind. If it was just her first impression and not something she harped on, (maybe “sweet kid, hope she grows into that nose- yikes”) that isn’t an awful thing to think but OP is an AH for putting her darker thoughts where a kid would find it. It’s so careless to be thoughtless.", "But I would not want this woman around my “ugly” child. There is no way that someone who is actively thinking that her husband batted 1.5 out of 3 in the child looks department isn’t acting on that towards his daughter.", "This is silly. There's millions of ugly ass children in this world because they're in some awkward growing phase. Everyone thinks it - like damn hope that poor kid grows into those honking ears and nose, or hope that kid figures out their hair. It's not vile or disgusting. It's a private thought, silly thought (I mean, I'm guessing this was an off-hand mention, not the whole damn diary). Why the heck is husband up in the diary? Now that's vile.", "She has a family burn book. Sad.", "The dude went through her diary.  This is common knowledge that it’s an asshole move.", "I can honestly say I don't look at children and think they are ugly. I don't really look at adults that way either. I think about the ones I find attractive and everyone else is basically average. Anyone who calls people, and especially kids, \"ugly\" in their minds has  some soul-searching to do.", "This is a 7 year old LOL", "My son had jaundice as a baby and looked like an old man. It didn't help my stepdad got him an elf outfit that made the whole situation worse and there is this picture of him we were laughing at recently. He nowhas that goofy looking cute phase and once he grows out a little I will have to start smacking the girls off him. He was ugly at one point.\n\nSame thing happened to my cousin but it was worse. It was back in the 70's and they didn't understand breastfeeding like they do today. A lot of it had to do with her literally starving. We are 3 days apart and no one figured it out till my mom came up to visit and she was a walking milk fountain and fed my cousin and it was the firat time she slept through the night. That night they went out and got formula. That said my mom brought her sister and my cousin over my dad's mom's house. I don't know how to say it in Italian but basically she said ugly babies turn out to be beautiful women. My cousin is adorable now. \n\nJust because someone says someone isn't cute at one point of time doesn't mean anything. No one should be reading someone's diary either.", "I agree. It’s her private journal and that guy read it. I understand he was cheated on and may have trust issues but she’s not your exes and you need to work through the issues. \n\nJournaling is really great for mental health and all these commenters judging it are pathetic. Nobody should be reading someone else’s private journals. Doesn’t matter what it says. The husband crossed a boundary. \n\nNTA", "It's just kind of weird that they felt the need to even write that. I would love to know what the actual sentence was. Who thinks that much about how ugly a child is that they have to document it in their personal fucking diary? He shouldn't have read it obviously.", "My mum always said me and my siblings all had an ugly phase from 6 -12. Coz all your teeth don't fit your head and there's gaps everywhere.\n\nDon't get me wrong, she told this to as adults, not children.\n\nI agree with you, it was private and there's a lot of turmoil being a step-parent. If he didn't invade her private thoughts, I suspect OP never would have verbalised it.", "THIS. OP it's a huge red flag to ha e your private thoughts violated and you may want to reevaluate this relationship.", "With an ugly heart.", "You are probably ugly to someone else also. It’s all subjective!", "Jesus Christ, poor kids.", "ESH. Obviously he shouldn’t be reading her diary.\n\nNo child is ugly, especially not any child you claim to love. She’s a petty, shallow asshole for entertaining that thought, let alone putting it into writing.", "I've been looking through the responses, like ummm...... You all are lying to yourselves trying to act like an ugly child doesn't exist! You can think someone is a wonderful and beautiful human but is physically not attractive. If you treat them differently because of it, you're a dick, but if you keep your thoughts to yourself (or your diary), you're not hurting anyone! \n\nGeez people, lighten up a bit. \n\nNTA, but your husband is a dick!", "People have thoughts. Sometimes they are ugly mean thoughts.\n\nAssuming she didn’t say this to the child , or treat the little girl badly- the journal is exactly the sort of place to unload these thoughts and then ignore them.  NTA", "Didn't say it. Didn't share it with anyone.", "And found out she is calling children ugly. \n\nBet she wasn't the prettiest girl either as a child", "I'm starting to feel like some of you need to meet new people. I absolutely don't look at kids and rate their looks, and I'd be shocked if any of my friends did that.", "It's fine to think she's ugly. She can't stop herself from having that opinion. But what made her think about it so much that it'd be important enough to write in her diary. That makes her an asshole.", "Right. NTA.\n\nFirst beauty is subjective. That’s not a saying, when I was in college one of my psychology classes required me to an experiment from my book, I expanded the test. Instead of 3 kids with dolls I used a classroom of 50 kids and used cartoons. Most questions like who do you think is the smartest/strongest/kindest had some kinda of pattern. Only beauty had no pattern. \n\nIt might change when they grow up and get more media influence.\n\nSecond you never said anything, considering your husband never thought there was a problem until he read your diary I don’t think you acted in said thoughs.", "ive never once thought a 7 year old girl (who aas younger at the time) was ugly. i promise you not everyone is so vile and shallow", "If someone calls my kid ugly we are definitely going to have words regardless of how I found out. This is a pretty thoughtless comment", "So calling a 7yr old ugly is ok?", "She's not a newborn, she's a 7 year old.", "Yeah it needed to be locked away", "Yes, it was a bad thought, one that should have went in and out of her head. Why on earth would she write it down? Can you imagine if the daughter had stumbled upon that?? ESH", "[deleted]", "ofc she doesn’t have to find the kid attractive, but do you really think she has a good character if she takes time out of her day to negatively impact write about a child’s looks?", "Bruh, she doesn't have to write she thinks the child is attractive in her diary, are you good? Like you know there's other words for attractive that are used to tell children they have good looks (without the inappropriate implications)? Like pretty, cute, handsome, gorgeous, adorable etc. Hell, you could even just say a child has good looks/genes. \n\nIt's really not weird at all to call an 8 yr old cute, or say that she's really pretty. You've got issues.", "Right, that was bad, but the judgment being asked isn’t about that, it’s whether or not they are the AH for calling the daughter ugly.", "She immortalized the thought by writing it down. That's *weird.*", "Child*ren*. There's now *three* poor kids having to deal with these clowns", "“Processing them”? What kind of adult needs to process their feelings about a child’s appearance?\nSpoiler alert: a shitty one", "A shallow and jealous maybe possessive person?", "My family will still insist I was a cute girl even though I looked like Einstein except with uglier glasses, a patch over one eye and very little hair on the top of my head, and also dressed like an alien who didn’t really understand the concept of clothing. Like I’m not blind, you don’t have to humor me! My aunt is a real one, she’ll tell me “you were a very odd looking child” which is why I go to her for fashion advice.", "also what is the math?  \"1.5 out of 3\" = OP's daughter is the 1, his son is the 0.5, and his daughter is the 0?", "Okay so she has bad thoughts but never acts on them or says anything, what’s the solution? You can’t help the thoughts that pop into your head good or bad. If you suggest she go to therapy for her issues and to find out why she thinks them the therapist would tell her to use a diary to help manage her bad thoughts and explore how those thoughts came to be.", "I don’t keep a diary. But if I did, and I truly recorded all my thoughts, good or bad, then sure. Why should I censor myself in my own private diary? Who am I hurting? I can’t change my thoughts.", "Some children are ugly and it’s okay to think so and it’s okay to write about it IN YOUR PRIVATE JOURNAL.", "idk, imo someone can be sweet and lovely and still be ugly. i could like someone but still think they are not good looking. to say otherwise is disingenuous, we are human, we recognize what isn’t “appealing” (for lack of a better term) and may or may not express that, whether privately or not.", "Would you like us to judge you on what you write in your presumably private diary?  Tell you what, since everyone has a right apparently to read everyone else's diary and get pissed about their private thoughts, why don't you publish yours online?", "Hopefully she will have the insight to tear the page out so there isn't a chance of that happening.  That's an uncomfortable bed she made for herself.", "You shouldn’t be reading anyone’s diary. He’s obviously an intrusive person", "I would NEVER read ANYONE else's diary. Seriously. Because I've kept diaries and would never want anyone reading mine.", "I'd never know because I'm not an insecure AH who feels entitled to violate the privacy of others.", "This.  Also, unless it’s in a safe deposit box, is anything private?  What if the daughter found this?!?!  YTA.", "I don’t think that’s the issue. I definitely get random really mean thoughts about people, like things just pop in my head with no thought. But I go “well that was really mean” and don’t give it any  more thought. I don’t fester on it so much that it becomes a topic in my friggin diary!", "She didn’t say it though, she wrote it in a personal diary. It’s his own fault for snooping.", "Man some kids are ugly. That's just life. Should you write that down? Absolutely not. But it is a fact.", "\"Husband's daughter is the ugliest girl I ever met! DO NOT TRUST HER!\"", "People have thought humans younger than that are ugly, and people have been far far more open about it than writing in a place explicitly for private thoughts. No one’s private thoughts are 100% nice, and usually the mean ones are knee jerk. She didn’t have to write it down but why can’t she? It was supposed to be a safe space for her thoughts. I’m sure her husband has had negative thoughts about her, his kids, other loved ones, that would make him look like a dick if other people knew about them.", "I mean yes, but isn’t that what a diary is for to write down your feelings and stuff?", "We all have dirty, shameful, imperfect thoughts. She didn't share them with anyone.", "Sometimes I would write things in my diary that I couldn’t say out loud, to keep me from saying them😂. Like there, I told someone, it’s off my chest. Now it will stay here until I burn it", "She didn’t call the kid ugly. She wrote it in a private diary.", "Well let's say I wrote in my private diary that I thought your kid was ugly.  And then you found out because you were creeping around my house at like a birthday BBQ or something and went into drawers of my bedside table and saw my private diary and decided it was okay for you to read it.\n\nWe'd have no words, except for me telling you and your ugly kid to get the fuck out of my house and life forever.", "and if you had found out by sneaking into someone's private diary you'd be the asshole", "I think that about my sister’s kids. They just aren’t cute. I’d never say it around anyone that it could get back to any of them. Thinking something is vastly different from saying it. Her husband had no right to her personal journal.", "In a private diary?  Yes.  It's totally fine to do that.  Why wouldn't it be?", "She didn’t call it to the kid’s face. It was written in a private book that was her’s personally. For her eyes only.", "Yeah I read it, just that most people think newborns are cute and I don't so I understand thinking a kid is ugly.", "I agree. I see ugly people every day I just cannot imagine sitting down and writing about my husband's child like that? As a passing thought yes but to sit and be like \"my kid is so cute but my stepchild is ugly\" is weird! \n\nAnd though he violated her privacy.. you don't get to be shocked that he takes offense over it. ESH", "Yes, but does that make what she wrote ok?", "You didn’t answer my question", "Agreed, but the comment I’m replying to is saying what she wrote is ok. He’s already read it.", "I would hope she has more respect than her father to read it. When you go looking for shit, you may fuck around and find something", "OP says she disclosed every detail of her thoughts and emotions, doesn’t mean she’s festering, what’s the point of a private journal if people are gonna read it and then say that you’re journaling wrong?", "Yeah but the last paragraph of the post? That is SO unnecessary?? Like it seems like she actively dislikes her bc of her looks. I get that I’m exaggerating a bit but there’s a difference btwn thinking a child is ugly and writing down that said child is ugly AND thinking to yourself that your husband is actually batting 1.5 out of 3 instead of 3 for 3 every time her husband says something that is supposed to be sweet. Like what?? That’s so extra and unnecessary. Grown adults should not be so concerned about a young child’s looks", "Never said it wasn't, shouldn't have snooped or invaded their privacy but who thinks that much about a kids looks that they write it down", "It’s just a thing that just *never* needs to be said… I can’t think of a single instance where this person, or anyone else, would need to say aloud, or put pen to paper, to explicitly *say* that a child is ugly, regardless of whether it was true or not. It’s OP’s actions that make her the asshole.", "writing shitty things in a diary that's meant to be private doesn't absolve you from the sentiment behind it. a diary is not a sacred tome wherein all your thoughts written into it don't \"count\". you have to be horribly shallow to think this about your kid. could you imagine if it was the little girl who read it instead? she's lucky as far as that's concerned. \n\nhaving this attitude is like hearing that someone was talking shit about people to a friend and the friend went and told the ppl in question, then being more upset about their privacy being violated than the things they were saying.", "Yeah, but judging the ugliness of your husband's children is a thought that shouldn't be given that much considering and time.", "It is 110% not normal to give that much consideration to a child’s looks, let alone feel it is worthy of writing down.", "Which takes effort, why did that thought need to be written down? People are saying diaries/journals are used in therapy, like how does her opinion that her bf's daughter is ugly effect her mental health to the point that it needed to be written down.", "Yes! Privacy is huge to me. For someone finding a personal diary, reading it & then confronting the person about what it is in said diary gets everything that is coming to them.", "Not cute is not the same as ugly and yes he shouldn’t have read it but she should not have written it what if that poor girl found it instead", "Its horrible to even think that about a child or anyone really but to write it down what if she had found it", "Yes hes an AH for reading it but shes a bigger AH for writing about a child like that", "Yes, because those were her private thoughts and never acted on them.", "Yeah, can't unring the bell.  They'll have to move on one way or another.  Given his apparent insecurity, the relationship is probably over now.", "She’s seven.  I don’t think accidentally snooping should entitle her to a lifetime of self esteem issues and the soul crushing realization that her step mother dislikes her enough to bash her in a diary, but hey, we have a difference of opinion.", "The husband is wrong for reading it but I absolutely understand not being able to look at her the same. He can’t unread it. No matter what way you look at it it is WEIRD for a grown adult to be so fixated on a small child’s looks, so much that she feels the need to sit there and write about it. Actually think about that for a second, imagine actually journaling about how ugly you think a little kid is?", "No you're right, like it's a thought, but it shouldn't be so pressing that you just have to put that into the world. That's the asshole move. You can think it all day, and maybe it's true maybe the daughter looks like a lizard. Who knows? But why is OP so pressed about it? Not every thought needs to be expressed.", "Do you mean her young stepkids?\n\nThis whole post reeks of a sociopathic stepmom who will be awful to the step kids and generally also really demanding on their kid and will likely drive them away as well. May be an unfair quick impression but pretty big red flag.", "You've never thought something you know society considers immoral or improper?", "It dosent take a 30 minute look to know if someone is good looking to you or not it’s a diary you are supposed to write your thoughts down restricting thoughts defeats it’s purpose", "You can’t act on calling someone ugly", "I personally have never journaled about how ugly I think a kid is, I have journaled about other negative or ugly emotions to unpack them, that’s what the purpose is. I’m not going to tell someone they shouldn’t have the same right because I think their negative thought was too mean. We don’t know the full context of what OP wrote, and either way, it was a private thought that doesn’t effect the way she treats the little girl. If her husband doesn’t see her the same that’s his own fault. A lot of people wouldn’t see someone the same if they read their diary because they’re supposed to be for private emotions you need a space to talk out, of course disrespecting someone’s boundaries so you can learn their innermost thoughts is gonna change the way you see them.", "“Dear diary. Today I am feeling happy that I get to eat pizza for dinner. I am also going to watch a movie. Also my step daughter is so, so ugly.”\n\nNot normal.", "Not normal dosent mean she’s TA", "Yeah when it’s “i like to put pickles on vanilla ice cream”, not when it’s “i find a child’s level of attractiveness, let alone my step daughters, worthy of recording in writing in a house I share with her”.", "It’s her journal she can write whatever she wants I would write if about it if I saw someone beautiful that i liked", "Would you write about an ugly child you saw? Would you write about how ugly your own child is? In a book that sits in the house you share with your child?", "[removed]", "YTA. \n\nYou seem to be uglier on the inside than your husband’s daughter is on the outside.", "Good grief. Do you feel good about yourself belittling a child?? You had a million things to write about and your *chose* to assess the beauty of a child. \n\nFurthermore, you are fooling yourself if you think you can hide that you think a child is ugly. You aren’t hiding it as well as you think you are. \n\nReassess your criteria for looking at children, especially the children of your husband.\n\nYTA\n\nAnd for looking at your diary hubby is an AH too", "YTA for saying a child is UGLY.\nHow could you think about that to a CHILD? A young kid who is developing. Of course you would never say it out loud because you know that’s a shitty thing to do.", "ESH except for the children. He had no right to read your diary but it’s also absolutely disgusting to call a child ugly. What if your step-daughter stumbled upon your diary and found out how you feel about her? What do you think that would do to her self-esteem and sense of self-worth? You need to grow up and work on being a compassionate person.", "ewwwwwwww.\n\nYTA. Just a gross human all round.", "YTA.\n\nYou are an ugly person.", ">. I don’t say anything but I think to myself “1.5 out of 3 ain’t bad” I\n\nI find this bizarre and wonder if you have some feelings wrapped up in thinking about his past relationships? \n\nI'm just throwing that out there, I don't think that even comes close to a proper assumption. Point being, to have an aesthetic standard for a 7 year old is petty to say the least. She won't even look the same 5 years from now, then try again in another 5. While people are growing up, there are just some times when our appearance is off kilter due to growth spurts. Limbs will can look ungainly or lanky, and it can happening their face as well. \n\nIf he felt the need to bring it up to you, I wonder if this opinion of yours doesn't come out in other ways. \n\nLike, how attractive are you? Cause your attitude ain't so cute. \nYTA - for the fact that this is clearly something on repeat in your head and you haven't bothered to empathize and think about how you would feel if someone said something like that about your kid.", "YTA for even thinking it.\n\nNightmare stepmother.", "YTA, no other way about it after reading your comments…I hope you’re pretty enough to find yourself another partner 🤷🏻‍♀️", "YTA thank god he read it and not his daughter, she’d have self esteem issues for life knowing that her a parental figure to her thinks she’s ugly.", "ESH. Your husband violated your trust by reading your diary, so yeah he’s an asshole. And you too for judging a child’s looks and documenting it in your diary at that. Might I suggest some therapy for you both.", "Esh. Your husband should not have read your diary. But putting down a child WTF! That's a cruel thing to write. I hope she doesn't know you think this. I was called ugly growing up. I avoid having my photo taken, don't look in mirrors unless I have to, I avoid social interactions as much as I can. Everyone is beautiful, and if you can't see that in a 7 year old girl you suck!", "ESH- but you sound horrible.", "ESH \n\nThis is exactly what ESH is for. He's the AH for VIOLATING your privacy by reading your diary. You're the AH for your Regina George Mean Girls mentality about a frigging 7 y.o. Him reading your diary, while an AH move doesn't absolve you of anything. He is a father, and as such, his priority needs to be protecting his children,  even from you, if necessary. How in the Jerry Springer are you two still together?", "You’re an ugly dumb fuck.", "You're a mean girl to a 7 year old? Gross, you're more than TA here", "Someone is ugly and it isn’t the seven-year-old. \n\nYTA.", "You actually used the word ugly? Who uses that word about a child… and actually even puts it in writing. Ick. But he read your diary? Also ick. So you guys are toxic AF, right?", "It sounds like your diary is a brain dump. Like a brain poop. That’s where you put all the voices, the inner critic, the judge, the complainer, what you’re grateful for, what you’re feeling—a place to put sh*t in a no judgment zone, so it’s out and you’re clear for the day. It’s for you to see your own patterns, decide what work you want to do on it, and it’s not for anyone else’s eyes. That sounds really healthy. Is that right? So yeah, boundary there, understanding he has had trust broken, but solving that by breaking trust isn’t great either. So what does he need to feel safe in your regard for him?\n\nI feel like there needs to be a sit down talk with the two of you where you say what you value and appreciate about each other, and what needs mending in your relationship, rituals to go to for kind regard. For each of you to have uninterrupted time where the only job of the partner is to listen to understand. Reflection back on what you heard in your own words until they feel heard. Then switch roles.\n\nAlso there is disproportionate societal value placed on how one looks determining whether or not that person has value. Some people are not pretty to look at until you get to know them. So she’s not good looking in your eyes. What else do you and your husband value in people? What do you share and appreciate about each of your kids? Like sense of adventure? Fairness? Their integrity. Does he feel insecure about his looks and that you don’t find him attractive? Are you telling your children and raising them in valuing each of them for their own gifts? Like kindness. And boundaries? And things about their bodies that they appreciate? What traits do you appreciate in the children that you see they got from your husband?\n\nNTA for what you wrote, he’s an AH for reading the brain poops, but now it’s out. YWBTA if the jokes about ugliness continue in ways that lead to harm in the relationships in your family", "All the soap box high horse people on here are cracking me up. Everyone that gets on here and says that they have not one in life seen a baby or child and been like damn they’re ugly, is a fuckin liar. She didn’t TELL him his daughter was ugly. She wrote it in her personal journal at the beginning of their relationship, which was clearly a while ago since they now have their own child. The only AH here is your boyfriend OP.", "Hunny, YOU’RE UGLY. \nKarma will get you at the right time and you need to keep that same energy 👏🏾👏🏾👏🏾😂😏", "YTA. What kind of messed up person calls a 7 year old ugly? The only ugly person here is you OP. He has every right to be furious with you, even divorce you over this. Those are his children and you clearly don’t have the capacity to love them, you have the capacity to hurt his daughter too. I pray you’re not around her in her teenage years. If you’re willing to call her ugly in writing when she’s a child, what will stop you from saying it to her face when she’s a teen and pressing your buttons? What would you have done if she had been the one to read that diary entry? Absolutely the asshole.", "I was GONNA say N T A based on the fact that the comment was in your PRIVATE DIARY and you had never told him or anyone else.   \n\n\nBut then I read the last paragraph. You obviously are doubling down on your cruel comment rather than being sorry. Beauty is only skin deep and you apparently value that over her kindness. \n\nYTA. Re-evaluate yourself.", "YTA, what a shallow mentality", "Why would you say that? 😭", "you’re weird as fuck my god", "ESH. You are shallow and ugly on the inside if you judge two little kids based on its looks.", "Yta all the way I was ready to say it just by reading the title. Yes he may be wrong but nahhhh. You're an ass.", "~~E S H, on the line between E S H and Y T A though~~. Edit: After reconsidering everything, YTA. You're insulting your husband's daughter in your fucking diary, and you double down on it to his face? You either have very little going on in your life, or you have serious issues that you must seek help for. Your husband should not have gone through your diary, but good God you're a shitty person if you insult a young girl's looks as an adult.", "Not only are you TA but you have some deep rooted issues. You’re not even remorseful about your feelings for his children. That’s sick. There’s a special place in HELL for you talking about about children.", "Your last paragraph confirms YTA , bigtime. I would say E S H, your husband should not have read your journal,  but hopefully by seeing what you wrote he now knows who you really are and protects his children from you. You need a lot more therapy lady.", "What the actual fuck, lady?", "Show me a picture of your pretty kid then. Bet it’s not as cute as you think. YTA.", "YTA: people like you are everything that's wrong with this world.", "Oh, that last part about \"1.5 out of 3\" makes me think you are not a very pleasant person at all.", "You’re a monster.  A shallow cave breathing monster.", "ESH!!! He shouldn’t have read your diary, but we all know MOST people WOULD if they found it….. But you don’t love them if you think 1.5/3! How would you feel if someone called YOUR child ugly? Be it to your face or you snooped and read it. But let me guess, there’s no other child more beautiful than YOURS, right? Inner beauty makes the outside so much better. If you love this man, you’d love his children, and you’d also NEVER call either ugly!!! You’d think she was beautiful just because she’s an extension of him!! You say she’s very sweet, then that makes her BEAUTIFUL. The way you speak about her, though….. you DON’T treat them as your own! This also sounds a lot like….. dare I say it? Well, of course I do! Sounds a lot like JEALOUSY!!! Perhaps you could learn a lot from his daughter!", "ESH. It’s just common sense to never write anything that you wouldn’t want read by anyone if you died later today. That’s why I don’t hide my diary. There’s nothing in it that’s rude or puts anyone including myself in a bad light. What a horrible thing to write.", "You know those stories about wicked stepmothers? The ones who make Cindarella's life a misery?\n\nThat's you. You are the evil step mom. YTA. Yes, invading privacy is always bad, until it isn't. Your husband learned that he can not trust you with his kids.\n\nI am glad he snooped for the kids sake.\n\nGet help in therapy NOW. Or you will be dealing with a young adult strp daughter with an eating disorder or some other disorder.\n\nYou suck. Get better.", "Wtf is wrong with you that you spend your free time writing cruel things about a *child*? YTA. Yes he shouldn’t have read your diary, but my god, your comments and thoughts about his children are 1000 times worse. Disgusting.", "Girl...go to hell 🙄 you must be extremely insecure to have to write about how ugly YOU feel a child is. Just gross, your husband/bf isn't too great but you...you're gross. YTA", "Ugliness comes from the inside. You are the ugly one. YTA", "ESH \n\nHim for reading your journal\n\nYou for being an ugly person inside", "Firstly - BS on you treating them as your own. You berated the child’s appearance for no reason in your journal. And yet your child is gorgeous. That’s not treating them the same. \n\nHe should not have invaded your privacy. \nAnd you should never have written that. Even in something that no one would ever read because you should not be commenting on the appearance of a child. \nThat’s never ever appropriate or ok. If you were having feelings of resentment or upset about the child, keep it to your feelings not to attacks on their appearance. \nAlso - you don’t feel badly for saying it. You feel badly that his feelings were hurt because you feel justified in commenting on and rating the appearance of a child. As your 1.5 comment shows. I pity those children.", "ESH. But a grown ass woman spending time making post about a 7 year old being “ugly” is crazy. Fucking grow up", "Esh. But ewwwww!", "Reading this and then going into OPs comments on other posts is making me rethink this subreddit. She is active in passing judgements and gives advice to other people to leave their spouses. Imagine taking someone up on that advice and than seeing they are saying things like 1.5 out of 3 ain't bad... \n\nYTA. He seems unlikable as well, reading someone's diary without permission. You guys are a match made in heaven.", "But what catharsis does writing a small child is ugly in a journal bring?  She is TAH for writing that down, its quite insulting and if the husband can find and read it, imagine what happens if the kids find and read it one day too.  She is favoring her own child and looking down on the husbands prior kids rather than seeing the children as equal and focusing on character and attributes that matter.  Does she treat them as her kids?  If she shows favoritism, the husband should consider protecting his kids from her.", "YTA. I know, I know. He shouldn’t have read your diary. But you are such a callous, shallow person I can’t quite get past it. You not only are walking around judging a child for her looks, you’re writing about it *and* making jokes in your head when he says they all look nice? WTF is wrong with you? These aren’t just passing observations, you are treating her appearance as something particularly important and it’s gross and caustic for those girls.", "Esh, he shouldn't of snooped but really looks ain't the only thing that can make you ugly OP...", "ur 28 not in high school 😭", "Who cares about him reading your diary?! YTA plain and simple. What if it had been her that accidentally found your diary and read it? Are you seriously that jealous of a 7 year old?! Those poor kids having a crappy mom/stepmom. They deserve better and I hope he does leave you. Also, you need some extensive therapy for being a grown woman jealous over a child. Grow up!", "YTA — I yeah he’s an asshole too but like why’d you marry a man who has kids when you don’t love the kids too?? It’s a package deal. If you weren’t in love with this man and everything with him you shouldn’t have married him. I feel so bad that this little girl will be around you when you have thoughts like that. She’ll be able to pick up on it. You better not ruin this kids confidence.", "YTA You treat them like your own huh? Interesting… \n\nYeah he shouldn’t have gone into your personal diary, but wow… maybe you have some self esteem issues YOU need to work on?  To project ugly onto a child screams that you have internal issues…", "YTA, with a soft ESH because it was still wrong of him to read OP's diary but I can't blame him at all for being upset.\n\nAll I can think about is, if OP really makes jokes to herself like the \"1.5 out of 3\" comment and thinks it's funny/clever, there is NO way that mentality isn't translating into sly expressions or subtle little snide remarks. I can't help but imagine when these kids are older, especially the daughter, going through middle/high school when children's self esteem is really put on trial... what will she say then? Will she be that teenage girl going shopping and asking her stepmom if this or that looks good on her, and be met with a poorly hidden look of judgment and half-assed \"sure\"?\n\nThey might be too young to catch those now, but I can assure you when they're teens and already judging themselves that they'll become extra sensitive to those little signs. Even if it's just body language, split-second facial expressions, or a lack of immediate confirmation when something positive about them is said. There's just no way OP's kind of attitude and mentality towards them isn't showing at all, and there's a huge chance of it fucking those stepkids up in their formative years. :/", "[deleted]", "He shouldn't have read it but if my spouse, who is a step parent to my daughter, wrote down that she was ugly and I found out --I would leave him. There is simply no reason to write that down or ruminate on that thought.", "ESH him for invading your privacy and you bc who tf writes down how ugly a literal kid is? That's more like something that should stay as a passive thought rather than written down.", "People on here are like ‘omg you shouldn’t even be with this man unless you believe all of his children are beautiful.’  Lol.", "The kid is 7 now so presuming she was probably a few years younger when OP was writing this since she said it was when they were dating. What an odd thing to dwell on and then decide to put to paper. \n\n*Dear Diary, just thinking about how hideous looking this toddler is.*\n\nHe shouldn’t have invaded her privacy but it’s hard not to side against the weirdo adult who keeps some sort of toddler burn book. \n\nOh and OP, your kid probably looks more like their half sister than you think.", "Oooh I’ve seen kids that look like troll dolls.  No really they do.  I also don’t see a need to write about it.  Not all kids are cute or pretty or whatever just like adults.  Also OP didn’t say it, she wrote about it in private and her husband violated that privacy. \n\nFor context when I have told people about the troll doll look they tell me I’m an AH.  Then I show them pictures.", "Let's also not gloss over the fact that the child was, AT MOST, 7 (!) when she decided to call her ugly in her diary. \n\nINFO: in what context would you EVER write this in your diary?", "I mean, the kid is fucking seven! What was the catalyst for such a journal entry or is OP just a vile shit?", "She’s jealous the kid exists and her child isn’t the first so she makes herself feel better by putting the kid down which is trash. Many times ugly ducklings grow up to become beautiful swans. OP will always be ugly on the inside.", "Yeah, I was expecting purest Y T A, but don't go getting upset at what you read in people's diaries, asshole!\n\nBut, 1.5 for 3?  Disgusting.  I'm sorry those poor kids are stuck with a pair of assholes.\n\nESH, but especially you, OP.  If you're this two-faced, he might have just been desperate to know what you really think.", "And WRITE THEM DOWN. \n\nChrist, journaling can be helpful but OP sounds like a middle school mean girl.", "Sounds like she’s jealous of her partners daughter", "Some kids are just ugly as hell, mate. It's not their fault, but it's just a fact of life. If it was on OP's mind while she was writing in her diary, that's her own business, not anyone else's; that kind of writing is meant to be a physical extension of private thoughts and experiences, not a public record. \n\nIt was shitty of her guy to read her diary, and that's all there is to it. Her thinking that a child's ugly is not \"saying something cruel.\"", "No, if a kid's ugly, you can say to yourself the kid is ugly. At no point in human history has 100% of all children been cute. They can be ugly. The real question is why would you ever need to write that down in your diary? Like, why is that a thought you need to jot down in case you forget? \"Note to self: don't forget that your stepdaughter is a donkey.\" Who writes that? Whether a child is ugly should be obvious just by looking at them. It isn't some bit of trivia or knowledge that needs to be researched or memorized, so there is no practical reason to write it down.", "I looked at her post history and it goes way deeper.\n\nIn one post asking about shallow reasons you chose not to date someone she listed having ugly kids as a reason she’s used.\n\nHer views on single parents are clear:  “I don’t believe in keeping and raising children with a broken home. “\n\nBut most of her judgement is reserved for people with more than one child with a different parent:  “I think most people -like older people- see it as irresponsible and devaluing (for both men and women) to have multiple BDs/BMs 🤷‍♀️”\n\nWhich is how she feels about her own step children and husband:  “My husband constantly talking about his experiences with his 2 BMs and his 2 other kids (5m/8f). It’s so annoying.“\n\nBut then we get to the truth of the matter, which is that they negatively impacted her experience of being pregnant and having a baby:  “Ruined my first pregnancy/birth experience. Literally down to the moment my son was actually born.  And he’s been massively annoying for my second one so far. At times o just feel like saying “I don’t care what they did as a baby” “I don’t care what your bm experienced/put you through”.\n\nHer husband shouldn’t have read her diary, but he may be trying to figure out what’s going on and deciding whether to stay married to her.  She clearly has resentment towards his kids and their impact on her, and I can’t imagine she hides it well.  I get that it changed the experience she wanted and that sucks, but she knew what she was getting going in, and it sounds like overall she got a dedicated father.  The irony is that if she keeps letting her insecurities and resentment get in the way, she’ll likely end up a single parent.", "My stepdad called me stupid my whole childhood. Children deserve to be loved and cherished. She should have never gotten married to a man with kids if she couldn't love them as her own.", "ESH \n\nHe shouldn’t have read your diary but you really take the cake. It’s just icky that you wrote that down about a child and then doubled down with the whole 1.5 out of 3. For children you seem to love you sure as hell are awful towards them, whether that’s in your head or out loud it’s gross.", "For real.", "100% mean girl energy.", "It's like she thinks the 1.5 thing is funny", "I truly don’t understand the 3 for 3 vs 1.5 for 3 thoughts. What is this .5? What does any of this even mean - the kids are all good looking? They’re all healthy? 3 women have disappointed him after birthing children? \n\nWhat could 1.5 possibly mean??", "Hole!", "I’ve written down my intrusive thoughts, but it was more of a “why am I thinking this” kind of thing where I examine why I had that thought and how I can stop thinking it. Up until the “1.5 out of 3” comment, I was willing to bet OP had done something similar.", "Right? It’s one think to think about it in the moment it’s another to sit down and actually write it.", "In her comment history, she talks about not believing in raising children in a broken home. I hope she's ready to be a statistic because I know I couldn't be with someone who felt that way about my child and someone she claims as her own.  I hope he does leave for the sake of his daughter. She deserves better than this evil stepmother. \n\n\"I don’t believe in keeping and raising children with a broken home. The statistics show that a child needs both parents in the household to have the best possible outcome of how to be a good person to themselves, others, their partners, and their own kids. So what makes you most comfortable but weight your options heavily. We’re raising the future and we can’t be so selfish as creators of life.\"", "So so weird.", "Dear diary, today I met a little girl. And let me say ew! She was like, a 4, at most?", "Exactly like I understand the partner if I were in his place I would never want someone like that around my children. \nThat said that man was out of his pocket too like respect the fkn privacy bro!", "Agreed, OP, YTA & everyone else is pretty crappy, too.", "Wisely stated.", "Agreed.\n\nThose journals are so you can process your thoughts and go 'that was a terrible thing to say, why would I think that' and process how to move past it, but OP is up here doubling down on her opinion even now.\n\nI'm in ESH camp though. Y'all need therapy.", "Omg same, my mouth was open reading this entire post, I couldn’t believe my eyes", "A daughter none the less. Girls feel a ton of pressure to be beautiful and her step daughter will grow up thinking this.\n\nI agree, YTA. Get some therapy, OP to figure out why you would say something so mean about a child.", "Yesss! My first thought was, What if that little girl had stumbled across that diary and read it?!?! She would be absolutely crushed in a way that would last throughout her life that someone she thought of as a mother figure would even THINK such a thing, much less write it down.", "Seriously... I can't fathom being grown and spending thought energy on whether or not a kid is ugly.\n\nPlease see a therapist, OP. This is not normal, and your attitude will eventually poison your kids with this attitude.", "I have a diary…in my mind!", "Exactly.\n\nAm offhand comment is one thing, but writing in a fucking journal? Holy shit.", "Plenty of kids are fucking ugly. \n\nShe has never voiced these thoughts except in a private dialogue for herself. \n\nAre we really asking people to censor themselves from themselves?", "Fuck. Yes.  Truth!", "Bingo.", "Yes this would be my third out at this point. If you care enough to write down one of my children is ugly, we can’t possibly be living together and making kids so you can put them on a beauty pedestal above the others. The end.", "I'm living for all these theories about what the diary entry looked like!", "She once commented to single mom that was venting and saying she just felt like giving her baby to it's father and then living her life, that she should give it to the state to avoid paying child support. Can't get much lower or creepier than that.", "That, and 7 is an awkward age for some kids. Some kids are just odd looking until they grow into their features. Not being able to acknowledge that is super immature.", "Her post implies she *used* to write in a journal. I'm curious about when she last wrote in it.\n\nI say NTA because that was her private journal.\n\nIf her post was in \"off my chest\" where she says, \"My husband found my private diary and read it,\" people would be absolutely on her side and lambasting him for violating her privacy.\n\nBut since she privately wrote that she doesn't find his daughter cute, people are giving her hell.\n\nThe only reason for any of this was because her husband read something he knew was not meant for him to read and did it anyway. It was his AH move that started it all.", "Wow the first actual response. Everyone acting high and mighty.", "This lmao. I’m surprised at these comments. I don’t think most kids are cute in general, babies look like potatoes to me, and while I can’t personally think of a time when I thought a kid was *ugly* per se, I know for sure I thought other kids in my class were ugly when I was a kid, lol. It happens. Granted, I didn’t dwell on it enough to write it down in any journal or anything like that, but whatever, it’s her private diary and he shouldn’t have been reading it in the first place. Not sure if the people here don’t journal, but as someone who journals every day, sometimes you write down really shitty thoughts that you would never admit to anyone else. You may not even really mean the things that you write down, maybe you look back at it later and cringe, whatever it’s basically just a form of venting.\n\nI also think it’s weird people are just dismissing what the husband did as no big deal and acting like what she did is somehow worse. It’s a horrible feeling to have somebody read your private thoughts without your consent. My mom read my diary when I was in high school, and then had to audacity to yell at ME for what I wrote, and honestly it was extremely violating - I haven’t fully trusted her ever since. It’s just not something you should do if you value your partners privacy, and the husband is fully in the wrong for doing it", "Yes holy cow. I’m afraid for all the people saying YTA for even having a thought. Judging your own thoughts is setting yourself up for shame. It’s what you do with the thoughts that matters, and this was totally private. As if none of these people has thought that another person is unattractive or even ugly in their lives. Lot of high horses in here.", "I'm glad I'm not the only one who felt the same.  People have intrusive thoughts. Writing in a diary is a healthy way of expressing them. NTA.", "Nothing wrong with having a passing thought that \"this kid is a bit weird looking\".\n\nHowever the fact that this thought persists long enough or is strong enough that you want to write it down is extremely strange. \n\nWould you feel the same way about a dude who writes down notes about the attractiveness about every woman he encounters?", "I agree with this. I wonder if all the people voting YTA (or ESH) are focusing on the fact it was written down because I think pretending that we don't have judgemental thoughts, even about children, is silly.", "Thanks. These holier than thou redditors acting like they've never looked at a child and said that the doctor ought to have slapped their mama instead of the baby's bottom. Most kids are just beautiful little angels, but some are ugly ass toad-like little angels.", "Yup! There are definitely ugly babies. I worked as a NICU nurse, and some preemies reminded me of those trolls with the puffy hair from the 90s. Some were gorgeous even as tiny 27 weekers. Not every baby is cute, but every baby is precious and deserves love.   \n\n\nI don’t get the  Y T A with people saying it’s bad she even wrote that down? It’s her diary and she can write whatever she wants! Her husband invaded her privacy. If he wasn’t prepared to know her most private thoughts, he shouldn’t have snooped.", "Agree. We have to be free to acknowledge what we’re thinking and feeling without judging ourselves. Everyone in here saying YTA for even privately thinking that a kid is ugly probably has a pretty tortured psyche full of self-doubt and shame. How do you live with yourself when you’re judging all your own thoughts-thoughts!—as either “good” or “bad”?", "I didn't know an ugly baby existed til I saw one. Looked just like his daddy too...Most of the pearl clutchers here have called a kid fugly or talked sh...about a kid\n\nI bet the same situation can pop up but age the person up and we'll see a lot of NTAs", ">You don't even need to be thinking that.  You need to learn to see beauty in all people whatever the outer covering looks like.\n\nEven if OP doesn’t see beauty in *all* people, that she feels this way about her step daughter is concerning. Our emotions about people affect how attractive we find them, so OP saying her step daughter is “not pretty … at all” is very revealing about how much she doesn’t care for this child, who, by OP’s own words, is a kind and sweet child. \n\nOP YTA.", "This is it. NTA.", "It’s not gossip. It’s literally the alternative to gossip, which is keeping your own negative thoughts TO YOURSELF. she kept her thoughts private, Jesus, this sub can be real stupid.", "Lol he read her private diary. Private. Diary…private. But yes, it’s her fault she should have put it somewhere more secure because she apparently can’t trust her husband to respect her privacy. What she wrote isn’t super kind but he shouldn’t have read her private thoughts if he didn’t want to find out things he didn’t want to know.", "Why does op need to talk about a little kids looks in their diary? I keep a journal and I find this kind of weird.", "What does that even mean?  I’m sorry if I’m a little slow today but aren’t there 3 kids and she only thinks one is ugly so wouldn’t it be 2 out of 3?", "I didn’t understand what that meant.", "Worse, the kid would have been a toddler at the time. Like yeah you can write whatever you want in your dairy but why the hell would you think about a toddler enough to just HAVE to write down that they're ugly?", "She seems to be doubling down with the 1.5 thing though and doesn't seem to be ashamed of criticising a little girls looks.", "Honestly it’s interesting you brought up therapy because journaling is recommended by most therapists to write down uncomfortable or disturbing thoughts and feelings. If she had said this in therapy and her husband found out because he knowingly eacesdropped I don’t think so many people would be coming to his defence.", "Maybe and I've used that... and been supremely embarrassed about what I was writing and burned it. Then changed my attitude and approach because I was humiliated and didn't want anyone to know I was capable of having a thought like that! Holy Hannah.", "She should have wrote that the baby was breathtaking.", "Actually, the kid was younger since it's from when they were dating. \n\nShe was roasting a toddler's attractiveness in her diary.", "It is since she's doubling down so fucking hard and going on about how she's thinking it to herself all the time. She's gonna destroy this little girl bit by bit. He needs to get away from her before the \"you know you're not the prettiest\" comments get to her. Someone whose diary could pass for the roast of a toddler is suspect (she said it was from a while ago when they were dating).", "Full fucking stop. My mouth is HANGING open after reading the OP. Never in my wildest dreams would I ever call a child ugly, ESPECIALLY one in my own family. Even if that child was a literal fucking forest gremlin. Even if the poor baby was giving Gollum tease. What an absolutely hideous thing to say, let alone *leave a paper trail on.* IMAGINE if that poor girl had found the diary instead of her father.", "Right she added it her because she thinks she is clever ... But really she's an ass which I find to be a commen situation", "I have a strong feeling all three kids are like carbon copies of dad too 🤣", "Yeah, that part. I worry how she treats his other children. They are young, vulnerable, and potentially in the care of someone who dislikes them.", "He means he has three cute kids\n\nI think she means her kid is cute and one of his is ugly and the last is is okay  but maybe she means their all ugly but there good kids?\n\nI just think judging kids by their looks is gross", "I feel like maybe- maybe- I could imagine writing something about being concerned for what would happen to a little girl who wasn't conventionally attractive in a world obsessed with female beauty. If OP wrote something like that as a private thought that would seem reasonable- diaries are for the thoughts you don't share with others. But thats very different to writing that a kid is ugly.", "So by OP's logic, she should be rooting for her husband to reunite with his ex so his children are raised with both parents.", "Sheeesh I didn’t understand that comment at first but now that you explain it OP is definitely an asshole. How the fuck are people saying NTA?", "\"Dear Diary. Today I met Joe's daughter. God she's a funny looking kid. Of course he thinks she's gorgeous ...\"", "it’s because she doubled down on it in her post. There’s a difference between having a mean thought on accident and having a mean thought, writing it down, and continuing to make mean jokes. \nthe fact that she doesn’t feel guilty about having that thought is concerning", "You’re right. None of them are safe.", "One kid is 0 ugly, and 1 kid is half ugly?", "Or she’s counting the ugly one as .5 so it should be 2.5?", "Her kid is the one and I guess the other two make up 25% each?", "To justify your jealousy of a child getting attention from their father.", "Yeah…I was leaning toward n t a until that last bit.", "Can someone explain the 1.5 out of 3 comment cause I’m not sure I fully understand. I’ve never heard a comment like this and I’m a little confused.", "I mean, if she keeps it in her head, is it a problem? We all think awful, judgy things. I can’t imagine writing those judgy things in my diary, but if it helps her process it, that’s fine.\n\nAlso, just throwing it out there… but lots of weird-looking kids turn into serious hotties (I, on the other hand, was a very pretty child and it all went downhill from there.)", "Not everyone is attractive lmao. You can see a kid and be like “that’s a cute kid”. But there are definitely instances where that DOESNT go thru your mind when you see a child", "OP needs a hobby instead of picking on little kids appearances. How's she going to treat her child if they don't look beautiful to her? Almost sounds like the kind of mother that puts down her children for the way they look.", "No, it’s not.  Thats what journaling is.  Writing down your private thoughts that you wouldnt share with anyone else.  It’s cathartic and helps you sort through what is a fleeting thought and what is how you really feel.", "no, it’s not.", "I know a whole lot of mental health professionals who would disagree with you.", "I have to say, when I love someone, I don’t see ugliness. Im not trying to be all rose garden and fluffy, but truly, if someone were to tell me they think someone is ugly and I love that person, I just can’t fathom seeing it. \nLots of people have said it to me about an extended family member, but I adore that person as they’re so genuine and lovely that I just don’t see bad looks. \nIm not sure if this makes sense, but, not only am I shocked that the OP would think this of a child, I also question how OP really “sees” that little girl 😔\nYou know you didn’t need to ask this OP - YTA all the way!", ">giving Gollum tease\n\nI am DYING over here. If I were ever to become a Pageant Mom, this would be the wildly inappropriate styling I'd inflict on my ~~vicarious childhood~~ daughter. It would involve a skeleton onesie, body-slime, blue contacts, and rubber fish accessories for giving that *je n'ai se Gollum* tease to the judges.", "I used to work with kids, and I honestly don’t think I’ve ever met a kid who I considered “ugly.” Kids are like dogs and cats, even the odd lookin ones are pretty cute in my book", "Can someone explain that to me please? I'm confused. What does she mean \"batting 3 for 3\"?", "I could also see *maybe* making a comment along the lines of \"baby Z's newborn phase was awkward with the super cone head and bruising from the forceps. It was kind of ugly. Hope the new baby fairs better\". Newborns can be super weird looking for the first few days, especially when they are not yours.", "I could see that but she's clearly actively thinking the stepdaughter is ugly and the stepson is barely passable with the 1.5 clever little burn in her head when her husband mentioned how he has 3 cute kids. If she's so worry about their looks then she wouldn't be ranking the stepson as \"half ugly\" in an attempt to make fun of her husband's genetic offering in her head. \n\n\nI'm wondering if she has some jealousy issues with the ex wife and this is her fucked up way of comparing herself and her marriage to theirs or something. Like \"I pushed out a pretty baby while you made some fugly ass kids with the ex.\"", "Yeah, I figured that must be it (or she’s just bad at math).", "It kills me how people just refuse to acknowledge it. I'm so glad your aunt did!", "Eh he’s batting 3 for 3!", "No, the son is half ugly, so he gets 0.5. The stepdaughter receives 0, and OPs child is the only attractive kid so they get a 1, which equals 1.5", "I think she thinks the daughter is 0 and the son is 0.5", "Agreed. You can write whatever you want in your private diary, no matter how petty or messed up.\n\nBut, the doubling down at the end really pushed it over the edge.", "I’m understanding it as OP thinks their own kid  with husband is good looking and that husband’s son is average attractiveness? So one kid is attractive and one kid is half attractive makes 1.5 out of 3 attractiveness? It’s such a truly bizarre thing especially when we’re discussing children that yeah, it’s really hard to fathom.", "She also thinks the other kid is half ugly. The only cute one is her own precious spawn.", "He said three out of three as in all of his kids are beautiful and in her head she thought one and a half ain't bad meaning that her child was beautiful, one of his children is barely passable, and the other (the daughter) is not even close. She is just again thinking his children are ugly it had no bearing to the story yet she felt the need to add it any way and just shows how little shame she feels over what she thought and seems to think about regularly about a child.", "The husband has three kids. The OP thinks one and a half of them are \"successes\" (attractive enough, I guess.)", "Sure but personally if I had that thought about someone I loved I would feel ashamed of myself and if I felt ashamed I definitely would not ad the 1.5 thing at the end I had no impact on the story we had all of it she was just doubling down and adding it to show that she truly does think it and wants us to know it was not a one and done.", "It might go through your mind, but that’s exactly where it should stay. YTA", "Having enough of an opinion about a child's appearance that you write it down is very weird", "Yes it is.", "And they also are awkward as hell at certain ages and grow out of it", "The husband thinks all of his kids are good-looking, which is 3/3. OP believes his daughter is ugly =0, the son is half ugly =0.5, and her kid is the only cute kid=1, so 1.5/3", "Ugh. That’s fucked up. Thanks for the explanation.", "I would bet it's because the girl looks like her mom and the other child has features from both parents. Therefore 0.5.\n\nUnlike her desirable child.", "I had a feeling it was something along those lines but wasn’t entirely sure so thank you for explaining! I can’t believe an adult is so malicious and superficial to a child she’s supposed to treat as her own! Poor little thing!", "Yuck! So it is what I thought! \nDefinite ESH, though OP sucks a lot more - and I get VERay triggered by my privacy being invaded.", "Which probably has something to do with OP hating the moms, also.", "Seems like she thinks *her kid* is a whole 1, but her 2 step kids are only equal to  1.5 *together* and shiiiiit..... I'm not sure how OP is splitting that 1.5 between 2 young children but omg OP is totally judged YTA, because excuse me wtf?!?!", "But there are 3 kids, so... 1.5 out of 3 means, she doesn't think much of the 2nd of his either.", "Unfortunately that's normal for parents. The amount of parents I know who are delusional about their kid is outstanding. Biology is a hell of a drug.", "No, that’s the literal foundation of therapy. You can have any kind of feelings, you can’t control it, it’s how you act on them that matters. And according to OP she never conveyed her feelings into actions jn any way. A diary is a 100% private thing, it’s not supposed to be used, seen or anyhow interact with an outside world. Her husband is in “play stupid games get stupid prizes” boat.", "A diary…is literally a place where you write down your opinions and feelings about anything. That’s what it’s for.", "It... Isn't. Not if you expect your private diary to be *private*. A private diary is a place to vent. It may be a bit hypercritical, perhaps mean-spirited, but it's also contextual-- we didn't get the full paragraph. It's her personal diary. Who cares what she chooses to write?  Feel free to get the opinion of any professional therapist.", "What exactly was said in the diary? I don’t see what exactly was said about the child?\n\nI see where you said the child is not pretty, who cares really? So you had an opinion and it was written in your personal business. Everyone thinks thoughts that should never be spoken or written. A horrible lapse in judgement, sure, but you guys are hysterical.", "Yikes\n\n\n(Thank you. It makes sense now. And OP has problems)", "Nah it’s worse than that. She thinks the stepdaughter is a zero out of one. The son is apparently just so-so (0.5 out of one) and her own child is obviously a 1/1. It adds up to 1.5.", "Exactly. Her child is cute. His daughter is ugly and his son is only half ugly. 1.5.", "Honestly though. You can't be mean in your private diary in case it hurts someone's feelings?", "I love how everyone on here wants to condemn this woman for literal thoughtcrime. Some thoughts are ugly and being able to reckon with them in a journal can be really cathartic for some people. Also everyone is implicitly valuing physical beauty above all else, some people are subjectively and even conventionally ugly and it's also not a big deal. Insulting someone or sharing those opinions with people is wrong because of how it can effect them, but having them isn't, it's the ugly side of being human."]}