{"id": 11689, "submission_id": "11krdws", "title": "AITA for eating a meal that was delivered to my apartment by mistake?", "selftext": "Today, an Uber eats driver knocked on my door to make a delivery, but neither me nor my roommate had ordered food. I told him I didn't order food, but we both double checked the address in his app, and he was at the right place. He said he didn't know what to do so he told me to keep it and he left.\n\nI figured, hey, free food, and ate it.\n\nA bit later, a guy I don't know knocks on my door and asks if Uber eats dropped off food here earlier, and I said yes. He asks if I ate it, and I told him yes. He starts yelling about how that was 50 bucks and tries to get me to pay for it. I told him no, and that he should contact Uber Eats support if there was a problem with his order. He gets huffy and says \"thats fucked up man\" before walking off.\n\nAITA for eating this food?", "created_utc": 1678170025, "permalink": "/r/AmItheAsshole/comments/11krdws/aita_for_eating_a_meal_that_was_delivered_to_my/", "score": 36, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took that should be judged is eating food that wasn't mine. I didn't pay for the food, so i feel like eating it might make me the asshole, and I should have waited instead.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, but the Uber eats driver should’ve have had the option to text the actual guy and tell him that the address is wrong. \nI would’ve waited an hr or two before touching the food tho in case someone comes to pick it up.", "NTA\nYou tried to tell the Uber eats driver that they were at the wrong place", "NTA It's the buyers fault for not double checking the address.", "Ehhh... look something similar happened to me recently and it took a couple of minutes to sort out that it was actually an order for my neighbour, who I don't really know (but have met). I would've been an arsehole if I'd known whose food it was and taken it anyway.\n\nBut once you take delivery of the food,  food safety laws will usually dictate that the restaurant or uber eats can't take it back. They can't guarantee that it isn't now laden with bacteria that will kill the person who eats it. *(A huge amount of trust goes into ordering food!)*\n\nCorrect protocol when this happens is to contact uber eats, get a refund, and -- if you can afford it -- reorder. If hangry dude couldn't afford to reorder until the refund was processed, that sucks... but if you hadn't eaten the food, for all he knows it's been sitting out at the perfect temperature to grow bacteria. Or you've been sticking body parts into it. Or licking it.\n\nNTA, even if hangry dude was legit and just weirdly trusting of complete strangers' food handling. \n\nBut I'm guessing this was a scam -- dude buys meal, puts in the wrong address, waits for delivery, gets a refund because he didn't get his food, waits 20-30 minutes, goes to wrong address to intimidate resident into giving up the cost of the meal. Profit!", "NTA- i would have done the same thing. It’s mostly the drivers fault for not checking with the buyer after you said it wasn’t your food.", "NTA, but with a side of everyone sucks here. Like you tried to get the uber driver to take it back, they didn't. Rando shows up to your house later and is angry that you ate his food when it was he who made a mistake entering his address.", "NTA", "NTA. These company’s have rules on this. Delivered food, cannot be returned to the driver, once delivered. The driver cannot come back and pick up a wrongly delivered order. \n\nEither the buyer entered the wrong address (it happens, and is their error. This then becomes the restaurant’s prerogative if they replace the meal.) or the driver read the address wrong (driver error.) Either way, you do not owe the driver anything.\n\nIt might even be a scam. Driver gets $50 from you, tells restaurant order was wrongly input (claiming buyer error. Restaurant rushes new order,) and driver delivers order correctly. \n\nNTA.\n\nI had one recently. Ordered two all day breakfasts. Got my order, and also got someone else’s chocolate milk, tied to my bag. I contacted the driver, told him the bag had a house number close to mine, but no actual address. He told me to keep the milk. And he was already in the process of retrieving another one from the restaurant to go to the right house. So… free drink.", "NTA: when Uber eats makes a mistake with a delivery, they send a refund *and* offer to redeliver the same meal…\n\nIf you hadn’t had eaten it, it would have been wasted anyways. \n\nAlso, sounds like the guy who actually ordered the food realised the mistake he made, so he was hoping to get the refund, the original meal and the new meal.", "Could this be some kind of a scam?? I remember reading one about the person who \"bumped\" into a guy walking and eating nachos. The nachos fell down and asked the person for money to replace the ruined food. \n\nOr does this sort of thing happen all the time with uber eats? I have never ordered from them.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nToday, an Uber eats driver knocked on my door to make a delivery, but neither me nor my roommate had ordered food. I told him I didn't order food, but we both double checked the address in his app, and he was at the right place. He said he didn't know what to do so he told me to keep it and he left.\n\nI figured, hey, free food, and ate it.\n\nA bit later, a guy I don't know knocks on my door and asks if Uber eats dropped off food here earlier, and I said yes. He asks if I ate it, and I told him yes. He starts yelling about how that was 50 bucks and tries to get me to pay for it. I told him no, and that he should contact Uber Eats support if there was a problem with his order. He gets huffy and says \"thats fucked up man\" before walking off.\n\nAITA for eating this food?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yta.  You didn't pay for it it wasn't your food to eat", "YTA. \nYou knew the food wasn’t yours. You should’ve tried contacting the restaurant or Uber eats. Or you should’ve waited a little while.", "YTA. You ate it before even just leaving it outside a few minutes?", "Wow. That's a perspective I hadn't previously seen!", "The E S H judgement is only valid if OP was an AH, otherwise it's just N T A, even if several other people were AH.", "I can see telling them they should’ve held off for a minute and potentially even left it outside their door as, presumably, the person lives in the same building… \n\nBut asking someone to contact Uber (which they probably can’t even do because they would have no record of the order) or the restaurant (which has no control over the delivery company) for an order that isn’t theirs is wild and unreasonable.", "They legally cannot take the food back", "No way is OP responsible for trying to fix the mistake.  Also there is no way I am leaving a bag of food outside my door hoping someone will come and claim it.  Most likely it is going to be claimed by an animal and then that is just another mess I have to clean up.  If this would have happened to me I would have just tossed in the garbage and gone on with my day.   Actually I never would have let the driver leave it with me in the first place.    Either way not OPs mistake NTA", "They should have left it on the stoop and waited like an hour. If it was still there in an hour then reheat it and eat it.", "OP did try to contact UberEATS. They spoke with the driver and confirmed the address, and told the driver that they hadn't ordered any food. The driver told them to keep it. OP did nothing wrong here.\n\nI strongly suspect the buyer was banned from the delivery service and was trying to circumvent the ban by getting food delivered to a different, but nearby address.", "OP confirmed with the driver that it was delivered to the correct address, and tried to give it back. The driver told OP to keep it and enjoy the free food.\n\nIf the buyer wanted food delivered to his house, he should have entered the correct delivery address. Clearly he knew how to check it, he managed to get to OP's house and knock on the door.\n\nMy guess is that the buyer had been banned from the delivery service prior, and they were trying to circumvent the ban by getting the food delivered to a different but nearby address."]}