{"id": 11685, "submission_id": "11ks3x7", "title": "AITA for telling my friend that she can't expect us to drop everything for her?", "selftext": "I have a friend, \"Victoria\" (30F) who I love dearly but she has a quirk that I cannot stand. Victoria is notoriously indecisive. Sometimes it can be avoided, others not much.\n\n&#x200B;\n\nThe last big point of contention was 5 years ago, when she got married. People took off work, booked flights, etc...all for her to change her mind just months before the wedding. Both times, there was no emergency or reason to change the date. She just found a better venue and it was still early enough to get deposits back on the original, so she did it. Of course, people were upset. And once again, a lot of people couldn't come to the new date. A few of us tried to tell her to manage her expectations. Victoria just kept saying it was her special day, she could do with it what she wanted. And what's worse is, two friends in our group supported this behavior.\n\n&#x200B;\n\nWe've had some minor issues where we'll start planning group trips, only for her to back out or want to change everything. We never lose money, but it's still annoying. And still, we resolved this by basically planning everything and telling her where to show up.\n\n&#x200B;\n\nCut to the next time that's not possible, this year. Victoria is pregnant with her first kid. She helped plan the shower and picked the venue (a friend's house), date, etc. This time we triple checked that this is what she wanted. She said yes. The shower is supposed to be in 2 weeks. Then...she changed her mind. She wanted to change the venue and the date. \n\n&#x200B;\n\nOnce again, several people can't come. And this time, I'm included. My husband and I have an anniversary trip planned. Non-refundable tickets and resort accommodations. We're also going to be somewhere that doesn't allow technology.\n\n&#x200B;\n\nVictoria asked me to reschedule and I said I can't, I'm sorry, but I'll send a gift. She got really upset and said she wanted me there. I sympathized but said I had this trip planned for over a year. She then mentioned how many other people can't come. I pointed out maybe it's a sign to keep the shower on the same date, same venue, etc. Especially as our friend is still willing to host. Victoria tried to pull the same old \"it's my special day, you only get one baby shower, etc\". I got fed up and told her that she is well within her rights to change the date, but that it is inconsiderate to constantly do this last minute. I pointed out while she's free to do what she wants, she has to stop getting mad at others for having lives and not dropping everything for her. Victoria began to cry and hung up.\n\nOur friend group is divided. Some think I should've just let her be upset, she'd get over it in time. That it wasn't the place to bring up my issue with her indecisive nature. Others have told me that I did the right thing. So, AITA?", "created_utc": 1678172380, "permalink": "/r/AmItheAsshole/comments/11ks3x7/aita_for_telling_my_friend_that_she_cant_expect/", "score": 22, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Teling my friend that she can't expect us to drop everything for her. 2) She is pregnant, hormonal and I could've just let her be angry.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You should’ve told her this along time ago.", "NTA. She can't expect people to keep changing plans on her whims. If people accommodate her, she will continue to do this.", "NTA She needed that reality check.", "NTA. Yous all were trying to be there and be available. End of the day she can keep changing dates but everyone has jobs everyone has commitments I would be so pissed off if I wasted my holiday hours to book it off for her then cancel it likes it’s nothing", "NTA. “I’m sorry I’m unavailable to acquiesce to your last-minute scheduling decisions.“ \n\nBut my petty side wants to tell you to tell her you can make it only to change your mind last minute because you “found a better venue for that day.”", "NTA. You set boundaries, you didn't say anything cruel, everything was honest. You were not out of line. As described this is normal, healthy confrontation and something she probably needed to hear a long time ago.", "NTA\n\nVictoria can't expect people to keep changing their plans just for her.\n\nYall need to stop appeasing her like this.", "NTA\n\nShe can change her plans to suit her better and she's right, it's her day, but others also get to decide not to come if the date or venue is inconvenient. That's something she'll have to learn to deal with. \n\nIt's also a good thing you told her. If no one ever says anything, she might not realize that there's a problem. Now at least she knows and can decide what to do moving forward.", "NTA\n\nIf she was accepting of people not being able to make it to her new plans, it would make sense to not say anything. But if she's going to be put out because people won't re-arrange their lives for her updated plans then you did the right thing by explaining to her that the world doesn't revolve around her.", "NTA\n\nAnother case of a person with Main Character syndrome lmao", "NTA - she is wasting people’s time and money planning stuff only to change her mind. She can’t expect people to be available if she changes the date. She seems very self absorbed", "NTA Let the friends who think this behavior is okay to support her. It is absolutely ridiculous that she asked you to change your trip. It reminds me of people who test relationships to see how many hoops a SO will jump through because they love them.", "It's not like you called her out for changing her mind over one occasion, but that there is a history of disrupting plans to the inconvenience of others. Not bringing it up will only enable this behavior, and you will have more of such incidences to deal with in future. NTA.", "NTA honestly I don’t know how you’ve put up having her as a friend for so long. I’d have ditched her ages a go. She’s inconsiderate and arrogant.", "NTA. You didn't say anything that wasn't completely true. Could you have said it in a way that didn't upset her so much? Maybe. Maybe not. She sounds unbearably self-centered.\n\nBoy, is she going to be in for a shock when her entire life will start being dictated by a human that weighs 9lbs.", "NTA but I wouldn't keep being friends with this person long term. She is clearly very self centered and disrespectfull of other people's time, and I don't tolerate that. It's perfectly reasonable to not attend her baby shower if you have a trip planed. To be honest, I probably wouldn't go even if I didn't have plans, just because I would be fed up with her behaviour.", "NTA. You gave her a reality check and she needs to deal with it. It's good that you've stood up for yourself and didn't allow her to get her way this time.\n\nShe either needs to fix her habits or stop making it other people's problems or you should probably consider if you truly want someone like that in your life.", "NTA and nicer than me. I would have responded “My anniversary only happens once a year. It’s actually MY special day, specifically, whereas your baby shower was already planned and can happen on any day leading up to the shower, so actually you’re the one asking me to mess up a special day for your whim here.”", "NTA, you were absolutely right. How she can expect you to cancel your own plans, non refundable at that, at her whim? Hopefully she will learn from that the hard way.", "NTA. You're riggt when you say she is free to do what she wants; seems like she doesnt realise that actions have consequences. If you keep shuffling the date of any event around, especially if folks have to travel, eventually people are just going to quit showing up alogether.", "NTA... pretty clear cut case, hard to understand why people are siding with her over you on this one...", "Your  half of friends are the cause of the problem ! They telling you to let her be upset  at you because you  won't  change every plan you  made for her .She needed someone to tell her the truth . In her mind she sees everybody being mean to her  and unsupportive  when in reality she is the problem", "NTA. She's not being indecisive, she's being entitled and self-absorbed. She really does think the world revolves around her, and she didn't get that way on her own. Mommy and Daddy raised her that way. I sincerely hope this baby gives her the reality check she still so desperately needs.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a friend, \"Victoria\" (30F) who I love dearly but she has a quirk that I cannot stand. Victoria is notoriously indecisive. Sometimes it can be avoided, others not much.\n\n&#x200B;\n\nThe last big point of contention was 5 years ago, when she got married. People took off work, booked flights, etc...all for her to change her mind just months before the wedding. Both times, there was no emergency or reason to change the date. She just found a better venue and it was still early enough to get deposits back on the original, so she did it. Of course, people were upset. And once again, a lot of people couldn't come to the new date. A few of us tried to tell her to manage her expectations. Victoria just kept saying it was her special day, she could do with it what she wanted. And what's worse is, two friends in our group supported this behavior.\n\n&#x200B;\n\nWe've had some minor issues where we'll start planning group trips, only for her to back out or want to change everything. We never lose money, but it's still annoying. And still, we resolved this by basically planning everything and telling her where to show up.\n\n&#x200B;\n\nCut to the next time that's not possible, this year. Victoria is pregnant with her first kid. She helped plan the shower and picked the venue (a friend's house), date, etc. This time we triple checked that this is what she wanted. She said yes. The shower is supposed to be in 2 weeks. Then...she changed her mind. She wanted to change the venue and the date. \n\n&#x200B;\n\nOnce again, several people can't come. And this time, I'm included. My husband and I have an anniversary trip planned. Non-refundable tickets and resort accommodations. We're also going to be somewhere that doesn't allow technology.\n\n&#x200B;\n\nVictoria asked me to reschedule and I said I can't, I'm sorry, but I'll send a gift. She got really upset and said she wanted me there. I sympathized but said I had this trip planned for over a year. She then mentioned how many other people can't come. I pointed out maybe it's a sign to keep the shower on the same date, same venue, etc. Especially as our friend is still willing to host. Victoria tried to pull the same old \"it's my special day, you only get one baby shower, etc\". I got fed up and told her that she is well within her rights to change the date, but that it is inconsiderate to constantly do this last minute. I pointed out while she's free to do what she wants, she has to stop getting mad at others for having lives and not dropping everything for her. Victoria began to cry and hung up.\n\nOur friend group is divided. Some think I should've just let her be upset, she'd get over it in time. That it wasn't the place to bring up my issue with her indecisive nature. Others have told me that I did the right thing. So, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA Your self indulgent friend thinks you should dump your plans because she wants  you there? It is long past the time someone told her the world does not turn on her whims.", "NTA- it's not like she's changing her mind over a restaurant venue!\n\nInterestingly the husband and father of child doesn't even seem to factor in those plans. What about his family and friends?", "NTA, she needs to be told that she's noone special and others have lives too. If you are free you may bother turning up but she's definitely not as important as other people in your life and you have commitment towards others as well. Tell her not to expect people to make plans for her and when noone starts showing up to her special events, either she will change or get used to it. Seems like she feels entitled enough to demand others to be there. When you have kids, they take priority, when you have family who is sick they take priority, when you have plans they take priority. Sometimes its better to be the AH than having to put up with a lot of crap by certain people. If it was me, it would have been a 'sorry got plans and cannot make it. all the best' would be all she gets.", "NTA.  You and your husband go on your trip and have fun.  She’ll be alright.", "NTA \n\nShe totally needed to hear that. She can't seriously expect everyone to drop their other plans just cause she changed her mind about the date...", "Genius 😂😂😂"]}