{"id": 1172, "submission_id": "ym0kk2", "title": "AITA for suggesting my MIL leave my FIL?", "selftext": "Background: My FIL and MIL are an extremely traditional, ultra-religious couple. FIL doesn't believe in Western medicine; MIL does. MIL/FIL do nothing but complain about each other. MIL/FIL estranged themselves from my husband (H) and me for seven months when we asked for a month's space to treat my H's addiction issues.\n\nSTORY: MIL had a major stroke two months ago, was medivac'ed to the nearest big city, where H and I live. FIL didn't even come to the hospital, just sent a text saying MIL \"fell.\" We had to get medical POA to get her insurance info and make medical decisions while she was unconscious because FIL was MIA. Since then, FIL has come to the hospital under pressure once a week for three hours. He will sometimes text or call her. SIL, H, and I have done everything else.\n\nMIL is supposed to go home after Thanksgiving, but is still in a wheelchair and half-paralyzed. She needs 24/7 professional care. We gave FIL a list of potential caretakers, which he said was too long and refused to call. He won't hire house cleaners and instead has his ailing 84-yr-old mother clean; she will likely also be caretaker. He won't even install a detachable shower head or a grab bar by the toilet because he \"likes it the way it is.\" He is trying to get MIL to move her inheritance money into a joint account where he can access it. \n\nH and I told MIL we are worried FIL will neglect her and have concerns when she goes home; she agreed he would, \"but that's just how he is.\" I went so far as to offer to help her find housing in the Big City if she wanted to start fresh, which she laughed at. MIL's PT recommended an intense therapy program added to the end of her stay that could get her to walk. We suggested at the least she do the intense program so she could go home walking and she started sobbing \"Oh God, help me,\" and yelling at us that we couldn't understand what it's like to be in her body.\n\nAfter our talk, MIL has given us the cold shoulder and won't answer our texts unless she's asking us to do something. When we call FIL, he yells at us for not doing more, then hangs up. MIL has requested a copy of the will, so I guess we're getting written out yet again. My assumption is we will be estranged again as soon as MIL goes home and no longer needs us for medical care. \n\nAWTA for thinking FIL will neglect MIL? AWTA for saying something to MIL and trying to offer options besides going home?", "created_utc": 1667572260, "permalink": "/r/AmItheAsshole/comments/ym0kk2/aita_for_suggesting_my_mil_leave_my_fil/", "score": 1, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I told my MIL that FIL will neglect her after stroke and offered to help her leave him. 2) People don't like being told they should leave their spouse and maybe I should have left well enough alone.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: how old are FIL and MIL?  Who is the 'we' that appears in this story?\n\nNTA, I guess, since your motivations seem positive.  But it sounds like MIL wants to be supported in the life she has, rather than switching to a new life.  Honestly, they both sound like a pain.", "NTA. You did the best you could in that situation.", "NTA. You are 100% valid in your worries for your MIL. The fact that he wants her inheritance moved into a joint account is alarming. He wants to burn through her money. At this point, you guys have done what you can to help her, and now she need to want to help herself. This is a terrible position to be in, and I am sorry you guys are going through it. But now you guys did the right thing.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground: My FIL and MIL are an extremely traditional, ultra-religious couple. FIL doesn't believe in Western medicine; MIL does. MIL/FIL do nothing but complain about each other. MIL/FIL estranged themselves from us for seven months when we asked for a month's space to treat my husband's addiction issues.\n\nSTORY: MIL had a major stroke two months ago, was medivac'ed to the nearest big city, where husband (H) and I live. FIL didn't even come to the hospital, just sent a text saying MIL \"fell.\" We had to get medical POA to get her insurance info and make medical decisions while she was unconscious because FIL was MIA. Since then, FIL has come to the hospital under pressure once a week for three hours. He will sometimes text or call her. SIL, H, and I have done everything else.\n\nMIL is supposed to go home after Thanksgiving, but is still in a wheelchair and half-paralyzed. She needs 24/7 professional care. We gave FIL a list of potential caretakers, which he said was too long and refused to call. He won't hire house cleaners and instead has his ailing 84-yr-old mother clean; she will likely also be caretaker. He won't even install a detachable shower head or a grab bar by the toilet because he \"likes it the way it is.\" He is trying to get MIL to move her inheritance money into a joint account where he can access it. \n\nH and I told MIL we are worried FIL will neglect her and have concerns when she goes home; she agreed he would, \"but that's just how he is.\" I went so far as to offer to help her find housing in the Big City if she wanted to start fresh, which she laughed at. MIL's PT recommended an intense therapy program added to the end of her stay that could get her to walk. We suggested at the least she do the intense program so she could go home walking and she started sobbing \"Oh God, help me,\" and yelling at us that we couldn't understand what it's like to be in her body.\n\nAfter our talk, MIL has given us the cold shoulder and won't answer our texts unless she's asking us to do something. When we call FIL, he yells at us for not doing more, then hangs up. MIL has requested a copy of the will, so I guess we're getting written out yet again. My assumption is we will be estranged again as soon as MIL goes home and no longer needs us for medical care. \n\nAWTA for thinking FIL will neglect MIL? AWTA for saying something to MIL and trying to offer options besides going home?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - But it doesn't sound like she wants your help.  Unless she's having cognition issues, her choices are hers to make.", "FIL: 68. MIL: 74. We: My husband and I. I fixed to clarify.", "She wanted our help for the first month, when she couldn't communicate effectively with doctors and wanted us up there 24/7. We were her \"wonderful, sweet babies\" then. \n\nBut yes, it's like a switch has flipped and now we can do no right."]}