{"id": 1173, "submission_id": "ym0kd9", "title": "AITA for not wanting to sit outside?", "selftext": "I (14F) go to a high school that is 45 minutes away from my house, so I go home with my friend who lives 2 minutes away so my mom can pick me up when she is done with work. Occasionally, my dad picks me up a bit earlier if he is in the area. But yesterday, my friend was sick and my mom was working, meaning I had to sit outside the school until around 6 pm (my school gets out at 2:30 on collaborative days, which was yesterday,so i would have had to wait outside for almost 4 hours). \nBut my other friend offered to take me home with them, so i asked my mom. she was reluctant, and said that i need to get used to “these things” in the real world. but it was like 45 degrees and i didn’t have a jacket, so she agreed to let me go home with them. \n\nmy dad was actually able to pick me up a bit earlier (4:30) from my friends house. but when i got in the car, he started yelling and said that i shouldn’t be so willing to accept help for my selfish needs. i didn’t say anything for the rest of the car ride. my family is still mad at me and say that i am ungrateful for not appreciating the fact that i am able to go to a great high school. I still stand by the fact that sitting outside for 3.5 hours in 45 degree weather is a bit unreasonable. so, AITA?", "created_utc": 1667572248, "permalink": "/r/AmItheAsshole/comments/ym0kd9/aita_for_not_wanting_to_sit_outside/", "score": 2, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i think i may have been inconvenient by having my friends mom bring me home with her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (14F) go to a high school that is 45 minutes away from my house, so I go home with my friend who lives 2 minutes away so my mom can pick me up when she is done with work. Occasionally, my dad picks me up a bit earlier if he is in the area. But yesterday, my friend was sick and my mom was working, meaning I had to sit outside the school until around 6 pm (my school gets out at 2:30 on collaborative days, which was yesterday,so i would have had to wait outside for almost 4 hours). \nBut my other friend offered to take me home with them, so i asked my mom. she was reluctant, and said that i need to get used to “these things” in the real world. but it was like 45 degrees and i didn’t have a jacket, so she agreed to let me go home with them. \n\nmy dad was actually able to pick me up a bit earlier (4:30) from my friends house. but when i got in the car, he started yelling and said that i shouldn’t be so willing to accept help for my selfish needs. i didn’t say anything for the rest of the car ride. my family is still mad at me and say that i am ungrateful for not appreciating the fact that i am able to go to a great high school. I still stand by the fact that sitting outside for 3.5 hours in 45 degree weather is a bit unreasonable. so, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Your friend offered to take you to their house so you didn't sit out in the cold, it's not like you begged them and forced them to. Going to a great high school does not mean it's okay for you to sit in cold weather for 4 hours.", "NTA\n\nExpecting you to wait 4hrs is ridiculous, in my opinion. \n\nHowever can you not make your own way home or sit in the library and catch up on any homework?", "WTF. NTA at all. Accepting help from a friend offering it is not selfish at all. And sitting outside for hours in the cold is not ok.", "NTA. Theres no shame in accepting help that someone offers you. Though I think your parents are angry because they think this situation embarrasses *them* - they're worried about how they look to the family of the friend you went home with and potentially being judged for not being able to pick up their kid on time. I'm not agreeing with them, but I've known people who get very defensive about minor things like this, especially having to do with their children. \n\nBut it's no excuse. You're right that it's completely unreasonable to have you wait outside doing nothing for hours when you have another perfectly safe option available to you.", "Nta at all. Talk to someone at the school and tell them about everything and maybe they can help you", "NTA and I'd tell your parents that I'm sure Child Services would love to hear that they want you to stand outside in the cold for 4 hours without proper warm clothing.", "How is this even a question? NTA. I'm a grown ass adult and I'm not used to anything like that, nor should anyone be. Sitting outside without a jacket in 45 degree weather for hours is how you get hypothermia.  Like. I don't understand how getting somewhere warm is *selfish* - it's a damn requirement to sustaining life.", "NTA\n\nI think your parents are upset because this situation embarrasses them. In the future, maybe you should stay in library to do hw or join a club/sport to pass time if going to others people’s houses is a problem for your parents.", "i live 45 minutes away, and my city is kinda dangerous and i am a pretty petite woman"]}