{"id": 11742, "submission_id": "11ley7b", "title": "AITA for making a gender separated surprise party for my NB son and outing them in front of everyone?", "selftext": "My son (12NB) came out as non-binary last month to me and my husband. From what I understand they sometimes feel more like a boy and sometimes feel more like a girl. Yesterday was their 12th birthday and my husband and I wanted to do something special for them to also celebrate their new identity. My husband came up with the genius idea to have two birthday parties at the same time in our house, one for the boys and one for the girls, and our son could move freely between these two parties based on how they feel. At the end everyone would gather together to celebrate our son's birthday.\n\nWe invited all of their friends for a surprise party, but didn't tell them about the theme to keep it a secret. We made our first floor the \"boys floor\" and the second floor the \"girls floor\". For the boys floor we had some table games and game consoles, and for the girls floor we invited two makeup artists. Both floors had snacks, drinks and appropriate decorations and music. When the friends came, I had them all waiting in our garden. My husband was responsible for bringing our son. However, after my husband came with our son and we explained the theme of the party to everyone, my son started to cry and locked themselves in their room. Only after we talked to them we realized that they haven't came out to their friends yet and we basically outed them in front of everyone in \"the most humiliating way\" according to them. They also said that our idea was stupid. We tried to make them go out of their room but to no avail, and eventually we had to cancel the party and let everyone go.\n\nMy son still doesn't want to talk to us, and I think we might have screwed up big time. AITA?\n\n&#x200B;\n\nETA: OK I get it, we screwed up... No need to call us names, we just wanted to make them happy.", "created_utc": 1678231071, "permalink": "/r/AmItheAsshole/comments/11ley7b/aita_for_making_a_gender_separated_surprise_party/", "score": 49, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My son came out as NB and my husband and I organized a gender separated surprise party for their birthday and new identity. We ended up outing them in front of everyone and cancelling the party.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. You had a golden opportunity to put all of the birthday activities on the one floor and celebrate the fact that makeup, gaming, music, and foods + drink are all genderless/genderfull activities. You highlighted your child's gender expression by enhancing the gendered-ness of their birthday party. Bummer. Big time.\n\n(And on top of that you outed them to their friends? Yikes yikes yikes.)", "YTA just because your a girl doesn't mean you can't like table games and computer games. I am a girl and play DnD various computer games and all and I don't care about make up. How about having a party that let's everyone be together and put no gender into it. Sounds like you have problems and need help", "I think we might have screwed up big time\n\nyeah you did! YTA", "YTA. Ouch. You meant well so there’s that.", "Are they comfortable being called your son? That gendered language was the first red flag. (Not to invalidate their identity if they are okay with it, but it seems like these parents are clueless.)\n\nI'm not even going to get into chewing you out for outing them, which was literally the worst thing you could possibly do. Even if they were out to everyone, this party was a terrible idea. Gender-segregated events are notoriously difficult for nonbinary people because they literally don't belong in either of those spaces. because, you know. they are NOT part of the BINARY.\n\nYTA. Take a major step back and start LISTENING TO YOUR KID", "NTA- Your heart was in the right place. Sometimes (every time?) parents just don't \"understand.\" But throwing a party, that's out of the love for your child even if it's not quite right. I never had a party at all. I think it'd be cool to have multiple themes.", "You meant well but YTA-\n\nYour child is 12. You should have asked them before doing this. It's also not your right to out them.", "YTA. Not only did you out your *child*, you also did go big on gender stereotypes by enforcing cliches for the party. Videogames for boys and makeup for the girls? C’mon. I’m pretty sure most of the kids would have been more happy to not be separated for no reason and have a celebration with all of their friends regardless of their gender.", "YTA. Ouch. You absolutely screwed up. Your poor kid 💔", "YTA - The party wasn't for your kid. Clearly.\n\nYou basically used your kid as an excuse to throw a party that showcases how cool and tolerant and virtuous you are.\n\nYour title says you outed them, yet you still needed to post.\n\nYou thoughtlessly threw your kid under the schoolbus while pretending to be an ally. (Allies don't out people).\n\n\nBeyond all of that, did it occur to you that it's a pretty shitty host that ignores their guests half the time...  There was no version of reality in which this surprise party could be a good idea.", "YTA. I think you were well intentioned. But you blew it in terms of execution. In so many ways. \nFirst, non-binary doesn’t mean multi-personality where one is male one moment and female the next. \nSecondly, non-binary people struggle with social settings or facilities that are based on gender- e.g. restrooms and locker rooms that are divided by gender. Because they don’t identify as either- which one is going to be appropriate or more comfortable for them, etc. \nso consider the context of having a party where you divide people by gender. \n\nYour child may be struggling to understand themselves right now. So I get that it may be hard for you to understand everything. I encourage you to seek support from a therapist who is experienced and supportive of those with gender-related questions/concerns.", "YTA. I’m sure you had the absolute best of intentions, but outing your child was… not great.", "That hurt to read.", "Are you serious? You outed a 12 year-old in front of all their friends without consulting them first. Don't ever do that. They are the only one who gets to decide when, how, or even if, it ever happens. It's not your choice. I can't think of a more tone-deaf and humiliating way you could possibly have \"celebrated\" their birthday. YTA", "I came out to my parents when I was 12 too, who then decided to do the rest of my coming out for me. it SUCKS.\n\nIt wasn’t your right to tell anyone. It was your child’s right to tell people when they were ready. Not for you to out them under the guise of a surprise party. Don’t be surprised if it takes your child time to trust you again. \n\nYou’re so woke that you want to have some weird coming out party for your kid WITHOUT their knowledge but keep misgendering them…. Okay.\n\nEDIT: YTA!!!!!!!", "So, you outed your child without permission, you segregated people by your perception of their gender, and you forced them into your stereotype of \"gender appropriate\" activities based on that perception. And you can't understand why your child is upset? Yesp, major YTA.", "YTA. You don’t out anyone.", "I understand that you had good intentions but you should have asked if they was out to everyone and told them about your idea YTA", "As a nonbinary person myself ill throw in some input \n\nIm going to say NTA \n\nYou meant no harm you wanted to celebrate your child's new identity with him the best way you knew how. \nTake this as a lesson learned and grow from it you guys sound like amazing parents best of luck to learning", "Honestly , I get where the confusion came in. I wouldn't call you guys assholes because considering you're just as new to this revelation as your child , it's understandable as to your adjustment. The party was in good faith & I saw a comment where you stated that you're new to this. You should've really spoke about it with them first because speaking from experience, not everyone comes out to their friends first before the family. I can see it wasn't your intention to purposely out them. Just give them a few days, and let them come to you when they're ready. This is a very big deal in their life right now & chances are they're feeling alone. Don't fully remove yourself , but rather do more research on what being Nonbinary is & take it from there...with that being said, NAH", "Oml yta", "Yta \n\nOmg so much", "Oof. Yeahhhhh, YTA.", "YTA a non-gendered party that doesn’t mention gender or do anything to acknowledge the gender binary would be better and wouldn’t have outed your child. NB = NON-BINARY", "Your child came out to you as not conforming to the gender binary, so you threw them a gender-binary-themed bday party? Obviously YTA", "[removed]", "YTA. Holy shot do some research next time. Also “my son my son my son my son” cut the shit. Do some research.", "YTA.  If you want to regain your child's trust, you need to seriously educate yourselves on what it means to be nonbinary, because the \"fun party\" you came up with is a **fundamental misunderstanding** of what it means to be nonbinary.  Each \"party\" you threw was a **complete reinforcement** of the gender binary and all the stereotypes that come with it.  If your child doesn't completely identify with either category of girl/boy, why would you host a party that *separates* everyone by gender?  This truly does not make sense and it is **not** genius in any way.  *Please* change your perspective that this party was even a good idea in the first place.  \n\nThis doesn't even touch on the fact that you outed your child to everyone.  Again, I think this boils down to your total unawareness of what it means to be nonbinary or queer.  You can apologize to your child now, but until you make a real effort to educate yourselves about the queer community and nonbinary folks, you're going to continue to make uninformed assumptions that hurt them.", "ESH your son should’ve told you he hasn’t told other people yet. You should’ve asked your son if the theme was okay.", "If I were your child I would disown you.", "YTA.\n\n>Son\n\nIf your child is NB, why do you keep calling then your \"son\"? Also, have y’all even considered asking if they came out to anyone else yet? You just jumped to the conclusion and outed them?\n\nEDIT: I didn’t see the comment made, they are ok with being called son. Still, you’re TA for outing them\n\nOk I got it, I made a mistake. I never met and heard of someone that young coming out.", "I get that you had good intentions, and I get how this seemed like a good idea, but it wasn't. Obviously enough judgement has been passed, so I'm not going to do that or call you names, but your child is right to be upset about you outing them without consulting them first. They will almost certainly lose friends over this when those friends' parents find out and forbid the friends from seeing your child; they're probably not ready for that. Also, at this age, plenty of those friends will have heard awful things at home and will repeat them to your child because most 11 and 12yos are still just parroting their parents on most things, even if they themselves don't care or know they don't agree with their parents.\n\nApart from that, the idea is pretty cringey. Genderfluidity (which sounds like what your child is experiencing) doesn't mean I'd be comfortable going between two sex-segregated rooms for the length of a party. For me, and many people, it means my gender feelings are different in different situations. For others, the change is on a scale of weeks or months, not minutes or hours. For other nonbinary people, it means they don't go between the two, but they are neither, totally outside the boxes, and thus a segregated party would feel very isolating and point-missing. It's possible that's what your child feels like. At the age of just-turned-12, it's very unlikely they're able to fully articulate how they feel and what they are, and it will probably be years before they can because the language for trans experiences just doesn't really exist, it's much more of a learning process to figure out how to talk about it.\n\nThis idea would have been much better, honestly, if it wasn't segregated. Have makeup artists and game consoles in the same room/same floor/whatever, and let EVERYONE move between activities that interest them -- I guarantee you there was at least one girl in that group who'd rather play video games, and one boy who wants to learn about makeup.\n\nI'm glad you're accepting. Your support and love is going to matter more than anything else in the coming years. But you're going to need to take your son's cues on what kind of support they need from you. Don't try so hard, you know? Just listen and keep loving them.", "YTA not only did you out your child to their friends, some thing they were not ready to do yet, but in planning a party for a non-binary child, you leaned in so heavy to gender stereotypes. You separated the boys and the girls, and gave the boys games and the girls make up. I don’t even know what to say.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son (12NB) came out as non-binary last month to me and my husband. From what I understand they sometimes feel more like a boy and sometimes feel more like a girl. Yesterday was their 12th birthday and my husband and I wanted to do something special for them to also celebrate their new identity. My husband came up with the genius idea to have two birthday parties at the same time in our house, one for the boys and one for the girls, and our son could move freely between these two parties based on how they feel. At the end everyone would gather together to celebrate our son's birthday.\n\nWe invited all of their friends for a surprise party, but didn't tell them about the theme to keep it a secret. We made our first floor the \"boys floor\" and the second floor the \"girls floor\". For the boys floor we had some table games and game consoles, and for the girls floor we invited two makeup artists. Both floors had snacks, drinks and appropriate decorations and music. When the friends came, I had them all waiting in our garden. My husband was responsible for bringing our son. However, after my husband came with our son and we explained the theme of the party to everyone, my son started to cry and locked themselves in their room. Only after we talked to them we realized that they haven't came out to their friends yet and we basically outed them in front of everyone in \"the most humiliating way\" according to them. They also said that our idea was stupid. We tried to make them go out of their room but to no avail, and eventually we had to cancel the party and let everyone go.\n\nMy son still doesn't want to talk to us, and I think we might have screwed up big time. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA even if you’re kid isnt nonbinary it’s he choice of activities you had for boys vs girl is misogynistic.", "Very much YTA. I get what you did was out of love for your child and is a beautiful way to show them how much you support their journey but with something that sensitive you don't just spring it on them.", "YTA- who does that?! At what point is it a good idea to out your own child. He trusted you and you ruined it. Why would he ever tell you his personal business again. That’s a messed up ‘theme’ after they clearly stated they were non- binary. Was it supposed to be a test?", "YTA\n\nThis is all hilarious. It sounds like a parody of millennial parents with kids written by Joe Rogan.", "YTA. I feel your heart is in the right place, unfortunately the execution was just terrible.", "Yta. I do kind of understand the sentiment of the party but your kid should have at least had an input into it. You should have asked them if the idea was ok before going all out on it.", "YTA, like ouch, this hurt my soul.", "What the hell did I just read?", "This has to be fake because there is no way someone would come but with such a dumb, thoughtless idea. YTA", "YTA DO NOT OUT ANYONE TO ANYONE EVER. It doesn’t matter that they are your child.\n\nAlways let them decide who they want to tell and when.", "YTA. Firstly, call them your child not your son. Being nonbinary means they don't fully identify with either gender and pushing gender stereotypes on a NB individual is disgusting. If you guys had literally done the bare minimum and researched what it means to be NB you would have realized what a collosal fuck up this is. \n\nWho forces such ridiculous gender stereotypes these days? Really? You have to ask if you're an asshole for OUTING YOUR CHILD?! you have to ask if you're an asshole for enforcing some of the most rigid gender stereotypes at your child's party? Your child who doesn't adhere to gender norms? \n\nAre you really this ignorant?", "YTA. Here's a hint: LOSE the term \"son\". Talk to them before making any more assumptions, because everything you're assuming is all wrong.", "Nonbinary means they don't fall into the social gender binaries, so why would you segregate two genders for a party? It's the exact opposite of what your child would want.", "YTA, though an enthusiastically dumb and well-meaning one. Kind of like a golden retriever putting muddy paws on somebody's very precious new clothes.\n\nBest of luck to you all, and please keep being supportive - but maybe ask your child what sort of support they actually want first.", "No matter what the theme or intention, I find it … odd … you made gender-stereotypical floors.  It seems more segregated than you planned.", "Son or they/them, pick one. YTA and very stupid.", " YTA.  Should have received input from your child.  Ugh", "I know you didn’t mean to, but YTA. You did not discuss with them if their friends know or not? Also, the party idea honestly made me cringe, I know you and your husband were trying to come from a good place but you missed it by a mile. I would suggest maybe going on a non binary subreddit and asking what they would want or thought a good party idea would be. I feel bad for you because I k ow your didn’t do this with any bad intent but 🫣. I hope everything works out for them and their friends.", "What the hell where you thinking. 1st sexist setup (boys got games girls got makeup). FyI girls like games and boys like makeup. 2nd what the hell. I'm floored at the lack of intelligence. 3rd congrats on your son never trusting you again and ruining his social life. The bullying is all on you", "I kind of think you've missed the whole point of NB", "Not going to pile on what others have said, seems like you got it.  So I'll add two things.\n\n1. You should ask your child if they still want to be called son or something else (like just child\n2. moving back and forth between genders is gender-fluid.  Not all non-binary people are gender-fluid, and unless they specifically told you they are gender-fluid do not assume they are.  Non-binary is an umbrella term that encompasses a number of different gender experience", "Yes, YTA. They need to be in control of the situation, and you massively undercut that.", "Non binary = fake & (not actually) gay", "It seems like you were making this into a spectacle of acceptance rather than focusing on what was right for your son.", "Not the asshole. You’re a great parent navigating this confusing time. You tried so hard for your son and he is sad about it", "Home shit YTA.", "I feel you’ve missed the point of what non-binary actually is….YTA, you’ve outed him publicly and that is a dangerous age for them-they may experience a lot of bullying now because of your stunt.\nHaving a boys/girls party with typical gender expected tokenism is ridiculous-stick to gender neutral themes next time", "YTA, so not only did you genderseperate by absolute stereotype (what if a girl wanted to play boardgames or vid games?), outed you child, and keep calling them you SON, call them your child. And Ask them what they want before making desicions. \n\nI give you some slack for respecting their choice tho, even when you show it in innappropriate ways.", "YTA What?!?! I mean WHAT?!??   They just told you they feel neither all stereotypical boy nor all stereotypical girl, that they sometimes feel more like one or the other and you decided to have a party that stereotyped boys and girls and separated all the kids based on outward appearances or assumptions into those categories and made your child go back and forth. Also you didn't think to ask a 12 year old TWELVE, if they had come out to all their friends before this HORRENDOUS idea (not genius, how the heck could anyone, let alone two adults, think this was genius?) like, holy heck do you have a lot of graveling to do to your poor child. Also, get them and yourselves a therapist cause you and your spouse need one to not make such egregious mistakes again and your child will need one from this party alone. Like, oh my god I feel so bad for this poor kid. They were brave enough to come out to you and trust you and you did this to them in return? Don't expect them to trust you ever again. I can see you seem to care about your child but you also seem kinda clueless and self-centered in this. Instead of listening to your child about the party even afterwards you still had to ask random internet strangers if YTA and label the party as genius. Gave me the icks after reading how traumatic it would be for anyone! Let alone a 12 year old!", "NTA in my opinion. It seems like you were trying to show your child you support them. It’s new to you and you might not understand everything about it but you’re trying to and a lot of kids wish they had parents that would at least try. Yes this backfired bc they hadn’t come out yet so that’s horrible but you didn’t mean for that to happen. My advice is to talk to them about this, apologize and explain you were just trying to support them and you’ll have more open communication in the future about everything to avoid any more situations like this or new ones that could arise. No one wants to be outed and it was probably very embarrassing and horrifying and it was their birthday as well too which probably makes it worse but your heart was in the right place.", "YTA you literally have put them in danger ffs", "YTA for needing to post this. \n\nI think you were well meaning in the party itself, but you're clearly needing to educate yourself more on this matter. You made a mistake, it was shitty but it happens since you're new to it. But you should be letting your kid guide you here! You obviously messed up, you knew you did, I think needing internet strangers to confirm it in this situation is icky. Maybe that's because you seem like you aren't listening and trying to understand your kid enough which is at the heart of both that party and now, its aftermath.", "These parents aren’t clueless. They are cruel and angry.", "YTA and your edit sucks too. If you wanted to make them happy you would’ve checked with them if it was okay beforehand. You’re ignorant and you should do research on the LGBTQ+ community . Apologize to them and don’t try and justify anything you did which includes saying “we were just trying to make you happy”.", "Why is everyone attacking these people like they hate their kid for being nb. It was a mistake and now moving forward, they should know how to act appropriately.", "I would also like to add that you deciding the theme for a party for any 12 year old is risky at best as it is. It sounds like you really hadn’t thought this through on a lot of levels.", "YTA You screwed up bigtime. You and your husband are hugely insensitive and incompetent parents.", "YTA\n\n\nOmg.... Dude......... your kid came out a non binary and you threw an extremely gender binary themed party. You threw a party centered around \"video games are for boys and makeup is for girls\" ...... it's like you completely missed the point and reinforced the gender binary in celebration of your child being NON BINARY. The lack of awareness. Wow. \n\n\nYou didn't talk to your kid to figure out if they are out with their friends at school. You keep saying \"son\" and \"he/him\" - have you asked if that's still the correct pronouns or way that they want to be referred to? \n\n\nAlso segregating the kids based on gender is weird. I get you were trying to be supportive but the execution was completely wrong.", "YTA - none of that was your call. I mean this in the most empathic of terms - what the clownfucking fuck? You forcibly segregated their friends to do a gender reveal for a preteen. Everyone who attended felt weird, and it's your fault. I do want to say I see the good intent here - you definitely seem like someone who loves their kid and wants to do best by them, but you just paved your way to hell with these good intentions.\n\n#\n\n\nIF you want to repair and build your relationship, apologize and promise to include them in all decision making regarding their life going forward. Remember first and foremost that they are a whole human, who knows their body better than anyone else (even if they're confused). Listen to them, and follow their lead. Support. That is the word to center on. Support, above all else.", "YTA to the maximum degree. You not only made a party saying there definitively were only two genders, you outed them to everyone, forced everything upon them without even pausing for a MOMENT to think how it would affect them. You could barely have done a worse thing for them besides kicking them out or physically hurting them. Your child will never forget this, look forward to then going no contact when they move out.", "YTA. I sure hope this post is fake.", "YTA that’s something your 12NB decides to do or not - that’s not a you decision. And yeah, you’re an AH for assuming. \n \nThey are NB, binary parties for a non-binary is just incredibly inappropriate. \n\nAnd do they appreciate you still calling them “son”", "YTA.\n\nFine with the idea of making the party friendly to both boys and girls, but it was really shitty that you decided that different people had to stay separate. **SEGREGATED**. You also underlined a huge problem for your kid's future: they do not fit either side.\n\n...and you had to out your kid, rather than give them their time.\n\nBesides, was the girls' party really nothing but getting made up? Were you born in 1946?", "I dont agree that you should delete this. This should stay up here as a reminder to anyone else who has such a genius idea.\n\nThat was the dumbest thing you could have possibly done. Shame on you.\n\nOh. Yeah. Yta. Duh.", "YTA\n\nThe most important \"rule\" when it comes to anyone that is LGBT+ is to never, never, ever out them or tell someone else without their permission. I knew my son was trans for months before his father. We knew for longer before our families were told. You ask permission. \n\nAlso, the idea of the party is really weird. I'm sure you were coming from a good place, though really misguided. Also, ask your child if they still want to be referred to as your son. As NB, they might prefer just child. \n\nPlease keep supporting your child but always check with them.", "**YTA** \\- or profoundly deficient in emotional intelligence.", "YTA. \n\nGender segregation at a gender themed party?! To celebrate NB identity?! I don't think you could do anything that was more alienating for someone that is non-binary (*edit:while accepting their identity), to be perfectly honest. \n\nThen outing them is just the cherry on top. \n\nI think you actually meant well which just makes how clueless you are kinda sad tbh. I think you need to do some research to grow some sensitivity in this area.", "[removed]", "YTA\n\nThat is a terrible idea for a party. Do you genuinely think only boys will want to play video games and only girls will want to play with makeup? Or that all the boys will want to play video games and all the girls will want makeovers? Are you still living in the 1950s?\n\nDo you really think it's a genius idea to segregate parties based on sex? I mean, how dare kids want to hang out with all their friends at the same time, amirite? Is your house Iran or Afghanistan where people aren't allowed to socialize with the opposite sex? \n\nWere you going to set up guards to make sure no girls played with the video games and no boys got into the eyeshadow? \n\nAnd then expecting your kid to float between the two, like a negotiator between armed camps? I am astounded at your ability to walk and talk at the same time.\n\nI refuse to believe this level of tomfoolery and ignorance is real.", "YTA and as an older lesbian, I’m **sincerely** concerned for the rest of their educational experience until they can go to college, because there is no way their peers are going to forget this. They’ll be teased being nonbinary until they graduate, about that party, and about crying due to the sheer humiliation. \n\nI hope the other children are understanding and they have some good friends who stick up for them. If not, and *please* listen to me because I mean this, keep an eye on your child. This could be an incredibly triggering event that could cause them to spiral and self-harm. This isn’t just about a party—their trust in you is going to be broken and you’re going to have to work hard to even *attempt* to repair it.", "# YTA\n\nCongratulations on one of the worst parenting disastes I've read on here. Well intended to be supportive! But by gods, that's awful and terrible in every way. \n\nI feel so bad for them, and you're going to have to bend over backwards to remedy this. Not that you can. But you have to try.", "I love the enthusiasm for supporting your child but you need to let them take the lead. Talk to them, ask them what they want and how they feel. Your child is young and still learning about themselves and they need room to be able to do that.", "YTA for misgendering them throughout this post. They’re not your “son”, they’re your child. Or if they’re gender fluid as you claim, sometimes they’re your daughter. Either way, you chose a theme that misinterprets their identity as “this or that”, threw a party they had no say in, and outted them to all their friends.", "you should delete this. \n\nshame on you dummies.", "I hope other commenters are able to tell you what you need to hear. I don’t have the words. YTA", "It’s not “our son”\n\nIt’s “our child”\n\nYTA. You have some serious work to do on your views of what NB means and also knowing your child at ALL it seems. Yikes.", "YTA, obviously. Not sure if anyone said this yet, but you specifically highlighted your child's difference from all of their friends, and made it seem like they don't fit in with anyone, instead of celebrating them and all of their friends *as people*. I don't know why you would possibly think splitting people up into binary groups would be a good idea", "Yikes, YTA. What is this?", "YTA- you should have talked to him about it first.", "“Wow look how fun and woke i am for throwing my non-binary kid 2 parties so they could flow between both genders!”\n\nDid you even ask if this is what your child wanted? Or was this your “i’m such a cool parent look how accepting i am” moment? YTA\n\nyou have to apologize and sit down with your child and fix this. You need to go into this future discussion with an open mind and BE PREPARED for your child to be upset with you, because i can tell you now, they are. You messed up.", "Your son is non binary, he's 12...", "YTA. Politely, what the fuck?", "I think that you meant well but you really need some resources for parents of LGBTQIA+ parents. This sounds like it was extremely traumatic and your lack of knowledge will likely cause a repeat of something similar.", "No no no. Take ever name you get called on the chin like how you expected them to take it. F you. F your husband. You stupidy stupid dummy dumb dumbs. You had no right to do that. You have some serious serious apologizing, groveling, begging and making it right to do. Once again F the two of you. Suck a camels furry c**k", "oh you screwed up **BIG TIME,** But your intentions were pure and you went through a lot of trouble for your child\\* (Kept calling them your son) to have a wonderful party. I wish they could have bucked up and enjoyed it because it sounds like it would have been a blast. Unfortunately, YTA here.", "YTA. \n\nYou outed your CHILD tova bunch of people. It the LEAST affirming way possible. You made a party based on enforcing gender binary and gender stereotypes.\n\nYour child has just been shown very clearly that you will probably never be supportive of them being NB", "YTA - why would you think a good way to celebrate your child and their NB status would be by separating the boys and the girls? Do you think that non-binary people don’t hang out with men and women at the same time? This was such a tone deaf decision by you. Next time don’t assume what your child wants. We all know what happens when you assume and it just made one out of you", "YTA Your kid would have been happier just celebrating with their friends. Plus, it wasn't your job to put them to everyone.", "Okay, YTA for not asking your son about if they were okay with the idea, which would've prevented all of this, but also because that's just a flat-out really bad idea for a party, even if your son WAS on board with it. Just... real dumb virtue signaling gone horribly wrong on this one.", "Yta and massive one at that .", "YTA\n\nI think the heart was in the right place but the brain was not.", "I don't know how my generation screwed this all up and hopped back to 1867, but god damn. Girls and boys don't have a line in the sand about gender. No wonder everyone is non-binary when their parents are idiots. People are people. There are not \"girls do this and like this\" and \"boys like this and do that\". \n\nWe killed that with fire in 1993 in case you weren't watching. Our mothers burned bras and we watched Bowie and Boy George and yet..... You agreed with our grandmothers, who also agreed, fuck that. \n\nI'm so disappointed in my generation and no wonder our kids are changing genders like frogs. We failed them by doing this garbage.", "YTA\n\nNot only did you out your child, you misgender then in this post, and your party idea was just trotting out gender stereotypes. Amazing cascade of ytaness.", "Why did you assume everyone knew?", "YTA. In your effort to show what woke and supportive parents you are, you trampled all over your son. How did you not know they wasn't out to their friends?! Why didn't you check before making these plans?! You outed them. You ruined their birthday. You traumatized them. You caused tension and possible conflict with their peers.\n\nBtw, the party theme was offensive. They shouldn't have to move to another room to express a facet of their identity. They should be able to be either or both in any place at any time.\n\nYou need to educate yourself on how to navigate this.", "Oh my god. This is horrific. You have seemingly positive intentions, but this is something your child is going to remember as a formative trauma. You need to deal with that truth. This party harmed your child. And all you had to do was consider their feelings enough to ask them about it. YTA.", "Satire right?", "YTA - try talking to your kid before sharing personal news", "You may have had good pro LGBTQ+ feelings but you didn't have enough information to fo something like this,   your child is going to need you yo communicate better, listen more and learn more about non binary and what it means to them.  You were lucky enough that they opened up to you early in thier journey and you blew it big style, but with good intentions,  you seriously broke thier trust and that will take time to heal,  get your child into therapy to help them process.  Be supportive and listen. YTA", "YTA. I know you meant well, but this was totally inappropriate (and tacky).", "The first rule of decorum regarding LGBTQ people in your life is don't out them, which generally means assuming they aren't out to people until proven otherwise. Also, the themed parties with the stereotypical gendered interests was a bit cringeworthy, as a woman with minimal interest in makeup and love of video games. Soft YTA, because it seems like you were coming from a loving place.", "So... you outed your child to their friends without their permission. Not only that, your way of showing your acceptance of their fluidity was to... have a party ENTIRELY based around stupid gender stereotypes and divisions. YTA. So, so obviously the a-hole.", "So. Fucking. Stupid. YTA", "Parent's hearts were totally in the right place, but holy fuck did they fuck up lmao", "this was a brutal read, holy hell. and the fact that it clearly came from a well meaning place makes it even worse somehow.", "I’m not trying to pile on here, but where exactly did you get this “genius” idea from? I mean, in what world would this be a good idea? You’ve got some apologizing to do, and i don’t mean just an “I’m sorry” then expecting them to get over it. I mean a ton of research to show them that you understand just why and how you screwed up. I get that it wasn’t your *intention* to screw up this badly, but in the process of trying to show support you badly betrayed their trust. And simultaneously demonstrated that you have no clue what it means to be non-binary. And they need to know that you completely understand what you did and why it was wrong and that nothing like that will ever happen again.\n\nYTA", "YTA\n\nyou should have ASKED your kid what they wanted.\n\nAs a NB person, I would have been MORTIFIED. Your kid was probably trying to figure out who they wanted to tell and you outed them to everyone. \n\nWithout knowing who they can actually trust, you have probably put them at risk for being bullied b/c the wrong people may gossip.\n\nDo more research, TALK to your kid, and find a proper way to apologize.", "[removed]", "YTA. Theres so much to unpack here. First of all, you should never out someone to other people. It’s not your job. Second of all, the whole point of NB is not about boy/girl. So having 2 themed parties highlighting boys and girls was just completely stupid and obnoxious", "Yta. Your heart seems to be in the right place, but yeah, this is not the way to support a nonbinary person, especially one that isn't comfortable talking about it with extended family/friends. You owe your kid a big apology and a conversation so you can better understand them.", "This is so horrible. Oh sweet jesus.", "What even is this? Your child tells you they're non binary and they're newly out and very much working things out.\n\n\nYou decide boy and girl stereotypes, invite all of the friends to announce it and expect them to switch between interests in the time it takes to climb the stairs?!\n\nHoly YTA. \n\nThis was said in confidence, it is a definite confusing time and for SOME kids, they're asking to talk it through by saying they're part of the community. One, you don't just take your child saying non binary and take it as gospel. Two, you don't announce it. Three, its your responsibility to support them to understand who they are. At 12, they know some but not everything. You should be talking it through, letting them know it's potentially a fluid process and offering ongoing support.\n\nThis cries attention for you at the expense of your child. Don't ever surprise party someone that age, let alone one who is dealing with identity issues. And then to do something so extreme and outing them before they're ready... SMH", "100% this, this was the stupidest way to go about supporting their kid", "That caught me, too—were the girls the only ones allowed in the makeup area and the boys the only ones allowed in the video game area?", "As a non binary person yourself, why might you be saying him rather than them?      \nShouldn't you know better?", "Don't forget that they keep calling them their son and not child to respect the child's identification", "Lol a stereotype party for someone who doesnt conform to gender stereotypes. At first I was furious for the child, but now I'm kinda laughing. Soooooo stupid.", "My daughter's 11.  \n\n\nShe knows about NB, Trans, Bi, lesbian, Gay, Demi, Asexual, Agender, Aromantic.  \n\n\nShe learned all of it in school/from her class mates.  \n\n\nTimes are changing.", ">I honestly don’t believe this story mostly because I never heard of a 12 year old even knowing what that is) but here's my explaination just in case.\n\nYou must live with your head inside the sand.\n\nI've met boys and girls that by school age already knew they didn't like their birth gender's stereotypes. Some grew up gay, some drag queens, and some actual transexuals.", "its 2023. Regardless of age these days, you'd be surprised as to how many kids are becoming more aware of different identities and sexualities. They're 12, yes...but they're also comfortable with who they are and to you, it may seem young but there's no age limit or specific age when you should know how you identify. \n\n>If your child is NB, why do you keep calling then your \"son\n\nOP has stated that they're okay with being called son as well. NB is non conforming, if they want to be called son still, that's their choice. Not all NB have they/them pronouns. Some NB people still give the go ahead to be called gender conforming pronouns because of their own preference.", "12 y/o's def come out all the time. They def know what non/binary is as well. 12 is usually 6th or 7th grade. My oldest was 12 in 8th grade cause she was in the accelerated program at school that has them skip a grade if they test out of 6th grade during spring of 5th grade. With social media, YouTube, and even celebrities coming out as such, they definitely know in middle school. They have their own phones, prob felt different and have been googling and talking to others to figure out why for months at least before gathering the courage to talk to their parents. My oldest is only 15 so her middle school experience wasn't so long ago but that was literally when most of those she knew started coming out, just as it was when most experienced their first school dance, first awkward date with parents there, or holding hands, kiss, or bf/gf even if it was like a week long and they never hung out outside of school.", "My kid had a friend who come out as trans at my kid’s 9th birthday party. \n\nAnd currently (age 12) has a non-binary friend who keeps switching pronouns as they explore their identity.", "I mean for Christ sake, OP's child is at the age where their classmates are having boy/girl parties and all just hanging out with each other. Every part of this was so unnecessary and cringe.", "I wondered this too! OP’s party had major “pick a side” energy.", ">Firstly, call them your child not your son.\n\nWhy? How do you know whether the kid is okay with being called son or not?", "To be fair it’s only been a month and they knew their child for 12 years as a boy. People need time to grow and adjust. At least they are trying.", "It was quite literally a back handed response. I'm sure the intentions were good, however misled. This was an egregious display of incompetence imho. How's the saying go \"Never attribute to malice what can adequately  be explained by incompetence\"", "Because no one with good intentions would come up with this idea. People with good intentions would do halfway good things, like running the party ideas before their 12 year old child before the party. People with any kind of social awareness would not use such sexist tropes - girls like makeup, boys like video games - for their child's party. Were the parents born in 1950?  I feel sad for their child. They have a rough adolescence ahead of them with such clueless parents.\n\nBy the way, OP: YTA.", "They literally outed their child in the most humiliating way possible. Maybe to them it was a little 'oopsie' but their ignorance will follow and traumatize their child for years to come. \n\nIt doesn't matter how they move forward because they literally can't ever fix this. It's not just a little mistake, they fucked up massively.", "We'll always support our son. I just hope they'll forgive us.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Okay relax a bit! Obviously OP said they’re new to navigating this, yes I get the whole separating gender thing is wrong but at least they’re trying to an extent. I am not saying they haven’t failed the mission here but at least they supports their child’s decision unlike some parents who do not acknowledge this.", "Plenty of non-binary people still use certain gendered terms. I don't think you should correct people on behalf of people when you don't know them or their preferences. My husband is nonbinary, and I feel like I have to caveat that I know what his pronouns and preferred terms are because people online who have never met him will be like \"He's not your husband then\". It's so presumptuous. You could have just asked \"Have you spoken to them about the term son?\"", "They are fine with us calling them \"son\". This whole NB thing is also new to us, we just wanted to do something special for them.", "I don’t like your attitude here. The parents are trying their best to be accommodating; it’s difficult to understand NB and everything this entails. You have no right abusing them for making a mistake. This is how people learn. We make mistakes, we learn from them. Comments like yours are NOT helpful.", "Him?", "They are non binary and 12 years old, that is correct.", "Seriously! If you ever out your child, you're automatically the asshole in any situation", "Op said their kid was ok with being called son", "I kinda don’t get the idea. Like… “oh my kid is non binary let’s have a gender binary party!”", "Also a very sexest view of what boys/girls want to do.  I would have wanted to be doing what the boys were doing and so would a lot of other girls I know.", "I only read the title and sighed", "I'm not convinced, OP seems like the type who is thrilled that their child is \"One of those NBs I keep hearing about on facebook\" and wanted to cash in without having any idea about anything.", "My grandfather was born in 1909 and was fully supportive of me being trans. Age is no excuse!", "It just kept getting worse! YTA OP, and shockingly tone-deaf", "Op said that their child was ok with being called son", "[removed]", "[removed]", "[removed]", "[removed]", "Cringe Take Heres Your L", "Right, it comes off more like helping them choose or changing their mind to gaslight them at worst, and just insanely clueless at best.", "And research. If OP found Reddit they can certainly find a lot of info on what non-binary actually means, what people and especially kids experience (so as to get ahead of what their kid might have to face) and how to best support them.", "Okay, but the parents are obviously trying to be supportive and are trying to use the correct language.  Perhaps their child stated they still want to be referred to as their son for right now, or the parents are new to all this and got some things wrong.  They've been referring to their child as their son for 12 years, maybe they deserve a little grace on this one as they and their child sort out the appropriate language.", "Yes I get it", "I definitely knew about gay, lesbian, bi, and trans by age 12 but that's because I went hard-core into gay fanfiction at that age", "I didn’t see the comment OP madeo", "I get it, I messed up and made a mistake.", "I can see this being something that older parents would think was a good idea and being supportive. My parents were in their forties when I was born (which was very old to be parents at the time, especially considering I was their first child) and my dad once said to me that he was pleased I didn’t do anything particularly ‘different’ because he’d have wanted to support me but wouldn’t have had a clue how to do it; for example, homosexuality was illegal in my country whilst my parents were growing up, if I’d been homosexual it would have been completely foreign to them. I don’t think they entirely understand that I’m asexual but given that means very little for them to do apart from accept they won’t be grandparents, which was likely anyway because I just don’t like children and always said I didn’t want to have any, it causes very few problems.", "I recommend you stop calling your NB child your \"son\" because it's a gendered term...a suggested option is just \"my child\"", "Sit down with them when they’re ready to talk and give them a heartfelt apology and explain where you now realize you went wrong. Maybe do some research on non-binary identity, there are definitely resources for parents out there, and it may give you a good standing on how to handle the situation. Showing you know you messed up and are trying will mean a lot.", "Stop calling them son to begin with", "Op literally fucked this up in the worst way possible. Them \"trying\" doesn't mean shit when they have done something that could put their child in danger by outing them", "u/dj_too_supreme", "The kind interpretation is that the kid is ok with masculine pronouns hence mom calling them her son.\n\nThe likely scenario is that the mom is as clueless about pronouns as she is about outing.\n\nBut in fairness to the commenters, mom uses 'son' a lot.", "I stand corrected- she should have talked to them first.", "No.", "Atleast their username checks out 🤷‍♀️ lol", "\"And when they open the door, everyone will burst into a choreographed musical bit about how they don't belong.\"\n\nI assume this was planned at some point and discarded simply because of logistics.", "Anybody else feel like a dog pulling on their collar bc they don't want to walk anymore while reading this? Like no no no bad idea terrible execution some research on what it means to be non-binary is in order. I'm non-binary and this is the nightmare scenario. And at 12? Oof a doodle", "That's not in the OP.", "[removed]", "The child is okay with being called son and I didn't read that part but for the grace part of your comment, if this were a verbal conversation and a slip up happened that would be one thing but you can't have a slip of the tongue in text so this would have been on purpose.but in the end it doesn't matter for this spacific story.", "They said they did not know he wasn’t out, doesn’t make it not wrong but they thought his friends knew. People make mistakes", "I saw the comment and made an edit", "Nonbinary people can be okay with being called by traditionally-gendered words & still prefer non-gendered pronouns, or the opposite, or any combination of terms. Maybe OP’s kid is okay with “son” but uses they/them pronouns. It’s all chill, as long as they’re being given the choice & their preferences are being respected. Now, that commenter calling OP’s son “him” when OP never used a masculine pronoun… that one is sus to me, lol.", "No what?", "Op made a reply check the comments from ops profile about the post", "[removed]", "They could've asked him like any sane person would", "I get the feeling from the post that OP isn't very good at the 'respecting' thing... At least when it came to their kid's right to choose when and how they chose to handle coming out.", "[removed]", "Yes, I understand that. But when I made my comment, that reply hadn't been made.", "[removed]", "Yeah, I get that, but in one of their comments OP said the kid is okay with “son,” so I’m tentatively giving them the benefit of the doubt. What they did sucked butts, which it seems like they understand now. I just hope their poor kid doesn’t end up too mortified from this & they can all move on as a family. It seems like OP is trying…which is more than I can really say for my own family, lmao", "I'm sorry you were an unintelligent child, but it's not a universal condition.", "Lots of kids that age know what non binary is.", "It is...", "No they don't."]}