{"id": 11742, "submission_id": "11ley7b", "title": "AITA for making a gender separated surprise party for my NB son and outing them in front of everyone?", "selftext": "My son (12NB) came out as non-binary last month to me and my husband. From what I understand they sometimes feel more like a boy and sometimes feel more like a girl. Yesterday was their 12th birthday and my husband and I wanted to do something special for them to also celebrate their new identity. My husband came up with the genius idea to have two birthday parties at the same time in our house, one for the boys and one for the girls, and our son could move freely between these two parties based on how they feel. At the end everyone would gather together to celebrate our son's birthday.\n\nWe invited all of their friends for a surprise party, but didn't tell them about the theme to keep it a secret. We made our first floor the \"boys floor\" and the second floor the \"girls floor\". For the boys floor we had some table games and game consoles, and for the girls floor we invited two makeup artists. Both floors had snacks, drinks and appropriate decorations and music. When the friends came, I had them all waiting in our garden. My husband was responsible for bringing our son. However, after my husband came with our son and we explained the theme of the party to everyone, my son started to cry and locked themselves in their room. Only after we talked to them we realized that they haven't came out to their friends yet and we basically outed them in front of everyone in \"the most humiliating way\" according to them. They also said that our idea was stupid. We tried to make them go out of their room but to no avail, and eventually we had to cancel the party and let everyone go.\n\nMy son still doesn't want to talk to us, and I think we might have screwed up big time. AITA?\n\n&#x200B;\n\nETA: OK I get it, we screwed up... No need to call us names, we just wanted to make them happy.\n\nETA 2: Some clarifications:\n\n1) My son is fine with the term \"son\".\n\n2) We obviously wouldn't have blocked anyone else who wanted to move between the floors.", "created_utc": 1678231071, "permalink": "/r/AmItheAsshole/comments/11ley7b/aita_for_making_a_gender_separated_surprise_party/", "score": 338, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My son came out as NB and my husband and I organized a gender separated surprise party for their birthday and new identity. We ended up outing them in front of everyone and cancelling the party.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. You had a golden opportunity to put all of the birthday activities on the one floor and celebrate the fact that makeup, gaming, music, and foods + drink are all genderless/genderfull activities. You highlighted your child's gender expression by enhancing the gendered-ness of their birthday party. Bummer. Big time.\n\n(And on top of that you outed them to their friends? Yikes yikes yikes.)", "YTA just because your a girl doesn't mean you can't like table games and computer games. I am a girl and play DnD various computer games and all and I don't care about make up. How about having a party that let's everyone be together and put no gender into it. Sounds like you have problems and need help", "I think we might have screwed up big time\n\nyeah you did! YTA", "YTA. Ouch. You meant well so there’s that.", "Are they comfortable being called your son? That gendered language was the first red flag. (Not to invalidate their identity if they are okay with it, but it seems like these parents are clueless.)\n\nI'm not even going to get into chewing you out for outing them, which was literally the worst thing you could possibly do. Even if they were out to everyone, this party was a terrible idea. Gender-segregated events are notoriously difficult for nonbinary people because they literally don't belong in either of those spaces. because, you know. they are NOT part of the BINARY.\n\nYTA. Take a major step back and start LISTENING TO YOUR KID", "NTA- Your heart was in the right place. Sometimes (every time?) parents just don't \"understand.\" But throwing a party, that's out of the love for your child even if it's not quite right. I never had a party at all. I think it'd be cool to have multiple themes.", "You meant well but YTA-\n\nYour child is 12. You should have asked them before doing this. It's also not your right to out them.", "YTA. Not only did you out your *child*, you also did go big on gender stereotypes by enforcing cliches for the party. Videogames for boys and makeup for the girls? C’mon. I’m pretty sure most of the kids would have been more happy to not be separated for no reason and have a celebration with all of their friends regardless of their gender.", "YTA. Ouch. You absolutely screwed up. Your poor kid 💔", "YTA - The party wasn't for your kid. Clearly.\n\nYou basically used your kid as an excuse to throw a party that showcases how cool and tolerant and virtuous you are.\n\nYour title says you outed them, yet you still needed to post.\n\nYou thoughtlessly threw your kid under the schoolbus while pretending to be an ally. (Allies don't out people).\n\n\nBeyond all of that, did it occur to you that it's a pretty shitty host that ignores their guests half the time...  There was no version of reality in which this surprise party could be a good idea.", "YTA. I think you were well intentioned. But you blew it in terms of execution. In so many ways. \nFirst, non-binary doesn’t mean multi-personality where one is male one moment and female the next. \nSecondly, non-binary people struggle with social settings or facilities that are based on gender- e.g. restrooms and locker rooms that are divided by gender. Because they don’t identify as either- which one is going to be appropriate or more comfortable for them, etc. \nso consider the context of having a party where you divide people by gender. \n\nYour child may be struggling to understand themselves right now. So I get that it may be hard for you to understand everything. I encourage you to seek support from a therapist who is experienced and supportive of those with gender-related questions/concerns.", "YTA. I’m sure you had the absolute best of intentions, but outing your child was… not great.", "That hurt to read.", "Are you serious? You outed a 12 year-old in front of all their friends without consulting them first. Don't ever do that. They are the only one who gets to decide when, how, or even if, it ever happens. It's not your choice. I can't think of a more tone-deaf and humiliating way you could possibly have \"celebrated\" their birthday. YTA", "I came out to my parents when I was 12 too, who then decided to do the rest of my coming out for me. it SUCKS.\n\nIt wasn’t your right to tell anyone. It was your child’s right to tell people when they were ready. Not for you to out them under the guise of a surprise party. Don’t be surprised if it takes your child time to trust you again. \n\nYou’re so woke that you want to have some weird coming out party for your kid WITHOUT their knowledge but keep misgendering them…. Okay.\n\nEDIT: YTA!!!!!!!", "So, you outed your child without permission, you segregated people by your perception of their gender, and you forced them into your stereotype of \"gender appropriate\" activities based on that perception. And you can't understand why your child is upset? Yesp, major YTA.", "YTA. You don’t out anyone.", "I understand that you had good intentions but you should have asked if they was out to everyone and told them about your idea YTA", "As a nonbinary person myself ill throw in some input \n\nIm going to say NTA \n\nYou meant no harm you wanted to celebrate your child's new identity with them the best way you knew how. \nTake this as a lesson learned and grow from it you guys sound like amazing parents best of luck to learning", "Honestly , I get where the confusion came in. I wouldn't call you guys assholes because considering you're just as new to this revelation as your child , it's understandable as to your adjustment. The party was in good faith & I saw a comment where you stated that you're new to this. You should've really spoke about it with them first because speaking from experience, not everyone comes out to their friends first before the family. I can see it wasn't your intention to purposely out them. Just give them a few days, and let them come to you when they're ready. This is a very big deal in their life right now & chances are they're feeling alone. Don't fully remove yourself , but rather do more research on what being Nonbinary is & take it from there...with that being said, NAH", "Oml yta", "Yta \n\nOmg so much", "Oof. Yeahhhhh, YTA.", "YTA a non-gendered party that doesn’t mention gender or do anything to acknowledge the gender binary would be better and wouldn’t have outed your child. NB = NON-BINARY", "Your child came out to you as not conforming to the gender binary, so you threw them a gender-binary-themed bday party? Obviously YTA", "[removed]", "YTA. Holy shot do some research next time. Also “my son my son my son my son” cut the shit. Do some research.", "YTA.  If you want to regain your child's trust, you need to seriously educate yourselves on what it means to be nonbinary, because the \"fun party\" you came up with is a **fundamental misunderstanding** of what it means to be nonbinary.  Each \"party\" you threw was a **complete reinforcement** of the gender binary and all the stereotypes that come with it.  If your child doesn't completely identify with either category of girl/boy, why would you host a party that *separates* everyone by gender?  This truly does not make sense and it is **not** genius in any way.  *Please* change your perspective that this party was even a good idea in the first place.  \n\nThis doesn't even touch on the fact that you outed your child to everyone.  Again, I think this boils down to your total unawareness of what it means to be nonbinary or queer.  You can apologize to your child now, but until you make a real effort to educate yourselves about the queer community and nonbinary folks, you're going to continue to make uninformed assumptions that hurt them.", "ESH your son should’ve told you he hasn’t told other people yet. You should’ve asked your son if the theme was okay.", "If I were your child I would disown you.", "YTA.\n\n>Son\n\nIf your child is NB, why do you keep calling then your \"son\"? Also, have y’all even considered asking if they came out to anyone else yet? You just jumped to the conclusion and outed them?\n\nEDIT: I didn’t see the comment made, they are ok with being called son. Still, you’re TA for outing them\n\nOk I got it, I made a mistake. I never met and heard of someone that young coming out.", "I get that you had good intentions, and I get how this seemed like a good idea, but it wasn't. Obviously enough judgement has been passed, so I'm not going to do that or call you names, but your child is right to be upset about you outing them without consulting them first. They will almost certainly lose friends over this when those friends' parents find out and forbid the friends from seeing your child; they're probably not ready for that. Also, at this age, plenty of those friends will have heard awful things at home and will repeat them to your child because most 11 and 12yos are still just parroting their parents on most things, even if they themselves don't care or know they don't agree with their parents.\n\nApart from that, the idea is pretty cringey. Genderfluidity (which sounds like what your child is experiencing) doesn't mean I'd be comfortable going between two sex-segregated rooms for the length of a party. For me, and many people, it means my gender feelings are different in different situations. For others, the change is on a scale of weeks or months, not minutes or hours. For other nonbinary people, it means they don't go between the two, but they are neither, totally outside the boxes, and thus a segregated party would feel very isolating and point-missing. It's possible that's what your child feels like. At the age of just-turned-12, it's very unlikely they're able to fully articulate how they feel and what they are, and it will probably be years before they can because the language for trans experiences just doesn't really exist, it's much more of a learning process to figure out how to talk about it.\n\nThis idea would have been much better, honestly, if it wasn't segregated. Have makeup artists and game consoles in the same room/same floor/whatever, and let EVERYONE move between activities that interest them -- I guarantee you there was at least one girl in that group who'd rather play video games, and one boy who wants to learn about makeup.\n\nI'm glad you're accepting. Your support and love is going to matter more than anything else in the coming years. But you're going to need to take your son's cues on what kind of support they need from you. Don't try so hard, you know? Just listen and keep loving them.", "YTA not only did you out your child to their friends, some thing they were not ready to do yet, but in planning a party for a non-binary child, you leaned in so heavy to gender stereotypes. You separated the boys and the girls, and gave the boys games and the girls make up. I don’t even know what to say.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son (12NB) came out as non-binary last month to me and my husband. From what I understand they sometimes feel more like a boy and sometimes feel more like a girl. Yesterday was their 12th birthday and my husband and I wanted to do something special for them to also celebrate their new identity. My husband came up with the genius idea to have two birthday parties at the same time in our house, one for the boys and one for the girls, and our son could move freely between these two parties based on how they feel. At the end everyone would gather together to celebrate our son's birthday.\n\nWe invited all of their friends for a surprise party, but didn't tell them about the theme to keep it a secret. We made our first floor the \"boys floor\" and the second floor the \"girls floor\". For the boys floor we had some table games and game consoles, and for the girls floor we invited two makeup artists. Both floors had snacks, drinks and appropriate decorations and music. When the friends came, I had them all waiting in our garden. My husband was responsible for bringing our son. However, after my husband came with our son and we explained the theme of the party to everyone, my son started to cry and locked themselves in their room. Only after we talked to them we realized that they haven't came out to their friends yet and we basically outed them in front of everyone in \"the most humiliating way\" according to them. They also said that our idea was stupid. We tried to make them go out of their room but to no avail, and eventually we had to cancel the party and let everyone go.\n\nMy son still doesn't want to talk to us, and I think we might have screwed up big time. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA even if you’re kid isnt nonbinary it’s he choice of activities you had for boys vs girl is misogynistic.", "Very much YTA. I get what you did was out of love for your child and is a beautiful way to show them how much you support their journey but with something that sensitive you don't just spring it on them.", "YTA- who does that?! At what point is it a good idea to out your own child. He trusted you and you ruined it. Why would he ever tell you his personal business again. That’s a messed up ‘theme’ after they clearly stated they were non- binary. Was it supposed to be a test?", "YTA\n\nThis is all hilarious. It sounds like a parody of millennial parents with kids written by Joe Rogan.", "YTA. I feel your heart is in the right place, unfortunately the execution was just terrible.", "Yta. I do kind of understand the sentiment of the party but your kid should have at least had an input into it. You should have asked them if the idea was ok before going all out on it.", "YTA, like ouch, this hurt my soul.", "What the hell did I just read?", "This has to be fake because there is no way someone would come but with such a dumb, thoughtless idea. YTA", "YTA DO NOT OUT ANYONE TO ANYONE EVER. It doesn’t matter that they are your child.\n\nAlways let them decide who they want to tell and when.", "YTA. Firstly, call them your child not your son. Being nonbinary means they don't fully identify with either gender and pushing gender stereotypes on a NB individual is disgusting. If you guys had literally done the bare minimum and researched what it means to be NB you would have realized what a collosal fuck up this is. \n\nWho forces such ridiculous gender stereotypes these days? Really? You have to ask if you're an asshole for OUTING YOUR CHILD?! you have to ask if you're an asshole for enforcing some of the most rigid gender stereotypes at your child's party? Your child who doesn't adhere to gender norms? \n\nAre you really this ignorant?", "YTA. Here's a hint: LOSE the term \"son\". Talk to them before making any more assumptions, because everything you're assuming is all wrong.", "Nonbinary means they don't fall into the social gender binaries, so why would you segregate two genders for a party? It's the exact opposite of what your child would want.", "YTA, though an enthusiastically dumb and well-meaning one. Kind of like a golden retriever putting muddy paws on somebody's very precious new clothes.\n\nBest of luck to you all, and please keep being supportive - but maybe ask your child what sort of support they actually want first.", "No matter what the theme or intention, I find it … odd … you made gender-stereotypical floors.  It seems more segregated than you planned.", "Son or they/them, pick one. YTA and very stupid.", " YTA.  Should have received input from your child.  Ugh", "I know you didn’t mean to, but YTA. You did not discuss with them if their friends know or not? Also, the party idea honestly made me cringe, I know you and your husband were trying to come from a good place but you missed it by a mile. I would suggest maybe going on a non binary subreddit and asking what they would want or thought a good party idea would be. I feel bad for you because I k ow your didn’t do this with any bad intent but 🫣. I hope everything works out for them and their friends.", "What the hell where you thinking. 1st sexist setup (boys got games girls got makeup). FyI girls like games and boys like makeup. 2nd what the hell. I'm floored at the lack of intelligence. 3rd congrats on your son never trusting you again and ruining his social life. The bullying is all on you", "I kind of think you've missed the whole point of NB", "Not going to pile on what others have said, seems like you got it.  So I'll add two things.\n\n1. You should ask your child if they still want to be called son or something else (like just child\n2. moving back and forth between genders is gender-fluid.  Not all non-binary people are gender-fluid, and unless they specifically told you they are gender-fluid do not assume they are.  Non-binary is an umbrella term that encompasses a number of different gender experience", "Yes, YTA. They need to be in control of the situation, and you massively undercut that.", "[deleted]", "It seems like you were making this into a spectacle of acceptance rather than focusing on what was right for your son.", "Not the asshole. You’re a great parent navigating this confusing time. You tried so hard for your son and he is sad about it", "Home shit YTA.", "I feel you’ve missed the point of what non-binary actually is….YTA, you’ve outed him publicly and that is a dangerous age for them-they may experience a lot of bullying now because of your stunt.\nHaving a boys/girls party with typical gender expected tokenism is ridiculous-stick to gender neutral themes next time", "YTA, so not only did you genderseperate by absolute stereotype (what if a girl wanted to play boardgames or vid games?), outed you child, and keep calling them you SON, call them your child. And Ask them what they want before making desicions. \n\nI give you some slack for respecting their choice tho, even when you show it in innappropriate ways.", "YTA What?!?! I mean WHAT?!??   They just told you they feel neither all stereotypical boy nor all stereotypical girl, that they sometimes feel more like one or the other and you decided to have a party that stereotyped boys and girls and separated all the kids based on outward appearances or assumptions into those categories and made your child go back and forth. Also you didn't think to ask a 12 year old TWELVE, if they had come out to all their friends before this HORRENDOUS idea (not genius, how the heck could anyone, let alone two adults, think this was genius?) like, holy heck do you have a lot of graveling to do to your poor child. Also, get them and yourselves a therapist cause you and your spouse need one to not make such egregious mistakes again and your child will need one from this party alone. Like, oh my god I feel so bad for this poor kid. They were brave enough to come out to you and trust you and you did this to them in return? Don't expect them to trust you ever again. I can see you seem to care about your child but you also seem kinda clueless and self-centered in this. Instead of listening to your child about the party even afterwards you still had to ask random internet strangers if YTA and label the party as genius. Gave me the icks after reading how traumatic it would be for anyone! Let alone a 12 year old!", "NTA in my opinion. It seems like you were trying to show your child you support them. It’s new to you and you might not understand everything about it but you’re trying to and a lot of kids wish they had parents that would at least try. Yes this backfired bc they hadn’t come out yet so that’s horrible but you didn’t mean for that to happen. My advice is to talk to them about this, apologize and explain you were just trying to support them and you’ll have more open communication in the future about everything to avoid any more situations like this or new ones that could arise. No one wants to be outed and it was probably very embarrassing and horrifying and it was their birthday as well too which probably makes it worse but your heart was in the right place.", "YTA you literally have put them in danger ffs", "YTA for needing to post this. \n\nI think you were well meaning in the party itself, but you're clearly needing to educate yourself more on this matter. You made a mistake, it was shitty but it happens since you're new to it. But you should be letting your kid guide you here! You obviously messed up, you knew you did, I think needing internet strangers to confirm it in this situation is icky. Maybe that's because you seem like you aren't listening and trying to understand your kid enough which is at the heart of both that party and now, its aftermath.", "These parents aren’t clueless. They are cruel and angry.", "YTA and your edit sucks too. If you wanted to make them happy you would’ve checked with them if it was okay beforehand. You’re ignorant and you should do research on the LGBTQ+ community . Apologize to them and don’t try and justify anything you did which includes saying “we were just trying to make you happy”.", "Why is everyone attacking these people like they hate their kid for being nb. It was a mistake and now moving forward, they should know how to act appropriately.", "I would also like to add that you deciding the theme for a party for any 12 year old is risky at best as it is. It sounds like you really hadn’t thought this through on a lot of levels.", "YTA You screwed up bigtime. You and your husband are hugely insensitive and incompetent parents.", "YTA\n\n\nOmg.... Dude......... your kid came out a non binary and you threw an extremely gender binary themed party. You threw a party centered around \"video games are for boys and makeup is for girls\" ...... it's like you completely missed the point and reinforced the gender binary in celebration of your child being NON BINARY. The lack of awareness. Wow. \n\n\nYou didn't talk to your kid to figure out if they are out with their friends at school. You keep saying \"son\" and \"he/him\" - have you asked if that's still the correct pronouns or way that they want to be referred to? \n\n\nAlso segregating the kids based on gender is weird. I get you were trying to be supportive but the execution was completely wrong.", "YTA - none of that was your call. I mean this in the most empathic of terms - what the clownfucking fuck? You forcibly segregated their friends to do a gender reveal for a preteen. Everyone who attended felt weird, and it's your fault. I do want to say I see the good intent here - you definitely seem like someone who loves their kid and wants to do best by them, but you just paved your way to hell with these good intentions.\n\n#\n\n\nIF you want to repair and build your relationship, apologize and promise to include them in all decision making regarding their life going forward. Remember first and foremost that they are a whole human, who knows their body better than anyone else (even if they're confused). Listen to them, and follow their lead. Support. That is the word to center on. Support, above all else.", "YTA to the maximum degree. You not only made a party saying there definitively were only two genders, you outed them to everyone, forced everything upon them without even pausing for a MOMENT to think how it would affect them. You could barely have done a worse thing for them besides kicking them out or physically hurting them. Your child will never forget this, look forward to then going no contact when they move out.", "YTA. I sure hope this post is fake.", "YTA that’s something your 12NB decides to do or not - that’s not a you decision. And yeah, you’re an AH for assuming. \n \nThey are NB, binary parties for a non-binary is just incredibly inappropriate. \n\nAnd do they appreciate you still calling them “son”", "YTA.\n\nFine with the idea of making the party friendly to both boys and girls, but it was really shitty that you decided that different people had to stay separate. **SEGREGATED**. You also underlined a huge problem for your kid's future: they do not fit either side.\n\n...and you had to out your kid, rather than give them their time.\n\nBesides, was the girls' party really nothing but getting made up? Were you born in 1946?", "I dont agree that you should delete this. This should stay up here as a reminder to anyone else who has such a genius idea.\n\nThat was the dumbest thing you could have possibly done. Shame on you.\n\nOh. Yeah. Yta. Duh.", "YTA\n\nThe most important \"rule\" when it comes to anyone that is LGBT+ is to never, never, ever out them or tell someone else without their permission. I knew my son was trans for months before his father. We knew for longer before our families were told. You ask permission. \n\nAlso, the idea of the party is really weird. I'm sure you were coming from a good place, though really misguided. Also, ask your child if they still want to be referred to as your son. As NB, they might prefer just child. \n\nPlease keep supporting your child but always check with them.", "**YTA** \\- or profoundly deficient in emotional intelligence.", "YTA. \n\nGender segregation at a gender themed party?! To celebrate NB identity?! I don't think you could do anything that was more alienating for someone that is non-binary (*edit:while accepting their identity), to be perfectly honest. \n\nThen outing them is just the cherry on top. \n\nI think you actually meant well which just makes how clueless you are kinda sad tbh. I think you need to do some research to grow some sensitivity in this area.", "[removed]", "YTA\n\nThat is a terrible idea for a party. Do you genuinely think only boys will want to play video games and only girls will want to play with makeup? Or that all the boys will want to play video games and all the girls will want makeovers? Are you still living in the 1950s?\n\nDo you really think it's a genius idea to segregate parties based on sex? I mean, how dare kids want to hang out with all their friends at the same time, amirite? Is your house Iran or Afghanistan where people aren't allowed to socialize with the opposite sex? \n\nWere you going to set up guards to make sure no girls played with the video games and no boys got into the eyeshadow? \n\nAnd then expecting your kid to float between the two, like a negotiator between armed camps? I am astounded at your ability to walk and talk at the same time.\n\nI refuse to believe this level of tomfoolery and ignorance is real.", "YTA and as an older lesbian, I’m **sincerely** concerned for the rest of their educational experience until they can go to college, because there is no way their peers are going to forget this. They’ll be teased being nonbinary until they graduate, about that party, and about crying due to the sheer humiliation. \n\nI hope the other children are understanding and they have some good friends who stick up for them. If not, and *please* listen to me because I mean this, keep an eye on your child. This could be an incredibly triggering event that could cause them to spiral and self-harm. This isn’t just about a party—their trust in you is going to be broken and you’re going to have to work hard to even *attempt* to repair it.", "# YTA\n\nCongratulations on one of the worst parenting disastes I've read on here. Well intended to be supportive! But by gods, that's awful and terrible in every way. \n\nI feel so bad for them, and you're going to have to bend over backwards to remedy this. Not that you can. But you have to try.", "I love the enthusiasm for supporting your child but you need to let them take the lead. Talk to them, ask them what they want and how they feel. Your child is young and still learning about themselves and they need room to be able to do that.", "YTA for misgendering them throughout this post. They’re not your “son”, they’re your child. Or if they’re gender fluid as you claim, sometimes they’re your daughter. Either way, you chose a theme that misinterprets their identity as “this or that”, threw a party they had no say in, and outted them to all their friends.", "you should delete this. \n\nshame on you dummies.", "I hope other commenters are able to tell you what you need to hear. I don’t have the words. YTA", "It’s not “our son”\n\nIt’s “our child”\n\nYTA. You have some serious work to do on your views of what NB means and also knowing your child at ALL it seems. Yikes.", "YTA, obviously. Not sure if anyone said this yet, but you specifically highlighted your child's difference from all of their friends, and made it seem like they don't fit in with anyone, instead of celebrating them and all of their friends *as people*. I don't know why you would possibly think splitting people up into binary groups would be a good idea", "Yikes, YTA. What is this?", "YTA- you should have talked to him about it first.", "“Wow look how fun and woke i am for throwing my non-binary kid 2 parties so they could flow between both genders!”\n\nDid you even ask if this is what your child wanted? Or was this your “i’m such a cool parent look how accepting i am” moment? YTA\n\nyou have to apologize and sit down with your child and fix this. You need to go into this future discussion with an open mind and BE PREPARED for your child to be upset with you, because i can tell you now, they are. You messed up.", "Your son is non binary, he's 12...", "YTA. Politely, what the fuck?", "I think that you meant well but you really need some resources for parents of LGBTQIA+ parents. This sounds like it was extremely traumatic and your lack of knowledge will likely cause a repeat of something similar.", "No no no. Take ever name you get called on the chin like how you expected them to take it. F you. F your husband. You stupidy stupid dummy dumb dumbs. You had no right to do that. You have some serious serious apologizing, groveling, begging and making it right to do. Once again F the two of you. Suck a camels furry c**k", "oh you screwed up **BIG TIME,** But your intentions were pure and you went through a lot of trouble for your child\\* (Kept calling them your son) to have a wonderful party. I wish they could have bucked up and enjoyed it because it sounds like it would have been a blast. Unfortunately, YTA here.", "YTA. \n\nYou outed your CHILD tova bunch of people. It the LEAST affirming way possible. You made a party based on enforcing gender binary and gender stereotypes.\n\nYour child has just been shown very clearly that you will probably never be supportive of them being NB", "YTA - why would you think a good way to celebrate your child and their NB status would be by separating the boys and the girls? Do you think that non-binary people don’t hang out with men and women at the same time? This was such a tone deaf decision by you. Next time don’t assume what your child wants. We all know what happens when you assume and it just made one out of you", "YTA Your kid would have been happier just celebrating with their friends. Plus, it wasn't your job to put them to everyone.", "Okay, YTA for not asking your son about if they were okay with the idea, which would've prevented all of this, but also because that's just a flat-out really bad idea for a party, even if your son WAS on board with it. Just... real dumb virtue signaling gone horribly wrong on this one.", "Yta and massive one at that .", "YTA\n\nI think the heart was in the right place but the brain was not.", "[removed]", "YTA\n\nNot only did you out your child, you misgender then in this post, and your party idea was just trotting out gender stereotypes. Amazing cascade of ytaness.", "Why did you assume everyone knew?", "YTA. In your effort to show what woke and supportive parents you are, you trampled all over your son. How did you not know they wasn't out to their friends?! Why didn't you check before making these plans?! You outed them. You ruined their birthday. You traumatized them. You caused tension and possible conflict with their peers.\n\nBtw, the party theme was offensive. They shouldn't have to move to another room to express a facet of their identity. They should be able to be either or both in any place at any time.\n\nYou need to educate yourself on how to navigate this.", "Oh my god. This is horrific. You have seemingly positive intentions, but this is something your child is going to remember as a formative trauma. You need to deal with that truth. This party harmed your child. And all you had to do was consider their feelings enough to ask them about it. YTA.", "Satire right?", "YTA - try talking to your kid before sharing personal news", "You may have had good pro LGBTQ+ feelings but you didn't have enough information to fo something like this,   your child is going to need you yo communicate better, listen more and learn more about non binary and what it means to them.  You were lucky enough that they opened up to you early in thier journey and you blew it big style, but with good intentions,  you seriously broke thier trust and that will take time to heal,  get your child into therapy to help them process.  Be supportive and listen. YTA", "YTA. I know you meant well, but this was totally inappropriate (and tacky).", "The first rule of decorum regarding LGBTQ people in your life is don't out them, which generally means assuming they aren't out to people until proven otherwise. Also, the themed parties with the stereotypical gendered interests was a bit cringeworthy, as a woman with minimal interest in makeup and love of video games. Soft YTA, because it seems like you were coming from a loving place.", "So... you outed your child to their friends without their permission. Not only that, your way of showing your acceptance of their fluidity was to... have a party ENTIRELY based around stupid gender stereotypes and divisions. YTA. So, so obviously the a-hole.", "You lost me at surprise party. YTA.", "Parent's hearts were totally in the right place, but holy fuck did they fuck up lmao", "this was a brutal read, holy hell. and the fact that it clearly came from a well meaning place makes it even worse somehow.", "I’m not trying to pile on here, but where exactly did you get this “genius” idea from? I mean, in what world would this be a good idea? You’ve got some apologizing to do, and i don’t mean just an “I’m sorry” then expecting them to get over it. I mean a ton of research to show them that you understand just why and how you screwed up. I get that it wasn’t your *intention* to screw up this badly, but in the process of trying to show support you badly betrayed their trust. And simultaneously demonstrated that you have no clue what it means to be non-binary. And they need to know that you completely understand what you did and why it was wrong and that nothing like that will ever happen again.\n\nYTA", "YTA\n\nyou should have ASKED your kid what they wanted.\n\nAs a NB person, I would have been MORTIFIED. Your kid was probably trying to figure out who they wanted to tell and you outed them to everyone. \n\nWithout knowing who they can actually trust, you have probably put them at risk for being bullied b/c the wrong people may gossip.\n\nDo more research, TALK to your kid, and find a proper way to apologize.", "[removed]", "YTA. Theres so much to unpack here. First of all, you should never out someone to other people. It’s not your job. Second of all, the whole point of NB is not about boy/girl. So having 2 themed parties highlighting boys and girls was just completely stupid and obnoxious", "Yta. Your heart seems to be in the right place, but yeah, this is not the way to support a nonbinary person, especially one that isn't comfortable talking about it with extended family/friends. You owe your kid a big apology and a conversation so you can better understand them.", "This is so horrible. Oh sweet jesus.", "What even is this? Your child tells you they're non binary and they're newly out and very much working things out.\n\n\nYou decide boy and girl stereotypes, invite all of the friends to announce it and expect them to switch between interests in the time it takes to climb the stairs?!\n\nHoly YTA. \n\nThis was said in confidence, it is a definite confusing time and for SOME kids, they're asking to talk it through by saying they're part of the community. One, you don't just take your child saying non binary and take it as gospel. Two, you don't announce it. Three, its your responsibility to support them to understand who they are. At 12, they know some but not everything. You should be talking it through, letting them know it's potentially a fluid process and offering ongoing support.\n\nThis cries attention for you at the expense of your child. Don't ever surprise party someone that age, let alone one who is dealing with identity issues. And then to do something so extreme and outing them before they're ready... SMH", "100% this, this was the stupidest way to go about supporting their kid", "That caught me, too—were the girls the only ones allowed in the makeup area and the boys the only ones allowed in the video game area?", "As a non binary person yourself, why might you be saying him rather than them?      \nShouldn't you know better?", "Don't forget that they keep calling them their son and not child to respect the child's identification", "Lol a stereotype party for someone who doesnt conform to gender stereotypes. At first I was furious for the child, but now I'm kinda laughing. Soooooo stupid.", "My daughter's 11.  \n\n\nShe knows about NB, Trans, Bi, lesbian, Gay, Demi, Asexual, Agender, Aromantic.  \n\n\nShe learned all of it in school/from her class mates.  \n\n\nTimes are changing.", ">I honestly don’t believe this story mostly because I never heard of a 12 year old even knowing what that is) but here's my explaination just in case.\n\nYou must live with your head inside the sand.\n\nI've met boys and girls that by school age already knew they didn't like their birth gender's stereotypes. Some grew up gay, some drag queens, and some actual transexuals.", "its 2023. Regardless of age these days, you'd be surprised as to how many kids are becoming more aware of different identities and sexualities. They're 12, yes...but they're also comfortable with who they are and to you, it may seem young but there's no age limit or specific age when you should know how you identify. \n\n>If your child is NB, why do you keep calling then your \"son\n\nOP has stated that they're okay with being called son as well. NB is non conforming, if they want to be called son still, that's their choice. Not all NB have they/them pronouns. Some NB people still give the go ahead to be called gender conforming pronouns because of their own preference.", "12 y/o's def come out all the time. They def know what non/binary is as well. 12 is usually 6th or 7th grade. My oldest was 12 in 8th grade cause she was in the accelerated program at school that has them skip a grade if they test out of 6th grade during spring of 5th grade. With social media, YouTube, and even celebrities coming out as such, they definitely know in middle school. They have their own phones, prob felt different and have been googling and talking to others to figure out why for months at least before gathering the courage to talk to their parents. My oldest is only 15 so her middle school experience wasn't so long ago but that was literally when most of those she knew started coming out, just as it was when most experienced their first school dance, first awkward date with parents there, or holding hands, kiss, or bf/gf even if it was like a week long and they never hung out outside of school.", "My kid had a friend who come out as trans at my kid’s 9th birthday party. \n\nAnd currently (age 12) has a non-binary friend who keeps switching pronouns as they explore their identity.", "I mean for Christ sake, OP's child is at the age where their classmates are having boy/girl parties and all just hanging out with each other. Every part of this was so unnecessary and cringe.", "I wondered this too! OP’s party had major “pick a side” energy.", ">Firstly, call them your child not your son.\n\nWhy? How do you know whether the kid is okay with being called son or not?", "To be fair it’s only been a month and they knew their child for 12 years as a boy. People need time to grow and adjust. At least they are trying.", "It was quite literally a back handed response. I'm sure the intentions were good, however misled. This was an egregious display of incompetence imho. How's the saying go \"Never attribute to malice what can adequately  be explained by incompetence\"", "Because no one with good intentions would come up with this idea. People with good intentions would do halfway good things, like running the party ideas before their 12 year old child before the party. People with any kind of social awareness would not use such sexist tropes - girls like makeup, boys like video games - for their child's party. Were the parents born in 1950?  I feel sad for their child. They have a rough adolescence ahead of them with such clueless parents.\n\nBy the way, OP: YTA.", "They literally outed their child in the most humiliating way possible. Maybe to them it was a little 'oopsie' but their ignorance will follow and traumatize their child for years to come. \n\nIt doesn't matter how they move forward because they literally can't ever fix this. It's not just a little mistake, they fucked up massively.", "We'll always support our son. I just hope they'll forgive us.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Okay relax a bit! Obviously OP said they’re new to navigating this, yes I get the whole separating gender thing is wrong but at least they’re trying to an extent. I am not saying they haven’t failed the mission here but at least they supports their child’s decision unlike some parents who do not acknowledge this.", "Plenty of non-binary people still use certain gendered terms. I don't think you should correct people on behalf of people when you don't know them or their preferences. My husband is nonbinary, and I feel like I have to caveat that I know what his pronouns and preferred terms are because people online who have never met him will be like \"He's not your husband then\". It's so presumptuous. You could have just asked \"Have you spoken to them about the term son?\"", "They are fine with us calling them \"son\". This whole NB thing is also new to us, we just wanted to do something special for them.", "I don’t like your attitude here. The parents are trying their best to be accommodating; it’s difficult to understand NB and everything this entails. You have no right abusing them for making a mistake. This is how people learn. We make mistakes, we learn from them. Comments like yours are NOT helpful.", "Him?", "They are non binary and 12 years old, that is correct.", "Seriously! If you ever out your child, you're automatically the asshole in any situation", "Op said their kid was ok with being called son", "I kinda don’t get the idea. Like… “oh my kid is non binary let’s have a gender binary party!”", "Also a very sexest view of what boys/girls want to do.  I would have wanted to be doing what the boys were doing and so would a lot of other girls I know.", "I only read the title and sighed", "I'm not convinced, OP seems like the type who is thrilled that their child is \"One of those NBs I keep hearing about on facebook\" and wanted to cash in without having any idea about anything.", "My grandfather was born in 1909 and was fully supportive of me being trans. Age is no excuse!", "It just kept getting worse! YTA OP, and shockingly tone-deaf", "Op said that their child was ok with being called son", "[removed]", "[removed]", "[removed]", "[removed]", "Cringe Take Heres Your L", "Right, it comes off more like helping them choose or changing their mind to gaslight them at worst, and just insanely clueless at best.", "And research. If OP found Reddit they can certainly find a lot of info on what non-binary actually means, what people and especially kids experience (so as to get ahead of what their kid might have to face) and how to best support them.", "Okay, but the parents are obviously trying to be supportive and are trying to use the correct language.  Perhaps their child stated they still want to be referred to as their son for right now, or the parents are new to all this and got some things wrong.  They've been referring to their child as their son for 12 years, maybe they deserve a little grace on this one as they and their child sort out the appropriate language.", "Yes I get it", "I definitely knew about gay, lesbian, bi, and trans by age 12 but that's because I went hard-core into gay fanfiction at that age", "I didn’t see the comment OP madeo", "I get it, I messed up and made a mistake.", "I can see this being something that older parents would think was a good idea and being supportive. My parents were in their forties when I was born (which was very old to be parents at the time, especially considering I was their first child) and my dad once said to me that he was pleased I didn’t do anything particularly ‘different’ because he’d have wanted to support me but wouldn’t have had a clue how to do it; for example, homosexuality was illegal in my country whilst my parents were growing up, if I’d been homosexual it would have been completely foreign to them. I don’t think they entirely understand that I’m asexual but given that means very little for them to do apart from accept they won’t be grandparents, which was likely anyway because I just don’t like children and always said I didn’t want to have any, it causes very few problems.", "I recommend you stop calling your NB child your \"son\" because it's a gendered term...a suggested option is just \"my child\"", "Sit down with them when they’re ready to talk and give them a heartfelt apology and explain where you now realize you went wrong. Maybe do some research on non-binary identity, there are definitely resources for parents out there, and it may give you a good standing on how to handle the situation. Showing you know you messed up and are trying will mean a lot.", "Stop calling them son to begin with", "Op literally fucked this up in the worst way possible. Them \"trying\" doesn't mean shit when they have done something that could put their child in danger by outing them", "u/dj_too_supreme", "The kind interpretation is that the kid is ok with masculine pronouns hence mom calling them her son.\n\nThe likely scenario is that the mom is as clueless about pronouns as she is about outing.\n\nBut in fairness to the commenters, mom uses 'son' a lot.", "I stand corrected- she should have talked to them first.", "No.", "Atleast their username checks out 🤷‍♀️ lol", "\"And when they open the door, everyone will burst into a choreographed musical bit about how they don't belong.\"\n\nI assume this was planned at some point and discarded simply because of logistics.", "Anybody else feel like a dog pulling on their collar bc they don't want to walk anymore while reading this? Like no no no bad idea terrible execution some research on what it means to be non-binary is in order. I'm non-binary and this is the nightmare scenario. And at 12? Oof a doodle", "That's not in the OP.", "[removed]", "The child is okay with being called son and I didn't read that part but for the grace part of your comment, if this were a verbal conversation and a slip up happened that would be one thing but you can't have a slip of the tongue in text so this would have been on purpose.but in the end it doesn't matter for this spacific story.", "They said they did not know he wasn’t out, doesn’t make it not wrong but they thought his friends knew. People make mistakes", "I saw the comment and made an edit", "Nonbinary people can be okay with being called by traditionally-gendered words & still prefer non-gendered pronouns, or the opposite, or any combination of terms. Maybe OP’s kid is okay with “son” but uses they/them pronouns. It’s all chill, as long as they’re being given the choice & their preferences are being respected. Now, that commenter calling OP’s son “him” when OP never used a masculine pronoun… that one is sus to me, lol.", "No what?", "Op made a reply check the comments from ops profile about the post", "[removed]", "They could've asked him like any sane person would", "I get the feeling from the post that OP isn't very good at the 'respecting' thing... At least when it came to their kid's right to choose when and how they chose to handle coming out.", "[removed]", "Yes, I understand that. But when I made my comment, that reply hadn't been made.", "[removed]", "Yeah, I get that, but in one of their comments OP said the kid is okay with “son,” so I’m tentatively giving them the benefit of the doubt. What they did sucked butts, which it seems like they understand now. I just hope their poor kid doesn’t end up too mortified from this & they can all move on as a family. It seems like OP is trying…which is more than I can really say for my own family, lmao", "I'm sorry you were an unintelligent child, but it's not a universal condition.", "Lots of kids that age know what non binary is.", "It is...", "No they don't.", "YTA for reasons already outlined by so many others.\n\nOP, if your non-binary child was having a feeling more like a girl than boy kinda day, did you expect them to stay on the girls floor and ignore their male guests? Or join in on the boys floor even if on this particular day it would feel uncomfortable? How did you imagine your child would navigate this party? Did you ever think it through, or do research of any kind?\n\nMany people have said you are coming from a kind place. I don’t know if you are. I am glad you accepted your child, but part of acceptance is informing yourself on their identity and what they need. The whole party concept sounds like you took the chance for an extreme version of baby gender reveal parties, but never spoke to your kid, or even looked into other trans peoples experiences with coming out and coming out parties. I get the feeling this party was more for you than it ever was your child.", "Ugh. The boy/girl parties is so gross no matter your kid’s gender. YTA.", "Hey u/aitanb I know everyone is jumping down your throat…\n\nI’m FTM and while I won’t deny you screwed up BIG time on multiple levels… a lot… I do wanna say that I appreciate your hearts being in the right place. Those of us who had ***real*** assholes for parents would trade anything for parents with that kind of mentality. \n\nYour kid is 12 now so there’s also an added layer of “omg my parents are dumb and everything they do is dumb” in there, but as long as you keep your hearts in the right place and seek more outside input in the future (including your child’s), this will end up being a blip rather than the traumatic disaster for which you should feel like massive failures that so many keyboard warriors in these comments say it is.", "YTA. I'm really questioning if you truly wanted to make them happy.\n\nSounds more like you were trying to advertise what \"great, accepting\" parents you are rather than caring about what your child - a completely separate human being from you and your husband - wants and needs.", "YTA. Oh my heart just broke for that child. This will be a defining moment for them in so many ways; unfortunately for you, it’ll be the go-to example they use when playing “whose family is the worst?”", "YTA- subject matter, you were blind to think the way you handled the details of the party should've been a surprise. This isn't a generic topic by any means. It's a sensitive matter especially for 12 year old.", "I actually think you meant well here, so I’ll give you points for that. With brand new info like this, I really think it would have been best to ask your child what they would really like to have for their party. You also clearly needed to have more conversations with your child about their comfort zone. Y T A for not having the conversation, which ultimately embarrassed them, but great job on being open to *wanting* to do the right thing. Please keep communication open and keep being open to allowing inclusive experiences.", "What is even the theme party? I'm speechless. YTA. Big time.", "Holy shit, this screams terrible idea.\n\nOh man.\n\nNeither of you took a breath and thought about whether this was a good plan or not? It didn't occur to either of you to ask your son whether he wanted this?\n\n&#x200B;\n\n>we just wanted to make them happy\n\nI dont...geez. Maybe from now on you ask your child what would make them happy? You clearly aren't very good at it.", "ETA: edited for YTA, also to say that the whole point of non-binary is to be OUTSIDE OF MALE/FEMALE binary. This is why parents need to follow actual trans/NB people and do research before doing shit like this.\n\nYour CHILD, not son, CHILD, is the one who gets to decide who they come out to and when. You should’ve consulted your CHILD first. You should’ve made sure this was okay with them first. Now you may have just alienated them from all of their friends. I understand y’all were trying to be supportive. But if you want to support, RESEARCH!!! Not announcing your kid’s gender identity to the world. As a non-binary person, I would’ve reacted the same way. You’ve got a lot of making up to do. You just completely destroyed any trust your child had in you.", "OK obviously YTA, but I'm going to say something that apparently everyone here is too busy shitting on you to say. You tried, and I see that, and I applaud you for trying. From your comments and edits, I can tell you meant no harm, but the execution of the thought was just awful. However, just like the path to hell, the path to improvement starts with good intentions. I hope you took this incident to heart and try your best to a) make sure your child understands that you guys know you fucked up, and you didn't mean to, and b) that you WILL do better going forward.\n\nBut seriously, shame on everyone here that excessively trashes you as if they've never made a terrible mistake despite their heart being in the right place. Overly condemning people for mistakes like this without being constructive is EXACTLY how you alienate allies that ate still trying to learn how to navigate things. OP, I hope you were not too discouraged by this toxic comment thread, and still actively try to educate yourself and figure out how to best navigate this world, which I can only imagine is very unfamiliar and maybe scary to you.", "YTA. It is great you want to support your son, and NTA for that.  But you should have discussed this with him first.  The world is full of people that do the wrong thing for the right reason.", "YTA, but your heart was in the right place.", "Aww, I feel for these parents! They are trying to be supportive. They messed up and learned their lesson, but wow the comments are pretty harsh", "YTA. I don’t even know where to start. Apart from the entire concept being an obvious disaster, you really couldn’t have come up with more stereotypical themes for the girls and boys huh? How about hunting for the boys and sewing for the girls next time?", "My third born is gender binary and married to a trans man. It is a tough thing to navigate for any parent. I have always been very accepting of my children in any choices they make as long as they are safe and happy. That being said I always give them the lead. I am very clear with my questions and they are very open to answering them. I suspect your child is new to all of this and is probably confused about navigating the ins and outs of how they feel about themselves. Don't beat yourselves up too bad. You are trying to paint a rainbow on their world and let them know how much you love them. Later when they are older they will definitely laugh about this. In the meantime just be patient and listen and tell them that you're there and that you're sorry.", "To take a side issue, it's a little inaccurate? retro? stereotyping? what's the word? -- to put the girls upstairs with makeup artists and the boys downstairs with video games. So girls like pink-pink and lipstick and boys like interesting video games. Segregating the kids was kind of weird to begin with and then stereotyping them in terms of their supposed boy-girl ideas of fun -- honestly, it's not 1955.", "Very much YTA.\n\n1. Your child did not express a desire to publicly celebrate their gender identity on their birthday. Maybe they just wanted to enjoy their birthday and that's it.\n2. You outed your child. If they just recently felt comfortable coming out to you, did you consider that they maybe haven't felt comfortable coming out to everyone they know yet? Coming out is a personal decision that should be done by your child in the way your child feels comfortable. Not by you.\n3. You chose to split up your child's friends based on gender? What??? A boy party and a girl party? You thought that was a good idea? And you paired the two separate parties with gender stereotypes? Can we please not act like boys like video games and girls like being pretty and just let people like whatever they want? I think the fact that your child does not fit into a binary gender role should make it clear that this is not a good idea. Do you think that when your child identifies as female vs male their interests totally change?\n4. I am not non-binary and I by no means can speak for non-binary people and I don't want to generalize a diverse group of people to one definition. But a genderfluid friend I had a few years back definitely was not changing their gender identity back and forth multiple times within the span of a single party. It wasn't an instant, brief change in identity, they would identify with one gender for a while at a time.\n5. I have to agree with your child that your party idea was just bad, even without you outing them. It definitely sounds like the kind of thing that would embarrass a preteen child.\n\nI want to add that you seem to be trying to support your child, and that's great. Please keep doing that. But also know that they're still figuring themselves out. Your child may have fully figured out their identity already, or they may get to know themselves a little better as they age and determine that they have a different gender identity. Your support is really important, and making sure you don't judge your child. I want to be clear that I am not suggesting that this is \"just a phase\" or anything like that. This is your child's path to figuring themselves out, whether it is the end or a stop along the way. It takes plenty of people well into their teenage years or even adulthood to properly understand their sexuality and their gender, and your child may come to realize that another identity (maybe a term they didn't know yet or didn't fully understand) describes them better. \n\nWhen I was a little older than your child, quite a few of my friends were still processing their gender and/or sexuality. I've had friends come out as nonbinary and they had things all figured out young, because they just knew. Others realized later on they were transgender, or that they didn't identify with either gender (no gender rather than both genders), or that they were cisgender but either their sexuality or their level of traditional masculinity or femininity didn't match up with what they thought society expected a man or a woman to be. \n\nMy point is, whatever your child is feeling and however they are currently identifying is valid, but it's OK if they don't have it all figured out at 12. If they tell you in a few years or even a few weeks that they realized they identify differently, continue supporting them. Let them take the lead on how they want that support to look and how public they want it to be.", "YTA. Non binary can include feeling like neither, you basically gave your child a party that would make them 100% excluded from their own event. This was a traumatic experience for them.\n\nI can tell you love your child and want to be supportive but you and your husband have a lot of learning (and a lot of making up) to do. \n\nI just hope they’ll be okay…", "YTA, Wow, instead of asking maybe a non binary person for advice on what to do, you come up with this crazy idea. This is next level dumb.", "YtA. Unbelievable that you thought this was acceptable", "YTA but gently. I think you were coming from a good place and trying to be supportive but didn't do the research on what NB means.  You also should have clarified with your kid if they were out to the world yet.  You should have a heart to heart with your kid and genuinely apologize and communicate that you love and support them and want to do anything in your power to make them feel your support and love in a safe environment.", "YTA. Is this real? Worst parenting ever. Did you throw a party for a straight kid celebrating that they were straight? No. So why would this be a good idea?", "YTA and terrible parent.", "I am gonna go against the grain here. NTA\n\nYou had all the right intentions of trying to be supportive. But you need a hellofa lot more research under your belt. \n\nCorrect terms for them, correct understanding of nonbinary, etc. \n\nBut I think above all else just the assumption that they came out to you last was..... dumb. \n\nBut yeah I'd say NAH just very misguided.", "This is one of those times you should have come to reddit first. Ask for advice on experiences, would have stopped this. You live and you learn but now you have major damage control to do", "This is just dumb as dirt.", "YTA \n\nI mean you tried and tried hard but it is like if your sad because someone died and your dog brings you his toy...\n\nLike you tried but it was so out of touch I can't even fathom ot", "You messed up but you did it out of love for your child. Parenting is hard, but one day they will realize how much you love them.", "You were trying to be supportive i get it but you did it in a bad way you outed them to friends and family before they were ready and then made it weird by seperating genders they feel like both so seperating it was weird having a gender neutral party would've been a better idea", "I think you get that YTA by this point. However, I do want to give some advice as a nonbinary person. You do seem to be generally trying to accept and support your child. I applaud you for your acceptance, a lot of parents do a lot worse. \n\nThe nonbinary experience varies from person to person. Your description of nonbinary “sometimes feel more like a boy and sometimes feel more like a girl” is not necessarily incorrect but still defines your child’s identity by the gender binary. I’d define nonbinary as not fitting within either binary gender. I’d say that your description better fits genderfluid. Though your child’s personal identity and how they describe themselves is ultimately up to them. \n\nOverall,  I’d recommend trying to stop describing your child by relating their identity to being like or feeling like a “girl” or a “boy”. For example, you may want to describe them acting or feeling like a “boy” at a certain point in time because they are playing video games. There is nothing inherently masculine about video games. That association is based on our binary societal norms. These norms are hard to unlearn but I think doing so will help you understand your child better. \n\nYour definition of nonbinary, being part girl and part boy, shows through in how you hosted this party. You centered this party around gender stereotypes and the binary gender dichotomy. Try to stop centering their identity, and your worldview in general, within the binary gender norms, because they identify outside of it. I know this can be hard to wrap your head around. \n\nI also want to address that you outed them to their friends. They are 12 years old. That is old enough to be involved in planning their party. If you had involved them in the planning, this whole thing could have been avoided. I know they are not talking to you right now but I would stress working on your communication about this topic in the future. The fact that you did not know that they were not out to any of their friends but presumed to know what kind of party they would want and who they would want to invite is alarming. \n\nComing out is incredibly scary. Being nonbinary is incredibly scary, especially if you are in America right now. If you want to help your child be happy and safe you need to protect them. Who they want to come out to is their decision. It’s a deeply personal decision but it’s also a safety concern. Coming out to the wrong person can get them killed. Again they are 12, which means they are old enough to know who they are and make some decisions for themselves. It also means they are still a kid, your job is to guide them. Make sure they can be themselves, come out to people they care about, and keep themself safe. In this case, you violated their privacy and you don’t necessarily know if there was a reason that they did not want certain friends (or their parents) to know that they are nonbinary. \n\nOverall, I really hope you don’t get discouraged by this comment section. I do think you are trying to be a good parent to your child and accept/understand them. You messed up majorly in this instance. I hope you understand that and going forward you can make amends to your child and do better in the future. I send you and your family my love and hope.", "Hope you set aside some $$ for therapy, y’all have done a number on this poor kid. good god", "I don't  even  know  why  people  are  telling  you your  heart  is in the right  place, there is absolutely  nothing  showing that.\n\nYta.", "YTA. \n\nI'm happy your child is able to express their identity as non binary. \n\nHowever you and your husband are clearly a breeding ground for scaring someone away from their gender. Have you always pushed so many gender tropes at them? Being truly non binary is not a defect and should be accepted. However there are people in my life who have identified non binary then later identified as their bio gender because they realized their parents were pushing tropes on them. My cousin says she's happy to be a woman, she just thought growing up that being a woman had to mean she liked fashion and dolls, and she was a basketball star in our town and liked to race 4 wheelers, etc. So she identified as non binary for a year, thinking it was what she had to do. Her parents did the same stuff you seem to do. \n\nNot only did you ruin your child coming out in their own good time. You proceeded to force gender norms in a bunch of other children! Is this what you thought your child wanted? Is this truly what you thought all those kids would want? Are you SURE all those kids would want to be gender labeled when your own child is trying to tell you they do not? \n\nThis was such a giant fail. YTA", "YTA  Let your child lead the direction they want to take.", "Soft YTA. I get where you were coming from and just wanted to be supportive and encouraging. But wow did you not think that through at all", "First of all, *child* (Not son. You have a enby child).\n\nSecond, that was a terrible idea even if they wanted to come out to everyone.  Children of all genders can have friends of all genders.  Enby means there is no gender binary, and you just created one at the party by segregating \"girls\" and \"boys\"\n\nYuck.  YTA.  Apologize profusely and do MUCH MUCH MUCH better.", "JFC, you outed your kid!  You NEVER, EVER do something like that unless you’re ABSOLUTELY, UNDENIABLY, POSITIVELY SURE they’re out publicly.  Of course they don’t want to talk to you!  You’re no longer safe.\n\nYTA", "YTA you should have asked first, i’m also non binary and many of my friends don’t know. If they wanted to a coming out party they would have told you", "How did you type that story with only two brain cells? YTA", "YTA. But I’m not going to as harsh as a lot of other people. A lot of this stuff in new to people, especially for people over the age of 30. There are going to be a lot of growing pains over the next few years trying to establish which things are okay and which ones aren’t. Honestly, at least your trying and although you definitely missed the mark your intent was pure and one of acceptance. Life is about learning, next time someone you know has a trans kid you can inform them of what mistakes you made and how not to repeat them. Everyone acts like everything is so obvious, it’s not, people have no clue what things people have and haven’t been exposed to so cut people some slack every once in a while.", "I mean, if my kid said they were non binary at age 12 I'd do my best to let this change as little as possible. If they still say this about themselves at age 18, fine, but no way do I just accept that a 12 yr old knows what tf they are yet", "Son is reserved for children who identify as male. They are your child now, not your son.\n\nAlso, depending on where you live, outing your child can have dangerous consequences.\n\nDid either of you ever even stop to TALK to your kid about they wanted? Like even once?\n\nYTA", "Are you Tucker Carlson?", "My jaw actually dropped... YTA. You should have at the very least asked them first, for god's sake. Outing someone without their explicit consent is never okay because the fact of the matter is, you don't know who they're already out to - especially in the case of a trans child! It can be anywhere from embarrassing to dangerous for other kids and faculty at school to find out a kid is trans/nonbinary.\n\nThere is also the matter of the party theme itself, which shows that you fundamentally do not understand what it means to be nonbinary. This is normal, because we are not raised to consider any experiences outside of the binary, but it is something you now need to learn for your child.\n\nPlease allow me, a nonbinary adult, to shed a little light on the situation for you.\n\nI'll be the first to say that there is limitless beauty, joy, creativity, courage, culture, community, healing, love, and life in being nonbinary. However, there are also very real challenges and oppression we face.\n\nBeing nonbinary can be a very lonely, alienating, or even dangerous experience because so many aspects of social life are unnecessarily yet inescapably gendered. Every nonbinary person has to struggle with this to some extent. The struggle of which bathroom is safest to enter, which dress code applies to you, what designation is on your government documents, how do you engage with people of different genders, what gender do people assign to you just by looking at you... how will people react when they realize that not only have you stepped outside of the role you were assigned at birth, but that you have rejected gender roles entirely? What gender do you say you are when you're trying to get medical treatment or a job, or you get pulled over by a cop? What box do you, someone who cannot fit into any, jump into when it's a matter of safety? Either way there will be consequences for your gender transgression, but which consequences can you endure?\n\nThe alienation of not fitting into that binary can be a *nightmare.* Any of those situations I just listed can easily escalate into a life-changing or life-ending disaster. Even if it doesn't escalate to that extent, transphobia is pervasive and can haunt every aspect of your life in ways you might not even expect. It wears you down and makes it hard to trust anyone. When you are trans/nonbinary, *every single time* a new person realizes you're trans is a new window of opportunity for harm. (And once opened, those windows can never be closed.)\n\nA whole lot of windows just opened up for your child when you outed them at that party.\n\n*That's* why it is so important to let someone come out at their own pace. Especially a child. It isn't just a matter of etiquette. It's a matter of safety, and a matter of letting someone adjust to *a new reality of their life* in ways/at a pace they can mentally handle.\n\nWith all that being said, can you begin to see why a gender-separated party that emphasizes stereotypical gender roles was *never* a good idea to begin with?\n\nSo you do owe your child an apology. But also, you and your husband should start educating yourselves on what it means to be nonbinary and how you can better support and protect them.", "Soft YTA. While the intentions were good, it may have been wiser to ask up front who they wanted to invite. Since they came out barely a month ago and they are still very young, they’re gonna need more time to adjust and come out on their own to people individually. Let them steer the ship in regards to who they tell what to and how.", "YIKES. This is a major eff up. You seem like you genuinely have the best intentions, but you need to educate yourself to prevent further (unintended) harm to your child. Queer Reddit pages have links to plenty of resources that help you better understand identity, pronouns, how to be a good parent/ally etc.", "YTA - I'm nonbinary (I'm transmasc but used to alternate back and forth around puberty) \n\nYou suck and that would make my dysphoria skyrocket to have to classify myself as eaither gender. Im not eaither gender! When they say sometimes they feel like one does not mean complete flip (typically) \n\nAlso this is not the subject to \"surprise about\" they could now be outcast or in danger that you did not know about. They were not ready to come out.  you how could you not be the AH here ?\n\nYou don't surprise someone on a win without doing research! You found this sub after? Why not before? This could easily have been an WIBTA question. Then at least there would be a chance for the internet to scream no at you. Or at least to have you ask 1 or 2 important questions. \n\n1. Are you out to evreone? \n\n2. Is it OK for me to tell people? (Don't ask this actually and assume no)", "YTA -do you realize how much pressure you’re putting on your child? He is only 12. He might change his mind about his identity (many people at this age do change their mind) and will be afraid to tell you because you’re making this such a big deal. You know what you should have done? Nothing. Just let them be.", "I read the title 6 times and had to go to the comments to realize NB does not stand for NewBorn son lol! Thought it was a sarcastic post about gender reveal parties. Now I’ll go back and look at the post..\n Edit/postread : yeah YTA in this situation. You seem to have very strict gender stereotypes in your household i think that’s even more uncomfortable for a “NB” person. Maybe next time just have a kids party and leave gender out of it. I’m sure you love your child very much no doubt about that just don’t over do it. If a kid comes out as anything treat them as normal as you always have", "I understand the amount of effort and attempted support put into this party, because basically planning two parties is definitely a lot of work, but holy crap. YTA. The idea of separating the kids into two groups and having your child come out to them by basically being forced to switch back and forth between them like a ping pong ball is absolutely mortifying to imagine. I can completely understand why your kid would be upset, this would go down as one of the most embarrassing experiences of my life if it had happened to me. Wow.", "Damn. So I’m not sure honestly. Your heart was in the right place. You were extremely accepting and happy and wanted to do a surprise but you didn’t realize they didn’t come out. I don’t want to say YTA but I will say the situation sucks. I’m glad they have parents that are as accepting and loving as you guys are but you really should have put in the thought of them coming out. I love the idea of the party. It’s unique and cute but you should have talked more with them on if they told anyone else. Your heart was in the right place. NTA but please do what you can to make things better and apologize profusely. I know you didn’t mean any harm but you may have really created a situation where they no longer feel safe to talk. Just explain what your intentions were and that you truly meant no harm.", "So you had a “girls floor” and a “boys floor” at a party for your nonbinary kid, and didn’t realize that this is telling them, in essence, that they aren’t “allowed” to have both video games and makeup? Really? \n\nAlso, bonus points for picking the most cartoonishly stereotypical activities for both groups. \n\nYTA.", "If only there were some non-gendered alternative to 'son' or 'daughter'.  Some term that describes your relationship without ascribing any gender at all.  /s  \nYTA.    \nYou're LUCKY that your CHILD (that's the one!) came out to you before they did to the rest of their friends.  And you blew it.", "Your son is 12. This whole thing is absurd and YTA.", "Let me throw my non-binary child a binary gendered party??? What on EARTH?!\n\nVerryyyy curious how OP is going to fix this. YTA BIG time.", "Wow. My jaw just hit the floor. YTA", "You definitely just scarred your child for the rest of their life. Good job.", "Lol don’t ask Reddit this ask people IRL", "Jesus christ no wonder your kid is nonbinary - it's the only way they can access a normal.human life that's not either 100% gaming bros or 100% makeup princesses.\n\nYTA, and let your kid just be who they are at their own pace.", "Nta, it seems like you did this from a place of love, and support your soon. You screwed up, but not with malice. You son/daughter can be made I would give them space and let them know you are sorry tho.", "So I'll come right out and say it, yes YTA. You really fucked up. The fact is that while I can see that you are trying it feels like you aren't really getting the core concept of being non-binary. \n\nIn the future, try talking to your child about how they would prefer to be referred to. Again, I can see that you're trying but sometimes the best thing you can do is nothing. Or, in the case of a birthday party or some activity, maybe just ask your kid what they would want. \n\nI don't blame them for not wanting to talk to you rn. Give them some space.", "YTA\n\n> ETA: OK I get it, we screwed up... No need to call us names, we just wanted to make them happy.\n\nDid you TRY TO ASK THEM what they'd want?\n\nI don't understand how you remotely ever thought this was a good idea.. please explain to me how you thought this was a good idea. I'm genuinely curious.", "Oh my goodness, what did I  just read?! Yta!", "Never having kids. Thanks for the warning.", "Yta, and are you sure they’re NB? Not gender fluid? Regardless, this was a big mess up and i hope you can salvage the relationship because this was a huge breach of trust.", "I highly suggest to you do some serious research and reading in order to educate yourself. Everything from misgendering, to outing your child, and even creating an entire party centered around gender stereotypes. I mean you could not have been more ignorant. You will have a lot of work to do in order for your child to trust you or feel comfortable sharing with you ever again.", "Wow! What?! What on earth were you thinking that this was a good idea? YTA and hopefully your child accepts your apology and you can heal the damage that was done.", "YTA. What the actual fuck\n\nFirst of, you misgendered your child by calling them your son throughout the post. Not a great start.\n\nNot only that, but you outed them in the most gendered way. No wonder they reacted that way. It should be up to them to decide who they come out to. I understand you wanted to be supportive. But that was definitely the wrong way to go about it", "Planning a themed party like that without the knowledge and consent of the child may have been well-intentioned, but even a more typical party needs a child that age needs to provide input, particularly when the stakes are so high. YTA, because even if you meant well it was poorly reasoned and caused unnecessary pain to the child.", "Holy smokes, this was insane. How did the planning make it this far without either of you realizing how BAD of an idea this was. If only a child wasn’t harmed in the process I’d die laughing.", "Yta. God I have so many thoughts on this as a NB person but I can sum them up as why tf are cishets so obsessed making everything about gender. \n\nSo your child trusted you enough to be incredibly vulnerable and come out to you as NB. Your reaction to this was that this is obviously our child’s whole personality now so we should plan an entire party segregated by gender and stereotypes when our child is neither a boy nor a girl? \n\nArguably even worse is that you outed your child to all their friends and family. I don’t think you understand the severity of this. At the most extreme, being outed can result in the outed person being murdered. Now I’m not sure what kind of place you live in, but it’s very possible you put your child in danger. \n\nYou need to sit down with your child and make it very clear that this was a mistake and that you are sorry. You also need to do some research by yourself about gender, NB and trans identity and how you can best support your child. Don’t rely on them to educate you and don’t rely on other trans folks to educate you. I know this probably came off as harsh but I do genuinely hope you’re able to repair your relationship", "conservatives are the only ones thinking nta, but tbh y'all are major ytas. I feel sorry for your kid.", "YTA - this is a whole lot of asshole move on your part.  Outing them, misgendering them, the party idea being so tasteless.  Your kid will likely never trust you and your judgement the same again. This stuff doesn’t get forgotten.", "This is such a sad, heartbreaking story for both the child and their parents that I sincerely hope it’s fiction. \n\nJust in case it isn’t: sorry parents, but this is a perfect example of when trying your best isn’t good enough. Even in the most liberal and accepting environment, there’s no way this is a good idea. You were both 12-years-old once. How could you have imagined that such a “surprise” would be anything but painful? It seems like you didn’t give your child a moment’s thought. You humiliated them for *a birthday party theme.* \n\nThere are no free passes for good intentions on this one. YTA.", "What's more accepting of NB people than to separate the genders? JK it's offensive", "YTA - but your heart is definitely in the right place. You definitely traumatized your child and they’ll probably never trust you again, but, you had a pretty decent party idea.\n\nYou guys went too big way too soon. Instead of having a segregated birthday party, you should have just had both masculine and feminine activities on the same floor and not made gender the theme of the party, cause that was an odd choice. Integration would have been a much better way to go. Plus, even if it did work out, it probably would have been really awkward for whichever floor your child wasn’t on.", "YTA I’ve never read so much utter tone deafness in my life. The fact YOU DIDNT EVEN CHECK TO SEE IF THEY WERE OUT. Honest to god. I don’t even know how you come back from such a shitty decision. Also, what in fuck is with the gendered birthday parties?!", "YTA", "idk bro just the idea to support a kid in his confusion about the gender is already a fail in your parenting skills", "YTA\n\nThis could be an episode of Black Mirror.", "Although a lot of these comments are harsh I can tell you both love your child. Keep doing that and I hope that you can all heal from this. \n\nBut yes the party was one the worst possible ideas considering the circumstance.", "YTA. Your kid is going to fund some psychologist's vacation home someday.", "Cruelty masquerading as ignorance. For shame! YTA", "I didn't even need to read anything except for the title! YTA. The biggest one out there!", "And how high were the two of you when you decided this?\n\nYTA, jfc poor kid. They're 12. They trusted you.\n\nEdit- your idea was also very stupid. Celebrate them being NB by segregating the party by gender binary, girls get makeup and boys get video games? Just... no.", "I also have a non binary kid and if I can offer some advise, let them lead. Anything I do that has their old gender or dead name I ask what they would like. For instance, I scrapbook and I’m a few years behind so I asked if they wanted me to use their chosen name or dead name in my scrapbook for the years when they weren’t out yet. \n\nDon’t make assumptions and let them tell you what they are comfortable with.", "YTA. Why did you need to have a gender focused party *at all?* Like… at all?! I have never heard a young kid say they want a ‘gender themed’ surprise party.", "[removed]", "You know your the AH. It’s his decision not yours", ">My son\n\nYou didn't even try\n\nYTA", "And on top of that it also assumed that none of the friends are non binary too - where were they supposed to go?", "The original idea was to have own son move between the floors, but we wouldn't have stopped anyone else from moving if they wanted to.", "I sincerely hope this post is fake...", "Ikr wtaf", "Yep. Thanks for labeling the \"norms\" between genders. Cause (as they easy go to) girls can't like video games.", "If they had mixed it up and just had stations that would fit lots of interests with no overt mention of their NB identity, that would be one thing and could have been an awesome party. The separation into strict gender norms made it terrible.", "Yes to all of this.  \n\n* Outing your child ✔️\n* Misgendering your child ✔️\n* Segregating the party based on gender ✔️ and stereotypes ✔️", "YTA - I think there were good intentions but you missed the mark big time", "OP used \"they\" and \"them\" in the post, not \"he.\" That's not misgendering.", "They mean gender fluid. Why is everyone being an arse about the exact terminology? The kid probably doesn't even know that they are using the term wrong, so why would the parents question it?", "They did it for social media cred. So they could post pictures online of how accepting and amazing they are, and oh by the way, look how cute the themes were.", "This right here. I mean, kid will NEVER forget this. Just, wow.", "This whole story has given me cold sweats. I cant imagine what this poor child is going through, absolutely heartbreaking.", "I highly suspect they got the idea from baby gender reveal parties.", "I want to add an onto this to say: non-binary is an umbrella not a single identity. If someone tells you they’re nonbinary they haven’t told you anymore than that they don’t identify with the gender spectrum. They could have no-gender, a gender that changes, genders that co-exist at the same time.", "That's such a wonderful idea, thank you so much!\n\nI asked this question in r/NonBinary and I'm waiting for a moderator approval.", "Additional point bc this actually made me so mad: Your idea of a supportive party for your non-binary child is to go hard on the idea of two genders with very strict roles with no overlap to the point of completely segregating floors. A giant two genders, absolutely no overlap or in-between party. You designed a party which only serves to emphasise strict gender binaries to support your nb child? Really? Big Hanlon's razor moment.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The CHILD is happy with being called a son on most days and is happy being called a daughter other times.\n\n\nI know that's not traditionally what the term non-binary means, but they are 12. Why are you so angry about a 12 year old getting the wrong technical term for what they are?", "Thank you so much!\n\nWe already told them we fucked up, but I think they need some more time. I don't want to push them too hard to forgive us. I hope we can do better going forward. I think our biggest mistake was not communicating with them on what they wanted, and I'm so ashamed of myself that it never even occurred to me.", "Being gay and being non-binary have no correlation", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Lmaoo it’s so comically bad. Like they don’t understand non-binary isn’t just 50% boy and 50% girl, it’s a whole identity on its own that may incorporate some feminine/masc aspects but.. isn’t either of those genders.", "So then why did you feel the need to have to separate them at all? Moreover, why did you not actually *discuss* this genius plan with the birthday kid and get their perspective on how this would likely go over and what they wanted to do/if they felt comfortable coming out to their friends in this manner (as a general, hypothetical coming out party if you wanted to maintain the \"surprise\" part of the birthday party)?\n\nETA: Also, this is *exactly* why you *never* assume how \"out\" someone is about their sexuality or gender identity. Coming out is often a process, not one big declaration, and even many people who are \"out\" have people they closet around, for many reasons.", "I’m confused, where do you live that girls can only have birthday parties with other girls and boys only with other boys?", "I'm hoping but you would need the imagination of Stephen King to make up something this horrific.", "Sadly, it is very unlikely to be fake.", "I would be on a the gaming floor myself- I identify female.", "I know its overused, but I don't think this is real. There's absolutely no way an adult with two brain cells thinks this is a \"genius idea\", much less went to reddit to post about it. This post is the product of someone's imagination.", "Idk. I guess maybe at age 9 or 10 it would have been workable in your scenario. But by age 12? I know when I was 12, every single thing I did was to get the attention of the boy(s) on whom I had crushes (or at the very least to help my friends annoy/attract *their* crushes…)\nI happened to be a cis girl who liked boys — and, though I don’t know the current percentages, I’m guessing that 75-85% of 12-year-old party goers would be cis/hetero kids (at least at this particular moment in their lives).\nSo, separating by genders might have been a bummer anyway.", "I agree, having stations for these activities might have been fine and not really outed their child either. It also would have been a great way to show support in that activities dont have genders. Girls can play video games and boys can wear makeup etc. \n\nIn addition, separating gender by these activities would have been a nightmare for me at age 12. I wasnt allowed to wear makeup and my mom disapproved of me being friends with girls who did or had other stereotypically feminine interests. I can't imagine it would have gone over well for all the children invited too.", "I'm referring to the use of \"son.\" It was only after the post was made and I wrote this comment that OP wrote that they're okay with \"son.\"\n\nEven without that, I think outing someone and this absolutely ridiculous \"binary\" themed party justify the judgment.", "I think you need to do some reading about what being non-binary actually means. You may have been trying to be supportive, but the party you planned goes beyond accidentally outing your child. It shows a serious misunderstanding of the meaning of non-binary. Generally speaking, non-binary people feel they do not fit into the traditional gender roles or the “binary” meaning the two genders. It’s not “boy and girl” it’s neither boy nor girl. You threw a party that was literally gender binary themed. You reinforced the gender binary by providing activities traditional society views as gendered. And then you separated the party guests by TWO genders. The two genders that your child has confided in you that they aren’t sure they fit into. Notice how you didn’t think to make a “non-binary” space? Which part of the party does someone who does not fit into the gender binary attend? They are not a boy or a girl. \n\nTo put it as simply as I can, not only did you out your child, you threw a birthday party that excluded them. What you did is so out of touch that I almost feel like this post can’t be real. I hope it’s not. This was likely very traumatizing for your child if it is. I feel deeply sad for them. \n\nYTA OP", "Doing nothing different is significantly better at trying than this garbage.", "NB and gender fluid arent the same thing. Fluid's a kind of NB. NB is just someones identity being apart from mainstream gender classification  or lack of a gender. Even if the kid was fluid the parents shouldve just had a non-gendered party, or a mix of boyish and girly things. Its just weird to do what OP did", "Gender fluid and Non Binary aren’t the same thing. \n\nNon Binary includes people who identify as neither male, female, both or none of those\n\nGender Fluid:  type Non Binary identity where a person’s gender identity may shift at different times, so they could feel male, female, both or none of the above. \n\nGender Fluid people are Non Binary, but not all Non Binary people are Gender Fluid.\n\nTerminology matters because it means you’ve been heard, recognised and respected.\n\nIf OP’s kid said they were gay would you belittle their own sense of self by assuming “the kid probably doesn’t even know they are using the wrong term” and are, for instance, probably bi? Probably not, because telling a gay person they’re probably bi and using the term gay incorrectly is AH behaviour.\n\nETA: OP says\n>” From what I understand they sometimes feel more like a boy and sometimes feel more like a girl.”\nOP is describing her child as Gender Fluid (while demonstrating she doesn’t know what it means), not the child. \n\nYou’re defending a person by accusing the actual person (child) of not understanding terms while conflating terms yourself.", "And unfortunately, neither will any of the guests. And quite possibly neither will the internet if they posted photos of this 'genius idea' or if any of the other people there did.\n\nAnd I doubt that they'll let the kid live it down either.", "This is a terrible idea. Having a party related to gender/identity in the first place was weird, but I can *almost* follow your (misguided and frankly ignorant) logic. But after the fiasco that was the first attempt, why on earth would you do it again?\n\nYour kid probably already feels very alienated and othered by your actions. The answer is not just a better NB-related party. Why single out your NB child in that way? The answer is to throw them a party that aligns to their hobbies/interests, not their gender identity.\n\nUnless someone specifically mentions wanting to have their identity/differences celebrated, generally it’s good to treat them like anyone else. In this case, that would mean picking a birthday theme like “minecraft” or “horses” or “jewelry” or whatever the hell it is your particular 12-year-old likes.\n\nAll of this is somewhat irrelevant, though, because I think any type of surprise or themed party should be off the table basically for the rest of your child’s life. They’re feeling really vulnerable right now and the best thing you can do (in addition to a sincere apology and educating yourself) is to give them some agency back. That means they get to choose if, when, and how to have another party. They pick the theme, the invitees, the parameters, everything. They might not want any sort of party for many years to come, and that’s valid too.\n\nJust please, don’t try to fix this by thinking *oh we’ll ask the other NBs what they like!!*", "Thier child changes swaps between son and daughter depending on how they are feeling. Am I the only one who read the post? The party they threw makes it pretty clear.", "Ya, this whole story is so bizarre I'm really doubting it's a real one. \n\nI just can't make heads or tails of who these people are and what they were actually thinking. For the hypothetical child's sake, I sure hope this is fiction.", "its pretty clear that its new to you. i get that youre trying to be supportive, but you goofed here. \n\ntalk to your child. apologize. take them to their favorite restaurant. take them out to buy a new outfit. ask them about a party re-do. have your child be an active participant in the planning, and follow their lead. \n\n\nsoft yta. you can mend some of the damage you did here. listen to your child, and follow their lead.", "\"this whole NB thing\"\n\n🤦‍♀️\n\nYour child has informed you that you misgendered from birth.  Im willing to bet accepting \"son\" is because they are acutely aware of your cluelessness...", "Attitude is hard not to have when you are non-binary like the child mentioned in the post. They endangered their child and might’ve completely alienated them from their friends. Even if unintentional, even if it comes from a good place, people can still tell you how they feel if what you did was harmful. It’s not abuse. It’s righteous anger. There’s a difference.", "I’m not angry at the 12 year old at all. I’m angry at the parents for not communicating with the child or doing any research before outing them and endangering their life. I made this comment before I saw OP’s post about the kid being okay with the terminology but I still won’t say it myself.", "Also just enforcing gender stereotypes? What about the girls who want to play video games the the boys who want to do makeup? You are making it harder for people to be non binary because now they have to pick if they feel like a boy or a girl essentially. What if your non binary child felt somewhere in the middle that day? They are essentially forcing them to feel like a girl while with biological girls and feel like a boy with biological boys.", "Because the child is happy being referred to as their son and as him.\n\n\n\nIt sounds more like gender fluid than non binary.", "Per comments (I'm not feeling much like reading anything else OP posted, honestly) sounds like their child is fine with being called son, but I just want to point out to you that it's really, really frustrating how often people who should take five minutes to simply ask a nonbinary person important questions seem to feel no interest nor inclination towards doing so. Quick convos about particulars and feelings could have made it clear that this was not something their son wanted to be out there in that way, Also could have cleared up where their child is - there's a huge range here, and reinforcing binary clearly wasn't it.  \n\n\nI honestly think this is a bait post intended to show \"supportive\" parents and icky social justice warriors and the trans community ganging up on them for \"trying so hard\" as that's pretty common these days; parents whining about being so unfairly maligned for being \"supportive\" while not actually doing any legwork to BE supportive, and the first step of that legwork is quite simply an open dialogue and no steps taken that a nonbinary person isn't comfortable with in terms of outing them or discussing them publicly.", "Where was the dad with the choreographed dance routine when you need him?\n\n\nProbably still torturing his daughter in law I guess.", "Just sharing appreciation for “oof a doodle.” I constantly say “f*** a doodle” and my brother thinks it’s odd (but amusing).\n\nAnd I agree this is a terrible idea. Parents assumed the kid was out to their friends, and you know what they say when you assume. I’m a cis woman and the girls party doesn’t sound as fun as the boys. Is it fun to get dressed up sometimes? Yeah. But sitting around while the boys get to play games? Boo.0", "I uhh… skipped the middle and then had to go back and reread it to find out about the gender stereotypes. \n\nAlso NB… also kept thinking no. No. Please tell me you didn’t. Omg. No.", "Years of retail/IT have made me believe stories like this  with out question.", "I disagree, this is coming from the same society that invented gender reveal parties which are becoming increasingly more deranged. This is totally believable, maybe you and I are enlightened about the finer points of transgender/nonbinary identity, but most of the world isn't.", "I would love to believe this is fake because no kid deserves this, but honestly, it’s not too far fetched. You know how sometimes someone who likes to come off as smart will pretend to know what they’re talking about but to anyone who really does understand the topic, it’s clear they actually have no idea what’s going on?\n\nYeah I’ve experienced a lot of that when it comes to people reacting to lgbt+ stuff. Lots of people like to be seen as very supportive but never do any research on how or what it means to be supportive, and just go in blind hoping that they’re doing it right. I’m trans and I’ve had people who thought they were being supportive tell me I’m “being trans *wrong*” because I wasn’t their idea of trans. When people like that become parents to trans or NB kids, things like this are the outcome.", "I don't think anyone disagrees with OP being TA.", "Eeeh. I know a few non binary people who are fine with being called 'son' or 'daughter'. We don't have enough information here to know if op's kid has a preference either way. \n\nTheir preferences should absolutely be respected whatever they are though.", "I know a lot of people that have or are NB go by a nickname they are given or calling them “offspring”", "I am sure it is but they could be berating them, trying to “fix” them or disown them. At least they are accepting them, they just need to learn to communicate.  I don’t think some people get nearly enough credit for trying.  A lot of people on Reddit expect everyone else to be perfect knowing damn well they make mistakes too.", "Really? Because you're really hyper fixating on the fact that they are using the term non-binary instead of gender fluid.\n\n\nI don't know why it's so strange to people that a 12 year old might get those terms mixed up", "Ooh I don’t know this one. Link?", "There are some people who are arguing for different judgments.", "I guess I should've said to ask!! OP, ask your child what they prefer", "I’m not hyperfixating on that at all. And it isn’t strange to me that a 12 year old might mix that up. I feel like you’re misunderstanding that my comment is about the parents and the way they went about this and what they could’ve done better. Sure I didn’t say it in the nicest way. But when you literally endanger your child I’m not gonna be nice.", "You'll need a better redditor than myself to find it. He was a RIDICULOUS person who planned out a whole dance that would him involve an interpretive dance around the couple (then just the groom bc DIL noped out)\n\n\nETA: my Google fu is better than I thought! https://www.reddit.com/r/AmItheAsshole/comments/gmbhe4/aita_for_teaching_my_son_a_dance_routine/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button\n\nEnjoy. His post history is something truly special!", "you could add a note via an edit?", "Always for sure! Which I think is the crux of the issue here. Op and her husband didn't bother asking a goddamn thing, like if their child was even out to others.", "Their son comes to them and tells them that sometimes they are a girl and sometimes they are a boy and that they regularly switch between those two throughout any given day.\n\n\nIt's not crazy that you might consider a party that accommodates both aspects of the child. Sometimes you love make-up, sometimes you hate it? Well fine. We'll have one party with and one without. Everyone's acting like OPs parents are monsters for forcing gender stereotypes on a \"non-binary\" child, but it's pretty clear that the kid isn't non-binary. They are gender fluid. \n\n\nPretending otherwise just because the kid used the wrong term is bizarre.", "Why? It doesn't change the substance of the judgment. And anyone reading the judgment is also likely to see the comments noting the information OP decided to share after my post was made.", "Very good point!", "I'm sorry to hear that. Both you and OP's kid deserve better.", "Okay but genderfluidity doesn’t typically change over a course of minutes or hours. It’s typically a day-by-day thing. They could’ve easily taken a gender neutral route to the whole thing and included both on one floor if they had to do it that way… AFTER they made sure the kid was out to their friends first.", "So your idea of inclusion is segregation ? Your husband's genius idea lost me.", "Holy crap. YTA. Your poor kid.", "YTA. You've endangered your kid because of this. If any other people outside of their friend group hears about this, they could start bullying them. Not only that, but other parents could start harassing all of you.", "YTA. I'm not sure that this weird enforcement of the gender binary is really how you support someone who doesn't always feel comfortable on either side of it. Gendered parties can hurt people who are cis even, having a weird half and half gender binary thing going on doesn't seem to do anything positive with the idea.\n\nJust have a party with things and people they like.", "Who was this for? It certainly wasn’t for your child. \nYTA", "Whaaat???? My kid (20) is non-binary. And they are still deciding when to tell different people in their life. \n\nThey told me at HS graduation 2021. But figured it out over the previous year. Told their mom this past fall. Their sister probably knew before I did. It is a process of trust. \n\nGramma (my mom) is visiting in a month. She will be the first person we tell in our extended family (except the one sister I am close to). Because of my conservative Christian upbringing, this is a huge step. My mom will be confused (79), but ultimately will always love my kid. \n\nNot so much rest of family. Thus, we probably won’t tell my step dad, dad, step mom and the rest of my siblings. We know they will be judgmental. Maybe with time. \n\nMy kid gets to choose who knows what when. It is my job to be supportive. \n\nYou actively chose to do No homework, to not get any advice, and to not communicate with your kid. YTA^1000+. \n\nSurprise parties generally suck for kids. Being so clueless to out your kid is just rock solid stoopid. \n\nYour kid trusted you enough to tell you. That is awesome!!! You violated (Boooo!!) that trust in a very big way. Your kid will never fully trust you again- and you need to be ok with this. Don’t be more of an ass donkey and insist your kid ‘gets over it’. \n\n1) Apologize, 2) own your shit, 3) accept that you have forever damaged your kids trust in you.\n\nEdit: live to love; our to your\n\nEdit2: The boy/girl party is an uneducated understanding of what non-binary is. I am still learning. When in doubt, I ask my kid. Communicate with your kid rather than puppet weird stereotypes.", "YTA - My 9yo also recently came out as NB, after assuring them that it was totally cool we asked them what they needed. They were able to tell me that they wanted help telling their bio father but they felt fine talking about it to their friends - they go to a very liberal school. The reason why they are choosing to identify as NB is important.  For my kid it was about not wanting to be slotted into gender stereotypes and wanting to feel free to wear whatever and play with whatever and not feeling they have to be one or the other in any situation.  \nAside from the outing - which is atrocious, the whole party theme was just plain weird!\n\nYou actually REINFORCED the stereotypes. It's like you missed the whole point of what it means to be NB.", "\"oh you don't conform to gender stereotypes? Let's physically segregate your party and friends by gender with the most stereotypical activities possible\" 🤦‍♂️ you're not intentionally an asshole, you just forgot to use your brain", "Lol, you threw the most binary party you possibly could for your nonbinary child.\n\nNext time, regardless of the gender position of any person you throw a party for, ask them what they would like for their birthday party.", "NTA", "YTA \n\nWhy couldn’t you just done a normal party without a bad stereotype theme or just go with your kid’s favorite thing as the theme????? Is your kid even into makeup and video games????? This was just bad idea overall.", "Holy cow. With ANY 12 year old, you should ASK what they want to do for their birthday. Honesty your gender division was just insulting to everyone involved. YTA.", "Lord what did I just read.. you have to love society..", "What disgusting parents.\nYTA.", "I hate 2023", "\"NTA. The mere fact they claim to be “NB” shows that they’re just jumping on the disabled tik tok trend bandwagon for attention. You and your family are paying the price.\"\n\nThis sub is so damn toxic that the mods think that saying \"NB\" is nonsense is hate speech. Crazy, crazy, crazy.", "This thread is a whole lot of angry people that don't even understand their own fantasy rules.\n\nNTA\n\nDon't let confused and angry internet warriors tell you their misguided opinions and thoughts on you as parents.", "NTA Parents trying to be inclusive and loving is never a bad thing. EVERYTHING is dramatic to a 12 year old.  He’ll tell the story one day with tears in his eyes and love in his heart for your acceptance", "I feel your heart was in the right place. It sounds like you’re trying to use the appropriate pronouns and were eager to show acceptance, it just was not well executed. I think an honest apology is in order and getting their opinion on how the three of you can proceed from here would be the next best steps.\n\nNo judgement because I really don’t know what judgement is best in this scenario.", "I feel bad you’re having to deal with that at 12. NTA", "Hahahahhahahahhaha.. I haven't even got to the comments yet!!!", "As a nonbinary person... YTA.\n\nI could screech and call you names but I'm sure you already know how bad a choice that was.\n\nNow is mitigating the fall out.\n\nApologize. Apologize apologize apologize. I mean in ways you can't even think of. This could be a \"we have to change schools or even move\" level fuck up. Your kid could be subjected to immense ridicule and teasing, exclusion and abuse because /they/ couldn't control who knew and when they found out.\n\nBe attentive. Listen to your kid and let them lead on how to handle it. You need to pay attention to everything and be as supportive of whatever choice they make as possible.", "NTA. I think it was a cute idea but not executed well. A pink and blue themed party to celebrate both sides of who they are. I think I'd of asked him about it and asked him to pick the colors. Purple and green would of been awesome. \n\nBut you fucked up. Bad. You didnt mean to but what you need to do now is apologize and give them space. Your son will forgive you in their own time, right now they are going through alot ontop of just being a kid. This is a fixable mistake because it was one you made from love and acceptance.", "I sincerely hope this is fake. So many sentences triggered me while reading this. YTA btw.\n\nIf this is real then it's nice that you are trying to understand the community your child is a part of, but you still got some learning to do as this whole gendered party idea was just offensive and insensitive to your child's privacy.\n\nExplanation why I find that bday party idea offensive: You segregated the invited children based on their assumed genders and made their activities gender-conformed. Girls get makeup artists because they are princesses and boys get to play sports/video games.", "# Truthfully, I only read the title of your post then came here to say: YTA", "“Hi Reddit! My child came to my spouse and I as non-binary, so we decided to have a party for them that is entirely a gender binary by floor, complete with traditionally gendered activities thus making my child feel like they don’t belong on either floor of our home for their party. Am I the asshole????!!” \n\n\nSlow clap.\n\nIf this is real it deserves asshole of the year. This poor child was humiliated in front of their entire class and will likely never socially recover\n\n\n\nYTA times a million", "NTA I think the parents did the best they could especially since the child is 12 I don't really think they should be worried about coming out, there's nothing to be coming out about literally he's 12 I'm sure none of their friends care it's honestly not that big a deal fr. And I say this as a 24 year old gay man who actually had to come out of the closet, kids these days I stg. I applaud the parents tho for trying their best, again NTA.", "I miss the days when there were only 2 genders . It’s so complicated now", "Nta…but you kind of seem like this was more about you trying to show all your child’s friends how cool and woke you are though…I would almost bet that you and your husband have probably outed your child to people you work with and are just basking in the extra attention and opportunities to show everyone how unique and cool you are as parents. In the end it could be a lot worse for your kid…but I hope you guys just chill and let them drive this at their pace.", "To the OP, I get that you're trying. A lot of this type of stuff is new and I'm sure wasn't a thing in your generation so you just don't understand. I honestly love that you guys are at least accepting of your NB kid and try to come up with fun ideas for them. \n\nYes you did goof up by outting them and yes the whole point of LGBTQ+ is to intermingle genders and not fit stereotypes but you guys just didn't understand all that bc this wasn't normal in your youth. I'm really sorry for you and your kid and I hope they can come to understand eventually that you did this with only good intentions. \n\nDon't let these commenters get to you. The LGBTQ+ community can be assholes at times. I still think you are good parents for at least accepting your kids. I hope you'll see this as it'll probably be buried in the comments but fingers crossed.", "I believe you thought you were being supportive but holy hell did you miss the mark. The idea was incredibly tone deaf and I don’t blame your kid at all for their reaction. And to top it off you didn’t know if their friends knew? I can’t. This is so ridiculous I want to believe it’s fake. \n\nHowever, I think you’re NTA, you just fucked up really really really really bad. So bad. Like you’re almost a total AH for fucking up this bad. But I actually think you’re just really dumb. Or lying. Please be lying.\n\nEdit: I was so blown away by the stupidity I made all sorts of typos that needed to be fixed. By god you’re poor child.", "Wow. Too much to unpack. You tried too hard, embraced all the stereotypes, have obviously failed at communicating, and decimated the poor kid. Yup. No need to vote, YTA.", "I get owner it TA but I really don’t think what they did is that bad they were trying to be supportive and they had no I’ll will you also have to remember they have other children", "YTA", "YTA.\n\nMa'am, your husband is... not a genius. Not even close. Your child is right - even setting aside that this was a totally inappropriate way to \"out\" them (and, hint, there is no appropriate way), that is the dumbest idea I've ever heard for a party.", "YTA, your initial intentions seemed genuine on their own and you made an attempt to show you support them which is better than some, but it’s very stressful for a lot of kids to even open up to their parents in the first place due to fear of rejection, being disowned, or far worse in severe cases. So it’s still understandable why they would be scared or upset with other people being told about it if they aren’t ready, especially without even being told about it first.", "YTA for reasons already stated but I just want to let commenters know that nonbinary people can go by binary identifiers such as son, that is not misgendering, unless the son has specified that they prefer to be called otherwise. I am nonbinary and I dont mind being called daughter/sister, although my mother does refer to me as her child sometimes and it does feel good", "YTA but I think it’s an accidental YTA. I do think that your intentions were good- you wanted to show acceptance and celebrate this. \n\nYTA as a parent for not checking that this is what your child wants, and for outing them (even unintentionally). And I think it was an idea that just wasn’t thought through a lot, and ended up being an absolute disaster. \n\nI’d write a note to your child, apologizing. I’d explain that you were trying to be supportive but knew that you clearly got it wrong and you’d like to know what you can do to make it up to them and rebuild their trust. Offer to do a family therapy session or to pay for therapy if they’d like to work through it with a professional. \n\nI do believe, based on your post and comments, that you had good intentions. But intentions don’t negate harm. I think with good effort (assuming all of this was in good faith) you can repair this.", "This has to be the worse idea for a party I’ve ever seen. YTA", "I am not understanding the segregated party. How did you end up on that idea?\n\nThat is what is blowing my mind. \n\nYTA\n\nThis party was for you", "YTA. What a stupid party idea.", "This can’t be real lol. Is suddenly the only thing you know about your son that they’re non binary? Couldn’t you just have a party, you know, that you would have had for the kid you’ve known for 12 years, based on interests or activities they enjoy? YTA. Yikes.", "YTA, what have you done to this poor kid", "Wow. Just wow. YTA you already know that now. I really just can’t wrap my head around how between the two of you you couldn’t figure out this was a bad idea before the day of. Like not once? \n\nThe theme was totally counter to what you were supposedly celebrating. And just how did you not even ask if they were out? Ugh poor kid.", "This seems like an episode of a sitcom lol", "You know when you throw a birthday party and everyone just shows up and has a good time in the same room and the decorations are all different colors or a random theme like a sports team, superhero, tv show or something else? You know, a regular party? Well that’s what you should have done. YTA", "YTA. Big time. You outed your own child while simultaneously perpetuating the worst of gender stereotypes.", "YTA…and incredibly tone deaf. You didn’t think to talk to your child about this first?", "YTA. I cannot fathom why you would ever think that it is your responsibility to out anyone, let alone your child. Although they might have tried to describe to you what they were feeling, you took it literally and decided to put it on display for everyone. I kind of wonder if this is even real. I believe you had really good intentions and care about your child so I hope you recognize that you need to get some outside help. This party may have some long-term consequences and the best thing you can do now is to stop thinking you know what to do.", "YTA- wtf was this idea? Why would you think this was a good idea??", "Every day I'm amazed that people can do such incredibly asshole ish things and still wonder whether they are the asshole. Yes OP, YTA.", "How stupid people can be? Yeah YTA. And what if a girl wants to play videos games and doesnt want make up?, Such a stupid idea god.", "YTA Hoping this is a made up post. How could anybody think this was a good idea? “From what I understand”? Are you honestly telling us, that your child tells you an important piece of information and you do not bother to at least Google it?", ">My husband came up with the genius idea to have two birthday parties at the same time in our house, one for the boys and one for the girls.\n\nFirst of all wtf? It's so cringe even my grandma wouldn't do it\n\n>and our son could move freely between these two parties based on how they feel\n\nI don't even want to elaborate, you missed the point of a party, to be together, why do you feel the need to separate the friends by their genders? really a wtf move", "That's one of the worst surprise party ideas I've ever heard. Your husband did not have a genius idea, he had a terrible one.", "Holy geez. This was hard to read. I hurt for your child AND the party guests as it had to be uncomfortable for all involved. \nYTA. Sorry to be harsh, but remember how you feel is nothing compared to how your child feels. Pleas use this as a learning experience.", "YTA\n\nwow, breathtakingly stupid idea\n\nyou wanted to highlight the nonbinary aspect of your child and nothing else. They are so much more than nonbinary. Surely you could have picked a different theme to the party.", "YTA for allowing this to happen to an 11 year old child", "YTA. That was a really stupid idea.", "You made it all about you and how you can showcase your son. YTA", "YTA a dumb idea carried out in truly dumb fashion", "YTA, this party was all about you and not your kid", "I love that your kid is non-binary so you throw them the most gendered party ever so they have to keep picking sides. YTA", "How the F did you think this would make a 12yo happy? OMG it's like you searched for all the WORST possible ways to emotionally and socially damage your own child then doubled down to increase the damage.\n\nYour poor child. Now they have to suffer living with people they have to rely on but never trust until they can safely leave.\n\nI don't know how you can possibly repair the damage you did to this poor child. You actually sounded proud of what you did to them! How? How did ANY PART OF YOUR GROTESQUE PLAN MAKE YOUR CHILD HAPPY?\n\nYou did this for you. You saw an opportunity to capitalize and gain some social points and eagerly fed your own child to the wolves, forcing them to have to deal with everyone who now knows their personal business.\n\nHow do you hold your head up? Is your child safe now that you've exposed them so cruelly?? Do you care or are you only sad you don't have this prop to market for your social mobility?\n\nYTA in extremis", "YTA and I’m not saying this to be funny, but you’ll need family counseling for this. As NB, I felt such a visceral response to this. Your kid is going to probably need some support, therapy-wise.", "Soft YTA. Clearly there were some boundaries that were breached in this instance. Next time, ask! That is a very private part of your child and is all his info to reveal as they choose. Unfortunately I can imagine your child feels betrayed. I feel the party idea was well intentioned but definitely not the best way to surprise your child, even if they had already come out. \n\nIt sounds like they're at a stage where they are making decisions about themselves for themselves and now instead of being the driver you're now more of a spectator. That is good and natural however it can be a big adjustment to your child having more autonomy. Just means more questions need to be asked to gain better understanding and always stick to boundaries!!", "I feel so badly for your child. I hope you can find a healthy way to address this and be more cognizant of the possible consequences of your actions/decisions in the future. This must have been incredibly traumatizing for them; you are really going to have to work to earn their trust again. \n\nGoing forward, you need to educate yourself on how to be more supportive of your child in regards to their orientation AND ensure you and your husband are having conversations and discussions with them. It’s great you both wanted to be supportive and celebrate your child and claim not to judge, however there was clearly a communication breakdown between you all and your child. Now that you know better, do better. Don’t make any assumptions, make sure you understand your kid’s wants/needs and have a chat with them before making such a public display of their gender identity. Give them the autonomy to tell relatives, other friends, etc. \n\nYou all can recover from this. Please get your child therapy or whatever they need to overcome that birthday party.", "Info: is your child genuinely okay with you calling them “son”? Or are they just taking care of you? \n\nGood luck ever getting them to trust you enough to be honest.", "“Our son is non binary!”\n\n*proceeds to throw the most binary party*", "YTA this has to be fake... please...  \n\n\nFor one thing, you've confused being non-binary with being genderfluid. Being genderfluid is more what you describe - sometimes feeling like a boy, sometimes feeling like a girl.   \n\n\nBeing NON-BINARY is identifying with neither gender. You're not male, or female, you don't feel like either at any time. You're just NB.   \n\n\nSo not only was this a terrible idea because it would out them without their consent, but it was also completely wrong and completely invalidated their identity by ONLY offering 'BOY' or 'GIRL' choices, and not ... their gender. Which is non-binary. Which is NEITHER a boy or a girl.   \n\n\nAND to top it off! You classified 'boy' and 'girl' by outdated and shitty gender stereotypes (only boys like video games right! and girls like makeup?) so... good lord, honestly.   \n\n\nYou screwed up, yes. YTA.", "I’m heartbroken for this child. This “surprise” is going to traumatize them for life", "Wow I’m genuinely not sure I’ve ever heard of something that was so well intentioned yet terribly executed. It’s clear that you did really want to be supportive of your kid. But you’re deeply misinformed about what it means to be non binary and what your child needs from you. It will probably take a while for your kid to get over this and trust you again. Start by genuinely apologizing, acknowledging specifically how you messed up and assuring them that you’re going to do the work to educate yourself in order to better support them. Family counseling would probably be a good move. Ultimately your kid is lucky to have parents who love and want to support them. You got it wrong this time but I’m sure you’ll do better as you learn.", "who the fuck separates kids at a party, that's the biggest load of BS ever, assholes", "Geez some of yall sound so stupid", "YTA. People already told you why. I wanted to touch on something different. \n\nI have a transgender daughter. A transgender son. A non binary child. An autistic son and a cis son. \n\nWithin that are all the ranges of sexual preferences as well. \n\nYou are obviously trying to be supportive. Your child will remember that eventually. Just apologize and reassure them you will ask permission for anything related to their gender moving forward. \n\nYou will make mistakes. You’ll dismiss something important and feel like shit  after. It happens. \n\nWhat matters is that you recognize the error and apologize and move forward. \n\nLet them lead how they want to be addressed or who is told (including family members). \n\nWhile they may not see it now, your kid is lucky to have you both.", "Jesus you could not have cocked this up any more if you tried OP", "\"I'm non-binary.\"\n\n\"Oh, we'll celebrate your birthday by starkly highlighting the gender binary and all the stereotypes attached to it, and make you choose which aspect of the binary you want to associate with over the evening.\"\n\nYTA what is wrong with you", "Probably an unpopular opinion but im going to go NTA because I think your heart was in the right place you should’ve just spoken to them about it first so it’s more an error in judgement than being an AH. I also love that you’re accepting of this where as so many parents aren’t", "Though you did seem to mean well, you absolutely fucked up the execution.  \nAs many others pointed out, the idea of the party is based entirely around gender stereotypes, and not in a tongue in cheek way. Even if you weren't stopping people from going between floors, that didn't seem to be your intent from how you wrote it out. You seemed to expect your child's male friends to play games and female friends to do makeup and your child to come and go between them.  \nThe biggest fuck up though is outing your child. Even if you didn't mean to do it, the party is sending a pretty clear signal their friends would likely pick up on pretty quick. Outing someone is seen as one of the worst things you can do in the LGBTQ+ community. It is up to them when they want to come out and to who, and you took that away from them.  \nThough you meant well and were trying to be supportive, YTA.", "My God, what the hell kind of fairytale world has this become… YTA simply for buying into this bullshit.", "You have a son, whom identifies as non-binary, so you decide to throw a birthday party designed to separate everyone into two groups; aka binary. YTA. Don't even need to mention the outting, you know that's bad on its own.", "I'm going against the grain on this and I'm going to say that this child is super lucky to have these parents that love them so much. \n\nMaybe the parents misgendered, were insensitive, and obvs because OP had to preface the post by explaining NB to the readers.  What this didn't lack was trying to meet their child where they are.\n\nIt's not up to reddit readers, the Queer community, friends etc etc to explain gender identities to people that aren't super familiar with it while Google exists. However, having grace and holding space for people trying to learn can really keep hate at bay.\n\nOP, you can never do anything right for teenagers anyways... thank you for loving yours enough to try and be so inclusive and holding space for changes.", "This post is weird", "Yeah.... you're the Asshole", "YTA. This is a 12 year old. Save the “coming out party” for when THEY choose to have such a party, if ever. \nI can hear it now…”Oh we are just the coolest parents ever, so accepting of our child’s gender or non-gender or whatever…let’s party and make GENDER the focus.” \nWhy would this birthday have to be any different than any other birthday? This is a tween who probably doesn’t want a spotlight on them regardless of their identity.", "NAH\n\nYou tried to be supportive to your son. Just apologize and love him. He’s a dumb 12 year old who will get over his hurt feelings soon. Just keep loving them and he’ll eventually understand.", "Man oh man. OP, I believe your heart was in the right place but you and your husband truly fucked it up. YTA, husband is TA, but you’re not irredeemable and I hope you listen to your kid if they ever talk to you again.", "YTA- literally anything else would have made more sense. Your child is asking for less focus on gender and gender stereotypes and you made that the sole focus of their birthday. Apologize to your child.", "YTA you should have spoken to him. Plus this sounds full of gender stereotypes. The girls have pampering and the boys play games? Being nb doesn’t mean he associates with both those aspects either.", "YtA. How clueless do you have to be to think that separating by gender and forcing stereotypical gendered tropes for a NB kid is a good idea? Not to mention outing them to their entire social community.. like holy smokes do you suck. Do yourselves and your child a favor and research what it means to be NB before doing anything else to “support” your kid. Absolute imbecilic move.", "And also assumed that the birthday kid was the only non-binary one attending.  Probably not true and succeeded in making any other NB kid more uncomfortable.", "I feel bad for all of the kids subjected to this.\n\nYTA", "Were it not for the hurt kid, this lack of...awareness? of the whole \"non-binary\" means...not...binary... thing would be very funny. What an absolute shoebill.", "Not only this and outing them puts then in way of harassment and danger", "1000% hit the nail on the head.\n\nThis party was for the parents and not really with their kid in mind. Not that OP will ever admit anything other than that they were trying to do the right thing 🤦\n\nThere are so many cool and fun activities that both girls and boys can enjoy....you know, any 12-years-old kid would like!", "Actually, I'm not quite sure you get this, and you do seem to be trying, so I'll lay it out clearer: The existence of gender as an either/or walled garden is something that is detrimental to people who do not neatly fit in either half for whatever reason. Your party theme points out that the wall between them exists in society and that they don't fit on either side of it neatly. That would make me rather unhappy in their shoes.\n\nThe division of things that are \"for guys\" and \"for girls\" is a societal construct. If it didn't exist, people like your kid would probably be a lot happier. It's not generally something whose existence they would want to celebrate. Your kid doesn't need a fun, quirky nonbinary party to be supported. They need a party full of things and people they enjoy. Outing them was bad enough, but the idea alone was rotten to start with because it's really missing the point of their existence.", "Are you a wannabe influencer??", "No kidding. I like wearing makeup but I don’t like having it done, and I for sure would’ve preferred to be playing video games with friends at a birthday party. Oof.", "Alright, everyone is piling on here—I’m sure you love your kid. I thought I’d make some suggestions on how to learn more about what being nonbinary is and how you can support your kid.\n\nFirstly, nonbinary is an umbrella term. It can mean different things to different people. What you’ve described in your post is “genderfluid”, which might or might not be the right term.\n\nYour kid is 12. Their identity may change over time. Even adults have identities change. Are you still the same person as you were ten years ago? The most important thing is to listen to your child, hear what they are telling you, ask them what they want, and action it. They might feel differently this week as to what they do next week. That’s great.\n\nFor some background context, [here is a video](https://youtu.be/ZGQIrYlvrrs) by a nonbinary creator that is a good introduction. If the link doesn’t work, the video is called “What does nonbinary mean” and it’s a YouTube video by Luxander. It’s a few years old and it might be different to what your kid feels, but it’s a good starting point. Maybe watch it and then when your kid is ready to talk, send it to them and see if they generally agree with it.\n\nSome notes that might be useful:\n\n-\tYou probably have an organisation that provides resources and advocacy for gender diverse people in your region. Search that organisation on Reddit to make sure people have had good experiences with them and then reach out.\n-\tYou should make sure all of your child’s doctors and other adult influences are LGBTQ+ friendly and educated as much as possible. Look at nonbinary subreddits and the subreddit in your area for recommendations if you’re not sure. The transgender subreddits can be useful too (“transgender” is an umbrella term that can include nonbinary but not all nonbinary people will identify with the label trans)\n-\tEspecially after this, please make sure your child has access to gender diverse friendly mental health support.\n-\tYour child may want to change what they wear or how they present themselves over time. Make options available to them as much as you can afford to.\n-\tYour child may need you to advocate for them to make sure that they are being treated well, but you should make sure they are as involved as much as is appropriate in any decisions you make, and that they have professional mental health support to help them navigate it\n\nFinally, I think you should take some time to explore what gender means to you on your own without your kids. Gender is a concept that means something completely different to different people, but deconstruct it a bit for yourself. What would be different if you were the opposite gender? If you woke up in a different body, would your interests be different? What about if you had been raised in a different body? What assumptions do you make when you hear someone of a certain gender? What language do you tend to use? What are the opinions of the politicians you vote for and your social circle? If you identify with feminism, what does that mean to you in relation to gender diversity? What about religion or other ideologies? Or the culture in your workplace? Or the media you watch? Do you see gender diverse people on the screen, and how are they treated?\n\nA lot of good can be done by breaking down internal assumptions around gender and gender roles, diversifying your media, and listening to the experiences of real people. \n\nFor the birthday, I would dial right back and ask your kid what they want. And just ask them in general—ask them to share their favourite shows or creators or books with you, to send you videos, to let you see the kinds of things that they identify with. I know you’ve said your kid is fine with the word son—but maybe ask if they’d prefer “kid” or “child” or “spawn” or “jedi” or something else entirely. Just show that you want to listen.", "But why have the separation of literal floors and separate activities at all? It's such a bad idea that is stereotypically complicating things.\n\nThere are so many activities that both boys and girls can do...like activities any 12 years old child would enjoy.", "I have a child that is NB/gender-fluid. I’m also just a human being living in the year of our Lord two thousand twenty-three who lives with teenagers and has access to the internet. My jaw just dropped lower and lower at the increasing tone-deafness as I read. OP, YTA, obviously. It would have taken far less effort to do some research to help understand your kid than to pull off this “genius” party.", "you know whats interesting about gender stereoptypes\n\ni feel like if there weren't any, people would be comfortable with whatever gender they feel like they are\n\nbut if they arent there, there's really no physical or societal gender affirmation really", "They will probably forgive you. But you have permanently damaged their trust in you. You need to understand and be ok with this. You won’t help things if you beg or insist they trust you again.", "Yes. I tried to go donate blood today. I didn't make an appointment, nor did I have any intention of heading to the clinic to do it-- in fact, I stabbed a guy on my way to work instead. I still tried to donate blood.", "That's exactly it, though.\n\nIf you consider yourself enlightened on the subject, and mainly interact with likeminded people, you'll forget that the majority understands little to nothing about the concept.", "Hell, I’m confused about girl music and boy music. Which is which and what the hell am I listening to?!?", "Any time I'm a little unconvinced of the truth of a story, I think back to the time that my FiL (professional roofer with 30+ years experience) redid the roof on his mother's house for the cost of materials.   \nAfter he finished, another guy did the flashing around the chimney.  \nLo and behold, after the first rain, the roof was leaking badly around the chimney, so the mother sued her son for the cost of damages and rework on the roof to be done, and she won.   \nSo yeah, people are f'ing ridiculous.", "This is a great comment.  Gender identity is one aspect of a complete person.  If you fixate on one aspect like this, you risk losing sight of the whole person.", "Yeah, they totally messed up on this one.  Absolutely they did.  But in terms of calling them \"son\" or not, a month may not be enough time for the child or the parents to have figured all that out.  Which is why I'm always a little surprised by how quick people rush to judgement on things that I think are perfectly normal human responses.  \n\nAs for it being a troll post, I don't know but I'm treating it as if it's real.  Still, my judgment would be that they are the AHs.", "Yeah, it may have been on purpose.  Because their child came out a month ago and they are ALL, child included, still figuring out the brand new parameters.  It may have been something they hadnt yet discussed yet. SMH I hope you're as perfect in real life as you present yourself here but somehow I doubt it.", "It is a shame since information is more easily accessible than ever.", "Celebrating a gender fluid child by harshly separating the genders based on outdated stereotypes is in no way a '\"brilliant\" plan. Regardless of whether or not the child was out to the world.", "It does clarify some things.", "What does it clarify exactly? OP still outed their child to a large group of people and did it with a party that affirms the gender binary in a tacky and sexist way."]}