{"id": 11832, "submission_id": "11mgui0", "title": "AITA for refusing to apologize to my girlfriend for not recognizing her?", "selftext": "I (M22) recently suffered a TBI and I have developed prosopagnosia (face blindness). I am able to vaguely recognize my immediate family, but it’s near impossible for me to recognize anyone else unless I remember other distinctive cues about their appearance (such as a unique hair color or accessory.)\n\nThis has been really hard on me, and I’ve been hospitalized for the past two weeks (for other medical reasons related to my TBI). I texted my girlfriend (F21) to explain my condition to her and linked her some articles on it. She insisted on visiting me since she hadn’t seen me since I was hospitalized.\n\nWhen she came into my room, I wasn’t sure whether she was my cousin (my cousin had planned on visiting too), a nurse, or my girlfriend. She didn’t say anything to introduce herself, so I asked her “can you tell me who you are?” \n\nWhen she replied, I could hear that she was extremely mad and I recognized her voice as my girlfriend’s. She said “are you fucking for real? You don’t recognize me?” I told her that I physically cannot recognize her, and she started crying about how that means she wasn’t important enough to recognize and a whole lot of other stuff. \n\nI was honestly hurt that she was upset with me  over a medical condition that I recently acquired and am struggling with. This has changed the entire course of my life and caused me so much emotional pain already, not to mention the other trauma I sustained from my accident.\n\nIf she had read my explanation I texted her or the articles I sent she would understand that my ability to recognize her has nothing to do with my care for her. She got upset at me for not apologizing to her, but I refused and told her to leave me alone and go home.\n\nAITA?", "created_utc": 1678330961, "permalink": "/r/AmItheAsshole/comments/11mgui0/aita_for_refusing_to_apologize_to_my_girlfriend/", "score": 4591, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for not apologizing to my girlfriend for not recognizing her since she was obviously emotionally hurt by this.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If anything, she owes you a huge apology. I'm sure that this is upsetting for her and maybe that was part of her response. However, emotional maturity would mean that she needs to recognize that and apologize for her behavior.\n\nI'm so sorry that this happened to you and I hope that you have a smooth recovery.", "Your girlfriend has a lot of growing up to do. You have a TBI. NTA, but please reconsider this relationship. She should be worried about YOU, not about whether or not you recognize her. She's selfish.", "This is a sad story.  I’m going NTA, I understand her being upset but she took it too far and you being an AH in this is just not possible.  I wish you the best and I hope you get the medical care you need.", "NTA just leave that she’s not going to be helpful for you or your recovery. This will always be about her and your inability to do whatever for her.\n\nShe owes you a huge apology for not understanding the medical condition you told her and sent her links about. That’s fkd up.", "NTA-You gave her a heads up and sent her articles so I'm really surprised by her reaction. She was not very understanding.  I don't think you owe her an apology but she owes you one for sure.", "NTA. She should apologize and not make this about her. If she doesn’t, unclear that she is the best match for you.", "NTA, that’s a genuine medical condition that she should be ready to give leeway for. Maybe start wearing a “signature” necklace or set of earrings etc.", "NTA the symptoms of a TBI aren’t a reflection of how much you care about her.  But I could argue the fact that she didn’t read the info you sent her does reflect how much she cares about you.", "NTA. \n\nI'm so sorry OP. I have mild propognasia, and it can be very disorientating. It's heartbreaking that rather than support you, your girlfriend has to make your traumatic experience and current condition about herself. She doesn't understand how scary it can be to not recognize the faces of people you love, and how isolating that can be. She seems to only care about whether you're showing the right amount of investment in her, even though you literally can't help it. \n\nI hope your recovery goes smoothly!", "NTA\n\n&#x200B;\n\nAs someone with a TBI, surround yourself with a solid support group. Your girlfriend doesnt seem to be the one to help you.", "NTA\n\nYour condition is a true test of your relationship, and it sounds like your girlfriend did not prepare herself for this meeting despite your efforts to get her up to speed with your new reality. Is she a quick study, or would reading articles pose problems for her? \n\nTry to remember why you were drawn to each other and practice patience while you are transitioning to your life as you now know it. This may take adjustment time. If you are both quick to anger or are challenged when coping with frustration, you may have to take things slowly. \n\nI sympathize with you as I have difficulty with facial recognition, often waiting for someone to speak before making that connection—even with people I know. (This is not to say I fully understand your experience as it is probably a mere fraction of the struggle you face daily.)\n\nBest wishes for good health and discovering ways to work around the impact of your TBI.", "NTA. \n\nThis is very sad.\n\nIf she doesn't shape up and start being sympathetic/understanding about your TBI... get a new girlfriend. You deserve better.", "NTA.  She is though for not trying to understand what is affecting you.", "NTA what an odd thing to get mad over. You legit have a medical condition and instead of understanding, she’s trying to make it look like it’s your fault. Things like this don’t choose who they would recognize or not. It’s hard.", "NTA. Run!", "I am sorry you are joining the TBI group, we never want to welcome anyone else. I know all TBIs have different issues. But it’s seems that all need rest and stress makes symptoms worse. I wish you  healing. You did great with sending information and explaining the face blindness. While I understand she is taking it personally, it isn’t. Your world has been turned upside. You did nothing wrong and don’t need to apologize. You will need family/friends that are supportive and helping as you heal and adjust to any new symptoms. If you are still in the hospital them to put a sign on the door asking everyone to introduce themselves to you everyone they enter. You need everyone to try do everything that can help out and your loved ones will want to do that.", "Absolutely NTA you have a medical condition she could of Been more acceptable to this.", "NTA - you can't control the fact that you have TBI. You're also right to be hurt over this. If she can't grip the fact that you don't recognize her due to face blindness, then that's on her.", "NTA, and my advice would be to dump her. She’s just shown you how unsympathetic she’s going to be about a major problem in your life. You deserve much better than that!", "NTA, I think when something like this happens, people want to believe they're the exception because the bond is so strong no medical condition can stop it. Now she realizes this is the real world and not Disney and its upsetting.", "You are far from an AH. \n\nI’m very sorry that you have had to go through all of this. I’m also very sorry that your girlfriend is making your medical condition about her. You have nothing to apologize for. \n\nYou gave her information about your condition before she came to visit you and experience for herself what your reality now looks like. Not only does it appear that she neglected to even read it but she is victim blaming you for her own insecurities.\n\nHopefully she can recognize that your medical condition is not about her and she will step up for you. \n\nAlternatively, she can see herself out if she can’t adjust to the new normal.  \n\nNTA", "NTA- Everyone could have stood to be a bit more understanding to be honest. It has to be incredibly jarring to hear that you could recognize your immediate family but not her. She probably needs more time. \n\nI changed my vote to NTA because she should not have been acting angry while you are injured, though I can understand her being hurt. Just my two cents for this situation going forward: as someone who also struggles to recognize faces, I generally apologize before asking people who they are. It's just a matter of tact. Apologizing doesn't kill me and no one gives me shit for not recognizing them.", "NTA\nYour girlfriend is probably more scared than mad that you didn’t recognize her.  Tell her to read those articles while in the room about your condition so she can understand.", "NTA. If you had a spinal injury is it also  cool for her to be like omg you can't get out of your wheelchair and walk for me, I must not be important enough for you. Yes, it's undoubtedly hard on her but at the end of the day you are the one injured, she should do her best to be understanding and caring to you. And yes, later absolutely find one of her friends and family for support and cry to them that you couldn't recognize her. She shouldn't be dumping that on you.", "NTA. TBI’s require a lot of patience from the patient and their support system. I’ve been through this with a family member, and I don’t think your girlfriend has the sensitivity or adaptability that would make her a valuable part of your support system.", "I'm so sorry and you of course are Nta", "NAH. This is hard for you, and it is going to be hard for her. You don't have to apologize for your condition, but the shock of it is still going to hurt her. If you're serious with her, you should both get some counseling.", "I honestly don’t know what to say OP, I can see it from both sides- I’d be hurt but you also can’t help it, I’m giving a NTA, but I don’t think she’s an asshole either", "NAH\n\ni think your GF was upset that your injury was as severe as it is. Being told how severe it is compared to experiencing the reality is quite shocking.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (M22) recently suffered a TBI and I have developed prosopagnosia (face blindness). I am able to vaguely recognize my immediate family, but it’s near impossible for me to recognize anyone else unless I remember other distinctive cues about their appearance (such as a unique hair color or accessory.)\n\nThis has been really hard on me, and I’ve been hospitalized for the past two weeks (for other medical reasons related to my TBI). I texted my girlfriend to explain my condition to her and linked her some articles on it. She insisted on visiting me since she hadn’t seen me since I was hospitalized.\n\nWhen she came into my room, I wasn’t sure whether she was my cousin (my cousin had planned on visiting too), a nurse, or my girlfriend. She didn’t say anything to introduce herself, so I asked her “can you tell me who you are?” \n\nWhen she replied, I could hear that she was extremely mad and I recognized her voice as my girlfriend’s. She said “are you fucking for real? You don’t recognize me?” I told her that I physically cannot recognize her, and she started crying about how that means she wasn’t important enough to recognize and a whole lot of other stuff. \n\nI was honestly hurt that she was upset with me  over a medical condition that I recently acquired and am struggling with. This has changed the entire course of my life and caused me so much emotional pain already, not to mention the other trauma I sustained from my accident.\n\nIf she had read my explanation I texted her or the articles I sent she would understand that my ability to recognize her has nothing to do with my care for her. She got upset at me for not apologizing to her, but I refused and told her to leave me alone and go home.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA she really made your traumatic experience about herself…", "NTA\n\nHello fellow friend!  I hope you don't mind but I'm going to write down some tips and tricks that have helped me over the years.  \n\nI remember hair color and hair cut style best.  Let people talk and try to learn people's cadence.  If you're out and someone recognizes you, talk with them and if they seem offended, I always get away with \"I'm such a space cadet.  What's your name?\"  Or \"I have a lot on my mind.  Can you please help me out on what your name is?\"\n\nIf you go out in public and you're with someone, a tip that helps me is to take their picture and play it off like \"You're so gorgeous today.  I just want to take a picture to remind you of it.\" Or \"I like that shirt you're wearing.  Can I take a quick picture to look it up later?\"  \"Those shoes look so comfortable.  I'd love to look up that shoe style later.\"  That way you can see what they are wearing if you split off and can't remember what they look like.\n\nMy boyfriend looks like a typical white guy so if I go up to someone and they aren't him, I can play it off like, \"You're as hot as my boyfriend.  No wonder I made that kinda mistake.\"  or \"You look like the better looking twin of my friend.\"\n\nI'm sorry this has happened to you.  :(\n\n\nEDIT: For workplaces, I always call my superiors boss no matter how high up they are.  You can always get away with calling people sir / ma'am.  Fellow coworkers on my tier, I just say \"Hey friend, can you help me with x?\"", "Nta. Not in anyway. You tried to educate her and she didn't take the time to read up on your condition.", "[removed]", "Thank you for your well wishes", "Thanks for your well wishes. Unfortunately, there isn’t a cure for prosopagnosia, but hopefully I will be able to cope with it better as time progresses.", "“you could recognize your immediate family but not her”\n\nTo clarify, I can only vaguely recognize my immediate family. It’s still extremely difficult for me to recognize them too, it’s just that I’ve gotten slightly accustomed to seeing them often since my accident.\n\nI guess I could have apologized to her. That definitely would have smoothed things over. I guess I was just upset at her accusatory attitude towards me about “not caring” about her when in reality this is a medical condition I cannot help.", "She’s not in the room anymore. I told her to leave after our argument.\n\nAlso, I’m pretty sure she was mad at me, not scared. I could hear her tone of voice when she initially was upset at me for not recognizing her.", "[removed]", "I think you can vote NAH if you think neither of us were assholes. NTA would imply that she did something wrong.", "That’s all fine, until she begins to make it about herself.\n\nShe has a right to be sad, I’m sure it’s emotionally damaging for her as well. But, she doesn’t have the right to try and guilt trip OP for something they can’t control. IMO she’s an AH", "Did we read the same thing? OP didn’t choose to not put on glasses so he couldn’t see her. OP didn’t decide to not recognize her. He has a diagnosed condition where he cannot recognize faces. “Emotionally abusive ass”? Are you kidding me? Yeah I’m sure this is hard on the girlfriend. But guess what: how much do you think it sucks for him? Probably even more! It’s a shit situation all around, but NOTHING in here come across as abuse—except maybe the part where she goes “you don’t recognize me because you don’t love me enough” as if his love and caring for her is going to magically overcome his condition. This is not some Disney BS movie where true love conquers all! That just comes across to me as manipulation (and maybe some potential gaslighting?) Sorry, but she needs to grow the hell up. I would be fucking FLOORED if I told my significant other that I have a medical condition, sent a bunch of stuff explaining it, then they came to visit me and got pissed off because of the thing I tried to explain. Did she not read it? Did she not believe it’s real? Far and away an incredibly inappropriate reaction on her part. She has every right to be upset—at the situation. But she has ZERO right to be angry with OP for something that is entirely out of his control—and which I’m sure is terrifying for him too!\n\nNTA.", "Such a horrible take. OP has a TBI, but he should have apologized for not recognizing her? How about she tries to understand his condition instead of getting pissed that he doesn't recognize her? She's the insensitive one. He sent her resources beforehand to help her understand his condition, and she clearly didn't bother to read them. It's okay if she's upset that he doesn't recognize her, I would be too, but she has no right to snap at him, guilt-trip him, and demand an apology.\n\nShe said that he clearly doesn't love her enough and she isn't important enough to remember. Sounds to me like she might be the abusive one, this is hardcore manipulation to make herself seem like the victim.", "Wow you sound unhinged. “I hope she dumps you because of your traumatic brain injury”", "You might want to give her tips to make it easier for you to recognize her.  Could you give her a piece of jewelry to make her stick out for you?  That might be a good peace offering even though you aren’t at fault.", "I wouldn’t apologize for not doing something you literally can’t do. That’s be like a person I know is *deaf* apologizing for not hearing me when they’ve given me information about how to get their attention. \n\nI understand her feelings being hurt, but you did explain before she came to the hospital. Beside providing relevant information, you can’t be responsible for someone else’s feelings. \n\nSounds like a good time to experiment with unique hair colors or something. She could have at least told you what she’d be wearing so that you could more easily recognize her.", "I hope she is able to take a step back and realize it is not personal at all. changed my vote to NTA after having a good thonk", "Damn, your gf sucks Holmes. \n\nShe's worried about her damn self when you are dealing with a brain injury. That's uh, not a good look for her..", "She did - she's blaming you for something you literally can't control. NTA", "[removed]", "I mean, I would hope a dead person can’t hear you, lol, but I agree with your comment, just got quite a chuckle out of that typo.  😂", "He has a disability.   How is not being able to recognize her due to a medical condition, selfish?", "Auto correct was persistent on that one apparently 😂", "NTA. She needs to grow up and read about the condition.\n\nOne of my best friends has prosopagnosia. We've known each other for years, and we're very close, but if we're going to meet in public, I tell her what I'm going to be wearing because otherwise she has no chance of recognising me. Even so, as I'm approaching her, I will call out her name, because she can recognise my voice.\n\nIt's hard to live with, but once all your family and friends know about it, it gets easier, because they will do as I do and accommodate it without even thinking about it. My friend also has 'tricks' for remembering things about people which are not about their face - their walk, for example.\n\nGood luck with your recovery.", "NTA. yes it would be awful if your partner couldn't recognize you. it would hurt. but you don't fucking lash out at the person with the TBI. or make yourself more important than TBI.", "NTA. Get well soon 😢 I’m so sorry for your current injuries and hardships.", "NTA. I'm really sorry this happened to you.  It's really messed up that she got mad at you. She definitely needs to apologize to you and put some effort into understanding how this condition is affecting you and how jarring it is for you to not to be able to recognize people without some other type of cue.", "NTA this is like getting mad when someone with amnesia forgets you. They cannot help what their brain remembers just as you can't help the face blindness. Sending well wishes. While she may be upset this is a small dose of what you must be going through. I can't imagine not being able to recognize people", "Emphatically NTA. This is not your fault and you deserve a better partner sweetie. She should have cared enough to read up on this condition or at least spoken to a medical professional about it. But actually having the gall to blame you for it and call you a liar? How narcissistic and self absorbed. This isn't about her. You did the right thing and don't ever apologize. You are dealing with a very difficult situation with more grace than most people possess. Rest and be well.", "NTA. Clearly she is clueless about your condition.", "NTA. That was a selfish response on her part, especially after you'd already warned her about this. Don't get me wrong, I'd be hurt if my husband didn't recognize me for any reason, I don't think I could help feeling that way, but I certainly wouldn't blame him or say anything that might make him feel guilty about it. I imagine you already feel bad, on top of scared and confused and frustrated. You deserve more (or any) support from your partner.", "Oh, my dude, I'm so sorry. I'm not completely unsympathetic to your girlfriend, I'm sure it was really upsetting for her to have you not recognize her, in spite of the advance warnings. But lashing out at you for it is grossly unfair, and you absolutely do not owe her an apology. It wasn't YOU. It was a TBI, which has no doubt upended your life in many other ways as well as causing this condition.\n\nNTA, and I wish you all the best with your recovery.", "NTA and you don't need this ignorant, uncaring person in your life, sincerely.", "NTA. Man oh man, I've lived with this my entire life, and let me tell you, it never gets easier explaining it to people. I work in customer service, in an industry that is really quite popular at the moment. People cycle in and out, and eventually the regulars start to remember you and... Now it's \"super tall with blue eyes and a fishing hat\" or \"wears very large blue earrings\" or \"curly hair and glasses with cats on them\". People will always be offended when you explain it to them, but it's just because they don't understand what they can't experience. \n\nYou know well enough that it's not a matter of her importance whether or not you recognize her, it's entirely her choice to blow up rather than taking the time to try and understand. It's probably a lot to go through when you experience it so suddenly, and it must take a huge toll on you. I suggest you evaluate your relationship and whether or not her reactions to things like this are something you are willing to live with for the foreseeable future.", "If you had broken both your legs, would she have said she's not important to you because you didn't get up and hug her?\n\nShe probably believed it would be like a Hallmark-movie where you don't recognise anyone but your one true love. Tell her those movies are fake and the artcles you sent are real", "I went through this—I lost my partner of ten years’ face for about six months. It was terrifying and so fucking sad. I could not hold his or anyone else’s face in my mind for any length of time. At one point, faces were so bright I couldn’t look at them at all. My brain is still not the same. Anyway, you have a lot of healing to do, and it doesn’t sound like she is going to help with that. \n\nYou are NTA because she obviously believes her face has some sort of magical healing bs. She’s not necessarily a bad person, but she she has some very silly ideas about love and healing injury and thinks that your relationship is stronger than your injury. It may be, it’s just going to be a much, much longer ride than either of you realize.", "I had something similar except my issue was short term memory. Not just faces. I'm so sorry sweetie. But one thing I noticed when I was younger and dating is a lot of people expect you to magically not have a disability because of the power of love or some bullshit. Which isn't how things work. \n\nMy TBI happened when I was younger than you and I was single. And so many people would date me and expect that if I \"loved them enough\" I would recognize them. \n\nShe either didn't read what you sent or she's one of the people I described above. Either way you deserve better. \n\nNTA.", "NTA. If I walked into a hospital room and my loved one couldn't recognize me, my heart would break for them.\n\nNever apologize to her for this, because you have nothing to apologize for. Don't apologize not just for your own sake, but also for hers because rewarding this awful behaviour will just teach her to keep being awful.", "NTA at all. \n\nBrad Pitt has it\nCrown Princess Victoria of Sweden has it\nJane Goodall has it", "NTA\n\nYou literally texted her with an explanation AND articles on it? And she's surprised by (what I'm assuming to be) a effect from this illness that you just texted her about? \n\nSounds to me like she didn't read most of your text / articles... Especially since her immediate response was that, instead of anything sympathetic or kind.. \n\nI'm sorry man, I wish you nothing but the best", "Definitely NTA....\n\n& on a side note I can't imagine what you're dealing with & how much of an impact it must be having on you. Pls accept this internet strangers best wishes & hopes for you going forward", "NTA \n\nShe really dropped the ball in supporting you here. I'm not sure if she just didn't read the article or didn't know what to expect. If she's worth it maybe arrange for a doctor to explain it to help her understand. But I would be very hurt by that reaction. \n\nJust focus on your recovery and take care, I hope you see yourself fully recovered as soon as possible.", "NtA and a smooth recovery. \n\nIf you guys make up, put your foot down that she read the articles. It's fundamental that she understands.", "NTA- It's not your fault she thought she was so important that she can cause medical science to just not be real.", "Personally going NAH because I don't disagree with her being upset that he doesn't recognize her but it's not his job to deal with her being upset. It's her job to deal with it while he's learning to cope with this", "NTA.\n\nAlso, your girlfriend might be really self absorbed.", "[deleted]", "NTA\n\nHoly fuck does your girlfriend need to get over herself. I've been through some pretty major concussions (But nothing like what you're experiencing) and am very thankful that people around me were nothing but supportive. I cannot imagine having had to have dealt with crap like that while battling my concussions, nevermind what you're handling. Stay safe, heal well and best wishes", "NTA she didn’t even love you enough to read information about her bf’s traumatic brain injury (ffs!)\n\nYou have been through (and will continue to go through) something extremely difficult.  Stop thinking about this and focus on important things and people who don’t make your brain damage about them.", "Nta", "Only you can determine what's best for your mental and emotional recovery, but it seems to me that the girlfriend is incapable of supporting you and will just add further stress.\n\nNTA", "What. The. Fuck.\n\nYou have a TBI and she's making it about herself?\n\nThis is one of the worst things I've read on AITA.\n\nNTA", "Would need more evidence before reconsidering the whole relationship. What she does in the next day or so would be more telling -- it's one thing to be panicked, freak out, and forget medical knowledge. Spotlight and primacy effects kick in. It's another thing to, once you're out of the situation and have calmed down a bit, not reassess nor apologize for freaking out. If she persists and doesn't refocus, then reconsider.", "Yeah, I don’t love how she made OP’s traumatic brain injury about herself from the jump. Even if she reacted poorly in the moment, it is absolutely wild that she is not the one apologizing. NTA", "I don’t have a TBI but these tips are so helpful haha", "I'm sorry to see anyone downvoting your very sane, compassionate reply. Please accept an award for recognizing that some injuries affect more than the injured person, and it may take a minute (or a day or two) for a loved one to wrap their mind around a new reality. and facial prosopagnosia is a very hard disability for anyone who doesn't actually have it to understand.", "I think she was upset that they didn't have a magical moment where he overcame his traumatic brain injury due to their love.\n\nShe entered a room. \n\nShe entered a hospital room. \n\nShe entered a hospital room where she knew her boyfriend was who has been diagnosed with face blindness and she didn't say anything.\n\n She was testing him and when reality kicked in and she didn't get her magical moment she turned hostile.\n\nThat's fucked up.", "Also, I hope you are able to heal. I found exercise moving across my body, that requires tons of concentration, really helpful in repairing some of the damage. I had to use meds to get reading back though. I am still on them, but it’s all good. I can read!", "NTA. May you be in good health.", "You aren’t the asshole here, but as someone who has had prosopagnosia for a long time, know that people will get offended, no matter how it’s explained to them. Your best survival mechanism is going to be generic conversations to gather context. Practice small talk, asking people how they are doing, what they’ve been working on, etc. You’re already doing a great job recognizing voices, the vague, fact-finding small talk will come with time (with some effort). Good luck navigating this new world!", "Honestly, I’m a little worried that she hears you’ve had something horrible happen and are struggling, and she couldn’t even be bothered to read the resources. Not only that, she made what happened to you about her. \n\nI hope your road to recovery is smooth and that those you love support you along it, as you deserve. I would caution you against keeping people around who are upsetting and hinder your progress rather than supporting it.\n\nNTA.", "I think her actions were pretty telling.", "Agreed. Hopefully she's less self absorbed through OPs healing process. \nNTA, and big hugs, OP!", "I go by body shape and clothing and hair style but mostly voice.  Faces mean very little to me.", "I'm not in any way trying to minimize her reaction or your very understandable feelings, but remember that facial prosopagnosia is an unusual disorder and one that takes time for a person, whether the patient or a loved one, to become accustomed to. \n\nYour girlfriend's reaction may have been anger, but it was likely mixed with a good bit of fear and \"startle,\" because all the texts and literature in the world can't prepare a person for seeing their significant other look straight at them and not recognize their face, just like all the literature and explanations in the world probably couldn't really prepare you for looking at people you know and not recognizing their faces. This will take a while. I am sorry you're going through this, but you'll learn ways of accommodating. Same judgment as before - N  A  H, just two people having to adjust to an unexpected new reality.", "Yeah dude. Don't apologize to her. I can understand that it might be upsetting to her that you can't recognize her but in that moment she should have sucked it up and not gotten mad at you of all things.  Right now it's not about her. You had a life altering accident. You are still hospitalized and haven't even really started any healing process. Even if she had been upset in the moment she never even asked about you. She told about how what happened to you was affecting HER. Not, I didn't realize how hard this would be for you but omg you don't love or care about ME enough. Such a crappy thing for her to do.", "I have prosopagnosia as part of my autism diagnosis. It will get easier, although I can't imagine how traumatic it must be to have suddenly acquired this disability. I've had 30 years of practice and I still mix up close family members, but I'm at least able to recognize that I do know the person. The issue here is that your existing brain file of your girlfriend's face is now hopelessly corrupted, like a broken computer file. You have to create a new one, in a whole new operating system that you're only just starting to learn. She needs to be patient and help you relearn her face.", "Better than what? Someone who doesn't want to be abused because they have a brain injury?", "He literally can't recognize anyone? She's playing the victim and has no right to do so. She needs to stop blaming him for a medical condition out of his control. She doesn't deserve an apology because he has done nothing wrong. He deserves a partner in his corner. Not kicking him while he's down.", "You appear to misunderstand what facial prosopagnosia is. OP can look at his girlfriend, his nurse, and his mother standing side by side and not be able to distinguish between their faces. It's a very hard disorder to live with, and for someone like OP's girlfriend, who hasn't experienced this before, it's a very hard thing to understand.\n\n It is also very, very common for the family and close friends of people who have true prosopagnosia to wear a particular color near their face, a hair ribbon, bow tie, or, yes, a specific piece of jewelry which enables the person with prosopagnosia to recognize this person. UnfortuateDaring actually made quite a good suggestion.\n\nThis is new diagnosis of a rare and poorly understood disorder, and as such it's awful for both OP and for his girlfriend. They both need time to get used to what really is a \"new normal.\" NAH.", "It's selfish to want to be able to recognize her? Sounds like you don't understand his now permanent disability. Having identifiers is ESSENTIAL for those with face blindness. This could be colored hair, accessories, etc. But I bet you'd be even more mad if op suggested she dye a strand of her hair huh? Cut the bs having her wear something like a bracelet or necklace is nothing. If wanting to be able to recognize your gf is selfish then so be it, I guess she'll never be recognized again by op", "Found the girlfriend ...", "lol this is 100% the girlfriends burner. new account created solely to reply to this post", "It's weird you think people should cater to your health issues but can't give another person the benefit of the doubt.", "NTA. Your GF is being really selfish. I get that this hurts her too, *but this isn't about her*! You're in the hospital, with a debilitating injury, *you* are the one who needs support. She can go cry with her friends afterwards.", "NTA You had a major injury and she's trying to make it all about herself? Unbelievably shitty.", "Can someone explain what a TBI is? And NTA. Does she know that you can’t recognize people physically? Oh wait nvm just read the articles part. Ssmhhhhh. She may have just breezed past it not knowing what it was because she wanted to see you so badly and didn’t want to wait and read it, maybe. I would try explaining it to her in person if she comes back bc she just might not understand and didn’t read the messages", "NTA, she is very self centered and immature to visit someone in the hospital and make it all about her, she showed no sympathy for the trauma you have suffered. I don't really see this relationship going anywhere, she has a lot of growing up to do but that might take a decade. Hopefully you can move on and heal physically as well as emotionally. I wish you a speedy recovery.", "NTA\nShe doesn't deserve an apology and honestly, she's so self centred you would be better off without her while you recover and learn to cone to terms with what has happened to you.", "NTA\n\nbreak up with this idiot", "NTA I was born with prosopagnosia, about as bad as you can get it (0 ability to recognise an average face with just the face to rely on) and I have failed to recognise my own family members on many occasions. My sister got a haircut? Who is this lady and why is she at my door. My mom got a new hat? No clue who she is. Run into my dad in town where I never would expect to see him? Hello stranger. \n\nThey used to get mad at me and worried about me until I got a neurologist who diagnosed prosopagnosia. Since then, when I give them the blank stare of \"who is this person and why do they know me\", they speak up. \n\nI have had half hour conversations with people who I thought I knew who they were, but were actually someone completely different. It is mortifying. But explaining prosopagnosia generally fixes the problem. \n\nThe fact that your girlfriend, someone who is supposed to love you and stick by you when you are injured or sick, is not only mad at you but refusing to see reason, shows poor maturity and a very self-centered view of the world. Your condition has nothing to do with her and is not something you can control or cure. She needs to grow up a bit and realise that this isn't about her and that how much you love someone doesn't affect if you can recognise them. \n\nIt is about how long you have known them and how well you have committed many other details about them to memory. People without prosopagnosia have brains that don't really need to worry about all the other details about people, so it takes active training to learn how to not only pay attention to these things, but to also call on these details in a quick enough fashion to be functional day to day. You will learn these tricks and you will be able to function, but it will not be like before. \n\nLiving with prosopagnosia is a very weird feeling and can be very isolating, especially if you're newly diagnosed. Take the time you need to process your own feelings and surround yourself with people who support you. Take some space from your girlfriend and let her, too, process her own feelings on this situation. If she is too immature or insecure to handle it, you don't need her around you right now. If she can swallow her pride and realise that she is lashing out due to stress and fear for the future, she will come back to you and give you proper support. \n\nBest of wishes for your recovery. TBI's are hard.", "NTA and dump her childish, unsympathetic ass.", "NTA, my girlfriend of a year left me after I had a pretty big injury, I was a wreck, it's awful to feel unsupported. I know the feeling although a diff circumstance.", "wake up and breakup!", "I'm sorry you're going through this. She sucks. And it's lazy AF, if she didn't read what you sent her. I hate people who make other's medical issues all about them. \n\nThat being said she hasn't visited you in 2 weeks? You're better off with out her bullshit. \n\nGood luck and get well soon", "NTA. 21F here & she’s extremely immature. that’s not a normal adult reaction. get well soon!", "NTA. As a person with an invisible disability, I can tell you that some people will never believe you are disabled because they cant \"see it\" and they believe that if you just tried harder you would be able to perform. Dont let that BS and those trash people let you internalize those toxic ideas. Your brain not functioning like it was is out of your control. I would be straight with her and say this is what life is like with me now, if you cant handle it and be a support, I cant have you in my life anymore.", "NTA. Dump her. Who wants to put up with this kind of BS forever? Sorry she was so awful to you.", "You didn't forget her face because she wasn't important to you, you forgot her face because brains are weird, squishy computers. And, upon being damaged, random information gets deleted from the system depending on where it gets injured. Neither the brain injury nor the brain chooses what goes. What gets damaged gets damaged.\n\nNone of this, of course, I need to be telling you. You already know. But it's to solidify you're NTA\n\nI struggle with faces. I was once talking with a customer, turned to look at something for three seconds, and then turned back to her and just....lost her? Despite the fact she literally hadn't moved from in front of me. She looked at me confusion when I started swiveling my head around, wondering where she was. Lady had to awkwardly put her hand up as a 'hey, I'm right here'. Whoops.", "NTA. Don't worry about her right now. Just take care of yourself and heal. I'm sure she was very worried and confused by the whole situation, but she needs to educate herself, because you are a little bit busy right now. \n\nI wish you a speedy recovery.", "NTA. Sorry you had a TBI and learned that you don't have a caring gf, but a self-centered one instead. This relationship has no future.", "NTA. She seems very immature - either that, or she has a dangerously low IQ.", "I developed stress induced memory issues while working in my late 30s, in a very public facing customer service job. It took a little while but my best coping mechanism was to gesture to my non functioning brain and say,  my hardware isn't loading properly \"remind me who you are again? \"\n\nThe silliness of this makes it less embarrassing. \n\nNTA.  Your friend is ableist.  Her problem is a her problem,  not a you problem.", "NTA. Would she have also been upset if you broke both legs and you didn't stand up to give her a hug when she came in?", "NTA and I hope you can recognize that she is narcissistic jerk that only cares about her own feelings", "NTA\n\n“Leave me alone and go home” is as nice as she deserved. I’m sorry you’re having to deal with a TBI. That’s a rough plot twist life has thrown you. \n\nOne day you’ll be healed enough to again support others. Right now you need only people around you who can help you.", "NTA of course.\n\nImagine you became blind and came to visit you at the hospital. Would she be angry at you for not noticing her new haircut? I guess not.\n\nThat's the same thing with your condition. You have a medical condition that makes you physically unable to recognize people, while it is difficult for others to understand how it is even possible, the fact is that it happens. You are the victim here, not her.\n\nThere are visual impairment simulators to let people experience what it's like to be legally blind (and it's absolutely terrifying, I recommend trying it once) but so far nothing for your condition yet. \n\nIt will happen, we already have the technology to apply realistic face filters in real time already so if there is money thrown that way, one day we will have glasses/vr headsets that makes everyone's face look the same so people can experience what it's like to have your condition.", "NTA. If she was in hospital with a broken leg would you be mad if she didn't want to go hiking?", "NTA. I have partial facial blindness in that II don’t always recognize people until I am better acquainted and see them fairly frequently. It is difficult and embarrassing. It is a obvious your girlfriend needs to learn more and currently is taking something personally that isn’t. If she is important to you I would suggest having some meetings with your doctor where he might help explain things to her.", "NTA and I suspect she is looking for a \"polite \" way of this relationship. This is probably the start of \" we just fight all the time \"", "Stay strong , brother!\nI experience something similar but on a lesser degree developed from/in tandem with my psychosis. I recovered from psychosis about 95% but the some of the wiring is still messy up there.\n Just this November I have had an incident in which I walked into my nursing course classroom and promptly didn't recognize none of *ALL 25* of my classmates and I've been in the same classroom and spoke with these women for nearly 2 months at that point. I quickly panicked and walked right out until I met someone I could recognize by hairstyle to reassure me that I indeed walked in the right classroom.\nIt makes you feel so alien and alone when that happens and I can imagine for you, who has it worse that I do, is very painful to experience. \nYou're NTA, it's not your fault your girlfriend decided to make a whole song and dance about her insecurity in your hospital room after a TBI of all things. You are in a vulnerable position and she hasn't even extended the little bit of grace to wait for you to be out of the hospital to air out her grievances and/or try to understand your condition clearly. Where is *her* care in all of this?\nWhen my partner complain of an ailment that I do not know of I look it up either in my textbooks   or ask family members who are also nurses to learn how to aid them best, not throw a fit about how their suffering makes me feel personally. \nAlso , the nerve to ask you to apologize for an assumption she has made all by herself that hurt her own feelings. Wow. \nPlease reconsider this relationship going forward, OP.", "NTA. Your GF has main character syndrome and is an idiot to boot. Insensitive, immature, unfeeling...", "INFO: Is it possible that your girlfriend is stupid and does not understand you have a medical condition?", "NTA not at all. \nAlso the podcast Stuff You Should Know actually did an episode on this not to long ago. I highly recommend it. It talks about what people who suffer from this have to do to recognize the people they care about.", "I just have one question. How did you type this😟", "Omg this is so interesting. Years ago (almost 20) i saw a documentary on TV about this condition(?) and i remember the way they portrayed the \"face blindness\" was by blurring people's faces. Is this somewhat accurate? When you take a picture of someone are you able to match the persons face in the pic to the face irl?", "He's not blind. He didn't lose his eyesight or motor skills.\n\nHe had a brain injury that affected his ability to remember faces. It didn't affect his ability to type.\n\nAlso even if he were blind, blind people use text to speech and screen readers.", "Face blindness is simply a condition that means someone struggles to recognise faces - it ranges from mild to severe.\n\nIt doesn't impact on vision and other types of recognition at all -   so a person with prosopagnosia can see just as well as anyone else,  but just won't recognise people.\n\nI have it myself (relatively mildly..) and i've learned how to compensate to a fairly high degree.\n\nI notice details that others don't,  and i recognise people because of the details.\n\nFor example; my sister is super easy because she has multiple piercings..  a distinct gait,  a specific clothing style,  and a nice bright red, short hair style.    I always recognise her.\n\nMy mother is more difficult -  she dresses pretty much identically to many women of her age..    her hair is the same as many women her age,  and it's in a style that covers her ears and partially obscures her jawline.\n\nI don't always recognise her if i bump into her when i'm out.\n\nMen are generally easier for me because their appearance doesn't tend to change much on a day by day basis.   They tend to have short hair,  so i can recognise people by things like the shape of their jaw..  their hair style and hairline.  Their ears,  nose,  eyes etc.\n\nWomen are more difficult due to changing hair cuts and colours..  styles -  makeup etc.  Their hair often obscures the ears or some of the jaw.", "Your girlfriend made it all about her instead of you. Of course it hurts when someone you love cannot recognise you but there is a very valid reason for it. I wish you well and hope you will be able to focus on yourself and your health.", "I had a teacher with prosopagnosia, and based on what she told us it should get easier. Over time you’ll likely get better at recognizing people by other things such as their voice, specific clothing items or their general fashion style. I second the idea of giving your gf a piece of jewelry (I’d suggest a necklace) to recognize her easier.\n\nMy teacher told a story about how her best friend pranked her once by dressing like one of their professors and pretending to be them, which worked. So she was able to recognize people by their general fashion style.", "I wish you the best with it. I have face blindness of medium severity and I have learned/adapted well enough to sell product in a role where I have (financial incentive) to remember faces/names/orders. While the problems with context are really hard (someone running into you in an environment where you don't normally see them will just wreck your ability to recognize them probably), at this point I can recognize people at a two city block distance. And I'm half blind with myopia! When you can't recognize the faces you will quickly find yourself picking out how they walk, their posture, and the specific sound their keys make in their pocket - weird little things that confidently tell you at great distance \"that's my family/spouse/friend!\". So... I can't say I recommend face blindness, the confusion has been pretty hilarious in the past and I've had to learn subtle ways to ask how I know you, but weirdly I can recognize my customers and friends better than a person with good eyesight and without face blindness.\n\nIt's also wild, because it definitely a learned and trained skill. I'm better at it than I used to be. And it can benefit you in weird ways, people rely on their facial ability and movies/show etc think that's the only way to recognize someone so you find yourself in situations where you're so confused how everyone else *doesn't* recognize that one character and you realize that their identity has been obscured.... to someone who can read faces.\n\nSo I guess I mean to say, there's no cure, but with learning you do really recognize people *almost* as fast, and in some ways more thoroughly. Though it does kind of freak people out when they ask how you know it's them and you call out the way they pat their right front jean pocket every third/fourth step and twist their heels back and forth when standing in place.", "Fear is a strange thing. Sometimes it looks like fear, but sometimes it kinda doesn't. Anger is a pretty common manifestation actually (makes up the \"fight\" part of \"fight or flight\"). So the fact that she seemed angry isn't really a disqualification, and could actually support the idea she's scared.\n\nThat's still not your problem. You have more than enough on your plate and she needs to be handling her own emotional response (whatever it may be) in a much more mature way. So I don't mean to make excuses for her shit, it's inexcusable either way. Just something to think about, do what you will with the information.\n\nI'm sorry this happened to you and I can only imagine how hard it must be. I wish you a speedy recovery from the things that applies to, and lots of love and support to cope with the things it doesn't apply to. You can do this.", "I'm pretty sure I struggle with face-blindness too, because I really really cannot remember people by their face unless I see them every single week for months. It impacts me at work, because a customer can walk back in five minutes later and their face won't click for me at all. It's like I'm seeing them for the first time. \n\nAnd you're totally right - it's just become normal for me to try and find strategies to figure out who a person is without needing to ask. Because people do get offended, no matter how good of a reason you have for not remembering them. Everyone's the main character in their own story, and they get *super* mad when you remind them - even unintentionally - that not everyone sees them that way.", "I went to a Thanksgiving party several years ago where there was also an elderly politician.  It was fascinating to watch - he greeted absolutely everyone in the room with \"nice seeing you.\"  That gave him time to try to place people/maybe get vocal cues.\n\n OP, I hope your GF takes the time to understand what you're going through.  If you haven't already, this [Oliver Sacks](https://www.newyorker.com/magazine/2010/08/30/face-blind) article in the New Yorker could help, although if she refuses to read anything there's not much you can do.  NTA, and I wish you well.", "Isn’t this also something to do w ADHD? Because I get anxious when it comes to starting a job or class or making friends because I fear I won’t be able to recognize them unless I am w them for a long time because I start to only recognize them at work or class but never in the ‘outside’ world", "I have this, too, and in fact I get so anxious about it that even when I'm pretty sure I know who someone is, my anxiety will interrupt \"ARE YOU SURE?????\"   And I fully agree-- people are SO OFFENDED when you don't remember them, it's just terrible.  So yes, learn all kinds of strategies to try and tease out who they are, it's the only way.", "NTA. You may need a new girlfriend to go with your new diagnosis, really just my way of saying that she may need to go. You just had a life-changing thing happen to you that you are still coming to grips with and even took the time to send her articles about it while still in hospital? You sound like a great person and you should know your value, find someone who understands and is willing to accommodate you. Surely if someone cared enough about you they would make an effort to understand your condition and down the line maybe find a way to make themselves easily identifiable to you.", "NTA\n\nYou don't have to apologise for something you can't help. Your girlfriend was the ah, no one just walks into a hospital room and doesn't say anything, she was just trying to test if you would recognise her face. Which she'd been warned you wouldn't.  Face blindness doesn't work that way. An old client of mine suffered from face blindness, he struggled to recognise his family or close friends but recognised me whenever he met me in the street. His wife was always astounded as he couldn't even recognise his own children's faces. It doesn't even go by how much you care about someone, on rare occasions random faces just click. You can't control that so NTA.", "Um NTA for failing to recognise her but big time YTA for not offering a simple apology. \n\nTBIs can impair your ability to empathise with others, it’s okay to understand that your GF is also a victim of this situation and having you not recognise her is going to be devastating. A simple apology and touch of empathy would cost you literally nothing.", "NTA, she is 1000% out of line. You have literally fucking brain injury, you didn't choose to forget her. You explained the situation and she refused to be understanding. I get that she was upset, I would be too if my partner didn't recognise me, but I'd just be glad that they're alive and well enough to speak to me at all.", "NTA you literally can’t control it.", "This is not how a loving and caring partner reacts. How they make a crisis about them is a red flag. You're worth more, so the least she has to do is a sincere apology after educating herself about your condition. NTA.", "NTA, if you have a gf who manages to even make an illness of you about herself and her stupid drama seeking then maybe you are better off with no girlfriend. Thats a huge red flag tbh.\n\nI hope you feel ok and can leave the hospital soon.", "NTA— your girlfriend clearly didn’t read anything you sent. You’re in a literal hospital and she’s upset over something you can’t control. If anyone is the AH it’s her.\n\nBest wishes, homie, wishing you the best.", "NTA, you can't help your condition, but she can help not looking into it to help her understand what you're going through.", "NTA. If you explained your situation to her & helped educate her, she may have been a little upset (a shocked feeling since it’s the first time) but definitely should have been more upset about you being in the hospital than concerned about any apology towards her.", "Really sorry to you’re going through this and hope you have a speedy recovery.\n\nNTA. \n\nSorry, she should be more sympathetic but has made it about herself. Sadly, you will need someone more supportive going forward with the challenges you will experience with prosopagnosia, so I hope she steps up.", "NTA This is not the girl for you. She's is making your life changing injury all about herself. Tell her goodbye, you cannot stay with such a self centered person.", "She’s either an idiot or a narcissist.  Not a good sign either way.  NTA", "NTA. M", "NTA. I have face blindness and it will get easier. The part of your brain that recognises object shapes will grow more adept at doing photo fits, you will learn how to subtly question in conversations to get context clues, “how are you? How’s the family? How are things going?” and you will start identifying people by other things such as clothes, voice, gait etc.\n\nSometimes you will be caught out. I’ve walked past my husband in the street, lost my mum in a shop (as an adult) and cried when she came to collect me from school because she got a haircut and I thought she hadn’t shown up.\n\nYou will get there. Your girlfriend may or may not adapt, but that’s a her problem not yours.", "Omg NTA. Your girlfriend is so insensitive, dismissive, and self-centered. You’re suffering, literally in the hospital and she comes in there crying over her own ego.", "NTA, and it doesn’t seem like this relationship will survive your TBI. \n\nI’d take some space from her before her unregulated and uncontrolled  emotions make your recovery more difficult than it needs to be.", "NTA. She is too immature to be in a relationship with this type of special condition", "NTA\n\n>she started crying about how that means she wasn’t important enough to recognize\n\nyour medical condition isn't about her, it's not a matter of being 'important enough' and her attitude on this is incredibly gross. Why is she making this about her? \n\n&#x200B;\n\n>She got upset at me for not apologizing to her\n\nwhat, exactly, is she expecting you to apologize for? Having a newly developed medical condition? not recognizing her because of said aforementioned medical condition - that you warned her of ahead of time? fuck that, the only one owed an apology here is you for her shitty attitude. \n\nagain, I ask: why is she making this about her?", "NTA\n\nShe should have read up on your condition \n\nHope you're feeling better", "Your girlfriend is an idiot and selfish. You just had a life threatening accident and all she could think of first is you weren't able to recognize here? Wasn't that here cue that you aren't in good health?", "NTA", "NTA", "NTA.  Some people are so sheltered they do not realize actually medical issues.  There is absolutely nothing you did wrong, or you could have done differently.  You even prefaced the interaction to explain the issue.  She literally just thinks she is SO special, that it somehow transcends medical issues.  She just has zero, absolutely none, zilch clue.", "NTA You need a new girlfriend. She's blaming you for a brain injury and making herself the victim.", "NTA…she is.  Tell her if she had bigger t$ts you might’ve remembered her.  😀", "NTA. If you'd developed deafness, would she be mad at you for not listening to her? If you'd literally gone blind, would she be upset that you couldn't see her?", "You really don't need somebody this self-absorbed, unfeeling and shallow in your life right now. NTA", "NTA.op take break from relationship and take rest. I hope you get well soon .take all time to heal first", "NTA your girlfriend is stupid why are you dating her", "NTA. Your brain literally stopped working when it comes to facial recognition and it sounds like it was the first time you saw her since the tbi. If she read the info you provided and still doesn't get it, I would suggest having her watch the episode of Rizzoli and Isles where a witness to a crime has this condition. He discusses how he couldn't even recognize his mom at times even though she rarely changed hairstyle and clothing. It is a fictional show, but it was an interesting episode and maybe it will give her a different point of view on the situation. I think the episode is titled Face Value. I don't even think you should have to apologize. I mean, it sucks her feelings were hurt, but you did not intentionally do it.", "NTA you have TBI and she immediately flipped it to being about her. Ya it's painful to see from the loved ones view but she went immediately to it being a personal insult on her. As if you weren't dealing with enough as is.", "NTA is she a narcissist? You were in a time of need and she made it worse by only focusing on her. Sad.", "I have a form of prosopagnosia since birth and have had my whole life to develop strategies to recognize people. It has only really worked since I was about 25. It only works well for people I have known for decades. For people who acquire it by accident it is really hard. You explained it to her and sent articles. That you did not recognize her was not because she means nothing to you, but has a reason in the form of your diagnosed face blindness.\nI have had good experiences removing people who didn't want to understand from my life after I explained face blindness. This is not to say that you should break up with your girlfriend, but that you should be prepared for this to happen more often.\n\nNTA", "NTA. At all. Not even the slightest bit. You have absolutely no control over this. Your brain was damaged and you literally can’t control what it remembers. As someone who has also had a TBI (although it affects me in other ways), I understand what you’re going through and that you have to learn to cope. That’s hard to process and takes a major toll. Your gf owes you a major apology. She hasn’t taken any time to even try to understand how the affects you and alters your life. She’s making it all about her, when it should be about helping and supporting YOU!", "I have a TBI. It sucks. I now can’t look at a face without anxiety. I used to have the best memory for faces. Now people come up to say hi and I have to admit i dont remember. I say I have been hit in the head one too many times and people are cool. \n\nI’d give her her reaction. Honestly being told by the love of my life that they dont recognize me would be awful. That reaction should have been followed by a thousand apologies and kisses. Not a double down. \n\nNot all relationships can handle huge medical changes. Mine did. His was the first face I saw when waking up from my coma. I still didn’t realize who or where or what. He held on but it was really rough. Nta", "What is happening to you right now must be so scary and your gf was cruel to test that. She is not a nice person and I would have told her to go  too. Good luck got a speedy recovery x", "\"What do you mean you don't know who I am by looking at me! No i didn't read the articles about this exact thing I didn't care! This means I'm not important to you but me not even bothering to read up on your condition doesn't mean anything! I'm the victim here!\"\n\nLike for real, she wouldn't spend 10 minutes to understand the awful new condition you have but YOU'RE the one not committed to the relationship? NTA. I won't say reconsider the relationship but I doubt this will get better with time. I can already hear the \"you have been like this for a year and still don't know who I am instantly! I am so offended and hurt! How could you do this to me!?\"", "NTA.  I don't know how your girlfriend thought this would go amy other way. \n\nI hope you have a swift recovery surrounded by supportive friends and family who'll listen to you.", "NTA after an extreme illness I suffered from face blindness. You literally can’t help it. There is no “doing it on purpose” it just is. \n\nShe owes you an apology. Living with face blindness is awful. It’s stressful because if you get lost from your person at a huge event you can’t find them. I hope your situation gets better.", "NTA. By the way, I read a manga where the protagonist has the same condition as yours. I will link it [here.](https://mangadex.org/title/ee3b13ab-00ba-42ef-a544-165ce8879975/to-be-ordinary)", "I'm also confused, who visits someone in the hospital and doesn't say anything when entering the room? The least someone should say is \"hey, how are you doing?\"\nEntering and just standing there without saying anything is really rude when the person is awake.", "I have prospognosia and even when people are aware I have it, it’s common for them to take it personally when I visibly dont recognise them. I think it really can be very disarming to not be recognised by someone familiar to you. OPs still NTA, but his girlfriends reaction is common though", "TBI stands for Traumatic Brain Injury.", "I have a little bit of it, not that I can't tell the difference between faces, but more that I don't necessarily connect a face to an identity. So sometimes I have a few moments of \"I know this person ... but from where? Who are they? *processing processing* .... Oh, my cousin.\"\n\nI am looking forward to AR glasses. Face identification and putting names above people's heads would be a killer app for me, along with subtitles for what they say. I'm a little deaf, too. Auditory processing, not sensory organ deficiency, so hearing aids will not help.", "My mother has prosopagnosia and I have a problem remembering some faces. Can one be partially prosopamnesiac? Growing up I also had this doctor that refused to give me eyeglasses that covered my full prescription eg I had -2 and the glasses were -1, -4 had -2,5 at one point, fun. So I mainly recognized people by their body shape, hair, and the way they moved. People have years to learn coping mechanisms, your injury is so recent, I have no words for your girlfriend.", "Take a subject you never learned about, like trains. Someone that loves trains will instantly recognize different models of trains, you on the otherhand see a train.\n\nThat experience, but no matter what you do you'll never able to pick up the differences for the different models.", "I had a good friend who got a TBI after being mugged. He ended up in the hospital via Life Flight and had emergency brain surgery followed by months of recovery. His girlfiend showed up and started tearing into him about how awful he was for not answering her phone calls while he was in the hospital UNCONSCIOUS.\n\nWhen people make your trauma about them, it's not a good sign. NTA", "Yeah it seems like she had some romantic idea of you being able to recognise her despite your injury and then got offended when you didn't. That's a pretty egregious example of someone making something all about them. Other people have suggested buying her a necklace so you can recognise her but, honestly, she seems completely self absorbed so maybe it's better that you forget her altogether. If she's this selfish I can't imagine her being supportive and that's not going to make your recovery any easier.", "If she was mad then she probably sucks as stated below.  Very sorry :(", "I can definitely imagine how upsetting it would be for someone you love not to recognize you, but that seems like the sort of thing that you talk through, probably with plenty of kleenex because it’s painful all around!\n\nNo point in getting angry; it simply can’t be helped!\n\nIf she can’t get over herself enough to mend this breach between you, then you definitely deserve better!", "Ohhh okay", "Mate! Hey mate ! How ya been mate ! What's happening mate ! Mmmmaaaaaatttttteeeeeeyyyyyy!\n\nstory of my life lol", "and my faith in humanity keep going down .... Seriously what's wrong with people. How can they be offended when someone if going through medical issues??? \n\nLike if my friend got paralyzed , and cannot go to our planned hiking trip, why the FUCK would i be offended???  How selfish does somebody have to be to make someone's illness about themselves. \n\nsorry to ramble but i am seriously seriously seriously pissed off in people.", "Absolutely NTA you have a medical condition she could of Been more acceptable to this", "Nope, it a new situation for everyone involved, it's not even something we can imagine living. So her actions right now aren't telling anything, just that she is a young person dealing with new stuff. \nWe should be that judgemental with scenarios we can't even imagine", "or a gorilla mask. like full on over her head. that would make her stick out no doubt.\n\nor he could write \"this is your ex gf\" on her forehead.\n\n\nNTA. not in the slightest. I'm sorry for what you're going through OP and I hope with time you can find your new normal. You're doing amazing already 💖", "Look up prosopagnosia. Many of the examples in this thread are about that rather than prosopamnesia.", "Im certain I have a mild form. Im awful with people I don’t know well, and need context like the work place to recognize people. \n\nBut man do I have a talent for vague BS conversation", "There is an aspect of ADHD that makes facial recognition difficult for some. A bit different from OPs situation as we just seem to store them in our short term memory whereas OP seems to not even 'see' a face.", "Several of my autistic friends struggle with it, so I'm used to it and don't take offence. One struggles even with her own kids, if she didn't know they would be there.  She recognises me because of my accent.  One time I was at a function she facilitated, with my kids, and my husband was there as a support worker. She looked at the sign in sheet and noticed his unique name. \"Oh look, Mr. Popchex, just like yours!\" I said \"It is mine!\" and she looked at him again and recognised him that time. She had no idea he was bringing his client to the group so he was just another random bearded guy. lol", "Sensory perception disorder can effect audio, visual, taste texture etc. I have severe audio issues and some visual issues, including recognizing people, especially out of their environment. SPD can often be found in sufferers of ADHD and autism. I realised my grandaughter was at the very least SPD, when she was still a baby, but at 4 she has just been diagnosed ADHD and autistic.", "I describe it as like learning to identify dolphins in a pod. You can do it given enough time and exposure to them, but it takes effort. And if you see dolphins at another beach, you probably wouldn't be sure it was them or a different pod. Unless the dolphins showed excitement at seeing you in which case it probably is them! \n\nBUT maybe they're just excited at seeing someone behind you :(", "NTA I also have propognasia and it is frustrating af. I have ignored family members because I wasnt \"prepared\" to see them and therefore didnt recognize them. I dont recognize most people unless I am seeing them on a daily basis over a long period. \n\nYour girlfriend is extremely selfish in this, and probably went into each article with a heavy bias of how important she is each day. It doesnt mean she isn't important, its that she isnt a family member you grew up with. \n\nI hope she can learn more about what you are dealing with and come around for your sake. Best wishes going forward.", "I am literally better at recognising casual aquaintances from the back of their heads than from their faces. I don't even have severe prosopagnosia. You did everything you could to prepare your GF. NTA", "NTA", "NTA -I’m sorry about your injury and wish you the best of luck for a speedy and thorough recovery! Unfortunately, I agree with all the “dump her“ comments. Seems like she couldn’t be bothered to read what you sent her, nor is she willing to even listen to reason. If she really cares, her main concern should be your injury and your recovery, not how it affects her.      \nShe can’t even be bothered to learn that this is something you have zero control over? nope…", "NTA but she might be….", "NTA", "NTA. A classic case of superiority complex. I bet she expected the romantic, cinematic outcome where you would instantly recognize her out of all people because she is so special and all that stuff - not saying you don’t care about her, of course. But she made your condition all about herself, which is never okay.", "Kick her to the curb, for real. She's selfish and you don't need that. Take care of yourself. You have your entire life to find a compassionate and understanding partner.", "NTA. I think she at least partially read the info because this sounds like she was testing you. \n\nKinda like \"let's see if he really can't recognise me\". Which is really immature of her.\n\nI don't know if I could be with someone who makes even such horrible situations for you about herself. I'd dump that cow tbh.", "nta", "NTA. Ditch her. At the first chance, she made your physical trauma about her. She wont be a positive influence on your life or any potential recovery.", "Sooo NTA. If she really cared about you, she would have taken the time to read up on TBI. You made it easy by providing links to information and she couldn’t even be bothered. Considering everything you are going through right now, I’m outraged she tried to make it about herself. You’re the one who is owed an apology. \n\nGood luck with your recovery.", "If you had both your arms and legs amputated would you be the AH for not running over to her and giving her a big hug?  Of course you wouldn't. \n\nNTA for not recognising her. You were simply not able to.", "Ah, yes, because your injury is all about her. Damn.\n\nIf you had become blind, would she be upset that she was not important enough to see? It's roughly the same thing.\n\nNTA, obviously, and my best wishes for your recovery.", "This girl aint the one son. NTA", "Uggh. I’m sorry this happened to you. I have this and people who I’ve met a dozen times are NOT amused when I don’t recognize them. It’s a condition that many people don’t seem to want to believe exists.", "NTA. I hate when people put unnecessary stress on someone who’s already going through so much. \n\nMy grandma has late stage dementia and I hate it when people visit and ask her, “do you remember me/him/her”. Especially if it’s a lot of people at once because it overwhelms her sometimes, and she’s already going through so much so why stress her more.", "Sounds like you are dating a narcissist", "NTA", ">If she had read my explanation I texted her or the articles I sent she   \nwould understand that my ability to recognize her has nothing to do with  \n my care for her.\n\n&#x200B;\n\nNTA.\n\nIf she had cared enough to read...\n\nWell done for refusing to apologise for something that isn't your fault.", "NTA.  I hope your girlfriend reads this thread.  Imagine having a TBI and your SO gets furious with you and internalizes her own insecurity because you can't recognize her face solely due to the TBI.  At a time when your life is in limbo and you are still recovering from the immediate injuries, she decides that the only thing that matters is that you recognize her.  Slow clap, girl.  Way to waive those red flags.", "NTA, is she stupid or something? You have a medically proven issue and have face blindness, that's a fully legitimate syndrome.\n\n&#x200B;\n\nGirlfriends watched to many rom-coms thinking that the power of \"true love\" can overcome an fucking serious medical conditions just like that.", "NTA\n\nI think her response was natural though. She may have known it was possible this would happen but maybe in the back of her mind she thought that you really would recognize her and when you didn't, she got upset and hurt.\n\nBut, there should have been a mature conversation about the situation between both of you and most likely you could've moved on from it. She should've apologized for her comment about not being important enough. She knew this was coming but still didn't give you the benefit of the doubt.\n\nI know it's not the same, but my father has dementia. Fairly early to middle stages but I know there will come a time where he no longer recognizes me. I know it won't be his fault but when that time comes, it will still hurt and I will still be upset. But I would never blame it on him and be angry with him. I'll just be angry at the situation.\n\nI hope you recover quickly and get better soon.", "NTA.  Try to focus on yourself, as you have greater needs that assuaging your gf's ego.  Best of luck in healing.", "NTA. I really hope you get better but she sounds awful. I'm so sorry you had to deal with that on top of everything else!", "You are very much so NTA. \n\nWhat a shitty response from your gf. I hope she came back with a genuine apology and an empathetic attitude. And if not, I hope she had the decency to keep walking and walk on out of your life because you do not need that kind of bad juju.", "NTA. I once did not recognize my partner of several years when we met at the designated spot at the designated hour where I was supposed to pick him up. Fortunately he had a good laugh about it, following me and saying, \"Hey, are we still waiting to pick up your other boyfriend?\" (He's cute. I don't always recognize him, but he's cute.)", "Wow so she visits you just to make it all about her what a red flag 🚩", "NTA. You have nothing to apologize for. She’s the one who didn’t “do the homework”. She didn’t read up to prepare herself. She assumed she was significant enough to have made an impact. Then she was *shocked pikachu face* when you didn’t recognize her.", "NTA. Your girlfriend is acting seriously immature, I think that for some reason when our loved ones are ill we make it about ourselves• Her behavior was so disrespectful to you. She should seriously be embarrassed. I am glad to you sent away. You were right. I am glad you sent her away. I wish you a cure and a speedy recovery.", "leave her, she's emotionally abusing u", "NTA", "NTA.  \nRidiculous, imo. My mother just suffered a bad UTI a few weeks ago and it presented as dementia (which surprisingly is a thing..) and she did not know who me or my step dad were. Neither of us were mad at my mother, we understood she was sick and were so glad when it cleared up.  \nThe fact that your girlfriend made it about her is a huge red flag, honestly... She owes YOU an apology, not the other way around.  \nI hope you're feeling better tho, OP?", "NTA\n\nAs someone who has a much milder form of face blindness, this is not something in your control, so you don't need to apologize for it. What she did was just as bad as getting mad at someone born blind for not being able to sort M&Ms by colour, or someone in a wheelchair not being able to climb the stairs to visit you in a third story walk-up.", "NTA but honestly I would just ditch her after that. So not worth the hassle at your age dealing with someone like her.", "NTA\n\nI've been faceblind my entire life and I once failed to recognise my older brother after he got a dramatic haircut. Despite knowing he was present, and eliminating all possibilities but one, so I *knew* that this guy with the white-blond crewcut (previously shoulder-length gold ringlets) had to be him, I still had to (very anxiously) take him aside and ask before I could be sure. He of course knows my condition so took it fine.\n\nI can only imagine what it must be like to have acquired this condition suddenly, and to be unable to recognise faces that you've always known. You will learn to recognise people, it'll just be harder and take longer because you'll be relying on other things besides their faces.\n\nFaceblindness is often hard for people to comprehend but if you'd told her about it before then that's on her for not making any effort to understand before she visited you, or being prepared to be patient with a person who was recovering from a TBI.\n\nHonestly the way you describe it sounds like she wanted to make this about her instead of you. But maybe I'm being overly judgemental - I wasn't there.\n\nPeople can conflate recognising a face with remembering a person to some extent. I sometimes find it useful to compare it to actual blindness (of course faceblindness is a much less far-reaching disability, but I find it a useful analogy sometimes.) If you'd lost your sight, of course you'd learn to recognise her by cues like voice, but would she expect you to *immediately* do so without any mistakes or hesitation, while you were still adjusting?\n\nI'm prepared for new people sometimes to be offended about it, or incredulous (I've learned to tell when someone simply doesn't believe \"faceblindness\" is a real condition and drop the Latin name on them) and I don't hold initial reactions against people as long as they come round, but when it's your girlfriend who is visiting you for the first time after a life-changing injury and has been pre-warned, this is pretty inexcusable.", "NTA, and she’s shown you the type of person she is. I’d be seriously reconsidering the relationship.", "Your girlfriend turned your incident into something about them when you already linked articles out of love explaining that condition. They're being really self centered.", "NTA. Are you sure you want to live your life with someone like this? She just made your condition about herself.", "NTA. Sorry but my first thought after reading is your gf sounds dumb. Not everything is about her and this is not a test of how strong your relationship is. You need to focus on you.", "NTA\n\nI'm so sorry she ignored your condition and made herself out to be the victim instead of supporting you in this hard time. I hope she realises her mistake and makes it up to you.\n\nGood luck with everything.", "Bro you literally had a tbi and can't remember people and the first thing your gf does is make it about her? Please for the love of humanity leave that woman.", "This is an immature response to her expectations not meeting reality. Some people really think that love conquers all, including a serious brain injury. \n\nYou’re NTA. I want to believe your gf isn’t either, but any adult who engages in this level of magical thinking about their self-importance needs a red flag and a reality check.", "Dude .. so sorry to hear you’re suffering from this ..really hope you you have a quick and smooth recovery … defo NTA - she clearly thinks it’s psychological only and dependant on some arbitrary level of importance.. absolute BS … she owes you a massive apology for making this about her .. or you’re better off without her because clearly if you have another medical issue in the future she ain’t gonna help the way it’s needed", ">She insisted on visiting me since she hadn’t seen me since I was hospitalized.\n\nNTA because you can't help it.  But this stuck out to me because it seems like if she cares so much she should have been visiting you.", "Have your doctor call her to explain it to her. NTA", "NTA\n\nYour girlfriend's role in this is to support you.\n\nNot throw a tantrum in the hospital when the thing you told her would happen (you can no longer recognize people by sight) happened. She should have talked to you when she entered the room or understood that your TBI is not personally directed at her. She's allowed to have her feelings hurt that you didn't recognize her, but it's completely unfair to voice that to you, especially when you're still in the hospital. Do not apologize to her.", "My grandfather completely forgot who my grandmother was. He would tell my mum 'you look like my wife. She hasn't visited me in a long time' while Nana was sitting right next to him.\nMy Nana understood that it wasn't his fault, and spent his final days holding his hand, and singing his favourite songs, even though he had no idea who she was.\n\nNTA OP. I hope you are doing ok.", "It's not about remembering *people*. It's just specifically faces. OP will remember everything else about their gf and their relationship (or if they have any amnesia as well that's not directly related to faceblindness.)\n\nThey just had to ask whether the person who'd walked in was that same person they were thinking about - much like you might if someone was wearing a mask, or if it was dark.", "He’s not blind.", "We can apply the same logic to the GF. By the sounds of what was written the problem stemmed from her not reading the information about it. Why should OP be the one to apologise when she didn't take the time to understand? What would that have cost her besides time? Surely if you care about someone you take the time to look into it beforehand.   \nIf both of them are victims why should OP be the one to apologise in this instance? Surely both should by the logic here", "It was a test to see if their love was strong enough to conquer all.", "Unfortunately you may need time now to focus on your recovery and you need supportive people around you making you the priority. It’s hard for her, but her pain doesn’t trump your issues", "Not the person you were asking but also faceblind. That might've been the same documentary I saw on TV (the date is about right) which was when I learned that this condition existed at all and that the difficulty I'd had all my life wasn't just a personal failing.\n\nI see faces as sharply as any other object, but I find it very hard to visualise a specific face and the differences between them are often so subtle.\n\nI can look at two faces side by side and with a conscious effort (it's actually easier if the cues I usually rely on to tell people apart aren't there because if they have different haircuts or something, my eye jumps to that) I can compare individual features and say e.g. that one has a longer nose.\n\nIt's a lot harder for me to say that two faces are the same, it's like a \"spot the differences\" picture where you can't find a difference - are there none or have you just not found them yet?", "I think that's reasonable in general and I understand why you've adopted that approach but the OP is in hospital recovering from a very recent traumatic brain injury!! He may have other difficulties functioning currently and even if he doesn't he hasn't had a lifetime of building up coping skills.\n\nHe might recover his facial recognition, he might not and need to find other ways of dealing with it but surely at the point where he is still in hospital and probably hasn't even figured out the full impact of his injury his friends and family should be giving him maximum support and understanding.\n\nIt's the ring theory - comfort in, dump out. The most affected person is supported and comforted by their closest circle and those people in turn should be supported and comforted by someone less close to the situation. His girlfriend can be upset he doesn't recognise her but she needs to suppress that while she's with OP and find another person not immediately involved to support her.", "Ah, the relationship test. No way this could possibly go wrong", "I forget customer's faces the second they're gone, unless there's something else memorable about them. I don't recognise some of my coworkers out of work when they're wearing casual clothes or change hairstyle or wear glasses. Once my boyfriend visited me at work unannounced to say goodbye and check in on me and I didn't recognise him for solid 10 seconds even though he said something to me and I stared at him, and that's because he was wearing an unusual shirt underneath and looked completely different in my eyes lol\n\nClark Kent disguise would totally work on me.\n\nI don't think I have face blindness though, I know for a fact I struggle with maintaining eye contact, so sometimes I'd \"look\" at people's faces, but not really. And I'm always miles away and lost in thoughts with my ADHD brain and just work on automode.", "I joke that I call everyone \"How are you today\"", "I know prosopagnosia, my mother has it. Coping mechanisms are the same. My issue is I look at the face and recognize the features - but out of sight, out of mind.", "There is such a thing as common decency. Yes, it might have come as a bit of a surprise but at the end of the day if you care about someone you DO NOT respond to them like that. Her initial reaction was to make it about herself. Her true colours are showing and they are far from pretty.", "Not sure about ADHD, but it's one of the possible symptoms for bipolar and schizophrenia.\n\nI have pretty bad prosopagnosia.  Like, \"I don't recognise myself in a mirror\" bad.  One of my coping strategies for meeting people out of context is to close my eyes (sorry, I'm half falling asleep here) or look away (ooh shiny) while they speak.  I find I'm good at placing voices.  I also find that it helps to tell people that I have prosopagnosia.  Some people will still be offended (obviously, or this post wouldn't exist), but most will be understanding - especially if you get them laughing.", "I don't agree with this. Yeah that could be the case, but she was also probably distraught and lashing out. Her reaction was not okay at all, but this thread likes to operate on assumptions.", "I think I have a bit of this. I really struggle to figure out who people are, out of context. Theres been times when  I met a friend of a friend, hung out with them on a three day trip, and then don't recognize them 4 days later. That just doesn't seem normal?\n\nWhen I worked in a shop half the time I couldn't recognise the person I was just serving.\n\nOn the flip side though, some peoples faces just really stick in my memory, not because they're particularly noteworthy, but my brain just seems to click on something. I wonder if that's how all faces are supposed to register.", "This is an ADHD thing??? Wow.\n\nI was diagnosed last year (in my 40s) and I've had known I has \"short term\" face blindness at least since my teens, I had NO IDEA they were related.\n\nMind absolutely blown.", "I have ADHD and can't recognize anyone. \n\nEspecially when they're removed from their normal environment. I saw a colleague at the grocery store and had no idea who she was. I had just spoken to her at her desk a few minutes before. Once she was at the grocery store her identity was erased. \n\nI can't recognize famous people or remember their names. That pisses people off for some reason. \n\nThere's actually one group of people I can reliably recognize, famous or not. But it's embarrassing and makes me wonder what it says about me that they're the exception.", "I think you are right. I once recognised someone by her earings, and realised I had been talking with her the day before. I didn't even know I had noticed the earings, they just jumped out at me the next day.", "\"Am I The Asshole for sneezing when I have a cold?\"\n\n\"Am I The Asshole for not cooking with a broken hand?\"\n\n\"Am I The Asshole for not going on walks with my partner after breaking my legs?\"\n\n\"Am I The Asshole for not responding to my GFs texts while I was in a coma?\" \n\nOP. Don't apologize for shit. You have a medical condition that she could have spent ten minutes to familiarize herself with before going into the hospital room. NTA", "NTA.\n\nOP, I have a loved one with a TBI. It’s frustrating and sometimes heartbreaking. But your girlfriend was unwilling to put absolutely any effort into understanding your illness. It would be like if she cried if you didn’t hug her after having your arms amputated. It’s not only cruel to you, it’s almost pathological behavior.\n\nI think it’s deeply concerning that your girlfriend doesn’t seem to care that you have a serious disability, and tries to make you feel bad about it. I would honestly strongly reconsider staying in this relationship. I don’t think she’s likely to get better, and there’s an aspect of this that’s almost abusive.", "NTA, what? \nShe sounds immature af, my poor friend.", "Uhm, when I had a TBI I didn’t recognize my own *mother*. NTA", "As someone who remembers every single person I've ever met in my damn life and has to remind herself that just because I remember the one interaction we had 7 years ago, it doesn't mean they do... I can't even imagine what it's like to *not* recognize someone, especially if it's something you're dealing with freshly. It must be hell.\n\nBut NTA. You told her already what was happening. Her feelings about it may be valid (because even if she knows logically that it's not your fault, she can't control the way it feels), but to pile that on you when you're already struggling is just wrong.", "NTA whatsoever. I can understand it's upsetting to not be recognised by someone you love, and especially the first time it happens because then it's real. But it isn't personal, it's literally a condition you have and are finding extremely difficult. Now is a time for all your loved ones to support you, not cause you more stress or worry. You shouldn't have to feel guilty for upsetting someone who should understand that it's not personal and has no bearing on your feelings for her. She's being selfish. I'm sorry you're going through such a difficult time, I hope you can recover from things as much as possible, and adapt and come to a good place with anything that stays with you.", "I wish I had known years ago that this was a real phenomenon. I can recognize people most of the time when we're all doing normal activities,  but if I run into someone I know out of the context I normally see them in, I'm lost. I didn't recognize my own father once, but was able to cover because I was dealing with a toddler meltdown at the time.\n\nPeople don't get it. I think there's an element of \"I know you have this problem, but surely I'm too important in your life for it to affect me.\"  I hope your gf can educate herself enough to help you through this. If not, she's not the right person for you. \n\nI hope your healing is steady and uneventful.", "NTA. Your GF had some Nicholas Sparks fantasy of coming to your room and being the ONLY one you could recognize, because true love or whatever. She didn’t stop to consider your injury and its complications, or how they affect you and your life now. She only thought about herself during your time of need.", "Geez, dude, NTA at all. I’m so sorry you’re dealing with all this. \n\nI have genetic prosopagnosia, so it’s been a life-long issue. Yes, it often makes people angry and offended because (1) They’ve never heard of such a thing and don’t understand it, (2) They think you’re lying, (3) They don’t think you’re lying but feel unimportant because you don’t recognize them. \n\nMaybe things will get better after your gf has had a little more time to wrap her head around all the changes. Good luck to you.", "NTA\n\nIt’s the same as asking a blind person to apologize for not seeing you, or asking a deaf person to apologize for not hearing you…utterly ludicrous.", "NTA,  is there a subReddit for prosopagnosia, or maybe a support group?", "NTA at all! I hope that you can work it out with your girlfriend, but it is rather hurtful that she didn't actually seem to either read or truly understand the literature you sent her.\n\nThere's a podcast episode from \"Stuff You Should Know\" about face blindness that not only explains what it is but they also talk about how common it actually is and how some celebrities (like Brad Pitt) have it, but many pretend to not have it and develop coping mechanisms because people behave very negatively to not being recognized. Perhaps that could be a good resource in the future for people close to you and maybe yourself since it may help you not feel as alone?\n\nI'm so sorry that this happened to you and I wish you a speedy recovery.", "NTA OP.", "NTA. You told her you couldn't recognize her because of your TBI. You prepared her for this. She failed to read the explanation and articles, or apparently thought she was that memorable when she wasn't. She owes you an apology for making it all about her.", "NTA. No matter how upsetting it was for her, and yeah, it probably was upsetting, its *worse* for you. And she's too selfish to see that.", "NTA.  \n\nWOW.  Just Wow.  I have never heard something so selfish in my life.  That is so disgusting, that when she finally gets to see you, she gets mad at you about a medical condition you already explained.  \n\nThat is the rudest, most disrespectful, uncaring thing I have ever read.  \n\nMove on my man, take care of you.  If she loved you, she would have reacted with a lot more care and compassion and not blame a man in the hospital for her own issues.", "NTA.  I did speech-language therapy with TBI survivors for decades.  Your condition is not really common, but it definitely is real and it's caused by damage to the brain.  I've seen family members try to minimize my client's problems and say \"If they just tried harder, they could do this,\" or \"He/she is a quitter, they aren't trying.\"  The only thing that seemed to sway them was for the client's neurologist or neurosurgeon to sit them down and talk to them.  My clients with prosopagnosia usually relied on recognizing voices to identify people, even close family members.", "Nta. She took your medical emergency and made it about her...yikes. I understand it would be painful to not be remembered. Watching my grandma with dementia not remembering my mom tore her apart. But you just re-introduce yourself and cry later. No need to apologize for something you can't control. Have her sit in with the doctors, nurses, specialist to ask questions and hear from them about what is going on and how to manage and work with you. Maybe they have resources for her to get some support and learn how to work with your new diagnosis to ease her pain, too. Y'all can work through it but you have to support each other in it.", "NTA. She wasn't concerned/interested enough to investigate the materials sent, and wants to play victim because she didn't? That's very inappropriate, and the apology should be coming from her.\n\nBest wishes for a successful recovery!", "NTA.  You have a medical condition that causes the issue.   WTF?  She sounds very self-absorbed.", "What a self-centered asshole.\n\nIs she not capable of compassion and empathy? It's honestly disgusting that she comes to visit you for the first time after your accident and the only fucking thing she can do is only think about herself. JFC how pathetic.\n\nNTA", "NTA. I have congenital prosopagnosia and it's been 36 years of this happening. I've walked past siblings at places where I didn't expect to see them. I fretted over accidentally picking up the wrong nephew from daycare. I cannot tell any of the leading men in a Hallmark movie apart from each other. It sucks and it's not something that can be fixed. I use the same coping mechanisms as you. I remember voices, walk styles, glasses, air color, earrings, etc. My coworkers know to text me if they dye or cut their hair (or they don't because they think it's funny when I introduce myself to them, which is kind of is.) \n\nIf your girlfriend can't accept that it's not a matter of her importance, then she isn't going to be any support in the recovery process. Life isn't a Hallmark movie where a loved one inspires a miraculous recovery. (If it was, I wouldn't misrecognize my own mother sometimes.) She may be reacting out of worry about what the future looks like for you and her now, but that doesn't mean that she gets to make it about her feelings. Either she learns fast, or she can go find another storybook ending.\n\nAlso OP- feel free to DM me if you ever want to talk about prosopagnosia. It's rare, but it's so real.", "NTA \n\nHowever, it’s a hard situation and hardest on you for sure. \n\nThat said, what would an apology to your girl actually have cost you?", "NAH, even though you explained your condition I bet she was still in denial. This must be scary for her too and I can empathize with her getting upset at you not recognizing her. She needs time to process it.", "NTA.\n\nSerious injuries and diseases are a quick way to find out who's really willing to support you, aren't they?\n\nOn the other hand, it's also possible that like many people she just finds brain injuries disturbing and hard to deal with; good luck, either way.", "I have had prosopagnosia pretty much as long as I can remember but did not realize it till a few years ago that is what I had.  There are different levels and people always just thought I was in my own little world most of the time.  Now that I know what I have I read up and actually getting very good at picking up other markers mainly voice but my friends still mess with me when they happen to run into me at stores and such.  lol I do not mind but sometimes get creaped out till I realize who they are.  Watching TV shows especially before I realized what I had was always confusing so I mainly stuck to things like anime where everyone wears or has very distinct features.", "Wow. Definitely NTA. I can bet she didn’t even glance at those articles you sent her. That’s a shame. My husband suffered from a TBI after being hit by a car and had to relearn everything. That was almost 20 years ago. To this day, he still struggles with remembering things. Even as simple as a lighter. Or where he put his phone. \nI hope that things get better for you. And I hope you find someone who is understanding and willing to adapt to what you need. It’s a simple thing to do for the one you’re supposed to care for and love. Good luck and please don’t let anyone make you feel guilty for something that’s out of your control.", "Wow, i didn't know that existed, it must be confusing at best. Definitely NTA, you're going through some extreme situation and she added drama instead of helping you. I'd understand getting upset, but not directed at you.", "I hope she wasn't thinking she was going to have a soap opera moment.\n\nNTA because she should of did her part of reading the articles she gave you.", "NTA. I am so sorry you have this. I cannot imagine how stressful that must be for you. Your gf may need time to wrap her mind around your diagnosis and she may not be able to handle it but that is not your fault or your responsibility to help her understand. She can speak to doctors and your family and Google till her fingers are raw. Focus on you and getting healthy. The rest will fall in place.", "NTA\n\nMy guess(or hope) is that this has been sorted out by now.\n\nI've had a TBI and had difficulty recognizing faces for a few months.\n\nI'm not going to apologize for that.", "NTA. A woman that is supposed to love OP just traumatized them more after what was an extremely traumatically event. Is it possible for OP to make a cheat sheet of important people? Like take a picture of them & write their name on it,", "So, you have a medical condition she refuses to understand and she makes it about herself? She's showing you who she is and you don't need a face to recognize it. Be done with her, heal, and some day find someone who is concerned about you when you are not well. NTA", "Good heavens boy get rid of that girl, it's a waste, if she reacts like that to a difficulty, you better not want to know when it gets worse, NTA takes out the trash", "NTA. I’m sorry for what’s happened to you and I wish you a full recovery. Now onto the matter of your girlfriend:\n\nIt’s the projection~ for me. She whines about how you don’t recognize her and says “proves how much you care!!!”. But yet! You sent her information regarding your injury to her, and she just proved then and there she hadn’t read it. Huh. Funny. Almost like she doesn’t care enough about you to even skim the articles.\n\nShe lacks not only emotional maturity, but empathy and accountability. Honestly? I would reconsider this relationship. If she can’t handle the tough times and would rather be a “fair weather girlfriend” then by all means she can do that with someone else, and NOT someone who is trying to recover from a TBI.", "So just so we're clear:\n\nYOU are hospitalized\nYOU are the person with TBI\n\nAnd yet she not only refuses to read up on what's important for you but only makes everything about HER??\n\n\nWoah... \nI get it that it must be a shock. I'm sure it's for everyone (you the most of course)\nBut showing up like it's about her... Nah. \n\nDump that thing\n\nNTA", "NTA, sounds like she was watching too many movies like The Notebook.. Sorry about your condition.", "NTA. I'm so sorry about your TBI. I just watched a show yesterday where a character has face blindness and it seems so overwhelmingly scary. I am saddened that she was not understanding and tried to make the situation about her. You have nothing to apologize for. You sent her articles explaining the situation and she still chose to get offended.", "Wow Ofcourse NTA!!! She’s made your life changing, traumatic situation all about her. How long have you two been together? If my partner went through something like this I would be so concerned about him and how he was feeling first and foremost… she hasn’t seen you, you’ve been in hospital and her first reaction is to kick off you didn’t recognise her because you’re blind??? \n\nSorry you got this reaction OP. Sounds like you’re going through a lot and you deserved support and sympathy.", "NTA for sure", "NTA - I'm sorry you're dealing with this right now, it's got to be so disorienting and confusing. Your GF owes you an apology, and a whole hell of a lot more empathy. Good luck on your recovery!", "I'm really sorry this happened to you. For what it's worth, my favorite professor in college developed prosopagnosia at a young age, and he learned to pretty easily recognize everyone in his life, including the ever-rotating cast of students in his classes and lab. He never really failed to recognize me or my friends who were close to him, and I wouldn't have known he had prosopagnosia if he hadn't told me. Hang in there, it might be a hard road for you in the short term but you have a long full life ahead of you - I believe it", "NTA\n\nI am so sorry you're having to deal with this crap on top of everything else. TBIs are no joke and the lack of compassion for your situation that your GF is showing is frankly gross. \n\nThat being said maybe it'd be easier to have one of your nurses or doctors come in and talk her through it, if you are willing to forgive her. Sometimes people don't get the severity of a situation or an injury until a professional sits down with them and goes \"hey actually this is just how things will be from now on\"", "NTA. Obviously, any future with this kind of attitude from her side is not tenable.", "How about scent? Does your girlfriend have a signature scent you can identify. Yes, you have a condition. But, her feelings are her feelings. Work on ways you can connect and identify her. You have more senses than sight. The sound of her voice.", "I totally get her being upset you didn't recognize her, but it should be being upset FOR you, not AT you. NTA.", "NTA and honestly this says a lot about her as a person that she is more offended about you not recognizing her and wanting an apology than understanding your condition and having empathy for how it has forever changed you life. \n\nDo you really want to stay in a relationship ship with someone like that? She is so lacking in empathy for you. \n\nI am very sorry for what you are going through. I can't imagine how hard it is to adapt to such a change in your life.", "NTA: good thing you found out now and not later how self centered she is.", "The instant manipulation and crying, screams issues to me. And I don't mean physical but mentally. I don't think this is a person you could pull yourself up with. Since the slightest thing makes her throw you down with an excuse of I'm not important enough. Your gf needs to fix herself.\n\nNTA \n\nAnd to you dude. The best of luck and much love from a anon homie. Hope you get your mind and life back bro ❤️\n\nIf you ever need to vent. You could always hit me up.", "NTA \n\nWhenever you go through hardships, the people around you show you who they really are. Your girlfriend has shown you she’s a self centered unsupportive AH who will never see you as a real human being but as a boyfriend who should cater to all her needs. You went above and beyond to describe your medical condition and she has zero empathy for you and didn’t spend any of her time even looking to research the condition which shows just how terrible a girlfriend she really is. I genuinely don’t think there’s any going back for this and you need to dump her because she’s shown you her true colors.", "My wife has this. You'll be ok and learn to recognize people's shoes and stuff. But it's still hard on her, especially with strangers. If she were to be attacked she'd have no luck giving a description", "NTA. she doesn´t care about your brain injury and makes everything about her, she is egocentric and doesn´t really love you at all.  you would be better off without her", "NTA and your girlfriend sounds like she might not be very bright. Hopefully she has the looks to make up for that.", "NTA - i have had a TBI, it is life altering. You don’t need negativity like that while trying to recover. Don’t apologize and don’t reconcile unless she can apologize and show true understanding and care. I also have face blindness (I already struggled as I am autistic, but worse after the TBI) and I recognize people by their walk or voice, but only in context. At work I can mostly tell people apart now, at least the ones who I see regular. The ones in the field not so much. But if you took us out of the office and in another setting and casual clothing, I would not be able to identify anyone. \n\nSo I get it. I hope you find someone who truly loves and supports you! \n\nOh! And don’t do what I did…when they say no screens for whatever period of time, listen. I didn’t and I regret it daily", "Sounds to me like she didn't read the articles you sent her.  Hopefully she did read them after her visit with you.  As for the apology, you haven't done anything that warrants an apology.  This is not something you're doing, it's something that happened to you.", "NTA and your gf is not very intelligent.  Your relationship should be in time out about now.  Your first and only priority, right now, is your health and healing.  If my husband was in the hospital, first of all it wouldn't take two weeks to visit; second, I would find out everything I could about his illness, diagnosis, and prognosis, because I love him and want to assist in his recovery.  Your gf wasn't concerned enough to visit for two-weeks, nor read any of the info you sent her.  She's selfish and unconcerned about your health.  Let her stay an abstract memory you don't really need.", "NTA wtf.", "NTA\n\nThat's a huge red flag on her level of maturity. I'd be rethinking the relationship unless SHE apologizes for being a self-centered asshole", "Whoa - NTA. How can she be offended by this? Clearly she did not read and or of she did m, she did not comprehend the articles. Then she managed to turn your TBI into something about herself.", "NTA - It's kind of surreal that all this happened to you, you are pushing forth making huge progress, accepting what's happening, finding ways to cope, and handing out articles to make those who love you aware of how it works and how to handle things with you.\n\nAnd she, in response, chose to selfishly, ridiculously, make it about herself. Who the hell does that?! Did she not love you enough to read the articles> Did she not love you enough to use Google? Did she not love you enough to speak to the doctor on how to handle things? Did she \"not love you enough\" to put YOU before her own ego in a situation that is one of the most self-centered things I have ever heard?? No, no she did not.\n\nDo not apologize for her ridiculous demands or her inability to be a loving, caring GF. This is all on her and omg shame on her.", "I'm sorry this happened to you but glad you're alive. You got this. One breath at a time. NTA.", "NTA\n\nI have struggled with prosopagnosia my whole life.  I used to be astonished that other people could recognize each other so easily.  Didn't know prosopagnosia was a thing until I was in my 30s.  I have had countless conversations with people while having no idea who I was talking to.  Once walked past my mother in a shopping mall without recognizing her (that was NOT a pleasant conversation afterwards!).  If your girlfriend wants to make herself the victim of your injury, it's time to get a new girlfriend.", "NTA even slightly.  I have blind and mostly blind colleagues.  I know that they will not know who is standing in front of them unless they recognise my voice, and even then I won’t take the risk but will say “Hi, it’s thefarunlit, how are you?” so they can be sure who they’re speaking to.  Because I understand that they have. medical condition that affects how they experience the world, and I don’t make that all about me.  Your girlfriend is being ridiculous and not trying in any way to understand your condition.", "NTA it's literally not your fault. You warned her, you sent articles explaining the condition and she's STILL like this. Dude you just dodged a bullet", "NTA !\n\nIf something like that would happen to my boyfriend I would just dye my hair bright blue or something similar to make it possible for him to recognize me. Sure not a solution for everybody, but neither is becoming upset.", "1 sentence was enough to obviously state NTA. I'm sorry you have to deal with this horrible medical condition and on top of that an ignorant self centered insane person. Wishing you all the best.", "NTA as hard as it is for her, she should understand that you suffered a TBI and it has to be extremely difficult for you. It isn't anything you have control over.", "I can't even imagine how bad it must be to not recognize anyone... must be so scary. Hope you find more people who'll understand your condition and help you instead of being self-centered and ignorant. \n\nNTA", "NTA\n\nNot by a long shot.\n\nI have someone I interact with at work occasionally who also has face blindness. I opt to wear the same article of a piece of (visible) clothing every time I know I will be working with them, to make it a little easier to identify me. It’s really not hard.\n\nShe’s not even trying.", "Very much NTA.", "Nta.  It isn't your fault.  She's wrong", "I think she was expecting a dramatic movie moment. “My brain injury doesn’t let me recognise the faces of my loved ones. Except for YOU!” while the music plays. Unfortunately, it doesn’t work like that! NTA", "NTA\n\nWhy would you apologize for what?  For your injury that resulted in TBI?  Oh please!  You're struggling to identify anyone you know.  You can't help it.  I know a couple of friends with TBI with your case, they do have trouble recognizing their spouses, family members, friends and extended relatives.  Your gf should be more patient and have some compassionate.  You already sent her the articles, I suspect that she chooses to ignore them.  Tell her not to come until she reads the articles first or end the relationship if she's demanding an apology.  She may not be worth it.", "Your girlfriend sounds not only immature but also really dumb. Like \"you cheated on me in your dreams\" dumb. I bet she has a lot of great qualities, but if this was her reaction and takeaway, she should be ashamed of herself.\n\nShe needs to apologize to **you,**  not the other way around.\n\nNTA.", "NAH - you are definitely not the AH. She sounds immature and didn’t handle the situation well but I’m going to give her the benefit of the doubt because this is kind of a traumatic situation. She was likely worried for you and may have reacted inappropriately.", "ESH\nUnintentionally you put dealing with it on her. You linked her to articles about your condition but didn't consider her view point. She was had the mindset that you would undoubtedly recognise her, the bluntness of \"tell me who you are\" was probably very shocking and upsetting. \nEven though you did nothing wrong, apologizing to her may help mend your relationship.", "My best friend recently experienced a TBI and didn't recognize one of her *daughters.* Girlfriend needs to apologize.", "She's one of those who can turn any situation to be about them, it's absolutely ridiculous. The world does not revolve around you ffs, NTA", "Agree here. Her feelings are totally valid and I would probably be hurt in the same circumstances too. However, I’m an adult who cares deeply about how I affect others and would have kept that to myself or at least had a conversation with OP letting them know I understand it’s not his fault but was hurt. The fact she immediately started making this about her and not having a mature reaction would make me question whether she was worth keeping around. NTA and I wish you all the best OP. I cannot imagine how hard this has been for you.", "I think this borders on ESH. You can still apologize to people (especially loved ones) when their feelings are hurt even if it's not your fault.", ">as someone who also struggles to recognize faces, I generally apologize before asking people who they are\n\nDo you have a TBI?", "It's literally *not about* how significant she is to OP or \"making an impact\" - if you're important enough to a blind person do they become able to see you?\n\nYes, a faceblind person can learn to recognise you over time, because there's more to a person's appearance than just their face - your hairstyle, height, build, the way you walk, and of course your voice if you speak to them instead of just waiting for them to recognise you. But if you're used to having a more efficient way of recognising people you probably need some time to learn to use those cues.", "Okay, but he didn’t just tell her her had a TBI, he sent her articles about face blindness and explained THAT to her. Like she should have known what would/could happen when she walked in to see him because already told her he medically cannot recognize people anymore. NTA.", "OP has nothing to apologise for. They're not lacking empathy, the girlfriend is (and you are.)", "NTA\n\nI know she's upset and she's entitled to her feelings.\n\nBut imagine if you had become paralyzed (through no fault of your own), would she require an apology from you then too? Also, an apology implies that you won't do it again, but you really can't make that kind of promise. \n\nI'm sorry, but she's an AH. Please contact some of her family members or some of her friends. Maybe they can talk some sense into her.", "Yeah, she just stood there like: recognize me! When he had specifically explained he can’t.\n\nI don’t think she is the brightest person, to be honest.", "Yeah, once you are acclimatised to someone you see regularly it's hard to not recognise them. Somtimes you see someone who has a similar vibe and question if it's them but when you see the real one you know it's them.\n\nThe thing to watch out for is hats and haircuts, i'm usually ok with them if it's my parents or sister but I've blanked co-workers i talk to every day when i've seen them out of the context I expect and they are wearing a hat.", "You’re absolutely right. What she does now is the real test. Will she calm down, think about how she acted, and apologize? Or double down?", "For me personally, it's like.  Okay, google black cats.  They all have faces, but they all look the same.  It's like that.  \n\nI have to go by clothes when I take a picture.  For my boyfriend, for example, he usually wears black shirt, jeans, beard, brown hair, and glasses.  Nowadays I just push the cart so I don't have to worry about finding him.  He'll find me.  :)  Or if it's someplace without a cart, I can just call him and chit chat until I hear his voice if we split up, but he likes to hold my hand.\n\nFriends, I just buy pins of interests they have or shirts.  They just think I'm spacey.", "Honey, I know this is fresh, scary and overwhelming. I'm so sorry for what you are experiencing right now.\n\nBe kind to yourself. Give yourself time to figure it out.  If having her around hurts more than it helps, it's okay to ask her for space right now while you focus on healing.\n\nDo you have anyone else you can lean on? A good therapist can help you through this next chapter. I hope things get easier for you soon. ❤️", "Not only that but, OP has been hospitalized for two weeks.  This is the first time she has been there to visit.  What kind of support is that?", "I had a good friend in grad school with the condition and once she explained it to me, I did my best to always speak when I saw her to give her a clue. I would also give verbal context clues when others were around so she didn’t have to work so hard to figure every one out.  Also when anyone charged hair styles I would let her know. \n\nI did my best not to be awkward or weird about it and she always appreciated the help. \n\nIt is so easy to be kind and helpful, I don’t get why people would be dicks about it.", "Yes. And learn to never say \"it was nice to meet you\" in any context. Just change your go-to phrase to \"it was nice talking to you\", it will save you so many times!", "Why will people get offended no matter what? It's not the person's fault so why would people be offended? That's like being offended that a person can't control the weather for you.", ">Your best survival mechanism is going to be generic conversations to gather context. Practice small talk, asking people how they are doing, what they’ve been working on, etc.\n\nAh yes, the old \"Hey....You!\"  LOL I literally do this myself.  I'm *terrible* at recognizing faces of people I don't know.", "That's exactly it. She'd read his msg and the articles. Then she tested him. \n\nAnd then got upset when the presence of her stupid face alone couldn't overcome an injury.", "Like in season 4 of Arrested Development when Maeby was disguised as a guru!", "It’s so weird the things you pick up on when you have to operate without something most people take for granted! I have a profound hearing impairment, so I’m hyper focused on people’s faces, especially mouths, to gain context for conversation. People get really weirded out when I can see what accent people have (Southern American, RP English, Indian ESL) or who had occupational therapy as a kid to overcome a lisp. Waiting tables that was really helpful, because I could also see who else was hard of hearing and ease their way by communicating more directly.", "I'm pretty sure I have this (very mildly, it doesn't really impact me, but it's definitely there). All it took was a baseball cap and a shirt I'd never seen for me to be unable to recognize my mom's partner lol.\n\nSometimes it's also just context. Like if I run into someone on the bus when I wasn't expecting them, that seems to just throw me off even if nothing else is different.", "Crazy idea... Maybe she could try speaking up? Like how you do with blind people?", "That's a great analogy.\n\nAlso important to note though that it is on a spectrum. Some people have it so bad that they can't recognize their own face, while some people have it mild enough that they can learn someone's face after seeing it multiple times.\n\nI'm definitely on the milder end of the spectrum. I can recognize unique features, it just takes a long time, and it's pretty easily thrown off by different clothes, hair, or just the context in general.", ">I'm pretty sure I struggle with face-blindness too, because I really really cannot remember people by their face unless I see them every single week for months. \n\nAlso lookup aphantasia. I only learnt about it about a month ago and it made me go WTF.\n\nThere was a great podcast on the topic.\n\n>We’ve had scores of messages from *listeners who report having a ‘blind mind’s eye’. They don’t see mental images at all* and they want to know why. Jude from Perth wants to know what makes her brain different, and Diane from Scotland *wonders whether it affects her ability to remember family holidays*\n\n\n>The Curious Cases of Rutherford & Fry - The Case of the Blind Mind's Eye\n\nhttps://www.bbc.co.uk/programmes/m001gwys", "You're nicer than me- or people you know are meaner than people I know. I flat out tell most people that I'll take forever to remember who they are. I know I should know their names or at least know that I've met them before but I have no clue.\n\nAt work, I just don't call anyone by a name unless I know that I know it.\n\nIt works surprisingly well.", "Like… the way we introduce ourselves on the phone back in the dark ages before caller id?", "The very way she entered the room smells off to me, though. She came in and didn't say anything at all to him, forcing him to start the interaction. That makes it look like she did read at least some of the info he'd sent and she was testing him to see if she was \"important\" enough for him to recognize, like he could his immediate family. The fact that she seemed primed for an angry reaction just reinforces that perception.", "This happened to me at a wedding. We were seated at a table with (apparently) some acquaintances, but I didn't remember them AT ALL. The wife of the couple got really mad and offended. I mean, so offended that I ended up just not sitting at the table for most of the night, because she made it so unconfortable.", "OP, you are absolutely NTA. It's completely unrealistic for her to expect herself to be an exception to your prosopagnosia (as if you had any choice about it!).\n\nBut I'm reminded of something my brother once told me. One night he woke up and found his wife silently glaring at him. He asked what the matter was, and she told him she had just dreamed they were walking down the street with their kids and a car full of strippers pulled up, and my brother got in the car and rode off with them (note: my brother doesn't go to strip clubs and has never cheated on his wife). Make a long story short, my brother ended up apologizing to his wife for cheating on her in **her** dreams.\n\nI think you may be in a similar situation. If you value your relationship with her, you may want to apologize anyway, and apologize in advance for the fact that it will keep happening.\n\n\\[minor formatting edits\\]", "I think it can be. I started a new job recently and I still don't recognise most of my coworkers, which is a bit awkward. I tend to recognise people through mannerisms, hairstyle, etc rather than their face, and if I see someone \"out of context\" I often don't recognise them at all. I can't tell you how many times someone has come to chat to me in the street and I have to bluff my way through the conversation trying to pretend I know who they are!", "Yup.  I am realizing that i might have a mild to moderate case of face blindness as I seem to recognize people by haircolor and style and what they're wearing more than facial features.  I can visually see features fine, but my brain doesn't seem to catalog names and facial features together very easily.  Some of the kids I work with change hairstyles frequently with weaves/braids/etc, and I often have to work out who they are again every time they do it.  I have trouble distinguishing between kids with similar hair and builds even when i know objectively they have different features.  Men who significantly change their facial hair or lack thereof are initially unrecognizable to me until i hear their voice or catch some other cue.  I have a friend of ~25 years that all the time I've known him he wears this ratty old baseball cap turned backwards...if I go see him at work where he can't wear it I struggle to identify him by sight.", "It is talked about frequently in the autism groups too. I didn't realize how much I rely on hair and accessories to identify people until I learned about prosopagnosia.", "> Isn’t this also something to do w ADHD?\n\nIt is also somtimes related to aphantasia, the inability to form mental images.", "Omg aphantasia to an incomplete degree would explain so much for me. Meanwhile my sister thinks in ONLY images, while I think in words and struggle with mental imagery", "Alternatively one could argue that if she values her relationship with him, she should be willing to let it go and understand that it's not personal. Or in your brother's wife's case, that her dreams are literally not his fault.", "I text myself peoples names. Remembering them out of the thousands of names is going to be a losing strategy for me, but if I know the person in front of me is either Sandra, Michael or Nick it becomes much more likely that I’ll pick the right one. \n\nIf I can be sneaky enough, I’ll text myself things like “Nick blue shirt nice hair” or “Michael, kind of a bragger, ugly beard” whatever helps me remember them. Then it’s more than just trying to connect faces with names (which is so incredibly hard for me), it’s ahhh I’ve seen that ugly beard before ~checks notes~ must be Michael. \n\nEveryone I’ve ever met and got their phone number has my raw unabridged first impression of them in the company section of my phone. I’m just now realizing how much blackmail power that would give someone…..", "Huh. I still remember the time when I cheerfully greeted a person who had just got on the same bus I was on, because I thought I probably knew them somehow. Like \"that face rings a bell, but I have no idea why, but I guess I must know them even if I can't think of their name?\" We did not, in fact, know each other. She was simply out of her context - she was a librarian, and I was used to seeing her in the local library. She got on at the nearest bus stop to the library, but because she wasn't in the context of \"the library counter\", my brain just went \"you should hi to this person because maybe she's a neighbour or something and it would be rude if you didn't acknowledge her\". 🤦‍♀️\n\nETA: It's great when people speak to you and you have NO IDEA who they are, except they clearly know you from somewhere. For one of them I actually asked my husband afterwards who the guy was that had been talking to us and seemed to know more about us than expected from some random friend of my husband's brother. Yeahhh. He was the guy who had spent *a good few days* in our house either laying the new downstairs flooring or who had completely refurbished our spare room. (Maybe it was both.) I had given him cups of tea!", "Someone I know met our children's swimming teacher somewhere in a store and she said - very loudly- oo, I didn't recognize you with your clothes on 🤣", "> Theres been times when I met a friend of a friend, hung out with them on a three day trip, and then don't recognize them 4 days later.\n\nYeah, sounds about right. I have it and was once meeting a group of friends including my best friend at the time. He wasn't in the group so asked if anyone had heard from him and was met with confusion because he was right there, I just didn't recongise him because he had a hat on. Clark Kent would love me, i'd never work out his secret identity, haha.", "When I got diagnosed they weren’t looking for ADHD, they were looking for EVERYTHING. I had a whole learning disability panel done over 6 months. Alongside getting diagnosed with ADHD, they also said I have borderline short term memory loss (like dory!) but an incredible long term memory. I’ve always been curious if that is an ADHD thing or just a me thing, but in my last comment I spilled all my secrets on how I keep peoples names straight lol", "holy shit I have that issue too", ">There's actually one group of people o can always recognize, famous or not.\n\nI’m dying of curiosity.", "Ok you can’t keep us hanging like that", "NTA. I get how she's feeling and why she reacted like that, but you really did try to tell her, so this is on her. What happened to you is affecting her badly too, but since you're the one with TBI, your anger is justified. \n\nGive yourselves sometime. Take a breather and talk about this when you both have calmed down.", "Nta. You have a brain injury and she's making it all about her. She didn't even bother to read up on it. She she be understanding and doing everything she can to help you heal", "NTA wtf you have a medical condition.", "NTA. You can't help it. \n\nI've been watching a Korean drama called \"The Beauty Inside\" where the main character has prosopagnosia and it's quite interesting. It's on Netflix, you may like it.", "NTA. You have already provided her with information on your medical condition, she walked into that room prior knowledgeable on whats going on. The fact that she instant freak out saying \"Are you fucking for real? You don't recognize me?\" gives me major red flags for a victim complex. You don't have any reason to apologize. Wishing you the best of luck as you deal with this.", "Your injuries require much more care than her ego. NTA! She should have read the info you sent her, and asked questions if she didn't understand any of it. Hope your healing process progresses quickly and you get home soon.", "NTA\n\nWow, what to say about the gf? I can't think of a positive spin on the way she reacted, you have a tbi, in the hospital and this is her reaction. Have the two of you talked since? Has she pulled her head out of her arse?\n\nMate, concentrate on recovery, learning strategies for the face blindness and try not to worry whether other people get it or not.", "NTA and if I wasn’t breaking up with her I would be expecting a massive apology.", "NTA, I'm sorry you're going through this. Be thankful for the people who are taking the time to be patient with you. Well your girlfriend did was really inappropriate.", "NTA. The fact she got upset tells me she didn't read any of the articles to educate herself and just thought magically you would know or thought she would be an exception somehow. It doesn't work that way. \n\nAlso, am sorry that you are having to deal with this OP.", "NTA. If you can, do Neurofeedback. It’s the only thing that helped my TBI.", "NTA. Break up with her, she’s only going to make this recovery process 10x harder", "NTA\n\nI can't believe your gf's priority after - (checking list) you suffer a TBI, are hospitalized for two weeks, and her not seeing you) - gf's priority is that she should matter so much to you that you would recognize her even though you now have prosopagnosia. (You clearly didn't forget her since you took the time to reach out to her.)\n\nI'm sorry for you have suffered recently and for the challenges you are facing. I'm also sorry that your gf is not showing herself to be a great support to you (at least in this post). I hope your recovery goes well. I also hope either your gf's perspective improves greatly or the character she shows you helps you feel confident in deciding whether she is someone to keep in your life or not.", "NTA\n\nHope you heal and if she doesn't up her game you need a new gf .. she's being unfair to you", "NTA, she sounds disrespectful", "Damn :( I'm sorry you have developed Dave blindless, op. I already suck with remembering names, so I can't imagine also having that. NTA", "NTA. Wishing you all the best for a speedy reaction. I don't want to throw more stuff at you, but I'd monitor how she deals with stuff like this from now on. It's a red flag for abuse.", "Ah, my then-boyfriend and I both do not recognize faces. He was meeting me at the train station. Only after all the passengers filed out were we able to find one another - by the process of elimination. True story. ;-)", "NTA. I once knew someone with this condition and it was an incredible struggle for them, especially in school. So many people didn't try to understand or would mock the condition. OP, I'm so sorry you're going through this. I can't imagine the struggle to adjust. \n\nYour GF owes you a massive apology for not taking the time to research what this really means for you and in turn making it all about her own ego. Did she think you were lying about not recognizing people anymore? I know it can be a tough concept to grasp but she handled it very, very poorly.", "She seems like a person who would get pissed at a parent or grandparent for getting dementia and not remembering her. \n\nNTA. You explained and sent articles. You did more than enough. You know who she is you just couldnt recognize her. She owes you an apology or she is right, she's not important in your life and doesn't deserve to be in your life. You deserve so much better for your own health and recovery.", "NTA and op that woman is not for you", "im a bit curious but can u see everything else properly? ive nvr heard of this before and it sounds very heartbreaking. praying for a speedy recovery for u op", "NTA, you cant see faces.... how would you recognize her...", "NTA", "If you explained this all to her in the same exact amount of detail that you explained to us, and then, in the same exact day, reacted like this to you not recognizing her... I don't mean to be insulting in any way, but I don't think she's intelligent enough to invest a future in. You're going to run into completely unavoidable problems like this in the future, because she's not intelligent enough to logic her way into very simple conclusions.", "Wow, way to make it all about herself. Dude seriously she showed absolutely no compassion to you at all and just cared about being dramatic herself. Been with my man for over 8 Years and I still wouldn't be upset if he didn't recognise me going through what you are. She is the one who needs to say sorry.", "NTA. At all. \n\nI’m sure she’s allowed to be upset, but you told her and sent her links. She should have read them or heck, said, “great, when I visit you I’ll wear (blue sweater with buttons” or “a chunky bracelet” etc.  (I’d be dying a chunk of hair a fun colour to help, personally. Easy!) \n\nI’m really sorry that she lacked the clarity to realise that your inability to recognise her isn’t about her, and it’s not because you don’t care. That must be hurtful for you both. \n\nBut she also needs to make an effort to help you with a *medical condition*. Especially a new one that you yourself are still adjusting to. \n\nI hope you find solutions that work for you, and have a smooth recovery.", "NTA. It's not the same, but I've had family members who have gotten Alzheimer's. They didn't recognise me. Not once did I blame them because it's not their fault. Tbi is so complex, did she really think oh of he loves me ill be the one he recognises over everyone else??? She really needs to be more educated, and maybe that needs to come from some health care team or otherwise? How long have you been together? It doesn't sound like she's going to be all that great moving forward with this. Hiwnis she going to deal when you go home and wake up in the morning and don't recognise her appearance.", "WOW what did I just read????\n\nWay to go her making your head trauma all about her!  \n\n\nYou are in no way TA here. Wow. I'm lost for words...\n\nI wish you a speedy recovery. I can't imagine the trauma of losing your ability to recognise people let alone on top of the physical injuries. Good luck recovering.", "NTA. \n\nYou sent articles clearly explaining the state you are in. If she bothered to look them over or even Google for a shorter version of what you've been diagnosed with, she would've understood. This state you are in is not something you can fix (at least for your sake at the current time I hope) and she owes you an apology for lashing out at you like that. I do hope your medical conditions improve and you don't worsen. Good luck on healing OP, and remember you're not the asshole in any situation involving your medical conditions.", "NTA, she needs to understand the effects of your TBI. Maybe having your doctor explain it to her would make her understand it better?\nI get that it must be upsetting for her but it’s not your fault you are having a medical issue.\nHope you’re on the mend!", "NTA, I'm sorry.  you should ask friends/family to wear something distinctive like a necklace to help you recognize them.\n\nReally she should be apologizing here, that was an uncalled for reaction and you warned her about.", "NTA That was incredibly ableist of her! And mean.\nYou did the right thing here. Not sure I'd continue that relationship - but now probably isn't the time to make major life decisions. (I don't know if you live together or what?).\nAlso, I had an online friend with this condition - interestingly she was a Sports Photographer. Didn't impact her ability to do that job at all. \nShe had the condition from birth so found out eventually she wasn't neurotypical.She's pretty vgood at recognizing people she knows by voice. Of course online it never mattered at all. \nI hope you heal well and have great Drs.💜", "NTA. (I apologize this is my first comment and I’m on mobile) Honestly instead of apologizing to her she should apologize to you. You did your due diligence with sending her articles and explaining what’s going on. I can understand being upset but this seems like a pretty big overreaction to me. “If she had read my explanation I texted her or the articles I sent she would understand that my ability to recognize her has nothing to do with my care for her. She got upset at me for not apologizing to her, but I refused and told her to leave me alone and go home.” Excuse me? I don’t know the entire situation but this is incredibly childish of GF. I don’t have this condition but I can imagine it’s hard to live with in the beginning. Maybe try explaining it to her again? You shouldn’t apologize though.", "Wow.  If this is a true tale, you're so NTA.\n\nI understand her being hurt if she had no idea what you'd experienced, but this SHOULDN'T have been the case.  \n\nGood luck with your TBI.", "NTA - she’s turning a situation that should be about you into one about her. \n\nSome people who do this - they are narcissists. So just remember that. I’m not saying she is one - but it’s worth noting.", "I have struggled with facial recognition my entire life. I also had a serious concussion at age 21 in a bad car wreck and then a concussion at age 63 from a fall in an empty cement swimming pool.  I have fabulousrecall for voices and stories though. Also music. NTA for not recognizing her,btw. Here is something you can start doing that might help you. When you see someone who knows you but you don’t recognize them say “Hi! How have you been?”  They will usually say Hi then give you a couple of sentences. They usually say someth8ng that allows you to place them. If not, come clean. I say “You know I had a head injury not that long ago and I really struggle with names. I’m sorry but can you help me out with your name?” I’ve been using these tricks for 40 years off and on. I had a period of time where it was better from about 35 up until my most recent concussion. That was 2 years ago and I am finally starting to “unfog” again. Having Covid last year didn’t help though.  Please understand this doesn’t make you dumb or”retarded” as I was called a few times. You are now wired differently and probably always will be to some extent. Life can still be ok. Good luck.", "NTA. it would be like if she was made a person with dementia for forgetting her. you have a genuine medical condition, it wasn't intentional. I would give her a chance to apologize and correct herself, but damn, a real shitty first response", "Fellow TBI sufferer here. First and foremost, I’m sorry for what you are going through. It’s still early on in your journey so please don’t be discouraged — things can get better.\n\nThat said, you are NTA here and your girlfriend is. You’ve been in the hospital for two weeks, you have experienced a significantly traumatic event, and are only just beginning to understand and address the potential functional changes this may have on your life in the short- or long-term.\n\nGiving her the benefit of the doubt, I know that sometimes stress and worry can come out sideways during difficult times. But at the end of the day, you are the person most affected by this injury and the role of the people around you is to SUPPORT, not lash out. If she needs to dump her stress she should do that outward, to her own support network — but never on you.\n\nEvents like these tend to be a kind of litmus test for the people in our lives. If your GF doesn’t straighten her priorities out, I think it would be worthwhile to evaluate whether she is going to be able to be the sort of trusted support that you need in a partner.", "NTA, but your girlfriend sure is. You explained your condition and it’s limitations for recognizing people. It wasn’t like she didn’t know. She visited you and got mad for the condition doing exactly what you said it would. She is sooo in the wrong.", "Wow! You are definitely NTA. You're owed an apology, and if you don't get one, then you've dodged a bullet. There are plenty of ladies out there who possess empathy and manners and don't think solely about themselves.\n\nThanks to you and the others on this thread for educating me on something I did not know existed and is so traumatic for the people experiencing it. I'll be sure to check my reactions in the future when I am not recognized.", "If I were your girlfriend, I would without hesitation dye my hair to help you recognize me. You are NTA - she sounds awful.", "Wow - you are better off without her actually.  NTA.", "NAH, people can be silly and selfish when theyre upset. im very sorry this happened to you and i think she lashed out due to being worried about you, and also being disappointed/shocked. i think this situation sucks for everyone and everyone is reacting like a human would. she does owe you an apology though", "NTA but I'm sure she doesn't understand the extent of your condition.  Maybe a nurse at the hospital can help you explain it to her.  Tell them what happened.  They've probably dealt with it before.", "NTA. A friend of my family's had her optical nerve destroyed in a stroke. Afterwards, she could see shapes, but no details. She once got separated from her husband at the grocery store, then went up to a man she didn't know and put her arm on him, thinking it was her husband. The man was good natured about it, and her husband asked, \"Why is it you always think the FAT ones are me?\" She said \"I can't see your face, just your shape. Make of that what you will.\" When I visit her, I always announce myself \"Hey, it's \\_\\_\\_.\"\n\nI'm hoping your girlfriend just didn't understand the severity of your situation. Maybe the articles seemed overwhelming, and she wanted to see you for herself. Regardless, she owes you an apology. You're struggling with a lot right now, through no fault of your own and largely beyond your control. I hope your girlfriend can come around to being the support you need. And if I may make a suggestion, when family and friends want to visit you, tell them something like \"Hey, just a reminder, I can't see faces, so when you get here please tell me who you are.\" Most people don't think of doing that for themselves but are happy to have something concrete to \"help.\" \n\nI wish you all the best with your recovery.", "I don't understand why it's so hard to define your acronyms before telling a whole story on this site.\n\nBut NTA of course. She needs to stop making things about her and grow tf up", "NTA - She should read the Man who Mistook His Wife for a Hat. It is a very great book of clinical stories based on agnosia.", "NTA. I’m so sorry you’re going through this! Your inability to recognize your girlfriend is definitely not your fault, and you did tell her everything she needed to know ahead of time. She’s TA here; and hopefully she’ll actually read the stuff you sent her and understand. If not, then ending this relationship might be a good thing— now more than ever you need people in your life who are going to be understanding and supportive.", "I'm so sorry to hear that.  You're definitely NTA.  I worked with people with different types of brain injury for over a decade, and a common thread I noticed is that invisible disabilities are much harder to get across to others than any kind of physical problems. You wouldn't expect someone with a broken leg to run a marathon or be offended that they couldn't.  But when it comes to cognitive or mental health issues, it's not uncommon to see an irrational emotional component of  \"If you cared enough/loved me/tried harder, you'd be able to do it.\" It's not logical, and people usually come around on it, but as a first reaction, it happens more than it should. \n\nEven though you did warn her, it was probably a shock you couldn't recognize her, and she had that terrible reaction. That doesn't excuse how awful she acted, but hopefully, you can have a discussion now that she has maybe processed the situation a bit more.  You don't owe her an apology, and if anything, she owes you one.  I hope you're able to have an honest discussion of the challenges, and how it has nothing to do with how you feel about her. I hope you can find ways for her to help you recognize her that will not make her or you feel bad or unloved. The changes brought on by a TBI can be a challenge to any relationship, especially when you're as young as both of you are.", "NTA. She sure did a good job of making your trauma about her.", "Girlfriend is an immature idiot that cannot put anyone else’s feelings before her own. Take it as a sign to get rid of her. She won’t be there to support you through this difficult time. NTA", "NTA\nI had a pretty bad head injury as a kid and didn't recognize my own mother the next day.  Not until she spoke.  I did recognize my cat.  That doesn't mean I loved the cat more than my human family members, just that head injuries are weird.\n\nYour girlfriend is being a jerk.", "NTA - how can you be an AH because of a medical condition? \n\nSounds like this is a good opportunity to look at your relationship and decide if she's someone you want to have around? You have enough to deal with now without having to deal with someone who is too immature to understand the situation.", "Nta. Dude you're lying in a hospital bed, lucky to be alive, and she's throwing herself a pity party because you have a legitimate condition that the power of love cant cure? She seems to have the emotional maturity of a toddler, I know yall are still young but that's unacceptable behavior on her part. I wish you the best luck on your recovery,  but I don't think having her around is going to beneficial if she's going to have a tantrum everytime you are physically incapable of meeting her unreasonable expectations, if anything she's going to prolong your healing process with her drama", "Oh boy, my TBI made it so everyone looked really familiar. I used to be a lot more friendly, but after thinking I knew someone too many times when I didn't, I stopped saying hi to friends/acquaintances after too many turned out to be strangers.  \n\nGood luck. I think it went away after a few years or I just adjusted to not being as friendly and outgoing. One of those I think.", "NTA x10000000. I’m so sorry OP.  I wish you well in your recovery. \n\nThe only one who should be apologizing is her.", "NTA. Heck no. You know what I would do if my husband needed help recognizing me? I'd wear a special necklace or something he could see and know it was me. TBIs are serious. I would be happy just knowing it wasn't worse. We'd be in it together. I'm sorry your gf made this about her. She is the AH.", "NTA she owes YOU and apology.  Maybe this isn’t the one.", "You're NTA, and your girlfriend sounds like she didn't read or understand the articles. With that said I can understand why she might be upset, it would be very upsetting to me to know my wife didn't recognize me even if I was prepared for it. Still I hope yall can push past this and she can understand. My best wishes for both of you.", "NTA. And honestly, you didn't really need to apologize.", "NTA. Red flags abound. Ask her this: \"If I'd lost an arm, would you be angry that I couldn't hug you the same way any more?\" You have a **physical disability** that is causing this, one that is not affected or controlled by how much you do or do not feel for this other person. She's being 100% irrational here. Find you someone who will support you regardless.", "NTA, I’m sorry this happened.", "NTA \n\nSo your girlfriend really made your health issues about her? She doesn't sound very mature or supportive.", "I’m going to say NAH but mostly NTA because you’re suffering a flipping head injury so it’s obviously not your fault. I just think emotions are running high and your girlfriend had a very romanticized, Greys Anatomy idea that you would recognize her as your one true love. Y’all are early 20s and the emotionality takes over the rationality a lot.", "NTA not at all.  She sure is though. How long have you been together?", "NTA\n\nTBI's suck, I went through something similar and I still have trouble with recognizing people sometimes, even myself. She's showing emotions but she needs to grow up and get over herself for a second in this situation.", "NTA at all! \n\nI had a professor in college who had face blindness from a TBI as well. I had no idea he had it until a few years later and we ran in to each other and he mentioned it. I don’t believe any of my classmates ever knew either. \n\nHe had learned to use all of our voices and the shapes of our ears to tell him who we were in class. It was the one time the ice breaker name game now makes sense \n\nOP you are doing great using voices!! This is going to be an entirely new world for you and your GF needs to realize that. This situation gets to be about you and your healing from a TBI right now. The t stands for traumatic and she needs to realize this.", ">She insisted on visiting me\n\n>She didn’t say anything to introduce herself\n\nIt could just be me but it sounds like she came either without reading anything you sent (on purpose) in order to test your love for her or read it and intentionally didn't speak in case you'd recognize her by voice instead of appearance. Either ways you're NTA and she just fucking sucks. It's similar to having a partner who earns enough to take their SO on trips only for that partner to lose their job and the SO is all woe is me because now they can't travel instead of worrying about their partner and their wellbeing. It sounds very immature and self absorbed.", "NTA.  Have your Dr. or another medical professional explain to her what your diagnosis means, if she needs it.  It shouldn't come to that, but in reality, some people take professional advice more seriously.\n\nAnd she'll need to start wearing a special necklace or something, so you can recognize her instantly.", "NTA", "Can't apologize to someone who never speaks to you again. That would be me if I was the NTA op!", "Exactly. It's much harder for the person who is actually dealing with this condition  (OP)  in this case compared to the other people in OP's life. It's hard for everyone, yes, but OP has to come to terms with this neurological disorder and change the way he interacts with others.\n\nOther people in OP's life should be more understanding and work with him to figure out how to identify themselves in a different way. You are not just your outward appearance.", "I think it's also pretty indicative of how much she cares that she waited TWO WEEKS to see him and then walked in and just stood there.", "I think this is a big part of it. She was expecting some true love conquers all moment. She probably built it up in her mind so much that the fact that it probably wouldn't happen didn't even seem like a possibility to her. But life isn't a hallmark movie. That, or she didn't even care enough to read his text message.", "[deleted]", "In addition, get the nurses/docs to educate her a bit. I’m a nurse and i love setting family straight (mostly in a nice way). It may carry more validity coming from medical professionals than just some articles.", "It's not on OP to apologize for having a condition caused by a TBI.\n\nHe made the effort to help her become familiar with his newfound condition and she disregarded it and treated him like an asshole for - wait for it - not recognizing her face, as per the diagnosis he tried to inform her of.\n\nA simple apology and touch of empathy would cost her literally nothing, see how that works?", "Thanks, Dr. Armchair Doctor.\n\nExcept that's not what OP is dealing with. He now has a brain condition that makes it difficult to impossible to recognize faces, which he linked her articles regarding so she could familiarize herself.\n\nI don't sympathize with her because it's clear she didn't read them.", "I have one question: what?", "I have the same symptom from a mild stroke. I simply explain it to people and have never had anyone take offense.\n\nNTA", "I dated a guy like you, other reason then  prosopagnosia   that led to not being forever. I learned rather  quickly to have  catchphrase  when I saw him, he said it made life so much easier to figure who I was.  I was his longest girlfriend at the time because I took time to see pass  his  prosopagnosia .  \n\n\nIf she was mature enough, she would have been worried and not angry when you didnt recognize her.  She  needs to grow up and apologize.", "OP, I’m so sorry you’re going through this. Find someone who has the patience and compassion to be a partner for you in this. Those people exist. \n\nAlso give gf some time. She’s likely experiencing her own sadness and anxiety related to the situation. Sometimes people read about something, but it doesn’t become REAL until they actually encounter it. Don’t apologize, let her come to you. If she doesn’t, know you’ll find someone who’s able to be there for you. NTA.", "I've learned to pick out people by their gait or the sound of their foot falls when I don't know what kind of hat/hairstyle they have. A friend of mine was prone to changing her hair colour every few weeks.", "no, actually. that's not a reasonable time and place to have that reaction. why tf would him not recognizing her cause her to panic and forget that he can't recognize ppl? that makes no sense", "Doesn’t sound like she was panicking. She knew what she was doing, standing there saying nothing. She was purposefully testing OP. She’s had time to read his messages and process and yet she made it about her, not him, the one with the TBI. Her actions are already telling.", "The Power of Love Is bullshit. The power of traumatic brain injuries, that's where the money's at", "I wouldn't want a girlfriend like that for my worst enemy i dont get why youd give suggestions, it would only damage op", "Woa, I'm sorry it must be quite bad but this is really fascinating. Thanks for sharing.", "Sounds like she couldn't. She is just a girlfriend not a spouse. The hospital probably wasn't letting in visitors that where not family until just then.", "Neurological conditions are different in some ways than physical ones - they are unseen, so someone looks the same, and they get at our very being, we’re just a very sophisticated bundle of nerves walking around in a meat sack. When I don’t recognize someone immediately, it can come off as not caring about them, that their efforts towards me haven’t made enough of an impact for me to even bother remembering. It’s not what going on, but it feels belittling and demoralizing to the person I don’t recognize. Their feelings are valid, even if they would be different with the full context. We never have the full context, so we give people grace instead.", "I’m just one of those people who doesn’t use names in conversations. “Hey, how’s it going? What have you been up to lately?…” Eventually, they give enough context clues for me to figure it out. Usually.", "If you don’t know someone has it, being forgotten can feel demeaning, like you’re not important to that person. And I don’t go around telling everyone about it, so I give people grace to be offended. Their feelings are valid even if misguided in the full context.", ">or he could write \"this is your ex gf\" on her forehead.\n\nHahahahahahahahahaha. Amazing. I needed that laugh today.", "Lol, comment straight out of r/seducingwomen", "lots of ppl live through shit like this. if she deals with this by making it about how insulting it is to her that's not an average reaction. ngl you might want to rethink how you've reacted in similar situations if you think this is normal. i'm willing to bet you owe some disabled ppl in your life apologies", "I never visited that subreddit so you clearly know it better than me, ironic", "I have an amazing photo from my wedding of my brother shaking hands with an old acquaintance of our parents. The photographer perfectly captured the look in his eyes of \"who the heck is this guy who seems to know me.\" Fortunately I don't think the acquaintance noticed.", "How tf is your brother supposed to be responsible for something SHE dreamed up? What if he dreamed she was cheating on him with some guy from down the streets? Would she also be made to apologize or would that be considered him \"being completely rediculous?\"", "That's definetely true, but these kind of reddit posts always remind me of one question: What's your goal here? Do you want to be right, or do you want to be happy?", "I suspect I have both undiagnosed autism and adhd, and it's similar for me. Certain people's faces are clear enough I can call them up in my memory and see them pretty distinctly at least some of the time. Which I don't believe people with true face blindness are supposed to be able to do. But other people I don't recognize when I should,  and I seem to have trouble \"processing\" faces. \n\nY'all ever seen that show Orphan Black? It's not a spoiler to say that the premise is the main character keeps meeting identical twins, because secret cloning project. All played by the same actress, who was amazing. But they would introduce a new character and I'd be looking back and forth between these two people who are literally face to face on the screen, and struggling to tell if it is in fact the same person and here's a new clone.\n\nAlso struggle with those dramatic TV moments where like, the hoodie is pulled back and DUN DUN DUN! the killer is revealed! And I'm sitting there like, is that the husband? Wait, I think it's the cop...\n\nNames as well - once a former coworker stopped by to say hi when I was the only one there. I recognized her but wracked my brain for months afterwards trying to come up with her name and absolutely could not. Of course she was like say hi to everyone from me! But i never mentioned her stopping by because I couldn't come up with her name. It's like it was permanently erased from my brain", "I've had prosopagnosia all my life. As a child, I hugged a neighbor lady at a party (thinking she was my mom). I've failed to recognize my best friend when encountering him on the street. I've failed to recognize my then-boss when I randomly encountered him in another city.\n\nRecognizing faces is known to be handled by specialized parts of the brain, and you and I have substandard hardware in that regard.  (This isn't indicative of stupidity, mind you - I'm a successful software engineer and a published author. The brilliant neurologist Oliver Sacks also was faceblind).\n\nI've learned to adapt, over 40+ years of dealing with this condition. I recognize people by voice, by situation, by hairstyle, by clothing, by mannerisms. You're still learning to deal with this! You can't be an expert in these techniques in such a short time.\n\nNTA. If your girlfriend is insisting on centering your trauma around herself, she most certainly is TA.", ">but the shock of it is still going to hurt her. \n\n\"Hey I have this specific condition that prevents me from doing X\"\n\n*Can't do X*\n\n\"Wow I can't believe you can't do X!!!\"\n\nWould you have this same energy if she was mad he didn't get up to give her a hug as a paraplegic?", "> She was had the mindset that you would undoubtedly recognise her,\n\nWhich goes completely and utterly against everything he's told her about this condition. That's like getting surprised when a person with albinism turns down a beach invitation.", "Something wrong with HER medulla oblongata", "GF has all the energy of a family elder getting pissed off that a recently paralyzed member of the family didnt stand up to properly greet them", "If you don’t mind my asking, how do you handle TV and movies? Can you recognize the characters long enough to watch the show, or are they just interchangeable figures to you?", "In another post OP says she sounded straight up angry, not panicked.", "I think the GF is in shock and also grieving which can bring out the worst in people. It probably seems as if her BF is gone forever.", "It really depends haha if the characters all look very similar I can get confused (I will watch movies not realising that there are 2 characters not 1 sometimes lol) but tbh there’s usually enough work done by hair and costumes and also context cues that it’s obvious. I will often read the Wikipedia summary for help. Game of thrones took me 2-3 seasons to be able to identify characters and figure out what happened because there were so many characters and they were dressed similarly enough.\n\nI can recognise faces somewhat but I am not as accurate as others. If people are very obviously different in predictable locations it’s easier, or if I am regularly seeing them it’s easier. If people are in an unexpected environment, people look similar, or I haven’t seen people in a while I will get confused.", "holy fuck. what a vile person.", "I worked with people with different types of brain injury for over a decade, and  so many people tend to lose a lot of their social network after an injury.  They'll often say how their injury showed them who their real friends were.  A common thread is that invisible disabilities are much harder to get across to others than any kind of physical problems. People will accommodate a paralyzed arm way more easily than they will someone with memory problems.", "If it helps, people have been really nice about my husband's face blindness. I have pretty distinctive hair and glasses so most of the time he recognizes me. But he's walked right by me in restaurants and on the street and one time he thought someone else was me. This happened more than 10 years into our relationship. He probably apologized because that's just his nature, but I don't think he should have. \n\nIt doesn't happen a lot because I have adapted to it. When I'm meeting him I immediately greet him in a way that lets him know who I am. \n\nWhen we're getting to know new people, I often discreetly tell them about it so that he doesn't have to. I tell them the stories about the times he didn't recognize me. I think that usually brings it home to people. If he doesn't recognize his own wife, it's hard to get offended if he doesn't recognize them. \n\nI usually disclose his social anxiety at the same time (part of the reason I'm doing the disclosure about his face blindness). Half of the time people self-disclose back about their social anxieties, introversion, or other mental health issues. But they're always understanding.  \n\nPeople are pretty live and let live here in Queens so that might be contributing to it. When you're cramming immigrants from a few hundred cultures and dozens of religions into a very densely packed area, you learn to stop expecting people to conform to your expectations. I think the younger generations are also helping as they have a lot more awareness about mental health, etc (we're Gen X).", "I think the point of that anecdote was probably asking is it worth it to die on this hill and be right? Sudden disability is hard on the person affected, but it still affects those around them and especially partners. When you share your life with someone, you inevitably end up sharing some of the hardship of your disability and it's still an adjustment period for OP's gf. I think she can't relate so it's hard to understand right away and she naively thought somehow she was going to be an exception. He said she hadn't even had a chance to see him in hospital until that time. I'm not sure how long/serious their relationship is and many things depend on that.\n\nI don't think it's right to demonize her for not accepting it right away because a TBI changes a lot about what is possible in their relationship and puts limitations on them that she probably didn't expect. It's up to OP if he wants to give her time or feels it's not worth the added stress. But I suppose I'm trying hard to be kind because I feel I know a bit what she's going through. My partner experienced a physical injury (spinal injury though, not brain) a few years ago and I definitely felt frustrated at the loss of potential goals, the reality of adjusting to his loss of mobility and the way it affects both of us, and just a million small things. It took about a year for us both to come to terms with what disability means and how it changes your life. And yes there was a period in which I wondered if I could do this for the rest of my life - live with the limitations of including him in all the things I want to do despite my otherwise active and able bodied lifestyle. He had to learn to ask for help, and to not take out his frustration on me when he failed to ask and pushed himself too hard, or when he refused to accept help and had to live with the consequences (a lot of pain). I had to learn when to offer my help, to do it more often, and to accept that I can't assume he will be able to assist on certain things because it's outside of his abilities now. I learned to ask \"do you think you can handle this?\" and he had to learn that sometimes the answer is just no.\n\nEdit: for OP and his gf the adjustments are things like can she handle needing to remind him who she is? Maybe they can come up with a routine every time they reunite. Can she support him in reminding him who other people are in a kind and sensitive way? Can he get past the embarrassment of needing that help? Can he devise strategies to identify people that doesn't include coming right out and saying \"who are you?\" to their face which rightfully hurts some feelings sometimes", "Agreed. Once you realize it was only a dream (usually when you wake up,) your response should be hugging them and being grateful it wasn’t real. I had a similar dream a couple days ago. It seemed so real. When I woke up and saw him there I hugged him and told him about it. Of course we joked about it throughout the day. That’s how normal relationships work.", "NTA. And her young age probably explains the immaturity. Maybe you should've sent her a 30 second max TikTok that explains your condition instead of expecting her to actually read a few articles. lol", "Yeah, sure have him offer an apology.\n\nThen when other people post about acquiescing to other people in their life like this, you and the other terminally online people can call them doormats.", "Can you still watch TV and movies? Being able to tell who is who seems a very important part of them.", "She’s a girl lol, reverse the genders this sub would be calling for the boyfriends head much more harshly. Instead it’s the lame excuses", "That's why he sent her all the information regarding the diagnosis in the first place though - so that she could hopefully read and understand what things are going to be like for him to minimize the inevitable shock.\n\nIt seems she didn't even try to do so though.\n\nShe had every right to be startled by his reaction in an underestimation kind of way, but her lashing out does nothing but harm. There was no attempt at understanding which is why OP is firmly NTA - she was an asshole to him because she didn't take the time to try and understand what she might be walking into with OP going forward.", "yes but I often think that three different people with the same hair style are the same person, lol.  I have to go by voice.  But one cool thing is that I can identify pretty much any voice I've ever heard - the voice recognition part of my brain must have compensated.", "My dad's always had a full beard and mustache. One time, his barber made a mistake and had to shave him completely. I saw him walking up the driveway and had NO IDEA who he was.", "lol um yes. OP explained his medical diagnosis and even sent her articles and information about it so she’d know what was going on she’d be able to have an idea of how to react/what to do, but then she gets there and does that… \nso she either just ignored his messages and the information he sent her, or she just disregarded it. unless she has some sort of mental illness or something that takes her reaction out of her control, she is 100% an AH for her actions starting the moment she walked into OP’s room for the visit", "My theory is I usually just say hi to people I think I know, and if I work out I don't, I get out of there and let them wrack their minds trying to recall me. You do get pretty good at conversations where you are trying to get identifying information out of people while covering your bases.", "I feel his pain! Because yep, that's me, pretty much every day, lol! I saw someone in the grocery store last week, and I knew that I knew her, but I couldn't place her. I started panicking as we started talking and she obviously knew me well; I finally realized that she is the receptionist at my dentist office, where I've been going for over 15 years! But yeah, if I see someone outside of their \"normal\" setting, all bets are off.", "Is it dogs. Because dead ass i feel like I can learn to tell dogs apart faster than humans.", "That’s hilarious! 😝", "My husband and I have entire conversations about our neighbors - some of whom are genuinely friends - this way.\n\n\"Spot's dad invited us to a block party this weekend.\"\n\nThe dog's name is alongside the human's name in my contacts.  Or it's just the dog's name if I never managed to learn / remember the human's name.", "God yes, that's everyone at the dog park. Every once in a while my neighbor who walks there will use a \"people name\" and I'm like \"right... people have names... who's the dog?\"\n\nThen again, I once had a very nice passing chat with someone from the dog park while we were at the grocery store. I still have no idea who she was without her dog."]}