{"id": 11856, "submission_id": "11mqnsm", "title": "WIBTA for calling myself a mom as a guy in front of my gf's parents?", "selftext": "My parents died in a car accident when I was 22. They left behind me, my little brothers (16, 13) and my baby sister (1). While grieving their death, we also had to figure out who would take care of my baby sister. I had just finished my studies and was looking for a job, but all of my relatives were living abroad. Wanting to keep my sister close to her brothers, we decided that I should be the one to adopt her. My grandparents moved in temporarily with us to help me raise her and my brothers.\n\nMy sister already started calling my parents mama and dada, but didn't have a name for me yet. You can only imagine how surprised I was when she started calling me mama. At first I tried to correct her to use my first name, but she insisted on calling me mama. Once my grandma told me that my sister probably saw in me what she saw in my late mom, I felt so proud of myself and wanted to embrace it. So I also started referring to myself as mama next to her, and it was almost as though that nickname also altered the way I treated her to be even more maternally. She's now 10 and still refers to me as if I were her mom. She obviously knows that I'm her brother, but we've been playing this mother-daughter game for too long that I've practically become her mother. As a gesture, I also started referring to her as my daughter. I stopped caring about others' opinion on that matter long ago, I'm not questioning my masculinity or my sexual orientation, this is just an affectionate nickname. I feel proud of calling myself a mom, it's my greatest achievement in life, I've earned something that most men haven't.\n\nIt did affect my past relationships though. Some people just can't accept a straight man calling himself a mom. I've been dating my gf (27) for 2 months now, and I'm pretty sure she's the one for me already. She finds it cute that I'm comfortable with my sister/daughter calling me mom, and they get along very well. The only problem is her parents. My gf comes from a very conservative house, and she's certain that her parents wouldn't be too fond of me calling myself a mom. Now, I'm going to meet them for the first time this Saturday, and I'm sure they'll ask about my family and I want to be honest with them from the start. My gf thinks this is a bad idea and that it'll leave a very bad impression on them, and suggests to just never mention it to them because it's not that important. I don't agree with her, because sooner or later they'll find out, and I think it'd be better if I just dropped it now instead of trying to hide it. I plan on telling them, and if they don't like, then so be it, they'll have to get used to it eventually. Obviously when I'll have my own kids I'll have them call me dad. WIBTA for doing that against my gf's concerns?\n\n&#x200B;\n\nEdit: Might be a little late for an update, but I think I owe you one. It took me a couple of hours to read every single comment you wrote, and I'm so touched by the amount of positive reaction that I got here. I'm writing this with teary eyes, I'm not very used to getting compliments. Thank you so much for that!\n\nIt seems like the consensus of \"crossing the bridge when one comes to it\" is really the way to go here. So I'm only going to mention it if/when it comes out naturally and hope for the best.", "created_utc": 1678364066, "permalink": "/r/AmItheAsshole/comments/11mqnsm/wibta_for_calling_myself_a_mom_as_a_guy_in_front/", "score": 1545, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I adopted my baby sister after my parents died, and she started calling me mama. I kept along with it and consider myself her mother now. I want to be as transparent as possible with my gf's parents and plan on telling them about it, but my gf thinks that it'll unnecessarily tamper and leave a bad impression on them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nBut remember the way you tell it, might make a big difference. I recommend to tell it like the story, you did above. That she started to call you mom, you tried to correct it, but it became a running joke in your family. The only thing you could do was embrace the nickname.\n\nIt's close enough to the thruth. If you start telling that you are a mom to a 10 year daughter, They could have a problem with it. This way it's just a cute story.", "Who on earth would get a bad impression on anything here? You stepped up when you were barely more than a kid yourself and took on a massive responsibility. You should be proud of yourself and your gf's parents should be proud you're with their daughter! \n\n'Mom' is one name you go by, 'Hero' should be another! NTA", "NTA! This is something between you and your daughter. Who cares what other people think when you’re absolutely fine? And to be honest, anybody who is offended by you calling yourself mom has to go get psychiatric help. My whole family calls me grandma (I’m a guy and certainly don’t have grandkids) and there have been exactly zero people who had an issue. Anyway my advise is to run from conservative people as they often are the most hypocritical individuals out there. ‘Shouting really loud that you’re against LGBTQ+, but sneakily getting rear ended by a bear in the bushes at a local truck stop’ -kind of people.", "NTA- it's something you and your sister do and probably have no plans of stopping so I see no reason to hide it. Honestly I think the story of her being raised by you and continuing to nickname you Mom is cute. If it upsets them that sounds like a them problem, they can't exactly tell you not to continue. And if your girlfriend truly isn't embarrassed by it I see no reason to hide it at all but that's just me my family is unapologetically themselves.", "NTA I'm very touched by your story and think it's wonderful that you stepped up to take care of your siblings; even more so that you've done such a great job and have such a bond with your daughter-sister. I have serious misgivings about your gf if she would expect you to hide something so special about yourself.", "Nta. First off, didnt know I was going to CRY this morning from feels, second, i would lose my marbles if people made a big deal about that. \n\nShes literally a child and its everyones way of coping with grief. I would tell them the story. And if they object, seriously fuck them. Its a child who lost their parents. I hate patriarchy. Be her mom, bro.", "NTA - it’s your family. If she is going to be in your life her family is going to find out eventually. If they don’t approve because of their conservative politics you can always point out that you went out of your way to keep your family together and adopt them. It’s a nickname and provides comfort to a kid who lost her parents. The real question would be how your GF may respond in this situation. \n\nIs it a tad weird? Yeah. But you tried something else and she insisted you’re mama. You made an effort to “correct” this already and it’s clearly not going to change until she wants to change how she addresses you. If anything, it shows you listen to others and care for your family (family values are also conservative points) \n\nHonestly, this seems like a green flag as well. Could simply address this topic as “I want to make my family happy” and how your family Is already atypical/nontraditional due to the circumstances.", "NTA\nYou sound like a damn good mama and you earned it.\n\nYour girlfriend's parents can be as conservative as they want but at the end of the day, they haven't walked in your shoes and they have no right to judge.", "YWNBTA. \n\nIt’s better to find out sooner if you’ll need to drop someone then have it strung along and get more feelings. If they have a problem with it then they are not good people. \n\nIf conservative = Christian and they have a problem with this especially after hearing the background story. Then they are not worth your time. \n\nI suspect your gf is actually embarrassed and worried what her parents think.", "NTA. In no way justify any of this to your GF’s parents. You provided a home and love to your sibling when she was unable to care for herself, under tragic circumstances. If their ‘conservatism’ doesn’t include your actions… they can go to the beach with their favorite hammer and pound sand.", "Tell them she's your adoptive daughter and sister, but by no means change anything about your relationship just because they're bigoted.", "NTA your whole family suffered MAJOR trauma, and it sounds like you all have come out the other side thriving despite the trauma. How dare your gf suggest you hide _your_ story?\n\nAnyone who would read/hear that story and think anything other \"what an amazing family\" is not worth your time. I know you really like this girl, but what she said is hurtful. She could try explaining it to her parents herself and save you the heartache. If she can't be supportive her- not even supportive but celebrate you and your awesome family? No way.\n\nI really hope she changes her way of thinking and her parents are more open minded than she thinks. You seem like an awesome person. Good luck OP!", "NTA. 100 times over. You should compromise and maybe tell them on your second visit? Not that they should think of your lil sis calling you mom after the tragic loss of your parents in any other way than a sweet bond between siblings. They’d have to be pretty heartless to judge you harshly for that.", "NTA. Gotta respect your relationship with your kid first. Your logic of “I’m not going to hide things forever, why start it now?” Is pretty reasonable.", "NTA. both of you should just opt out of giving a shit what they think of this particular issue. just smile if they're mean.", "NTA this really touched me.Wish you guys the best", "NTA. It is your story and how you and your sister got over the loss of your parents.\n\nIt is a really nice story and unseratandable why you liked the nickname. Maybe start with those points. That you lost your parents at 22 and raised your siblings. Espetially your sister like a daughter. And that the one year old gave you the nickname 'mom'. You like it because of the reasons you mentioned here. And maybe because it has reminder of your parents in it? Like you are not her father and never wanted to be, because she had a daddy who sadly died. But you cared for her like a mommy and everyone knows, that you are not a mommy by biology - so it doesn't take that aspect away from your late mother?", "NTA!!! This made me tear up. If they have hearts they won’t be weirded out. You have nothing to hide. Bless you for stepping up.", "I guess I don’t understand what the big deal is?  I come from a pretty conservative background and I can’t think of anyone who would have been upset by this.  Would they have teased you for it? Absolutely.  But it sounds like that wouldn’t bother you so who cares?  To me it’s super weird that she would make a big deal about it.  The only thing I can think of is maybe you make it weird by talking about it/bringing it up in a weird way or more often then is socially normal?  Aside from that I wouldn’t worry about it if I were you. They are parents and might ‘get’ it more then she thinks.", "Correct me if I'm wrong but factually  \n\\- you are biologically male  \n\\- You have raised your sister after your parents' death.  \n\\- She calls you mama and you are OK with that.  \n\\- You are legally and in all terms and such a parent to your sister.\n\nIt's a nickname. If you want to keep it technical call yourself your sister's legal guardian and parental figure. This is what you are on paper. You can mention that she calls you mom as a nickname although you identify as a man.   \nBecause trust me, you are a good man for stepping up to the situation when it arose.   \nIf they really fall over a NICKNAME for crying out loud they can't do you, your actions and your sacrifice justice.\n\nNTA.", "Nta\n\nIts just a name. Anyone who has a problem with your family dynamic is an ah. You are doing nothing wrong, nothing to harm anyone, just providing for your family.", "What a perfectly lovely story! Thank you so much for coming here and sharing it with us!\n\nNTA", "NTA. it's a bit non standard but you shouldn't have to alter this relationship you've had with your family for years just because it makes someone uncomfortable.", "NAH. But if it costs you a relationship does it matter what we think?\n\nYou are right that they will find out eventually and will have to get over it. However she is right that it probably won't be the best first impression. \n\nThere is a reasonable compromise between \"tell them the first time I meet them\" and \"hide it for the rest of our relationship\". Like even the second or third time would be a lot better.\n\nAlso its definitely weird even to people who aren't super conservative. Not with you being given a parental title but with you being given the one meant for women when you have always identified as a man. It would be like Tom Cruise calling himself an actress.\n\nLike, men can be loving, nurturing, wonderful parents too. It's weird that you say being called mama maybe you be more \"maternal\" which points to some gender stereotypes you hold about parents.", "NTA\n\nSingle parents often refer to themselves as both “mom & dad”. There’s no right or wrong nicknames. If people have an issue with it, that’s their issue. Your gf needs to realize it’s her parents that have the problem, not you & those are her people to manage. It’s their problem, let them solve it.\n\nHopefully, your sister has not experienced any negative backlash about your nickname. That would be a problem for you.", "NTA, but you might want to bear what your GF says about her parents and not spring it on them the first time you meet. If she really is your forever person, you'll have plenty of time to show her parents that side of you, so why not wait a little bit so they can get to know and love you without their conservative biases getting in the way?\n\nEdit: typo", "Your reality overrides their ideas.\n\nNta", "NAH - you need to be honest with your gf's parents, but your gf is also right to be concerned about how they react (particularly on your first visit).\n\nIntroducing yourself with 'I'm a mama' might not be the best move, but saying something (at an appropriate point in the conversation) like 'I've adopted and brought up my baby sister, she insisted on calling me 'mama' when she was 1 and it's stuck, so I call myself her mama'. That's being completely honest and gives the context that explains why you call yourself her mama. You should probably tell your gf that you'll explain this when an appropriate moment arises (e.g. if they ask if you have any siblings); if they really can't accept this, then it's better to know sooner rather than later.", "Surely the answer to this is:\n\nFirst Visit: \"I'm comfortable with kids because I had to become a parent to my younger sister when my parents died.\"\n\nThird Visit: \"My baby sister calls me 'Mom' sometimes as an inside joke.\"\n\nTenth Visit: \"Actually, my sister calls me 'Mom' a lot and I don't mind it. I'm not gonna correct her because our actual mother isn't around and I have to fulfill the parental role.\"\n\nLet your future in laws get used to the truth in bits.", "Honestly NTA. This is about a relationship that involves only 2 people, you and her, and only you get to decide how it works. Also I grew up with a lot of this so it's not strange at all to me. My cousin calls our grandma \"mom\". My mom calls her dad the term for older brother in our language. My dad used the term for older sister for his grandmom. One of my friends refers to her sister as the term for older brother, even though she is a girl. Its alright, dont sweat it. And if someone else doesnt understand, well it isn't for them to understand in the first place.", "NTA", "What’s important here is how your daughter feels.  She insists on calling you mom, so that’s what it is.  End of story.  It’s an added plus that your girlfriend backs you on this.\n\nNTA.  If girlfriend’s parents have a problem with it, simply don’t be around them.", "NTA. This is utterly adorable. If her parents have a problem with it then they probably would have a problem with your daughter/sister. After all she’s the one that gave you the name that stuck.", "I don't think you would be an asshole for it, but I'd probably listen to your GF, she's probably spent a lot of time handling her parents conservativity, so she probably has some expertise. If the topic comes up, I'd just tell them that she's your sister and adoptive daughter. If your daughter is around and refers to you as mama, I'd just act like she called you dada and if her parents bring it up just act like it's strange that they brought it up at all. It is strange tbh for them to bring it up. Her reference to you as mama because she sees you as her mom is probably the sweetest story I've ever heard, and I'd gaslight all the conservatives in the world on a whim, let alone for a legitimate reason like this. NTA but if you wanna be, it's justified.", "This is the most adorable story and NTA but I'd listen to your gf because she knows the situation and you have never met her parents. Maybe they don't need to know right upfront about a playful nickname your sister has for you. Maybe that's information you could introduce later?", "I will go against the crowd here and commit karma suicide ! \n\nI think the distinction of mom and dad is a bit narrow minded! Personally I know many parents where all the love, nurturing, care and pure parenthood came from the father, and all the neglect, abuse, trauma came from the mother! What I am trying to say is mom/dad word means absolutely nothing! There are only good parents and horrible parents. \n\nSo your sister/daughter likes to consider you a mother. This is absolutely 100% fine and good. But the word itself is not what gave you all the love and care you carry for her. It is you who are a wonderful person who have filled the role. \n\nSo, do I think if you just out of the blue went up to them and said : this is X, I am her mother! YBTA? I think you might be! It tells nothing about you other than weird. \nIf you went up to them and said: this is X, my adopted daughter. She calls me Mama, and I feel proud she thinks this way. Then you will be fine. \n\nSo I agree with your GF, no need to focus on the term and fight for it unprompted is uncalled for and don’t really reflect all your hard work. Just gently explain it to them the way did for us and they will like you.", "NTA- if this is the strangest or most off-putting thing about you, they should count themselves damn lucky.", "NTA ---  The only thing I can could add to all the positive reactions that you have about this whole situation is if they are going to get butt hurt about what or how your sister calls you then that sounds like a them problem and something THEY need to work on you do you and keep doing what you are doing, you and your family are awesome.", "NTA. Don’t try to hide it, explain to them how you explained just now and it’ll be fine", "NTA. You did what was best and needed to help you and your siblings grieve and stay together as a family. If the gf's family doesn't like your relationship with your sister, tell them to go away. Do not let someone who is on the outside and their opinions change what is beneficial for all involved.", "NTA. If your background story leaves a very bad impression on them, they are not worth your time.\n\nI know you really like your girlfriend, but she thinks you should accommodate her misogynistic parents and that it's no big deal. It IS a big deal. You don't want that example for your sister-daughter and your future other children. There's absolutely no shame in your sister-daughter calling you mom or you calling yourself mom. Instead you should be very proud of yourself for stepping up and taking care of your siblings at such a young age while grieving your parents. And your girlfriend should have your back.", ">My gf thinks this is a bad idea and that it'll leave a very bad impression on them, and suggests to just ***never mention it to them*** ***because it's not that important.***\n\nSo I guess she doesn't see a long-term relationship with you in her future. Because if she did, she would realize her parents would be having interactions with your siblings in the future.\n\nThink about that - and maybe discuss it with the GF. Her parents don't necessarily need to know that your sister calls you \"mom\" the first time you meet them, but they should be told that you helped raise your siblings including your baby sister from the time she was a baby.", "NAH\nYour girlfriend is worried how her family will react.  Your don't want to misrepresent yourself. Both are fair, non AH behaviors.  I'd play it by ear. Don't force it, but if asked: answer. Being called Mama shouldn't bother anyone, starting a conversation with \"I'm the Mama\" might.\n\nA conservative family should appreciate that you put part of your life on hold to support your family and adopt your daughter.  They should also appreciate that you act as both a mother and father to your daughter.", "NTA. What your adopted daughter/sister calls you is between the 2 of you. However, the common term for a male parent is “dad” or “father” or some variation on that.  What I find odd in this situation is that you identify yourself to outsiders eg your girlfriend’s family, as a mom & not a dad. If I was just meeting you, I would wonder what that said about your views of the roles of mom & dad in parenting and how they differ. It gives the impression that you think being a mom is either better than being a dad or at least fundamentally different than being a dad. How so? Do you think moms are responsible for all or the majority of the heavy lifting of parenting, like you are, & dads aren’t? If you have other children & identify as their dad, are you going to expect their mom to do more of the hands on child care than you do? I think conservatives would be more on board with your description of yourself as the mom, since it’s a conservative view that moms are primarily responsible for taking care of kids. It’s people with a more egalitarian view of life who will wonder why you don’t think dads can be the primary caregiver.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy parents died in a car accident when I was 22. They left behind me, my little brothers (16, 13) and my baby sister (1). While grieving their death, we also had to figure out who would take care of my baby sister. I had just finished my studies and was looking for a job, but all of my relatives were living abroad. Wanting to keep my sister close to her brothers, we decided that I should be the one to adopt her. My grandparents moved in temporarily with us to help me raise her and my brothers.\n\nMy sister already started calling my parents mama and dada, but didn't have a name for me yet. You can only imagine how surprised I was when she started calling me mama. At first I tried to correct her to use my first name, but she insisted on calling me mama. Once my grandma told me that my sister probably saw in me what she saw in my late mom, I felt so proud of myself and wanted to embrace it. So I also started referring to myself as mama next to her, and it was almost as though that nickname also altered the way I treated her to be even more maternally. She's now 10 and still refers to me as if I were her mom. She obviously knows that I'm her brother, but we've been playing this mother-daughter game for too long that I've practically become her mother. As a gesture, I also started referring to her as my daughter. I stopped caring about others' opinion on that matter long ago, I'm not questioning my masculinity or my sexual orientation, this is just an affectionate nickname. I feel proud of calling myself a mom, it's my greatest achievement in life, I've earned something that most men haven't.\n\nIt did affect my past relationships though. Some people just can't accept a straight man calling himself a mom. I've been dating my gf (27) for 2 months now, and I'm pretty sure she's the one for me already. She finds it cute that I'm comfortable with my sister/daughter calling me mom, and they get along very well. The only problem is her parents. My gf comes from a very conservative house, and she's certain that her parents wouldn't be too fond of me calling myself a mom. Now, I'm going to meet them for the first time this Saturday, and I'm sure they'll ask about my family and I want to be honest with them from the start. My gf thinks this is a bad idea and that it'll leave a very bad impression on them, and suggests to just never mention it to them because it's not that important. I don't agree with her, because sooner or later they'll find out, and I think it'd be better if I just dropped it now instead of trying to hide it. I plan on telling them, and if they don't like, then so be it, they'll have to get used to it eventually. Obviously when I'll have my own kids I'll have them call me dad. WIBTA for doing that against my gf's concerns?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - but what kind of “conservative” is her family that they wouldn’t be proud of a older brother raising 3 siblings on their own, regardless of nicknames. I thought my parents were super conservative but they wouldn’t even blink an eye at your daughter calling you mom unless you forced her to.", "NTA, and this is honestly kind of an adorable story. You're a great mom, my dude :)", "NTA be honest about your family if the topic arises. I agree, you shouldn't hide parts of your life. But I don't think you need to go in and announce it fiest thing, just wait for the topic to come up naturally and be honest. If they have a problem with that, that's on them. Also if your girlfriend doesn't tell them to stop/back you up that's a potential red flag from her. And red flags are best to find early on.", "NTA - But it's on your GF to tell them ahead of time. SHE needs to present it as that is how your baby sister, fresh after losing her mother, insisted on calling you, so you embraced it and it became a nickname.\n\nIf she is worried about their responses, it is on HER to mitigate it, not on you. You owe no one any apologies or explanations, frankly, and if they don't like it they can take a long jump off a short pier. Their opinion doesn't matter and no one needs to hear it.\n\nHer worry, her concern = HER handling it, because it is not going to change.", "This story is so heartwarming, I think if you just tell them what you wrote here they will fall in love with you. If for some reason her parents don't \"get it\", then who cares... You've done amazing job raising your sister and you don't need their approval to know what a great guy you are. Not a lot of 22 yo's would've stepped into the role of caregiver like that, I think your parents would've been very proud. You sound like a great mom. NTA ♡", "NTA. I agree with the consensus here (waiting for the appropriate moment to say so, telling the whole story...). But I would also add that if your future in-laws don't think you are the most fantastic guy their daughter could ever be with after all the responsibilities you assumed from a very young age, and with great success, including becoming a mother figure, well, they are hopeless.", "NTA\n  \n  \n  \nbut I would highly recommend sitting down with your gf beforehand to explain why you want to do it(and that you want to do it like how the top comment suggests; telling the full story like how you did in your post) and give her a good reason as to why, such as for it to not be a massive shock to them if they ever end up meeting your siblings, \n  \n  \nI would also include something about how you have a lot of respect for the women that put in the time and effort to earn the title \"mom\" instead of just checking out after the pregnancy and settling for \"biological mother\"(or if they are particularly nasty or absent, earning the disrespectful title \"egg donor\")", "NTA this is a cute nickname/story with your sister, a bright spot in a tragic situation.  \n\nBut I wouldn't introduce yourself as a mom.  If you talk about your family, explain the situation of the accident and adoption, and if you then want to venture into it, explain the nickname and that it's just something between you and your sister.  You don't even have to talk about it on the first time meeting them, or even the second or third, whatever you are comfortable with.", "NTA, but I would wait for an appropriate time to tell the story. It might be when you first meet them or 6 months from now. If they can't accept it then F them, but it sounds like you are going in on the defensive with pre-conceived notions. You nor your girlfriend know how they will react. They might be cool with it if you don't scare them off first. Give them a chance to get to know you. BTW, very admirable stepping up for your family!", "NTA, and explain that story, or tell them as a family joke you went from Mr. Mom to just mama. If they can't accept that their daughter's boyfriend is such a family guy that he sacrificed to raise his sister, they're idiots.", "NTA You don't need to turn it into a big thing. Mention it very casually \"I've been raising my sister since she was a baby. She started calling me \"mom\" when she began to talk, and it stuck\". Then just move on to admiring their family heirlooms.    If they are decent people, they will follow your lead and not make a big deal about your relationship with your baby sister.", "NAH, but I think you need to think seriously about this part of your post.  \n\n\n>My gf comes from a very conservative house, and she's certain that her parents wouldn't be too fond of me calling myself a mom.\n\nYou sound like an awesome guy and you have done a great thing for your sister/daughter and the family as a whole, but your girlfriend is right. In these days of preferred pronouns and fluid gender identities conservative parents might flinch when you refer to yourself as \"mom of a 10 year old girl\" during the first meeting.     \n Just tell the story as you did above so they have some context, and then you can refer to yourself however you wish.", "Bahahaha this is funny. A man becomes a mama. Niceee", "YWBTA. Nobody cares  about your silly little language quirks. You don't get to rewrite the English language. The term Mother is a gender term. It means a female that gives birth and/or cares for offspring.\n\nYou can go by whatever name you want. And your sister can call you whatever she likes. That doesn't change the usage of millions of other people.\n\nGreat job stepping up for your sister but you're focused on the wrong thing here. The title. You sound like a weirdo and you're going to make her parents confused with your humblebragging. Did your sister come out your vagina? Did you breastfeed her? Then why this insistence on calling yourself a mother??\n\nYou're not a mother and you never will be. Language has meaning and you don't get to subvert those meanings in other people's lives. The word Father too difficult for you? Parent?", "This.  Your sister had already lost both parents, and as a loving sibling/adoptive parent, you didn’t want to add even more emotional hurt to her plate by dictating that she couldn’t call you the name she wanted.", ">remember the way you tell it, might make a big difference\n\nAdding onto that, I wouldn't crowbar in the story in your haste to get it over with, OP.  If it comes up naturally, fine, but getting into nitty gritty details is a lot for a first meeting.", "I’m guessing if OP says he’s a mom without context it could come off as an odd joke? but so long as they have any idea about OP’s situation there shouldn’t be that issue", ">getting rear ended by a bear in the bushes at a local truck stop\n\nI.AM.HOWLING 🤣", "No it isn't. Why should OP tip toe around his girlfriend's parents and their misogynistic views? Because he might upset the misogynists by not complying to their outdated ideas on men and women? There's nothing wrong with his sister-daughter calling him mom and with him referring to himself as mom.", "...wtf did I just read?", "I simply call myself mom because that's how my daughter calls me. I plan on raising my future kids the same way I raised my daughter (hopefully with making less mistakes).\n\nMy gf is mostly concerned that her parents would see me as a lesser man and thus not a good match for her, so they wouldn't support our relationship.", "> If I was just meeting you, I would wonder what that said about your views of the roles of mom & dad in parenting and how they differ.\n\nTbf, all the stuff you typed after that can be dispelled by going\n\n\"Why mum?\"\n\nAnd OP goes\n\n\"Oh she called me mama from an early age and it stuck, just a cute injoke\"\n\nAnd then it's resolved.", "There's nothing wrong with it, but I think if it's the first detail that OP's in-laws learn about him they're gonna have trouble getting over that and learning more about the type of man he is.\n\nI think his in laws will be happier with OP's sister calling him mom if they understand the context better.", "a whole lot of BS...", "Who can say? If you are concerned about your reading comprehension, this sub isn't going to help you.", "If her parents would see you as a lesser man because of the use of a three letter word, that's their problem. You shouldn't have to hide it or lie about it.\n\nIt's very funny your sister-daughter chose to call you mom when she was only a 1y.o. and it's very cute the nickname sticked. It shows that you and her have a great bond, so you did well. I think your sister-daughter calling you mom shows you're a great man (and not a lesser man).", "Oh, my reading comprehension is just fine. Your psychoanalyzing skills, however...", "Yta", "NTA - You tell it so beautifully above, I would spare no detail in the retelling to her parents. You've earned it, you're proud of it, it's not conventional, but neither is the situation. Obviously you'll be \"dad\" to any of your own children, but you'll only ever be \"mom\" to your sister/daughter. I would also give them space to get used to it, it could take time for them to adjust.", "NTA. That story is absolutely adorable and made me grin like and idiot.\n\nJust make sure you tell them the whole story, and then your ass is covered. If they still take issue, then that is 100% on them and you might have to reconsider having them in your life.", "NTA - I think you should do what you want, but it might we worth considering a concise way of explaining the situation you are in so that it is easier for people to be more understanding.\n\nBasically what you have written in you first 2 paragraphs but condensed into a few lines.\n\nThat said if you don't want to justify yourself to people, don't you have no obligation to.", "NTA - But why is the name that your sibling chooses to call you a topic for discussion when you are meeting her parents?  No reason for it to come up.  Let them get to know you first.", "I wouldn’t mention it unless the parents mention it, or only mention it if your sibling called you mama in front of the parents. This really shouldn’t be a big deal or something that requires explaining, and having a rehearsed discussion about it gives way more air than it needs.", "NTA but your gf has a point. How do you see the conversation going?\n\n\"Yeah, when my parents died 9 years agoI got custody of my sister and I am raising her, she's 10...\"\n\nat this point do you have to mention that she calls you mom? I mean eventually they will meet her and witness her calling you mom and you can explain the origin story then, but why bring it up sooner?", ">My gf comes from a very conservative house, and she's certain that her parents wouldn't be too fond of me calling myself a mom. \n\nTell the story and if they don't tear up then you know that you need to limit your time with them. Also she **IS** your daughter since you adopted her so that's not even an issue.", "Woah, I think you need to pump the brakes here a bit.\n\nYou have been with this girl for *two months*. You've already introduced her to your sister and are working on meeting her parents, but you don't even really *know* her yet. Case in point: she's suddenly on alert about you being \"mom\" when it never seemed to bother her before. I'll bet it *did* bother her, but she likes you, so she's trying to move past it.\n\nI'm not saying you need to break up with her, but I do think it would be smart to slow things down and get to know her better before involving your families. You don't need your sister getting attached to someone, and then realize they aren't who you thought they were. Frame of reference, I like to wait around a year before introducing my daughters to a guy, just to be safe.\n\nNTA, but please be careful here.", "NTA but \n\nshe says:\n\n>just never mention it to them because it's not that important.\n\nThis is not the girl for you.", "NAH but you don't have to tell everyone everything about your personal life all the time.", "NTA. But you should be conscious of the optics here.\n\nWhen you explain why she’s calling you mama (as in your post) it’s fully understandable and we all get it. But if you do something like just blurting out that you’re your sister’s mama, I’m sure that you can see why people who aren’t familiar with the situation will be weirded out.\n\nI also think that it’s best to not push to bring up the issue immediately when you meet them. It’s ok to tell the whole story if the topic of your family comes up in conversation imo.", "NTA. Your relationship with your daughter is beautiful. I would not hide who you are or what the relationship is from your gf's parents. Better to flush any issues out early. If they can't see this as the indicator of what a great human being you are, that will tell you a lot about them and whether it is realistic to think you can have a long-term relationship with your gf.", "NTA\n\nBut tell the story. \n\nI do find it interesting though that you view what you did as a Mom role vs a Dad role. (Regardless of what she calls you.) \n\nI think that leads to confusion unnecessarily. Being a single parent on your own at that age is impressive and you were her parent. I personally don't think labeling yourself a mom means you were better at it than if you called yourself a dad.", "Don't borrow trouble. You haven't even met these people, and you don't know how they will react. They will probably be impressed and moved that you're caring for your siblings. And they will probably be worried about how that will affect their daughter. They don't need to know what your little sister calls you until they meet her, and that's a long way down the road.\n\nNTA no matter what.", "NTA I think you're looking for trouble that isn't there. just explain that family is so important to you that you raised your infant sister effectively as the only parental unit she's ever known. it shouldn't matter what she calls you as they can see she's happy and you're clearly responsible and capable.", "She knows her parents and has asked you not to do this. I assume you and their daughter have a sex life, but you're not talking about that, right Just? Just because it is true, doesn't make it relevant to this dinner. Your little sister considers you a parent and you feel the same, is more than enough information.\n\nDon't be the A H by saying something your GF will have to hear about for years, whenever her parents want to rag on the guys she's dated in the past.", "If they get hung up on a nickname and not see the bigger picture - you stepped up to care for your siblings - do you really want to move forward with these people? I would see it as a huge red flag if they have any opinion other than what a great guy you are. Unless of course you chew with your mouth open (joke). NTA", "Anyone who has a problem with a 22 year old who steps (mans )up and raises his 3 siblings, after they lost their parents,  including a 1 yesr old, isnt worth your time. You should be judged by you actions, not anything else, especially an inside relationship quirk.   I would explain it, because its just easier, and defuses a potentially akward set of questions, but explain, dont apologize., and good gor you. \n\nNTA", "NTA if your gf believes her family won’t like you just tell your story how you told it here. They might even join in on the joke", "Your gf needs to accept this & choose to support you rather than appease her parents. If she demands you hide the truth she isn’t the one for you. It’s already her choice to make if this relationship is over.", "You’re both. Explain that to them in the way you did with us so we can understand and it’ll pull their heartstrings. NTA", "Slight YTA, your sister calling you \"mama\" isn't the issue. You calling yourself \"a mom\" when you clearly identify as a straight cis male is deliberately confusing and makes fun of people that actually identify as mom's, trans and non trans women. It seems you like the attention. Your name to her is \"mama\" and you are her Dad.", "That was my plan. But another concern that I haven't thought about is that they might insist on making my sister/daughter stop calling me mom to not confuse our future kids. I really don't want to take that away from her.\n\nSo now I'm doubting whether that's the way to go...", "Was going to say this exact same thing. It's about HOW you tell the story. \n\nTell the story as it is, leave out the mama part, then let her parents see it in action one day. When they inevitably question it upon SEEING it for the first time, tell them THEN.\n\nNothing like hitting someone in the feels with a metaphorical baseball bat, to change their distorted opinion. If they only hear about it first, it sounds like they'll be quick to judge.", "Right here.  NTA.  And if they decide that it isn't appropriate, just know that they're the ones that are inappropriate", "SAME. I logged on this morning to judge, not weep :')! NTA, OP.", "I agree and would even go so far as to say that telling them that you’re mom is something that wouldn’t necessarily have to come up until you have had multiple visits with her parents.  Let them get to know you a bit first.", "I concur it really IS that important. Being your siblings adopted parent is a huge part of “the whole package” of who OP is. Him being comfortable in a maternal role does have societal implications that the conservative family members very well might object to and he needs to know if he should end things before that 10 year old girl who calls him mom gets invested and hurt. \n\nHell, he would still need to do that as “Dad” because they might try and make him correct it to brother and prioritize biological children over adopted and he needs to know sooner rather than later. \n\nOPs GF sounds like she might be fine being the 10 yr olds SIL but would resent being stepmom and is trying to get OP used to being brother only in public.", "Here, I edited your comment for you. You're welcome! ♡ \n\n~~YWBTA. Nobody cares  about your silly little language quirks. You don't get to rewrite the English language. The term Mother is a gender term. It means a female that gives birth and/or cares for offspring.~~\n\n**You can go by whatever name you want. And your sister can call you whatever she likes.** ~~That doesn't change the usage of millions of other people.~~\n\n**Great job stepping up for your sister** ~~but you're focused on the wrong thing here. The title. You sound like a weirdo and you're going to make her parents confused with your humblebragging. Did your sister come out your vagina? Did you breastfeed her? Then why this insistence on calling yourself a mother??~~\n\n~~You're not a mother and you never will be. Language has meaning and you don't get to subvert those meanings in other people's lives. The word Father too difficult for you? Parent?~~", "Also, your sister will likely grow out of this when she gets older.\n\nIf this is the emotional strength/connection she needs to cope, then let it ride until she decides otherwise.\n\n‘But it became a running joke in the family’ is a perfect way to frame it.", "If they try to insist that and your gf either agrees with them or doesn't stand up for you, she's not the one for you. You want a partner who supports you-someone who is ashamed of you and wants you to hide who you are is not fit to be a partner.", "You can always be her Mom and your other kids Daddy. Different situations can result in different names.", "my take is that if they are so blinded by their worldview that they try to insist your daughter stop calling you mom…. do you really want them in your siblings’ and/or future potential kids lives? Bc that’s the kind of boundary-pushing that doesn’t just stop when you concede once.\nYou and your family have gone through tough times, and have built relationships with each other that are beautiful and meaningful. You deserve nothing less than happiness, safety, and relationships with people that make you feel loved and valued.", "OP you’re really projecting here. Why are you giving the parents of a woman you’ve known 2 months so much imaginary power? Calm down.", "> they might insist on making my sister/daughter stop calling me mom to not confuse our future kids\n\nIf they do, you shut that down. Like, you're an adult, they have no power over you, you can just tell them \"No\". It's your sister/daughter, your life, and it's honestly none of their concern. Tell them the story you've told us, and if they react badly, that's their problem, not yours.", "You're making up problems that don't exist. Stop that.", "I mean your kinda putting the cart before the horse here. You guys have been dating 2 months. Unless there's some accident, your probably 5 years away from kids atleast.  At that point your sister will pretty much be 16 or almost an adult. The odds if her still calling you mama are pretty slim. She's 10 and still thinks it's cute, but kids change when puberty hits. She might be embarrassed to call you mama in front of her 16 year old friends, or maybe she won't or maybe she will just do it in private as a joke. All I'm saying is 2 months in is way too soon to be wondering about how future children will react to it in my opinion because by then it might not even be an issue.", "they shouldn’t worry about it confusing your future kids because of the situation. it’s not that your sister thinks your her dad and calls you mom instead. she knows full well you’re her brother and it’s just a nickname that y’all are comfortable with. your future kids will know you as their dad because that’s what you will be. \n\nif your SO or her parents have an issue with that at all, you might be better off stepping away early in the relationship.", "They don't have any right to insist on anything between you and your siblings. It's not their business. Future kids are YEARS in the future. Who knows what your sister/daughter will be calling you then? \n\nIf they're so conservative, here is a bible verse for them:   \n\"Therefore do not worry about tomorrow, for tomorrow will worry about itself. Each day has enough trouble of its own.” Matthew 6:34", "From what I know of how kids brains work - any future kids you have will probably accept it as a one-off nickname and think of reference to you as ‘mom’ and any mama/mommy names they use as completely distinct until they’re at the age they’d switch to “mom” themselves at which point they’d probably understand the explanation.", "The question of mom/dad aside, you *are* that girl's parent. You are at the right age, you act as one, and since you adopted her, you're also legally her parent. \n\nAs to future kids, they'll have no problem with your sister/daughter calling you something different from them. After all, your wife won't call you dad, either (I hope!). If your girlfriend's parents \"insist\", you just insist harder. Tell them once that this topic isn't open to discussion, and then don't discuss it, ever.", "They have been together for two months, might as well side with her parents just for the sake of not being confrontational..", "There will be a pretty big age difference between your sister and your future kids.  Different names for different relationships may not seem that big a deal.", "Honestly, the girl is only 10 years old. I think at some point when she is older will call him dad or by his name. \nI have experience with little kids, I had several nick names that are deformations of my name but eventually they wear off. \n\nActually, is should have already, maybe he is reinforcing it and it's not something bad but I still think at some point it will change to something different.", "I agree, but that's not really my gf's fault. I can't tell her to go NC with them just because of their views.", "I guess you're right. I just want this relationship to work this time and I'm stressing myself too much over it.", "yeah it's the primacy effect, it would be better to give them a good impression of yourself before you share this fact which they will probably find weird.\n\ngf should be supportive and defend you and shut down negative remarks from her family. if OP is serious about her being the one.", "OP shouldn't have to go out of his way to carefully build up to the use word of the mom (in TEN visits, seriously!). It's just a word. One he wears with proud and is part of who he is. If they aren't willing to see that, that's their loss. \n\n>There's nothing wrong with it, but I think if it's the first detail that OP's in-laws learn about him **they're gonna have trouble getting over that** and learning more about the type of man he is.\n\nIf they cannot get over the fact OP calls himself mom in a totally harmless, fun and loving way, with the explanation of his life story added after that, then they are very shortsighted, judgmental people. \n\nOr if his girlfriend's parents write him off immediately after the use of a three letter word because they are so extremely upset by a man using the word mom that they cannot listen to his life story after that, then they are emotionally immature, overly dramatic, toxic people you don't want in your life. It's unhealthy behaviour. And his girlfriend shouldn't enable it as it sets a prejudice for their future. Imagen the emotional damage these kind of people can do to his 10y.o. if you allow this kind of behaviour.\n\nOP shouldn't have to feel ashamed for using the word mom. And his sister-daughter shouldn't either. So they don't have to act like it's something that needs to be carefully told as if it's something bad or shameful. Don't normalize misogyny.", "Why avoid being confrontational just bc the relationship is only 2 months old? Confrontation is always going to be a possible aspect of relationships-avoiding it just bc you don't want to rock the boat may lead you to putting up with situations that are unhealthy for you. \n\nThe relationship is only 2 months old, but it could become something that lasts years. Not to mention, if her parents have an issue with her simply saying something like, \"mom, dad, please don't pick on my boyfriend for being called mom by the sister he adopted when their parents passed,\" then it kind of sounds like that's not a good relationship for her. If they would genuinely be confrontational over her asking them to respect how her bf's adopted daughter refers to him, maybe that will give her the acknowledgement to develop healthy boundaries with them.", "True. When she’s 13 and embarrassed by everything it’s unlikely she calls him by something so easy to be picked on.", "No, but you don't need contact with them and if she's not on your side on the issue/doesn't defend you, as was previously said. Is she really the one for you?", "I'm not saying what is good or not. I'm saying what I think it will happen.", "I mean, I think we all know what's likely to happen, so I don't really see the point in bringing that up without a critical evaluation of it.", "What you've done is really remarkable. Your girlfriend's parents may be conservative, but they would have to be monsters to not appreciate the backstory that explains why your sister calls you mama. I am so sorry for your loss and I hope all goes well with meeting your girlfriend's parents. NTA.", "Take a deep breath, Mama, you got this! If your GF's parents take issue with it, that's their own insecurities coming out. Be kind, but make no apologies for being such a wonderful mom ❤ \n\nNTA", "If my daughter brought home a guy who had responsibly raised his infant sister from the age of 22 after the tragic death of both parents, I wouldn't give a damn what she called him.\n\nI'd start planning the engagement party. \n\nNTA", "NTA,\nIt’s hypothetical at the best, just explain as you did here. If they are not loving you on the spot for simply being the best for you baby sister their opinion is worthless.", "  I don't see how conservative people could be that offended if you explain it as \"my parents died so I filled the role of mom to my sister\". All it needs is a simple explanation.", "NAH (yet). I doubt the parents would be that offended by it. They'll probably think it's a cute story.", "NTA. You are a hero for adopting such a small baby instead putting her up for adoption considering that your parents passed away which would definitely affect both your mental and physical health.\n\nThe baby called you \"mama\" which would seem \"improper\" for the average person, but you cannot change what your little sister calls you.\n\nYou're NTA because:\n1. You can't change what your little sister calls you, she is 1 after all\n2. You were responsible and smart to take on the option of adopting her which means you are her parent. You're a hero for that.\n3. Others can't force you to \"discipline\" your little sister just because she is still a baby (age 1) and she is probably learning the life basics.\n\nSo, whatever your gf's parents say, do not let them change anything. In a way, your gf's parents shouldn't even have any control over you. Stay proud.", "NTA, but I do think you should frame it as you are a mom to your sister, then slowly open up to identifying as a mother to the parents", "NTA", "Maybe they'd be okay if you refer to yourself as \"Mr Mom?\" I think there's a country song or smth called that so old people might be cool with it", "Why is everyone so quick to assume her parents will be against it? As a girl dad, if my daughter brought you home and  you guys explained this, I would see the standup guy you were. At 22, taking on a 1 year old, I would call you anything you want.", "NTA is just a cute story and nickname. As an aside, there’s a manga called Mama Akuma that you might get a kick out of.(A male demon is summoned by a little girl to be her mama)", "You stepped up for your siblings in their time of need, while you were grieving yourself. \n\nThat 'nickname' is a badge of honour, you did good.\n\nYour girlfriend is comfortable with it, and that's the most important.\n\nIf her parents think this through, they'll realize that you're a great guy and an asset to their family.\n\nIf not, it's their loss, not yours.\n\nNTA", "NTA. I do not think you need to compromise your relationship with your sister for the sake of potential in-laws, but do give them the entire context when you meet.\n\nAnd OP, this is so sweet!", "NTA but it seems unnecessary to tell them something that specific the first time you meet them. much less put yourself through this kind of stress for someone you've only been dating for two months. \n\nit's wonderful that you're proud of being her mom, parenting is a tough job and good on you for stepping up in her life like that. you *should* be proud of yourself and it obviously means a lot to you and your sister that she calls you her mom. these conservative strangers you're meeting haven't earned a right to hear that story yet, so if i were you i wouldn't worry about it.", "I know I am going to be downvoted to oblivion for this but surely if your girlfriend just explains your unique situation to them and that’s it not a political statement they would understand. NTA.", "NTA...  you are the a \"mom.\"  It's just a title & don't see the big deal.  Ppl care to much about titles..  Have you heard some of the crap kids call their grandparents.\n\nIf her parents are so closed minded a get stuck on a stupid name and not all the good that you did for these kids, then it's their lose", "NTA, but others would be if they try to force a change in your family dynamic. \nDon't let anyone reduce your relationship with your sister or your family.  What you've done is incredible. \nIf she's going to be your gf long-term, she needs to support this, not try to get you to hide it, and change it to make other people comfortable.", "My husband has two sons and he has always referred to himself as mom. He identifies with it better, maybe because he's affectionate and loving and his dad was cold. Either way, it's no one's business.\n\nI wouldn't feel the need to bring it up on the first meeting, but when they meet her and she starts calling you mom, they'll need to understand It's not a joke. It's real life. That's ok.\n\nIf GF's parents are upset that you have such an affectionate relationship with your orphaned sister that she calls you mom...they are bad people. Also GF is on high alert for that status.\n\nNTA in the slightest", "Ywnbta but it's going to be a bumpy road. Good luck.", "\"because it's not that important.\"\n\nbut it is if she's the one\n\nyou could tell them you've raising your sister since you parents passed and she calls you mama since she had no one else and that it's nice to know you are doing something right for her and you consider her your daughter.\n\nbut NTA for wanting to tell the truth", "NAH but this is weird.  Your sister is old enough to be corrected, and if she does this in front of her peers, she's gonna get bullied.", "NTA intollerant people will intollerate until they want to get access to their grandchildren", "Exactly. This post explains it well- shows OP for the good guy he is and the sweet bond his has with his sister. The term “mom” or “mama” is an endearment for them.\n\nBut if he just says “I’m my sister’s mom” that will weird them out and make it hard for them to see past the initial statement.", ">My whole family calls me grandma\n\nI need to know why", "I like your approach. My SIL has always been Uncle Sxxx since she grew up very much a tomboy. I forget it's weird to some people. \n\nOP just a heads up- if you have your own kids while little sis is still at home you may always be mama.", " \n\nThey don't need to know what you call you until they meet your little sister, and that's a long way.", "Dude, you have been together for two months. Do you think they will be talking about babies on your first meeting? Unlikely.", "I don’t see how they can insist that you do or not do anything. What your sister/daughter calls you is none of their concern. Who cares what they think about that or really anything else in your life. Now if your girlfriend starts making a big deal about this, then you might have a problem.", "Mate, having been such a rock solid, stand up, top bloke for your brothers and especially your baby sister, I can see why you would want to trumpet your success and relationship with them all from the rooftops and rightly so. However...\n\nYour girlfriend knows her parents better than you do and you already know they are 'conservative', which is often shorthand for 'judgmental bigot'.\n\nYour goal, on this first meeting, is to prepare the groundwork of a mutually respectful relationship with each other and, as much as it goes against every fibre of my being to say so, you may need to suck some stuff up for the time being.\n\nIt is absolutely clear to the world and his dog that at some point, they will become aware that your sister calls you 'mama'. Hopefully, at that point, they will know you are a solid bloke who treats their little girl like a queen and, even if they do not like the 'mama' soubriquet, at least grudgingly accept it.\n\nIf you go in guns blazing on the first encounter with them, there is a horrible risk that you will burn your bridge with them before you've even crossed it.\n\nListen to your girlfriend and take things slowly. Of course, they may be such awful, judgmental, hateful, bigoted people that it will matter not one iota what you say but suck it and see eh?", "\"We'll cross that bridge when we come to it\" or \"I'll talk to her when gf and I start preparing to have children\" + changing the subject. Non-committal (you talking to your sister doesn't mean dictating what she calls you, just letting her know that you'll be \"dad\" to your own kids but her mom forever) and polite, then move the conversation along.\n\nIf the GF's parents try to bring it up again, exact same phrase + subject change. Be very boring about it and don't engage on the topic. Make sure your gf is on the same page about how what your sister calls you isn't up for discussion/debate with her parents.", "It's been two months. Slow your roll", "Your in-laws-to-be need to told to mind their own freakin' business. Once you have explained why the situation came about, that's an end of it. NTA and huge kudos to you. How many 22-year-old males would do what you did?", "They have zero authority to interfere with your parenting of your sister or any future children. \n\nYou’re an amazing person who stepped up lovingly under tragic circumstances. Anyone who sees you in a negative light is unworthy of having their opinions considered.", "They should be proud their daughter found such a family oriented caring guy. Others at such a young age, with their whole life ahead of them, would have walked away.", "You can cross that bridge when & if you get to it.", "So are they! 🙃", "1 of my cousins when she was really young couldn’t speak yet (like 18 months old). Instead of saying ‘uncle’ (in our language ‘oom’) she said ‘grandma’ (in our language ‘oma’) and it stuck. Everybody thought it was so sweet that they picked up on this. Since then I’m ‘oma’ instead of ‘oom’.  And it stuck.\n\nETA: oom is phonetically spoken as ‘ohm’ and oma is spoken as ‘ohm’a’.", "T H I S !!! This right here, OP! Your current child takes priority over the comfort of possible future in-laws, current girlfriend, or potential future children. You’ve been dating this woman for 2 months, you’ve been raising your daughter for 9 years. Priorities, my man, get them straight.", "This^ as a teen mom 100% this once you have or decide to become a parent no matter the way it happens you're current kid resides over any future you work to make your kids future better and yours but firstly your kids. Any probable s/o has to accept that said kid already exists and will still exist regardless of any kids in the future and same for you.", "Keep in mind that you’re only two months in. You’re still in the honeymoon phase of the relationship. There are a ton of things you don’t know about each other yet, the relationship hasn’t been tested by time …\n\nIn other words, don’t put more emphasis on this than you should. You’re not meeting the parents of the woman you’ve been living with for five years and recently proposed to. You’re meeting the parents of a woman you’ve known for two months and like a lot. Proceed cautiously and with hope, but try not to worry about it too much.", "Her parents' outdated world view is not her fault. But she has a choice in how to deal with it. Enabling her parents instead of setting up clear boundaries is a choice. And, how understandable it may be from her perspective, not a great one. She's choosing to not [rock the boat](https://www.reddit.com/r/JUSTNOMIL/comments/77pxpo/dont_rock_the_boat/) . She seems more concerned about her parents reaction based on their ~~conservative~~ misogynistic views than about you, your point of view and your feelings. She's asking you not to be who you are because her parents will think it's wrong and will react badly. She's allowing it.\n\nI'm not saying you shouldn't date her. But you should really think about this behaviour pattern. Are you okay with this? Because it WILL influence your life with her one way or another. And if you marry her it will also influence the life you have with your sister-daughter and other siblings. What are your boundaries? What is your hill to die on?\n\nHer parents raised her with this \"conservative\" view and even if she's great and doesn't agree, there's probably (subtle) things of her upbringing that sticked as she's only human. It's very hard (emotional) work to overcome BS of your upbringing. And her being that concerned about her parents and asking you to accommodate them just isn't a great sign. Is this the life you want? A life where her parents values matter more to her than yours? Are her words and actions telling you the same story? Or do her actions tell you something different than her words? Just think it over.", "She doesn't need to go no contact. She needs to tell her parents that they're out of line and need to keep their negative opinions to themselves. And she needs to be on your side.", "You took me very literally when I said 'ten visits' when I very much wasn't suggesting that OP literally count the number of visits he goes on before revealing this info.\n\nYou've described it as 'tip toeing' around his future in law's feelings when, in my mind, I'd just describe it was 'trying to make a good first impression'. When I meet people for the first time (especially if I'm planning to see them on a regular basis) I don't aim to dump my entire life story on them within 5 minutes of meeting them. I think most, if not all humans hold on to their first impressions of an individual for much longer than is objectively appropriate but human beings are rarely objective creatures.\n\nI made the assumption that his 10 year old sister wouldn't be attending the first meeting with the in-laws (why would she?) and so not mentioning this detail of the relationship isn't going to hurt her. I acknowledge that making sure this kid has a good relationship with her current family and future family is top priority.\n\nYour message reads like you've jumped to the conclusion that these future in-laws are misogynist monsters when it's possible that OP's gf is just overly worried about introducing her parents to people she cares about. We don't know any of these people directly and it's hard to make a good judgement of everyone's opinions and intentions.", "Because I wanted to say something more realistic? IDK, I dont put my whole brain in the comment section of a random post. I just wrote something.", "NTA\nI'm a woman, and my baby sister has been calling me \"Dad2\" since she learned to talk.", "NTA", "NTA.  maybe you should get a different girlfriend, one that is not so \"very conservative\"", "You sound like a terrific young man to have stepped up in awful circumstances to keep your family together. You should wear with pride the fact your sister/daughter calls you mom. Your girlfriend's parents should be super impressed by this. If they overlook everything you have done and focus on and disapprove of mom, then they WBTAs. \n\nDo not under any circumstances change anything with your sister/daughter, you have clearly done everything right there, do not jeopardize that relationship just to placate the parents of a 2 month girlfriend.", "NTA. I applaud you for taking in your siblings and for raising your sister/daughter as your own. I do agree with other comments saying to explain that you originally tried to correct her but instead decided to allow the running joke.\nWhen I was a kid I couldn’t say uncle. So I called my uncle “aunt”. He became my aunt for yearssss. I don’t think it bothered him that much and it was a running joke in the family. I just genuinely couldn’t say uncle for a while and calling him aunt just stuck. Now I’m in my twenties and call him uncle but all the way through my teens I’d explain why I called my uncle, aunt. \nI think it’s all about how you explain your family situation. Personally, I think it’s amazing that you’ve embraced it.", "NAH. Trust your girlfriend and follow her advice. She knows her parents better than you do. Not saying to hide anything, but don't need to go in with exclamation points on a first meeting.", "I agree with the people suggesting that you tell the story about how you came to be called \"mom\" first... it will make it much easier to accept.\n\nIf you just say that your sister calls you \"mom,\" it just sounds... weird.  With the story, it sounds like an adorable story and... how could anyone find fault with it?\n\nAs for future kids getting confused... kids are pretty adaptable.  Things that might confuse adults will just feel normal for them.  For better or worse... I grew up thinking that the abuse I grew up with was normal until I found out it wasnt... in your case. your kids will grow up calling you dad, and your sister calls you mom... and it'll be fine.\n\nMy aunt was known by three different names (well, nicknames) and the one you knew her by depended on how long you'd known her.  Nobody was confused.  Well... not for long, anyway!\n\nYWNBTA", "Unpopular opinion, YWBTA. Your a parent. It’s a nickname/role. Why do you even need to bring it up? You’re imagining telling this entire in-depth story the first time you meet her folks, maybe she’s already told them you’re a parent? I sure would have. So unless it comes up naturally in conversation, ie they ask you about raising your siblings, I don’t even know why you’d go into this story (“And my baby sister calls me mum” in particular just seems unnecessary?) Especially when your gf, whom you say is the one, has said she’s against it. So you’re looking to piss her off, just to make a stand…why? \n\nAlso why not go to the dinner and form your own opinion of the parents? There’s a lot of assumptions in this thread, especially for a two-month relationship and a first meeting with parents. Maybe go and see for yourself what their like, and maybe, I don’t know, get to know them a bit before spiralling? For all you know, they don’t give a crap about what your daughter/sister calls you, and your gf is just nervous because she really wants them to like you and she’s blown this out of proportion too. And if they’re AH, then you’ll have lots more interesting dinners to bring up stuff to annoy them on purpose.", "Info: why doesn't your 27 year old grown ass woman of a girlfriend tell her fucking parents herself about this?", "My jaw is on the floor that your girlfriend said to never mention your family. The one that survived a devastating tragedy, but thrived because you, at a young 22, stepped up, manned up, mommed up. If you were my partner I’d be screaming from the rooftops how proud I am to have you and if anyone, ANYONE, including my own family said one negative word about your family and title of mom, it they’d be told in no uncertain terms to keep thei sexist small minded nonsense to themselves or they would not be seeing us.", "I am a single dad and get happy Mother’s Day wishes… just saying.. being a parental figure is big boots to fill, and you did.. being a sole parental figure is hard.\nwhat you have with your siblings is special and works for you.. just be considerate in how you tell folk, and only really if you need to tell them..", "You know there is something very wrong with your thinking if you can’t see the value in the nice young man your daughter is dating. That he is the type of guy who will raise his siblings as a loving parent would. If you are hung up on essentially a nick name then your daughters best interests are less important than a term of endearment.", "I can’t get past the “because it’s not that important” comment from the GF. I think it speaks VOLUMES about you and your character. It’s very much who you are. I’m not concerned about the mama part. If/when you are still around and it comes out they will know you enough to accept it.", "Info: you do realize you aren't actually her mother right? Does your sister understand you are not biologically her mother?", "NTA and that's adorable. My daughter called my best friend \"mummy dave\" lol.", "It's not horribly unusual for young children to think their parents names are \"Mama\" or \"Daddy\".  Any confusion over perceived nomenclature or gender association is irrelevant to a toddler.", "You just have to word it right. Don’t say “I’m a mom”, say “After we lost my parents, I adopted my baby sister. When you meet her you will notice that actually calls me ‘mom,’ which is something she started as a baby during that hard time, and has since become an affectionate nickname that stuck around. Some people find it strange, but it doesn’t bother me and it is what it is.”", "NAH. Although i would question why you’d feel the need to just immediately go telling them everything. If you really like this girl why go in hot to a situation you know might be strange. You wouldnt be hiding yourself or bot being true to yourself. Not everyone needs to know everything the moment you meet.", "You are two months into this relationship. Its very early days. If she wants you to hide how amazing you are then she isn't the right person for you. You'll always be your sisters mum. If you have kids they wont even question it. It will be normal to them. You are first name to some people, their dad but someone else's uncle and your sisters mum. Families are all different. Anyhow, I call my dad smurf and he isn't blue.", "NTA - your relationship with your sister sounds really beautiful. It’s a huge green flag. They be lucky to have you in the family.", "NTA. I think your GF is telling you some valuable information, both about herself and her parents.\n\nHer parents do not take deviations from the norm well. When push comes to shove, she's likely to side with them. \n\nThe best case scenario is that she doesn't agree with their views but is more willing to avoid conflict than stand up for what she thinks is right. If that applies to you and not just them, it's very likely to cause you relationship problems in the future. \n\nThe worst case scenario is that she agrees with them, doesn't want to stand up for what she thinks is right to *you*, and is using them as a scapegoat to make you change. \n\nThink about this: what if your daughter winds up being gay or bi or trans? What if one of your biokids winds up ditto? What if one of your kids winds up in a non-traditional family situation of their own? What if one of your kids winds up being disabled and isn't able to have a white picket fence in the suburbs kind of life? \n\nHow do you think your GF will react? How do you think her family will react?\n\nI'm not saying you need to break up with her. But if you're getting serious with her, you need to have some hard conversations about how you'd handle these situations- how you'll handle them together as a couple, AND how you'll handle the situation with her parents.", "A cute and lovely \"nickname\" that was born out of a horrible tragedy deserves to be protected from uptight parents of a woman you've only known for 2 months.  I'll tell you right now, how they react to this will be a great indicator of what you could be in for later if you and their daughter continue", "Going against the grain a bit, but... your girlfriend, who has known these people for 27 years, thinks that this should wait until another time. Your believe that you somehow know better than she does, that your opinion regarding people you don't even know is superior to hers, makes YTA.\n\nFirst of all, you're absolutely to be commended for all that you've done for your siblings. You stepped up in a way that most people wouldn't, and you're a genuinely good person for having done so.\n\nI honestly don't understand, though, why you feel this compulsion to share your \"mom\" title with people that you're meeting for the first time. And yes, \"compulsion\" is the right word here. The important parts of your story are the way you stepped up and became a parent to your siblings; the unconventional term of endearment that your sister has for you is the least important part of it all - and yet, it has the power to completely derail your first meeting people who *maybe, possibly* could end up being your in-laws someday. Why is it so important to tell them this *right now*? There's a difference between being honest (which is what you think you're doing), and oversharing (which is what your gf thinks you're doing).\n\nAt this stage, leave it alone. It isn't their business, and it's a distraction from the story that they need to be hearing about your sacrifice and selflessness. Let them focus on *that* as their first impression. Trickle-truth the \"mom\" part over time (not unlike what u/Iamn0tWill said below), because they'll be a lot more accepting of it later on, when they've already had the opportunity to get to know you as a person through repeated interaction. If they're as conservative as your post replies, then *leading* with the \"mom\" thing means that they're going to go down some Fox News outrage line of thinking like, \"Our daughter is dating someone who doesn't even know what bathroom to use!\", and they won't even *try* to get to know you as a person.\n\nReddit believes that we should 100%, at all times, be confrontational with those who dare to have more conservative viewpoints than us, but your fellow Redditors aren't the ones who have to face the real-world consequences of the friction that ensues when you take this idealistic but flawed advice. Not leading a first meeting with something guaranteed to provoke a negative knee-jerk reaction is some really simple Dale Carnegie 101 stuff anywhere *except* on Reddit.", "My grandma had the opposite issue - originally the baby of her family, her older siblings called her “Babe”, and the name stuck. In her 90s the children of her nieces and nephews were still calling her “Great Aunt Babe”.", "I think the worry is the daughter may be socially stunted and not fully understand that he is not her mother. From the story I also can't tell if he understands that he is not her biological mother either. So it really depends on framing. If he goes in telling them he's a mother to a girl and she seems to think he's literally her mother they might be worried something weird is going on. However if they go in framing it right they wouldn't think that.", "Your girl friend's parents have no business insisting on *anything* from either you or your GF or any of the rest of your family. What you and her and they decide to do is not her parent's concern. Any more than your grandparents or adult siblings should be telling your GF what to do. *Especially* since you've only been dating two months!\n\nTell them at your own pace. And ignore any bigoted advice they give. If they get bigoted around your sister, then that, and your girl friend's reaction to that, gives you important information to use when evaluating your future relationship.", "\"That's not something I am comfortable doing.\" Seems easy enough to me. NTA btw.", "Where does it say their misogynists? I must have missed that?\n  \nThe girlfriend is worried, the parents aren't even introduced yet.", "You understand she is not your daughter right? She's your sister. If you try to disguise relationships and seem to be tricking her people are going to think some weird abuse is going on.", "[removed]", "/u/KitchenExtent8107 appears to be a bot as this comment doesn't make sense as a reply to the parent comment.", "isnt she his sister, not daughter?", "OP, I’m gonna be real. Your “supportive girlfriend” should not be coaching you on ways to placate her conservative parents. She should tell them straight up, and tell them to fucking suck it up. She’s an adult. You’re an adult. You’re fucking thirty for gods sake. Stop worrying about what someone else’s bigoted mommy and daddy will think and just live your life. \n\nI really can’t believe the general consensus seems to be, “Listen to your girlfriend and hide it from them,” or “Downplay what it really is.”", "It's fine that you want it to work, good even. But don't be led by that desire. This relationship will either last or it won't, the important thing is that it is a healthy one for everyone involved. Don't sacrifice the things that are most important to you for the sake of a relationship that may or may not be permanent. You need to be able to recognize if things aren't working out and end it before your sister gets hurt. Stay calm.", "What this guy said is resonating with me...\n\nIts a sweet story, and you don't need to hide it...\n\nBut it seems like TMI for a first meeting with the parents of a gf of 2 months... I can feel the pressure you're putting on this, its like you're going to tell them that you're engaged or something...\n\nIf she's saying its not a good idea, i see no reason not to trust her judgement at this point... save it for another occasion with them... like if you're still together in a year or two...", "No, but you do have to accept that sometimes relationships just aren't meant to be even if neither of you do anything \"wrong\". Breaking up with someone you like is sad, keeping a relationship that is harming the person you swore to protect is far worse. You have only been with this girl for a couple of months, but even if you were with her for years, it would still not be enough to be worth damaging your relationship with your sister.", "I mean, he adopted her and raised her since she was a baby. He can be both her brother and parent-technically, both terms legally apply.", "Biological sister but adopted daughter who has been calling him “mom” for basically all her life.", "Yes, but he's still her parent in that he's the one raising her.", ">When I meet people for the first time (especially if I'm planning to see them on a regular basis) I don't aim to dump my entire life story on them within 5 minutes of meeting them. \n\nMaybe not in the first 5 minutes, as I don't think OP is planning on giving his girlfriend's parents a hand and saying \"hi I am OP and I am a mom\". But it will most probably come up within the first hour as it's a major part of his life. \n\nIn my country (I'm Dutch) it's normal to talk about what you do for work and hobbies, where you live, where you're from and a little background about your family when you first meet the parents of your partner. It just comes up in casual conversation, whether it's over dinner or over coffee. In OP's case that means telling his life story. There's no way around it as avoiding it would be weird. If he tells his story whenever it comes up, including telling that his sister-daughter calls him mom and he does to as a result, as a family thing, I don't think he's making a bad impression at all. Most people here are touched by his (sad) story and think the mom thing is cute and funny.\n\nNo I don't know what kind of people his girlfriend's parents are, but most people with normal parents who's reaction is usually normal don't warn their partner about their parent's conservative views including not being able to handle OP calling himself mom. It's very likely the girlfriend is concerned about their reaction because of her past experiences with her parents. And a lot of the time \"conservative\" isn't a positive thing, as it's often used by people to \"hide\" that their views are about maintaining inequality, for example believing in gender roles and not believing men and women are equals. Maybe I should have used the word bigotry instead of misogyny, I always confuse them when it's about gender roles as English isn't my first language.", "Brother, read it again", "Okay, but the realistic thing you said is something *everyone* who reads the post can already infer. So why say something that doesn't really add to the conversation? It's no different than just saying \"this!!\" to a comment you agree with. \n\nYou say the gf should side with her parents to avoid confrontation-well, why do you think she should do that enough to give you the confidence to say it? Do you think it'll be beneficial to her? Do you think she should value her parents more than a potential relationship, even if it costs her the freedom to make her own decisions? Someone is challenging the opinion you gave, so why not defend it instead of just saying \"well I just said what I think will happen\" unless you don't really believe in what you said?", "ok", "NTA…but yeah let it naturally come up and explain as you did here, if for no other reason than for it to make sense. Just randomly dropping “oh yeah I’m a mom” to anyone you don’t know would be confusing, and different people could take that a multitude of ways, even as you being mocking in some way.", "NTA", "NTA\n\nThe real AH is whoever is cutting goddamn onions around here.  Doesn't help that my allergies are flaring up.", "Uhmm kinda red flag to me that your gf sees your relationship with your sister as \"not that important \"", "I would play it by ear. I don’t endorse lying, but you don’t have to tell all your secrets the first time you meet someone. \nNAH", "NTA, but man, I'd have some really hard talks with your gf.\n\n\"My gf thinks this is a bad idea and that it'll leave a very bad impression on them, and suggests to just never mention it to them because it's not that important. \"\n\nSO, either their impression of you is important, but your relationship with your sister is not, or their impression of you is not as important as your relationship with your sister. Which is it? Because that absolutely informs how your future will progress with her. She's already willing to sacrifice your sister to make her parents comfortable.", "NTA Anyone who chooses to focus on being salty about a nickname given to you by a little girl who lost her parents, instead of focusing on what an amazing thing you have been doing by stepping up, can simply kick rocks. I mean seriously - if THATS what they take away from your story, then they were never going to like you no matter what you did.", "You have been mother, father and brother to your sister. You are an amazing man. I think you have earned the right to be called whatever you are comfortable with. NTA.", "NTA. YWBTA if and only if you caved. I see from a comment of yours that you worry that “they might insist on making my sister/daughter stop calling me mom [so as] to not confuse our future kids.” No. They can demand whatever their narrow hearts and minds desire, but they have neither the authority nor the power to insist; and they can in any case FOAD. If your GF—and I fear from some of what you’ve said, she may—but if your GF is so weak of mind and spine that she’d bow to them … well, that’s your warning to find a better GF.", "Why would a girl date a guy who adopted a kid already. That's a mountain of baggage.\n\nI don't think calling yourself \"mom\" is what's going to leave the bad impression with the parent.\n\nWhat parent want their daughter to date a guy who's adopted his sister........", "NTA. Tell the story the way you told it here. Not only will GF's parent's reaction after that be telling, how SHE reacts to their reactions is also going to be telling. I get her concerns, to a point. If she can't stick up for you and your perfectly fine family dynamic and continually wants you to suppress this part of your life, then sorry man, she is ALMOST the one.", "You call yourself whatever you damn well want. You're an inspiration to have gone through what you have and come out the other side. Never change who you are to please somebody else. \n\nIf you have to explain the How's and Why's, then do so, but if anybody turns their nose up at you for calling yourself a mum to your daughter/sister after this explanation, then they aren't people you need in your life. Regardless of their connection to you. \n\nYou sound like a wonderful human being. Stand proud, dad mum!", "NTA. And if she doesn't support you in being your authentic self with her parents ... is she really the one for you? Truuuuly truly? \n\nWant to add, you say you've earned something most men haven't the honorific of \"Mother\", if we're considering that to be an earned title by being a good person and good parent, a lot of women/\"mum's\" will never earn that either.\n\nI might be a stranger on the internet but I want you to know I am so fucking proud of you for taking in your siblings and raising them and being an exceptional human being. You are an absolute credit to your late parents and I know damn well that would be filled with joy for what you have done. It is rare and it is precious. Thank you 💚", "\"My baby sister jokingly calls me mom since I raised her ever since our parents died.\" Only the most truly asshole conservative parents (like a stereotype caricature) would make a fuss after that.", "I agree with this. I mean it does sound a little bit weird otherwise tbh but the way it actually is sounds nice", "Agreed, OP. I wouldn't approach it like, \"I'm a mom\" because you're not. You're a dad who's called \"mama\". They're probably going to take issue with it either way if they're really conservative, but you can soften their opinion (which is in no way your obligation but may be a good idea given your feelings for their daughter) with how you approach it.\n\nNTA either way.", "OP says the parents are conservative- conservatives tend to get real touchy about gender and gender roles. OP’s obviously NTA though", "This is the way. \n\nOP is amazing for what he's done, and he deserves to be known and recognized for the important parts of that - taking care of his siblings and raising his youngest sister after their parents died.  And I'm sure OP has many other great qualities that the gf's parents should know about.  \n\nGiving people a chance to develop a positive and authentic image of who you are is important.  Then, after that image is established, a few facts that are \"weird\" won't override that first impression and image.  The same people who would have knee-jerked if he'd led with that could very likely shrug and laugh along later on because they've already gotten to know OP. \n\nAlso, bringing up the \"mom\" thing front and center is going to steal attention away from everything else.  It'll become the only thing that is talked about, and that doesn't do justice to anyone.  \n\n(I suspect there is a generational and cultural divide going on here between the polarized takes on this)", "I like it when the top comments echos my thoughts like the ones above me did.  Definitely NTA, but the how and when you decide to tell them will probably greatly affect their initial reactions to it.  \n\nDefinitely probably not going to be one of the very first things I would mention right off the bat, if I were in your shoes, but if the situation presented itself correctly, I would definitely include that fact in there for them to know.", "Who is insisting? These STRANGERS? Parents of the woman you've been dating for 60 DAYS?  If they ask, tell the story, and if the don't like it they can kick rocks", "She’s not going to confuse any potential future children. I wouldn’t automatically assume that they would interfere there either. Give them a chance, tell them what you told everyone here and go from there", ">That was my plan. But another concern that I haven't thought about is that they might insist on making my sister/daughter stop calling me mom to not confuse our future kids. \n\nBut you are their mom now and always be, just like your mother was also their mama.\n\nFuture kids together will be more open-minded then your gf's parents.", "Your kids will call you what your kids call you. They'll see you with friends that call you \"Dave\" or whatever, that's not going to change that, either. This is not going to be a problem.", "I hope your grandma loved her nickname and I bet she is looking down and reading your comment and chuckles.", "Always nice to see that Dutch people really are everywhere", "Yeah good idea....set the tone of the parents controlling every scenario from day one 🙄  are you NUTS? NO", "How your girlfriend reacts to this *possible* problem will be a great indicator of what the future would look like if you stay together. She stands up for you....thumbs up. She wants you to bend to her parents will....run the other way", "Groetjes van ‘oma’!", "This is my thought too. Like on one hand I understand wanting to rip off the band-aid and just tell them now, but on the other, it's none of their fucking business no matter how or when they find out.", "What is with all these posts about someone from a \"religious family\" (read narrow minded and racist) who are afraid of offending said bigoted parents?  I mean some are people getting married and don't have the guts to be an adult.", "Okay but a year is way too long…then it just looks like you’re hiding, which you probably would be by that point. Unless you never interact, it takes some effort not to mention your daily life and who you live with.", "There is nothing like having your SO and their parents ganging up on you.", "Do be aware that sometimes kids over estimate what their parents will do or think.  I'd say give them the benefit of the doubt until they do something themselves.  OP's story is touching.  I can't imagine any normal person being upset by it.  \n\nOP's girlfriend is probably insecure because she likes OP and wants her parents to like him also.", "What's wrong with not rocking the boat when introducing a guy you've only been with for 2 months? Let them get to know each other. When it comes up/out in the future their response will most likely be different because they know him vs someone they are just meeting.", "It's none of their business what his sister calls him.  It's not sick or weird and its not relevant in any way to the new \"not-in-laws\".\n\nI agree with the person above, don't mention it.  \n\nOP:  Let them get to know you.  You get to know them.  When it comes up naturally tell the story like you told it above, and if they are NTA, they'll be crying and hugging you because it's an awesome and sweet story.", "I'm way too late to tell you that you are NTA. But I just gotta say that you should be proud of yourself for taking in your 1 year old sister at such a young age and managing to do such a good job. I am 29 and don't think I would be willing to do the same with my 8 year old half sister.", "NTA. I don’t care how conservative you are, there is no way in hell any decent person can dislike someone who raised their own sibling for over 4 years, starting from the age of 22 after the sheer amount of trauma your family must have experienced. You are a great person, and if they can’t see that, they can go to bugger it.", "NTA but to avoid arguments I'd tell your sister to call you dad on that one day because a lot of people that object to things like that get really defensive and a. sort of culture shock id just slowly get your gfs parents used to it.", "NTA \n\nI hope that after you explain everything and that you'll obviously want to be called dad by your kids, they won't take it as such a serious thing even if they're really conservative. \n\nAlso, don't start by lying. They won't mast long anyway.", "Tell it as you've told us here in Reddit.\n\nOur parents died and I adopted my baby sister. I guess I was so good that she started calling me 'mom' and I was proud to earn this title from my sister. \n\nNever try to withhold information from people you (1) are related to, (2) plan to become related to, (3) everyone else. Of course, you don't have to tell them in the first 15 minutes of meeting them. At some point they'll ask about your past and your family. That's when to tell them appropriately.\n\nNTA", "I have kids your age.  If my daughter introduced you to me as her future husband and told me that you had raised your siblings and had embraced all that came with that, I seriously wouldn’t be giving a monkeys what your “daughter” calls you - I would be thanking my lucky stars that she had found herself a partner so obviously filled with strength and integrity.  Maybe her parents will feel the same!!", "NTA Nothing good ever comes from lying. It's precious that she calls you mom. Don't ever let anyone make it bad. You earn the title, you sacrificed to raise her. Even though she is your sister, she is also your daughter.", "Nta", "Guy who adopts his 1 year old sister after their parents died and raises her such that she calls him her mom will leave bad impression on her parents? Fuck those people! Seriously, Fuck them!", "and if they don't like it then screw them!", "> they might insist on making my sister/daughter stop calling me mom to not confuse our future kids. I really don't want to take that away from her.\n\nYou're the Mama. Your word is law. If you let your GF or inlaws take that from her, you'll be betraying your relationship with your daughter. Your inlaws can piss entirely off.\n\nNTA.", "You’ve been dating this woman for 2 months…I think you need to relax a bit planning how your future children might feel and act.", "You have been with this girl for 2 months. Say you got married a year from now, super quickly, then you have 9 months at least before a baby would be born, assuming she got pregnant immediately, then another year before baby is talking. So even if you got married and procreated ASAP this would still be a problem for a good 3 years from now. Don't even worry about or discuss it. If they bring it up just day that is a good thought for the future after you guys have a kid, since it won't be a problem until then", "i agree with you. since OP wants to hopefully build a long term relationship with his GF, not having her parents immediately think he's a weirdo seems strategically good. I'm not saying OP is a weirdo, but if these people are likely to react that way then just let them get to know him and like him as a person before telling them this.\n\nOP's doing nothing wrong and is NTA either way. He should certainly tell them that he has adopted and is raising his little sister. There's no reason to tell complete strangers what his little sister calls him though. That can come out later on. If he does tell them now and they get upset or want OP's GF to break up with him, then he still would be NTA but that might not be the outcome OP wants.", "I assume it’s the fact these people got used to being the “bigger person” or enabling their parents when they were children and just never grew out of it. I doubt the parents suddenly started being assholes once the kids are adults.", "Good point. ⬆️", "NTA. But I don’t think she’s the one for you. She isn’t even willing for you to meet her parents. The real you. Maybe think this one out a bit", "NTA. I love this. My (f) partner (m) also calls himself the mom to my daughter. Its a bit of a joke but he is a parent figure in her life.", "NTA - You're her mum. You've raised her, loved her, done everything a maternal parent would do. \n\nMama doesn't equal gender and that's something her *conservative* parents are going to have to understand - especially if this is a long term thing. (although 2 months is a bit early on)\n\nYour relationship with your Saughter (sister/daughter) is more important than the opinions of people who aren't living your life.", "NTA….but I would explain the situation first.  Once they know it’s a family name and nothing more, they will be fine.  Especially since it was a baby sister who came up with and no one could get her to change.\n\nOn another note, my daughter couldn’t say my sons name and christened him Gucky (he is Augustus 16m) It’s a funny story to explain to friends", "YWNBTA\n\n\nBut I'd talk with your girlfriend again and tell her your intentions and discuss it beforehand so she's not taken by surprise. \"I'm going to let them know so it's not a surprise later on, as I think it will be better in the long run. I'm going to explain why she calls me mom and that I'm fine with the nickname, I didn't want you to be blindsided when I tell them. I appreciate your concern but this is something I feel is important for my relationship with them.\"", ".. I just want to tell you how touched I am by your story and it brought tears to my eyes. You have done an awesome job and anyone who wouldn't accept you, and the nickname from  your sister/daughter  is TA.", "This is the sweetest thing I’ve ever seen on this.", "I'm a little surprised no one is mentioning it, but I'd be concerned if my kid was dating someone for 2 months and had already met + was involved with their young kid. \n\nMaybe I'm jaded from having a single mom, and watching a lot kids (including my step kids and step-step kids) getting hurt by this exact thing, but introducing your kids to someone you've only been with for 2 months is a red flag to me.", "My grandmother was also the youngest in her family, and called \"Babe\". She was known as that in the family up until she passed at age 89.", "My grandson named me daddy’s mommy and I hope it never ends. I absolutely love it! He’s 11 and it has stuck so far.", "And I think this whole thread is ridiculous, talk about jumping to conclusions! OP don’t be so anxious, it’s really way too soon to get bent out of shape about any of this. People here are making up all sorts of scenarios that may or may not have any basis in reality.", "Please for everyone involved seek therapy before proceeding.  2 months is barely a relationship, you do not know these people.", "NTA, so much not- look, mom and dad are heteronormative terms for me but this is the sweetest f'ing story. Your sister never learned the difference, they call you mama. Mama for your sister is t a \"who gave me the most comfort\" term.", "NTA You're parents died, and you became \"father and mother\" to your much younger siblings. Your 1 year old baby sister knew and felt that love and care from you, and picked \"mama\" as her name for you. Your precious baby sister had already lost so much at such a young age, you decided to just let her have that!", "NTA \n\nI think explaining the whole back story of why and how it started will go a long way to softening the blow, so to speak.\n\nWhile gf parents are conservative,  hopefully, they are not cruel, heartless people, and they will see this for what it truly is - a term of endearment.", "It's essentially a nickname born out of trauma and circumstance. If they called you dad, it wouldn't be an issue, which is ridiculous. People need to let semantics go and understand the situation.", "NAH.\n\nYou could say this: I have a daughter - my little sister was 1 when our mother died so I adopted her. Also she has a nickname for me, \"mom\". It started off as silly but now it has grown into our own little thing. So if you hear her call me mom, that's why. :)\n\nI can understand why your girlfriend would be nervous about you telling people you're a mom, especially when trying to make a good first impression. It *is* very unusual and will probably lead to a lot of confusion and questions and make things a bit awkward while they're trying to wrap their head around it.", "This made me tear up. I have nothing to add just waned to wish you well and say I’m glad you found someone. You seem fucking awesome", "This new relationship with your GF is not as important as your relationship with your sister/daughter.  Do not be ashamed of any part of raising her and do not diminish your bond.  If your GF's parents do not accept you for who you are  and your choices, and your GF doesn't have your back - get out!  There are plenty of women and families who would not bat an eye and welcome you with open arms.\n\nYou are NTA."]}