{"id": 11857, "submission_id": "11mrxnz", "title": "AITA for telling my father's wife she can't make me pray or make me religious?", "selftext": "I lost my mom 2 years ago when I was 14. Before that I lived primarily with her and saw my father one weekend a month because he lived several hours from me. He's been married to Charlotte for years and they have six kids under the age of 10. When mom died I moved in with them unfortunately and life became pretty rough. I'm atheist and Charlotte and my father are some kind of Christian's. They go to this small church where there's a big emphasis on everyone taking part. I am forced to attend. But recently I was asked not to come back because I don't pray, I don't engage in services and was also not involved in the youth service stuff they had for kids and teens. They don't like having someone who never prays so my father was told it was best if I didn't return.\n\nCharlotte is pissed. She is not okay with me living with them and not attending and she told me to pray. I told her no. I told her I have never prayed a day in my life and I won't start just for her. She told me I am setting a bad example for her children and I told her I didn't care, that her beliefs are not mine and I'm not sitting there talking to myself or addressing someone I don't believe in. I told her she can't make me religious and the sooner she accepts that the better.\n\nShe told me I was a sinner and I should be ashamed of myself for speaking to her and about the family religion that way.\n\nAITA?\n\nMy father and I are not close. He is no help to me. I do not have the option to talk anything over with him.", "created_utc": 1678367809, "permalink": "/r/AmItheAsshole/comments/11mrxnz/aita_for_telling_my_fathers_wife_she_cant_make_me/", "score": 895, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my father's wife she could not make me pray or religious and I told her she needs to accept it. Maybe I was rude to her when I say that. I think it might have been very dismissive and maybe insulting to her religion so I might be an asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. A true Christian will offer to share, but not force. You have to be called to Jesus, not driven to Him in chains. This from an Agnostic married to a beautiful Christian woman who accepts me as I am, as I accept her.", "NTA Everyone is entitled to their own beliefs. There is no easy answer.  From the sounds of things you need to start preparing for when you graduate.  I'd anticipate that this good your stepmom will try to get you moved out as soon as she can.  Since your dad is no help, I'm worried he'll just do what she wants. Hopefully your dad will help you with College expenses if that's what you want to do.  Just be sure ad look out for yourself hun cuz it doesn't sound like they will.", "NTA God (I don't care which one I'm speaking for all Gods, male, female, undecided, don't care and unknown) only accept prayers given voluntarily with reverence.\n\nIf you can't do that you're just a hypocrite if you pray.\n\nWorse if your step mother orders you to pray she is forcing hypocrisy upon you which God really really hates. Totally totally hates.\n\nTell her God prefers an honest, good person who doesn't pray than an evil one who prays. And if her God doesn't then it isn't much of a God.", "NTA.  Forcing one's belief on others is never morally right. Your father's wife is unlikely to ever accept that though, so you may be best served trying to avoid conflict along these lines where you can.\n\nWishing you luck, and condolences on the loss of your mother.", "NTA. I’m sorry you’re stuck in a household that wants to force their beliefs on you. I mean I’m assuming you’re not rude or disruptive when they pray, you just don‘t participate? Losing your mom is hard enough but being forced into a home like that must make it so much harder. I hope you can get out of there soon.", "Nta. You are 16. You are old enough to stay home from church alone. Maybe see if your grandparents are willing to take you in. Are there any aunts or uncles you could live with?", "NTA. She's the one who is setting a bad example. Trying to use you to help to indoctrinate her children is an awful thing to do. I am very sorry that you are in this situation and that your father is letting you down like this.", "NTA and I’m a Christian.  I’ve never heard of any church asking people not to come for not praying or whatever.  That seems weird to me.  I know there are a lot of churches out there that do things that don’t make sense and pretty much go straight up against what the Bible says thinking they are being Christian. There’s even a story in the Bible about a town full of people getting ready to stone this sinner to death.  Jesus looked at everybody and picked up a rock himself, and he said OK if this is what you guys want to do then who among you has not sinned?  And let this person who has not sinned cast the first stone.  Well nobody could throw a stone.  Also it’s really stupid to tell you that they don’t want you there (for about a million reasons) but whatever.  That’s all beside the point.  \n\nAs far as setting, a bad example to her children, as a Christian, she and your father are the ones that are absolutely setting terrible examples as Christians. Some of the most loving people in my life are atheists, and I often joke that they are the most Christian people I know. \n\nI wonder if you could suggest family therapy? Of course, they would probably want you to go to some Christian therapist who’s not certified in psychology and that won’t help anything. If they have a psychology degree then okay. Might help.\n\nThe problem here has nothing to do with your religion and everything to do with control. Christianity is supposed to be based on love really I tell people there’s only three scriptures that matter if you want to squash this massive teaching down into a nutshell\n\nJohn 3:17 - For God did not send his Son into the world to condemn the world, but to save the world through him.\n\n1 Corinthians 13:13 Three things will last forever--faith, hope, and love--and the greatest of these is love. \n\nAnd finally \n\n1 John 4:16. And so we know and rely on the love God has for us. God is love. Whoever lives in love lives in God, and God in them.\n\nSo you can see - living in love seems more important than having faith \n\nAnd so many Christians like to gloss over this and get crazy legalistic.  I wouldn’t be surprised if I get people arguing with me in here on it. \n\nAnyway, I just point that out to say that your stepmom is being an absolute hypocrite, and she needs to understand that. Even in her own faith, she is not upholding the tenants of that faith. So she is lying about who she is essentially.", "NTA, you have every right to believe or not believe in whatever you want. If Charlotte's faith is so fragile and she's so worried her brainwashing of her kids will crack bc one person they're around doesn't actively participate, then her faith isn't that strong to begin with (one of the ways I used to troll the Christians I was raised around). It's not like you're going out of your way to bash or disrespect them. \n\nI'd ask your dad if this is how your mom would want her son being treated, and how would she feel about the situation if she was there (sorry for the loss of your mom btw).", "I would call child protective services and get TF out of that scary cult house. Also get a part time job and start saving money.", "NTA.  You have no moral duty to play along with her superstitions.  \n\n>I should be ashamed of myself \n\nBullshit. You should be proud of yourself for standing up to her bullying.", "Nta", "NTA. In the christian world, the only one that is allowed to cast judgement on others is God. Charlotte is sinning by passing judgement on you", "Nta. Idk what kind of cult that is because I’ve never been to a church that would get mad if you just sat there", "NTA and I would argue they aren’t Christians if they’re willing to make a child homeless over something so trivial.", "NTA!\nFirst, I'm sorry for your loss. I can't imagine how lost you feel without your mother. Someone your age needs a stable parent figure to prepare you for adulthood. It sucks that you don't have that.\n\n2nd, as Christian, my obligation is to love everyone because Christ died for me. I'm sorry your step-mother and her church don't feel that same obligation.\n\nPlease know that your story touched my heart. I don't know you but I love you and will pray for your growth, happiness and success. You being an atheist and not believing in prayer doesn't change anything.\n\nI hope you take these experiences and grow into a strong woman who can respect yourself, love freely and be very successful. Don't let them bring you down. You are worth much more!", "NTA, not even one bit.\n\nIf your father and his wife are the type of people I assume they are, things are not going to be easy on you until you can get out of that house, be prepared. \n\nIf you need to respond between now and when you can escape, remind Charlotte that her asking you to pray is asking you to lie, and the Bible does not look too kindly on lying.", "Maybe consider contacting child and family services through your Department of Social Services. They are forcing their lifestyle and their religion and then shaming you for it. Sounds like your dad is not the primary parent and the step mother emotionally and mentally abusive to you. You’re growing up in a toxic and hostile environment. Maybe you can request to be placed in the foster care until you turn 18. It sounds like it might be better than your current Living environment. If you don’t have any other family and any other options, I know it sounds drastic but they do have places like boarding schools but they’re really more of a conversion camp that, as  your guardians they could force you to go to. It might be worth a phone call. Good luck.", "NTA - her religion tells her what to do, not you. These folks always end up demonstrating the very opposite of unconditional love.", "I'm sorry for your loss and for your current difficult living conditions.\n\nCharlotte may need to be reminded that it is your father's legal responsibility to give you a home, and if she doesn't like it, legally the only option is for HER to leave.  Also she's a b\\*tch but you knew that.\n\nGood luck.\n\nNTA.", "NTA. She knows her kids will probably want to leave the cult too if they see there is a way out. She most likely feels very threatened by you bringing logic and truth into the situation. She’s going to have a harder time brainwashing her little ones with you around.", "NTA and they can’t make you. Get out ASAP. I tend toward hostility to this type of militancy (and will atone on Yom Kippur) but this church at least has the decency not to want butt in pew if the person isn’t praying.", "NTA\n\nReligions are dangerous nonsense and nobody should be coerced", "NTA - your step mum sounds like a delight. You don’t have to follow her rules.", "NTA, OP and I am sorry you have to endure this two more years. You could ask your step-mom if she will feel better to make you lie that you are praying or when you are honest that you are not praying, but it will just come off as being smart ass and it will get you in more trouble. \n\nThe best thing would be if you lean on the church asking your dad that you don't come again and try not to rub it in her face. Also, OP, I am not sure what the financial situation is, but I would look for some part-time job and start saving money and pushing my grades up (if you are looking to go to college) so you can move out and live on your own terms in future.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI lost my mom 2 years ago when I was 14. Before that I lived primarily with her and saw my father one weekend a month because he lived several hours from me. He's been married to Charlotte for years and they have six kids under the age of 10. When mom died I moved in with them unfortunately and life became pretty rough. I'm atheist and Charlotte and my father are some kind of Christian's. They go to this small church where there's a big emphasis on everyone taking part. I am forced to attend. But recently I was asked not to come back because I don't pray, I don't engage in services and was also not involved in the youth service stuff they had for kids and teens. They don't like having someone who never prays so my father was told it was best if I didn't return.\n\nCharlotte is pissed. She is not okay with me living with them and not attending and she told me to pray. I told her no. I told her I have never prayed a day in my life and I won't start just for her. She told me I am setting a bad example for her children and I told her I didn't care, that her beliefs are not mine and I'm not sitting there talking to myself or addressing someone I don't believe in. I told her she can't make me religious and the sooner she accepts that the better.\n\nShe told me I was a sinner and I should be ashamed of myself for speaking to her and about the family religion that way.\n\nAITA?\n\nMy father and I are not close. He is no help to me. I do not have the option to talk anything over with him.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - You follow your own beliefs. Is there another family member you can live with?", "NTA", "It is Charlotte that's brnging up the subject of religion by trying to make you pray. If she doesn't want to hear your opinion and beliefs then she shouldn't bring it up.\n\nNTA", "NTA. You can't force someone to believe in something. If she wanted to convert you to Christianity (or whatever the correct term is), she's going about it the wrong way.", "NTA Your stepmother has completely lost the plot of Christianity, which is supposed to be about loving people, not ordering them around. I'm sad with you and angry that you have to live with such unloving people. I hope your life gets better. Work had so you can get scholarships and get out of there. It seems like a long time but hold on and work for your freedom. You can do hard things. Much love to you.", "NTA\n\nShe is wrong on multiple levels. And, you should leave a bad Google review, for the church, for starting all of this nonsense.", "I usually defend the \"religious\" side on posts similar to this one, the ones like \"Am I an A-hole because my friend's mom wanted me to join in prayer before dinner at their house\" kind of thing. But your situation is completely different.\n\nNTA, let's get that out of the way. What your stepmom is trying to do is indoctrinating, and that sh\\*t I really hate. Setting your worth to whether or not you pray/go to service/join the youth group or whatever is gross. And kudos to you for standing up for yourself.\n\nDon't focus on this battle, because you can't win. Instead, focus on your education and start looking for part-time jobs. Get the hell out of there as soon as you can and good luck!", "NTA. But she and your father sound like just the sort of AH’s (bad Christians) who will kick you out before you can blow out candle #18. Better have a plan, Stan.", "NTA at all but I would start preparing now to be kicked out of the house as soon as you turn 18", "NTA. \"Christian\" self-righteous AH like your stepmother and father should not force anybody to their beliefs.\n\nUnfortunately they think they are so righteous they might make your life really hard, so you might have to be tactical for the short and long term. Can you go live with grandparents? \n\nDon't know legal implications, check if they can actually force you to go their cult.  You might have to endure it until you are 18 and then leave.", "NTA\n\nReligion and politics. Sheesh.\n\nYou are entitled to believe as you will. So is step mom. And she is free to teach her children about her beliefs, and eventually they will make up their own minds, as well. \n\nIt is important here to respect that someone who does have faith can, and those who don’t do not need to. Also important to recognize that yes, her faith does say you live in sin for that faith - fighting over this is rather fruitless. And it is also ok! You can respectfully decline to participate, which it sounds like you did, without disrespecting the faith.\n\nI faced something similar most of my adult life. My in laws are religious, I am not. There were still plenty of times I’d be on church, but I do not pray, and I do not take communion. I never had it shoved in my face quite like you are tho!", "NTA - I'm sorry you lost your mom and it sounds like it's been a difficult transition living with your father. I get the whole \"small town, big church\" vibe- and it's sad Charlotte is taking a heavy handed approach... she's kinda is missing fundamentals of what it means to be Christian. For what it's worth, I was also asked not to come back bc I was dating a heathen and that challenged a lot of what I believed. Stay strong, believe in yourself and get out when you can.", "NTA - being an atheist isn’t a bad impression on children. You’re not a sinner, nobody should be forced to follow a religion and their rules if they aren’t part of that religion. Honestly I respect religions as an atheist, but when you get these types of religious people telling me I’m going to hell despite being a good person, or that I’m sinning and shit I drop all respect and will do my best to avoid them.", "There’s no hate like Christian love. NTA.", "NTA.  If her children are so easily led astray, then she's the one that set the bad example.", "I'm sorry for all your losses.  Nta", "NTA. You're allowed to have your own beliefs and it's wrong of them to force their religion on you. It sounds like you still have to tough it out for two more years there, though. Do you have a plan for when you turn 18? Is there anyone at all you can talk to?", "NTA good on you for choosing reason and evidence over faith and dogma. Start saving up some money in a bank account that they don’t have access to and find a friend to live with so you can get the f out of there asap. It sounds like it’s going to get worse before it gets better if your step mom is that much of a religious fanatic.", "NTA at all.  The next time she tries to push their religion on you, look her dead in the eye and say \"I am not a sheep therefore I need no shepherd\" and then watch her really flip out!\n\n&#x200B;\n\nBut in all seriousness don't let her push you around. Religion isn't for everyone, but also remember that just because it isn't for you doesn't mean it isn't important to others.", "NTA do you have any other family that you could stay with?", "NTA no one should be forced into a murderous book club.\n\nEDIT:spelling", "NTA forcing someone to join your cult is shitty", "NTA.  But: you are 16 and likely still depending on your father and his wife. If you continue this way, it will be wise to prepare an exit plan: money, papers, possibly a job, a place to stay etc. are all things you will need.\n\nI don't know, if you can be kicked out before 18. You can judge the risk best and whether it might be better to play along for a while. Take care.\n\nThis is not really an AITA-question, given the stakes.", "NTA at all. OP, do you have a job? A job is great for quite a few reasons. First, it will get you out of the house. Secondly, it will get you the money necessary to prepare an exit strategy. Third, you will have the chance to meet new people who are not pressuring you to take part in religious ceremonies that you don’t support. And finally, it will keep your step mom off your back to a certain extent; nobody can say you are setting a bad example for your siblings if you are working all the time. So sorry for the loss of your mother.", "Yeah, I just sit there. But they're all expected to speak/participate and there's no hiding.", "I don't have that option.", "You’d be amazed.\n\nMy mother was asked not to receive communion in a Roman Catholic church, where she was baptized, confirmed, and married - **by the priest himself** - because she was divorced. Different priests have different views, some more extreme than others. All would be okay, of course, if she simply paid the exorbitant fee to the church to absolve the marriage in their eyes. Funny how God needs a fee, huh? This is one of many reasons for my overall cynicism for religion.\n\nEDIT for clarity", "They won't do anything. Had a case worker. Told her about the stuff going on. She said they were within their right to do all this because they're \"my parents\".", "It's the kind of church where everyone is expected to speak and read and pray.", "Right, only non-Christians would do that, because Christians are *better* than non-Christians.  Right?", "I had a social worker for a while after my mom died. This is not enough for them to remove me. They see it as something they have the right to do as \"my parents\" (and I do not consider them my parents at all but in the eyes of the case worker they were).", "please take this advise seriously!", "My plan is to get as far away from them as I can and no, I don't have anyone I can talk to. I go to a Christian school now and I do not trust any of the teachers or staff members there because I'm a pet project to them.", "Chuckle", "The way the church responded and how stepmom responded, definitely sounds more like a cult than anything else. Definitely not Christianity though.", "I agree, forcing them to join is definitely not right at all and they are definitely NTA. However, there is absolutely no reason to insult a religion based on the actions of one person. Not being religious is totally fine- just don’t insult someone else’s.", "I don't and I'm not allowed to have a job. Girls don't work.", "Stuff like this is so senseless.  And this is why Jesus went into the temple and threw the tables over calling them a den of robbers.  I’ll never understand why people can’t be loving.", "You’re 16 now. You can get emancipated.", "I hope it’s not Jehovahs witnesses. Anyway, NTA. Stick to your guns, you’re absolutely right about this.", "What are you on about?\n\nI’m not even Christian, but Christians are supposed to care and support people - love thy neighbour and all that.", "If you can put up with Charlotte and continue to not attend, go ahead with not attending. \n\nIf you want to keep the peace, close your eyes and put your hands together and think about other things. I memorized 100 digits of pi. Countries and capitals. Lyrics to songs. Major history dates. General musings. And then when you move out, you can tell her you weren’t actually praying, if you don’t want her to feel like she won.", "Oof, I'm sorry. Do you have any family on your mom's side you can turn to?\n\nMy advice to you would be to save as much money as you can, look into all the scholarships and grants that would be available to you, and most of all, remember that this is a temporary situation and that there are plenty of people out there who will accept you for who you are.", "Is there any family that would support you in leaving?", "Yuck.  That’s rough and not what you need.  Sorry you are going through this but I hope you don’t end up hating all of us Christians based on what these people are doing.  I have a lot of atheist friends and we have no quarrels with each other. I know so many churches that have hurt so many people and it just breaks my heart. I’m really sorry you’re going through this and I did make a comment up above that explains why your stepmom is actually not being Christian and I put scriptures in there so she can’t refute it.  She’s the one being the bad example to her children.", "I was like you. Mom died when I was 13 leaving me with an abusive stepfather. Who married a freaking Methodist pastor when I was 15. The religious pressure was real. I dealt by lowering my head and closing my eyes when it was time to pray. Didnt pray, just thought about whatever. \n\nI also didnt have any 'other' family. None. Wasnt allowed to work or have friends. So how was I supposed to escape if I had no money and no where to go? I studied my butt off. Got good grades, extra curriculars, etc. So when high school ended I got a scholarship that got me the heck out of there. In the meantime learn to just give the right answers and pretend as best as you can. Does it suck lying and being disingenuous and a hypocrite? Yes it does. But know that YOU know WHO YOU ARE and as soon as you get out you have the rest of your life to be you.", "Why not? There's lots of christian cults out there.", "I'm sure they thought his actions were insulting but from an outside perspective I don't think it was. And it depends there's definitely critiques of probably all religions that may be insulting to those people but that doesn't make them not true", "This is the situation where you look at doing medical transcription on the internet and open a separate account that you don't bother ever, ever mentioning.", "Jesus was the AH for that. If the other Jewish people had no issue with it then he had no right. Imagine I go to your church and destroy your Bible and altars and crosses and then spout some nonsense of you not being righteous. That’s the same deal.", "Not without CPS on my side and I would need to already be working which I'm not allowed to do.", "And do what? She wouldn't be able to afford to care for herself at 16", "I was told - when forced to go to my fathers church- that i could just sit and read the Bible. So I sat and read. And I just looked at it as just reading a bunch of myths and legends… and zoned out because omg dull… I wish I was one who could fall asleep with their eyes open….", "Nobody who I could contact. My mom didn't have much family and the one relative I did/do know, I have no way to contact.", "Nobody who I could contact. My mom didn't have much family and the one relative I did/do know, I have no way to contact.", "Most of these cults just front Jesus and behind it all it has nothing to do with Jesus. It’s all about power, money, sex and manipulation. History has provided us with plenty examples.", "She's a minor, she can't.", "Do you live in the US? Not saying it will be easy or practical, but your dad is getting social security survivor benefits for you. If you can move out, you would receive those benefits directly. Just something to keep in mind.", "I got emancipated at 16. It was extremely hard but worth it. My circumstances were different but I didn’t have much, if any, familial support either.", "Could that relative be helpful? Might be worth trying to find them (through Google, Facebook, LinkedIn, etc.)", "If you know the area they live in and you have Facebook, you could post in some community groups in their area and ask if anyone knows them. Even if they don’t use social media, a colleague or friend may and might be able to connect you.", "Is that because you're missing contact information that exists?  \n\nI'm a reference librarian.  I'm not going to encourage you to reach out or provide sensitive information to *anyone* you speak to online, especially because you're a minor.  But I think you should make your way to your local library and ask an experienced reference librarian if they can help you locate contact information for this missing relative.  If you don't have the relative's full name, a reference librarian who has genealogy experience can potentially help you track that down too.", "For sure, like the catholic church for example.", "Happy cake day!", "They're elderly and didn't have any kind of social media last time we had contact. No internet at all in her house.", "Definitely NTA but you need to start planning for the worst. Your stepmom cannot legally kick you out - yet. But either at 18 or the moment you graduate high school she almost certainly will. If you aren't allowed to work you won't have money, so you need a plan so you aren't homeless.\n\nDoes your school have a counselor you can talk to? Hopefully they can point you too resources in your community. Perhaps you have extended family who can help as well.\n\nHowever you do it, in the next two years you need to figure out:\n\n- Legal documents (birth certificate, passport, etc.) - Is your stepmom petty enough (or disorganized enough) to prevent you from accessing them? You need to be able to take them when you go.\n- Money - You need as much money as you can get in a bank account your parents can't access. Ideally they'd be unaware it exists.\n- Living Arrangements - Are you going to college? If so you may be able to couch surf until you move into a dorm. If not you need to find a place to live.\n- Transportation - Do you need a car where you live or is there adequate public transit? If you need a car, do you have a license? If you have a car, whose name is on the title? If you can't take it with you what will you do?\n- Inheritance - If you inherited anything from your mom do not trust your dad with it.\n\nDon't let yourself be caught off guard. Your stepmother does not have your best interests in mind and your dad will not help. It's not fair but it's better to accept it now and prepare for the worst.", "NTA - hang in there until you can move out, make sure you have all your documents and a phone that's not in their control. Might be a good idea to keep them at a trusted friend's or relative's home.", "Everyone is a sinner, according to Scripture, so she's being pretty hypocritical. Bide your time and get out while you can.", "No you’re obviously NTA. Children have religious freedom too, and she has no right to interfere with your religious preferences. She also has a lot of nerve accusing you of being the disrespectful one when she is quite literally trying to force you to be a part of her religion.", "Ugh. NTA. I apologize on behalf on all Charlottes.", "If she's so worried you're a bad influence on the younger kids, then what she's really worried about is that they don't have real faith. Which is just lolz to me. Faith is something a person should choose, that includes young children, and like you said she can't make you believe. NTA at all. I'd be prepared yo be kicked out when you're of legal age though. Sounds like she isn't going to want to keep you around if she isn't legally obligated to. Plus you'll be better off away from that toxicity.", "NTA\n\nJust tell her you stopped believing in fairytales a long time ago.", "NTA\n\nBut if you're able to and it wouldn't be a burden to your studies, get a part-time job to build savings for the inevitable \"you're out when you're 18!\" that's coming. I can almost smell it now - tell you church or the streets, AND that you need to pay rent and become a babysitter as part of the privilege of living there.", "Your freedom of religion is protected by the constitution. You just tell her that you won't bother her to stop believing and she can stop bothering you about starting to believe. \n\nYou represent dissent and otherness to her. Religion, as interpreted by small-minded people, only works if no one ever questions anything. Tell her you are fine with her religious beliefs and that you just wish for all of you to be able to live under a house in peace - but you will not be forced into a religion because that is not OK.\n\nShe is afraid her own kids will see the bullshit now that a representation of reason is in the house, her kids will ask questions and normally all the answers are the same in her religious bubble, but with you there, not so much.\n\nStand your ground.", "This is what I find so loathsome about the religiously addicted.\n\nI don't care one jot who believes what about who or when they did it but it drives me to distraction when they try to force their beliefs on me or on society in general.\n\nYou are in a miserable position at the age of sixteen and I admire your courage and resilience. It appears your mum taught you well. I don't know if I'd have had the balls to slap back against an adult in such circumstances.\n\nFrom one 'sinner' to another, stick to your guns as far as possible (and as far as is safe) and plan very very carefully for the day when you can finally leave. \n\nNTA at all. Good luck", "Religion is like a male member. It’s ok to have one. It’s ok to take it out and use it privately. It’s ok to share it with other consenting adults. It’s NOT ok to shove it in the face of someone that doesn’t want it. It’s wrong to share it with children that lack the ability to understand and it’s wrong to try to force it on anyone. NTA.\n\nDon’t argue, don’t bother. All you need to say is “it’s ok to not believe in God given the lack of evidence.” If you fight the younger kids will see it. If you remain firm, non-confrontational, but confident, they will see it and hopefully break out of the indoctrination because you modeled a rational person.", "As a Christian who fully believes in God I can tell you with 100% honesty that you are NOT the asshole here. She is. You are a grieving child. You just lost your mother. I know how this feels. I was 9 when my mother died giving birth to my baby sister. The way your stepmother is acting is not even close to being what the Bible says. She can spout a thousand scriptures a day and yell God's name until she falls over but that don't make her right.", "NTA by a longshot.   Join the United Church of Bacon and become a fryer (friar).  Haha.  As atheists we are so persecuted by the religitards.\n\nEdit: no such thing as a “family religion “.  It’s an individual choice.", "Yta", "nta. u have a good sense of boundaries. u don’t have to do something just bc someone tells u.", "NTA and I think there is something in the Bible about being accepting of each other (I am also not religious), so you should remind her of that. It's something a lot of people seem to forget.", "Gawd you are in a tough spot and I feel for you.\n\nNTA \n\nThe church should be more accepting and asking your Dad to not bring you back to their church is horrible. Imagine asking a father to not bring their child with them to Church. Super gross.\n\nUgh, any grandparents or aunts/uncles you can stay with?\n\nDon't despair, you got two more years and then you can call your own shots.", "NTA and the amount of eye rolling I do everytime someone begins preaching about hell 🙄", "NTA. Nobody can force their religion on you.\nYour dad should really stand up for you.\nSorry for what you've been through.", "NTA. It won't help, but remind her that her kids are going to encounter people out in the world with different beliefs. Also that Jesus loves sinners :-) Stand strong and move out when you are 18.", "NTA, my family tried this on me for years it finally dawned on them when they took me to a midnight 3 hour service for new years as a teen. I refused to pray, talk, or acknowledge anyone. I became even more of a black sheep, a sinner, and embarrassment. They finally shut up when I called all of them out for their dirty laundry and bigotry. Then told them for people who keep preaching about God and love etc. None of you show that at all and unless you have no sins whatsoever keep my name out if your mouth.... it's been peaceful for me ever since.", ">1 Timothy 2:12\n\n>*I do not permit a woman to teach or to assume authority over a man; she must be quiet.*", "NTA - Tell her you are exercising your religious freedom.  Sorry for the loss of your mother.  Would anyone on your mother's side be willing to assume custody until you are ready to move out on your own?", "NTA.  Do you  have a school counselor or empathetic teacher you could talk to about this?  I'd suggest you ask to see a therapist, but many fundamentalist Christians think prayer is better than therapy, or they go to their pastor for counseling.  Two more years and you will be out of there.  Good luck.", "This is so crazy. How do they know if you're praying or not? It's a bummer if your parents make you attend church, but sitting quietly and respectfully should not get you kicked out. NTA.", "NTA - I'm sorry for the loss of your mother. I hope that you are able to save and get out of this environment safely.", "NTA, but sometimes you have to give in to horrible bullies like that while they are in control of you.  Don't make a stand that makes your life miserable. Just think, when you are an adult, if you choose, you can go low or no contact with them.", "NTA.  That is assuming you were not disruptive at the services, and simply sat respectfully, as you would during any \"lecture\" or \"presentation\".  I'm sure you are counting the days until you turn 18.  \n\nIf step mom hopes for you to become religious, she should but be forcing it down your throat. She should let you see the light she sees, and hope you want to be a part of it.  I've never seen the \"eat your vegetables\" approach to conversion actually work.", "Your ~~mothers~~ Dads wife is an AH, your dad is an AH for not stepping in and helping you. The church they go to is an AH and obviously not real Christian if they are kicking people out for not praying or taking part... absolute hypocrites.\n\nI hope that you are able to get out as soon as possible and away from that drama... are you able to stay with friends where you used to live?\n\nLastly, I am so sorry for your loss. 2 years is not a long time and how they are handling you is an insult to your mother, you and baby Jesus.\n\nNTA\n\nEdited a word", "As soon as I read your title, my decision was made, NTA. It’s your RIGHT to believe or not to believe. No one can force Christianity upon you. To follow religion is your decision and your decision alone. I’m an atheist as well so I stand with you on this issue. Your step mother has zero right to make you pray or follow her religion. As you said her religion is not yours and you are absolutely correct on that. \n\nNTA", "NTA Keep up the righteous indignation and ferocity in the respectful manner you have been. Don't bend!", "NTA. Beliefs are like butt holes, it's fine to have one, it's not fine to force it on anyone else.", "NTA \n\nI also lost my mom young and had a controlling stepmother when I was your age. Be true to yourself, keep your mom close in your heart, try to focus all your energy on school because it  can be something positive in a crappy situation and get therapy if you are able. It seems like a long time when you are young, but in 2 years you can move on with your own life.", "NTA - don’t pray. She’s just going to make it worse for herself by forcing you.", "NTA\n\nI was also always dragged to churches as well, really traditionalist types too. And those people at least had the grace to say that they were fine with nonbelievers coming just to expose them, even if they didn't participate (as long as they were respectful). Your dad's church sounds insufferable. Don't cave to people who want to force you to believe things or else go through the motions.", "NTA. \n\nI was raised in a religious cult. It's awful that she is trying to force you into one. \n\nIf you can, get a job and start saving up to get the heck out as soon as you turn 18. \n\nIf they try any stunts (like kicking you out when you are a minor or any neglect or abuse for not following their beliefs) please get cps involved if you are in the u.s. I'm not sure what the equivalent is in other countries.", "NTA. Well done standing up for yourself. You're in such a tough situation. In a couple of short years you'll become an adult and I hope will have the ability to leave your dad's. Just hold on for that day to come.", "NTA.\n\nTell her she's not going to be getting into Valhalla with that attitude.", "You’re Nta at all. I can’t think of any religious organization that tries to force prayer. How could that be sincere if you don’t believe? So odd.", "NTA - Charlotte sounds like the worst kind of person.", "NTA\n\nThey should be ashamed of themselves. Forcing religion on someone who has repeatedly stated they aren't interested is sinful. \n\nThey might call themselves Christian, but they sure aren't walking the walk. \n\nGood luck OP, I hope the universe smiles down on you and gets you out of this situation soon.", "NTA . so long as you are not talking down the church in front of the kids then you've done nothing wrong. in fact you're refusing to be a hypocrite.", "**NTA**\n\nI cannot express how disappointed I am in your father. Charlotte is the typical ram it down everyones throats, keeping up with appearances, self righteous Christian. Rather than expressing her faith with love and compassion in the hope that showing you constant inclusion and acceptance will awaken a shared faith in you she uses her religion as a weapon of judegement. \n\nThe real MVP AH here is your father who, after the loss of your mother, does not seem to be trying to fulfill any of his obligations as your dad and protector. I am vicariously ashamed of him. As for her kids. If their faith is so fragile that seeing someone not share it pulls them out of religion then it is the fault of the belief systems fragility not yours. Sure I would not rub it in or be disrespectful of their christianity under their own roof but this can be achieved without sharing it. I am nor religious but I respect anyone who uses virtually any belief system to spread love, empathy, compassion and lead a generally morally valuable life. \n\nDo you have any other family?", "NTA and you might ask her to show you the bit of the Bible where Jesus says her behaviour is OK. He had very particular opinions about sinners. That should keep her busy at least until you've moved out due to it not being there.", "There is no hate in the world like Christian love. \n\nNTA. Can you move to your maternal family? Grand parents? Uncles / Aunty?", "OP, I am sorry for your loss and the current situation you find yourself in.\n\nFirst, absolutely NTA.\n\nSecond, this is about control, not religion.\n\nThird, if you are able to get a job, you will have to hide your earnings and I'm not sure how you would be able to do that in a full house. Since you're a minor, I don't think you can open a bank account without an adult. Do not do this! Too many horror stories of the adult misappropriating the funds. \n\nIf it's truly unbearable, then you may want to seek a lawyer's advice or do some internet research about minor  emancipation. \n\nMy petty advice is to read the bible - learn it backwards & forwards so that you can rattle off Psalms and piss off your stepmom that you know the bible better than her. Many atheists know the bible better than practicing Christians. \n\nMy practical advice is to keep your head down, pretend (mask) if you have to, study hard, get those good grades, do whatever extracurricular activities you can (sports, music, clubs), and start applying for college & scholarships on the down low. \n\nUSE those teachers who view you as a pet project to YOUR advantage. E.g., if your dad/stepmom don't allow you to participate in after school activities, enlist your teachers to talk them into it. Keep in mind you may need teacher recommendations for your college applications; unless you are absolutely certain you have them wrapped around your finger, do not ask them. \n\nStart researching state assistance so you are prepared at 18. Gather your documents (SSN card, birth certificate, etc.). Gather your essential belongings. Again, on the down low. Don't use your home computer or phone for your escape.\n\nMy final advice is that once you are clear of that toxic situation, you get some counseling. Good luck, OP.\n\nEDIT: Did you your mom leave you anything? Proceeds from the sale of her house, life insurance, anything like that?", "NTA, but buckle up for a rough 2 years until you turn 18 and hopefully get out.", "NTA lmao you're amazing. Thank you for standing up for yourself, a lot of stories here are about pushovers but NOT YOU! Finally a breath of fresh air", "Tell your step-up you will pray. Go to church. Pray real loud:\n\"Hail thee, SATAN,  I welcome you in this house of praise to your glory\"/s\n\nWell, I am petty.\nOf course NTA", "NTA. As a devout Catholic, I am so sorry that your family is treating you so horribly. From what I see, Charlotte doesn’t care about her kids’ welfare or about your spiritual growth: she just wants to misuse religion to control you. \n\nIf she doesn’t stop or starts mistreating you for refusing to pray, consider speaking to her pastor. Explain that you are atheist and respect your family’s right to practice their religion, but you are being harassed at home for not participating; on top of that the church has asked you not go if you don’t participate anyway! Having a stern talk from their pastor might shut them up really quick. \n\nI hope you find a trusted adult in your corner soon. My condolences for your loss, also.", "NTA. This is obnoxious on her part and needs to stop. Sorry you ave to deal with this crap.", "I would die on this hill NTA she can fuck off", "Where is the compassion and understanding, organized religion is such a sham", "NTA. Charlotte is the one setting a bad example for her children, they need to learn how to be respectful to others who have different beliefs.", "NTA  \n\n\nThe fact is god isn't real. In some sense I can't prove this, but in another sense, there isn't remotely sufficient evidence for the existence of a god. And the obvious fact that different people in different times have believed different things about gods makes it abundantly clear that religion is a sociological and psychological phenomenon, and not a recognition of a real aspect of the universe.  \n\n\nSo no, someone who refuses to pray, doesn't attend church, etc. will never be an asshole for that. We live in a society where it's quite normal to go to church, but they're the ones being unreasonable.", "NTA OP.  I would consider talking to someone about child emancipation if I were you, because this whole thing sounds like abusive behavior to me.", "NTA \n\nAs someone who is moderately religious, I think it is disgusting to try to force your beliefs down someone else's throat.  Do you have any other family that you could stay with, grandparents,  aunts, or uncles?", "Nta", "NTA\n\nWhat did I just read? As a professing Christian myself I am baffled by this. What cult-like church is this that kicks someone out simply because you don't copy their every move? Creepy.\n\nI'm sorry you have to go through this after losing your mom. Your choices are your own, but you are in a difficult position. Your life is going to be hard these next few years because you're not willing to bend to their cult.", "NTA", "OP, DM me, and I’ll teach you how to say some simple Jewish prayers. They want you to pray right? \n\n\nAlso, definitely NTA", "She called you a “sinner”. Automatic NTA, OP.", "Huge NTA! Thats their belief system not yours and to force it down your throat is shitty as a minimum. To berate you and call you ba sinner is vile..what the heck is up with religious people being unkind and judgemental to non beleivers.  Not cool.", "NTA. I hope you can get out of there as soon as you're able to", "This is absolutely terrible and I am so sad you are going through this. You already lost your mom and now this. First as a mom, my heart breaks for you. I will give some advice regarding the pressure I see from some people on social media for these types of extremists.  Fake it. Fake that you are praying. Fake that you are listening. Treat it as you would studying a boring class at school. Regurgitate back what they want to hear. \n\nI hope you can find someone who will give you safety but right now you don't want to be homeless. As soon as you can get a job do so. Save everything you make. I am willing to bet as soon as you are 18 this step mother will make sure you are out of her house. \n\n Not all teachers are extremely Christian in a lot of these schools.  Maybe with a bit or time you will find who can be an ally.", "Nta", "You literally have a constitutionally protected right not to believe. NTA.", "You are NTA, not a sinner and you have nothing to be ashamed of.  I cringe when people insist we respect people's religions. NO. I have zero respect for a bunch of bronze age, rewritten, made up fantasies about mythical sky fairies. Zero respect for brainwashed beliefs. It is not 'respectful' to enable ignorance, or contribute to religious fallacies. \n\nHowever, you should definitely have a plan in place for your 18th birthday. Charlotte is going to toss you into the street (like a good, caring Christian woman).", "NTA  \n\n\nYou need to call child protective services on your family.   \nThis is emotional abuse.", "Nta", "NTA. You have a right to your own beliefs. Hang in there for the next two years, but in the meantime I recommend you get your ducks in a row to be self-sufficient by the time you're 18. If you can, get a part time job. Start saving as much as you can; save for a car, do well in school. Get yourself a starter credit card the day you turn 18 so that you can start building your credit. That will be necessary in order to lease an apartment, car, etc. The more financially independent you are, the less control they will have over you. These two years probably feel like a lifetime right now, but someday you will look back on it and it will just be a blip in time.", "That's a pretty hateful church if you are not welcome there because you won't pray. NTA", "NTA. When she says you're a sinner, tell her only God can judge. Also that Jesus hung out with sinners, so you'd be in good company. I'm pretty sure both of those are true across all Christianity regardless of denomination, so she can't argue with it really.", "NTA. I’m so sorry you are in this situation and my condolences for the death of your mom. You are right to not take on what they are trying to force onto you. Are there other, kinder relatives you can live with? You deserve to be respected for who you are and you have the right to your own beliefs. Their job is to help you to become the best you that you can be, not to be miniature versions of your dad and step mom.", "NTA… have you seen Saved? I might suggest going to church next time and finding the Holy Spirit compelling you to shout “I haaaaaaavvvvvve a hooooooooooot poooooooosaaaaaaaay!” see if Charlotte invites you back…", "Get a job and get out of the house as much as possible. You're not allowed to work because girls don't work? CPS ignored you. Wow. Welp volunteer then. \n\nJoin a bunch of extra curriculars. Stuff envelopes, do Habit for Humanity, register people to vote, help senior citizens with chores, whatever. I did all that and more. \n\nTry to make a ton of friends and hide at their houses. Okay, I see they put you in a brainwashing school and you have no friends. Is this an actual school, as in, is it accredited? Can you find ex members of this church? Because they might be able to help. \n\nForget your step mother now. She should be an emotional void to you so you don't let any of her bs in your mind. \n\nApply for every scholarship you find or an apprenticeship or whatever works for you. At eighteen, out the door to a better life.  Every thing from now on is focused on out of the house, short term and long term. \n\nNTA.", "NTA but since you are just 16 with no network to help you, it may be safe to play along, which sucks.  Just close your eyes and put your head down.  You can tell people it's a lot, you are still learning and struggling internally and you feel like silent reflection is what you need.  In your head you can think about whatever you want.  You also need to work your butt off in school and get some scholarships so you can bounce after graduation.  Also start looking into local places to work that offer scholarships, I know McDonalds is one.  Do not let them have access to your bank accounts, do not out them on your bank accounts.", "I was baptized in two different churches when I was a child and was forced to attend religious services at both (my maternal side and paternal side) throughout my upbringing. My brother and I were left confused and would constantly question our learnings. As a result of that questioning - I'm now an atheist. \n\nMy family (both sides) has a big issue with this. All that praying and learning two different religions was a waste of time. My life was never better as a result. \n\nSome of choose to believe in science not storybook idols that never prevent tragedies or make the world better. You should not apologize for having different thoughts or be forced into a religion - that's a cult.", "Stay strong. Know you're right, and your folks are wrong. I'm sorry to hear about your mom. That's a lot to deal with at any age. It's worse when you have zero support from the people you live with. NTA", "NTA do you have any other relatives you can stay with? You have a right to your own beliefs. You were not rude. She was downright mean to you and you responded.  \n\nI am religious but I’d never force it on my own kids much less my step kids. Once my kids were teens they could choose to attend youth activities or not.", "Just start asking the most uncomfortable questions. Like, why? And, why?", "NTA. I’m sorry you’re going through this.", "Tell her it is a bigger sin to pretend to believe. And an even bigger one to force someone into servitude, especially in the name of religion. She may want to read her Bible, not just have a preacher quote it at her.", "NTA. After seeing your post and your comments about school, being forbidden to work because you're a girl, etc., you need to look into emancipation. Don't even stay the next two years; get out of there as soon as you can. You need to find some legal and governmental help, and you need to tell them \"I am being forced against my will to participate in religious activities\".", "NTA and I think you’re an excellent role model for her children for following your own values.", "NTA - I'm proud of you. You're very smart for such a young age and brave for standing up to this lady. Where was religion when your dad chose to not be a part of your life or left your mother....?What hypocrites! Like most christians they prothlytize a set of beliefs that they only deign to embody to feel superior to \"non-christians\" Then they live their lives by a whole diff set of contradictory standards. Good luck, kid.", "NTA \n\nBut is there any other place you can live?", "NTA.\n\nYou're allowed to believe in whatever you want, including not believing. If you keep having trouble trying to debate/stand your ground and expressing yourself - I highly recommend the Atheism subreddit. They are constantly showing people their rights in your area/country and providing source material to counter peoples religious remarks with their own scripture.", "NTA: I would say that there is two ways to go about it you can keep your head down make it a point to be above reproach in everything else and let the storm wage around you and just do not engage it in any way.  Being clear that your stance has been made already and refuse to talk about it further. (this is the preferred as it has the least active combat and you ride out the next 2 years until you leave and then never engage with that level of toxicity ever again.)  \n\n\nOption two and this is WAR (I don't actually recommend this but I can appreciate cracking and just not being able to keep your mouth shut), compare every thing they do to strict sects of Islam and watch them spin out every time.  If they are going to treat you like and infidel and call you hurtful things then point out who they look like.    \n\n\nJoking aside please get yourself into therapy ASAP because trauma from cultism like this sect of Christianity is a real thing and will impact you later in life.  Sadly there are not a lot of protections for children for forced indoctrination like this, the only thing you can do is build a support network outside of them.  If you are not in a religious school or god forbid the bible belt maybe the school councilor can help you find resources? I was forced to go to a christian private school and do the church thing so I get what it is like.  Good luck!", "NTA. I rather like your style, very direct. Bad example? Not my problem lady. The manipulators hate this one simple trick. Keep doing you.", "**NAT**\n\nBUT!\n\n**My advice is for you to find Jesus' Glory ASAP and repent!** Cry for your sins if you must (better to do it during a service)! Play their stupid game until you can support yourself, then cut off contact! Im sorry but if you stand your ground, the family dynamics will get way worse :( **Having a roof over your head should be the priority.**\n\nI was in a similar situation, only difference is that my parents never mentioned to kick me out. I had to play their religious game just to keep peace - I had nowhere to go and no income. As soon as I went to college and found a job I started planning my exit (local college so I was still living at home).\n\nMalicious compliance: Go to church, become friends with influential kids, and tell them how much of a sinner your step mom is, and how bad they treat you. If you can act well, they might even give you some college money!", "What a strange church.\nI have never heard of such a thing but no you’re NTA", "NTA. I am proud of you for standing up for yourself. I like what you said.", "NTA!!\n\nFor starters, as someone who was raised Christian, being asked to not come back to the church is a RED FLAG. No church wants you to leave - they want you to stay so that you can start to understand what they're about, their teachings, etc. Additionally, the intensity that this religion in ingrained in your family is nearing on disturbing. So this sounds more like a cult than an open-arms, loving church.", "NTA, you are free to look them in the eye and tell them to go fuck themselves, take comfort in knowing that you are better than them simply by dint of rejecting their BS.", "Overall NTA but I'm curious of you voiced your opposition to folks in the church. It seems odd they would ask you not to come back. How do they know you aren't praying silently?", "I taught at a preschool and after lunch/recess we had yoga to calm our bodies. It was student led, they all got a day to lead and choose whatever poses they wanted, and usually an exhibition of the littlest dictator. There was a mom who made us pull her son from class during it because she didn’t want him “praying to false idols.” We tried to explain it wasn’t religious, we were a secular school, it was basically just stretching silently to calm down before class, that she was separating her son from a daily activity and isolating him. She didn’t wanna hear any of it. If she ever did the math on the teachers she’s realize her child was taught by a Muslim, a pagan, and an atheist. The level of fragility of her faith that stretching and goofing around with his friends posed a threat.", "If she's a Christian her fear of being tested isn't biblical, faith is sustained by Job despite being tortured by God with diseases,loss of wealth and the death of a child but he never breaks faith, why is this woman so faithless she's tested by a child not pretending to believe", "Sad but often true.", "Except that of every other religions.", "I don't know, plenty of atheists here giving it a run for it's money.", "And if anything I think OP is setting a good example for her stepsiblings.  Not everybody they meet in life is going to be part of the same religion... not even family.  And they don't have to either.", "A church told someone not to return? Yeah, that's not a church, definitely a cult. There are a few in my area like that. If you don't completely devote yourself and ALL of your free time to \"the church\", they don't want you there.", "C: Sinner! \n\nOP: You’re taking this out of context!\n\nSeriously, you don’t have to join their cult. It will make them … likely angry or at least go through some stages of grief. Reactions vary. Remember, they like to start indoctrination when kids are young. \n\nNTA", "Wouldn't it be more disrespectful to pray and not mean it? I'm not religious but I feel it would be.", "Absolutely this! You are certainly in the right, prayer and religion in general should never be a requirement. However, your stepmother does seem like the type to kick you out over religion. Start preparing now. Hopefully you will have till you are 18, but you never know. Make and save money if at all possible so you have an exit strategy. Or consider playing along until you can support yourself ( a sucky option but may be necessary). Use all this as motivation in the mean time, because you certainly won’t be able to rely on them in the future. Get good grades to get scholarships if you can, or start looking into trade schools. Anything you can do to get ahead now. The best revenge will be a successful future without them! Good luck to you and I wish you the best!", "living under a bridge is 100% better than living with christofascists", "I think it's illegal to kick out a person who is underage. IIRC the parents are legally required to provide basics for them: food, clothing, shelter.", ">This is not really an AITA-question, given the stakes.\n\nHard disagree, no matter the stakes the question remains valid.", "I'm a youth group leader at my church, and we have kids who don't believe in God. We listen to what they have to say, and then we ask if they want pizza. No harm no foul.", "This is a great way to put it. If you are follow a religion because you're forced to rather than because you truly believe, would you even be able to go to Heaven?", "If anything, if those types of people are the ones going to heaven, then I'm quite content going to hell lol", "I go to a Christian private school now and have nobody I can speak to there.", "Do you want to explain why?", "They see me not sitting the same way and also I won't speak prayers out loud like they do.", "Yeah, I don't go anymore but IME normal churches would rather someone stick around and be part of the community unless they're being actively disruptive. Kicking them out for not \"feeling it\" is a weird strategy!", "She was probably warned about the evils of yoga bc it came from the pagan Hindus (literally what I heard the youth pastor at the church my parents made me attend as a kid). So sad smh. If I was a parent and my kid was being taught how to sit still and relax, I'd be stoked and encourage it.", "She sounds like the type to be offended that the school is teaching her child Arabic numerals", "Idk, but I don't get the belief in a mythical sky daddy, so I'm at a loss.", "Have you read Job beyond the first 2 and last chapter? Job spends most of the book yelling at God? It’s probably the angriest book in the Bible and most people think of it as the book about the patiently suffering Job.", "Oh, really? Every religion? You've participated in every single religion on this Earth and found them all to be unilaterally hateful? Impressive.", "Really? You think the actual literally atrocities still pulled in the name of god stand up to anything done recently by atheists? Listen, I know we go too hard sometimes and criticism devolves into hate. I call fellow atheists out when I see this. But this just isn’t a “both sides” thing. Atheists being mean is peanuts next to what religious fanaticism has produced", "Not really the place for this sentiment, in a thread where OP is being dragged to church by dad and stepmom who are now calling them a sinner who should be ashamed of themself, and is forced to attend a Christian school where their teachers see them as a pet project (their words), after the death of their mother that they were close to.", "Sure buddy, keep spreading that love.", "Atheists can be assholes.  Atheism cannot do harm.  Religion can.", "Unless atheists are pressuring for laws that strip people from their rights, this isn't even a race.", "I'm not gonna get angry over what fantasy book you like. Lotr. Koran. Bible. Golem or Jesus is your fav character I don't care. Quit trying the indoctrination to your book club cult to children. Telling small kids they going to hell for thinking about a penis. What a demon you'd have to be to support that.", "Half siblings, they share blood, and I agree with you. She is setting a good example for free thought and objectively looking at ideologies.", "True Christians welcome everyone. That includes nonbelievers. Church's are up in arms about declining membership. It never crosses their minds they are sometimes hateful, judgemental and cultish. If you can't love the people that walk thru the door, you need to take a hard look at yourselves and the message of Christ. OP I'm so sorry you stuck in the situation. Two more years and you can walk away. College or work with people that accept you", "These types of churches consider image to be much more important than actual values.", "\"No true Scotsman\" in action", "Indistinguishable", "How many people does it take?  \n\nI mean, should we limit it to just the people who have been hurt and abused by “Christians” in the past five years?  A decade?  Cause you really really REALLY don’t want us looking at Christianity throughout all of history.", "Do you need an itemized list of people/reasons that make it a cult or do you know how to use Google yourself?", "I assure you we don't mock religion because of the actions of one person, there's plenty of reasons.", "The actions of that church are cult like though. You can say this cult is not representative of Christianity as a whole, but it itself is clearly a cult", "Where's the insult? The word cult? that's not an insult, that's the definition of the word. Cult, noun, an organized religion.", "[removed]", "Easy to say if you're not the person under the bridge.", "Yikes. Have you seen the movie [Saved](https://therokuchannel.roku.com/watch/edf6729e2e4356c6affd770dd8af61de?source=google)? It happens in a Christian school and I think you'd find it funny and comforting.", "Sounds like a Pentecostal church.", "How do women support themselves then?", "Wow. Your family sounds… intolerable. My first instinct was to give you some subversive advice on how to make your dad and step mom’s life miserable, but that wouldn’t actually benefit you. I think in this case it would be best for you to kind of ease them into the idea of you working.  Is it possible to get a job with their church doing something non-churchy? Like grounds keeping or some kind of office assistance? What about volunteering someplace like a senior living center, a shelter, habitat for humanity, or a library? Something that is religious adjacent and community focused. Or even some kind of internship, although those are rare for high school age. You mention your religious school views you as a pet project, maybe you could be a teacher’s aide for a bit. These things might be acceptable to your step-mom as she might see it as you interacting with her church community, but they would also kind of ease her into the idea of you not being in the house and being useful to the community at large. It sounds like she wants you to engage in her religious community, and you can do that in your own way, without having to practice that religion. So I guess my over all advice is to not rock the boat, but very quietly start taking small steps that will make it easier to gain your independence from your dad and step mom. Money and good friends are going to be what makes that possible.\n\nEdit to add: babysitting! That is probably one of the jobs your step mom will actually approve of!", "That line makes my blood boil. NTA btw", "Any friends? It would be rather surprising if all of them had the same issues. They might be able to help short term while you find your first job.", "Maybe you can find their phone number and get in contact again. This isn’t just about church. It’s about the way she is mentally and emotionally mistreating you. You are strong and you are resilient, and one day, you can pack a bag and not see or speak to those people ever again.", "Wait until they find out where algebra came from!", "If Street Fighter has taught me anything is that yoga is pretty dangerous in the wrong hands.", "My kid's preschool had a yoga program. It was awesome and I reinforced it at home. He's well into grade school now and still does yoga and meditates.", "Well I don't believe in it either but under Christian doctrine it is pretty faithless to be that terrified that your face would be broken so easily. You've got a bully Christians with their own ridiculous rules", "Simply pointing out that hate mongering isn't exclusive to Christianity. Feel free to extrapolate though. It is Reddit.", "Agreed. At least when atheists are assholes we don't think god is on our side about it. We also lack the systemic organizational power to enforce our assholery on a broad scale.", "But you don't understand, atheists are pressuring the government to take away political power from the poor oppressed Christians. The separation of church and state isn't what Jesus wanted! Christians in lawmaking are just forcing everybody to follow what is morally correct according to them and no one else, as the Bible intended! \n\n/s", "Pretty unfair to bring up LOTR beside those religious books, Tolkien was a talanted author!", "My neurospicy brain is thinking “oh, we could make a SPREADSHEET and color code it by country!”  But then I remember I overly empathize with the pain of women and children, and I know that I wouldn’t make it through just ten minutes on Wikipedia reading about the “love” Christians have for others.", "Christianity is not a cult. There are cults pretending to be Christianity, but it is not. And yes, I would like a list of what makes it a 'cult'.", "There will always be people inside religions that give it a bad name, but you need to judge the religion itself not the actions of an individual. Sure, there are valid critiques of religions,  however calling a religion a cult for no reason is an insult NOT a critique. You’re not edgy or progressive for hating religion.", "That's not any definition of cult I have seen. Care to site your source for that?", "I'm not a Christian... I just don't believe in insulting what someone else believes in because it is edgy.", "Unfortunately, her stepmom is being entirely Christian. And the fact that your takeaway is that you hope OP won't end up hating all Christians is really telling. You're more concerned with the brand than you are with anything else.", "It’s kind of shitty of you to make an instance of a child being mistreated by the adults in her life over religion into an opportunity to defend your religion", "I grew up being forced to go to a pentecostal church, those people are beyond batshit insane. Random people in the audience randomly jumping up and mumbling incoherent jibberish nonsense... \"speaking in tongues\" and then the totally full of shit pastor \"translating\" for the audience member.... even as a kid I was shocked these people just ate that shit up and asked for seconds.", "They marry and live off their parents until that point, ideally.", "Marriage", "This part of the bible is not in the oldest versions of the bible and was clearly made up after the rest of most of the stories in it.", "They’re supposed to yes. Unfortunately, practice strays rather far from theory.", "The devil, based on my experience of it LOL", "😆🤣😂", "😂", "That's awesome!", "Agreed", "This post isn't about other religions, and other religions aren't attempting to impose their beliefs on everyone in America right now. It's about Christianity, and Christian nationalism is the problem in America right now, largely because of churches like the one in the OP.", " Christians love to use the line \"they're not really following Jesus' teachings\" whenever something ugly in their religion comes to light, but then continue to support/tithe/vote in line with the organizations harboring these \"unchristian\" Christians.\n\nObviously, not all Christians, but enough that I'm pretty fucking tired of seeing the mental gymnastics performed to prove Christians are basically wonderful little blessed sheep with only a few wayward wolves in their midst making the flock look bad. \n\nAdditionally, Jesus occupies a tiny fraction of the Bible, and his teachings don't outweigh all the murdering and raping of the other holy men in service to God's will or the insane laws of the Old Testament. Those laws are still widely used in Christian circles to justify stripping people of their rights.", "All organized religions are cults. Thats literally the definition of the word cult.", "Surely no true Scotsman would attend such an establishment.", "Like Catholicism and Evangelicalism, and also Eastern Orthodoxy. They are *all* about power (always men in control), sex (anti -abortion) and money (tithing).", "yes, they gain that power and money by talking about jesus, have you heard of mega churches and their prosperity gospel, aka the more you donate now the more god will give you in the future.", "You're not wrong, but that is a big definition rabbit hole to go down through.\n\nBecause if you really want, it is trivial to literally disqualify any (established or fringe) religious group from what they claim to be based on their own scripture.\n\nSo for definition purposes, we usually rely on self-identification. Does something claim to be a Christian/Islamic/whatever group? Then we're putting them in that category.", "…..if they’re ‘fronting’ Jesus, then it’s a Christian cult.", "They're still Christian.\n\nI grew up in a Christian cult. In fact, my childhood looked kind of like OP'S minus the six kids. I also had to dig my feet in and refuse to pray, study, or evangelize. They kicked me out when I turned 18 (church and parents).", "It’s all about power, money, sex and manipulation\n\n&#x200B;\n\nsounds like christianity to me.", "Why are you being downvoted lol? You’re right! 🤣", "Oxford Dictionary\n\n>a system of religious veneration and devotion directed toward a particular figure or object.\n\nChristianity is the Cult of Jesus. It's fine. I can appreciate how you'd not want Christisnity lumped in with what you likely consider those *lesser* religions.\n\nMythology vs Religion vs Cult is all a matter of timing, perspective and popularity.", "But Christianity is a death cult. Can you explain how it's not a cult?", "A church that demands you engage with it in a specific manner and for a large portion of your life and shames your family if you don't seems pretty culty to me.", "Ahhh, “no true Scotsman” argument.  Sorry to break it to you, but that doesn’t hold water.  \n\n“The actions of an individual”. Pretty sure a VAST majority of Christians isn’t “an individual”.  Perhaps you’re too close to it to think rationally.", "Nah, calling a religion a cult is pretty spot on. Have you ever heard of the [BITE](https://freedomofmind.com/cult-mind-control/bite-model/) model? \n\nIt’s basically a list of how to tell if you’re in a cult or not. Most of, if not all, religions fit the criteria. Some of the characteristics are exactly what OP described in their post. It’s a cult alright.", "Interesting you think the only explanation is to \"Be EdGy\"", "Try posting about your situation on the atheist subreddit. You'll likely get some good advice, info about scholarships for the nonreligious, and just maybe someone might step up and help out.", "Aw, I'm so sorry. I lost my mom was I was young too, 11. Never did like my stepmother, still don't.\n\nI'm a mother now, I have a daughter just a few years older than you. If you ever want a mom ear, feel free to reach out. :)", "it sounds horrible and you shouldn't have to, but might it be best to play along with it? Given that you don't have much support and if you continue your likely to be kicked out at 18 or whenever she can legally get you out. I don't know what your finances look like nor your plans, but either way prepare for the eventuality, and if you realise that 2 years isn't enough time, temporarily playing nice may not be the moral thing for you to do, but desperate times call the desperate measures.", "I really don’t think it’s fair for you to accuse me of only being concerned about a brand.  What I’m concerned about how easy it is to form a bias and live hatefully instead of lovingly.  I even go on to talk about how churches have hurt so many people. It’s a sad situation and it’s true. But it’s important to know that not everybody is like this you yourself just said that all Christians are the same and that’s completely unfair. You obviously have a bias, I don’t know your story I don’t know why you want to hate me for no reason I don’t know why you wanna accuse me of only caring about one thing when that isn’t true and I was expressed in my post.  It’s really weird that you focused on that.", "And it’s kind of shitty for you to focus on me, defending certain people, not an entire religion. Not defending the religion and not defending the churches that are doing the stupid stuff. How does me saying that her stepmom is a hypocrite support my religion??  How does admitting that many people who profess to be Christian end up doing the opposite help my case??  All I’m saying is to watch out for bias.  Which you obviously have.  \nOut of everything I said, the only thing you want to focus on the fact that I don’t want an individual to hate everyone in a group of people because of one experience or a few experiences. I don’t think it’s unreasonable.", "LOL. - okay.  That’s not what it was and they weren’t happy about it.  (Shrugs).", "Hard agree.", "No its not. The definition of the word \"cult\", the way we're using it here, explicitly excludes mainstream religions.\n\nWord mean things, and if we use them too broadly they lose their meaning and punch. We can talk about the shady things organized religion has done while still recognizing that a cult is a different thing.", "Reddit just loves to insult religion. Who cares what people believe in? Just live ur life- they’re not harming anyone. It’s not edgy to hate religion.", "That's what Christianity's always been though. \n\nA way to control the masses, by promising an eternity in heaven", "I tend to have controversial opinions 🤣", "You are correct in terms of the Oxford Dictionary definition. However, that is not what's commonly used to refer to as a cult- I do see your point however.", "It's not on people to prove a negative, it is on you to prove your assertion.", "Again, not a Christian- not that it makes a difference anyways. If it goes against what the entire religion stands for then those people are not part of that religion, as much as they'd like to claim they are.", "Well to call the Catholic Church a cult with no explanation or reasoning seems to be an attempt at an edgy joke. Perhaps I am wrong, and that's not what it is- in which case I'll accept being wrong. However, a lot of people on this website do insult religion to be edgy- without any proper reasoning as to why. Perhaps that's not the reason that this person had, or others- however it still stands that people do insult religion in an attempt to be edgy.", "Yes, atheists believe in helping others and charity, too.  Shocking (to those good Cs) but true.", "“They’re not harming anyone” when talking about religion is a wild statement. \n\nCompletely ignores that the post is about someone being harmed by religion. \n\nCompletely ignores the many many recent time religion has harmed people. Ask the school girls being poisoned in Iran if religion has harmed them. Ask the survivor of Residential Schools in Canada if religion harmed them because you can’t ask the thousands of children they have found in unmarked graves. \n\nCompletely ignore the full 3000 years of human history and millions upon millions who have been abused or straight killed in religious wars because of religion. \n\n\nIf someone wants to practice a faith on their own and believe what they want, I’m not gonna fault them. That’s fine, but that’s rare. It’s wild to claim religion isn’t harming anyone.", "It's the same organization who forced my ancestors to join or be killed and eradicated their culture. Religion have done countless harm throughout history, especially the catholic church.", "Uh, it seems OP is being hurt by religion. Not to mention all the other awful shit that’s done in the name of ‘religion’. I don’t usually care what people believe in, everyone needs something to keep them going, but to say that religion doesn’t hurt people is ridiculous.", ">they’re not harming anyone\n\nLike OP?", "Bad take. Organized religion is actively hurtful to millions of people. The last pope wrote an official manual for the church on how to sheild pedophilic clergy from any form of consequence for their actions.\nAny good they do is immediately wiped away by the lives they destroy, have destroyed, and will destroy. \nIf someone wants to be spiritual, that's a-okay, but the minute they organize, by design, they start to take advantage of the poor and the ignorant.  People don't hate religion to be edgy, people hate selfish, venal predators who have tax exempt status.", "So that last SCOTUS decision had nothing to do with religion? There are no states/countries that don't have to bow to religious laws? Please.", "> Just live ur life- they’re not harming anyone.\n\nDid you not just read the OP of the thread?", "> they’re not harming anyone\n\nThey are tho", "They're clearly harming someone hence the reason OP is here. Some redditors do dislike religion because of the very real negative impact it's had on them, and others.", "But not All denominations of Christianity are “bad”… I say let people believe what they want as long as they aren’t hurting themselves or anyone else", "Actually I said it's a cult that person said umm actually it's not so it's on them to defend that statement and show that it's not a cult. But if you want here's the first definition of cult the Google pulls up \"a system of religious veneration and devotion directed toward a particular figure or object.\" So how is it not a cult.", "religions are all just cults, the only difference is some are more widely accepted.", "Bless your heart, just full of excuses and justifications aren’t you?", "I mean the entire religion stood for slavery, genocide soo", "Do you have her address - could an old fashioned letter work?", "Oh I hate that feeling of being a pet project to nuns at a Catholic school. At least that's what I'm imagining based on what you said, and I've been there. I was a scholarship student. It was so awkward.\n\nSometimes you really just got to get through shit. You are absolutely not an asshole here, and it sounds like you have an exit plan. Have you heard of the gray rock method? You act as dull as possible when someone you don't want to engage with repeatedly tries to engage with you. Short responses, never trying to explain anything, never giving details, just acting as boring as can be. Might be worth trying.", "I'm talking about people who believe in a religion- not those who abuse it's wording and message for their own ideologies. What this person went through is awful and is exactly what I'm talking about. I feel extremely sorry for the people who have been harmed by the misuse and abuse of religion by sick people. I specifically said 'they' are not harming anyone- referring to those who believe and practice religion- not those who abuse it's message for personal disgusting practices.", "Normal religious people are not harming anyone! These are not!!! A collective group of people do not represent an entire religion.", "How? What normal person who practices religion is harming anyone?", "If you would like to debunk what I have said then I am all ears. If not then move on.", "Ok, I'd like to see evidence for your claim. I've never heard anything like this before.", "No one complains about a religious person who practices it privately and quietly, so defending them seems unnecessary. \n\nUnfortunately that is just a small portion of religious people.", "If you actually read the Bible and the Torah and the Quran, they all talk about smiting your enemies and about telling people about your God and then if they don't automatically, right then and there, accept your beliefs, that you have the right to kill them. \n\nSo these people are harming others simply by doing what their holy book tells them to do.", "the former pope was literally covering up child abuse lmao.", "How many Christian/Catholic priests have abused kids. How many nuns from this religion abused and enabled abuse. Your statement is so wrong it's unbelievable. Go see the religious abuse subs and educate yourself better. On their past and present.", "You can't \"no true Scotsman\" your way out of acknowledging the shittier things done by your community. The saying here is \"a few bad apples *spoil the barrel*\".", "Every time they hold someone to a standard that is only dogmatic, they are harming them.", "Well, sure as hell sounds to me like OP is dealing with a whole lot more than just “an individual”.  Every single shitty and terrible thing I have personally witnessed and experienced due to Christians is a whole lot more than just “an individual” in my 40+ years.  Perhaps you aren’t actively paying attention to what is actually happening in America for example.  A whole lot more than “an individual” is passing and attempting to pass laws taking the rights away from whole swaths of people.  You can say they aren’t “Christians” all you want, but it doesn’t change the fact that when the representative majority of any one group behaves a certain way,  and goes out of their way to harm others, that they somehow magically aren’t a part of that group?  You either have some serious issues processing reality, or are engaging in a bad faith argument.", "People do- and that's why I need to defend it. The religion itself is not the harmful part- as much as people would like to believe. It is people who take the religion and it's teachings to defend and continue to practice disgusting ideologies which is the problem; and yet nobody is saying that. Those who believe it and practice it without causing any harm are not 'a small portion of religious people'. Those who are not doing that are not practicing that religion- unless what they are doing directly aligns with what is said within that religion- in which case the religion is flawed.", "The religion itself is not compromised of the people that claim they believe in it. There will be good Christians as well as those who claim to be Christian who are bad people.", "Those people are not Christians. People who claim to be Christians but harm people are NOT Christians. Explain to me how my statement is wrong. Regular people who are practicing a religion are not harming anyone. What the religion stands for is not harming anyone. It's those people who take the religion and misuse it, claiming it is the religion is what is wrong. A lot of those people do exist and they give religion a bad name. And it's quite arrogant of you to request me to 'educate myself' without trying to understand my point.", "You say my community like I'm Christian, which I'm not. Those who claim to be religious without practicing the beliefs of it are not part of that religion no matter what they claim to be. There are people out there who are using the religion's name and reputation to harm individuals, which is extremely wrong and goes against the religion itself. So if someone directly does something against what they claim to be, are they really what they claim to be? No.", "What standards are you talking about?", "They are not Christians if they do not follow the religion itself! Whether they be good people or bad people! I am more than welcome to accept criticisms of the religion itself, based on what it stands for. Even if there are a large community of people claiming to be Christians, that doesn't make Christianity uphold what they are doing."]}