{"id": 1193, "submission_id": "ylzni8", "title": "AITA for not cleaning up after my roommates mess?", "selftext": "Am i the asshole for posting a picture of a dirty pan that had been up on the stove for a day (at least) to my roommate group chat and saying “cleanup after yourself”?\n\nI live with three people and we all get along well. I woke up this morning and went to make some eggs on the stove, and the pan i like using (not our only pan) was dirty from previous use. So i took a picture and captioned it “cleanup after yourself” and sent it to the roomie group snapchat. Made eggs with another pan cleaned it up, and put it away. Was getting ready to go to work and a roommate came out and cleaned the snapchat pan up, saying he wasn’t going to forget what was just happening, giving off the notion that he was personally offended by this behavior. I don’t think the snapchat was this aggressive or demeaning, as if i saw it and it was my mess, i would go clean it up. nuff said. Now i feel bad like i should’ve cleaned their mess. Am i the asshole?", "created_utc": 1667569954, "permalink": "/r/AmItheAsshole/comments/ylzni8/aita_for_not_cleaning_up_after_my_roommates_mess/", "score": 5, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because i called out someone publicly to the roommate group chat. Thing is, i didn’t know who had done what.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Petty and a bit passive aggressive but not the asshole. Communal dishes should be washed after use.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAm i the asshole for posting a picture of a dirty pan that had been up on the stove for a day (at least) to my roommate group chat and saying “cleanup after yourself”?\n\nI live with three people and we all get along well. I woke up this morning and went to make some eggs on the stove, and the pan i like using (not our only pan) was dirty from previous use. So i took a picture and captioned it “cleanup after yourself” and sent it to the roomie group snapchat. Made eggs with another pan cleaned it up, and put it away. Was getting ready to go to work and a roommate came out and cleaned the snapchat pan up, saying he wasn’t going to forget what was just happening, giving off the notion that he was personally offended by this behavior. I don’t think the snapchat was this aggressive or demeaning, as if i saw it and it was my mess, i would go clean it up. nuff said. Now i feel bad like i should’ve cleaned their mess. Am i the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH. That’s some passive aggressive nonsense that’s not helping anything. How about you just use your mouth and tell them it bothers you? If that doesn’t work, get yourself a basket and put yourself one of everything in there and wash up your own things and they can deal with their own. Y’all are all being immature", "ESH - your delivery was rude and will only exacerbate the situation. \n\nBut yes. People should clean their mess.", "NTA. \n\nBut you were rude, a teeny tiny bit. \n\nMaybe next time, just DM them.", "NTA. \n\nBut in the future maybe try to determine who it is so not to embarrass someone? It could be taken that way. Probably how your roommate felt. I wouldn’t have taken it that way but not everyone thinks the same.", "ESH Nicer delivery possibly, but cleaning up after them isn't a good idea as that will escalate into always cleaning up after them in every part of the house share.", "ESH - \"Can you please clean your mess?\"", "Dirty people are the worst cuz when you call them out on their filth they get mad at you. NTA tell your roommate to grow up and clean a pan.", "I’m too nervous to step on toes I gotta live with every day, so I personally would’ve like added a “please” in the Snapchat or something, but NTA. And you definitely don’t need to clean up after them. You’re all adults, and adults should be expected to keep up after ourselves and respect common living spaces at the very least. Plus, you didn’t know which roommate(s) made the mess, so you couldn’t have handled it privately, so I get it. I think throwing it in the group chat is the best option 🤷🏻‍♀️. Sure, people could see it as passive-aggressive, but I’d rather do that than be aggressive and confrontational, or passive and just clean the mess up myself or wait for it to be cleaned up (and I know how long that can take sometimes 🙄). It is what it is sometimes.", "If i knew who had the pan i wouldve. I didn’t know🤷‍♂️"]}