{"id": 1194, "submission_id": "ylzn3h", "title": "WIBTA if I spend my money to buy stuff for myself when my family is (kinda?) on a tight budget?", "selftext": "edit: placed my order, it's expected to arrive on sunday :) also yes I know how spending 150 on pens sounds like but I'm having a rough time rn and i like stationary\n\nok so we're like, not financially ruined we just can't spend too much money on buying things. and as someone who barely spends money I have no frame of reference what's considered too much (im stupid. please bear with me.)\n\nso I want to buy myself some pens that I don't really need but it's multicolored and I am weak to temptation, and in total it will cost almost 150 in our currency and I have 500 saved up because I have nothing to spend money on except snacks and when my parents occasionally borrow my money for like bills and stuff. \n\nso wibta if I buy those pens?", "created_utc": 1667569929, "permalink": "/r/AmItheAsshole/comments/ylzn3h/wibta_if_i_spend_my_money_to_buy_stuff_for_myself/", "score": 5, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I'm spending money on unnecessary stuff 2) kinda feel selfish since my parents are telling me to save money since we kinda have a tight budget\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nkinda time sensitive I have like 2 hours to decide lol I hope this is coherent enough \n\nok so we're like, not financially ruined we just can't spend too much money on buying things. and as someone who barely spends money I have no frame of reference what's considered too much (im stupid. please bear with me.)\n\nso I want to buy myself some pens that I don't really need but it's multicolored and I am weak to temptation, and in total it will cost almost 150 in our currency and I have 500 saved up because I have nothing to spend money on except snacks and when my parents occasionally borrow my money for like bills and stuff. \n\nso wibta if I buy those pens?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta but if you don't need them then don't buy them. Now is the perfect time for you to start learning about saving and everything", "Info: what currency is this? If you were talking euros or usd I wouldn’t say YTA for wanting to spend your own money but don’t be dumb and blow over a quarter of your savings on ridiculously expensive pens", "NTA. It's your money, you saved it, and you should be free to spend it however you want. Also,  unless you actually have a high paying job, I don't think parents should be relying on their children for bills.\n\nThat said, I would consider holding off on the purchase because 1) you don't need it (as you said yourself), 2) it's a huge fraction to spend on just a \"want\", and 3) you may need it for an actual emergency (not just family bills). Also, holding off on a purchase and saving more would mean you can get better items in the future.\n\nMaybe find something to motivate you to save, like you can save more in time for the holidays  (if you celebrate holidays).", "Info how old are you?", "Bills and stuff are more important than pens that you don't really need. YWNBTA if you resist.", "NAH. Please help the family. Sounds like your family is going through a tough time. Don’t be wasteful. You can always buy the pens later when circumstances improve.", "More info needed.  YWNBTA if you do not have an agreement to contribute to hh bills and/or know that those funds could make or break the hh.  If you have agreed to assist or you know that those funds will be needed or your family could be in a financial bind then you would be the AH.  Honestly, more info is needed.", "INFO: are you responsible for paying the bills normally?", "NTA, It‘s your money that you saved and if you want to buy something from it than you should, it’s not like you spend your whole money, it’s just one pants that you want. And if you ask me, as a parent I would be happy that my child can get this pans by themselves and didn’t have to ask me who would (because of the financial struggle) say no.", "NTA. 150 isn´t that much to spend on your hobby and the money you saved up is yours. You still have money left and as you mentioned in the comments you´re underage so you shouldn´t be expected to provide for your family financially. Parents are responsible to provide for their children, not the other way around.", "From reading the comments to get more information NTA. It’s your money to spend.", "NTA- it's your money and your decision if you want the pens.", "NTA it's your money, so you can spend it as you want. It also doesn't matter whether it's from saving up your allowance money or otherwise gifted money, or whether it's money you earned by working a job or helping out neighbors with chores - just in case it should ever be an issue in an argument.", "Philippine peso (php) it's actually cheaper (being 11 pesos per pen) because in stores pens like that sell for like 12 pesos and multicolored ones are like 15 or something and pretty hard to find outside shopping malls unfortunately", "16", "my money's kinda used only in emergencies, or like if my parents don't have small bills, so they borrow mine and pay it back later with my next allowance", "no im in highschool", "not really worried about an argument this is more like a weird extension of catholic guilt or something. thanks", "It’s still a huge chunk of your savings. I think it’s ok to buy stuff for yourself, just if you’re planning on spending 150 and they’d are 15 each so you really need 10 or would 4 be ok or 6?", "I mean do what you want with your own money but that seems expensive given how much you have saved up. Seems like a reckless purchase to me", "YWNBA if you used your money.  So, go ahead and splurge on yourself.", "Then you would not be TA if you bought the pens. That money is yours, and you get to decide what you spend it on.", "im just explaining my though process here: i can't really buy just 1 since 100+ for 4 pens is too much and because of vouchers 4 packs with 4 pens each costs 141, while 2 packs costs 146 because there's no applicable vouchers and 3 packs has a discount of 3 pesos making it 189. feels kinda fucked up and like I'm writing a math problem ngl\n\n(also my monthly allowance is like either 500 or 300 and the next one is given when I run out of money)", "it absolutely is :) im currently too sleep deprived to give a fuck tho \n\nalso you didn't ask for this but I did the math and rounding stuff down, basically every pen is worth 11, and on normal stores it would be like. 15. because it's not the usual black/red gel pen, which costs 12 because of inflation (it used to be worth only 10). tbh i just bought 4 packs because it's cheaper, 141 because of vouchers compared to 180+ for 3 packs because no vouchers apply and shipping fee is full price", "Buy the pens."]}