{"id": 11965, "submission_id": "11nsudw", "title": "AITA for not telling my family that I'm going to die", "selftext": "\nI (23f) found out that I'm terminally ill and likely only have a year left even with treatment.\n\nI recently just finished my internship and was offered a job which I quit only being at it for 3 months after finding out and moved by in with my parents.\n\nMy parents don't understand why and have questioned me quite a bit about it and my responses been I don't really feel like talking about it and they have respected that.\n\nI have been moved in with my parents for about 2 weeks and had gotten a phone call from my doctor which my younger teenager (17) sister has overheard because I didn't know she was home and had the phone on speaker phone.\n\nShe started aggressively questioning me about it and accused me of being selfish for not saying anything and asked me what I expected to happen when I started showing obvious signs and got to the point where I couldn't care for myself.\n\nShe demanded that I told my parents as soon as they got home as well as my other sibling, grandparents and even friends.\n\nI begged her not to say anything and she agreed not to but expressed how she doesn't think it's the right thing to do though.\n\nNow I feel really bad because I really don't want to tell anyone I just want my last moments to be filled with happiness and I feel like once everyone finds their gonna be sad and I'll have to cheer everyone up while coping with my illness as everyone always goes to me when their experiencing hardship even my parents.\n\n So would I be I'm the worng if I choose not to anyone? And am I the asshole for keeping quiet about my illness.", "created_utc": 1678463784, "permalink": "/r/AmItheAsshole/comments/11nsudw/aita_for_not_telling_my_family_that_im_going_to/", "score": 1715, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The reason why I could be the asshole is because I am keeping a secret my illness from my family which will eventually be the reason why I pass \n\nWhy this may make me an asshole is because I think it may be taking away the time my family gets with me because they may not take it as seriously or it may be harder for them because they didn't expect my passing\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Honey, I don't want to call you TA here, but the honest truth is that you now live with your family. That means that when things get worse, they are going to be the ones there to take care of you, and they really should be aware and able to prepare for that.\n\nI understand that you don't want to hurt them, and you don't want to have to console them when you are going through it, but I do feel like it's important to sit them down and have a conversation about it.", "You have a right to keep this information private. I would encourage you to find a therapist and work out how to communicate with your family your end of life desires--that you don't want to be the one to help them cope, you just want to be able to enjoy the time you have. But that is entirely up to you.\n\nHowever,  putting the burden of this secret on your 17 year old sibling is wrong. It may have been revealed inadvertently, but now that she knows it is absolutely not fair to put this burden of being the only one who knows and keeping this from the rest of the family on her shoulders.\n\n&#x200B;\n\n>So would I be I'm the worng if I choose not to anyone? And am I the asshole for keeping quiet about my illness.\n\nThat ship has sailed, you are no longer in a circumstance where you can keep quiet and choose not to tell anyone, because like it or not, someone knows.\n\nEdited to remove the judgement, I'm not going to judge end of life decisions on this model.", "This is an awful situation, I’m so sorry you’re going through this OP.\n\nIf you were living on your own elsewhere and chose not to tell them, then that would 100% be your right to make that choice. However, you chose to give up your independence and move back in with your parents and so you now have limited that freedom. You are living in their house, they clearly love and care about you and, as you are living there, it is there right to know about your deteriorating health. \n\nYou cannot move in and just expect to die there without warning and preparing them first. Whilst the situation is tragic, that choice would be the ultimate selfish act and would likely leave them with a lot of anger, hurt, blame and resentment once you pass.\n\nDealing with terminal illness is tough and you are likely going through your own grief at the moment. However, it does not give you the right to make selfish decisions that ultimately negatively impact those around you.\n\nYour sister is right, sit them down and tell your family. Then plan some fun stuff together so that you can all make memories that they can reflect on with tears of joy rather than anger and frustration. YTA if you don’t do this now.", "YTA \n\nspeaking as someone who experienced beingwhere ur family is rn.\nmy dad lied about his cancer not being terminal and instead of letting us focus on him and enjoy time with him during his last year on earth he kept it hidden.\nwe got the most awful suprise when he was basically dying and we couldnt be with him.\n\ni still have trust issues from this and its the only reason im still angry at him, tho i love him n miss him loads still.", "NAH.\n\nIt's your condition, you get to decide who to tell and when to tell them.\n\nBut, if you don't tell your family, then it's 100% understandable for them to wonder what's going on in your life to cause this change, so they're not assholes, either. Nor would they be if they get upset when you (hopefully) eventually tell them.", "Telling them now is the biggest gift you can give them. Maybe one of the few things that will help them after you pass.", "YTA. You’re signing up your folks to provide you with hospice care without even telling them?! They need to know; you need to have a proper conversation about this together. \n\nIf you want to pretend it’s not happening for a bit longer first then you need to *tell them that’s what you need to do*. \n\nThe better you communicate about your needs, the more chance they have of being able to meet them.", "I think you should tell them, but I don't think you're an AH for not doing so yet. You've just received truly horrible news, and to me at least, you seem to still be processing that. I don't think there's a right or a wrong way to deal with what you're going through. If you don't tell them, they'll probably wonder why not for the rest of their lives.", "NAH - As long as it is a short delay in telling them.\n\nIf you try to hide it forever, YTA. Plus the longer you don't tell them, the more painful it is going to be when they figure it out or your sister tells them how long you've been keeping it a secret. \n\nSorry you are going through this, but hopefully you have some people that can help you transition. :(", "NAH.\n\nI don't think anyone who doesn't have a diagnosis of a terminal illness is in a place to pass judgment on how that information should be shared with friends, family, or loved ones. It's way too personal and particular to your individual situation.\n\nI would encourage you to do things to make the last year of your life the best it can be. Starting therapy ASAP is a good idea. And, quite honestly, telling your parents seems like a pretty good idea. They're going to start getting ideas sooner or later, so I think it's probably better to share that information than keep it to yourself. I don't mean to put pressure on you, but based on having a few friends and family members who have passed at a young age from terminal illness (cancer), the overwhelming theme I've experienced is that it's better to go through this with people supporting you than on your own.\n\nI'm not a therapist. I don't know you. I'm so sorry this happened. My advice, if it's worth anything, is that you still have a valuable life to live. It's not your burden to care for others who are getting this news. You have to trust the people who love you to do the right thing and be there for you.", "I don't think there's a right answer here. \n\nI can understand why you would want to keep it to  yourself, at least for a while. You are still coming to terms with everything, and you have that right. \n\nOn the flip side of that, I can see where she's coming from too. If my child or close family member was terminally ill and only had a short time left with us, I'd want to know. I would want to be able to support them in any way I could and prepare myself for what was coming. \n\nOnce you are gone, they will spend the rest of their lives missing you and wondering what more than could have done if they'd have only known.", "YTA. Your parents and loved ones need to know so they can be there for you.\n\nYour sister is right that you are an asshole for not telling your family. \n\nYour family is going to find out soon. Its best if its from you rather than them figuring it out. \n\nSO yes, OP, you are the asshole since you are going to rely on them in the near future to  help take care of you.  \n\n\nAlso, sorry you are going through this OP. Its not fair at your age.", "You would be wrong to not tell them. There are many gifts of words to be exchanged still. Live without regrets for yourself with an eye out it will be years and decades for them.", "Gentle YTA\n\nHow will your last moments be filled with happiness if you aren't honest? And if your sister knows, please believe she will tell your parents sooner or later. Tell them so that all of you can begin to enjoy the time you have left. Who knows, but your parents will be more understanding of why you moved in and aren't working- and maybe they will all come together to make lasting memories for all of you. I dont want to put this pressure on you but you are the one dying so I guess you don't think about how this will be once you leave. But remember once you are gone, they will still be here and you don't want them to be miserable or in pain wishing they had the opportunity to do things diffrent with you.", "YTA for not telling them. \n\nI see why you haven’t and understand that you’re likely still in some sort of denial about this and want the control/not all the focus to be on the fact you’re dying. But if you love your family (which it sounds like) you’re denying all of you the opportunity to celebrate and be there for the life you have left by keeping this a secret.", "Its your choice, so NAH\n\nBut please keep in mind that they also have a very hard yourney ahead, wether you tell them or not. \n\nIf you invite them on your yourney it will surely be different than when you don't.\n\nIf you tell them now, they'll be sad but they'll also try to make the best of it.\n\nIf you don't tell them they'll be sad, they'll forever wonder why you couldn't tell them and they may even feel a little betrayed...\n\nI wish you and everyone around you a lot of strength and the best. I hope you can still make the best of it!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (23f) found out that I'm terminally ill and likely only have a year left even with treatment.\n\nI recently just finished my internship and was offered a job which I quit only being at it for 3 months after finding out and moved by in with my parents.\n\nMy parents don't understand why and have questioned me quite a bit about it and my responses been I don't really feel like talking about it and they have respected that.\n\nI have been moved in with my parents for about 2 weeks and had gotten a phone call from my doctor which my younger teenager (17) sister has overheard because I didn't know she was home and had the phone on speaker phone.\n\nShe started aggressively questioning me about it and accused me of being selfish for not saying anything and asked me what I expected to happen when I started showing obvious signs and got to the point where I couldn't care for myself.\n\nShe demanded that I told my parents as soon as they got home as well as my other sibling, grandparents and even friends.\n\nI begged her not to say anything and she agreed not to but expressed how she doesn't think it's the right thing to do though.\n\nNow I feel really bad because I really don't want to tell anyone I just want my last moments to be filled with happiness and I feel like once everyone finds their gonna be sad and I'll have to cheer everyone up while coping with my illness as everyone always goes to me when their experiencing hardship even my parents.\n\n So would I be I'm the worng if I choose not to anyone? And am I the asshole for keeping quiet about my illness.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "this one is a hard one and i feel really bad for you OP but i’m giving you a soft YTA. here’s why i’m giving you that. yes telling them is important. but at the same time it’s your choice. i don’t think you need to hide your illness forever. but like i said it’s your choice. i think you should have time to find out if you should tell them out at dinner or at your parents house. i wish you the very best OP 💙💙💙💙💙💙💙💙💙", "Leaving them to wonder for the rest of their lives is the worst thing you can do to them. Read up on the families of missing persons - without exception, they live in agony, not knowing if their loved one is alive or dead, kidnapped, enslaved, or just run away.\n\nEven if you go and pass and then they find out, you'll destroy them. They'll always wonder what they did to make you not tell them. And on top of that, it's way harder to cope with a sudden death out of the blue than one you knew was coming.\n\nIf you love your parents, you'll let them know, even if you're unwilling to change your eventual plans. Not telling them is just needlessly cruel.\n\nAbsolutely YTA.", "Wow, that's so sad for you. I hope that the time you have left will be amazing. NTA, it must be so difficult and emotional for you. But my advice is to tell them and explain that it's very difficult for you to do so. Explain what you want from them. Your last times can be very happy if they know. Keeping it from them will only cause problems and resentment.", "Yeah YTA\n\nYour family deserves to know now so they can prepare themselves.\n\nImagine how they'll feel when they're thinking you're just failing at life, turning into a bum, but oh no it was actually a terminal illness you never told us abkut...", "NTA, who would want to spend last year of life with being watched with sorrow in on the eyes of beloved ones? This one is up to you.", "Absolutely NTA. How you want to spend your final time is up to you and I totally get your point about not wanting to see everyone sad. Is do the exact same thing. You're not selfish, I'd say quite the opposite, you're sparing your family as well as yourself.\nMaybe you and your sister can tell your other sibling, so your sister had someone other than you to talk to about it.\n\nI wish you all the best ❤️", "I don't know how anyone could call you TA in this situation. It seems to me as though you're still in shock and still processing it, so I totally respect that you don't want all that distress while you're still figuring things out. \n\nIt will become obvious in time, though. And if you still haven't said anything, your parents may be upset that they could have planned things and gone places with you while you were quite well. \n\nIt's impossible to say, but I'd tell your sister that you need two or three weeks to process this before you make the next move, and you'd be grateful if she could support you with that. Things may become clearer from a medical point of view by then.", "NTA. This is a process and you got enough to worry about without having to deal with other people acting sad. You should tell your parents but in your own time.", "YTA and this is WAY about Reddits paygrade. Your already concerning them by suddenly dropping everything and moving back in without giving them an explanation. Plus you told your sister, who will now have to lie for you. And on top of that they will find out anyway. After your death they are going to see that you were ill for a year and didn't tell them.\n\nI really don't want to have to say YTA but I think you need to see a therapist or something before making brash decisions and putting all this stress on your family and especially your sister.", "YTA", "You are not an ah, you are grieving, and it is not unreasonable to want your time left to be peaceful. I feel I should mention that the longer you wait to say anything might be harder on your parents, but it is still your decision and your sister has no place to be making demands or forcing you to do anything.", "Very kind and gentle YTA. You do not know what your last days will be like and what kind of help you might need. Your family also needs the time to adjust to this news. Together, you need to make a plan so they know what you would like to happen. You also need to be realistic about possible pain issues, feeding issues, etc that can come up in final days. Talk to them. Tell them you want to focus on happiness. Listen to them and their concerns. Of course they will be devastated but this is a journey you will all be taking together. It is only fair to let them know where it’s going.", "NTA I have experience from this from the other side. My dad had terminal cancer and he didn't tell us. He wanted to spend as much time as possible without us knowing. He didn't want to spend time with us mourning, he wanted to spend it with us living. Did I wish he told us? Yes. Do I blame him or judge him for his choice? No.\n\nThis is your time. Do what you want. Ignore people calling you \"selfish\". Hell, if there is a time to be selfish, it's now. Live how you want to live, enjoy what you want to. Spend as much time with the people you love. Take pictures and leave behind sweet notes for them. Little gifts to make them think about the good times. Most importantly take your time to just enjoy.", "Firstly, I am so sorry for what you are going through. I can't even imagine what that feels like and I am not going to pretend I relate, because I can't. \n\nBut I think if you tell your family, they would have more time to prepare and be able to do more research on your condition to help you remain as comfortable as possible. I can only say that if my loved one was sick, I would wanna know ASAP so I could support them fully. I would also probably be very upset if they didn't tell me until the end. I can't imagine how difficult of a conversation that would be to have, though. I wish you strength during this time", "I'm going to say NAH because you are dealing with something no one at 23 should have to deal with. You need to tell at least your parents. Right now you need support and if indeed it comes to it, you may need care from those around you. You cannot go through this without help. If you didn't want to tell everyone that is your choice, but your immediate family should be told because they need to be able to deal with this. All of you will be grieving. Right now I think you are a bit shell-shocked, and perhaps a bit in denial, but you need the support of your family more than you've ever needed before so don't delay.", "There’s multiple layers to this. \n\nYou’re NTA for not wanting to spend the rest of your time dealing with people’s grief. You have a right to make this time about you and your needs. Go LIVE your life! Hang out with friends and family, travel, take the big risks you were too afraid too! Have fun!!\n\nThat being said, you ATH if you expect your family to support and care for you during this time without telling them why (to them you’re just a lazy kid who quit a good job to mooch off of them). Your sister is right. Eventually you won’t be able to hide it anymore and it will devastate them, and any unkind words spoken will haunt them. \n\nSo make your choice. Either keep your secret and find a way to support yourself and hire a caregiver to help you as your illness progresses, or tell your parents if you expect to continue living at home and have them care for you.\n\nIf you do decide to keep your secret, be kind enough to create a video (first thing we forget is the sound of a loved ones voice, so videos are great gifts), or write a letter to your parents explaining the reason why. They’ll be devastated, and they’ll carry that pain with them for the rest of their lives. They’ll blame themselves thinking they did something wrong and that’s why you never told them. So be kind, and explain somehow why you kept it a secret.\n\nAlso, you’re clearly struggling (as expected). Talk to a therapist. There’s a lot for you to process too. And if you haven’t yet, get a 2nd opinion. Always get a 2nd opinion when it comes to terminal diagnosis.", "NTA because heaven knows how hard this must be for you. Possibly not practical, though, there surely can only be so long you can say you don't want to talk about it before your parents get so worried they start getting really, really pressing with the questions, or they tell your sister they're so worried she cracks and tells them. I wish you the least pain and the most peace possible, I'm so sad for you, but I have lost far too many people far too young to things like cancer and I'd honestly be super tempted to take the same route as you.", "Your family can't force you to do any procedures. Tell them if they do you will book a ticket to Switzerland that day and they'll never get to see you again. \nBut you do need to tell them. \nI'm not going to vote as I think you are processing but if you don't tell your sister will and that will cause unnecessary drama that you don't need.", "I’m so sorry and love you for trying to spare everyone this sadness BUT you can’t. \n\nIn fact, it may cause some strong hurt. \n\nWill there really be true happiness with you holding this back from them? In fact, quitting your job and moving home will cause them concern? Maybe even some bad feelings about what May appear as you not working and mooching off of them. \n\nYou got such a raw deal in life and deserve so may Years of happiness but instead I think what you should be hoping for is a year of gratitude. \n\nYour family will grieve you regardless, but by telling them, they can spend this time being grateful they still have you and showering with love and affection (although grief will be in there too) while you are still well enough to enjoy more things with them. \n\nI loved my father dearly but I’m so happy I had time while he was sick to take every opportunity to show and tell him Everything I wanted to before he was gone or too sick to hear me. \n\nTrust me, telling them will be the best gift you can give your family", "Wow, yeah, you're grieving and I get that but they deserve to know?\nStill, it's your life and the wounds you'll leave behind. No judgements here.", "I'm gonna go with YTA(kind of begrudgingly) I think it is quite selfish to deny your family the knowledge that you are likely to die soon, you are gonna leave them with so many regrets and even more sadness not telling them than if you did tell them. Please give your family a chance to spend time with you knowing it could be the last time they see you", "I don't plan for them to care for me once I'm no longer capable of doing so.\n\nI plan on going to Switzerland where I'll be able to leave this world on my own terms once I start getting some of the severe symptoms", "I really don't think she's an asshole for being terminally ill and not knowing how to deal with it. You said that three times. Have a bit of heart", "This. By not telling them, they may squander the little time they have left with you and be wracked with guilt afterwards. Tell them what's going on, and what your wishes are so they can be mentally prepared for this. Same with your friends.", "This is so right on.  OP, I'm so sorry you have just a year left.  Let that year be as clear and honest as you can make it.  Lying by omission here is still lying.", "Unfortunately they can if OP is deemed 'unable to make their own decisions'.", "So what’s going to happen to your body? You are just going to die and they won’t know where you went? Or you going to tell them when it’s bad and be like “ohh I’m sick because I’m dying and btw I book a flight to Switzerland so I can die there on my own terms. Hopefully you have the money to fly my body back or ships my ashes to you. Or maybe you all can travel once I’m dead and burry me there. Love you and see you never again” because you’ll have to get there before it’s to the point you can’t take care of yourself unless you have $$$ and able to pay people to help you through all this and not involve family at all, but they are going to find out and I’m sorry that is such a crappy way to find out your child is dying or dead. \n\nAlso your sister already knows and even more of a burden for her. She’s now in a shitty spot. You’ll be upset if she says anything or your parents will upset she doesn’t. She’ll either know my sister died upset at me or deal with my parents forever being upset at for as long as I live because I didn’t say anything", "What medical issue do you have?", "There is multiple things going on here.\n\n1. Knowing you are dying is hard to deal with and you don't owe people making your death easier.\n\n2.  Like it or not OP forfeited her right to complete privacy after moving back in with her parents.\n\n3.  Little sis is now inadvertently involved and putting this on her is a monstrous thing to do.  Which is left sitting will screw her up probably for rest of her life.\n\nNow first and foremost she needs to let sister know she is going to tell the family soon.\n\nSecond some end of life consoling is definitely in order.\n\nThird tell she needs to let her family be aware of what's going on, what her wishes are.  And be able to spend time together while she is able.\n\nThe reality she came back home means she is justifiably scared and needs some support to get through this.", "Kinda is…I’d b pissed if one day my sister just kills over n didn’t tell anyone", "I have a heart. Thats why OP is an asshole. Shes not the only one involved here. Her loved ones,  her family, who loves her deserve to know. As someone who has lost loved ones suddnely, its god awful.   \n\n\nAlso if OP was living on her own, and had the money to never rely on her family, then sure, dont tell anyone. She isnt. Shes living with her family and is going to rely on them for her last months when she isnt capable of caring for herself. They deserve to know so they can start planning now, instead of after its already happened.", "If I tell my parents they'll try to convince me not to go to Switzerland and go through a bunch of painful procedures to try to prolong my life just a little bit.\n\nI just can't, I need to be in conrol of how I go. I don't wanna lose my whole identity which is what will happen, I'll basically turn into a  vegetable before I die", "Realistically she isn't going to just keel over. It will come out fairly soon, I'm sure. She's young and in shock. Calling her an AH doesn't help the situation.", "My dad passed away from a terminal illness and didn't inform us he was dying. I would have loved to know sooner so I could have spent more time but that was his decision. \n\nBut it was his choice to live his last moments how he wanted. He was allowed to be \"selfish\" in his last moments. Same as op. They have a terminal illness. Let them spend their time how they want to. Why cater to someone when you don't have much time. They don't want to spend time with their family in mourning. They want to spend it as if nothing is happening. Let them.", "I don't agree with not telling them but if this is your plan- you need to get all your affairs in order so that they don't have anything to worry about. You need to make your will now and state what you want done with your body and then make those financial arrangements for it. If you want your body shipped back to here, you need to make those plans. If you want ashes, make those plans. I get this is a lot but if you aren't telling them, at least make things as easy as possible for them once you are gone.", "You asked, we are answering. YTA here. You are an adult who can fulfill whatever wish you want for end of life. But pretending and hiding this from the people who love you whilst simultaneously using them is messed up. Either keep them totally out of it or don’t. But you can’t do both.", "You can notify your care team and bring your family with you. If you make it clear you don’t want treatment then you can ask your doctor to explain what’s going on to your family, it might be easier on you. Sometimes it can help hearing it from someone else. \n\nI’m sorry, hope your days will be filled with happiness.", "You're looking at around 16k for your Swiss death. Where is this money coming from?", "Please tell your family. They could be your strongest advocates to help you in the end when you are weakest.", "Are you sure it was a good idea to move in with your parents if you don't think they will respect your wishes?", "Wait is it illegal in your country to have a dignified death?  Here in Canada it is called MAID. Why do you need to go to Switzerland? That wouldn't be your only option. Only they have no say as to what you put your body through. Not calling you an a$$hole as you are not really. I will say your parents do have the right to know this about you, at the very least you never know if it is do to something genetically that your sister should know about. Just tell them what you envision the next few months to be like, what YOU want and how you want it.", "She straight up is in this sub asking if she’s an asshole. I think calling her that isn’t necessarily correct but it is the name of the sub. She’s clearly going through a lot and it’s difficult to come to terms with. \n\nBeing terminally ill is awful and it is truly awful that she’s in that situation. It’s understandable that she is in shock and lost but at the same time if she does not want to tell anyone ever, that makes her an asshole (at least based on what’s presented here, doesn’t seem like family is abusive). It’s difficult for everyone and her hiding this, then going off and dying in secrecy is unfair for her and for her family. \n\nYes, she can do as she pleases but from the perspective of someone who’s lost terminally ill family at young ages, it would hurt to know they went through the process alone and without telling anyone. It’s not that her family “deserves” to know but it would certainly make the grieving process easier on everyone else. I don’t want to say it’s selfish of her to do that, because that’s wrong, I just know how I’d feel if a loved one were to do this.", "You said it better than I could. Nothing wrong with wanting to die a certain way, but definitely get everything lined up, especially since they don’t want family’s help at all.", "I was able to create a savings for myself, my parents taught me well.", "I just wanted to spend time with them. I wanted to create memories and be there for my lost moments", "IDK where OP is, but most of the US there's no such thing as death with dignity. Some states have it, but not all.", "I didn't know Canada allowed it as well.\n\nI think I'll look into Canada as an option as it will be much cheaper.\n\nI'll seriously consider telling them I just need some time to get my thoughts in order", "NAH.\n\n\nop, after dealing with a family members terminal illness, i totally get not wanting to tell them. pretending everything is normal/fine/good is very important. \n\n\nbut your sister already knows. you have burdened her with a big secret. shes freaking out and cant talk to anyone about it. \n\nmake a plan to tell your family soon. book a big day with them, something like minigolf or something meaningful for you as a family. bring them all home and have a really nice dinner. tell them at dinner (in the privacy of their home)  \n\n\napologize for keeping it a secret for so long, and explain that you have a plan for end of life care.\n\n\nthank them for such a wonderful day, and assure them that there will be more days like this and that you love them so much.\n\nedit: hugs hugs hugs hugs. i wish the road ahead of you is easy to teavel", "Oregon is a state where you can decide when you go. Death with dignity is what it’s called.", "YTA now that your sister knows. You absolutely cannot leave her with the burden of this secret. She is 17 years old and is now carrying the knowledge that her sibling is going to die, and can't tell anyone about it.\n\nI understand that you want to be private, but this is a time where you need the support of your family. It will be extremely unfair to them to leave them in the dark and confused as you go through this process. It will become evident that you are getting sicker, and in the end they will have to deal with your remains and your effects.\n\nPlease trust your family and let them help you.", "You have to tell them, I understand your side, but your family deserves to know, plus, they can give you some support. I can't even imagine how difficult this moment is for you, but you don't have to carry that burden alone.", "How about this? Tell them. There are MANY reasons to do so,but your sister’s burden should be enough. So tell them but let them know in NO uncertain terms that they will NOT be in charge or a part of your treatment. This way,you’ll only get the treatments you want and,more importantly,when it’s time to go to Switzerland you can just say you’re feeling up for a trip. No doctor will be telling them any differently. \n\nHowever this plays out,I’m really sorry and I hope the time you have left has plenty of highlights. Best of luck.", "I can offer no judgement as this is way too deep and heavy. I wish you the best in your decision and hope your remaining days are filled with joy.", "OP you are NAH for the way you want your life to be. I hope you are able to create many memories with your family. \n\nI would like to suggest writing a letter to your parents, to be delivered after your death. Explain to them what you have written here, and whatever else you may think of. They will need closure and a way to understand.", "This is not about being T A or not. I think you should talk with a therapist so you can deal with all these emotions and come up with a viable end-of-life plan. Idk what kind of cancer you have, although I can guess, and the problem is that when you feel ready to go to Switzerland, your body may not be able to make the trip. It will be obvious to your family that something is wrong. And unexpected death traumatizes loved ones left behind WAY more than expected death.", "YTA\n\nYou are denying your family time to make memories with you in them.\n\nKnowing your time is limited your family could speed up so many things and keep you all happy.\n\nThey won't get the sudden confusion when you start breaking down.\n\nThey won't get the disappointment that you couldn't trust them with this information earlier.\n\nExpress your wishes, let them all know what you want.\n\nALLOW them to be there for you.\n\n(My sister passed a few years ago from cancer and I live interstate, but got a chance to only see her in the hospital at the end. It was good to see her and say our goodbyes, but would have liked to help her knock some bucket items over)", "I get your trying to save them pain but you have to tell them there will be a time your so bad before you go to Switzerland but she will end up tell them, so tell them whats wrong, what's happening,your an adult you can always say you going on trips before you go leave video messages which they can have forever explaining why you made this choice ( this sounds like a film) I get you don't want to be at the point your just watching the world til you go and some treatments with whatever you have can be painful but please let your family love and hug you til your last", "I'm not going to pass judgement on telling your family or not, but what I will say is how do you think the rest of your family will react when they find out that your sister knew and didn't tell them?\n\nIt's not your life that will be affected because I am guessing based on the comments below that won't be an issue anymore. But your sister? She might lose her family too when they find out. \n\nJust something to think on.\n\nWish you all the best.", "OP, I respect your decision even as it may  evolve. I hope to nudge its evolution. Here’s why. \n\nI am a parent. A 23 year old quitting a job and moving in would be welcome, but I would expect her to contribute either money, household support like cooking, or be looking for work or further education. \n\nI would like to think we were close enough to talk. Was she a survivor of trauma recently? Broken personal relationship? Mental or physical illness? \n\nIt would mess me up to know after death that she didn’t trust me to respect her last wishes. \n\nSo please, decide on your wishes. Get them in legal form. Your will; love letter to each beloved; powers of attorney; living will; last wishes. \n\nThen please share with your parents. Let them adjust. They can never be prepared but they can take the shock and self doubt down a notch. \n\nEmphasize normalcy, memories, love. Make a bucket list. Specify who can be told, if anyone. Share your life with those who love you. I send you {{{internet hugs}}}.", "I don’t think you would have been the AH for keeping this from your family if that’s your wish. However, know that your 17 year old sister knows you would be the AH for forcing her to carry your secret and the toll that burden will take on her for the rest of her life. \n\nI recommend talking to a therapist and telling your family. Tell them your plans and what you want for the time you’ll be home with them. Tell them in no uncertain terms what your wishes are and that you’d just like to spend this time with them making happy memories. That it’s your life and this is what you’ve decided. \n\nDo not make your little sister carry the burden for you, and have to deal with the grief, regrets, and “what ifs” for years after you’re gone. She is too young for that burden. Though so are you. I am so sorry and I hope these next few months are filled with happy memories.", "So sorry for your loss of yourself\n\nBut YTA.... It was bad before but I could write it off as you are struggling and  can't comprehend really how much it will effect your family later but now that your sister knows, you are putting that on her FOREVER .and she does have to live with the guilt why didn't she tell your parents? Why didn't she tell anyone? On and on \n\nI'm so sorry make a form plan tell your family stay firm in your plan it's your life but love it openly and without fear and regrets", "I hate to say it to someone who is terminal but YTA. And although it's a time where being selfish is perfectly acceptable...what you plan to do to your family is downright cruel.", "Honey, you can still have happiness,  they need to have chance  to mourn and get to term with it  and so do  you.   But you can still have happiness and now you can have even more,  your mom/ dad  can cook all your favourite food , you can go places you , you can make happy memories with you family, you can give them this.  \nStaying like this, will only make your parents  feel guilt for every time they told you to get a job, they got upset with your \"laziness \" when you are gone.\n\nSo please leave them with happy memories instead.", "YTA.\n\nYou need to be fed, washed, and changed everyday.  Someone needs to do that for you.  And you don't want to prepare them for it?\n\nYou sound selfish.  Or childish, at best.", "NAH.  I understand why you’re hesitant to say anything, but I don’t think that makes you an asshole, at least right now.  You really should tell your family, though, it’s the right thing to do.  Maybe they’d help you work on a bucket list with the time you have left?  \n\nI’m very sorry for what you’re going through.", "NTA - You're not an AH for not wanting to tell your family, but take some time and think it through, they would want to say their goodbyes let alone prepare themselves for what's to come. If you decide to tell them, just make it clear that you want your last few months to be joyful and memorable, not filled with grief. However, it's a bit of an AH-move to ask your sister to keep this secret for you, she is likely freaking out but have no one to talk to.", "Hmm. This is really a hard one but I don't think it's fair to ask your sister to keep such a secret. Sounds like her mental health will suffer from that. \n\nSoft and gentle yta.", "You're very much NTA to be wanting to keep it quiet, but you went about it the wrong way, and I feel you don't have much chance to hide this from them now, especially if you stay. It's too big a secret for your sister, she's probably too young and will need to share it. \n\nThat said, you can still try to leave the way you wanted to, but you'll need help, probably from a therapist, to deal with your family hopes and grief, and keep control of your life and way of death. I wish you all the happy moments possible, and a peaceful passing.", "YTA, because your sister knows. A 17 year old should not be burdened with this secret. She needs support, even if you don’t. This is a massive burden for her to carry now and after you die, and I just think it is an AH move to deprive her of support in this. I hate to call you an AH, but you are only thinking of what will be most comfortable for you, but there is already another person - a minor - deeply emotionally involved that needs significantly more consideration to keep safe and healthy. \n\nIt’s a terrible place to be, but given she knows, she needs to be able to seek support, which means yeah, I do think you need to tell your family. She shouldn’t carry this burden alone.", "I'm going for a very, very soft YTA here.\n\nI can't imagine how you're feeling right now. I'm so, so sorry for everything you're going through and for everything you're going to face.\n\nI understand that you want to spare your family the horror. But as a parent myself, I would rather know I have limited time with my child left rather than watch them waste away without knowing what was happening. I also saw that you're planning a trip to Switzerland, and I understand that you want at least a little control over how your story will end. But who will break the news to your family that not only have you died but they have to ship your body back overseas as well? (Assuming you live in the States)\n\nIf it were my child, I would want to know. I would want to provide love and support until the end. I would assume your family would too.\n\nIt'll be hard. It'll be emotional and messy. But maybe it would making losing you a little less painful, and it might give you some peace as well.\n\nI'm so sorry, OP. I hope you find some peace before your time comes, and I hope you won't be alone when it does.", "Honestly, soft YTA. It's hard and I can understand both sides. But, the best thing to do would be to tell them now, rather than blindsiding them with your sudden passing (though I imagine it would get more obvious later on since cancer ruins your body inside and out). \n\nIt also gives you more support instead of suffering on your own. Plus your sister would be wracked with immense guilt keeping it a secret now that she knows. It will make them sad, but it will be even worse if you keep it to yourself\n\nETA: I would've said N-a-h if the sister didn't find out.", "Holy shit 23 you're still just a baby I can't imagine but YTA the people who love you need to know keeping something like this a secret will eat you up near the end just try to live life with them experiencing things you would never normally do have fun use your money you can't take it with you when you go.", "YTA OP if you push through with this because even if you have good intentions, you basically will be blindsiding the people that you love. They will be sad when you do pass away, and they have the right to feel that.", "YTA You don't need to tell a lot of people. You need to tell your parents. You're making it sound like you'll be well until it's time to do. There is a period of decline. It's going to be extremely hard on your parents. They need time to process and deal with it. They need to be a part of the conversation about what you want. To be there for you, they need to know what's going on. I think you're in a bit of denial about it and telling people makes it more real.", "YTA (I really don't think you're a total AH, but this is the correct judgment in this situation)- You have to tell them now.  Your sister already knows now, you can't expect her to keep your impending death a secret.  You'll just be making that year one of the most painful ones she'll have to live through because she's losing you, and she can't even talk about it.  Not just that, but I'd assume in the next few months, you will probably begin to visibly deteriorate.  At that point, they're all gonna figure out something is really wrong.  I think if you tell them now, they can spend their last year with you and say and do everything they need to before it's too late.  I know you don't want to hurt your family, but making your sister suffer in silence and taking them by surprise when you start to deteriorate will make everything so much more painful than telling them now...\n\nAnd I'm so sorry you're even in this situation OP, I wish you the best year you have left <3", "In the comments I see you said you’re taking a moment to gather yourself, so NTA.\n\nYou need to tell your family before you leave for your end-of-life assistance. Your health might suddenly and surprisingly decline, and they need to be prepared. \n\nTell your sister you need 2-3 weeks to think, and you’ll share. In the meantime, get a medical POA, a DNR, and a will notarized. PLEASE GET THE MEDICAL POA. Otherwise your PARENTS will decide your medical care if you’re unable to speak for yourself. That is NOT what you want. Pick someone you can trust who will fight for your wants tooth and nail.\n\nI believe some US states also offer dignified death, so see if you can stay home. \n\nYour doctor almost certainly had end-of-life resources and pamphlets, and can put you in contact with hospice services to help you with telling your family.\n\nI’m so sorry OP. This is a heavy burden for you.", "I won’t say yta- just because it’s a too painful situation and you might have chosen this path out of self protection and love. But I won’t say NTA either. You clearly appreciate your families  love, since you moved in with them. \n\nBut; How can your parents and sister create loving memories if they are left with nothing but questions. How can you sister remember you, if the last months she spend with you, are filled with lying to your parents. \n\nAltough it will be hard, please consider informing the people you love. Let them be involved in making the most of memories. If you don’t want any treatment, tell them. They might not agree, but it’s easier to end a discussion by saying it’s my choice- than just not have this discussion at all.", "INFO: when do you intend to tell them? Please tell me you're not going to just let them find out the hard way after the fact. That would be cruel.", "NAH but you are being selfish. Your parents brought you into this world, raised you, and love you (at least I assume so since you haven't started otherwise). You moved into their home with no explanation, and will get sick which will worry them. Then they will be \"surprised\" when you eventually tell them or die, leaving them with a mess of conflicted emotions to deal with. I get that this is your illness, but like any illness it does affect everyone around you. You are robbing them of time with you. You want to create memories with them, but how will they know to appreciate the time they have left if they don't know? \n\nLet's say for example you decide you want to do a family trip, but they don't prioritize it because they have lives and other things going on. Are you going to be angry that they don't come? Will they be dealing with massive guilt that they didn't because they didn't know?\n\nOn top of that, I think you're naive about the level of care and assistance you'll need from them. My best friend/cousin has been diagnosed with stage 4 brain cancer last year, which gives her 2-5 years to live. She started with surgery, which she was in the hospital for a week for. Her memory and cognitive function took a while to come back and even now it's not 100%. Her husband had to take notes at all her appointments to keep track of what was going on, and she wasn't allowed to be alone for 3 weeks. She then had 6 weeks of daily radiation, and due to losing her license (seizures) she had 3 people on a rotating schedule driving her. Since then she is now able to drive and is doing chemo through a pill at home so she is more self sufficient, but the amount of emotional support she recieves is immeasurable. Her treatments ended up moving her to 5 years of life instead of two, and she is about to leave on a month long trip with her husband. \n\nYou're excuse of your parents making you do anything is BS. You have final say on your care, they can't make you do anything. And it will be worse for you if you wait until later to tell them, because then they will be acting more desperate, hurt, and unreasonable. \n\nYour sister will not keep this a secret anyways. No sane person would keep that promise, especially because she will be the one dealing with the aftermath. May as well take control of the situation and tell them yourself. It will go way worse if you don't.\n\nI get that you are probably fairly early into your diagnosis, which is why you are scared to tell anyone. But trust me, you need your village more than ever. It is scary as hell, but after the initial shock wears off, I promise you will be so happy you did. Those last moments will be very lonely without your loved ones. \n\n\nWish you all the best, I hope to see a positive update soon.", "Well, you ahbe to wll them. Especially if you will be living and their home and they will.inevitably.be taking care of you. They need to prepare practically, emotionally, financially. \nAlso, have you had a second opinion? Any chance at treatment? Best of luck.", "If any of this is true then you might want to start communicating while you still have the ability.", "AH is too strong for this.  and i understand you don't want them to be maudlin, but they love you, they deserve to know. Think how horrible it will be for them to see you deteriorate and not 'know' - they'll know. or if it is sudden to lose you without warning.\n\nyes it sucks. but tell them and let them make the memories that will help them when you are gone.", "And that’s entirely fair enough, but leaving them with this emotional hand grenade - and especially pulling out the trigger and then leaving your kid sister holding the thing - is unutterably cruel. \n\nYou need to communicate with them. By all means set whatever ground rules you need to; telling them and then taking yourself off for a stay somewhere might be an option, but now that your sister knows and you know, it’s time to have the conversation.", "So you're just going to dump the trauma of losing a child, sister, friend and family member on them all with no explanation? With no chance for them to mentally pepare for it? \n\nThey are already worried about you, if my sibling - who seemingly had it all lined out and going for them - suddenly threw their life away and moved back home with no plans for the future, I would be extremely concerned. Imagine them then just going away and die with no warning? \n\nI'd be shocked, distraught, I'd hate myself for not having been able to be there for them. I'd regret the ultimate frustration of not being able to help them. \n\nDo you not realise how absolutely twisted that is? \n\nI'm not going to say Y-T-A, but you really need to think this over a few times, and talk to someone about it.", "It's understandable that you'd feel the way you do at your age. But you're signing your parents up for an incredible heartbreak. I'm pregnant with my first child right now, a boy, and I would be utterly broken if someday my child were to go through something like this and I couldn't hold and comfort him in his final days. I would feel like I failed as a parent. I would spend my days wondering why he couldn't trust me to be there for him. I would constantly wonder what it was like for you to hide the emotional and physical pain. I would hate myself for not seeing the signs. It would be *hugely* traumatic. Is this what you want them to experience?\n\nTo your family, this is going to be as abrupt and devastating as if you committed suicide. (I mean, yes, that's basically what you're doing but physician-assisted suicide is considered by most to be in a separate moral category). Events like this often break families apart - think divorce, depression, substance abuse, etc. Giving them the chance to go through this with you would be an act of kindness.\n\nI get that you're concerned about how your family will react, but there are other solutions for that. You could invite them to a session with a family therapist. You could write them a long letter explaining how you want them to treat you over the next year. You could enilist your sister as an ally in making sure your parents aren't going to be \"too much\". The path you're choosing now might be easier right now, but I would urge you to think about the rubble you leave behind, and whether you want their memories of you to be forever shaded in pain.", "Please, don't make your family think you went missing.  That is so much worse than them knowing you're dying.  Do you really want them to spend the next several years looking for you and wondering if you were kidnapped?  I'm not saying you can't pick to pass away in Switzerland, but don't disappear on your family and create years of turmoil and an unsolved cold case with your name on it.", "You know it costs thousands of dollars to do that, not including travel costs, right?", "I’m sorry for what you are going through. But as someone who took care of a loved one until the day they died, knowing my loved one was dying was hard but I valued the time I had left with them. It allowed us to have more meaningful conversations, to make sure we did the activities we wanted to do together before they died, and to say goodbye. I was also their advocate and made sure they got to accomplish as much as they wanted to do as possible before they passed.\n\nI know you want to keep it positive but you are doing your family a disservice by not letting them be there for you. Please reconsider. I’m just going to say NAH.", "She's TA mainly bc she still intends to keep it a secret AFTER her sister already found out. Do you know how much guilt she'll have keeping quiet. Plus if the parents find out she knew the whole time? Damn the depression and suicidal ideation will be rough", "Oh damn I hadn't thought of that. Damn. They still need to share with their parents.", "I have cancer", "I agree with you there I shouldn't make my sister have to keep this from everyone.\n\nI'll eventually tell everyone I just need some time", "So you’re just going to blindside them and leave them picking up the shattered pieces in your wake. Yikes. That’s cruel.", "Get this co-signed by a lawyer (?) with someone you trust as power of attorney, and explicitly state your wishes. \n\nYour time doesn’t have to end sadly, but it is more likely to if you don’t tell your parents. Your sister will most likely not be able to keep your secret. \n\nNo judgement, I hope your family dynamic is peaceful and you have the end you wish for.", "But you don't KNOW that because THEY don't know. I have zero idea of what you're going through, but hiding it and hoping for the best is not the way to do this.\n\nTell them your plans and that you are firm on this.", "You need to create a living will. Clearly spell out the terms of how you want to die, including a DNR (do not resuscitate), your last wishes, medical and financial POA. These are legal documents that clearly state what you do and don't want. But you need to tell your parents.", "Put a healthcare power of attorney in place designating someone you trust to carry out your wishes (a good friend if not family).  Then tell them.  This is not something you should keep from them and they will spend your last months hating you if you do.", "Jimmy Carter was cured of cancer a few years back.", "Understandable. This is a rough situation, especially for you. Good luck and I hope you get as much support as possible. This is the perfect time to make new memories", "In addition to all of this, talk to your doctor. Tell them about your wishes and plans, and then have them talk to your family with you. This is the doctor's territory. Your parents will have questions you won't have answers to. Plus it could be easier to tell just the two of them, or since sis already knows maybe you, mom, dad, and sis can go to the Drs together and break the news with them that way. \n\nIt's going to be hard. You're going through a lot. If you've moved back in with them though, that shows me that you care about them at least enough to give them some kind of warning. You can tell the doctor's that you want your home life to remain as normal as possible for the time being, both for you and for all of them - but that you haven't been able to figure out how to tell them, and maybe the Dr can say it for you, and maybe just like how I just phrased it. Hope that helps, even a little bit.\n\nIf one of my siblings or parents or a future child of mine were dieing soon and I had a warning of some kind, even if there were nothing I could do to prolong their life, I'd want to know, just so I could be there for them if they ever needed a hug about it. I know I'd just want to hold them close for a good long while at least once again before they were gone forever.", "Oregon too has legal medically assisted death with dignity.", "Doesn't Oregon have this too?", "I have brain cancer, the type I have is unoperable and fast acting and aggressive.\n\nJust the five year survival rate is very low. \n\nI don't believe I'll survive this", "Cancer is a group of multiple diseases. Some cancers are worse than others and we don't know what cancer OP have. \n\nSome cancers have an incredible high mortality rate despite treatment. Some don't. It's not black and white.", "Don't try to tell OP something they know isn't gonna happen for them.", "Canada has it but you have to be Canadian. \n[source](https://www.canada.ca/en/health-canada/services/medical-assistance-dying.html#a2)\n\nIn order to be eligible for medical assistance in dying, you must meet all of the following criteria. You must:\n\nbe eligible for health services funded by the federal government, or a province or territory (or during the applicable minimum period of residence or waiting period for eligibility)\n\ngenerally, visitors to Canada are not eligible for medical assistance in dying\n\nbe at least 18 years old and mentally competent. This means being capable of making health care decisions for yourself.\n\nhave a grievous and irremediable medical condition\n\nmake a voluntary request for MAID that is not the result of outside pressure or influence\n\ngive informed consent to receive MAID", "It’s allowed in a number of US states as well: California, Colorado, the District of Columbia, Hawaii, Maine, New Jersey, New Mexico, Oregon, Vermont, and Washington.", "Canadian here, you won't be accepted for MAID as you aren't a citizen. Even if you were, a doctor and a board need to sign off on the decision, it might take longer than a year. Not sure how quick it is in Switzerland though.\n\nYou should still tell your family what's happening with your illness. You aren't doing them any favors by hiding this and springing it on them later. Wouldn't you want to know if it was one of your parents or sister that was sick? Can you really say you'd be happy with their decision to keep it a secret just so they can make happy memories and disregard the feelings of people around them? Most people would feel blindsided and angry on top of the grief that comes later.", "GBM? So sorry. Look into Oregon's dying with dignity act. Seems a lot easier than going to Europe. You don't have to go through procedures, and yes till get good symptom control. Please get referral to palliative care and discuss with hospice if you truly are in such an advanced stage. Good luck", "I don’t want to call you an asshole but you’re being selfish which I understand now it won’t just be you keeping it quiet, you’re expecting your younger sister to keep this secret as well, which means you’re expecting her to grieve and try to handle the emotions of this by herself. You also plan on going to Switzerland to die, do you expect your sister to never tell your parents? To let your parents think you just disappeared, we’re kidnapped? Are you okay with letting them think the worst for the rest of your life and letting your sister live with that guilt? This kind of secret will eventually kill your sister. Even if you wrote a note to be delivered after you pass. lightly YTA for these reasons. This is just selfish and cruel, especially to your teenage sister.", "Sorry but YTA - you put a huge stress burden on your teenaged sister; that’s unfair. Speak to her and ask her help with telling your parents about your illness, they deserve to know. They can help you put your affairs in order, plan your dream trip, help you make your final year about you. It’s going to be traumatic anyway you slice it but you don’t have to do it alone. Keep us posted", "Considering the situation, I don't think I can call you an asshole over this, but you are on the wrong side of the argument. And if you don't tell them soon, there are high odds they will say things that they will regret for the rest of their lives. Furthermore, in sure you love your family, and telling them now can help them long term.", "Nta, but for the sake of your sister who is still a child, please tell them, even if you have to take a few days to prepare for it.\nIt is not fair for you at all, but it's not fair for her either now that she knows. She will spend the rest of her life wondering if she's spoken up sooner if she could have saved you, and it could cause serious issues with your family when they find out she knew and didn't tell you.\nAnd I really believe that you would feel better if you weren't trying to keep this to yourself. Yes you will feel like you have to be the strong one and support them sometimes, but really that's what you're trying to be now by not telling them.  \nIf you truly only have a year, get every moment you can from it.  Have a celebration of life with your friends and family while you celebrate with them, go on a major trip and blow through your savings, but don't pretend everything is okay when it is absolutely not.  \nI'm so, so sorry you have to go through this.  I wish there was a magical solution for you.", "I'm also 23F and I am so sorry you're going through this. I really empathize with wanting to go out on your own terms and not wanting to go through painful medical procedures that won't give you that much time. That's totally valid and your choice.\n\nHOWEVER\n\nNot telling them is not the answer here. You live with them in their house. You will do so much damage by continuing to lie to them.\n\nYour sister already kind of knows. You need to break the news to them and tell them your plans. They're all you have and not telling them is cruel and traumatizing.\n\nIf your health takes a downturn suddenly, they will be the ones taking care of you. I know you don't want to be taken care of by your family, but that's how things have turned out. You have the opportunity to make things right before you go - not everyone gets that luxury.\n\nAgain, I'm so sorry you're going through this but YTA here. Please tell your family.", "I won’t say YTA, but you need to tell them. Terminal illness doesn’t simply impact you. The people who watch you go through it need to have the time to process everything. They need to get your affairs in order and ensure you’re taken care of in an appropriate way. They go through the seven stages of grief too.\n\nI understand not wanting to be treated differently and not having your last days weighed down by your illness, but your family will never be able to truly accept this without knowing. It will be sudden and scary and confusing. That’s simply unfair.\n\nPlease, reconsider informing them. They’re your family, they love you, you love them, and they deserve to know.", "Your not an AH. But this isn’t the way to handle this situation with your family.. and also my mother was given a year to live and it’s been 8 years and she is still here. She has had stage 4 small cell carcinoma in her lungs and brain. Sometimes the prognosis can change.", "I’m can’t judge this in good conscience because I truly can’t imagine the pain you’re in. I’m so sorry. But honey, as someone who has lost someone without any warning, please tell them. Let them have time to take pictures with you. To form memories. We are all going, we will hurt the people we love when we go, but it is much easier to bear when you have a chance to hug them and tell them what they meant to you.", "I’m not going to pass judgment.\n\nHowever, you need to sit down with your doctor and fill out a do not resuscitate order. Sign it, have him or her sign it. Make multiple copies and be sure you always have one on your person in the event something goes sideways and emergency services are called for you. Someone may initiate resuscitation but that piece of paper is the trick to get it to stop. Make sure you have someone you trust - a friend, maybe, who can perhaps help take some of the emotional load off of you.", "Light NTA\n\nThe only reason I say light is because you live with your parents. They should probably know what’s going on so they can prepare for whatever happens in their own home. \n\nBesides that though its completely up to you on who and how you want to share that information. It’s your body, your life, you’re the one with the terminal illness not them. All the other shit people are talking about family and honesty is just projection. \n\nYou go out however you want to go just make sure it isn’t a non-emotional burden for others.", "We were given a sudden diagnosis that my husband had a fatal condition last May.  We did the normal and got other opinions, unfortunately they all agreed.  I lost him in November.  But those six months allowed me to process and be as ready for the inevitable as possible.  And we were able to talk about many important things, share memories of our best and worst times together and notify far-flung friends and family so they could talk or visit one last time.  \n\nTell your family, otherwise YTA.", "NTA, your diagnosis your decision. \n\nHowever, think of a clear way to tell them and outline your wishes and how you want things to go when the time gets close. This way, nobody is in disagreement about your wishes as they've been explicitly stated (and I would add write it all down and file it with a lawyer in case your giving anything to anyone).\n\nMay you enjoy the rest of the journey and make the most of the time you have left.", "I have health anxiety and constantly worry about what you are currently dealing with. I have always told myself I would do what you are doing. \n\nBut... they are going to have to deal with it no matter what. It is the kind thing to do to prepare them for the inevitable. They will live past you and will live with your passing.", "I know you're doing this to spare family and friends, as much as you can. Write letters to them that they can read and cherish later. Get your prep work done and once everything's settled, then tell them and let them grieve with you. My husband died very suddenly and I would give the world for one last hug. Don't deny your family this. \n\nI don't know if you're in the states, but Washington has a Death With Dignity law that you can take advantage of if you are.\n\nI wish you peace, love and strength as you navigate this. NTA", "Obviously this is so much to process and I completely understand- that I simply CANNOT understand all the complex emotions you must be feeling. Honestly this is way beyond the pay-grade of reddit but I wholly know this: NAH.\n\nI hope you can find some really good support- through counseling, religious support, family/friends whatever that looks like for you to be able to work through all your thoughts and feelings. You are very sweet for the idea of not wanting to burden others, but we are all here on Earth, to carry each others if we allow it. Allow your loved ones the choice to grieve with you.", "YTA.", "It's your life. Live it however you want. Nta.", "Jeez  \nYou're not an AH but damn, I feel like you're only thinking about yourself currently.", "I don’t want to call you an AH because I understand where you are coming from. But try and see it from the other side. You are going to leave your family without any closure and they will feel angry, resentful and hurt on how you acted. If they are good to you do you want them to have those feelings?\n\nI had a family member recently pass and while I knew what was happening she refused to talk about it and refused any visitors for us to say goodbye. I can tell you it was very hard to accept and there were hurt feelings. While I understand her to need to control the outcome and not wanting to compromise on anything there were people that love her and wanted to have closure because it was also difficult for us to lose someone. Only her very close friends and family knew of the illness when others found out they were saddened and shocked. \n\nMy mother was similar. I think the person dying wants to control what time they have left and I completely get that but sometimes it goes to the extreme. I once told my mom she is dying and her and has a right to her dignity and her wishes but others love her and she will be gone. We (the living) will be left with having to grieve and picking up the pieces after she is gone so there needs to be some kind of compromise so both sides get their needs met. \n\nFinally, if your sister found out and you are asking her to keep it from family please don’t do that. You are putting a huge burden on her that may destroy her mental state. When the family finds out that she knew and did not tell anyone their will most likely be blowback. She will be the easy scapegoat to get angry at because you are no longer there and/or you can’t get mad at someone for dying. \n\nI urge you to tell your family. You are going to need them emotionally and unless they were awful to you do you really want to leave a legacy of looking like you are selfish and hurting them unnecessarily.", "YTA - clearly you’re upset abt this but at least give them the opportunity to plan…", "You may not be the asshole, but since you are living with them, you are being inconsiderate. Yes, you are the one dying.  And your feelings are valid.  But so too will their feelings be.  You have not mentioned what disease this is, nor are you obligated to do so for us strangers on the internet.  But the people you live with need to know.   Not so they can become your caregivers, but honestly so they too can know what to tell medical personnel or to do when your symptoms get worse.  As for the plans about going to other states/countries for end of life support:   they generally have residence requirement for those things.  You need to look now because it is not something you can just go “surprise.  I’m here give me the dying pill” right at the last moment.", "I am so sorry. But YTA. I've worked in hospice and if your family is in your life and supporting you, blindsiding them with your death by not warning them is unspeakably selfish. I know you're scared and angry and overwhelmed, but they're the ones who have to deal with your funeral after you're gone. Think this through. Tell them.", "NAH. Contact your local hospice. Ask to speak with a social worker. Tell them your concerns about telling your family. They’ll help you.", "Gentle YTA. You’re avoiding the painful emotions of end of life but only temporarily and only for yourself. Terminal illness is a grief journey, shock, denial, anger, sadness, acceptance, it’s all part of it. You clearly have the sort of loving family that will let you give up a job and move home with minimal fuss. They’re on that journey too but they don’t know it. It’s the worst thing in the world to lose a child. They will feel intense pain, anguish, yes, but there will also be a journey together, caring for their child, treasuring time, making memories, deepening bonds.\n\nYou say you’re going to Switzerland, it’s roughly $10,000 for Dignitas to take over family duties of funeral, medical and fees. Flights, meals, and accommodation not included. And beyond cost how will you time that right? Explain it? How will it work for your parents to think their child is off on a fun holiday only to get the news they are dead and buried. And deliberately rejected them and went off alone as a final act. How will that be better? \n\nYou do have control, you need to be strong and say ‘this is my medical plan, it’s not up for discussion, I want to enjoy the time I have left, not suffer throughout to get a couple of extra weeks. This is final.’ You can do this with your doctor supporting you, a palliative care nurse, a therapist, whoever you can draw strength from who will back you 100%. And you can do it on your own time. Maybe talk with your sister and figure out the best time/way to have that conversation. Make that bucket list and a plan for it, you’re in control. But your family are riding the same ride blindfolded, it would be kind to give them a chance to prepare themselves and savoir every second they have with you.", "Going with NTA. To start, I am a parent of a family member with a chronic life threatening condition.  What your sister did was evil in the guise of caring and is understandable but wrong.  With this said, the cat is out of the bag.  Your sister will squeal at the first sign of trouble.  Once you have time to think and come to terms with the diagnosis, you need to tell your parents. This is to take back as much power you have which allows you to direct the narrative.  You should have had full choice over this but that is gone now.  \n\nAlso, I spent months at the hospital in support of the family member.  We had what if conversations so I knew how to be supportive. Your parents can't support you unless they know your wishes even though they may not agree. \n\nThere are many good suggestions in this post.  Take them and tell your parents when ready but don't wait too long.  I am sorry to see what you are going through.  As Mike Tyson once said, \"everyone has a plan until they get hit in the face (paraphrasing).  This means you might have a different thought about people knowing once the next big event happens and support will help you get through it the way you want or at least have the possibility of doing so.", "This isn’t really an AH situation so much as it’s just a truly tragic and tough time for all involved and I really can’t judge if you’re T A or not because of that. \n\nI understand from a few of your comments that you just need time before you tell them. Take the time you need, however, as someone who recently (and unexpectedly) lost someone near and dear to aggressive cancer, please do try to tell them sooner rather than later. If not for your sake, then for your sister (and the rest of your family)’s sake. Our biggest regret is that we couldn’t spend more time with our dearly departed loved one before they passed and, while most of us are in therapy and trying to cope with the grief, right now (while it’s still really fresh), it seems almost impossible to ever imagine living without the guilt of “we should have spent more time together” (even though none of us even knew) - and we don’t even know for sure that our loved one knew themselves or not. \n\nPlease take care of yourself, however, please also give your family the gift of building life long memories for them to cherish and give them the opportunity to shower you with love and support.  \n\nYour sister also deserves the opportunity to receive support - this is a big burden for a 17yo to carry alone. \n\nIf you can, see if there’s a therapist who deals with these kinds of things who you could speak too - possibly your family could also speak to them too.\n\nSending you much love and support in this trying time", "YTA. So youre just gonna die? Thats fucked up.", "Soft soft yta. Your parents should know, mostly because now your sister holds this burden. Eventually they will find out maybe after you pass that she knew all along and she could end up feeling incredibly guilty", "Yes and no only because you’re living with family but you have the choice of telling whoever you want it’s your illness and health but there might be some benefits to telling them and no one else!! Not everyone has to know even though no one has the right to know. I hope this helps you some way or another but whatever choice you make like it or not, if your parents truly love you then they will respect your decision and privacy", "YTA for putting this emotional burden on your teenage sister.", "Going with a very soft YTA here.\n\nAs a mother, it would KILL me to find out my child had hidden something like this from me. I would spend the rest of my life wondering what I did wrong to make my child hide it. And I think it would make all the much harder to come to terms with that eventual, tragic loss. \n\nPlease consider telling your family, OP.  Yes, there will be a tinge of sadness to the time they spend with you, but they're going to savor those moments all the more.", "you can't make your 17 year old sister live with the burden of knowing her sister will die soon and not being allowed to tell anyone without betraying your trust. \n\nYou're absolutely entitled to take your time and tell them on your terms, but please don't make your sister carry this alone. It will affect her for the rest of her life.", "I'm sorry but your last moments are not going to be filled with happiness if you don't tell them. They're going to be crawling up your ass for months wondering why their kid suddenly quit an internship to live at home. They're going to think you're a failure to launch and you won't hear the end of it.\n\nMake a plan to tell them and explain how you want this last year to go, with examples. Tell them you want to see the ocean, see the northern lights, eat from a Mexican food truck, whatever it is your little heart desires.\n\nAlso, if you don't, once your sister sees your parents flipping out, she's going to crack and tell them. \n\nNAH\n\nI'm sorry this is happening to you. I hope you find the peace you're looking for.", "NAH.", "I'm not going to judge here. Obviously, it's up to you when you tell them, but the sooner that is, the more time they have to adjust they will notice in time", "I refuse to give judgement here. I get where you're coming from, but I can also understand your sister's point of view. This is so far above Reddit's paygrade it's not even funny. I'm so sorry you're going through this and I hope your last moments are filled with peace.", "You're definitely NTA, but not telling is a little shitty... I understand you need some time to deal with all this. But you should tell them, otherwise they'll probably feel guilty the same way your sister is already feeling. They'll probably try to change your mind, but at least you'll know you tried your best, and you'll have some sort of closure...", "NTA because I understand what you mean. But this time they need to be there for YOU. Yes they will be so very sad and thats okay. You need love and support and to give them a chance to come to terms. Think about this, even if you successfully keep this from them until the very end do you really want them to find you passed with no idea why? Im so very sorry you even have to go through this and I wish you the best.", "OMG, YTA. Your family’s pain will be so much worse if you keep this from them. Sure, you’ll have to console them at first but they’ll adjust just like you did. Then your family can focus on helping you and creating memories they can carry with them.", "I’m not making a judgment on you either way. This is serious and I’m so sorry you’re dealing with it. Imagine how hurt you would be if you were in their position and your child didn’t tell you they were terminal. Please, I think it’s really important for you to sit down with your family and fill them in. Also make it very, very clear what you do and do not want during your final time here. If your plan is to end up in Switzerland make sure that you find out ahead of time what, if anything, needs to be done before you go for the final act (citizenship, medical treatment, etc.). I wish you the best and hope your family will honor your wishes.", "Idk, I mean, your under their roof now so it seems disrespectful going to Switzerland and then dying and not telling your family will make em think that you have just went missing on a vacation and eventually they will know. Im just a year younger than you and currently live with my mother i couldn't do that to her but it's your choice. It just seems disrespectful is all", "INFO\n \nHow long are you planning to stay with your parents if you plan to go to Switzerland.\n \nPer the palliative doctor your condition can suddenly change.   Have you documented and secured your wishes regarding your treatment? It seems wise to do that before you disclose but you need to disclose quickly. Even if your sister honors her word it may show that she is upset.", "NTA because I understand the fear. But they will find out, and they will be hurt. Their emotions will be even harder to deal with because of the shock and grief and anger. Plus it will probably happen when you are declining rapidly and have even less bandwidth to deal with them. You aren’t going to avoid telling them, just delay it till the worst possible time. And that will taint your last few weeks/months. I suggest picking a time to gather a few people and tell them. It might be easier even to let them tell other people, so you don’t have to sienne that energy. \n\n I understand the reluctance. When I was diagnosed with cancer it took me until my first visit with the oncologist to tell most of my family. I didn’t want to manage their emotions as well as my own. Now that I’ve got a biopsy scheduled for a different potential cancer (cancer bingo here we come!) I’m even more reluctant to tell my family. I don’t have any concrete information to give them. I don’t want them to treat me differently and I don’t want to have to manage their emotions too! I’m having enough trouble dealing with my fears.  But I know that it will have to be done. I will need their support.\n\nBut planning a time and place to sit them down and tell them will let you be in control.", "go to therapy", "Tagging onto the top comment. /u/NeverLetGo900, I'm a palliative care doctor who has looked after many patients with brain cancer. You have plans for voluntary assisted dying, which means you absolutely must have people to support and advocate for you. \n\nBrain cancer is unpredictable. You may lose capacity suddenly, or without realising it. \"Capacity\" here means the ability to make insightful and valid decisions for yourself and is required for medical decision-making, including VAD. You may suffer from sudden complications which require hospitalisation. Someone needs to be your advocate so you can receive treatment in the hospital that is focused on your comfort without extending your life beyond your wishes. \n\nI am so sorry that you have received this diagnosis, and to speak so bluntly to you. It's true that the dying are sometimes burdened with the grief of the living, and it is cruel that it's happening to you so young. You are grieving as well. Talk to your doctors and find the best way to navigate this. Take your time to process your grief and shock. Remember that you don't *need* to cheer anyone up because what is happening is terrible, and we are allowed to be sad and to experience joy in the time that remains. The sorrow is necessary to allow people to process their experiences in future.", "Gonna have to jump on top too...\n\nI'm also terminal. I have a rare form of cancer. I actually had surgery last week with the hope that the \"small\" tumors that were not responding to the medication could be removed, only to discover that in fact, the CAT scans weren't showing the truth, and the cancer is completely imbedded with my small intestine and surgery isn't an option. I may last a year...hell, I could be that one weird data point that completely defies the odds once chemo (the last final straw grasp) is done and I live to be 100, but as it stands, the odds are that even if I see next Christmas, it will be my last. \n\nI'm choosing to enjoy what is left of my life. While I'm not going full bucket list, I'm working hard to finish a couple things I started a long time ago, and I'm spending my time with my family enjoying ourselves together. \n\nYour family is going to be sad and hurt, and I'm not going to lie, that's going to be hard on you to deal with. I worry so much about how hard this is going to be for my mom and my wife. But I think it would be a thousand times harder to try to pretend everything was ok, because weirdly, then you are putting yourself in the position of trying to make everything ok for them, because they won't know the truth. \n\nI have made it clear to everyone that I do not want people telling me \"you're gonna beat this,\" or \"hey doctors can be wrong.\" I understand the reality of my situation, and prefer to live that reality, and so far, everyone has respected that. If you think there is ANY chance that they can respect your wishes, have an honest conversation, lay out your boundaries and expectations, and then enjoy the rest of the time you have left with the people you care about.", "Jumping on top comment to say very gentle YTA. From reading your comments you've at least thought a great deal about what the last months/weeks of your life will look like and I respect that immensely - it takes real strength to do that. \n\n&#x200B;\n\nWhere you stray very slightly into A H territory is; your decision is going to have a direct impact on your parents/sibling(s) grief in the aftermath. There's absolutely nothing wrong with what your desires are in this, it's an issue in that once you are gone, your parents are quite literally going to tear themselves apart with blame as to why you felt they couldn't trust them with the knowledge. In addition to that, the sheer furious resentment they'd unload, willingly or not, on your sister for knowing and not telling them will quite likely destroy that relationship too.   \n\n\nAnd yes, you're likely quite right; if you do tell them, it will crush them and time that could be spent creating memories together will be twisted slightly with the grief everyone will feel. But that doesn't need to mean those memories are a bad thing. Too many people focus on the former part of bittersweet and as awful as it will be for your parents, ultimately in the years to come they'll be incredibly grateful that they got the chance to share in them, and appreciate them for what they are.", "Jumping on this comment to say that I think you should also consider your family’s grief in your decision. At the end of the day they will be the ones who will remain and will have to deal with the shock once you’re gone. Telling them in advance will give them the opportunity to live with you all the memories they want to live with you before you’re gone, they will have time to process it better as well. \nI know you want your last moments to be filled with happiness and love, which you should voice to your family. But if you tell them you also won’t have anything to hide to them which might be a relief to you (and they’ll stop bugging you)\n\nIn any case and whatever is your decision, I wish you all the best, love and happiness in the world", "This comment needs to be higher up.", "I wish this was higher up. Sorry for your loss", "This", "OP please please please, read what doc here wrote its so important.  My mother passed from brain cancer.  Please re-read what is said here.  I am so unbelievably sorry, from the bottom of my heart, but you don't have to do this alone. <3", "Hugs and prayers (if you believe in such) Qierce❣❣❣", "I wish you peace, joy and strength in your journey <3", "Idk if asshole's exactly right. \n\nOP's very young, was at the start of their career taking off and found out they have less than a year to live. Shock and denial are likely huge factors at play here and honestly could continue to be so for the rest of their life. And having that conversation with family may seem overwhelming and daunting having to deal with their family's emotions when they've not really grappled with this themselves.\n\nBut it's a crappy situation on a timer that's not going away.\n\nThey should likely have this conversation with their family because end of life decisions are going to come sooner rather than later and they need to be as ready as they can be. Plus having a little knowledge may allow them to make memories and get a semblance of closure.\n\nI'd suggest maybe bringing the family to a doctor's appointment or to a therapist or religious figure (if they have one) or something to tell them in a setting where OP doesn't have to do all the emotional legwork.", "My dad had 6 months to live, by the time we took him home from the hospital, got furniture, his meds and insurance together, we blinked and 2 months were gone. I don’t know what illness you have but my dad had cancer with 4 months to go he wasn’t able to do much. One thing he did say often (and he was a typical cranky boomer) was thank you cuz he couldn’t do much by himself. It sounds like you are romanticizing how you will leave this earth.  You may not be able to travel or get out of bed.  Don’t dismiss your family’s help.  They will fulfill your wishes the best they can.", "Cancer can be unpredictable- you might not be able to get to Switzerland on your own once the severe symptoms start setting in, and in that case you'll need someone to advocate for you. I'm assuming you're aware of the requirements- there needs to be at least two meetings with a physician with a two week gap between them, which can also become an issue if your cancer progresses faster than expected. \n\nYou don't plan for your family to care for you, but you might not end up having a choice. In that case, they should probably know what they might have to do and what you want.", "The only thing that tips it into an A H vote is the fact that the sister is now aware and will be the convenient punching bag when the grief inevitably erupts at OP's passing. It's a shit hand they've been dealt, there's absolutely no getting away from that. But while it may sound breathtakingly callous to say, they have to make the best of it; and right now that doesn't include letting their sister have to bear the brunt of their parents collective misery if they find out that she knew and deliberately withheld the information, regardless if it was at OP's express wishes. \n\n&#x200B;\n\nThe key word you're using there is \"closure\" there could never be closure if the parents were spent grappling with the thought that OP didn't care about/love/trust them enough to share the burden with them for the rest of their lives. It's something that's been written about a fair amount from people who've had family/friends end their lives, especially without a note or any other form of communication. Just the endless question \"why\" that can never be answered that takes a heavier toll.", "You're exactly right about what her sibling will go thru afterwards..👍", "Every sentence out of your mouth telegraphs exactly how little forethought you are putting into this. This isn’t a TV show. You are causing a completely avoidable escalation of your family's trauma. I don’t know if you think you're sparing them or if you're just being dramatic because you're 23, but this is childish and shortsighted. \n\nThis is real. You are dying. Your parents are about to lose a child. This is your death and you are in charge of it but by deliberately lying and denying them a chance to prepare, you are being TA", "I understand you, and your feelings but give them the opportunity to know, so they can do the most of it and saying goodbye to you, they would regret not hugging you everyday not telling you that they love you, all the things they could have done and said only if the knew. Give them the opportunity to be conscious about the situation, even better if they go with you to Switzerland and hold your hand until the very end. \nYou know already there's nothing to do about the illness if they try to convince you about the treatment just say that they need to accept it, as well as you did and end this the most peaceful painless way.\nLots of love, and I hope you enjoy every single second full of happiness and memories behind you. And I really really hope you reconsider telling them, it would change their future and how they will deal with the loss. Also, this is something you could do, programm an email with a video recorded of you talking to them, so after you pass they see that and it's kind of a message from the other side supporting them with the grieving.", "They can’t force you. But also, you should tell them hon. The anguish of losing a child isn’t your burden to bear, but you are making it worse by hiding it and giving them less and less time to cherish with you.\n\nAnd also, you are very young. They very well may have a viable option or perspective that is worth hearing. But regardless, you need to tell them. You will have to sooner or later. Do it now when it has the most return, and for gods sake don’t make your sister hide this from them.", "I think this is pretty irresponsible and selfish and that makes you the AH. The plan, if not for little sis, was to stay silent, book a flight to Switzerland, say goodbye to everyone, and then they never see you again? There's no closure for them? No grave or anything? That's pretty f'd up. You'll be sending them to therapy for years to come. What if they wanted to go with you to Switzerland? Do you know if they are paying for life insurance policies for you? You don't have a job so how are you planning to pay for it all? You need to have the conversation. They need time to process, adjust, grieve, and plan. The longer you wait, that just adds more trauma for them. You can tell them all you want is happiness, and they will do their best to hide their feelings, but they need to be able to talk to you and you to them. This is the time for the family to rally together and make the most of the time precious days you've got left.", "Cancer sucks!", "This. Make everything as easy as you are able. Get everything in writing, pay for what you can, and keep it simple. At 23 they can't make you do anything, but of course they'll want you to. They can't stop you from carrying things out as you want to. No judgement because this is a horrible position to be in.", "Simple. It ***isn't*** ***real***. This is OP's life fanfiction of some sort. So much doesn't add up here, especially her savings and prospective idea of moving to Switzerland to have a silent death.", "Don’t do this. OP knows more about their own medical condition than you do.", "I would be careful about talking to the doctor about the Switzerland plan. Depending on local laws, the doctor might be required by law to report that conversation if OP indicates an intention to take matters into her own hands. Getting an involuntary psych hold won't help OP make the most of their remaining time. OP needs to keep that plan on a 'need to know' basis because people might be legally obligated to interfere with it.", "I’m afraid this burden is too much for your sister to bear. They’ll likely find out she knew and didn’t tell them. They may be angry at her for this (grief blinds the most wise) and she’ll have to carry the guilt of not telling them. There are no winners here, but they love you and they would want to help you through this.", "I’m surprised I haven’t seen anyone else mention your sister. It would have been better if she didn’t find out but now you’re putting the burden on her to deal with the grief of losing her sister by herself and having her lie by omission. For your sister’s sake you need to tell them, otherwise she won’t be creating any positive memories during this time.", "You can still do that. When my mom told me she had cancer and i knew that she wouldn't survive I hid my pain and tears from her (except 1 time) and we went on make some fantastic memories and i treasure those memories more than any other. I was so grateful for the time i got to spend with her before she died and because we knew her time was short we really did make the most of the time she had left. \nI don't think i could of ever forgiven her if she didn't tell me she was dying because there are always regrets about what could of, should of been said or done.\nThe burden that you have placed on your sister is too heavy for her to carry, please don't do that to her or to yourself. Tell your family and accept their help.", "You can also look into Vermont, that is the current plan for an ill family member.", "It's called MAiD here. I don't know if people who aren't citizens can access it or not. But MAiD is what you will need to look up. \n\nhttps://www.canada.ca/en/health-canada/services/medical-assistance-dying.html\n\nFWIW, I think you should make sure your doctor's know your wishes and sign any medical documents needed to ensure only palliative care rather than life prolonging treatments asap but after that I think you should tell your family. You and your sister (now that she knows) should not have to carry this burden alone and if your capacity goes unexpectedly it will be messy and harder on everyone including and especially you. \n\nSorry to hear this is happening. I hope you find some peace and joy for the time you have left either way.", "If you are from the USA there are a few states that might work. I think Oregon just got rid of the resident requirement.", "Came on to warn you that you may not be able to as you have to be Canadian to receive this. There are a number of states in America though! I saw already you have gotten quite the amount of info though. \n\nPlease do, put yourself in their shoes. Sit then down and have the conversation with them. Let them know what you want and don't want out of the next few months. \nI wish you only the best OP. I truly do.", "I’ve lost several friends to glioblastoma. It’s devastating. I’m sorry you are facing something similar. This isn’t the time to be alone with something so enormous that can really impact your thinking and decision making. Please let the people who love you hold you close as you move through this.", "True, but at least talk to the doctor's about telling the family about it", "Oregon seems like a good option for me.\n\nThank you", "Canadian nurse here: its actually under a month wait in ontario. Can be as quick as 10 days. Depends on how fast the pt is assessed by the physician/np who will be doing the procedure. Depends on the illness as well.", "I hope you find peace Op. Oregon is absolutely beautiful. We welcome you with open arms ❤️", "California also has the End of Life Act", "It’s beautiful in Oregon as well. See the forests and beaches :)", "Washington and California have this as well.", "Good to know. People in MB were making it seem like it takes months if not longer. Maybe that's including the initial diagnosis and options for treatment? Our healthcare has been gutted to hell over here so who knows.", "There is no right answer here. You have the right to do this the way you want BUT your sister knows now and obviously your family knows something is up. While I understand this is your journey they are your family and you obviously have a solid relationship with them. I wish you the best hun.", "Yeah if you're going to live with them through this they need to know. If you wanted to go on without anybody knowing you shouldn't have moved in with your family. YWBTA if you go forward and never tell them. Start with your parents and tell them you want happy time before things get bad. I hope you can find peace.", "Soft YTA, in a really tough situation. But, as your parents, they deserve to know. At some point, they are going to need to help care for you, and they need to be prepared for that. Imagine what they might go through if you were to die suddenly, without them realizing you were sick- that would not be better than them being able to spend your final days with you knowing they were going to get to say goodbye.   \n\n\nI really recommend you get a death doula- someone who can help you plan for and deal with the emotional rollercoaster that is preparing for end of life.", "NTA.\n\nDon't get me wrong. It's certainly not a nice thing to do. But there is a reason for medical privacy.\n\nYour life, your choice", "YTA\n\nBased on the Switzerland plan it seems like you won’t be a burden on your family so I don’t really see a need for them to know. Yes, it will suck for them, but this is your death, and you have the right to handle it whatever way you’re comfortable with. I totally get not wanting to deal with everyone’s grief when you’re dealing with your own. \n\nThe problem is your sister, your mistake here puts a massive burden of guilt on her either way. You put her in a no win scenario, something that is very unfair to her. If it was that important you should have double checked or gone for a walk. You need to come clean.", "I lost my son 5 weeks ago,  no warning,  he lived in another state, had I known what I know now I would have flown to visited more,  I  would talked to him longer.  Dont give your parents  this guilt and regret, soft Yta,", "Very gentle YTA. I'm so sorry for your prognosis and huge change in your life. All the reasons already mentioned.\n\nYou need to tell your family soon and after the shock and grief hit, you can work on creating good, happy memories with them. They will be forever grateful to have the chance. It sounds like your sister loves you--don't let this burden fall only on her.", "Very Gentle YTA - You are sick and going die, you need to tell them. this is something they need to know. it sound like you haven’t fully accepted this. you also have an plan and that wonderful. \n\nit is your choice but your family need to know, especially if you live with them. I suggest, talking to an lawyer, getting your things  in your order and tell them and be firmed when you say you aren’t doing any treatment", "If it was my brothers or parents I would want to know. Not so I could be sad for them but so I would have the opportunity to see them off without any regrets.\n\nI’m not going to stand on a soap box and lecture you because this is a deeply personal choice. Know that any reaction that comes from your family is going to be a mix of confusion, love and sadness.", "It's been a while since I've researched this but if you are talking about Dignitas in Switzerland you have to be approved ahead of time. I'm so sorry for your situation. As people have said, there may be closer options. I make no judgement.", "YTA for one simple reason. Your 17 minor sister knows. She knows. You are asking too much of her. She’s a minor. I don’t care how mature she may be, she is still a minor child dealing with something that is way to big for her. You are asking her to shoulder something anyone would grapple with, let alone a child. Your opportunity for secrecy left the minute you took that call on speaker. I’m so sorry that this is happening to you, but it doesn’t give you licenses to do this to her. You will fuck up the rest of her life. Don’t ask this of her.", "Gentle YTA because this is waaay above Reddit’s pay grade. \n\nI understand that you don’t want to have their knowledge of your death affect the way they are with you and how your last months are spent with them. But have you thought about how your death will affect them? You have all of your remaining months left to process so that you pass with closure; they won’t have that. They will only know that you took a holiday and chose to die with dignity there.\n\nOn the one hand, I hesitate to call this selfish, because I do really understand that you want to make the most of what time you have left. But the reality is that doing it this way is probably going to have a significant effect on your family for the rest of their lives. They won’t get closure, they won’t get to make sure their last memories of you are as full and vibrant as possible (as they’ll just think they are everyday normal days). And you’ll lose out on some of that, because some of those moments may be things you’d like to experience. Like having certain conversations, having special days or trips with them where you all know it’s the last time and you make it the best trip ever. If they don’t know when your last days are, they could end up in the situation of thinking it’s a normal day and not making time to see you and going to the pub instead, or arguing with you about dinner or something else inconsequential. Would that be how you might want your last few days before you fly to be spent? \n\nAll I can say is that my family was rocked by suicide, and the after effects were and are still felt almost 50 years on. Family members are devastated with ‘how could I not know’ and ‘how was I not important enough to them/how could they value me so little to do that’. And that’s without the added factor of having hidden a terminal illness (although they did hide non-terminal health issues that contributed). Are you okay with that being the aftermath? I don’t mean to be cruel by being blunt, but I doubt that you want the people you love to be damaged by this for the rest of their lives.", "Your family is going to be your biggest cheerleaders, and your backbone when you need support. \n\nTell them.", "This is a horrible situation i can't begin to understand or judge, and whatever you do ultimately has to be your decision, but imagine losing a loved one and finding out afterward that they knew they were dying and didn't tell the family. Wouldn't you feel robbed of the time you could have spent with them if you'd known it was your last chance? I would hate for that to be your parent's situation.", "YTA specifically because it's a HUGE PITA when someone dies. Let your parents help you plan everything... Because if not they'll be stuck grieving AND planning everything, dealing with your estate, etc", "NTA - but, your sister knows and that's a lot to deal with on top of keeping a secret from the people you need most.\n❤️", "NAH I can’t imagine what you are dealing with, but personally I think your family should know.  Especially if you have moved in with them.", "I know you have good intentions but this is a really horrible thing to do to your family… there will be so much resentment, hurt and anger that they will have for the rest of their lives on top of their grief\n\nYou are not sparing them, you wil make this 10x harder for your entire family\n\nI hate to say YTA because mortality affects everyone differently and people do wild things when they are hurting but this is cruel", "Have you tried chemo ?? 🥺🥺", "NTA.... however now that your little sister knows it is unfair to her to force her to keep that news a secret. She needs to be able to share her fears and grief about knowing she is going to loose her big sister very soon. At this point it would be best if you tell your sister hold on one more week while you gather your thoughts and wishes and then have a family dinner to explain what your expectations are. 1. That you do not want this personal news shared outside the home, it is your news to share,nobody else's. 2. That you do not want special treatment, that you want to finish life in earth with lots of love and laughter. \n\nI'm so sorry you are having to go through this, big hugs and sending love💕", "You certainly are no asshole, but think about the fact that they are going to be devistated AND have soooo many questions. If you get your affairs in order, that should be part of it, if for their sake alone.\n\nPlus, you might feel a weight lifted after you do. Just a thought.", "u/NeverLetGo900, I don't think it's possible to declare whether or not you're TA because it is such an extreme situation. Most of us can barely imagine what it is like to be in your position, let alone truly empathize, so we should not try to judge you.\n\nI do, however, have some experience with a situation like yours, and I'll relate a little of what it was like. Maybe it will help with your decision.\n\nA very dear friend of mine, pretty much family, knew she was dying. She chose not to tell anyone (except one person who was helping care for her) because she didn't want to be treated any differently or deal with the stress that others knowing would bring. She wanted to retain as much dignity to the end as she could, and it pretty much worked for that. None of us, her blood relatives included, knew she was dying until a few months before the end (and some didn't know how serious it was until the last few days).\n\nAfter her passing was absolute chaos. Her family melted down and caused havoc with her estate. Her friends were left trying to cope with a loss that, from their angle, came out of nowhere. \n\nSo I think whether you tell anyone or not depends on your priorities. I think you're right that if you tell, you'll feel the burden of trying to lift everyone around you up. Putting on a false front is exhausting, and you'll be battling your illness at the same time. I wouldn't blame you for not telling.\n\nOn the other hand, if you want to make sure that your last wishes are respected and your estate handled the way you want it handled, it may benefit you to start dealing with it before you pass rather than relying on grief-stricken family members and friends to make the right calls in the midst of loss. It may also benefit all of you to seek counseling together so that you have support in your last year rather than you supporting them, should you choose to tell them.\n\nNo matter what you decide on this issue, you are not an asshole. No one knows how they would handle this situation until they're in it, and the answers aren't cut and dried. The best you can do is sort through your priorities for telling vs. not telling, and act accordingly. Either way, I wish you luck.", "You are a good human. Sorry you are going through this. Maybe you should consider telling your family.", "Gentle YTA, yes we all want your last moments to be happy and peaceful. But also to help bring closure for your family. If they know, they can learn more and plan for it, as best and as rudimentary as that planning is, no one can anticipate the degree of grief and sadness, but it's better than being blindsided with this info. \n\nThey can't be bad people or mean people if you're living with them and they sound so concerned and worried about you. They are the ones who will live on with these memories -- give them the opportunity to do all that they want to to have peace of mind, do it with awareness. \n\nDon't carry the burden alone. I know you think you're protecting them. To them, it will feel like you were hurting so much but you hid it from them. They'll think you suffered alone, even while living under one roof. **Don't let your little sister have to hide this big truth either. That's a devastating secret to have to carry. don't do that to her either.**", "NTA\n\nI say this in a soft voice: If you didn't want anyone to know, you should have kept working and kept your own apartment and lived your life as you wanted. \n\nNot telling people you're living with is going to be difficult, as you've already learned. Your family will likely be hurt by your decision, but frankly, that's their problem. This is about you and what you want your days to be like. Don't be surprised if your sister doesn't keep her word. This is a tough secret to keep.", "First of all, I’m so sorry this is happening to you. I’m not going to make a judgment on whether or not you’re TA. You’re in a very difficult position, and it’s hard to think clearly under these circumstances. However, my step dad (I consider him my actual dad because my bio father is gone) just recently told me he has cancer again. He has known for a few months and decided to keep it to himself and fight it on his own. He did this because he didn’t want me to worry or stress out. I understand his reasoning, but I was devastated that he hid it from me for so long because I wanted to support him from the get-go.\n\nYour family loves you and they may feel more upset if you let it go too long without telling them. My advice would be to lean into them, let them help you. You need all the support you can get right now.", "YTA\n\nYou don't think your parents would take every bit of time off they can or even a leave of absence to travel with you or spend more time with you if they knew?  You don't think they are going to start pushing you to find employment again and start working on a career soon since they don't know?  You think they are very aware that something traumatic has happened and are trying to figure out how to help?  Why else would parents be okay with their 23 year old kid moving home and doing.... Nothing. After less than 3 months of employment?\n\nYou are setting them up for a horrible gut punch and surprise grief rather than letting them come to terms with things.  You're setting them up to be even more destroyed by this than they have to be.", "YTA. You expect to live at your parents for a year not working without explaining this. They are going to come down on you and then feel like absolute crap when the truth comes out. Just engage so everyone can help you.", "NAH.... I am so sorry this is something you are facing now. BUT.....YOU NEED to let your family know what is going on. You are asking your family to provide care for you go through this.... And I am sorry but it will be hard on you and them equally, but in differnt ways. For them, the pain will last much longer. The sooner the better now that your sister knows. I hope you are in a country with good medical support. Best wishes", "No one’s an AH (is there an abbreviation here??) - how we deal with our own mortality and its end is individual.. we will all treat it differently .. your family and friends, however, do deserve to know - for the same reason they are family and friends- they love you … please tell them, not only for their emotions but also practically they will be helping you in your latter stages .. if I read correctly though, this reason will scare you a little so I think just remember they love you and they need to know to come to terms with it as well - I’m so sorry you are in this position", "NAH….sorry you’re going through this. I hope you’re time left is as happy & pain free as possible.", "YTA. Have you imagined their situation when they realize that you are hiding the inevitable all the while staying with them. Move out if you don’t want them to know.", "I mean I don’t want to call you TA but you kind of are. \n\nYou’re assuming you can move somewhere else when your symptoms become too severe and just follow through with your plan. But the reality is your family is gonna see you decline before it gets to that point. They’re going to worry and struggle and try to drag you to appointments and then find out not only are you dying but you’ve been dying for a while. \n\nWhat was the plan? Just disappear? Let your family think you’re missing? Or completely blindside them without giving them any closure?\n\nYes, you are the one who is sick. But this impacts a lot more than just you, and while it’s your right to decide your plan and follow through, the right thing to do is let them know. \n\nBesides, your sister knows. She’s hurt. she’s angry. You want them to hear it from you, not her. \n\nAlso, they can’t force you to go to the doctor to get treated. You’re an adult. So that point is low key off the table. \n\nI’m so sorry you’re going through this and I hope your plan plays out in a way that brings you peace.", "YTA but your grieving and it’s understandable as to why. It’s a hard conversation to have because it means you make it real and accept it by telling them.\n\n\nBut I would advise you to let them know so you can creat some great memories before you go.", "NTA but maybe I could give you some mom advice? You have to control this storyline. You are probably going to need more support coming up but you have the absolute right to demand certain behaviors from them in that regard. That means if they get mopey or maudlin they are done, they have to leave the room, they can grieve in their own time not yours. You are in command here. They grieve out, not in. Google \"Circles of Grief\" and make them stick to that. Now taking something away from people who are confused and unaccustomed to grieving leaves a big fucking gap that needs to be filled and I suggest filling it with good things, positive things. Affirming things. You can do this and I'll be thinking about you.", "YTA if this is true, but honestly I’m skeptical. A doctor would not have shared your information with your sibling", "NAH. This is a very difficult situation. I can understand you not wanting to tell them because you don't want them to worry, but sooner or later, they will find out, depending on the illness, it's very difficult to hide most terminal illnesses. I think it's only fair that they know, because they will have to deal with the grief long after you are gone, and if you let them know up front, it makes it not necessarily easier to cope with, but at least to accept the inevitabilty. As much as you want to, don't keep this from them. Let them know, but make sure they respect your privacy and personal space regarding this.", "I’m so very sorry for what you’re facing. Just ask yourself how you would feel if someone you loved deeply (parent, child, sibling) withheld the same news from you? Obviously it’s your choice whether you reveal your diagnosis but if was me, I would want to know.", "I'm so sorry you are going through this. Your family has a right to know what is going on with you. I know you don't want to let them know yet but by keeping it secret you will be hurting them so much. They need to know and be there for you. Please tell yr parents. Let them be there for you. Let them love you. This will hurt them so much more if they find out later down the road. As hard as it may be, tell them. 🤗", "NTA- you have the right to your privacy and to decide how you want to spend the time that you have left.\n\nBut if you want to be alone and have made the plans to be so, do ensure that you put all your affairs in order.\n\nIf your family members are generally pleasant people, consider leaving individual letters for everyone that you are close to with explanations of some of the choices that you have made & highlight that you don't want them to be unhappy or blame anyone for your illness.", "YTA because of how this sub works. You are not actually TA here.\n\nYou're living with your parents, this affects so much of how you will be making decisions. That in turn will be affecting them too. It's really something you need to tell them about. People you do not live with, more leeway but I think it's important for those you are close with to know something.\n\nI had a terminal misdiagnosis so while for me I didn't go through the process but I had conversations with my husband about things like MAID and was worried about how that would go with my parents. I can understand a lot of your concerns and feel greatly for you. I hope you have some really great experiences in the next little while.", "Well, I don’t think you are an AH, but I respectfully do think you are wrong not to tell your parents.  As a mother, I would never get over it if one of my children knew this and did not tell me.  It’s your right to do what you wish, but I hope you change your mind.", "You need to tell your parents. I'm sorry you're going through this and I totally understand if you needed a minute (days, weeks, whatever) to process, but they do deserve to know. Very very soft yta.", "I'm not going to say YTA or NTA. But I will say that your family would respect your wishes of not wanting them sad but you need to tell them.\nWhen my cousin was in hospice his only rule was no crying and no sad faces. \nYou can do the same. But your family deserves to know so it's not a huge shock to their system when you start needing more help", "Gently, YTA. I did what you did when I was hit with cervical cancer. I lived in a different state from my family and I hid it entirely. Did it on my own, dodged the video calls and questions. Bailed on holidays. They didn't know until after I won my battle and I told them. I thought I was saving them stress and grief and instead, I hurt them instead- immensely. I understand the want to save them from pain. I understand not wanting to deal with their feelings while you're struggling with their own. However, they love you. Losing you unexpectedly is going to hurt so much worse. Try reversing the situation. What if it were a family member? Would you rather know and spend every last minute packing all the joy you could into those final days? Or would you rather wonder what could have been while you mourn them?", "NAH.  I am so sorry this has happened. I can't imagine being in your position.  I don’t think a lot of us can truly understand what you are going through to give a solid response.  But sadly I have lost two friends to brain cancer.  Both under 35.  The second one didn't tell everyone right away. I know a lot of us would have changed how we prioritized our time if we understood how little we had.  I understand you are not wanting them to change your decisions. So maybe put in place the end of life and POA documents you can first.  But I think you should tell them sooner then later.  Yes they are going to be sad.  But they will be there to support you.  They will help you achieve the best experience you can with the time you have left. They should know how much of a treasure every minute is", "Very very soft YTA here. I understand you don't want to hurt them and don't want to have to be consoling them while you are trying to enjoy what time you have left. Those are both valid reasons. The thing is, if they find out when you are no longer able to hide it and can no longer do as much, then they will be grieving while you need the most positive support. You should set them all down and let them know what is going on and let them know you want to get the most out of your life you have left. They may then throw all sorts of energy into helping you have experiences and fun that at the moment you don't think you might be able to have. They will be able to then look back on their time with you and not have it tainted by knowing you hid it from them and they weren't able to make the most positive memories possible.\n\nI had 2 friends who barely managed to make it through college because of the extreme holes in their hearts. They wanted to have the most out of life, and their family was able to let them go to college and experience life because they knew it was nearing the end and they had already made their peace with it.", "I don't think YTA. Honestly, it's your life. It's your experience. And....your boundaries. I may have the wrong understanding because I'm not close with my family, or anyone really, who gets to question my decisions. Yes, this does effect them. That's true. \n\nIf I may suggest, rather than a black or white perspective, let's add a little shading. Perhaps see a therapist or talk with a death doulla about how to prepare for their response. Another idea is to consider going to YouTube and looking up Ted talks on death and also checking out...shoot I might have the wrong title, but I think it's Death over Dinner. Or maybe Dinner over Death? Either way this dude who studied cultural regards to death suggested we have open and honest discussions about it, in the spirit of acceptance and understanding it as a natural human experience.", "I’m so sorry but please tell your family so they can support you and take advantage of this time. Your sister most likely will tell if you don’t do better it come from you and that way you aren’t sneaking and lying to your family. I’m so sorry hun please take care of yourself", "I'm so sorry. No one should have to go through such an illness. I completely understand why you're keeping it to yourself. I don't think you're being selfish. She doesn't understand what you're going through. Eventually, you'll have to tell them. I hope you can pass with peace and love. NTA.", "I won’t call you an asshole but you need to tell your family. You don’t have to go through this alone and they are going to find out. Also it will help them to come to terms with your situation.", "Very very gentle yes. Either way what's happening is going to be hard on them as it is you but it will be much worse if it just happens suddenly and they don't know why. At least with them knowing they can truly make however long you have left wonderful and they can prepare themselves and you for what's to come.", "The softest of soft YTA on this one. I understand completely but your sister is completely right. You can't hide it for long, especially from the people you want to have around you during the process. Tell them, let them know they can have a little while to grieve, like a week, but then you want to get started on a kick-ass bucket list with them and have as much fun as possible and give them as many memories to carry on as you can. Good luck to you.", "Jumping in on this one too. You also need to have a living will and power of attorney in place for when you're not able to make your own decisions. After my father passed me and my mother went ahead and put wheels in place and power of attorneys in place for each other\n\nShe's currently going through chemo treatments for stage 4 colon cancer and I've got some health issues and some heart issues going on.\n\nWe are trying to prepare each other for when it happens. And also to make arrangements for when it happens. That's one thing you may need to start considering as well do you want to be buried or do you want to be cremated? I will tell you right now you can find very nice looking urns off of Amazon...   They will be about a third of The Price funeral homes  charge", "Also, her last moments aren't going to be filled with happiness this way. The family is rightly questioning OPs life choices right now. This is a recipe for the end of their life to be filled with resentment, conflict, and disappointment. And then their parents will feel guilty when the truth is revealed. I won't go so far as to call a terminal 23 year old an AH but this plan is truly unkind to all parties.", "I also want to add, as someone who lost a parent to cancer, there's plenty of chances to make new happy memories. Taking pictures. Having a support system behind you.", "They should also be aware to help you get everything together before you pass. I know it’s grim but funerals are expensive. You are young and I’m thinking you probably don’t have life insurance. They’ll need to make arrangements to care for you before it happens. I’m sure they also want to enjoy time with you while you are well enough to be up and about doing things. Imagine if you were in their place and it was your child who was I’ll, wouldn’t you want to know?", "Thank you for being one of the few to actually understand that 'asshole' judgments don't really apply here. Interesting how so many keyboard warriors find it easy to call a 23 year old facing the end of their life an asshole.", "I was thinking this too. I’m in my twenties, a mom and a hospice volunteer. Anticipatory grief (knowing death is coming and grieving before a loved one is gone) is honestly often easier for a family than if a traumatic event takes someone suddenly. It’s how the brain processes things, we can’t handle it all at once which is why there are stages to grief. It takes time to cope and it takes people much longer to cope with unanticipated death. Family therapy would be of great benefit here.\n\nAs a parent I would feel like shit if my child hid this from me. I would always wonder “what if” (what did I do that made them not want to tell me? Why couldn’t I comfort them? Why couldn’t I be there for them?) to outlive a child is unimaginable grief.\n\nAnd for one sibling to bear this burden alone? That could break them.\n\nI totally understanding needing some time to process because I’m the same way *but* I really think therapy would be beneficial here as everyone will have their own way of grieving and those ways can clash, especially in a single household. It’s not OP’s responsibility to act in a way not that would prioritize the family right now but, as a hospice volunteer, I can also say that families can completely fall apart following the death of the patient. They have their own needs and grief and a lifetime without someone they dearly loved to endure.", "Fuck, man, I hope you accomplish the goals you've set for yourself in the time you have left and that you and your family are able to enjoy each other's company a lot in the coming months.", "Sometimes, a shift in capacity occurs overnight without warning.  If that happens, you won't be able to make it out of the country.  I can't imagine how difficult this is for you to come to terms with.  However, your parents need to know.  \n\nMy sister told me about her illness.  It was devastating to me.  However, I don't regret knowing in the least.  I had time to tell her things that I may not have had I not known.  \n\nI'm so sorry. I wish you peace.", "So…. One day you’re just going to disappear?", "My colleague just past away from glioblastoma (aggressive form of brain cancer). \nShe got diagnosed at 25, was one year out of nursing school, and was given a few years to live. \nShe went peacefully, surrounded by family, friends and coworkers. On her terms. Colorado is a good state to die. \n\nIt is important to make a will, so please look into it now. \nIt will help you to solidify what YOU want, and no one will be able to change it. \nYour doctors might have some additional resources to share on the end of life. Hospices provide amazing resources to families and their patients too. \n\nOne thing. \n\nI’m a critical care nurse and saw so much death lately, I can’t even talk without tears about it. \nI also experienced the worst of the pandemic times when my patients died alone. The only thing they wished  for is to have their families there. \n\nI’m sorry you are going through the hardest time anyone can imagine. \nTry to find it in you to talk to your family to let them know what to expect. \nDon’t ask for advice, tell them how it will go, set the boundaries.\n\nOP, please don’t go through this by yourself!\n\nHugs\n\n\nPS: and no matter what, go to Switzerland!", "People on posts like this never think about it from the OP's POV, only from the POV of the family and friends. It's usually because imagining themselves as the terminal person is too difficult, whereas imagining being left behind is easier.", "Honestly, when it comes to someone who is literally facing the end of their life I think their wishes and needs trump anyone else. Especially given that OP is worried about being pressured or guilted into doing treatment that they don't want. \n\nI really don't think this is a situation where an 'asshole' judgement makes sense, not when it comes to someone making a decision about their own end of life.", "I mean I guess closure more in that you have opportunities to say things left unsaid in someone who knows their dying rather than like someone dying suddenly in an accident.", "Ending your life in Switzerland requires a lot of planning, paperwork, & approval. I’m sorry darling but if you only have a year left, going to Switzerland isn’t feasible. I looked into it and applied for it a few years ago. Even to get the initial approval, it takes months. Then you need months of proof, documentation etc. the process usually takes a few years in total. I might be wrong but I recall it being around a 4 year process. And that is if you have the capacity to be tenacious about it… which you may not have for much longer. It would be easier to do it in your own country if it’s legal. If you are in the US, there are some states where it is legal for terminally ill patients. I believe Washington, Oregon, and Vermont. Hawaii does it as well, I think. That’s where I would go.\n\nI suggest having a support system. I think your family will understand. And I believe they will respect your decision once they understand the futility of the situation. We did not come into this world alone, we are not meant to die alone.", "No, you don't have to experience that.  Please find a patient advocate at your hospital to help you fill out an Advanced Directive and Living Will- in this you can outline exactly what procedures you do and don't want, when you want to be allowed to pass on your own terms, and who is allowed to make decisions if you become incapacitated.  Without those two documents they \\*can\\* choose procedures- with an AD & LW, they can't.", "Hi, I'm a psychologist.\n\nfirst, I am so sorry this is happening.\n\nI came here to say that it seems to me control may be the core issue for you.\n\nSomething is happening to you that you cannot control. The worst thing.   You may be acting on an unconscious drive to regain your sense of control, which could be a partial underlying  motivation to keep this secret. Telling (or not telling) people is something you can still control, and as long as you withhold telling others you can still maintain control, and so by proxy have control over death.  \n\nIt  is your choice, But this issue of telling your family is probably not the control you wish for.\n\n I hope you are able to let them in.  I am sure there is a lot of love there. This will probably be devastating for them, and I get why you might not want to deal with that.  If you do not tell them, their feelings of grief may be mixed with anger and a feeling of rejection afterwards. \n\nI wish you all the best.   Again I am so sorry.\n\nNAH", "I don't know where you live, but Oregon has death with dignity and has eliminated the residency requirements. You would just need to find a doctor there and have your records transferred. Astoria, Seaside, Newport...all lovely towns on the coast.", "I really hope you got a second opinion at a top cancer center/research university.", "Take the time you need, but don’t take too long. I also have terminal cancer and kept the terminal part a secret for a little while so I could process it. Telling my family was awful, but knowing I won’t be around for much longer makes the good times we spend together that much sweeter. \n\nI’m sorry for your diagnosis—it really sucks. And by the way, you not wanting treatment is totally okay. I’m doing chemo to try and buy me more time and it’s brutal. I’m going to have to quit soon because there’s very little quality of life. There is no good answer. Be kind to yourself.", "And what about OP's family? When the parents realize that the younger sister knew and didn't tell them, it will very likely destroy their relationship with her, so she will be, what, 18 and suddenly without her sibling and with, at best, a permanently damaged relationship with her parents (and that's if they're willing to forgive her, which they might not), while also living with the incredible guilt of knowing what she knew and not telling her parents, leaving them to be blindsided. Meanwhile, the parents will be heartbroken to have lost OP, tortured by guilt because OP didn't trust them enough to tell them about the terminal diagnosis, and furious with their younger daughter for knowing and hiding it all from them.\n\nSorry, no. OP absolutely has a terribly hard road ahead, and I certainly wish it weren't the case, but what she is contemplating inflicting on her family (perhaps especially her sister) is nothing short of monstrous. It is callous and cruel and shockingly unfeeling. There is no excuse for it.", "\"...the parents will be heartbroken to have lost OP, tortured by guilt because OP didn't trust them enough to tell them about the terminal diagnosis\"\n\n\nIf she can't trust them, that's squarely on her parents for creating that kind of relationship. They raised her to feel stressed/afraid about going to them about problems to the point where she can't confide in them for something so important. It absolutely should break their hearts that OP feels this way, and they should reflect on why that happened once they find out. \n\n\nOP doesn't need people guilt tripping her to consider everyone else's feelings before her own, she needs the unselfish support that she obviously never received before. \n\n\n\"I'll have to cheer everyone up while coping with my illness as everyone always goes to me when they're experiencing hardship even my parents.\"\n\nShe does need to tell them, but it's necessary to recognize that this kind of mindset does not happen in someone who grew up feeling securely loved and supported by their family.\n\nOP is not monstrous or unfeeling, she's a young woman grappling with huge news in a short amount of time, with an evidently emotionally-insecure upbringing.", "OP, when they find out, they are going to hate that you were there for just that reason.  They are going to hate that they were \"busy\" or \"didn't\" have time when you asked to do something with them.  They are going to be wracked with guilt because you were there and they didn't know, didn't see the signs, you didn't love them enough to tell them.\n\nPlease reconsider and talk to them.", "In my opinion, it would only be fair to let your family know you're making memories... together. \nNot all memories are going to be good from here on out. But telling them, and setting your boundaries is a necessary one. \nYou might even feel stronger afterwards. \nYour family might surprise you, and give you a lot more support than you expect right now.  \n\nMaybe you can organise one carefree event, like 'a perfect day' where you plan an entire day with your family, doing 'happy stuff', and tell them at the end of the day. But do it soon, now you're still capable.\n Maybe include your sister in the plans,  so she can be your 'partner in crime'. It might strengthen your relationship as well. \n\nIt's not JUST you, letting go of life,  it's your family that has to let you go, as well. \n\nI'm very sorry this card has been delt to you. \nI wish you strength and love, and peace and everything you need to walk this path.", "I'm speaking as a mother, here.  You want to spend time with them and create memories,  presumably for them too, but have you considered how utterly betrayed they are going to feel knowing you moved back home and didn't tell them you were dying?  That's the memory you're going to leave, not just the grief of losing you, the shock of finding out after the fact, but betrayal as well.  They are going to wonder for the rest of their lives what they did to make you feel you couldn't tell them this huge tragedy was happening to you. My heart breaks for your mother already.  I can't imagine what I would do if I found out after the fact that one of my children had this horrible terminal illness, never told me, and went off to die alone. It would haunt me for the rest of my own days, I would never be able to get over it.  I'm pretty sure it would drive me crazy.  Please don't let that be what you leave behind for your parents.  If you do, yes, YTA.", "If all you want is to make memories, get your paperwork in order and then tell them. They’ll need some time to process and you may need to set some boundaries regarding how you want to handle the end of your life.\n\nHaving been in the position of knowing I was going to lose someone I love more than once and also experiencing sudden loss, I can say that there’s something nice about having the opportunity to prepare for the end. A lot of it’s little things. You’re more focused on good memories. You ask the silly questions. You make sure the last thing you say is “I love you.” The end is still horrendously painful, but it’s not the same shocking stab of sudden loss. I’d be furious if any of those people hid the truth from me. It sounds weird to say, but we had such a good time at the end.", "My husband’s aunt was dying from liver failure, and made her husband keep the illness from her extended family.  So he kept his promise until she had to go into hospice. The poor man got yelled at by some of his in-laws who were mad at him for keeping it from them until it was too late to say goodbye, and his wife was mad at him for breaking his promise. 😢 \n\nIt’s ultimately up to you, but you’re denying your family to consider each day with you as precious.  What if they get annoyed at you about something trivial and the next day your condition changes drastically?\n\nI wish you days filled with love & laughter for as long as possible.", "Unfortunately people don't go out of their way to make special memories with people they think will be around for a long long time. If you want to create those special memories you need to tell them you're dying. You're over 18, they can try to pressure you but they can't actually stop you from going to Switzerland.", "You need to be ready and tell them soon. It isn't fair to make your sister keep quiet about this. Eventually she will break or accidently say something and the conversation is going to be a mix of anger for putting your sister and that position and grief about what is going on. Also, please consider therapy, they will help guide you on a plan to tell your family. \n\nJust to let you know, my brother died suddenly. The one day he is here, the next day he isn't and not having time to come terms without before he died made it hard.", "I’m so sorry you are having to make these arrangements for yourself. Just coming in to say that Colorado is also a death with dignity state.", "Glioblastoma?  I'm so sorry.  My sister has this also.  It hurts and is painful to the family.  Somehow My sister got hers nearly 15 years ago and she's still with us.  Hers totally stopped after treatment and she went over 10 years cancer free.  Eventually it came back and she's at a point where she'll need assistance for the rest of her life.   Yet even after a recurrence she's still alive over 2 years later.  No most people aren't as lucky as my sister.  She was given 6 months and it's been several years.  Yes she's the exception and we all consider our family lucky.  I know it may not be the same for you and I respect your choice and plan.  However, as family to someone with this awful condition, please tell your family.  It hurts you, and it will hurt them.  But they do deserve to have time with you and peace as they prepare to say goodbye.  I'm so sorry you are walking this journey that I would wish on nobody.", "OP is literally dying, maybe have some empathy for them.", "Yes that part is fine to talk about and should be discussed", "She asked if she would be TA for not telling her family she's dying. I answered her question.\n\nI have empathy for her, she's in a horrible situation, and she has every right to go as she wishes, but I also have empathy for her family, who are going to have to live with the loss of her, which is going to be an even bigger shock than if she told them and they could prepare.  If that's what she wants to leave behind, that's her decision, but she asked, and I answered.", "Cat's out of the bag. Please don't make your sister carry this secret and the guilt and depression that will ultimately come from it.", "YTA. As someone that lost a parent close to me in tough circumstances, I will never overcome the guilt. The guilt of time off I could have taken: the guilt of phone calls I could have made. I’m tearing up just thinking about it.\n\nBe firm with them that you will not deviate from your end of life plans. It’s YOUR life. But the pain and agony you’ll subject them to is also unfair to them.\n\nI’m begging you to reconsider. You don’t deserve to have your life cut short. And they don’t deserve to not know until it’s too late.", "As a parent of 7 grown children, I would want to know . Especially if I am the plan for palliative, hospice care and funeral arrangements. We all are going to die at some point in time, but you have been given a heads up and your parents deserve that knowledge  as well.Im so sorry for your diagnosis, please think about telling your family.", "NTA. \n\nHowever much I get that OP wants the live the rest of life without having to deal with other people’s sadness, and it IS OP’s right to do whatever they are most comfortable with, it seems like a bad idea not to tell. At some point they will figure it out, or sister will cave and tell someone (because that is a hell of a burden, to carry such a big secret). \n\nWouldn’t it be better to tell everyone, let them get their feelings about it out in the open, then set a boundary around what can and can’t be discussed for OP?\n\nOP, at some point you will not just need help, you will want it, and if nobody knows, that will make things very complicated. As a person with a chronic illness that will kill me sooner than normal, I can say it is better that people know, because when I need rest, or help, they understand why. \n\nThat said, I totally understand not wanting to talk about it, and not make the rest of your days about this illness. But, it is. It will be, no matter what you do, because at some point, you won’t be able to avoid it. \n\nI’m so sorry to hear your troubles, and I hope you get to do all the things you want to do. Hopefully with loving family by your side.", "My heart hurts for you. They are going to grieve. Love will have to grieve but in that, every moment will be that much more rich. Giving them extra days with you is beautiful. Give them the gift of bearing this with you honey. Please.", "YTA, I am sorry for your situation, But you need to tell them, if your going to live with them, you need to tell them what’s going on, I am sorry about your situation.", "You’re making your parents responsible for you for stuff which is not a fair thing. Secondly, these are the people who love you and I’ve been with you your whole life. They deserve to know something so drastic.", "Sorry to hear about your diagnosis, but yta here\nwhat was the plan exactly, move back in with parents, have them pay for all your needs and then a year later they come home to find you lifeless? This is something they need to know, if not just to prepare funeral/memorial costs, which can get quite pricey.", "I will not call you the AH but as someone who lost their brother when he was young ( six months from diagnosis to the day he passed, by knowing he was terminal allowed me, my mother, and other family members to spend quality time with him.  As I lived 200 miles away, I made a point to go every weekend.  This also gave my sister-in-law and mom a break in taking care of him as hospice does not supply nursing 24/7 unless patient is in \" crisis\" which means likely to pass within a day or so, or in uncontrollably pain, which then nurse is there 24/7 until medication is adjusted appropriately.   My brother and I had the most amazing conversations.  He wanted me to know what he wanted done afterwards to ensure it happened.  I made sure his wishes were followed.  I was support to my mother and sister-in-law and nephew.  I made sure he knew how much he was loved and eased his mind on his dark days that he was not a burden.  We were a comfort to each other.  Please tell your family honey,  You will need their support and both you and they will need to come to grips with your diagnosis.  Share your thoughts, tears, joy and hugs while you can.", "Don’t rob your family and friends of their last moments with you. They’ll spend the rest of their lives not knowing or understanding why you kept that from them.", "No, you're not an asshole at all. It's a pretty serious conversation and can be stressful and bring up a lot of questions and emotions from people, and some might not take it so well. Just take it one step at a time and once you're ready, go for it.", "Gently, YTA. You are depending on them for your end of life care and putting the responsibility for handling the events that will have to happen after your death on them, without telling them that that is what's happening here. That's not fair to do to anyone.", "NTA.  In the end, it is your decision to make.  I think you should talk to your family while you are still lucid and capable of making decisions on your own.  They will be hurt, but you live with them and they are part of your journey.  By telling them, they will start the mourning process and be somewhat prepared for what lays ahead.  \n\nYou will rely heavily on them, and will help you on this difficult journey.  I hope you decide to tell them and you all get to enjoy the time together, plan and discuss, and look to what needs to be done in the near future.", "NAH\n\nI'm so sorry you've received such a terrible diagnosis and my heart goes out to you. Eventually will need your family's help and support though, and they will need some time to prepare and accept. \n\nMaybe give yourself some time to process this, it sounds like it's very fresh. Reach out to palliative care and see what resources they have in the way of grief support and counseling, for yourself, you might need to grieve this news and the loss of your future. \n\nI hope you can enjoy all the time you have left as much as possible.", "Not letting them prepare, physically or emotionally, will only make things harder for them. It's okay to want your last moments to be nice, but theirs will not be if they are surprised by it. They will have to grapple with a lot of very intense emotions in a short period of time, and that's not very healthy. When someone dies, it doesn't only affect them, it affects everyone around them. Your last moments should be nice, but their last moments with you should be nice, too. Gentle YTA.", "You weren't the asshole before, but now that your sister knows you have to tell your parents. She is a kid and can't keep this secret. I'm so old I think you're a kid, too, and I'm sorry you're going through this. NAH, yet.", "Soft YTA, because I think hiding it is the wrong decision but I also don’t want to call you an asshole, really. I get your perspective, you don’t want to console people in the last moments of your life, but you might want to think of it more as an equal trade where your part now is consoling them and being with them while they process, and their part will be the end of life care you may need. And I imagine it’ll be much heavier if you wait and tell them when it’s more obvious, when they potentially start to get upset that you’re acting differently or needing more from them and they don’t know why and then inevitably find out that you’ve been hiding it. And if they are hurt or angry at you for hiding it, it will be much harder than how it will go if you tell them sooner, and you may be less capable of dealing with it later too. It will be easier now than later- it’s always easier for those surrounding a loved one who’s passed if it’s been mulling around in their head for a while as a thing that will happen than if it’s sudden. I lost my best friend and my grandmother in the same year- my best friend passed very suddenly and my grandmother was 90 and we were prepared for it. And knowing it was incoming, we were able to make sure her final days were surrounded by happiness and family, whereas with my friend we didn’t have the opportunity to be present and focus on doing that for her last days. I regret all the times I could have reached out to her and didn’t. I regret the times she reached out and I felt like I couldn’t make time to see her. You have the choice between making it easier for your friends and family to recover after you’re gone, and I urge you to take that opportunity and let them be there for you now so they can grieve you with no regrets.", "NAH. \n\nThat said,  you're taking away their ability to help you,  care for you,  show you the deepest love anyone can. \n\nGet a therapist appt stat with your local hospice and figure out how to tell them your fears and hopes. \n\nPlan your farewell party. \n\nFind joy everyday. \n\nLove from this mom", "Gentle YTA. It may be helpful for you (and your family) to talk with a therapist who specializes in helping people with terminal illnesses. They can help you figure out how to tell your parents, can help you tell them, and can help you and your family with the emotions and all that will come after.", "NTA. I'm.so sorry this has happened to you. But unfortunately your sister will say something.  So prepare yourself for the fallout.", "NTA - but you’re going to have to tell them.\n\nAsk doctor for hospice resources. And then take your parents to a hospice counselor and tell them. Have the counselor tell them that you simply cannot be their emotional support right now and have to put all your energy in caring for yourself and your own well-being. So they need to avail themselves of hospice resources for emotional support.", "You are NOT wrong to make the choices you think are the best for you especially in such heartbreaking circumstances. You know your fate,and it's not fair! Your choice is valid!\nBUT,\nnow that you have this knowledge, you could share one last fight WITH them to make your time,memories they will cherish and of course grieve,for their time on this earth. \nLeave them with the best of you! Our loved ones are what make life worth living and even when you're gone,you can still warm their hearts with your courage and love of life with them. Don't go quietly into the night,be a blaze of glory!", "It seems you have a caring and loving family. Let them help you, support you in this. What are the things that you want to do with your family. Let them create memories with you, let them hold you tight and show you the love 💕 they feel. 🥰", "Without telling your family your situation, you are making yourself out to be an asshole. \n\nYou quit your job and moved back in with them for seemingly no reason, which is a bad look. I'm surprised they let you come back and aren't hounding you to get another job.\n\nWhen you start to show signs and can't look after yourself as well, they will worry and ask questions, and you won't be able to keep writing them off.\n\nIt's your life, you get to decide how you live it, but it is rather cruel not to give your family any answers, especially now that you live with them again.\n\nExplain to them that you dont want to be treated with pity. You just want your last year to be happy.\n\nI hope you have a nice time.", "This is beyond our pay grade. I will say if you didn't live with them and didn't unintentionally burden your sis with keeping your secret it'd be N T A no question. You have put your sis in a very awkward position.", "This is a lot to put on your sister, albeit inadvertently. Gentle YTA, you’re going to need support from your family for a change here. Please reconsider telling them.", "Gentle YTA. As someone who has given end of life care, there is no preparing them for it until they’re in it. The least you can provide for them is the knowledge of what they’re getting into. I helped with hospice for my FIL and was the one to look up the signs as his health deteriorated. If you plan on living with them til the very end, at least tell them what your wishes are as far as how they approach you and your decisions.", "YTA.  It’s a bit selfish to not telling your family. When you start to decline they will even be more hurt at the fact that not only are they are going to loose you, but you choose not to tell them. \n\nNo matter the reason for not doing it, I’d say at least tell them.  Let them start on the stages of grief now. Let them know that your time is limited and they can cherish every moment that you are still here.", "Sweety you need to tell them . Your sibling now knows and your forcing them to hold on the burden of you being very sick front heir parents, all while watching you possibly degrade in front of her. I understand you want everything to be happy and normal but unfortunately it isn't, and it will make those moments spent with the people with love that much more important if you are all on the same page. Are you really enjoying the last days of your life while constantly having to keep this secret from everyone? I hope you can see it from another perspective but either way stay strong OP!", "Before you make any major decisions talk to your local hospice", "NTA. It’s your life, you should get to decide how you spend at least some of what’s left of it. You’re right in thinking your family’s grief is going to be palpable, but hiding it from them isn’t what you really want either. \n\nSo my advice is: prepare in advance for breaking the news to them by stating clear boundaries and how you want the next year or so to look. Maybe a vacation soon to somewhere you always wanted to go, and a plan for how you want them to treat you when you start declining. \n\nThis is sad and scary for everyone, but it’s your life and death moment, and since you don’t get to control literally anything else, the least everyone can do is honor your wishes.", "I’m not going to pass judgement because this is such a sad situation. But you have to tell your family. They deserve to know. You deserve dignity in your last days and they deserve closure. \n\nPlus, as the parent of young adult children, your parents aren’t free to just access or receive your medical information. My older children are 22 and 20 and since they were each 18, I cannot even make a medical appointment for them because they are legally adults. This was true even after one of them had a medical crisis and her father and I were unable to receive information until she consented. \n\nPlease tell your parents. Yes they will be sad and heartbroken. But they need to know so they can do their best for you as you go through this process.", "This is way above reddits paygrade. I’m so sorry for you and I’m sure this wasn’t a decision you came by lightly. No one can tell you what to do, but you may want to think if the situation was reversed and it was your sister that was sick. How would you feel having to keep this secret? \nAlso look up different states laws on death with dignity, Switzerland is not the only place that you can get what you want. I wish you peace", "NTA (try).  I totally get where you are coming from to start.  That pity face people put on a hen they talk to you is the worst! Then it's on you to make them feel better about YOU dying, ugh. \nAll that said, you are in their house and they're still family. You don't need to tell them today, but at some point you are going to have to. If not for yourself, do it for them after your gone so they aren't wracked with guilt. \nGood luck in your travels.", "NTA but you should just tell them it will be ok and they will support you and help you. It’s better if they know because your health will decline and they will care for you. The news is sad but we all will be there at some point. The good thing is you know about it and you can get your family to support you. I’ve seen it happen to a few of my friends and everyone helped them out and supported them.  Your family will carry a lot more sadness once you’re gone if they know you kept it a secret and they weren’t able to be there for you. You don’t want their time to be total grief forever after your gone wondering why you didn’t want to tell them.  Just let them know and tell them and give them a hug.", "I don’t know that there’s a pain that can compare with losing your child. Please tell them. Not only to help them when something happens to you, but so you don’t have to go thru this alone", "Sweetie, \n\nWhen I was diagnosed with cancer, I planned it all out. I wrote my own eulogy and planned the biggest celebration of life with everyone I loved. I wanted to be there cause I thought it would be more fun for myself and everyone. I felt there would be grand stories told at my funeral of my celebration. It put me at ease while facing my journey. Your people love you, don’t forget that.\n\nIt’s your privilege to keep it to yourself, I didn’t tell certain people. I told the ones that mattered most to me.\n\nDawn", "In that situation, i feel as if the only way to judge if you're an a**hole would come down to content. It seems your reason for not sharing the news was to mitigate pain, and that is honorable. You should ask yourself tho, if the roles were reversed, how would you feel if you didn't know until it was too late to show how much you cared?", "I really don't want to call you an AH here, your just a young person who's been told their life will be extremely short.  You are processing a lot right now so I understand your want to keep it to yourself.\n\nHowever, you cannot realistically expect to not have your close family learn the truth. Your failing health will alarm them and I'm going to gently suggest that you still wouldn't have the peaceful last year you want. Your family loves you and will become distressed and start pushing you to get treatment.\n\nThere are other, far more practical things that will also need to be addressed.\n\nTake your time to process this news but you will need to bring your family in.\n\nA YTA only because I not in the wrong for now isn't an option.\n\nI honestly from the bottom of my soul wish your remaining time is spend loving and creating memories.", "Kind of TA, but not really in my opinion. You are going to pass in a year and that is very stressful, so I can see your side. However, this is your family, and they deserve to know about this. I'm so sorry about your condition. This was probably unexpected and sad, so you can wait a bit to tell them. You will have to tell eventually, because if you don't, it's probably going to be an even bigger load on your families back. But anyway, I'm so very sorry about this news. Hopefully God will welcome you into the gates of Heaven with open arms. :,)", "NTA. You have the right to manage your personal health information, and your death. That said, you might want to rethink your plans in case you need your parents to make decisions on your behalf at any point. It might be best to have a conversation with them, explaining not only your diagnosis but also what you want for this final period of your life, and requesting that they assist you in achieving it.", "It's your life...the projection of how you choose to present both your life and death are up to you.  That said...you did move back in with your parents.  At some point you'll need to tell them.", "Agreed with a gentle YTA. I'm sorry that this is your reality. You're living with them, and you're going to get worse, and they deserve to know what's going on. Please, let them know.", "You don’t have to go through this alone.", "I’ll be forward with you… you literally quit your job and moved back home because you knew you were going to die in a year. Leaving that information out to your family who’s going to have to provide you more care as the year goes on is unfair and selfish. Your parents also probably want to make special memories with you so that they can cherish them once you are gone. Depriving them of that absolutely 💯 makes you the asshole.", "NTA but id you dont want to wonder anymore then tell them", "X", "I don’t know if you are or not, but I know if it was my son I wouldn’t want him to tell me and then I wouldn’t want to fill his life with as much love and happiness as I could before he was gone. Maybe you could gently tell them and explain how you want to go happy and peaceful and talk about how you could do that together. You shouldn’t rob them of any time with you. This may sound selfish of me because I’m a mother and I can’t even imagine. I support any decision you make and I’m here if you ever want to talk. I just know that’s what I would want if it was my son or daughter but I only have a son so yeah. Sending millions of hugs!!! And I really do mean it if you need someone to talk to I am here and I’m a good listener and a good secret keeper.", "Honestly… we cannot answer this one for you. Unless we’re literally living the same conundrum, how on earth could we know.   \nWould I want to know one of my children was terminally ill? HELL YES.  \nWould I then struggle to give them ‘happy normal months’ after? Absolutely, I’d try, but we’d all be carrying the weight.   \nAre you the AH for wanting to live quietly and normally for a few months? No. But are you risking losing chances with your family to have great times together? Maybe.   \n\n\nPlease talk to a hospice/end of life counsellor. If this is cancer talk to your local cancer society and they can help you find someone who can help you with this issue. It’s a huge one to face alone for any person.", "YTA\n\nPer the op's comment, they plan to move out of the country once things go south and die far away from their family.\n\nI hate to call you an AH, but I'm going to give a really harsh judgment here to hopefully open your eyes. Moving to Switzerland is a ridiculously  stupid idea. How do you expect your family to find you? To bring you home? Don't move far away from them and do this to them. \n\nAs for your sister, you made the mistake of speaking about your diagnosis in her presence. Now you have to own up to it, and tell the rest. Because if you don't, she will feel guilty for the rest of her life. Whether that guilt comes from her telling the family and betraying you, or from her keeping it a secret from your family. Guilt is one of the worst feelings in the world because there truly is no way to rid yourself of it and it eats people alive.\n\nSpeaking of guilt, think about how your family will feel when you go. Think about how all they'll think is \"why didn't we see it? We should've known.\" They'll feel guilty too. You are going to hurt everyone if you keep this from them.\n\nI know this is harsh, but this is the reality of your actions. If your parents try to force you to take medicine or whatever, put your foot down. Tell them no. If you want to end things in Switzerland, then tell them that so they can go with you. Let them be there for yoh when you go. Spend the day together looking at the scenery. Allow their faces in the beautiful background be the last thing you see.", "YTA\n\nsorry, you arent really the asshole. you dont have to tell anyone to be honest. but you are the asshole. you arent selfish. you have every right not to share. but you are still the asshole. i dont know how to put it. this is a sad situation for all. and i wish you all the best.", "I’m sorry OP, but it’s the ultimate act of disrespect to not tell your parents. It will leave them traumatized and in despair and with a lifetime of questions, wondering why you didn’t care enough about them to share this news, in addition to being grief-stricken at losing their kid. All while you are using them by living in their home. Please get your affairs in order, get your final plans made and written down. Be strong and don’t give in to their pleas for you to prolong your own suffering with traumatic treatments. As others mentioned you don’t have to go to Switzerland, so you obviously haven’t even researched this, which tells me you’re being impulsive (understandably!) about decision-making at this point.\n\nMy spouse had cancer. After it had spread to his brain he went through weeks of brain radiation which prolonged his life only a few weeks, and they were not good weeks. So I understand your desire to die on your own terms, but please don’t do this to your parents.", "YTA. I'm really sorry for your situation. I get it, you want to be in control and happy till the end, however the people around you have the right to know so they can prepare and come to tems.\nGrieving it's a complex and painful process and they need to prepare for that. Your sister is right, you expect them to see you decaying and say nothing? Or are you going to just disappear? Imagine their desperation if one day they don't hear from you anymore and they can't find you. Leaving them like that would be a very ah move.\n\nAlso, you are kind of using them, you are at their house, they deserve that little, please. If you are afraid they would want you to stay alive connected to a machine, get a lawyer and get your writing instructions. But first talk to them and let them know you wishes.", "can you imagine if it was your sister though? her hiding an illness from you, moving countries, and dying without a word? it would hurt. it sucks, but you have to tell them. you’re their baby, and you’re her sister. you’re not an asshole.", "I am very, very sorry this has happened to you, but your family needs to know so they can process their grief adequately. Family means sharing and communication. Sorry, but soft YTA.", "I'm sorry for your situation.\n\nBut you HAVE TO tell your parents.\n\nThere is one reason.  That is the most important.\n\nIf I knew my father was going to pass, I would have spent more time with him.  Talking with him.  Making sure he knew that I loved him.  Instead, I went about my life.. barely spending time with him.. until it was too late.\n\nYou are robbing your family of time they will never be able to get back.  Yes, it will be sad.  Yes, it will suck.  But let them know so they can take time to be with you.\n\nNAH", "I don’t have a judgement for you, bc I can see this from both perspectives. I understand your want to be in control to the end and not lose your identity and to ‘taint’ family moments. \n\nBut you made a mistake having your phone on speaker and having your sibling overhear your conversation.  For this error you are burdening her with a secret she wasn’t able to decline to being part of. \n\nBecause of this you have to tell your parents. It’s a terrible position for your sibling to be in and the fall out of you not telling them, and your parents finding out they knew could be the ruin of relationships.", "Gently… YTA. They need to know for so many reasons. They need to know so they can be prepared to care for you of course, but also because… you are terminally ill. The best thing you could do for them as your family is tell them asap so that they can process it. It can really help the grieving process when you know earlier on that it’s inevitably soon.", "Gentle gentle YTA.\n\nIt's perfectly reasonable to want your last days to be full of cheer, and not about other people's feelings.\n\nHowever, creating that situation will take work. It means giving your family a head's up and also being brave enough to talk to them about your emotional needs.\n\nSomeone's going to have to take care of you as you become less physically able. You will need their support just for the day to day tasks. You're literally living in their house. You need to give them as much time as possible to process what's happening so that you can have important conversations about how to handle everything going forward.\n\nThe only way to avoid telling them would be to literally ghost them, arrange hospice care away from them, and never speak to them again. Which would be devastating for everyone concerned, including you.\n\nI'm so sorry this is happening to you but your sister is asking the right questions. It sounds like she still cares about you a lot. Talk to her about how you can break it to your family, and ask for her help in communicating your needs to them -- which honestly might include family therapy etc.\n\n&#x200B;\n\nPS: while you still can, write out a list of what you feel you need and how people can best support you. Find support people -- therapist, doctor etc -- who can help advocate for you while talking to your family.", "Oof. I don’t know how to judge this. While you are within your right to keep your medical info to yourself, this is your family - that loves and cares for you. \n\nFirst of all, I’m sorry to read this and wish you a peaceful journey. \n\nSecond, My father passed away “suddenly” of stage five lung cancer five years ago. I had to watch him die in the hospital having no idea what was wrong. None of us knew but we suspect he did and kept it a secret. That cut deep and I’m still working on dealing with the pain that caused. I wish I could have been there better for him in his last months and taken the time to properly say goodbye and tell him how much he meant to me. It’s been a lot to process to try and understand his motivations for keeping it to himself. \n\nI’m sure your family wants to be there for you and support you the best way they can. You are entitled to outline how you would like things to go and tell them exactly what support you want/don’t want from them. But do them the solid and involve them.", "My brother died of cancer at 26. he told us straight away and we were there for him every step of the way (He lived for 3 years). A piece of me died when he passed, it was very traumatic. I can't imagine how I would've felt if he didn't tell us. I don't want to tell you that you're the AH but being in their position you're the AH.", "Nah….I think they deserve to know, to make memories with you. To support you….but you also deserve to live your life in a way that would minimize any drama.", "You should tell them. I won't say you're an AH for not telling them, but I'd be so fucking heartbroken if I came to find out that my sibling or parent knew they were going to pass in a relatively short period of time and they didn't tell me. You're not giving them any time to prepare, and there will be so much more pain if you're suddenly just gone. Let your family love you and take care of you. Of course they'll want you to look into any possible treatments, but that's totally up to you and your doctor. Just please don't keep this from them. Losing someone, let alone your child/sibling suddenly is hard enough. Finding out they had been diagnosed with a terminal illness and decided to keep it hidden until the end would just bring a whole other world of confusion and hurt. \n\nI'm so so so sorry that you are facing mortality at such a young age. I'm 24 and you are dealing with one of my worst fears. You don't deserve what is happening to you, and you shouldn't be dealing with this on your own. Love and support, whatever relief you can get, might actually help, even if it only helps you stay healthy a little longer. The stress you are carrying can't be helping at all. Whatever you decide to do, I pray that you feel as little pain as possible, and that you will be welcomed into the arms of Jesus Christ when you pass.", "Yta. Tell them.", "And doubly so now that the 17yo knows about it. It's really not fair to them to have to keep a secret like this.", "I love love your gentle response. I have got to copy this. Any psychology degree or anything?, if of course your willing to share. God Bless your kind response to this sad situation and OP if you’re reading this, I really do hope that there’s a miracle in store for you. God Bless You. 🙏🙏🙏", "Cant we all agree that Life is TA here? This thing sucks all around for everyone involved. Theres no way to quantify who will hurt more, the family after the fact, or OP during the end. I think the right thing to do here is just honestly say.\n\nYou must do as your continence dictates, and i wish you luck and joy on your travels, wherever they may take you. Life Sucks. Thats my vote.", "I also think it’s a horrible burden to saddle a 17 year old with, they can’t seek support from anyone either l.  It’s terribly sad but at least OP can get support without parents knowing but a 17 year old can’t", "OP this is really important. It’s not your job to manage the emotions of the people you love. They will find strength for you and for each other.  Let them in.", "Just jumping in to say OP - it is not your job to cheer people up or make this better.  That is not on you.  AT ALL.  This is hard.  Let it be hard.  You will get through it together, but tell your people they need to take their need to be cheered up/vent/grieve to their support people.  You have enough to deal with without taking on other people's emotional health.", "your strength is really inspiring! thanks for sharing your grace with us, hope your last moments are your best", "I would also say a gentle YTA. My mom was given six weeks to live and didn't tell anyone. She had spent a lot of time before that denying that her condition was getting worse at all and she didn't want to tell anyone probably because she didn't want anyone to treat her any differently. I had no idea that she was terminal until she went into the hospital and even then, she told me she was getting better and was going to be discharged soon. And then the next thing I knew she was really sick, moved to hospice and gone less than 24 hours later. I was totally unprepared. I think it really sucked because if I had known we could have spent that last six weeks actually doing things together to make memories. I lived a couple of hours away and only saw her a handful of times in that time and all we really did was normal stuff. I wish I would have had the closure and I think that your family would want that too.", "I do have an associates in psych, but I really just went with what my heart said. It's something I've thought about a lot; whether I'd tell people if I knew I was dying, and how I would feel if someone I loved didn't tell me.", "One of the conditions of assisted dying in Switzerland is informing your loved ones of your decision.  It’s clearly stated on their website that they will not go ahead without this as they do not want to deal with angry family members after the fact.  If you want to go to Switzerland you have to tell your family", "And right now they think their 23 year old child, who was just on the cusp of a great career, has completely collapsed and they have no idea why. You have to tell them, OP. \n\nI know you're young, but imagine that you were married or had a child. How would you feel for the rest of your life knowing your spouse or child was suffering and you couldn't be there to help them? \n\nYour sibling is right. And no time like the present. I've had two friends die of glioblastoma and one of them waited too long to get their affairs in order. It created a nightmare for their family.\n\nHugs to you. ♥️\n\nYTA (for voting purposes only. I don't think you're an AH, just grieving).", "I agree with you. It's probably fiction, but I sometimes enjoy the willing suspension of disbelief required to really get into the spirit of some of these posts. It's kind of like reading a short story.", "I agree. This reads as fake to me.", "I work in a hospice house in Oregon. Some our patients use the death with dignity drugs", "She's not monstrous or unfeeling, no one is saying that, but you're being monstrous and unfeeling towards her family.\n\nWhile OP thinks moving to Switzerland to die is the way she wants to go out, her family might think that's an awfully lonely way to go. After all, what kind of parents would be happy to just watch their child move to a foreign country to die alone.\n\n It's completely fucked up to immediately put the blame on OP's parents for not creating an environment where she can feel safe to reveal this big secret. She's dying and yet she chose to move in with her parents; to me, that shows some level of trust and safety. Although, I feel like if she wanted everything to remain a secret, moving back in with her parents was the worst decision she could have made.\n\nThe worst part is I don't even see a compromise here, only to pray that her parents will allow her to live out her final moments the way she wants.", "It isn't a good option. I live in Oregon as well and you need two doctors to sign off on this and it takes awhile for approval. Here's a link with more information: [https://eolcoregon.org/dwd-overview/legal-requirements/](https://eolcoregon.org/dwd-overview/legal-requirements/)\n\nTell your family the truth. They deserve to know what's happening.", "Look up Brittany Maynard and her story about death with dignity in Oregon.", "Colorado, too.", "Soft YTA. Speaking from experience, it is way better to know beforehand to prepare yourself.", "I'm going to be blunt. YTA...but its a soft YTA.\nThis is an absolute shitty situation. \n\nIt sounds like you're trying to enjoy the time left living as normally as possible. That's totally fair. This is your life and it's your choice. Other people are commenting similar things i'm about to share. Yes you need someone who can advocate for you and support you. And by not telling them, you're going to cause more damage than good. You can still have great memories, and you can let them know your wishes. It's okay. It's okay to tell them you've made your decisions. It's okay to tell them you don't want any sad shit and that you just want to enjoy your time while you can. You're going to help them more by giving them great memories and letting them prepare to grieve. \n\nAnd now for a story:\n\nI had an aunt who was terminally ill. She was in palliative care, last days... you get it. 2 days before she passed, my mom, her daughters and i were all visiting with her. I got to share my secret with her that I was expecting my first. She couldn't move much, but she was thrilled. She was happy life was going on around her. We sat there, watching TV, her favourite show, and that was one of my happy memories with her. It was sad, but we were respecting her wishes to be as normal as possible (despite hospital palliative care). My mom and I knew she was terminall when she shared she had cancer (lung cancer, already stage 4, Mets to the spine) we had a chance to be with her, and had as many great memories as we could have. We laughed about old memories. Yes, it was bittersweet.. .but that honestly carried us through the grief. \n\nHer husband was in complete denial. He was convinced she would beat it. He was trying to make preparations for her to get transported by ambulance for vitamin c infusions because he thought it would cure her. His grief process never got past the bargaining phase.... its been 9 years. \n\nWhat I'm getting at, is that you can help them as they can help you. You may see these sad/happy memories, but I promise you, they will be cherished and the bittersweet side of it will turn to gratitude. \n\nYou have my sympathy. This is a shitty situation. There are a lot of people in here who can share what it looks like on the surviving loved ones side. \n\nI wish you the best.", "No one is the ahole.\n\nNo win situation.    It's op right to tell who and when,   but has decided ro make the grieving process of family and friends harder when Op is gone \n\n\nGrieving doesn't start after death,  but when Op finds out their diagnosis", "They deserve to know. Emotional preparation as well as preparing a place for you to live as you decline. I’m so terribly sorry for your situation and although you’re not the asshole, you need to come clean some time in the next month.", "Aggressively or assertively?   There is a difference?\n\nYou have moved back in with your parents.   If you are going to need their assistance,  you probably should consider the impact your illness may have on your family and  let them know what is going on.\n\nNTA I guess,  as you have the right to privacy.", "Having seen so many people being in the place that you are, I can understand where you are coming from. NTA, it should not be your job to comfort those who are around you, your energy should be on enjoying your last moments. You can tell them when you are ready, you have no obligations to reveal it to anyone before you are ready.  \nI work in hospice and palliative care.", "I cannot fathom passing judgment upon you as I cannot possibly understand your position. However, I do think you should tell your parents.", "I would say that very softly, yeah, YTA.\n\nNot because your desires are evil or cruel, but they are self-centered.\n\nIt's like the classic movie plot of trying to protect someone/people by keeping a secret but it is actually worse when everyone is good people, and they find out about the secret eventually anyway, and it makes them all feel guilty and horrible in retrospect for a bunch of stuff they did to try to help or said jokingly, that now looks horrible if the person was dying.\n\nThey won't be prepared to support themselves either because people are used to leaning on you, when at least if they know, they can go to therapy or grief counseling and find other supports that can help them prepare for a life without you when it comes.\n\nYou might not think you will be sensitive to it as well, but you might find yourself more sensitive to things as you get sicker - that you really won't be able to do X, or become Y, that you'll miss out on Z, and people will not understand your reactions if you break down crying or snap at someone to get off your back. These will seem understandable if they know, but like complete overreactions if they don't, and people might be pretty hard on themselves when they learn the truth when they look back on stuff like this.\n\nYou could also go downhill slightly faster or slower - if you start to go downhill faster, you may need a friend or family member to act as your advocate that helps you get everything done the way you want it done if you deteriorate rapidly or suddenly and become unable to do it by yourself.", "NTA, OP, but you’re trying to save them pain that will only be doubled when they no longer have you around. They will be sad, of course. You’re important to them, just like they’re important to you. But think of all the things you can do together that they might spend their lives regretting not doing while you were able. \n\nIt’s totally OK to sit down with them and explain that you understand their feelings but choose to focus on happiness in what time you have left—that you want to be happy with them, and leave them the gift of happy memories down the line. It’s also OK for them to have a harder time with that from moment to moment, but you’ve had more time to consider the situation. As someone whose parent was chronically ill for more than 20 years, I can’t tel you how many things I wish we could have done before he became too sick. I wouldn’t have missed him any less, but the memories would have helped both of us once his condition got worse.\n\nWishing you the longest and best time remaining, and whatever kind of miracle you prefer—whether it’s simply your family’s ability to understand or a thrilling bucket list or daily cake and ice cream, you’re in my thoughts. ❤️", "If you coulda kept it secret, I woulda said maybe it’s ok, but cats outta the bag and you cannot expect your sister to carry this load now.\n\nI understand where you were coming from, but, I don’t know if you realized that while your idea sounds nice, likely, there will a time they realize what’s going on and are going to be heartbroken.", "For the love of all holy. TELL. THEM.", "Gentle YTA\n\nyou cannot leave this on your 17 year old sibling.\n\nBefore them knowing, it would have been ok for a little while...but now, secrets out and you cannot make them suffer in silence.", "Your parents will be sad that they didn’t know those were the last months.  Unfortunately we take life for granted and don’t make the most of it a lot of times.", "YTA not for being sick, but for asking your teenage sister to keep this secret for you. I know you didn't tell her on purpose, but the cat's out of the bag now and you need to take responsibility instead of placing that burden on your sister.", "To the OP - I am so, so sorry for what you are going through.\n\nThat said, I fully expect Sis to spill the beans to everyone, about all of it. Very shortly. Get ready. I'm sorry.", "YTA. Now that your younger sister knows, it is terribly unfair of you to expect her to keep this secret.  I understand the conversation will be painful, and the aftermath will be hard too.  Of course you don’t want to see your family in pain for months.  Of course you want to grasp whatever semblance of normal you can reach.  But you baby sister knows, and she can’t talk to anyone and receive the love and support she needs because you are forcing her to keep this secret.  And your are forcing her to keep this awful secret from her family, maybe even lie for you.  She must feel so conflicted right now, and sad, scared, confused…. You are also denying yourself love and support as you deal with this devastating news.  Talk to your family, tell the truth, cry your hearts out, then live and love one another.", "NTA\n\nYour time is finite regardless of what the immediate future may hold. Enjoy what you have left, Always remember, you are under no obligation to stick it out to the bitter end.", "I can’t call you an AH, but please don’t do that to your sister.", "I don't believe this is truthful. \n\nWith that, YTA.  They are your parents.   You tell them.", "Nta.\n\nYour life. You choices.\n\n\nBUUTTTT\n\nI think you should tell them. The support alone would be good. \n\nAlso, hugs.", "I don’t think YTA is appropriate here, but let me say this. Some of the best moments, happy and sad we’re in the last year of my loved ones life. Knowing what was coming helped me grieve and prepare myself for when they were gone.", "You sound like you're trying to come at this scary and difficult topic from a purely logical angle.\n\nSo, heres some hard logic.\n\nWhen you die, your problems are over. But your family will keep living on after you. They will need time to cope and grieve, and they may even feel guilty for \"not doing enough\" for you in your final days, regardless if it's true.\n\nSo I have to give you a very soft YTA, for not giving them a choice in the matter.\n\nTell them when you're ready, sure. But don't try to play the \"I'm just sparing them pain\" card. People will feel how they'll feel, and you can't change that. So please, LET them feel!", "YTA. Maybe have some empathy?", "I totally get what you want but, you should tell them. Don’t let them find out because you’ve gotten to the point where you’re about to go or they find out by accident. Don’t do that to them, it’s not fair. Tell them so everything that needs to be said and done is said and done but insist that  it doesn’t leave your house. I’m so sorry.", "I hesitate to call you TA, but it isn't only you this will affect. Your family will be your caregivers at the end. Your family is going to be dealing with losing you. It's better to give them time to prepare now.", "NAH. Denial is part of the process. But you have to tell them as they will find out eventually. The longer you wait the harder it gets.", "NAH\n\nI can see why you wouldn't want everybody to be sad around you for the rest of your life. That being said, your eventual decline and disappearance will leave them blindsided, hurt, and so much more broken. Not to mention having to make sudden funeral arrangements and handle your unfinished business (debts and worldly possessions).\n\nIt's your life to live out as you see fit, but any choices you make will have long-term consequences.\n\nI'm so sorry you're having to go through this. I wish you the best, however this plays out.", "If it was me, I think I’d want to enjoy every remaining day I had with my friends and family and so I think I’d keep the news from them for as long as I could, so it doesn’t over shadow my time with them.\n\nHowever, I’m assuming your terminal illness will become clearer over time and so you won’t be able to keep this from them forever.\n\nHave a plan for how and when you want to share this news. NTA but don’t keep this secret until it’s apparent something is seriously wrong.\n\nI wish you the best for your remaining time and so sorry this is your journey.", "But the family has questions and.concerns, hunches, feelings...about how u r behaving. 🤔  ? You likely are tired? And how wierd that u quit work and are not looking for another job? Or doing much of anything?\n\nLittle sister is acting wierd..she seems so...worried..you look ..pretty, yes..but..perhaps pale..and your appetite is ..off?\n\nI think u need to let them know. I get what u r trying to do but it can't be done like that. I don't think", "my pov is that it’s your life, your decision, honestly, nta.\n\ni’m so sorry that you are going through this, i hope you can fulfill everything you desire before anything happens. if u allow me to, i’ll pray for you tonight. in the meantime, i’m sending you love, light, and strength.", "It's everyman's dream to die for a great cause not to a disease. My condolences to you. But YTA . Imagine what your family will feel when you're gone and they'll blame themselves for you not having enough trust to tell them.", "NTA but also kinda TA. \nIt’s your illness you have all the right to live and die the way you want. But honey, things are not so black and white. Even though it’s your life your parents and family are part of it and youre part of theirs. It’s like it’s all woven together. \nYou will be gone but they will live on with pain of losing you. I cannot even begin to imagine what it must be like for you to get this horrible news and I know you’re dealing with it the best way you can. But they will always live with great pain in their hearts that they couldn’t spend last moments with quality.\n\nSleep on it and take best decision possible. Send you internet hugs.", "NAH \n\nWork with your care team, which hopefully includes a counselor, to figure out how to talk with your family.  Let family care for you.", "NTA, if you don't want to tell they rn, then you don't have to. But eventually, they will find out. It's best that it comes from you before anyone.", "As someone who’s parent didn’t tell them they were dying, I implore you to tell your family. The rest of my family knew but I didn’t and it really fucked me up for over a decade. \n\n1. You shouldn’t have to go through it alone.\n2. They love you and even though they will be sad, they will want to be there for you and will have much more anger if they don’t get to know these are their final few months with you. \n3. It might be hard to deal with their emotions on top of your own, but it will make it easier for them to deal with your loss.\n\nSending love, light and eternal happiness to you ❤️", "No judgment from me but I just want to say you awesome and I am so sorry for what you are going through and I totally look up to you and how strong you are! You are incredible ❤️", "Last November, my mother and I, who have always had a complicated relationship, got into a FIGHT. Like, I couldn't speak later that day due to all of the screaming kind of fight. After that, we exchanged a little small talk, but didn't have a real conversation. \n\nLast December, my mother fell and hit her head at 9 pm on a Monday night. By 5 am Tuesday, she was dead. I now have to reconcile my grief with the fact that the last time I said more than 3 words to my mother, they were in anger. If I had known what was to come, I would have made things better.\n\nTell your family. They deserve to know. You deserve to have them know. Leave this world knowing that none of you will have any doubt of your love for each other.\n\nI'm sorry this is happening to you. I hope you find peace.", "I truly don’t think this is a scenario for this subreddit. If I were making a judgement I’d say YTA (gently). You need to talk to a counselor because you seem to be in denial about your prognosis. Then you need to be honest with your family. Your parents, siblings, grandparents, etc all clearly love you and you need to be honest with them before it is too late. Don’t leave them like this.", "You are not the asshole, but please tell them. My brother died when he was 27 years old and I know it is going to be hard, but it's your family that is going to wish they spent more time with you before it got too hard for you to do anything. Give them a chance, they have more time here at the end of the day, to deal with the loss.Either way I am so sorry this has happened, and I pray that you are healed or given more time than that. My brother was my best friend, and I had a hard time maintaining composure when I learned of his illness as well. I am so sorry you are going through this. \n\n&#x200B;\n\nYou sound like my brother too, as he was also the one everyone went to... even my parents. Let me tell you, he lives on in our hearts. I still read our texts, I still watch videos of him, cry about him, laugh about him. I know you are probably going through a wave of emotions 24/7. Everyone knew my brother was sick, and he still found a lot of happiness in his last years. I think giving them time to prepare to take care of you will make that part of it - that you arent at yet, more comfortable for you. I knew my brother was sick, but I honestly wasn't prepared to see him in his last days, the way he looked so sick. I walked in and then walked right out of the room shocked. I had time to prepare (5 years) and still couldn't handle the emotions that came about when I had to accept he would be gone soon.", "NTA, it is your choice who you tell, but I don't think your sister is going to go along with that. Of course, she should mind her own business, but probably won't.\n\nTake care, I wish the best for you.", "It's your life but you should arrange a letter to them to be sent for after you pass. They will need some closure which you are withholding for your own benefit. The least you could do is succinctly explain that you knew all along, that you did not want to undergo treatment that does nothing but provide pointless hope for them and not you. NTA.", "i'm so sorry, NAH but you are going to have to tell them eventually. not telling them and dying without them knowing why will hurt them so much worse", "My sister did this. I don’t think she was an asshole for it and I don’t think you’re one either. But I really wish I had known to prepare myself. I found out on Facebook along with just about everyone else.\n\nWe were on decent terms, so I don’t have any regrets about our relationship. But she’s just gone now. No funeral. No memorial. No closure. Just a sort of hole in my life where she used to be. \n\nI’m really very sorry about your diagnosis. I wish you peace.", "NAH.  \n\nOP, please tell your folks.  I don't know your family dynamic. I do know it can be exhausting and disappointing how other people react and display their grief.  I get where you are coming from.  And even so, please tell them.\n\nI've got a kid that just finished her regimen for an aggressive metastatic cancer.  I don't know what the future looks like and sometimes it feels really overwhelming but I've done my best to be honest with my daughter that YES this is hard for me emotionally too, but not to burden her with my feelings and worries (I share those with my sister and friends), all the while working my tail off to try to optimize anything I can related to comfort or happiness, for her or the rest of my family, and doing that brings ME great joy.  I hate this situation, and also there is nowhere I'd rather be than present for my kid, dealing with this with her.\n\nLet the people who love you live this with you.", "I'm so sorry.  It's your choice if and when you tell someone. I do recommend telling your family. They need time to come to grips with it. It should come from you and not your sister.", "Mild YTA. Communication can only help you now. As it stands, they are very confused as to why you gave up the very good job and moved home. They will get the wrong idea about banal things like  “failure to launch,” etc., when the truth is so much more serious and important. You have an unassailable reason to move home, and if you share it with them, they can be there for you. You can tell them you don’t have the spoons to cheer them up, but you do want to create as many moments of  joy as you can while you can.", "YTA. Not allowing your family to greave is shitty.  Stop being selfish", "Yta. Now that your sister knows you can’t keep it secret any longer. It isn’t fair to her.\n\nGet a therapist. Tell the family. Then work with your therapist about enforcing boundaries with your family if they are toxic or dumping their drama in you and expecting you to take care of them.", "I don’t know if I should leave a judgement, because I am conflicted, but do know that sleeping a secret now may leave your sibling in a very bad spot.\n\nIf they listen to you, and keep your secret, they can live with the fact they knew that secret forever, or face your parents and tell them that they knew their child was dying and said nothing. If they don’t keep the secret, they might feel responsible for every negative emotion or outcome that comes out of those conversations.\n\nMaybe the situation was more nebulous before, but it’s changed since your sibling overheard you. Consider if that is enough to change your outlook.", "YTA. I lost my brother last year and he didn't tell us he was sick. He hid doctor appointments and x-rays and blood tests from us. He didn't reach out and didn't spend time with us or let us know what was going on. We didn't know he had died until 4 weeks after the fact. His body was so bloated that we couldn't even see him one last time. He had to be cremated immediately. The coroner couldn't even tell us what killed him but definitely said it wasn't homicide or suicide.\n\nWe asked ourselves for MONTHS after, why didn't he tell us? What did we do to make him not trust us? Did he know how much we loved him? We could have given him money to help with treatments. We felt so much guilt that we couldn't eat or sleep properly. I had nightmares. We could have been with him when he died and surrounded him with love. Instead he died in his apartment by himself thankfully in his sleep.\n\nDon't do this to your family. Don't make them feel the same way my family felt. I feel empathy for what you're going through but when you leave this earth, your family will remain here to pick up the pieces. Give them time to come to terms with your diagnosis. Go to therapy together. Make sure they have grief counseling set up. Please don't do this to them.", "A dying person needs help and your family needs time to prepare. Please tell them. It’s to big to carry alone.", "NTA. What a shit deal. But I think the cats out of the bag now and it’d be a lot to expect your sister to keep it to herself.", "You want an end filled with happy times, but without telling them it’s the end how do you parents know to take some extra time off work and spend time doing fun things with you.  People say to live each day as if it were you last, but there are definitely differences when the end is near.\n\nAs a parent of little kids, if I were to find out one was dying I would stop really caring about school attendance.  Just pull the kids out some days and go to the park/zoo/science museum.  Don’t waste time on homework, we’ll watch movies instead.  College money is getting blown on a trip to Disneyworld.   \n\nDo you want to spend your remaining time arguing with your parents about how irresponsible you’re being.  Do you want them to just go to work every day and not understand how important some extra days off are?", "Big NTA. Are you going to die, yes. So is everyone else. Not like we can look into the future and see it, just to tell everyone \"hey btw in 3 years I'm going to get hit by an off road emu being chased by murder robots, just a heads up!\" It's up to you what you share about yourself and how you want others to be the last few months. If your sibling kicks up, just say \" ok, but your in charge with all the tires, and melodramatic emotions after, good luck. Unless you just want people happy for the next few months.\"", "Jumping on this thread too. I’m less than a week and a half out from a major surgery that is the only way to find out if I have a very rare and aggressive cancer that has some darn grim survival numbers—or if my care team is wrong and we’re thinking zebras when it’s actually horses. \n\nAnd honestly? I have HATED telling my family and the few friends I’ve filled in. I hate feeling like I need to manage their grief while I’m still swinging between wanting to scream and needing to cry by the hour. \n\nThe thing is, not telling people? Going all head-in-the-sand? It doesn’t make the reality go away. Your diagnosis will still be there, and while you might be able to make your own peace in private, the people who love you are going to be blindsided by the grief and denied the chance to come to terms (at least a little) in advance. \n\nI know you want to make happy memories, and you still will. I promise.", "It’s also worth considering that if they don’t know you’re sick you could in a sense be depriving them of the last moments of their life they’re ever going to get to spend with you \n\nThat kind of thing can lead to a lot of regret and mental health issues that people can suffer with for years after you’re gone", "I’m going to say NAH but you should at least tell the family you live with. If you don’t want friends or extended family to know you can make that clear to them, but the family you live with will see what is happening to you and it will be very hard for them not knowing what is going on or what to do. Go at your own pace but definitely tell them while you can.", "I assume you live in America. If so:\n\nAdditionally, you should ensure that you are covering your own medical expenses and taking credit cards out in your name to spend on your purchases. Ensure that they are in your name, and your name only. Student loans that they cosigned for? Transfer it to a different company under your name only.\n\nOnce you die, your debts die with you. As long as your folks aren't on the loan/card/whatever, and have not spent a dime of their own money to help you pay it off, they are legally not entitled to pay that cost.\n\n\nOnce they pay even 1 cent of the debt you once owed, they are obliged to pay for it. I'm sure there's more to it, so it's best to research all you can and even consult a lawyer to ensure it's all legal.", "Wishing you whatever type of miracle you desire. You’re in my thoughts. ❤️", "This!!  I’m so sorry you have to go through this, but trying to go through it alone…oh, honey, this is what your parents are here for!  I’m sure if you tell them your wishes, they will do their best to honor them.  Please allow them to be by your side and get the closure you all deserve.  This where having a loving family can be just that.", "Yes. This plan isn’t going to do what OP wants it to do.", "I was going to be gentle until I saw this: YTA. \n\nYes, this should be your decision, but you are going to completely destroy your family in the process. They need to know, even if you have an end of life plan. You're going to leave behind resentment, anger, sorrow, and it will be directed at your sister. That is not fair to her or your family. You need to tell them the reality of the situation.", "Gentle hugs to you OP. You are NTA. You are not responsible for the emotions of others. You are not choosing to cause pain, you are dealing with a very painful situation. You didn't choose your illness to cause pain to others. This article might help:\n\n[Ring Theory](https://www.psychologytoday.com/ca/blog/promoting-hope-preventing-suicide/201705/ring-theory-helps-us-bring-comfort-in)\n\nBasically, you are at the centre of the ring. Your closest friends, family, are in the circle around you and then people who are less close are in progressively further out rings. Comfort goes inward, venting, complaining etc goes outward. You are dealing with enough and your family does not get to dump on you. They reach outward for support and they do not allow others to dump on you either. They have a right to all their feels and pain and emotion, but they should not bully you with it.\n\nI wish you peace and relief.", "Honey...no. YTA.\n\nMy mother was sick and died unexpectedly. If she had known she was dying and robbed me of even the chance to have a funeral with her body because she fucked off to a foreign country to off herself? I would be angry at her forever.\n\nIf this is real, please, please do not do this. Dying is horrible enough by itself without being alone in a foreign country and no one you love knowing that you are dying.", "jimmy carter is literally in hospice care rn, bad example (also inappropriate for this discussion)", "The only problem with this, OP, is that those memories are going to be overshadowed by guilt and unexpected grief, and probably anger. Losing a child, no matter their age, haunts parents no matter what but it’s so much worse when unexpected, and worse still when it was actively being hidden from them. If you don’t want to undergo treatments that’s certainly your choice, and you might want to work with a doctor, a family friend, or a counselor to work out how to explain to them that you have considered your options and need them to respect your choice. \n\nPlease give all of you the chance to make memories that will be all the more treasured for them being aware of the situation and able to feel they helped you by respecting your decision.", "Consider leaving a letter that they can receive upon your death. This way you can explain all your reasons why you're doing this the way you chose to; how you think the best use of their time with you is to make happy memories rather than worrying; that these were your wishes and you wanted to protect family rather than hurt them; how your sister shouldn't be blamed for anything but just the opposite; how you needed to do it this way for your own mental health and peace; how much you love them, etc. This should help mitigate their grief and prevent anger and frustration after you're gone.", "How does me having a savings doesn't add up???\n\nI went to college on a scholarship and been working small to part time jobs since I was 13 my parents build a work ethic in me and taught us to save half of what we earn rather then just spend it since  we were little and build a small savings for each of their children. \n\nI was fortunate enough to be able to take a course on investment which taught me how to double my savings. \n\nSwitzerland and New Zealand are the only two places I heard of doing what you want to call a \"silent death\" mind you my diagnosis has been pretty recent and I'm still trying to plan things out.\n\nI haven't had the chance to do much research because I been busy organizing my move back in with My parents, you can't just pick up everything and go especially when you made Arrangements with other people such as your roommates to be living with them for a certain period of time.", "You will never have your thoughts completely in order to deal with telling them but it's super important that you do.", "As someone who lost a family member to a GBM 10 years ago, I'm so sorry about your diagnosis. If it's any consolation at all, the relative in question had a very good quality of life up till the end with no pain, memory loss etc. Even on the morning he died we were having fun together and the end was peaceful. You might only have a few months left but there's every chance you'll be able to make lots of good memories with your loved ones.\n\nIf you do go down the assisted dying route, I would warn you that with my family member, his mobility changed VERY quickly. If you have to travel you might want to make provisions in case your mobility deteriorates to the point that you can't get there alone.", "I was shocked at how fast it could be. Last month a relative of a dear friend found out that he had brain tumours, he was 76. My friend said he knew he wanted MAID, started the process, saw the first doctor on Monday, the second on Friday, chose to die on Sunday. It was less than two weeks all told from when he was diagnosed, in Ontario.", "No. \nIn this situation you are dealing with this situation the best way you feel you can. \nIt seems like you have a family willing to love and support you, but no one can tell you how to live your life, so the likewise role of death follows that same suit. \nI can understand having a last bit of control on your life, with what’s left. Family needs to respect boundaries set by those who need them. Tragedy doesn’t give anyone a “free pass” from the past. \nI’m sorry for what you’re going through. It can’t be easy for anyone. Stay strong and I wish you all the love and support you need.", "I think you should let your parents know.", "OP you need to tell your parents.\n\nAs you have terminal cancer things could progress fast. My Nana went in for a scan in December of 2021 and it found nothing, in February she was experiencing pain and they discovered that she had two cancerous tumors growing on her bowel and another somewhere else during a scan late February. When I was able to visit her in late March she was refusing food, had to be gently coaxed to eat pudding and applesauce and take sips of water/juice/soda by her daughters and hospice nurse. She died the beginning of April.\n\nI was able to grieve her death in a way that I hadn’t been able to grieve before as I had made peace with her impending death and had grieved the lost opportunities; I hadn’t grieved a grandfather’s impending death and I struggled, I only had days to to come to terms with my Grammy’s death and that was hard.\n\nThe sudden death of my older sister was like a gut punch. It didn’t feel real and I was half convinced that it was a super sick prank being pulled on us and she was just really sick.\n\nIf you don’t trust your parents to act in your best interests you need to get someone who will to help you make plans.", "No YNTA if you're everyone's rock, it's horrible if you have to cheer everyone up if you're the one ill.  You deserve to be happy and free your last moments and not give a F how everyone feels, people are selfish and will make your illness about them. I wish I knew you, i would go out if my way for you.\npeople need to do everything possible to make you happy in your last moments instead of putting out grief. If you don't trust them to focus on your personal happiness then F'EM.\n\nI'll add, if you want to be 100% sure you're not the A. \nTell one close friend, set a will, cremation and delivery up in advance, especially if you have the funds. Have that friend go with you and bring you home from Switzerland.\nPlease do a goodbye video for friends and family and address the people you care about in it.\n\nLastly second opinion. My doctor told me I was dying from kidney failure and had a year or 3 max to live. I said no fn way test again, he was completely wrong. No guarantees but better than giving up.", "Your life, your death, your story.\n\nIs there still time to tell your sister to STFU or you're taking her with you?\n\nI have a very painful and debilitating disease. I hate to waste my time talking about it and it is so annoying to have to listen to other people's endless comments about what I should or shouldn't do, and what other people (strangers to me) did or didn't do.  And they mean well so I have to be nice.  Argh!", "I’m not going to call you an AH. I can’t imagine what you are going through. First have some grace on yourself. You do need to tell your family but in your own time. And set boundaries when you do", "Get a send opinion also", "As someone who has had to be a caregiver for my mother… you will need the support of your family. Things will become very obvious before the end. Please give them the chance to prepare as best they can. Please don’t blindside them with this right at the end. Give them a chance to intentionally enjoy their time with you.", "NTA. Your reasoning is sound", "YTA. A friend of our family did the same thing. Only a couple of is knew and she swore us to secrecy. When it was obvious she was going to die (about 2 weeks to live) people were upset with her. They were also upset with those of us who knew and didn’t say anything. Some very hurtful and vile comments are still coming our way because there was so much her loved ones could have said or done if they had only known. \n\nOn the other hand a friend of mine from college was diagnosed with terminal cancer and he told everyone. He wanted to see as many people as he could and make the best of his time on this earth. When he passed there were no regrets by anyone and no one was mad at anyone. We all grieved his loss but were glad he was no longer suffering. \n\nThe friend who kept the secret left a lot of hurt people in her wake and now there’s nothing anyone can do about because she is gone. \n\nEmbrace the time you have left with all of your loved ones.", "Put yourself in your parents shoes. You would want to know information like this about someone you love. It helps prepare. Make a plan. It can help you and your family feel some what in control. \n\nI lived 1000s of miles away from family. I found a lump. Could have been cancerous, could have been benign. I had surgery. Fortunately everything was okay. lump removed, no cancer. When I told my family that were hurt that I didn't let them know before hand. I was trying to save them from worry. Frantic travel to sit and wait. They wanted the chance to hug me, say they love me before I went under the knife. \n\nTrust your parents to want to help. Let them know you don't want your last days to be maudlin. Make a bucket list of fun things to do & get them to help you do it. Those are happy memories.", "I’m so sorry for what you’re going through but you need to inform your family especially when your sister is already burdened with that knowledge. I wish you and your family the best from the bottom of my heart.", "NTA everyone deals with end of life their own way. Do keep in mind that your parents will find out relatively soon. Your telling them will make them sad for a sort time but the beauty of it is, they will not have to live the rest of their life sad because they didn’t say this or do that. There is actually value to families and/or together to help someone transition. It’s kind of a beautiful thing I know for me my Dad died within two weeks after he got sick. It was a complete shock to my system, and it took forever for me to recover. My mom died over a period of years with dementia. I was far more at peace with her death because I didn’t have the time with her and I knew it was short.\n\nI only suggested this is something to think about. In life you have to be sad. Sometimes it’s inevitable. I spending that quality time is a gift.", "A gentle YTA. you live with them. They are going to be far more freaked out when you start showing signs of decline and they don't know why. You need to prepare them. If you aren't already,  call hospice and get set up. They can help you and your family have peaceful life...", "Your illness is your business.  You deserve the chance to say happy goodbyes, rather than tearful ones. I hope you will be able to help your sister understand that.", "I’m not going to call you an AH, this is way way way above this subs paygrade, but you probably have to tell your parents. First off you’re living in their house and probably making them very nervous already. Also, as someone who lost a sibling and was there for every second from them getting the call to the burial to 5 years later, this will be the worst thing that’s every happened to your parents, and they deserve some time to come to terms with it as well. I don’t say that to make you feel guilty, but I don’t think there is anything worse a human can go through emotionally, mentally or spiritually than losing a child, maybe even physically because neither of my parents ate a bite of food for days. It’s hard but it’ll be harder for everyone, including you, if you wait until it’s already the end", "I'm going to go with NTA because I think you need more time to process solo. But you will need to eventually tell them. And if you don't then YTA.", "NTA. As someone who counsels people who are terminally ill, I advise others to respect your decision on sharing your health status.\n\nIf you don’t want to discuss this with your family, it is probably best that you start making provisions for your death.  This includes coping with the grief of terminal illness, logistics of handling your body after death, ensuring undesired attempts at futile medical care are avoided as you die, and advice on helping your surviving family with their grief afterwards. \n\n-Ask your doctor to help with end of life planning, grief counseling for yourself, and recommendations on grief counselors for your family when the time comes. \n\n- If you plan for the assistance in dying route, be aware that the process can take several months and contact the relevant clinics now. \n\n- Prepare a living will for when you are critically ill and actively dying. This will avoid unnecessary attempts at intensive care, and lessen the grief of your family by unburdening them with final decisions regarding your life. This includes a do not resuscitate order if you wish, and also more detailed instructions regarding terminal feeding, etc if you are incapacitated. Your doctor can help you with this.\n\n- please consider writing some type of goodbye message to them. It will help them understand your desire for privacy, and maybe help them come to terms with the inevitable end of your life. This is particularly hard for family members who are not involved in medical decisions. They may feel that they could have done more, even if that is not possible. A grief counselor can help you with this, and help process your own emotions at the same time.  \n- Also, I would recommend getting at least a second opinion on whatever your illness is to make a truly informed decision about plans. Though informing a patient about a terminal illness is never done lightly, it is important that the diagnosis is confirmed.", "NTA\n\nFinding out you're terminally ill is a huge deal. That takes so much time to process. \n\nHOWEVER, time is of the essence and you're not alone.\n\nCOMMUNICATE", "As a mother, if one of my children told me they only had a year to live, the way I choose to spend my time would change dramatically. I would want to spend all the time possible with them, making memories and helping their last days to be meaningful. I’d probably take a leave of absence from work, go special places with them, etc. By hiding your illness, you’re cheating your parents out of being able to do that.", "I read a story, fiction, about someone who was on the other side of this. They watched their family member go through illness and refuse to talk about it, refuse treatment, and refuse help. When the story ended, the only question left was, \"Why did this happen?\"\n\nIt was based a on real story in the author's life, about their grandmother who decided to forgo cancer treatments since it would only add another year or so to her life. IDK how old the grandmother was, but if she had been healthy another decade could've been an option. The author of this story had to watch as even that year was taken away. The grandmother refused help from everyone, kept the diagnosis a secret until the seizures unveiled it for her, and by that time the only thing the family had left was memories of the grandmother in a hospice bed. They'd had no time to come to terms with this before she died.\n\nYou have the right to keep this a secret if that is your wish. I will never call you an asshole for that. Everyone deserves dignity in death. But do consider that if you keep this a secret, your family will live with what-ifs forever. They will never know if they could've helped you. They won't have any involvement with your treatment, and they won't know if they could've made you comfortable or happy. They will never understand your choice, and they will regret anything even slightly negative that happens just before the end. They'll regret not springing extra money for the delivery guy to get food instead of driving to get it themselves, because it meant they lost 20 mins with you.\n\nWhen your sickness gets bad enough, there will be a lot of anger here. Some might be directed at you. A lot will be at your sister. Your doctors. The universe. A god, if you believe in one. Your family will not understand. They will be confronted with grief very suddenly and that is never a pleasant surprise for anyone.\n\nI'm not going to say that your should give up your comfort for them. If you would still rather keep this a secret and die without them knowing why, that is up to you. But the fallout will be dramatic if that is your choice. Your sister will get a lot of blame and the fractures in your family will live long after your death.\n\nIf you can have peace with that, so be it. But I suggest you tell them.", "I can’t in good conscience call you TA here, but I think you’re going to have to tell your family. Letting it be a shock that comes out of nowhere would be cruel, and they’ll want the chance to make the next few months great for you, and not have regrets later about not doing things to the best of their abilities. Just explain to them your desire for things to be as normal and positive as possible. And if you don’t tell, your sister is going to eventually crack, as that’s too big of a secret for her to keep for long.", "NAH OP is allowed to die how she likes. Would anyone’s family want to know, typically yes. That doesn’t mean OP or anyone else has to tell them they’re sick.", "YTA because you’re going to break your mothers heart if you just drop dead. Tell them so they have time with you. Write them letters to read when you’re gone. Make memories together.", "I was told by my father to not let my sister know the severity of his sickness. When she finally knew, she flew out to see my father on his deathbed. She was too late, by an hour. I regret this decision.\n\nGentle YTA. Please tell your family. They should know.", "I’m very sorry this is happening to you.  But… you have to tell them. It’s the right thing to do. They will be shocked. Not knowing might make them crack up! They need to hear the news from YOU!  Not Sis.", " NTA- don’t listen to anyone in this sub. Including me lol. You do you.", "YTA You need to tell them. It would be different if you were estranged but you are living in their house. It sounds like you have a fairly loving relationship. \n\nThey will find out eventually, even if it's just because you'll become so ill that they will notice. Imagine how they will feel, knowing that you could have told them and didn't want to. It will be worse tenfold in the unlikely event that you drop down dead. \n\nAdditionally, your days are more likely to be happy if you tell them because they won't try and hassle you into getting a job.", "In addition to that, the speaker phone kind of made the decision for OP. It’s not fair to their sibling at this point to make them keep the secret.\n\nI understand OP’s original plan. If it were me, I might take a few months to process it all and enjoy “normal” life as much as possible. To appreciate and love  your family without constant pity. But, I’d tell them after that few months.\n\nPerhaps OP can ask the sibling to keep the (awful) secret for a few weeks with a promise to tell the family afterwards.\n\nAbsolutely NAH", "> Your parents and loved ones need to know so they can be there for you.\n\nWhat if OP would rather not have every loved one acting differently towards her during her final months? Sure her family may not agree, but she's the one dying, she should be the one choosing how she goes. If she prefers to prolong the inevitable until the very end, that's her choice.\n\n> since you are going to rely on them in the near future to help take care of you.\n\nOP intends to go to Switzerland and be euthanized before her condition starts to get worse, so she actually intends to not have anyone having to take care of her", "Second opinion", "Thank you for sharing your story, I'm not gonna delay telling my parents any longer.\n\nI'm just super terrified like I never been this scared of anything in my life and I don't know if this is normal...but reddit is really helping me put things into perspective, telling them seems as if it'd be more compassionate to both them and myself.\n\nI'm even thinking of just telling my parents tomorrow.", "Thank you.\n\nReading through these comments already was leading me into thinking I was wrong for wanting to keep my cancer a secret but this one really sealed it for me.\n\nIt's gonna be really hard for me but I'll tell them as I know in my heart it's something that needs to be done.", "Please see my post about the logistics of this. It’s important to begin planning this now, as the time to prepare for assistance in dying can be long. Also it’s worth asking your doctor for help with grief counseling and navigating the end of your life, both psychologically and logistically.", "Wishing you love and strength.", "You're doing the right thing. 🩷 They will be able to enjoy all the time with you to the fullest once they understand. It'll leave less room for regret.", "Also what do you think would happen to your sister for having to keep this knowledge to herself?  Do you really want to do that to her?", "Be gentle to yourself. I always tell my patients and their families: there is no absolute right or wrong. There is only what's right for each person. What you're feeling is completely normal. What could be more normal than to be scared, upset and shocked by such news? When you are overwhelmed by your own emotions, it's very reasonable to worry about those of others, especially the ones we love. \n\nI wish you the very best. Please feel free to message me if you feel it would be helpful.", "Take heart. You can do this.", "No I don't, I was selfishly not thinking about my sister... I kinda just went into panic mode... I feel really bad now, I'll make it up to her she doesn't deserve this", "NTA. You wre doing the right thing. Overall, I’d still contribute to the family household and maybe get a part time job to contribute and seem less “suspicious» to your parents. Bjt definitely don’t tell them until you wre in Switzerland; all of these issues you can discuss in your final letters/vodeoe for the family.", "Don’t be hard on yourself, you have a lot going on. Hang in there. ♥️", "so sorry about your prognosis. may the rest of your days be filled with much love. wishing you well.", "\"She's not monstrous or unfeeling, no one is saying that.\" \n\nThe comment I responded to said: \"what she is contemplating...is nothing short of monstrous. It is callous and cruel and shockingly unfeeling. There is no excuse for it.\"\n\n\nNo excuse? Being 23 and learning you're dying soon is a pretty good excuse for someone to not be in their normal mindset and coping in ways that seem off. I don't see cruel intentions here, just someone who is afraid of suffering a lingering death and still processing and trying to figure things out while handling what is probably a great deal of existential fear. I think some empathy and consideration wouldn't hurt in regard to language choice.\n\n\n\"It's completely fucked up to immediately put the blame on OP's parents for not creating an environment where she can feel safe to reveal this big secret. She's dying and yet she chose to move in with her parents; to me, that shows some level of trust and safety.\"\n\n\nIf not her parents, whose responsibility was it to make sure she felt secure in confiding to them? I don't think it's unreasonable to point out that this kind of mentality doesn't come from nowhere, and she even mentioned feeling stressed about likely needing to be their support. If they truly care, they will need to focus on how to best make her feel secure in the time left rather than nurse any sense of being personally wronged.\n\nPeople are being rather harsh on her for being understandably self-absorbed and lost right now.  She hasn't put any actual plans in motion, and she's also acknowledged she shouldn't let her sister bear the secret alone for much longer.\n\n\nLastly, her moving back was likely out of necessity. She mentioned at the beginning that she barely got the chance to enter the workforce, having only just three months of job experience after finishing her internship. It does indicate some level of trust and safety as you said, though I think \"feel okay returning home to parents when dying\" is a tragically low bar for praiseworthy parenting.\n\nBased on her responses, she will likely tell them after a period of reflection. Realistically speaking she'll need help from her family to even do the Switzerland thing if she wants to. I'm sure most people would prefer to go that way instead of suffering, and it's infinitely more selfish to try to insert your own feelings into how someone else wants to die, especially when it comes to terminal illness.", "Please tell your parents. They may be able to advocate for a second opinion or other resources that could help. They also need to prepare to help you. I know this is rough. I'm so sorry.", "YTA \nYour family will wonder what they did wrong and why you didn’t feel comfortable telling them. That compounded with grief can be detrimental.\n\nAlso, if you aren’t working do you have health insurance? If not, won’t your family be stuck with that debt?\n\nLastly, you aren’t allowing them to have joy and happiness with you in these last months. When you know someone is passing it’s easier to let the little things slide. Fights and arguments aren’t worth it. You cherish every last moment.\n\nI’m sorry to say YTA… that’s just the sub reddit. I think selfish and naïve are probably better terms.", "HUG!", "It is totally up to you, however I know that from a loved ones’ standpoint, knowing would be better. I lost my aunt last year at the age of 39, and I truly regret not preparing for her death. It is important to mourn with your family, so that when you do pass, you know you are on the same page, and not leaving your family in utter shock at your departure. So sorry to hear your story, and stay strong♥️ the best thing you can do is make sure your family knows you are are leaving on a positive note. It sucks to know your loved ones’ last moments were full of pain and self-loathing.", "You will hurt them much more by not telling them. It will be an awful shock, instead of something they’re able to prepare for. So you are indeed doing this for selfish reasons\n\nAlso, you’re not giving your family the chance to support you properly and help you mentally work through what you’re going through. How will it be better to constantly lie to them and deal with their false hope?\n\nYou’re understandably not dealing with this well, so I’m going to say NAH", "NTA You aren’t the asshole but, tell them!  If you don’t there will be moments they will regret not spending time or doing things with you. They may be sad about things but giving them the information will allow them to make decisions to spend more time with you and not regret a moment lost due to not knowing.", "Speaking from personal experience YTA.", "Don’t let the last memories be that of resentment . We all owe a death an sorry yours has come so early in life , make most what’s left an enjoy it ;)", "A gentle YTA only because if I was your mother I would be devastated if my child didn’t tell me our time was limited. Let them know, don’t do this alone.", "YTA. Your parents will blame themselves for not even knowing that their daughter was dying. They'll probably regret not spending your last days with you properly. How about you put yourself in their shoes for once and stop thinking about yourself only", "YTA I know they will try to change your mind and seek treatment to help ease their grief, so I understand why you don’t want to tell them. If you don’t tell them, they will be so so hurt. You will take away their opportunity to have closure with you. They will wonder what they did to make you not love or trust them with the information. It will hurt them so much. It’s your death and you have a right to pursue what you want, but in this case it still totally makes you an asshole.", "YTA", "Babe, they’re going to be devastated. And if you leave them with no answers, all they’re gonna have is a lifetime’s worth of questions. Establish boundaries and ground rules; they can’t make you do anything if you stand firm in yourself. But I think you have to tell them. Also- your sister already knows. Imagine her burden. And then the burden after you pass, when your parents realize she knew the whole time. I’m sorry. I’m so so sorry. I know it’s hard to be selfless when your self is ending. I know it isn’t fair. but ywbta if you don’t tell them.", "Ynta, you're a young still very hormonal adult who's just started life and found out that it may be ending soon. You've been thinking and rethinking every scenario of what's going to happen with yourself and with all of them and it's maddening. As it's already stated by the doc and others talk to your family and friends, open yourself up to the ability for both you and them to be at peace when/if the worst happens.\nAnd no matter what, make sure to make memories and show your love to your family, both of y'all need it. I truly wish you the best and your family too.", "NTA. I am sorry you are being cheated from a long life.  Cancer does truly suck.\n\nYou are dealing with a lot right now and until you process what you want to do with the time you have left, you don't have to tell anyone.  I get that you don't want to deal with your family and friends grief, denial and well-meaning advice for miracle cures.\n\nFor now tell your sister that you need time to adjust.  And perhaps you will change your mind about sharing.  Maybe talk to the Oncologist staff regarding how to go about telling family/friends?!  You may benefit greatly from their support.\n\nThe Drs. may give you a year, but several friends and family members have been given a short time to live and happily lived many months and even a couple of years longer.  \n\nI wish for you many new memories and joys.  Sending hugs.", "I had a friend who was diagnosed with leukemia. She didn't want to tell me but due to circumstances, she decided to do so.\nAnd to be honest, these five months afterwards until her passing were so emotionally intense. I remember how she told me, she didn't actually plan on telling me and all I could say was \"And then one day you ain't here?\"\n\nI'll admit, this tingled my YTA senses, but at the same time...I understand. How some others already pointed out, you now live with family. That's a different type of trying to hide.", "INFO Um, why speaker phone for a secret so important? It sounds like you want them to know.", "You realize that she decided to tell her family after a doctor who works with terminal patients explained to her how brain cancer can flick like a lightswitch from ok to unable to do anything, right?"]}