{"id": 11996, "submission_id": "11o6dkl", "title": "AITA for refusing to help this colleague with her schooling unless I get a raise?", "selftext": "I (32F) work in a daycare. I recently obtained certification through an online school. Another teacher, let's call her Estelle (probably in her 50s), showed great interest. The thing is, it's a lot of work. The certification is pretty much self-directed and then you have to fill out a ton of paperwork, take an extensive exam and then be evaluated as a teacher. It took me well over a year to obtain mine and it was a huge pain in the ass. I explained this to Estelle and she was on board. I thought that was the end of it.\n\nThen my boss, \"Adrian\" approached me and asked if I could help Estelle enroll as she wasn't familiar with the website. I agreed and we got her signed up. Both Adrian and I stressed that it is a very intensive process and she'll have to do a lot of work. The classes are non-refundable. Estelle said yes, yes, that's fine. She paid for everything.\n\nEstelle approached me today and asked if I could help her order the materials needed. I found this a little weird as the website is pretty self explanitory and there's a big tab that says \"store\" where you order them. But okay, I was still willing to help. We get this done and that's when Estelle started asking me the same questions about the course that I already answered. She still didn't seem to get this is a *self-directed* program. They have an administrator that looks over your work, but it's on you to read the book, do the work and submit it. There are no classes to attend. \n\nLater on, she approached me again and asked if I could help her with the assignments, study, etc. I was clearly hesitant and she said \"Adrian told me you would help. I only signed up for all of this because she promised you'd help me type things up\". \n\nI went to Adrian who claimed \"it's not a lot of work\" and \"just help her out\". I asked if this came with a raise and she said no, as I'd be doing all of this off the clock. I said I'm not a teacher or administrator, I'm not doing this. Adrian wasn't happy but there's nothing legally she can do.\n\nEstelle is very upset and frantic. She says she can't do this by herself, why can't I just help her? She already sunk a lot of money into this. Some of our colleagues are on her side. They say I'm being unfair and it's not fair to Estelle that Adrian lied to her. They say she can't afford to waste the money and really needs to see this through, but she can't do it alone. The thing is, I'm the only one with this certiifcation at the school (most have a bachelors in the field, so they never did this). So no one else can really help her.\n\nAm I the asshole?", "created_utc": 1678496129, "permalink": "/r/AmItheAsshole/comments/11o6dkl/aita_for_refusing_to_help_this_colleague_with_her/", "score": 80, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I wonder if I'm an asshole for not helping Estelle with her coursework. I could be the asshole because it's not entirely her fault and Adrian clearly lied to her, offering me up without asking first.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nope, NTA. \n\nWhy are you supposed to help this coworker OFF THE CLOCK for a self-directed course? \n\nSounds like she doesn't understand what she signed up for, and your boss wanting you to help her out *without pay* is equally clueless.", "NTA\n\nThe boss screwed you both over, there are no winners here.", "NTA\n\nThe boss is the A and Estelle is either completely unsuited to the requirements of the course, or playing you for a fool.\n\nYour position is to teach young children. End of. Are either of them that age? No.", "NTA\n\nThey're right in saying that it's not Estelle's fault your boss promised her your help, but *it's also not yours*. If anything, Adrian should take the time to help with the assignments since they were the ones that started this whole mess (it's unrealistic, I know).\n\nPlease, OP, stand your ground on this. You're absolutely in the right on this, and you can tell Estelle that you already warned her about all of this. If Estelle can't do it alone, she should hire a tutor, or grow up and do the work. \n\nHonestly, I'm tired of hearing about boomer-ish aged people and this level of entitlement. She made her bed, with adequate warning from you, and so she needs to lie in the consequences of her actions.", "NTA\n\nYour boss sucks for promising your help to Estelle and Estelle sucks for not having confirmed with you that you're helping if she really is so unequipped to deal with the coursework herself.\n\nYou need to explain to Estelle that you were not asked to help her nor did you consent to helping her and you're sorry Adrian misled her but she will need to figure things out on her own. You'd already explained to her the work that went into it.\n\nAlso, if your boss is in the habit of volunteering you for unpaid work, you may want to start looking for another job.", "NTA. Youd be doing something unpaid and off the clock to upgrade your colleague's life, and your workplace? Yeah, no.\n\nEither Estelle pays you or your employer pays you.\nYou stressed to her over and over that its a hard thing to do, she said its alright\nYour colleagues only side with her because they know she wont need her help.\n\nTheyre not paying you, youre doing jt off the clock so your free time.\nYeah, hard pass.\n\nIf Estelle can't do the homeworks on her own she doesnt deserve the certification.\nAdrian cant promise anything on yout behalf because its outside work\nAdrian needs to figure it out and help Estelle herself because she's the one who promised to do it.\n\nThat being said, everyone in your workplace would be pressuring you to help her.\nIf you help her. Theyll see you as easy and ask you to do more things off the clock. \nIf you dont help her, your relationship with everyone is going to go sour. Estelle probably wont shut up about it, theyd probably talk about it behind your back\n\nIf it was me, I'll start looking for a higher paid job. I wouldnt want to stay in a work environment thatd pressure me to do things for free.", "NTA they all need to be mad at your boss, she can take time out of her schedule to help", "Your boss is the asshole for setting the two do you up.", "NTA.   Estelle needs to try and do stuff herself before she goes to you.  There is a difference between help and doing everything for that person.  I think you made it perfectly clear that she had a lot of work to do ON HER OWN before she signed up for the course, and Adrian is TA for volunteering your time without compensation.\n\nAsk Estelle if she wants to hire you as a tutor, because walking her thru the course is not in your job description, and I'm guessing that it is going to be a major time sink outside of regular business hours.\n\nSome people are self motivated.  I'm guessing that you were in order to get this completed.   From how you described Estelle, she sounds like she wants it handed to her without putting in the effort.", "Bwuahahahahahaha.....sorry.\n\nYou are SO NTA. \n\nWho signs up for something they can't do without help from a person who didn't agree to help personally.  Right?  The boss said you would help, not you.\n\nTell the boss if they can make promises for you, they can also fulfill them for you.\n\nMake up some BS reason of time commitments  eing why you can't help or use real ones if you have them and tell the coworkers all that they can help her if they are so inclined.  Make it known you never promised anything above and beyond a simple sign up assist.  If they still don't get it....then they get to be the assholes along with the boss.", "NTA, time for these helpful colleagues to form a study group.", "NTA fucking lols, yeah sure basically do someone else's course for them with no upside monetarily or otherwise for you. Absolutely fucking NOT....FML", "NTA if Adrian thinks someone should be helping Estelle off the clock they are free to do so themselves. The giving audacity of offering out (actually, sounds like guaranteeing) someone else's free time", "NTA. You informed her, more than once what the program required. You went outvof your way to help her secure her place in the program and helped her order the materials she needs for it.\n\nIf the administration and other faculty members are so insistent on you helping her study and complete the assignments,  why don't they?. Your coworkes and the administration are the AHs for volunteering you to spend your time helping her.", "NTA\n\nThis woman thought you were going to be her admin assistant for a course?!?!?", "NTA\n\nIf training Estelle isn't on your job duties, it can be added for the very low price of a higher salary!", "No, *anyone* else can help her. You didn’t have the certification before you took the course. If they want her to have help, they can figure it out like you did.", "NTA\n\n&#x200B;\n\nThey said it's not fair to Estelle but it's not fair to you either. You didn't ask for this.", "NTA. Estelle should’ve had a talk with you prior. She shouldn’t have assumed you’d help her base on Adrian’s word alone. \nAs long as you were polite in explaining to Estelle that you can’t help her on your time bc of whatever reason…I don’t see why’d you be the AH for not helping. \nHowever, when you went to Adrian basically asking if something was in it for you, it implies you have the time and don’t mind helping as long as it behooves you. So it could look like you just don’t want to bc your not getting extra money out of the deal. Which might be coming off as selfish to the others.", "NTA as this is a tactic often used by users and abusers. Emotional blackmail is still blackmail. It's not your fault Estelle was lied to. It's not her fault either, but that does not obligate you to fulfill a promise that was made without your knowledge or permission.", "NTA and Adrian can sit her happy butt down and hold Estelle’s hand through this process.  I also suggest you look for another job now that you have this credential and ask for more money.", "NTA.\n\nIt’s on Estelle for never clearly mentioning what she expects and it’s on Adrian for not considering your time valuable. \n\nEveryone on Estelle’s side doesn’t care for your effort and you should not worry about them either. Great job on the certification tho!!", "NTA, Adrian can do it off the clock. Problem solved.", "Nta Adrian can do it for her on her time off", "NTA It sounds like Estelle expects you to do all the work and then receive credit for it. You already done the work for yourself. Why should you do it again and let someone else get the credit for it? You warned Estelle that it's a lot of work. If the site is self explainable and she can't even follow that then why did she sign up for it? You didn't decide to sink in a lot of money into it Estelle did. Let Estelle figure it out or fail doing it.", "NTA. Adrian promised she would be helped, he can help her for free. This is not on you.", "NTA. Let Adrian do it.", "NTA - E needs to grow up.", "NTA\n\nYour boss is the one who encouraged Estelle to sign up for this, and apparently mis-represented the program to her.  \n\nAdrian should be the one who helps Estelle since she is the one who led her on.   Alternatively, you tell Estelle you’ll assist her, but your tutoring rate is $$ per hour so it is worth it to you.  Otherwise, Adrian needs to give you time on the clock to work on the info.", "NTA. Estelle is old enough to know that she should have spoken to you about helping her. You told her to her face, before she paid her money, that she had to do this by herself. She was counting on your boss to make you help her. If she could not do the program by herself, she should not have signed up.", "Why is this even a question?\n\nIt's not your job and you're not being paid. She needs to stand on her own 2 feet", "NTA\n\nTell Estelle, that Adrian can help her. You don't have the time to teach her after work hours, you have a busy life.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (32F) work in a daycare. I recently obtained certification through an online school. Another teacher, let's call her Estelle (probably in her 50s), showed great interest. The thing is, it's a lot of work. The certification is pretty much self-directed and then you have to fill out a ton of paperwork, take an extensive exam and then be evaluated as a teacher. It took me well over a year to obtain mine and it was a huge pain in the ass. I explained this to Estelle and she was on board. I thought that was the end of it.\n\nThen my boss, \"Adrian\" approached me and asked if I could help Estelle enroll as she wasn't familiar with the website. I agreed and we got her signed up. Both Adrian and I stressed that it is a very intensive process and she'll have to do a lot of work. The classes are non-refundable. Estelle said yes, yes, that's fine. She paid for everything.\n\nEstelle approached me today and asked if I could help her order the materials needed. I found this a little weird as the website is pretty self explanitory and there's a big tab that says \"store\" where you order them. But okay, I was still willing to help. We get this done and that's when Estelle started asking me the same questions about the course that I already answered. She still didn't seem to get this is a *self-directed* program. They have an administrator that looks over your work, but it's on you to read the book, do the work and submit it. There are no classes to attend. \n\nLater on, she approached me again and asked if I could help her with the assignments, study, etc. I was clearly hesitant and she said \"Adrian told me you would help. I only signed up for all of this because she promised you'd help me type things up\". \n\nI went to Adrian who claimed \"it's not a lot of work\" and \"just help her out\". I asked if this came with a raise and she said no, as I'd be doing all of this off the clock. I said I'm not a teacher or administrator, I'm not doing this. Adrian wasn't happy but there's nothing legally she can do.\n\nEstelle is very upset and frantic. She says she can't do this by herself, why can't I just help her? She already sunk a lot of money into this. Some of our colleagues are on her side. They say I'm being unfair and it's not fair to Estelle that Adrian lied to her. They say she can't afford to waste the money and really needs to see this through, but she can't do it alone. The thing is, I'm the only one with this certiifcation at the school (most have a bachelors in the field, so they never did this). So no one else can really help her.\n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You are NTA\n\nAdrian cannot make promises on your behalf and you are not obligated to keep those promises.\n\nEstelle is clearly having issues with this type of learning. That also is not your problem. \n\nMaybe you should set some boundaries and give her some general guidance like \" I recommend you set aside an hour a night and work through a section/topic/activity (however the stuff is structured)\" and \"make note cards for study for the exams and give yourself a week to go over the materials before you sit them\",  \"I can help you with some study tips when exams come\", \"I can show you how to access x,y,z\"  - or whatever you feel comfortable with doing. This isn't something you have to do, but it might help the situation and at the same time reinforce the boundaries. You should not have to do any of the actual coursework - that is for Estelle to do.", "NTA at all -- and actually literally any of them could help her. The problem here is her lack of confidence, and apparently inability to type.\n\nHaving a qualified person who has done this specific course \"help\" with the coursework could be seen as cheating. \n\nHaving a colleague, literally any colleague, draw up a rota so everyone takes a week, hold her hand through the process of reading & submitting assignments while not actually helping with the content, would be a reasonable arrangement.", "Estelle is also a jerk. Everyone knows that if you want to ask someone a favor, you actually have to ask them.", "50s is GenX. And I’m fairly sure this kind of mismanagement goes across all generations.", "For a SELF STUDY course at that!", "Late 50s is still Boomer, mid 50s is Gen X. 1964 being the last year of Boomers and up to 1967 being a blend\n\nBut also, it's more of the \"okay boomer\" energy that I'm using than the literal generational defs!"]}