{"id": 12033, "submission_id": "11oo14o", "title": "AITA for asking my mom to \"quit bringing drama into my life\" and that I want \"nothing more to do with her boyfriend or his family\"?", "selftext": "Fiancé and I are getting married this year and my mom, since I'd clarified to her that her boyfriend's daughter can't come (she's known since last summer that this was planned to be a very small wedding with immediate family only \\[siblings, parents, and grandparents\\]) has been acting like a basket case. \n\nHer boyfriend is claiming that if his daughter can't come, then he won't go to the wedding. So my mom has been telling me several times how stressed she is by this and keeps requesting that we reconsider and allow her boyfriend's daughter to attend, to which I keep telling her \"no\".\n\nI finally blew up and told her \"That's it, I'm done.\" I ranted that her boyfriend has no right to even attend this wedding anyway given how he's spewed lies about my fiancé \"being controlling\", which is rich because he himself is a controlling narcissist when it comes to my mom. Further, he makes my fiancé and I uncomfortable whenever we have to be around him.\n\nShe has now been consistently bringing drama to my phone line for the past week, claiming that if her boyfriend isn't going to be there, then she won't stick around at the wedding very long either to celebrate. And then she also threw it in my face that my maternal grandpa likely won't attend either since he \"doesn't have a ride\" and \"can't drive himself\" and that \"if my maternal aunt were invited, she would've driven him to the wedding.\" My mom was pretty upset when she was told last year that we were having a micro wedding.\n\nI told her if she's going to keep being dramatic about this, then maybe she \"shouldn't come to the wedding either, as much as that would hurt me\". I also told her \"You realize your boyfriend has step kids and more than just his single biological daughter, right? If this is how he treats his step kids, then I want no part of him in my life. I'm done with him being whiny and always stirring the pot. I don't want him in my life anymore. He can never just leave things alone. He always needs things done HIS way, and its upsetting how you always put him and his feelings above your kids, just like you're doing now. You'd rather put your kids in stressful situations to appease yours and your boyfriends comfort. He's done things to me in the past that he's STILL never apologized for or even acknowledged, and by now, it's too late. He's ruined my 20s. My only hope is that my 30s will be off limits from him.\"\n\n\"Not to mention, since you've been dating him, you've turned into someone I do not recognize. You've changed your appearance and personality completely and you cry in public and cause scenes for your kids all the time when you NEVER used to do that. I'm done with all of this. Please stop. And go to therapy. I love you, but you make life so hard for me lately. I miss my mom, and I miss being happy. Please just let me be happy. I can't deal with the drama anymore.\"\n\nShe now hasn't talked to me for several days. AITA?\n\nFor what it's worth, we're paying for this wedding by ourselves with no assistance.", "created_utc": 1678551330, "permalink": "/r/AmItheAsshole/comments/11oo14o/aita_for_asking_my_mom_to_quit_bringing_drama/", "score": 257, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action to be judged would be my rant about my dislike of her boyfriend and anger toward her for being dramatic about the wedding invites.\n\nI may be the asshole because my mom's silent treatment tells me she was deeply hurt by my nonacceptance of her boyfriend and for not be accommodating.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and you told your mom what you wanted to get off your chest. Stand your ground and don't let that creep anywhere near you on your special day. Even if your mom chose not to attend, get on with who ever turns up and enjoy a drama free time with those who are truly happy for you and wants to share the special time with you. Congrats and all the very best.", "NTA:  But you're blaming the wrong person. Sounds like you and your mother boyfriend don't have a good relationship.  You shouldn't be shocked he's trying to find an excuse not to go. \n\nI say your focus should be on telling you mother she's the one ruining your wedding. She's the one  repeatedly messaging and calling you to try to manipulate you. Call her out on her actions because all she heard is \"I hate your boyfriend\"", "NTA\n\nIf that doesn’t hit home as a wakeup call for your mom, then she’s a lost cause", "Nta!! She kept hounding you", "NTA but try to hold your mom more accountable for her own actions. Her shitty boyfriend is a scapegoat.", "NTA. I wish you a happy and peaceful wedding day and a blissful marriage, OP.", "NTA\n\nHonestly, at this point, I'd say cancel the entire wedding and just elope.  If your mom's boyfriend is a narcissist, there's literally no way he'll ever change.\n\nI'd advise you go permanent NC with your mom and her boyfriend, because as long as **he** doesn't change, she won't, either.  Don't bother recommending therapy because, unless someone truly wants to change, they won't benefit from it at all.\n\nI hope you and your soon-to-be-husband have a fantastic life.", "NTA - stay NC", "It sounds like your life has plenty of drama without adding to it. NTA for having boundaries and for wanting to celebrate your wedding in the way you and your fiancé have planned. If your mom (and anyone else) cannot support your plans, then you have to move forward without her. Good luck and best wishes on your wedding and a happy marriage.", "Whatever you told your mom should be a lesson on boundaries for many AITA posters regarding conflict. NTA OP. Your words were an account of your experience with them, not intentionally hurtful words.", "NTA. My wife and I didn’t even tell my family we were engaged until after we got married because we wanted a microwedding without their input. It was just me, her, her preteen kid, and our 3 closest friends.", "It sounds like there are several issues at play here. Firstly, it's important to remember that this is your wedding day and ultimately, you and your fiancé get to decide who is invited. It's understandable that you want to keep it small and intimate, and it's okay to stick to that plan even if it upsets some family members.\n\nThat being said, it's clear that there are some underlying issues between your mom and her boyfriend that are causing tension. While it's not necessarily your responsibility to fix those issues, it's understandable that you may feel caught in the middle. It's also important to consider your relationship with your mom and whether cutting her out of your life entirely is the best solution.\n\nIn terms of whether you're the asshole in this situation, it's difficult to say without knowing the full extent of the relationship dynamics and past history. However, it's clear that you're feeling frustrated and overwhelmed by the situation, and it's okay to set boundaries and stand up for yourself. It's important to communicate your feelings in a calm and respectful manner, but also to prioritize your own needs and happiness.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFiancé and I are getting married this year and my mom, since I'd clarified to her that her boyfriend's daughter can't come (she's known since last summer that this was planned to be a very small wedding with immediate family only \\[siblings, parents, and grandparents\\]) has been acting like a basket case. \n\nHer boyfriend is claiming that if his daughter can't come, then he won't go to the wedding. So my mom has been telling me several times how stressed she is by this and keeps requesting that we reconsider and allow her boyfriend's daughter to attend, to which I keep telling her \"no\".\n\nI finally blew up and told her \"That's it, I'm done.\" I ranted that her boyfriend has no right to even attend this wedding anyway given how he's spewed lies about my fiancé \"being controlling\", which is rich because he himself is a controlling narcissist when it comes to my mom. Further, he makes my fiancé and I uncomfortable whenever we have to be around him.\n\nShe has now been consistently bringing drama to my phone line for the past week, claiming that if her boyfriend isn't going to be there, then she won't stick around at the wedding very long either to celebrate. And then she also threw it in my face that my maternal grandpa likely won't attend either since he \"doesn't have a ride\" and \"can't drive himself\" and that \"if my maternal aunt were invited, she would've driven him to the wedding.\" My mom was pretty upset when she was told last year that we were having a micro wedding.\n\nI told her if she's going to keep being dramatic about this, then maybe she \"shouldn't come to the wedding either, as much as that would hurt me\". I also told her \"You realize your boyfriend has step kids and more than just his single biological daughter, right? If this is how he treats his step kids, then I want no part of him in my life. I'm done with him being whiny and always stirring the pot. I don't want him in my life anymore. He can never just leave things alone. He always needs things done HIS way, and its upsetting how you always put him and his feelings above your kids, just like you're doing now. You'd rather put your kids in stressful situations to appease yours and your boyfriends comfort. He's done things to me in the past that he's STILL never apologized for or even acknowledged, and by now, it's too late. He's ruined my 20s. My only hope is that my 30s will be off limits from him.\"\n\n\"Not to mention, since you've been dating him, you've turned into someone I do not recognize. You've changed your appearance and personality completely and you cry in public and cause scenes for your kids all the time when you NEVER used to do that. I'm done with all of this. Please stop. And go to therapy. I love you, but you make life so hard for me lately. I miss my mom, and I miss being happy. Please just let me be happy. I can't deal with the drama anymore.\"\n\nShe now hasn't talked to me for several days. AITA?\n\nFor what it's worth, we're paying for this wedding by ourselves with no assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.", "ESH, you have the right to invite whoever you want, and your family should understand that, but the whole rant towards your mother seems uncalled and points to other issues in your relationship. Also, your mother's boyfriend is clearly out of line.", "NTA. Just tell her that if she's allowed to\nChoose her boyfriend over you then you're choosing your new Husband over her. What does this relationship actually being to your life? Might be time to go LC or NC.", "NTA", "You’re mom sounds like someone who emulates the behavior of whoever she’s with…. \n\nYou’re going to have a lovely day and even though it’s going to hurt, her not being there, it’s for the best. \n\nHow are your in laws? I hope they embrace and love you. You’re off to a new life and have your own family. If your mom wants to act like some teenager.. that’s on her. \n\nHappy life and congratulations 🍾🎈🎉🎊\n\nEdited to add \nNTA", "Your wedding , you call the shots.", "Everyone sucks", "Thank you so much! <3 That's how we're trying to move forward: reserving the day for those who really care about our future and happiness.", "That's fair, thank you for the advice! Btw, this isn't the first time my mom's boyfriend has come up with excuses to not attend get-togethers that I will personally be at. My older sister has noticed the behavior as well, so we know it's not all in my head. I'm not at all shocked by his excuse.", "Thank you so much! <3", "Good advice, thank you! My fiancé is truly my best friend in life. He's been so chill and supportive of me in every facet of my life for the past 7 years. A future with him will be very grand. <3", "Thank you! My in laws are SUPERB. I love them all so much, they’re just as supportive as their son is to me. They’ve told me: “You have whatever kind of wedding you both desire and invite who you want. In the end, it’s about you two. We just want you both to be happy!” Such a breath of fresh air~", "Just remember:\n\n**Actions always show our true values more than any words we say.**\n\nAlso:\n\n**Family is not always biology and biology is not always family.**\n\nI mention these because many people grant biological family license to treat them in ways they'd never tolerate elsewhere.  And have the \"But they're faaamily\" as the sole reason not to cut such people out of their lives.", "This made me happy to hear!!! Then it just reinforces what I said before.. new life new family.. full of the I’ve you deserve. \n\nLet your mom emulates whoever she wants too from now on. Let her know you’ll always love her but aren’t going to put up with her shenanigans any longer. If she comes around she will.. if not.. you tried.", "Sometimes bio family needs to be cut out as ruthlessly as cancer would be.", "NTA - Mother and creep boyfriend are toxic", "Please save and reread this post if/when mom skips your wedding and then remember how drama and stress free it was because she didn't attend. You can hire Uber or a driver to get grandpa to and from your wedding. NTA, congratulations and please thank your mom for giving you the gift of a stress free wedding by not attending with her and the drama queen boyfriend.", "NTA \n\nBut truly think it’s E S H because micro weddings draw some very hard lines and I’ve never seen it go well to invite grandparents but draw the line at aunts and uncles etc.\n\n But that’s not what you’re asking. Your mom’s bf is an AH and so is she for allowing it", "NTA but maybe you should give Grandpa a ride yourself", "Hear hear! NTA", "Amen."]}