{"id": 12140, "submission_id": "11pm05t", "title": "AITA fortelling my boyfriend he is morally corrupt for passing his dog off as a service dog?", "selftext": "\nMy (35F) boyfriend (32M) has ADHD and mild depression and anxiety. He has not sought medical care for any of these conditions. Instead he got a French bulldog puppy (currently 8 months old) which he said will be his service dog to help with these medical conditions. Although he does intend to send him to professional training, he has not done so yet. He did buy him a “service dog” vest off Amazon that he puts on him when we take the dog out in public to pass him off as a service dog. If any establishment gives us trouble about bringing the puppy in he tells them they are discriminating against a person with disability.\n\nI told him he is morally corrupt for 1. Falsely portraying himself as a disabled person and 2. Falsely passing of an untrained dog as a service animal. I think this is an insult and disservice to people who truly need a service dog. He’s says I’m being ableist and not sensitive to his mental health. To be clear- his depression and anxiety have never stopped him from going into public or from doing the activities he wants to do and he does not have a panic disorder. AITA for not being sensitive to his mental health needs?", "created_utc": 1678646171, "permalink": "/r/AmItheAsshole/comments/11pm05t/aita_fortelling_my_boyfriend_he_is_morally/", "score": 264, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am asking for advice if I am the asshole for I not being sensitive to someone’s mental health struggles\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, your boyfriend is straight-up wrong. People like him are part of the reason why people with ACTUAL, TRAINED service dogs get grief in establishments. A PUPPY, no less. I’m willing to bet his behaviour is nowhere near the required standard for actual service dogs, no matter how lovely he is as a pet. \n\nOne day, his dog might be qualified to wear a service dog vest. Until then, he categorically should not, and you are doing the right thing by standing up to your boyfriend on this. Him calling YOU ableist is adding insult to injury, since he’s the one whose behaviour is going to cause actual harm to people with disabilities whose legitimate service dogs get grief.", "NTA. This is the reason why people with real service dogs, real and trained working dogs, get into trouble, when they want to visit places, where normal dogs aren't allowed.", "nta\n\nthat sounds kinda...illegal to me. service dogs are specifically trained dogs, you cant just slap a vest on it and call it a day. if your dog goes haywire etc, hes in for a treat in court.", "NTA. Your boyfriend's behavior is unethical and dishonest. Falsely portraying himself as disabled and passing off an untrained dog as a service animal is not only morally corrupt but also illegal in many places. It's disrespectful to people who truly need service animals and may face discrimination because of people like your boyfriend who abuse the system.\n\nYour concerns are valid, and it's not fair for your boyfriend to accuse you of being ableist for speaking out against his behavior. It's important to remember that being sensitive to someone's mental health needs doesn't mean turning a blind eye to their unethical behavior.\n\nYour boyfriend should seek professional help for his mental health conditions instead of using a fake service dog as a substitute. A trained service dog can be an invaluable resource for people with disabilities, but it takes time, effort, and commitment to properly train a dog for service. Your boyfriend's actions are disrespectful to the people who rely on service dogs to perform necessary tasks, and it's not fair to the dog either.\n\nIn summary, your boyfriend's behavior is not okay, and you're not being ableist for calling him out on it. Encourage him to seek professional help for his mental health conditions and refrain from falsely portraying himself as disabled or using an untrained dog as a service animal.", "NTA - he’s lying and putting himself his dog and other device dogs and their handlers at risk. You don’t mention if the dog has any basic training which sounds like this puppy doesn’t even has a start on a recall or any other polite doggy behaviors.", "NTA. You said yourself,  He has Not sought medical care for his conditions.  He's an entitled liar. His mental health \"needs\" are not an untrained puppy. If a dog were recommended by his doctor that would be one thing.  But he won't even do that for himself.  Tell him scamming the public isn't the way to make himself better.", "NTA, what your boyfriend is doing is illegal according to federal ADA service dog laws. \nYou can literally show him the law that defines what a service dog is.", "NTA You're bf is an entitled A and this behavior would be a deal breaker for me", "NTA.\n\nYour boyfriend thinks he’s special and the rules aren’t for him.\n\nI’d think twice about hanging on with that guy.", "NTA hes the problem", "NTA but your BF is. Shame on him for thinking this is okay especially with the fact that the poor dog isn't even potty trained yet or had any kind of training. Someone is going to catch on and it's going to cause drama and problems for everyone involved including the innocent puppy or something could happen and the dog and your BF won't know how to respond. Do it the right way and train the puppy.", "NTA. Your BF’s actions make it more difficult for those with real service dogs to be treated appropriately.", "NTA. \n\nI have a close childhood friend who had a service dog growing up. That dog was extremely well trained. Didn’t pay attention to people, other than the handler, ignored food for the most part, and did not engage with other dogs. And there was a very good reason for all of this. The dog was specifically trained to ignore distractions and be focused on supporting the handler. \n\nwhen people trot their dogs into an establishment and try to pass them off as service animals, it creates a situation where people become less trusting of actual service animals because these pets do not act correct. \n\nThere are plenty of activities you can do with your pet dog in public. Go to a park, go on a hike. Hell, you can even sit outside at most restaurants.", "NTA and this is exactly why I unfortunately suspect that any emotional service animal is how pet owners fake their way into places pets aren't normally welcome. Definitely not fair to those who have diagnosed conditions and health care provider prescribed comfort animals.", "NTA.  You are doing the right thing by letting him know how other people will judge his actions.", "NTA - huge problem with that. It not only is lying, creating larger issues for people who have service dogs already and (in my country anyway) it’s actually illegal.. so.", "NTA\nAnd thank you for thinking of disabled and animal welfare.", "By the way... has anyone ever heard of a french bulldog being used as a service dog? I doubt that's going to fool many people.", "He's also TA for buying a brachycephalic dog.  They shouldn't even exist.", "NTA at all, and it shows a lot about his character. The majority of people struggle with mental health to some extent, but not many of them are disabled by it. In the US at least it’s written into the applicable laws that this is an accommodation for disabilities only. Laws for in training dogs vary widely by state too. I highly doubt his 8 month old puppy is consistently behaving appropriately or that he is even actively training it, even dogs bred for this struggle at that age. It’s also not fair to the dog, legitimate service dogs have a solid temperament to handle the stress of the job a lot of pets don’t and become reactive to other dogs/people.", "He hasn't been diagnosed and the dog is untrained and he went through the effort of buying a vest. As a person who suffers from Bipolar and ADHD I have a dog I would love to bring everywhere, but can't.  No person with ADHD needs a dog, and I don't see the strong case of depression.  He is a garbage person and honestly wouldn't stay with a dishonest person. He's is willing to threaten people's jobs and livelihoods for the sake of taking a dog into a restaurant.  Yikes.", "NTA\n\nHow is this not *more* of a problem to you? His behaviour is deliberately, selfishly deceitful, and potentially causing issues for people who (a) have legitimate service animals, and (b) people who are doing the right thing and seeking appropriate treatment for their conditions. \n\nHow does this lack of moral character on his part not bother you more?", "Show him this: [ADA Disabilities ](https://usserviceanimalregistrar.org/ada-list-of-disabilities/?utm_term=&gclid=Cj0KCQiAjbagBhD3ARIsANRrqEs5dODm8HsCAKP_elLhpnuuiER7fCeVF1UypB7mQPvynofJmB6-PZkaAuLKEALw_wcB)", "NTA. First off, it doesn't sound like his conditions are even confirmed; you say he has not sought medical care, so has he even been diagnosed as ADHD, etc?\n\nI think \"morally corrupt\" might be a bit of a stretch, but I'd certainly consider him a liar. He wants to take advantage of a \"disability\" that he might not even have! And you know, having ADHD, depression, anxiety, doesn't excuse bad behavior — like lying. \n\nRe-evaluate your relationship.", "NTA. He is the AH and making it more difficult for people that actually require service dogs.", "NTA. He’s just mad because you’re calling him out on his bs. Good on you for correcting him.", ">He’s says I’m being ableist and not sensitive to his mental health.\n\nI'm sorry, **he** is being abelist and not sensitive to the mental health who those who require service animals. **He** is making it harder for people with service animals to be taken seriously by slapping a vest on an untrained puppy. **His** attitude is the very reason service animals aren't taken as seriously as they used to be.\n\nYour partner is morally bankrupt and you are NTA.", "Nta.", "NTA at all. He’s lying, and the fact he says your ableist or people are discriminating against him is so obnoxious.\n\nHe sounds like a drama Queen, and quite repulsing. \n\nNews flash for him, depression, anxiety, ocd, whatever he has doesn’t make him special. It doesn’t give him the right to accuse people of things that aren’t true. His behavior is disgusting", "ESH for still being with him.  He has shown his colors.  He is an abomination of a human being.  You should dump him immediately.", "NTA at all. Also, many businesses don’t bother due to the risk of a discrimination claim, but it IS legal for businesses to ask what tasks the dog is trained to perform (and therefore make the correct assumption to treat them like a pet vs a service animal if the response is “nothing yet” or “emotional support” as ESAs are not generally protected like service animals ) AND even legitimate service animals can be refused from a business if it is aggressive and causing a disruption. \n\nYour boyfriend could get himself in a Lot of trouble if he runs into someone who is proactive and knowledgeable in the ADA regulations.", "NTA - While PSDs are definitely a thing, it sounds like this dog wouldn't be considered one. For one thing, service dogs are usually the LAST measure of treatment rather than the first, due to their expense, the long time it takes to train them, and the high washout rate. Does the dog have public manners? Is it housebroken and can it ignore distractions? If not, then it's not allowed in service dog only places, even if it DID have service dog training.\n\nYou might want to point out to your boyfriend that businesses are able to ask him to leave if the dog isn't housebroken or under his control. Also, remind him that what he's doing is punishable in many places by fines and/or jail time (a lot of places have made misrepresenting a service dog illegal) If you really want to drive the point home, then when places ask him to leave, speak up. Say something like 'We have to take the dog out to the car.' Make it clear that you're aware the dog isn't a service dog - that will keep him from being able to claim discrimination.\n\nService dogs are awesome. My dog enables me to go out on my own, as he can pick things up for me and retrieve items from bottom shelves. That said, it was a hell of a lot of work to train him, and he puts up with conditions that would be difficult for most dogs to deal with. Even among dogs bred to be service dogs, the failure rate is over 50%, and that's WITH professional training. Your boyfriend's dog hasn't had the advantage of any of that, and you need to keep reminding him of that.", "NTA but that boy is trash.", "NTA. Your boyfriend is a con artist who will do as he pleases because he somehow feels entitled to it.", "In a store they are allowed to ask 1 is that a service dog and 2 what task does it perform. If he has no answer they have every absolute right to kick him and the dog out. \n\nIt is insulting and downright dangerous. NTA good on you for calling him out. And don’t get caught in a situation with him and the dog in public.", "Nta... Your bf is.   Your BF is causing more problems with service dogs. People that legitimately need them are being harassed because of people like your boyfriend", "Your BF is disgraceful and immature, you aren't. Being with someone who doesn't share the same values can be really taxing on a person. Might be something to think about long-term.", "NTA at all.  Service dogs have to have trained tasks that mitigate disability -- emotional comfort doesn't count.  Plus, even if he had tasks the dog can be trained to do, a puppy is still in training and so wouldn't have immediate public access.", "NTA he needs to stop. Seriously what he’s doing is wrong. There are people who truly need service dogs and people like him are making it so they have a hard time. F that guy. Major red flag. Take the dog and leave", "NTA. And there is a difference between a service animal and an emotional support animal. Service animals are rigorously trained to handle specific tasks to help a disabled person who cannot do it themselves, or to alert a person of an impending medical crisis. An emotional support animal is there to offer comfort for someone with mental or emotional health issues. SAs are protected by law to be in public places, ESAs are not. So while your boyfriend might be in need of an ESA, bringing an untrained animal into public places and passing it off as a SA is just unethical. You’re boyfriend is very much an AH.", "Morally corrupt is a bit dramatic, but he is being an AH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nMy (35F) boyfriend (32M) has ADHD and mild depression and anxiety. He has not sought medical care for any of these conditions. Instead he got a French bulldog puppy (currently 8 months old) which he said will be his service dog to help with these medical conditions. Although he does intend to send him to professional training, he has not done so yet. He did buy him a “service dog” vest off Amazon that he puts on him when we take the dog out in public to pass him off as a service dog. If any establishment gives us trouble about bringing the puppy in he tells them they are discriminating against a person with disability.\n\nI told him he is morally corrupt for 1. Falsely portraying himself as a disabled person and 2. Falsely passing of an untrained dog as a service animal. I think this is an insult and disservice to people who truly need a service dog. He’s says I’m being ableist and not sensitive to his mental health. To be clear- his depression and anxiety have never stopped him from going into public or from doing the activities he wants to do and he does not have a panic disorder. AITA for not being sensitive to his mental health needs?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Why are you with this person? Do they any redeeming values?", "NTA It's illegal to fake a service animal in 33+ states. So you were merely telling the truth, that your BF is immoral as well as performing an illegal activity.", "Second this, i encountered a woman in the local grocery store, she had a dog wearing a service dog vest. The dog literally jumped up at the meat counter and she gave him the little girl voiced \"sit\" command, and the dog ofcourse didn't listen.  \nI later saw him jumping up at people. I didn't have the balls to say anything but this kind of stuff is why people with actual service dogs get denied into places.", "He’s not a well behaved puppy and certainly no where near the standards needed for being a service dog", "His dog will not one day be qualified. I own a retired guide dog and have many friends who actually self trained or hired trainers for their dogs.  I’ve also worked closely with diabetic alert dogs. These dogs are very carefully bred, selected, and the training is an intense two years. \nADHD, depression, and anxiety are also not conditions that typically require a SD. Tourette’s, yes. Autism, yes. ADHD, no. The best realistic treatment for depression and anxiety is therapy and medication. \n\nThis dog ain’t anything but a pet, maybe a glorified ESA but I bet he doesn’t have a script for one.", "It is illegal. ADA is federal law", "Thank you for wording this so eloquently. I will definitely be showing your comment to him.", "He has no formal or informal training. He’s not even fully potty trained yet.", "Yea I think it will be for me as well", "And hes not seeking counselling or professional advice", "It’s comically ridiculous.", "Omg yes. It’s so sad the poor thing can barely breathe. I had only agreed to a dog if we got a rescue. He went and bought this behind my back because it’s a designer dog", "It’s a huge problem. I have completely lost all respect for him and think he has no moral integrity. I tried to kick him out of our apartment over this but he’s on the lease and won’t leave", "Thank you", "I want to. This is why you don’t sign a lease with someone you’re not married to", "Service dogs are awesome and I am constantly amazed at what they can do. I’m so glad yours allows you to be independent. \n\nI will not go with them to a place that is not specifically dog friendly", "Yea you’re right. That’s a bit over the top", "No. Bc they are on the lease and won’t leave", "INFO:\n\nwhy are you claiming your boyfriend isn't disabled??\n\nI get the SD thing. while SDIT are generally allowed in doors and such, they need to first be appropriately trained in terms of being housebroken and general behaviour. and obviously \"I plan to get this dog trained\" is not the same as being in training \n\nbut I don't understand why you're claiming your boyfriend isn't disabled. is it because he's not going to doctors?", "Thanks for clarifying! I don’t know much about service dogs and was trying to give the benefit of the doubt that this may have been an appropriately bred and selected dog for the task (though the fact that it’s a French Bulldog, of all things, raised my eyebrows given their life expectancy/general health and the fact that they’re not among your traditional SD breeds, but I know in theory plenty of breeds CAN be suitable for service work).", "Hey, I know the anxiety thing is a actually something that can require a service dog.", "plenty of people with ADHD have service dogs. service dogs can be trained to keep the handler on task, medication reminder, finding a car in a parking lot, find other items, intervene for emotional regulation, etc etc\n\nit's ironic that you mention service dogs for autism here because an enormous number of tasks common to service dogs for autistics are also common to service dogs for ADHDers. there's also a LOT of overlap with tasks for PTSD service dogs\n\n> The best realistic treatment for depression and anxiety is therapy and medication. \n\na service dog isn't a treatment lol. yes they're considered medical equipment, but they exist to help disabled people manage their conditions and live their lives day to day. absolutely not the same thing as treatment\n\n> This dog ain’t anything but a pet, maybe a glorified ESA but I bet he doesn’t have a script for one.\n\nI mean, you often don't need a prescription for an ESA. in plenty of places ESA letters are nearly useless. in the US all you can use it for is flying with the animal (per the policy of whatever airline you're using) and for housing. ESA letters are not something people usually get in advance of getting an ESA, unless they specifically need one for housing \n\n\n\nthis is of course assuming that OP is in the US", "The doggo should not be in public spaces that service animals are allowed in if they haven’t even been potty trained yet.", "If an 8 month old dog is still regularly relieving itself indoors, the dog either has an untreated medical issue that needs to be addressed, or it has been gravely failed by its owner.", "I'd refuse to go into a store with him if he keeps bringing his dog.", "A French bulldog cannot be more than a possible psychiatric service dog. That’s just because of their breed and them not meeting requirements to safely handle a person with a different disability", "My apologies. I did not infer that from your post. Can we assume, then, that you mean Ex-boyfriend?", "He’s definitely neuro atypical (ADHD is diagnosed) and I know it is a huge struggle for him to stay on top of daily tasks. Depression and anxiety are self diagnosed but do not affect him from accomplishing any activities. He has never had any  issues with going in public that would require a service dog. For example- he has no problem leaving the dog home with me when he wants to go out with his friends. \n\nI completely agree that mental health issues can cause a person to be disabled but there are certainly degrees to this.", "Real service animals are trained to do tasks: help with avoiding obstacles, getting people safe prior to a seizure, stuff like that.  This dog can't do any tasks like that.", "He shouldn't be in places that service dogs are allowed in because he's not a service dog.", "It’s definitely the latter", "No worries I didn’t mention that part. I broke up with him bc of this and a million other reasons but he won’t leave (I pay rent, he doesn’t, so I’m not leaving.) I just wanted advice about this bc I find it so abhorrent but wasn’t sure if I was overreacting. I certainly don’t want to be insensitive to actual mental health struggles", "NTA. Fake service animals are a real danger to actual service animals. Not only do they often distract and attack real service animals at work, they leave a bad impression of how a service animal should behave to the public, which leads people to think all service dogs are badly behaved, or that it’s normal for a service dog to cause a commotion (outside of alerting). Real service dogs can cost tens of thousands of dollars to train and all it takes is one bad encounter for a service dog to be harmed to the point where they can no longer serve. Your BF is setting himself up for an expensive lawsuit. Now as someone with ADHD myself, I’ll be the first person to say “don’t tell someone who is neurodivergent they aren’t disabled” because it affects us all differently, but it seems like your BF is just using it as an excuse to have his dog around. If you’re in the USA, fraudulently passing a pet as a service animal is a misdemeanor in several states.\nAlso, your BF has no idea what the actual law is. An establishment can ask a service animal to leave IF they are being disruptive, which I’m guessing his dog is doing as it’s untrained.\nAt this point I would recommend breaking up with him - if he doesn’t care about what these animals need to people who actually need them and shows no initiative towards getting the dog real training, what other laws is he not going to care about breaking? You don’t want to get drawn into that or be in trouble by association. Depending on the laws on fake service animals in your state, you can also report him to your local non emergency police number for them to investigate, or to the ADA directly.", "NTA. \n\nThis would be a relationship deal breaker for me.  Being dishonest, and making the lives of the disabled with REAL service dogs harder?  Refusing to get help from a medical professional and/or therapist?  Hard no.  \n\nHe can enjoy the comfort of having a pet.  He is an asshole for getting that service vest and trying to pass this puppy off as a service dog.", "a) what does this guy contribute to your life and b) how often does he justify bad behavior using his mental health?", "Absolutely NTA.", "NTA, but why are you with someone you think is morally corrupt?", "NTA. You are spot-on.", "NTA. One of the things I hate the most is people passing off their dog as medical support. It could be a deciding factor in a relationship for me.", "NTA People are always trying to bring their pets into my work by claiming they're service animals when they are clearly not. One time, one defecated on the floor and we had to close down a portion of my work. It's a huge pain for us just trying to do our jobs. \n\nIt can also be dangerous because real service dogs are trained to be in all sorts of environments and not flip out but who knows how your boyfriend's dog will react. It might bite someone (this has also happened at my work). Your boyfriend is being very inconsiderate and selfish.", "NTA and this whole situation is infuriating. You are absolutely right in your explanation. True service dogs have been trained to have zero reaction to usual dog triggers and only focus on keeping their person safe. Look, I absolutely love my pets and wish they could be wherever I am but I know that's not going to do myself or anyone else any good.", "INFO: why are you dating someone this morally bankrupt? It’s not going to magically get better.", "Okay, split verdict here.\n\nYTA for saying his depression, anxiety, and ADHD are not a disability. These are all very real problems, full stop. He should be seeing a psychiatrist about them and either medicate or work to find a non-medication method of handling his mental health, but claiming they are not real is a dick move.\n\nAs someone who has all of these, and severely, I can advocate for the value of an animal. I keep a cat, whom I dote on endlessly, because in my worst depression spirals, when I think of suicide, I can point to the cat and say: \"but who will take care of her if I die.\" Not a super healthy mechanism, to be sure, but any port in a storm. Depression and Anxiety feed into each other, and a common feature of ADHD is the inability to regulate emotions and the tendency to hyperfixate on anything that engages our brain (usually negativity, thus compounding the problem). The dog may actually help him in a real and tangible way.\n\nThat said:\n\nHE IS ABSOLUTELY THE ASSHOLE FOR PRETENDING THIS NORMAL ASS DOG IS A SERVICE ANIMAL.\n\nHaving a pet to help your emotional wellbeing? Perfectly fine. Wanting to take that pet with you to stores that allow it? A little unhealthy maybe discuss with a therapist or mental health professional, but not actively harmful as a practice most of the time.\n\nDressing it up and claiming that it is a service dog? Absolutely not alright. What the fuck is he thinking. Service dogs are trained extensively, its not just an easy little class they take, and the people who need service dogs already get enough shit from people who think theyre just pretending. He is actively contributing to the view that service dogs are just pets and should be treated as such. Because, and I'm just hazarding a guess here, that dog is NOT trained well enough to pass itself off as a service animal.\n\nHe is absolutely an asshole for doing that and he should stop. Immediately.\n\nBut you do owe him an apology and some compassion w/r to mental health. If you are up for it, the best thing you can do to help an ADHD person is find him a psych who is taking new patients, specializes in med management, and who has open appointments. Doing all of that when unmedicated with that cocktail of mental issues is like running a marathon in the rain. If you can reduce the effort needed to: \"go here and meet this doctor\" then the odds of him participati ng go way up.", "NTA.  I have all the conditions your boyfriend has and I'd never dream of doing this.", "NTA\n\nWhat he is doing (bringing an untrained dog and passing them off as a service dog) makes it more difficult for people with ACTUAL service dogs to be accepted.", "NTA, because it is morally wrong.  But I'm curious about this part:\n\n>boyfriend (32M) has ADHD and mild depression and anxiety. He has not sought medical care for any of these conditions.\n\nTo be diagnosed with these conditions, he must have sought medical care at some point, whether from a physician or psychiatrist.  And at that time they almost certainly would have tried to prescribe something for him to deal with it.  And in my experience (both of my kids and I have it), ADHD is treated with medication rather than ongoing therapy.  Depression and anxiety might require therapy in addition to medication, but I wonder if these are just self-diagnosed conditions.  Which makes this even worse, in my opinion.  But in any event, you are NTA.", "Y T A for actually talking to and being with this morally corrupt A H rather than purchasing yourself a t-shirt saying 'Not really a service dog. Not even in training.\"", "NTA.  I have a service dog and he's been scared by untrained \"service dogs\" barking or lunging at him in public many times. Every time it impacts my independence because I have to take time to work with my boy and make sure there's no lingering trauma.\n\nPlus, untrained service dogs make themselves known in ways that make it hard for me. I get access challenges because people like your boyfriend came in with a dog that was wandering on her leash or licking the floor or walking up to people or even barking and peeing.\n\nHe is morally corrupt or thoughtless- and you'll know which when you point out that he is specifically making other disabled peoples' lives harder with what he's doing.", "NTA, I am a huge dog lover and would love to bring my dog out with me, however, I would never pass him off as a service dog because you are right…it is a huge disservice to those who have spent the time, effort and training to get a “real” service dog.  I mean, we ALL feel better when we have our dog with us, does that mean that we should all lie in order to do so?", "NTA, he's an entitled asshat.", "NTA.  Your BF is committing fraud.  An untrained dog out in public is a danger, and this behavior should not be tolerated.  This is appalling!!", "Is he a war vet with ptsd? NTA", "This reminds me of my ex-boyfriend lying about having a hearing impairment to get out of doing jury duty. I can confirm he was an asshole.", "NTA. He is an AH.", "This just made me think of the American \"stolen Valor Act.\" You're NTA.", "NTA, that's just a regular dog. Service dogs go through the training and even Emotional Service Animals (what I have for my own adhd/anxiety/depression) need to be vetted by a proper therapist. He is 100% being disgustingly immoral in the exact things you said. Yeah ADHD is a disability, but he needs to actually seek medical care instead of feeling entitled to bring his pet into stores because he wants to. You aren't being insensitive, you're actually being fully sensitive to all the actually disabled individuals who need to use service dogs. Also, if he thinks he's actually fooling anyone he's mistaken. It's incredibly easy to spot a real service dog as they rarely sniff the ground, look around, or are interested in anything but their owners. So he's not only being an AH but he's probably looking like a complete fool while doing it", "NTA - your bf doesn't have a service dog, acting like this does a disservice to both actual service dogs and those who need them.\n\nAt best its an emotional support animal, but i don't know that i would even go that far.", "NTA he doesn't have a service dog, he just wants to have a puppy that he can take everywhere just cause. He sucks.", "Nta. What he's doing is dangerous too and a disservice to actually service animals. I had to retire my first seizure and diabetic alert dog because someone bought their untrained dog a service dog vest and he attacked my service dog. I had to sue for them to pay for my new one on top of vet bills and other damages.", "I have a friend with an actually trained Guide Dog.  We were at Costco, his dog on a lead and a woman with an untrained dog with a knock off service vest tried to start a fight with the Guide Dog.  It could have ended very badly, both for my friend and the women he would have sued. \n\nI would no longer choose to go out with this guy until he gets a real diagnosis and prescription for a trained service dog. It's too much of a liability for you, knowing the situation.\n\nNTA", "NTA. He can buy all the fake vests he wants, but that’s not a service dog", "NTA \n\nI literally wouldn’t be able to stay with somebody who did this \n\nI have ADHD \n\nService dogs are unbelievably trained and just as you’ve said this makes it much harder for people with true service dogs that are working. There are places dogs shouldn’t be unless they are working. \n\nI read somewhere recently (maybe reddit?) a really sad story of somebody with a cardiac alerting dog who’s dog missed an alert as another “service” dog was jumping all over it in a store", "They get grief because I don't want your stupid fucking dog by me when I'm eating.", "Any dog can be a service dog.\nIt’s all simply based on the handler having a disability and the dog being trained specific tasks to mitigate symptoms. There is no regulating body or other requirements.", "Thank you for calling me out! I’m definitely not as sensitive as I should be to his health needs and I will apologize. TBH, I’m kinda at my wits end with how to help him. I added him to my insurance and pay for it so he can get his adhd meds which he doesn’t take. I’ve researched therapists in our area but he never schedules the appointment. I’ve asked him to sit down with me so we can make schedules / to do lists together but he tells me I’m micro managing. If you have any tips on how to help I’d love to hear it bc I’m lost", "Service dogs can definitely be used for ADHD, anxiety and depression.", "I just read in a post(not sure which one) that two so-called service dogs were humping in public(so poster was stating they don't think they were real service dogs) <wry smile>", "That’s heartbreaking", "Cool I guess blind people with guide dogs just shouldn’t be allowed to sit in restaurants then, lest it offend your delicate sensibilities?", "Easy. Then go home.", "Are you sure? I remember reading that many US states have been introducing laws in recent years to fight this very problem of fake \"service dogs\". And who does the training? In my country the dogs are raised and trained by professionals before being delivered to the person, and they only work with specific breeds. Aren't you talking about emotional support animals?", "French Bulldogs are actually considered to have a pretty good temperament for being service dogs. The biggest issues are their health and their size. They're a really bad choice for certain types of tasks because they're just too small. So they can't do mobility assistance tasks, they can't do guard dog tasks, that sort of thing\n\nBut they can do item retrieval tasks, medication reminders, and other common PSD tasks. Generally if a French Bulldog is going to be a service dog it will be a PSD\n\nTheir health is definitely a huge drawback and their breathing issues can mean that they may not be able to handle certain environments. The health and lifespan if she was in much bigger concern when it comes to service dogs because they are incredibly expensive and an incredible investment of time\n\nAlso.... it's really important that Frenchies start training really young or training them is anywhere from difficult to impossible", "It is IF the anxiety requires a specific task by the service dog. For example, people with panic disorders have dogs trained to herd them to a safe space or cover them with their bodies for comfort.\n\nIf it's just to comfort their anxiety, that's not a service dog. It might be an ESA, but that requires a script.\n\nHell, I have an ESA for anxiety because he's trained to sleep on top of my body when I have anxiety-induced insomnia, but he still doesn't qualify as a service dog because the task he does is only needed inside my home.", "For real. You can barely even tell an actual service dog is near you.", "Pretty much.", "Any dog can be a service dog as long as they have the temperament for what’s required of them and have the build necessary for physical tasks if that’s required, as well.", "What? A Frenchie could be a service dog. There's plenty of tasks that don't involve weight bearing. \n\nIt's definitely less common, but seeing a French Bulldog SD doesn't mean it's a fake.", "I was recently on a flight where they asked us before boarding if we were ok with a service dog sitting behind us. Turns out it was a frenchie, for a perspn woth severe anxiety (they volunteered that info I would never ask).\n\nPup was so so good. We went through security behind them and she got a little anxious being separated from the owner for screening. Didn't hear a peep from her through the 4 hr flight. Pup was so happy afterwards and the owner must have given her a signal because she came to say hi to us haha", "It sounds like his disability isn't one the dog could even help with, beyond emotional support. I have adhd and depression - my dogs are great for getting me to go outside/get up at a consistent time to feed them, but they don't help me shower daily/make regular meals for myself/meet work deadlines. If anything, it sounds like might struggle to provide minimal standards of care and training to the dog.", "sorry I'm confused by your answer\n\nyou talk about how much he struggles daily, then says that doesn't keep him from accomplishing things? \n\nhuh?? can you explain what you mean by that??\n\n> I completely agree that mental health issues can cause a person to be disabled but there are certainly degrees to this.\n\nor maybe can you just explain what you think disability is because I have no idea what definition you're using. obviously not the social model but also not the medical model either..... and I'm assuming not economic model either or you would have mentioned job/income  \n\n> He has never had any issues with going in public that would require a service dog. For example- he has no problem leaving the dog home with me when he wants to go out with his friends. \n\nokay look, his dog isn't a service dog, but you also don't seem to understand what a service dog is. plenty of disabled people with real properly trained service dogs do not bring them everywhere, all the time\n\nfor example someone with ADHD might have a dog trained for medication reminders, helping the handler stay on task, finding things, item retrieval, emotional regulation tasks, etc\n\nthey wouldn't necessarily bring the dog with them everywhere, especially if they're not alone. usually the kinds of service dogs brought absolutely everywhere are doing stuff like health alerts or are guide dogs\n\neven mobility assistance dogs are often not brought everywhere\n\nneeding your dog in order to leave the house is not the benchmark of a service dog or even any kind of measurement of one  \n\nthere are a lot of complexities that come with bringing a service dog in public and that often has a lot of drawbacks and can create triggers or other issues for the handlers. even in scenarios where handlers would ideally want their dog there, they often have to weigh the benefits with the drawbacks", "Smart lady!  Good luck getting him out!", "And nobody trains or certifies them? I can get a Chihuahua, put a \"service dog\" jacket on it and take it everywhere? Sweet!\n\nEdit: I really appreciate the downvotes, but I feel like an explanation would be EVEN better 😆", "Awww. Yeah they can make really fantastic PSDs. They tend to be pretty calm and good with people. They're actually more frequently trained as therapy dogs than service dogs!", "I’m not a mental health professional so I’m likely not using correct definitions.", "Yea- this is why your mother tells you not to sign a lease with someone you’re not married to.", "Yeah it made me laugh at first because I was expecting a german shepherd or a lab or something! Service dogs are very very rare where I live to begin with!", "okay so then question - why was it important to you to say that he isn't disabled?\n\nyou seem to think it's immoral and harming people. but who? and how?   \n\nI'm disabled. by literally any definition of the term, legally, everything\n\nI absolutely don't think him saying he's disabled is harmful to me in any way. and I don't think it's wrong either  \n\nI think his behaviour with his fake service dog is absolutely reprehensible and harmful, absolutely. but the reality is that a great many disabled people are complete AHs to other disabled people. it's unfortunate, but true   \n\nI would absolutely never tell someone with ADHD that they aren't disabled. and tbh I see the insistence that he isn't disabled as potentially quite harmful to disabled people and quite dismissive of certain types of disabilities\n\nwhat do you think of when you think of disability?? because it sounds like you have some internal metric of \"bad enough\" and anything past that threshold is disability and anything shy of that threshold isn't\n\nwhat exactly is that threshold? being considered legally disabled such that you get financial benefits or insurance? not being able to do certain things? which things? if someone can do something but it causes great pain or is very difficult, does that count? do you need to be receiving treatment? how much of someone else's struggle do you need to see or know to consider them disabled? \n\nI don't think the issue is that you don't know the right words because you're not a professional. the medical industrial complex has no \"official\" answer anyway. most people in medicine use some combination of the medical model and the economic model and focus on legal and insurance definitions of disability because well, that's really all that's relevant to them. there's definitions are extremely narrow and vary wildly and are often hugely contradictory so they're also not something I would especially put any stock in\n\nlook your boyfriend is TA for lying about his dog. it's not a service dog. it's not a service dog in training. what he's doing is only effective because most workers dont want trouble and have no idea what the legal standards for service dogs are\n\nand from your description of how your BF is handling this, he is at best extremely misinformed about service dogs and how they work. the odds that his dog will ever be a service dog are slim to none, because he's not putting in the necessary work and is almost certainly instilling bad habits in the dog \n\nbut your insistence that your boyfriend isn't disabled is..... super irrelevant to the entire service dog issue? he could be quadriplegic and lying about a service dog and it would still be wrong. no ones disability justifies or excuses them lying about an SD\n\nhe's an AH for the dog. you're an AH for insisting he isn't disabled, and I would do some serious thinking about why this is such an issue for you\n\nI would also maybe do some reading about disability and ADHD because it sounds like you don't really understand either and understanding both are pretty important given your BF"]}