{"id": 1217, "submission_id": "ym39uq", "title": "AITA for distancing myself", "selftext": "Hi there,\n\nTo be brief, I have been friends with the same group since we were teenagers and we’re now in our 30’s with almost all of us in harmony.\n\nHowever, one week ago I was speaking to friends in a group chat and I uploaded a picture of a doll which resembled my one friends neighbor, thinking it would be a funny thing we could all laugh at without any harm. \n\nThe one friend (X) then spoke up and said that his neighbor would cause physical harm to me (albeit jokingly?), to the group of all my friends. \n\nI took this as a slight and even though I uploaded the picture I still felt it was an overreaction- I mean, it’s his neighbor who would never see the picture and felt it was harmless fun.  I also then left the group so-as to distance myself from X, because it wouldn’t serve my hope of keeping open communication with my friends without his toxic comments.\n\nAfter this, X then asked to stay at my house in a few weeks so he could attend another one of our mutual friends wedding in December.  \n\nOvercame by his overreaction I texted X and requested an apology.  I also said he could not stay with me until the condition was met and hoped he would meet this requirement, but a week later this has not happened.\n\nI’ve spoken to other friends in this chat about X’s behavior and they all think he can be hasty at times, but this leaves me distanced from my friends (who all live 4 hours+ away) and without further recourse.  \n\nThanks for reading and for your input.", "created_utc": 1667578851, "permalink": "/r/AmItheAsshole/comments/ym39uq/aita_for_distancing_myself/", "score": 1, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because I posted a picture of a doll that resembled my friends neighbor\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi there,\n\nTo be brief, I have been friends with the same group since we were teenagers and we’re now in our 30’s with almost all of us in harmony.\n\nHowever, one week ago I was speaking to friends in a group chat and I uploaded a picture of a doll which resembled my one friends neighbor, thinking it would be a funny thing we could all laugh at without any harm. \n\nThe one friend (X) then spoke up and said that his neighbor would cause physical harm to me (albeit jokingly?), to the group of all my friends. \n\nI took this as a slight and even though I uploaded the picture I still felt it was an overreaction- I mean, it’s his neighbor who would never see the picture and felt it was harmless fun.  I also then left the group so-as to distance myself from X, because it wouldn’t serve my hope of keeping open communication with my friends without his toxic comments.\n\nAfter this, X then asked to stay at my house in a few weeks so he could attend another one of our mutual friends wedding in December.  \n\nOvercame by his overreaction I texted X and requested an apology.  I also said he could not stay with me until the condition was met and hoped he would meet this requirement, but a week later this has not happened.\n\nI’ve spoken to other friends in this chat about X’s behavior and they all think he can be hasty at times, but this leaves me distanced from my friends (who all live 4 hours+ away) and without further recourse.  \n\nThanks for reading and for your input.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  I would have just said no.  The apology would be meaningless anyway.", "If I understand correctly, you posted something on the internet making fun of your friend’s neighbor. When friend pointed out that wasn’t nice, you got offended and quit your friend group. When your friend tried to forget about the whole thing and asked if he could stay with you, you brought it up again and made a big issue about it. Now you are trying to cause bad feelings toward that friend amongst your other friends…and you call HIM toxic?\n\nI just don’t get it. Unless I misunderstand something here, YTA.  Clearly.", "YTA. You make a joke about X's neighbor and X makes a joke about the neighbor's potential reaction... And you're angry about what exactly? Are you worried X will show the neighbor your joke and so you're afraid? Because if not I don't understand why you'd leave the group and demand an apology", "To add - this wouldn’t be the first time this friend has said subtle demeaning comments.  Only the first time I’ve  spoken up about it.", "I know it’s not my job to teach humility but as a friend of 10+ years I felt it best to provide context as to why he wasn’t welcome.", "Thanks for the reply.  To add, the picture was meant to jab at the friends neighbor, but it had been done several times before even by the friend who became hasty.  \n\nI also wasn’t circling the wagons with pitchforks and haven’t asked any friends about this encounter since it happened.  The behavioral talks came from these friends, from earlier than this encounter, unprovoked by me.", "To me it appeared as if he was trying to say something demeaning.  I honestly don’t care if the neighbor saw it because it was a picture of a doll who just looked like his neighbor.", "That is a long time.", "I don't know, it seems as though you are the one who overreacted to a joke and allowed that to abandon a friendship of 10 years.  YTA", "What was demeaning?\n\nI can understand not being comfortable with jokes about violence - does your friend know you don't like this? And if not, why not just privately say you're uncomfortable with it instead of acting like he intentionally meant to hurt you", "IDK - having someone say they are going to cause physical harm to me sounds like a lousy way to continue the joke, but I could be wrong.", "No he doesn’t know that I don’t like to be told someone will cause physical harm to me.  I felt it was common knowledge that most people dislike being told someone will cause physical harm to you.", "I guess it was demeaning because no one likes to be told that they would be hurt by someone else."]}