{"id": 1218, "submission_id": "ym39kv", "title": "AITA for saying that my mother made me depressed?", "selftext": "I(15F) had fight with my mother. Ok so for context my mother and I had a rather \"complicated relationship\" she really loves me but sometimes when she is angry says horrible things to me. Some of which I have forgiven, some of them I just can't. For example:\n\n\"You will have no choice but to be a prostitute to make a living\" Context: I got really bad grades like horrible grades and had no excuse for it. She had a right to be upset  but I think this was just uncalled for.\n\n\"Should've gotten the abortion.\" Context: I was crying late at night while studying because, I was feeling hopeless and thought I should just give up. My mom thought I was crying because I had to study late at night and was just being lazy so it was just a misunderstanding.\n\nThese were just a few extreme comments she made. She always apologized after but said something like \"people say crazy stuff when they're angry, don't get hung up on it\" which made me believe she suffered from emotional abuse from her parents as well(she actually did), so I understood to a certain extent. We were just trapped in this really unfortunate cycle of generational abuse.\n\nSo recently we had a fight that crossed many boundaries.  It was about me being sad all the time when we go outside. I've been struggling with some body issues and sense of self. I felt ugly, unworthy and  like an idiot all the time. We were getting food and my mom told me to smile and be happy, I said that I feel unhappy all the time and I can't help it. She burst into anger right away and went on and on about how much I've humiliated her, how I act so arrogant around her like as if I am doing her a service. She said, she wishes she didn't have a daughter and she would never live with me and told me not call her  mom anymore. She called me stuff like mental,crazy,psychopath and selfish. she also called me unsmart and that I would never have someone to care for me.\n\nShe also brought up how I bought clothes with money gifted to me. My mom is sahm and always complains my dad doesn't give much money to her so I felt guilty about using her money. I also feel guilty when I do bad at tests and remember how much money she is wasting on me.\n\nSo I also burst out and said, you made me that way. That her words finally got to me and I began self-deprecating myself. I said that she is a horrible mom and that I don't want to live with her either.\n\nAfter we went home she apologised to me and said \"okay I am horrible mom\"\n\nI felt really guilty then, and realised my depression had been affecting her too. I felt that I was the one emotionally abusing her. AITA?", "created_utc": 1667578834, "permalink": "/r/AmItheAsshole/comments/ym39kv/aita_for_saying_that_my_mother_made_me_depressed/", "score": 2, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called my mother a horrible mom. It makes me the asshole because while my mother might be rude towards me sometimes, she provides for me and takes great care of me. I have been struggling depression and other stuff so I might be unintentionally emotionally abusing  my mother\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your mother sounds emotionally abusive.", "NTA - you are right that your mom has most definitely experienced emotional trauma. And instead of ending cycle of abuse, your mom is perpetuating it.\n\nAs a 15-year-old, It is not your job to look after your mother’s emotions. she is being manipulative and by guilting you she is ignoring the hurt she caused,  and manipulating you to focus on her fake hurt. \n\n\nYour mom is holding you to higher standards Then she is able to hold her self to. You are a child….you are a teenager. She is an adult. It is her job to look after your emotional well-being. It is not your job to look after her emotional well-being.\n\nI am very sorry you’re experiencing this. She won’t change. She is likely a narcissist, or has borderline personality Disorder. the best you can do is accept her for who she is and try your very best to not let it affect you.. but it of course will.\n\nLook into some books on parents with narcissism, border personality disorder, or even just emotional immaturity. Most local libraries let you sign up online and you can link to an app that will let you download books and audio books so no one has to know what you’re doing. \n\nMy mom is also like this. Thankfully I’m 32 and I don’t have to live with it anymore. I’ve been spending my 30s reflecting on my childhood and dealing with the trauma. My mom yelled at my sister the way your mom is yelling at you. My mom did not allow me to have emotions, besides “happy perfect child”.  I was not allowed to be sad, mad, god forbid I cry. I have a distinct memory of my mom telling me that I am not allowed to cry.\n\nBecause of this, I’m a hyper independent people pleaser. I want everyone to like me and I freak out internally, (of course never visibly) if anyone does not like me or if I get insulted. I don’t let other people in. I have huge walls built as I’ve learned I can’t trust other people with my emotional well being…The only person I can trust is myself.  I have anxiety and I’m a pro at having anxiety attacks around ppl without them knowing. It breaks my bfs heart…he tells me to tell him when it happens and I just CAN’T. \n\nNow don’t feel too bad for me, as ugly as all that is. I bought my own house by myself at 25. I make 6 figures. My hyper independence does have a good side.\n\nWhy am I telling you this? I’m not sure. Maybe I see myself in this situation. Hopefully something I said here is useful? \n\nUnfortunately growing up in the 90s and early 2000s, we didn’t have all these great tools that you have.  Even Reddit can be so helpful… here  you can learn from other people and talk about this and learn that this upbringing  isn’t normal. I thought this was normal. I thought this was life. \n\nI remember watching an episode I think Lizzy McGuire, and in the episode, Lizzie and her mom got into a fight. After the fight, the mom reflected, knocked on Lizzys door, and when she was allowed in, she apologized genuinely to Lizzy. I distinctly remember thinking “what Disney garbage. Moms don’t do that. moms would never apologize.” I was so warped into thinking my family situation was normal. \n\nSo yeah…long story short, you will NEVER be the asshole in this situation. Feel free to message me privately if you want to and we can talk more.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(15F) had fight with my mother. Ok so for context my mother and I had a rather \"complicated relationship\" she really loves me but sometimes when she is angry says horrible things to me. Some of which I have forgiven, some of them I just can't. For example:\n\n\"You will have no choice but to be a prostitute to make a living\" Context: I got really bad grades like horrible grades and had no excuse for it. She had a right to be upset  but I think this was just uncalled for.\n\n\"Should've gotten the abortion.\" Context: I was crying late at night while studying because, I was feeling hopeless and thought I should just give up. My mom thought I was crying because I had to study late at night and was just being lazy so it was just a misunderstanding.\n\nThese were just a few extreme comments she made. She always apologized after but said something like \"people say crazy stuff when they're angry, don't get hung up on it\" which made me believe she suffered from emotional abuse from her parents as well(she actually did), so I understood to a certain extent. We were just trapped in this really unfortunate cycle of generational abuse.\n\nSo recently we had a fight that crossed many boundaries.  It was about me being sad all the time when we go outside. I've been struggling with some body issues and sense of self. I felt ugly, unworthy and  like an idiot all the time. We were getting food and my mom told me to smile and be happy, I said that I feel unhappy all the time and I can't help it. She burst into anger right away and went on and on about how much I've humiliated her, how I act so arrogant around her like as if I am doing her a service. She said, she wishes she didn't have a daughter and she would never live with me and told me not call her  mom anymore. She called me stuff like mental,crazy,psychopath and selfish. she also called me unsmart and that I would never have someone to care for me.\n\nShe also brought up how I bought clothes with money gifted to me. My mom is sahm and always complains my dad doesn't give much money to her so I felt guilty about using her money. I also feel guilty when I do bad at tests and remember how much money she is wasting on me.\n\nSo I also burst out and said, you made me that way. That her words finally got to me and I began self-deprecating myself. I said that she is a horrible mom and that I don't want to live with her either.\n\nAfter we went home she apologised to me and said \"okay I am horrible mom\"\n\nI felt really guilty then, and realised my depression had been affecting her too. I felt that I was the one emotionally abusing her. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Sweets, you were correct about your mention of generational abuse. That’s your mother’s fault, she saw the way her parents treated her and decided that she was going to treat her child the same way. I doubt that you would make that choice. All of the things that you feel bad about are normal teenager thing, things children are supposed to do. Do not feel bad, you are not a bad kid, it sounds like you have a bad mom. i’m so sorry, but don’t internalize her hatred and anger, you are so much more than what she thinks you are. NTA"]}