{"id": 12189, "submission_id": "11q7ipp", "title": "AITA for telling my sister to stop being selfish after she said she won't come to my wedding, because her younger kids aren't invited?", "selftext": "Throwaway\n\nMy wedding is coming up towards the end of the year. We don't want noisy kids running around the place and also money reasons, me and my fiance decided that our wedding will be 13 and up.\n\nOne of my (34F) sisters \"Tammy\" (38F) has 3 kids (16F, 9M, 7F). My 16 yo niece is invited, but the 9 yo and 7 yo aren't.\n\nTammy didn't take this well and pretty much went off at me. We do have one exception to this, my FBIL's son who's 11 (12 at the wedding). Tammy tried using that as an \"example\" and also said her 16 yo is invited, but I told her that's because she's over 13 and my niece too.\n\nShe did seem to understand and calmed down, but recently told me she won't be coming because of this. On top of that, my niece is also saying she won't come because it's \"unfair\".\n\nMe and Tammy had a huge argument over this and I told her to stop being selfish, my guest list is my guest list and she's acting like she's doing the world a huge favor.\n\nShe got really upset with me and we haven't talked since then. I didn't apologize to her.\n\nMy other sister is telling me I was an ass for saying that to Tammy.\n\nAITA?", "created_utc": 1678708210, "permalink": "/r/AmItheAsshole/comments/11q7ipp/aita_for_telling_my_sister_to_stop_being_selfish/", "score": 362, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my sister to stop acting selfish and like she's doing the world a favor, after she said she won't come to my wedding because her younger kids aren't invited. I might've been too harsh with what I said to her and not understanding, which makes me the AH.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA\n\nYou’ve [conveniently left out the part](https://www.reddit.com/r/AmItheAsshole/comments/11q7ipp/aita_for_telling_my_sister_to_stop_being_selfish/jc1ohls/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) where you only consider 16F your “real” niece and not the other two because Tammy adopted them a few years ago. \n\nYou’ve proven to be an unreliable narrator, so I’m having trouble believing that the other 2 being adopted has *nothing* to do with why you don’t want them there.", "YTA. \n\n>I told her to stop being selfish\n\nShe isn't being selfish. She's making a choice.\n\n>my guest list is my guest list\n\nIt's an invitation which she is not obliged to accept. You don't have to have children there if they are below a certain age and she doesn't have to go.", "It’s your right not to want children at your party. But it’s also their right not to want to come.", "YTA\n\nIf you decide to have a childfree wedding, you can't be mad at parents for not coming because their child can't come.", "YTA. You can have whatever rules you want for your wedding, but you need to be prepared that those rules may mean that some people will choose not to attend.", "YTA\n\n>We do have one exception to this, my FBIL's son who's 11 (12 at the wedding)\n\n It's your wedding and you can invite whoever you want but I think that make an exception for no reason is really unfair.\r  \nIf none under 13 is invited, then also your nephew shouldn't be there, you are making preferences", "YTA you can make whatever rules you like, but people can decline going. I can see your sisters side. I'd have no problem leaving all my kids at home. But I'm not excluding some.\n\nEdit:  so the blood kid is included but not the others.  Can you see how terrible that looks. I definitely wouldn't be going.", "Yta. She's explained why she isn't coming. You've already broken your rule then got offended as she has other kids to think of. The fact your saying her not going is selfish when she's looking after her kids is beyond. You definately dont have any", "YTA.\n\n>We do have one exception to this, my FBIL's son who's 11 (12 at the wedding).\n\nYou made a rule for 13 and up but made an exception? How is that fair OP? If you’re going to make rules, stick to them. \n\nYou can make your rules for your wedding but don’t make exceptions for people, make things fair. Your sister isn’t being selfish at all for refusing to leave her other kids behind. In fact, she is doing what any mother would do. Besides, her going to the wedding is NOT an obligation. Tammy is more than entitled to not show up for any reason including no reason\n\nEDIT: It has come to my attention that this has nothing to do with age. [You're excluding these kids because they aren't biologically Tammy's and she adopted them.](https://www.reddit.com/r/AmItheAsshole/comments/11q7ipp/aita_for_telling_my_sister_to_stop_being_selfish/jc1ohls/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) You even admit that the younger kids are nice, you said in your comment that you don’t see them as your \"acutal\" niece and nephew. You’re even more of an asshole. I had a feeling there was more to this and that age wasn’t the reason. If age was the reason, why is your FBIL excluded from that rule? You simply don’t see these kids as family and have the audacity to call Tammy selfish for refusing to attend your wedding? Even the oldest daughter seen how unfair this was and opted to not attend. Tammy might go LC or NC with you after this", "Your wedding, your rules. \n\nBut definitely YTA for saying what you said. You didn’t have to explain yourself at all. You could have been graceful about it and say “got it, you’ll be missed.” Instead you told her she’s selfish. Own up to it.", "YTA.  Honestly inviting one kid from the family and not the others is awful. You’re telling your younger nieces and nephews that they are not welcome. If you’re making exceptions it’s not a rule. It’s fine to say “no kids” but to say some can come and others can’t is an AH move.\n\nETA I read below the younger two are your ADOPTED niece and nephew.  It’s extra AH to not clue in to why your sister might be hurt more than the average mom in this scenario.  Good chance even healthy adopted kids have some trauma around not fitting in or really being part of a family and you’re definitely stepping on that nerve. By mom going despite the rule she is telling them subtly that she tolerates her adoptive kids differently.", "YTA. You can invite or not invite whoever you want,  it's your wedding. But you're not entitled to someone's attendance, even your sister's. A lot of people don't seem to realize that when they make their weddings \"kid-free\", they also take the risk that guests will children will be unable or unwilling to attend. This is especially true with family members because often the guest's regular babysitter is a family member and also attending the wedding. \n\nYou sound like the selfish one to me.", "YTA for already allowing a 12 year old to attend.  Do you like your family? \n\nIts your wedding do as you please but she can also chose not to attend over this.  I wouldn't attend my sisters wedding if my kid wasn't included.  Sorry.", "YTA. not for having an age limit for your wedding guests, but for calling your sister selfish for not planning to attend, (which is what you asked).  \n\nalso you’re an ass for feeling that your sisters younger kids are not your “real” niece/nephew, cuz she adopted them later.  i completely understand why your sister and niece are not attending.", "YTA. Any guest is allowed to decline your invitation for any reason.  You should not have argued with your sister when she said she wasn’t coming.  You can invite anyone you want to your wedding, but expect trouble when you announce rules and then allow only certain people to have exceptions to the rules.", "You are allowed to invite who you please. The people you invite also have the right to not attend. Unfortunately when you decide to exclude a population there are going to people who cant attend. \nYta suck it up cupcake the world doesn't revolve around your wedding.", "YTA for making a “rule” and then an exception for your BIL. \n\nBut like everyone always says, your wedding, your way. It’s the one day of your life, other than the day you give birth, when Reddit says you can act like a dictator. Lol", "Info: are these your only nieces and nephews?\n\nEDITED: Just saw you don't consider them family because they are adopted. YTA. \n\nAlso, is this a family only wedding, or you're just excluding them to make a point of letting them know they aren't family.", "YTA because instead of being gracious, you're being dramatic and petty. I can understand why you wouldn't want young kids at your wedding. I also understand why Tammy is upset that you seem to be fine with certain children but not hers.\n\nYou invited her with conditions. She didn't like those conditions and isn't coming. Seems fair.", "YTA - why does FBIL get the kid exception and your sister doesn't? \n\nTBH, I don't know how you can expect your sister to only bring one of her kids. A 9 and 7 year old aren't going to \"ruin\" your wedding the way an under 5 kid would.", "YTA because you're not having a child free wedding, whcih if you were you would be completely entitled to do so and your sister would be TA if she pushed for exceptions to the rule. You're having a \"not related by blood\"-free wedding. So I bet she's only pushing for exceptions and for dragging the argument out because she knows about the other kid. If you were genuinely having a childfree wedding, and your sister was acting like an entitle mombie, then you'd be justified in your argument. But that's not what's happening here, so you don't.\n\nHave your wedding whichever way it is because after all, it's your wedding and you're paying for it, but you need to re-examine your idea of \"family\".", "YTA. You can invite or not invite whoever you want to your wedding but when you choose to invite some members of a family but not others you have no right to get upset or call people selfish if some people choose not to attend because some of their family is not invited. \nAnd it is unfair that you are making an exception by inviting your future nephew who is under 13 but not making an exception for your own niece and nephew. If your wedding is 13 and up no child under the age of 13 should be invited.", "YTA\nIt’s an invitation, not a summons. \n\nThe no-kids part makes it more difficult to arrange, so your seater has declined. A little more grace on both sides would have been nice, but both of you are upset and I’m not going to gong either party for that.\n\nUltimately you aren’t taking no for an answer. For that, YTA.", "If you choose to have a childfree wedding, also expect that some people will choose to not come for that reason. Your guest list is your guest list, and her choice is her choice. For calling her selfish YTA.\n\n However, it seems like the real reason they are not invited is because they are not blood related, and that's why your sister is saying its not fair and you conveniently left that out. That makes you even more of an Ah.", "Your sister saving kids life = legend\n\n&#x200B;\n\nYou spending ungodly amounts to marry someone for a few years = clown", "YTA.  I just saw the edits about the two adopted children.  It's not about FBIL's son or your 16-year-old niece, it's that your sister's younger children are adopted.  I originally was ESH, but you win YTA by a long shot.\n\nPart of original still stands: You made an exception for FBIL's son (at the wedding), well it should have been for your sister's children also.  In addition, you have to accept that when you make rules for your wedding, that some guest may not come.", "YTA for telling her she is selfish. She is not - she just decided that she won't go if all her kids aren't invited. You don't have to invite them! But respect her decision! You can have whatever rules you want at your wedding but prepare that people may opt out.", "YTA. Mainly because of your attitude. Yeah it’s your guest list but she has every right not to go to YOUR wedding and accusing her of being selfish is hypocritical. Hiring babysitters are a pain and extra expense along with some people don’t like leaving their kids out of things so they don’t have to go if they don’t want and you can invite anyone you want", "YTA it's your wedding so you (and your future husband) can decide who you invite and who you don't invite with or without a specific reason. BUT when you invite someone you can't order them to come you can only invite them. Whoever is invited by you has then the right to decide if they want to come or not with or without a specific reason.\n\nYou decided to exclude children from your wedding, which is your right, but your decision has consequences (your sister and niece deciding not to come) and if you want to stand by that decision, you have to live with those consequences.\n\nYes it's your wedding but - what some brides don't seem to understand is - that doesn't mean that your wish is command to everyone else and the world doesn't revolve around you for that day.", "YTA. You are absolutely free to set an age requirement for your wedding. It's YOUR wedding. But you can't be pissy when parents opt not to come because of your rule. Especially a parent who had one child who was invited and two who were not.", "Your Sister Sent Her Regrets. YTA !!", "YTA - Having a child free wedding is fine. Purposefully and obviously excluding your sister's adopted children is not okay. You are not even trying to hide what you are doing. Why make the cutoff 13 and then make an exception for your FBIL's 12yo? Why not just make the cutoff 12?", "YTA\n\nThe thing about childfree weddings is that you can restrict who is allowed to come, but then you have to be prepared for hurt feelings on the part of the parents and the kids, and you have to be prepared for families to say no. And that's okay. *You chose not to invite everyone in their family, so they can say no*. \n\nYou also get into really dicey territory when you start making exceptions for some people's kids and not others. You originally said the rule was 13 and up, but now you are making an exception for BIL's son who will be 12. So why does he get to be the exception, and not your sister's two children? Of course your sister would be pissed about this. I would be, too.", "YTA\n\nCalling her selfish is an ironic low blow. \n\nIt's an invitation, not a summons. Selfish is being pissed off that your invitation is declined.", "YTA \n\nThere are a lot of reasons why, but this is the most glaring l:\n\n>16 yo is ***actually my niece*** because she's my eldest sister's daughter, but Tammy ***adopted the others*** much later.\n\nThose children **ARE STILL ACTUALLY** your niece and nephew, too. Them not being biologically related to you doesn't negate that.\n\nHuge. Mega. Massive AH.", "YTA for calling her selfish\n\nIt is fine for you to decide who you want on your guest list.  And your guests are free to decide whether to accept or decline the invite.  \n\nBut you calling your sister selfish is what makes you the AH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway\n\nMy wedding is coming up towards the end of the year. We don't want noisy kids running around the place and also money reasons, me and my fiance decided that our wedding will be 13 and up.\n\nOne of my (34F) sisters \"Tammy\" (38F) has 3 kids (16F, 9M, 7F). My 16 yo niece is invited, but the 9 yo and 7 yo aren't. \n\nTammy didn't take this well and pretty much went off at me. We do have one exception to this, my FBIL's son who's 11 (12 at the wedding). Tammy tried using that as an \"example\" and also said her 16 yo is invited, but I told her that's because she's over 13, older and my niece.\n\nShe did seem to understand and calmed down, but recently told me she won't be coming because of this. On top of that, my niece is also saying she won't come because it's \"unfair\".\n\nMe and Tammy had a huge argument over this and I told her to stop being selfish, my guest list is my guest list and she's acting like she's doing the world a huge favor.\n\nShe got really upset with me and we haven't talked since then. I didn't apologize to her.\n\nMy other sister is telling me I was an ass for saying that to Tammy.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yta. You're perfectly entitled to not invite kids, but your sis is perfectly entitled to choose what is best for her family and not go. That isn't being selfish, that's making a decision, jsut as you made a decision not to invite kids.", "YTA you make exceptions for one family member but not the other 🙄.  It’s your own fault she’s not coming.  If you have stupid rules for your wedding so that a guest doesn’t come that’s on you.", "YTA - she’s not telling you who you can and can’t invite, she’s REACTING to who you didn’t invite. That’s not being selfish, that is the predictable reaction of a parent.", "YTA You said 13 and up made an exception for an 11yr old. Either you stick to your own rules or allow your sister to bring all three of her children.", "YTA you are having a child free wedding. There will be parents who cannot or will not attend without their children.", "YTA.  You don’t have a “no kids under 13 rule,” you have a “only some of my sister’s minor children are invited” rule.", "You don't have to invite anyone you don't want to. I'd agree that it is strange to invite some kind from the family but not others. They declined the invitation, which is fair. She doesn't have to come if she doesn't want to, how is that selfish? \nWhat makes YTA is the way you handled the situation.", "I think every wedding should be childfree lol. But I don’t understand why the exception for FBIL’s 12 yr old? I can’t blame your sister for being WTF about that.🤷🏻‍♀️", "Are you kidding? What basis is the exception? If it’s not cast iron you are the AH.", "YTA\n\nYou want a child free wedding that’s your choice but other people get to make their choices, if your sister and niece don’t want to come then they are doing you a favour, they are saving you money.", "YTA. You can have child free weddings, but you have to accept that means some people won’t come. Just like destination weddings. It’s called a consequence for your decision and you have to accept it as part of limiting attendance.", "HEH???  YTA of course.\n\nIs there an age-limit or is this just to exclude the adopted ones?", "Yta big time.  All kids invited or none.  What a rotten aunt!", "So why not the adopted kids? Don't like their skin color or what? YTA", "NAH \n\nIt is totally your wedding and you're allowed to make it child free. Totally understand not wanting it to be a kids fest.\n\nTammy's been put in an awkward position. Her younger 2 kids aren't toddlers, they're going to be fully aware their sister was invited to their aunts wedding and they weren't 7 and 9 is plenty old enough to understand and be immensely hurt by that.  Tammy shouldn't go if she thinks it's going to be better for her kids, especially because it sounds like they know at this point. She's not being selfish she's protecting her kids.", "NTA your wedding your choice but I think by making an exception you've shown there is some wiggle room which is why you're getting backlash now. I think when making this a childfree wedding you kinda have to blanket it to all kids no exceptions and stay firm with it because otherwise it turns into a \"why are they allowed an exception and not me\"\n\nEDIT: changing my opinion to YTA for the new info coming out... Clearly more going on that needed to be included in the initial post", "NAH. Your wedding so you make up the rules. Like a 13+ rule that you broke for your FBIL's kid which you won't break for your own niece and nephew. \n\nAgain, your wedding so your rules. Just means that some people might not want to attend. Props to your niece for showing solidarity with her siblings.", "ESH\n\nTammy is indeed an AH for the way she has drug this out into a fight. However, she is justified in her frustration. She is justified in electing not to go because she doesn't want 2 of her 3 kids to feel slighted, and her oldest daughter staying home with her shows that they probably all take some offense to this.\n\nYou, on the other hand, need to pick a side. If the wedding is 13+up, then your FBIL's daughter ought to not be exempt from that rule. If you really want her to be there, why wouldn't you have made the invite 12+up to include her by rule? When you made exceptions to rules, no one understands why the rules are there. I'm fine with the rule and even fine with you having final say of the guest list but I don't get how you look at Tammy and think that she's truly coming to you out of a place of selfishness.", "~~You have a rule in place. It's your wedding so what you want is important. You're not the AH.~~\n\n~~Your sister does not want to adhere to that rule so isn't coming. She is not the AH.~~\n\n~~You would be the AH if you try insisting she attends and leaves her kids behind. if you're going to have a no child rule you have to expect a number of parents to therefore not come.~~\n\nYou've provided more info in your comments that basically indicate the younger ones aren't welcome as they aren't bio family. That makes YTA.", "[deleted]", "EDIT - YTA. changing my decisions based on the comments/ new info below \n\nOriginal comment \n\nTammy for being so extra about her younger kids attending BC honestly why would they want to come? I'm not being rude but I HATED going to weddings as a child. I found them horrible, being asked to sit in uncomfortable clothes for hours while grown ups droned on and on. I'm still bored out of my mind at them as an adult.  \n\nYou for the 13 and over rule with exceptions. Do not make 'exceptions' BC that reads as purposely excluding certain people. You openly state one child will be 12 at the wedding, whelp 12 is not 13 so what's the point of the rule at that point ? \n\nMaybe ask WHY your niblings are so interested in coming to the wedding. As a mother of three I am delighted to go anywhere without my kids for a night. \n\nRemember everyone has the right to pick who comes to their wedding /party but that does not mean everyone around them is going to be happy about it. People are going to react how they will react. You can't control that, for better or worse.", "NAH\n\nIt's your wedding - if you don't want kids there, don't invite kids.  My wedding was \"no kids\".  However, we did allow my step sister to bring her children.  I would personally not exclude a direct family member.  I had a few cousins who were excluded.\n\nIf your sister has 2 kids who she doesn't want to get a babysitter for and/or doesn't want to exclude, that's her choice.\n\nPeople and their weddings need to realize that they are not the center of the universe.  It's a half day party and that's it.  It's your party. and you can make the rules.  BUT, it's not incumbent on everyone in your circle to accommodate, particularly when you're making rules that inconvenience them.  I am personally thrilled when I get a wedding invite that is \"no kids\" because it gives me a copout to skip the whole dumb, damned affair.\n\nThinking about it more > Excluding your sister's kids feels \"small\" of you though, so maybe YTA since it feels like you're unnecessarily hurting your sister.", "ESH. You suck for telling her thats she's being selfish and acting like she's doing the world a huge favor. She can choose not to go to your wedding because her kids aren't going. I think that's a lame reason, if I had kids, I would love a night out without kids, but I understand some parents are like that. She sucks for arguing over your guest list. It's your wedding and your guest list. If you don't want kids of a certain age, that's fine. Weddings aren't for kids anyways. It's boring as shit for them. She should have just said \"ok, I'm sorry but I won't be able to make it\".", "NTA. Tell her you're sorry she can't make it but you'll be sure to share some pics with her. \n\nShe's trying to guilt you into letting her bring all three of her rugrats. No way. It's your wedding, stand firm. It's her loss.", "ESH. Your sister should have accepted your decision not to include children of a certain age. You should have accepted her decision not to come.", "NAH\n\nYou're wedding.....you're guest list. Your choice.\n\n\nIf she declined to go then let her. That's her choice.", "YTA. When you have a child-free (or under 13-free) wedding, you do it with the knowledge that some people won’t be able to come. It sucks that it’s your sister and her family, but a lot of her ordinary childcare options will probably be at your wedding.\n\nAlso, you absolutely have the right to this boundary, but I hope you can understand how it might make her other two kids feel excluded when their sister is allowed to go and have some empathy for that.", "Why don’t you want your sister’s adopted children at your wedding?", "YTA- you want to have a child free wedding, that is your right. You have no right to complain when people with those excluded kids decide not to come. \nYour obvious lack of affection for your sisters adopted kids makes you an asshole on a whole other level.", "The minute you made an exception for an 11/12 year old, you became TA. If you had made the age limit 12, you would not be.\n\nDid that even cross your mind?", "YTA. Who is going to watch the 7 & 9-year-olds while their parents and older siblings are supposed to be at your wedding?! Are you going to pay for childcare for them? It may be your guest list, but your guests are not obligated to come. Family or not. Stop expecting people to drop everything just because you're getting married. Get over yourself and grow up.", "Yep YTA\n\nYou're allowed to invite who you want but you're literally not inviting two of them because they were adopted, your niece was adopted by your sister so she only counts as family because she was born from a different family member and then adopted by your sister.\n\nEnjoy the rift, resentment and possible LC or NC you have created on your own.", "YTA.\n\nI guess we can close the sub now, probably found the biggest, stinkiest asshole there is.", "This seems to be one of those examples of someone knows they are the asshole and are looking for someone to tell them otherwise so they feel better.  \n\n\nYes.  YTA.", "YTA.\nYou have a right to the wedding you want.\nThey have a right to decline because your silly little desires only really exclude the adopted children (and you thought you could bury that lede, you little shrew).\n\nYou can piss and moan about that all you like but *you're* the reason why this is happening. \nShe's not selfish. She's just decided that her children are more important than your day, and that's her right.", "YTA\n\nAn invitation is not a requirement.  Tammy declined your invitation which she is entitled to do.  You are also entitled to dictate the ages of your guest list.  You are not entitled to get angry with parents of young children when they choose to decline your invitation.\n\nYou may not consider Tammy’s younger children your “real” nieces/nephews but she sure considers them her children.  Even her teenage daughter considers them her siblings.  \n\nYou even bent your own rules by allowing a 12 year old.  So much for the “under 13 not allowed”.  Either ban the 12 year old or allow everyone to bring their children.", "YTA. It's fine to have a child free wedding, but you have to understand that that will mean a lot of parents won't be able to come. Your wedding is the most important thing happening in YOUR life. You're an AH to expect it's the most important thing to anyone but you.", "YTA. Even in child free weddings there are often exceptions for immediate family. 13 is a strange age to pick if it only includes one immediate niece/nephew out of a group.", "YTA.", "Yta it's an invitation, not a summons.  If she doesn't want to come bc her younger 2 aren't invited then she doesn't have to come. \n\nAlso, why the exception for the little boy?", "YTA \n\nNot for having an age limit, but for hassling your sister. \n\nYou sent an invite, not a summons.", "YTA.   \nYou're having the wedding you want. So far, no asshole. \n\nYour sister has decided that for reasons of her own, she won't go. So far, no asshole. \n\nThe reason you're TA is because you're accusing your sister of being selfish for abiding by the rules you set. She was correct to be upset with you, and you need to apologize very humbly and get yourself right.", "Yta, it’s an invitation not a summons. They don’t have to go.", "YTA people who exclude some of their siblings' kids but not others are HUGE assholes.", "Look at it this way.\n\nIf you couldn't have kids and had to adopt or you had to use an egg or sperm donor, how would you feel if people treated your kid like you are treating her kids?\n\nWouldn't like it would you? \n\nMassive AH", "leaning towards YTA, but a bit of NAH\n\ni support your decision to have a childfree wedding (i read a lot of stories here on reddit how kids and weddings just don't mix well), but you could have gone without blowing up on her (although i can understand somewhat from where you're coming from, you want her there as she's your sister, but don't want the kids since childfree wedding) but you have to accept your sister and the kids are a package deal, either take it or leave it\n\nyou should definitely apologize though, but if you really don't want the kids there, accept her decision", "nah you're goddamn right", "NTA.\n\nIt's your wedding, so you invite whom you want. If you make a rule about age and then allow an exception, it's still your wedding.\n\nThis is the problem with explaining yourself to people throwing a tantrum because they aren't getting what they want. You're just giving them data to fight about. How come she got a blue dress and mine is yellow? How come he's eating pistachio cake and I got devil's food? \n\nThey can come or not come, who cares? Does it really make a difference if Tammy comes, or her niece or whoever it is in these ridiculous family dramas? Send out the invitations and let them RSVP as they want. They come? Good. They don't come? Good. It's up to you whom you ask and up to them if they attend.\n\nIsn't there enough angst in the world without Tammy throwing herself around because it isn't the way she wants? Who cares what she wants?", "It’s your day your wishes. She can like it or lump it. Congratulations on your wedding", "NTA\n\nI mean it's telling that your own sibling would choose to not attend vs spend a few hour apart from some of her kids. It's not about care, it's not about travel, it's just the principle and she's choosing it as her hill to die on. \n\nI totally agree that kids have no place at a reception BUT I would consider kids esp immediate family at the ceremony. BY the time they are 7 & 9, they aren't going to be running around during the ceremony.", "NTA it’s your wedding, your rules.", "I don’t think Y T A. No. So i guess N T A. But your sister isn’t T A here for declining your invitation on those grounds, but for arguing with you about it. You get to have your wedding on your terms, and they get to decide if those terms mean they can come or not.\n\nEdited: Changing vote to YTA because you left out relevant info that I got by reading the comments. Adopted nieces are fully nieces. You should be ashamed of yourself", "YTA.\n\nWas leaning towards NAH because having no kids under 13 is fine for your wedding but having an exception for one blood related kid under 13 and not for your adopted niece and nephew put you firmly in YTA territory. Your sister is doing the right thing by not attending the wedding. You really are something else.", "Youre TA votes are completely irrelevant.... While morally wrong its your wedding and you get to decide who to invite. Your reasons don't matter. Tho I agree with your sister. NTA", "Ah, that exception made for FBIL's kid makes sense now. The rule wasn't meant to exclude young kids but the adopted kids. Big YTA.", "Not believing that adopted kids are 'real' family makes OP YTA for life.\n\nI just want to also mention that OP is confusing an 'invitation' with a 'summons'.  She seems to think that just because her sister is on HER guest list than she MUST come.\n\nI'm getting Golden Child/narcissist vibes from OP.", "Oh boy. This changes it from a mild YTA for the choice of language when a parent can't come to a (semi) child free wedding to /r/amithedevil territory.", "I was already going to say YTA to the OP - if you add a stipulation such as “child free” to your wedding you have to expect some people won’t come. But to find out this excludes her adopted niblings makes her even more of an AH. \n\nWeddings really seem to bring out the worst in people.", "Thank you for pointing out the true reason OP is an asshole. I would have said YTA anyway because you can't decide your wedding will be child free and then condemn parents who choose not to attend. Now i know OP is even more of a heinous asshole.", "Exactly. But OP said in another comment that she only views the 16 y/o as her real niece because the other 2 are adopted.", "Looks like you can't have your cake and your kids too.", "This. I fully plan to not allow anyone under 18 at my wedding but if that means some people can’t come, I get that. It’ll be a bummer but planning a childfree wedding automatically means that some people won’t be able to go. If I can’t afford to provide childcare, then I’ll have to accept that a couple of my cousins won’t be there.\n \n\nIf this was really just about the ages of the kids and OP’s sister getting mad about that too, then i’d say E-S-H (since it’s also ridiculous to get angry over age restrictions at someone else’s wedding) BUT OP made it very clear in other comments that she isn’t inviting the younger ones bc she doesn’t see them as her family bc they’re adopted. That’s so fucked that it automatically makes OP the only asshole hers imo.", "This -I had a childfree wedding. Some people, including family members, declined because of it. I expected that and was Ok with whatever decisions these folks made.\n\nYou can't put restrictions on an event and then be upset that folks decline because of it.", "When you don't invite the kids from close family, you've effectively also ruled out their likely baby sitters as they'll all be at the wedding. \n\nI'm 100% in favour of a child free wedding, but its difficult with family.", "Would it make any difference if the rule was no under 12s? \n\n\nThe sister still couldn't bring her other children\n\n\nThat doesn't make op an asshole \n\n\n> Your sister isn’t being selfish at all for refusing to leave her other kids behind. In fact, she is doing what any mother would do.\n\n\nThere are plenty of mother's whonare happy to arrange childcare to attend a wedding, I have multiple children and would not have an issue if there was an event that excluded some \n\n\nWeddings, are long, boring and expensive, my children would probably prefer a weekend at the grandparents over going anyway", "More has come out. It seems she doesn't want the other two there because they are adopted, and she doesn't consider them family. That's why there's an exception for FBIL's 12-year-old son. OP, YTA, and a bleeding one at that.", "No AH here.  Her kids are not invited, she can't come.  Everyone wins.", "No I have 2 others, but they're both over 13", "OP is fine with Tammy's bio kid. The younger ones are adopted.\n\nOP is an AH.", "Exactly. There should be a bot that posts your first sentence and then locks the thread anytime a bride posts about wedding invitation drama on AITA. It's the only thing that matters.\n\nEdit: clarifying.. OOP's the AH", "I totally get where you're coming from, but this actually goes the other way too. They're nice kids, but I'm not really her younger kids aunt. 16 yo is actually my niece because she's my eldest sister's daughter, but Tammy adopted the others much later. And I just think my sister should be there for me on my big day. \n\nIt just seems like she's trying to act holier than thou and dragging my 16 yo niece into it. I mean technically the 16 yo is Tammy's niece too. We're both her aunts.", "Her sister knows why. OP doesn't consider the kids her niblings. They are adopted. The 16 year old is her \"actual niece\"", "The thing is that she doesn't consider them her niece and nephew. The kids being excluded are adopted, and she says that only the 16 year old is her \"actual niece.\"", "OP specified in a comment that the younger two were adopted and only the 16-year old is her \"actual\" niece. OP also made an exception for another child.\n\nNot cool, given the additional info.\n\nEDIT: Link: https://www.reddit.com/r/AmItheAsshole/comments/11q7ipp/aita_for_telling_my_sister_to_stop_being_selfish/jc1ohls?utm_medium=android_app&utm_source=share&context=3", "You'll notice that you are being downvoted because OP did not tell the \"whole story\" until the comment section. The reason the younger 2 are not invited (in spite of an exception for an 11/12 yo) is that they are adopted and she does not consider them to be her \"actual\" niblings.", "But she allowed the FBIL's son to attend, and he is BARELY 12. She also admits that her sister's two youngest kids are \"adopted\", ergo *not* \"related\". This is the reason they are being excluded.", "> Maybe ask WHY your niblings are so interested in coming to the wedding.\n\nShe's answered this in the comments. They are not her \"actual\" niece and nephew, as they are adopted, so she does not want them there. They want to attend because they feel that they ARE family.", "She doesn't want kids that aren't her \"actual\" niblings. She says only the 16yo is her \"actual niece.\" The others are adopted. \nPlus, she's already made an exception to the age rule.", "But how is it fair that there is an exception to this rule? Nothing wrong with OP's age restrictions but why is only one person an exception to this?", "Not every parent is like you. I don’t enjoy myself unless my children are with me and would not go to a wedding without them", "Agree that OP would avoid fights if she refused to explain herself. Explaining means she has to answer questions like, “How come you only invite the children related by blood to you?” and, “How come you said I wasn’t really your niece because I was adopted?”Yeah, OP would look a lot better if she didn’t explain herself because her real reasons make her look like an AH.", "OP is excluding the younger kids because they are adopted. She feels she is not their aunt as a result. Bet this gets fun at Christmastime.", "Oh wow, I missed that one too.  You're right, that changes the whole dynamic.", "Me being dense but what is FBIL? I know BIL is Brother in Law, not sure what the F is?", "Not just YTA, but a “heinous asshole”!!!  Love it!", "OP said in a comment that the reason she doesn't want the younger kids there is because they're adopted, she they're not \"really\" family. \n\nI wouldn't attend either. In fact I don't think I'd have much to do with OP moving forward.", "Yeah but what does make OP the asshole is where Op says in the comments that the two uninvited kids aren’t even REALLY her family because her sister adopted them.", "The real reason OP is excluding them is because they're adopted.", "That is you. I will not attend any event that excludes some or all of my children nor would anyone I know. \nMy children love weddings and always have a great time at the weddings they have attended.", "So these are literally the only children? NTA, you can invite who you want to invite, but you also don't get to dictate how others feel about it.", "You didn't read the comment I made properly, The 16 year old isn't Tammy's bio kid either, she's my eldest sister's daughter. All 3 kids are adopted", "Yeah this makes you an even bigger asshole. \n\nShe has adopted those children. That means *they are really her children*. \n\nAnd as they are the children of your sister, that means *you are really their aunt*. \n\nWhether you like it or not.", "Your sister adopted 2 kids but you aren't their aunt? Uhm.\n\nI think you have a lot more family things to work out than you think. Seems like there's a lot more than wedding drama here. \n\nYikes.\n\nObviously it would be nice if she was able to be there for you but you're putting her in a bad spot. You can't have your cake and eat it too.", "Ahhh and here we have the real reason folks! This is why 16yo is refusing to go and says it's unfair. You're really excluding the younger kids because they're adopted and not blood related to you. This is why Tammy is making a huge stink. Thanks for clearing that up!!", "Double YTA Jesus christ", "You should add that bit about the younger two to your post, specifically the fact that they're adopted, and how you refer to the 16-year old as your \"actual\" niece. It now absolutely appears you're excluding them for being adopted.\n\nFor that reason alone, YTA.", "Adopted is joining the family. You’re drawing a distinction between her bio kid separate from age that her adopted children aren’t really your niece and nephew.  She loves them just the same and of course feels hurt by this.", "If she adopted them then they are her children, which actually does make you their aunt. Maybe this attitude is contributing to the tension over your decision to exclude them.", "Wait, so you don't consider yourself their aunt because they are adopted? That's horrible.", "Cut the crap. \"This goes the other way too\" doesn't apply here. Your sister is not acting \"holier than thou\".\n\nComparing your \"actual\" niece with your (not actual?) adopted niece and nephew is repulsive. By that comment alone I'm guessing there's a lot more to the dynamic at play here than you're including in your little story. If my sister commented about my children like that, I'd be low or no contact and would have absolutely no reservations about not attending her wedding.\n\nYTA.", "YTA you treat her adopted children like they aren't family and then try to play the family card with their mother? You sound very immature and self-centered for a woman planning to marry.", "You truly are disgusting. Your sister adopted those children and is their mother and therefore you are their aunt. The fact that you only consider her older adopter daughter your niece because she is blood related, and you don’t consider her other adopted children your niece and nephew is very telling and is deplorable.\nTammy is refusing to attend your wedding is because she knows her younger children aren’t invited because you don’t consider them your niece and nephew. At least she has raised her 16 year old right and the 16 year old is taking a stand against you for your treatment of her siblings (and don’t say they are not her siblings because they are)", "YTA—you’re those kids’s aunt too, and you keep saying “well the eldest is adopted, too” without any consideration that you were *already her aunt*, even before adoption. You have every right to invite whoever you want, and everybody you invite has the right to decline. If you want them there, make it so they can be there, otherwise suck it up", "So Tammy adopted your other sisters child? If that is the case then the minute the adoption papers were signed the 16 year old was no longer Tammy’s niece, she was and always will be her daughter.", "Oh, so it's not about the age, you're just a judgmental AH who's excluding them because they're adopted? YTA. It would be horrible for your sister to attend (or even have much of a relationship with you) going forward.", "YTA and the real hero here is Tammy.", "Wow, you weren’t the asshole until you said this.", "Oh wow, is there anything worse than YTA that we can judge you as? This is so far beyond asshole territory.", "Was going to say N A H but this comment makes it YTA!", "YTA. Seems purposeful and your family knows it and called you on it. The 16 year old has better morals than you.", "They are her kids, you are their aunt, whether you want to claim them or not.\nYou have shown us all where you think they rank in your family and in your heart.\nYTA", "YTA - why are you surprised she doesn’t want to come? \n\nI bet this wedding is filled with millennial pink.", "Wooow, so it isn’t about their age; it's about them not being related to Tammy biologically. These kids ARE Tammy's kid and you ARE their aunt. I had a feeling something was missing because you made an exception to your own rule\n\nSo the age wasn’t the problem here", "You could read a million comments telling you, you're an AH but it still wouldn't change a thing. Big time YTA", "Wow, yep, YTA", "You're doing yourself no favors here. And to think this all could been avoided by dropping the age to twelve so you wouldn't need an exception.", "Omg I just saw that comment, thanks for linking it in this thread too. That's terrible of OP and definitely changes my opinion to a YTA for purposefully being exclusionary of the adopted kids wtf clearly there's more going on than OP wants to let on", "Well that's doubly disgusting then!!! Guess we know who won't ever be in auntie's will 🙄", "Thank you for pointing this out and that does entirely change my perspective! Definitely the AH", "EEP Whelp that's not good !\n\nDefinitely a YTA situation then. If the kids legit want to go and are being excluded BC they are not blood relations", "I re-read the post and I dont see anywhere that she said the others aren't her actual niblings. There was a vague mention that her niece was 16 and her niece. It's her wedding. She's allowed to make the rules. Her sister can choose whether she wants to go.", "It's one year. The kid is 12 and the age restriction is 13. Regardless, it's OPs wedding and they can invite whoever they want.", "Lol. I said IF I had kids. I don't have kids, but I know I would enjoy some time away from them sometimes if I did have them. I don't think there is anything wrong with that. I also said that I understand some parents are like that (ie. prefer to bring their kids).", "Future", "future", "Future brother-in-law", "Woooow, what a horrible way to exclude the kids", "That's great, but you suggested all mothers would do the same, they wouldn't!", "The FBILs son is under 13 but is invited. And it is clear from OPs comments that the reason the 2 younger children are not invited is because they are her sisters adopted children and OP doesn’t consider them her niece and nephew. The 16 year old is also adopted but her bio mother is OP and Tammy’s sister so OP considers the 16 year old her niece because she is blood related whilst the other 2 children are not", "No, I read it properly. You're still seemingly excluding the other two for not being related by blood. You're still an AH.", "INFO: Why did you make an exception for the other kid? Also, I'm curious about the background of the younger two niblings Tammy has adopted.", "So you excluded the kids because they are adopted? And you call Tammy selfish? Wooow OP, if this was the real reason why you didn’t want the kids to come, I’d refuse to come to the wedding just like Tammy", "16 yo isn't Tammy's bio kid, she's my eldest sister's daughter", "r/AmITheDevil", "Link: https://www.reddit.com/r/AmItheAsshole/comments/11q7ipp/aita_for_telling_my_sister_to_stop_being_selfish/jc1ohls?utm_medium=android_app&utm_source=share&context=3", "It's in her comments.", "She said it in her comments", "And Tammy is more than entitled to not show up. Still think there shouldn’t be exceptions in my opinion.", "Well since you don’t have children you can’t say whether or not you would want to go to a wedding without them if you had them.", "And now I feel like a right idiot for not realising that... TY", "I am not the person you responded to.", "oh damnnnnnnnn, i missed that. Swift change to YTA.", "Bingo!", "That's a real good question", "I don’t think that ALL of her kids being adopted changes the situation.  Enjoy the rift you’ve created!", "Tammy adopted the 16 year old right? That makes her TAMMY'S daughter, not the eldest sister anymore. Biologically yes, she gave birth to the 16 year old but Tammy raised and took care of her. She is Tammy's kid, not the oldest sister", "Which still makes her your biological niece. Are you intentionally being obtuse? It makes no difference which sister gave birth to the 16yo, as long as it was one of your siblings.", "Thanks!", "Oh there weren't any comments when I first posted. It sucks that she doesn't see her other niblings as real family, but they are still a few years younger than her age restriction. Most kids hate weddings anyways.", "I don't disagree with her being able to choose not to go. I just don't think she should be arguing over the guest list.", "Sure I can. I know myself very well.", "Haha, it’s ok. There’s still tons of initialisms on the internet that I don’t know and have to look up. I spent probably six months trying to work out through context what ymmv is but eventually gave up and googled.", "My mistake", "No you can’t. Do you know how parents have said the exact same things you have just said before they have children and then once they have children they end up doing the complete opposite? Because reality is often different to the way you imagine it", "So I did Google FBIL first but it just kept coming back with Financial Benchmarks India Ltd.", "YTA if the adoption issues were t even a question you’d still be the AH. You are well within your rights to invite or not invite who you want, you are not at all within your rights to have a problem when that means peoples won’t come. You set the rules don’t be mad people are just following them", "YTA and a cruel one to some kids. How DARE you look down on those kids for not being blood relatives. If anything, not being related to you is a plus, given your attitude. \n\nUninvite some people and invite those kids!! You’re full of it. \n\nEither that, or don’t have a wedding you can’t afford. Wow. Just…wow. \n\nI predict that you’ll take this post down because you didn’t get the response you wanted.", "I don’t understand this fascination with child free weddings. Its much more likely that the children will make the wedding cuter and the reception more fun if theres dancing than that children will ruin the wedding. YTA also", "YTA for a couple of reasons but to stay on topic, you need to remember that your wedding is attended by people who love you and you are fortunate to have them.  If you are weirdly exclusive about it, of course people will decide not to come.  You aren’t owed anyone’s attendance.", "YTA.  You can have a child-free wedding if you like, but then you have no room to complain about parents who choose not to come as a result of that policy.", "YTA if you don’t invite an entire family household you have to expect people to say no", "Yes YTA why have an exception for a nephew but not  your nieces? I understand child free weddings, but your reasoning is off and makes no sense. \n\nIt's either child free or it isn't? I've been to loads of weddings that are child free except for immediate family members. You can't be mad if people choose not to attend without their children. \n\nAs someone else pointed out, there is actually more to it as to why you are leaving out those children.", "YTA  You are welcome to make the child free rule.  You are welcome to shut down your sister when she asks for an exception. You don't get to complain when she decides not to show up given your rules.  It's an invitation that she's free to accept or reject, not an order.", "YTA. You get to decide the rules of your wedding. Your sister gets to decide if she wants to go. The end.", "Massive YTA I hope Tammy cuts all contact", "YTA", "YTA Even ignoring the bit you left out about them \"not being your real neices\" (gross) if you are planning for a \"no kids wedding\" you should expect the parents you invite to not come. You're putting extra expenses and time constraints on them, and it's up to them to decide whether or not your day is worth it. Sounds to me like it ain't", "of course YTA. You can invite who you want and discriminmate against your familiy all you want, but there are consequences and YTA for not wanting to face them", "I'm getting so sick and tired of all these wedding posts lately omg. Anyway yes YTA", "YTA - you're literally the one being selfish...an invitation is just that....people don't have to accept.", "YTA. Read your comments and you basically don't want them there because they are not biologically related to you. That makes you a major AH. But you were also an AH for making an exception for your FBIL's son but not your niece and nephew. Child free under 13 means child free under 13", "YTA I had 4 kids (nieces and nephews) under 6 at my small wedding and they were ring bearers/flower girls and besides being adorable, they literally sat in their high chairs watching their iPads at the reception. It’s not worth fighting with your sister who is understandably upset about this. I agree that you don’t need random friends and cousins little kids there but what is the big deal with having your nephew and niece there? Their parents are going to deal with them and watch them most likely anyway so you probably won’t even notice that they are there.\n\nEdited to add they aren’t even that young why are you excluding them? Also are you going to pay for child care if you expect the parents to leave them home?", "You have a cut off age at 13, but you'll accept someone who is 12 ? That seems weirdly arbitrary. I know it's your wedding, your rules, and your exception to your own rules,,, But I understand that your sister would use that against you.\n\nI think ~~E S H~~ YTA in this situation. I think your sister getting angry and going off at you was unnecessary. However, if it's your right to refuse at your wedding people under 13 except for your FBIL's son, it's also her right to decide not to come.\n\nedit: I just read the part where you don't consider your sister's youngest children your niece and nephew. In this condition, I can understand why your sister would insist that they be invited to family event. So I change my judgment.", "You have every right to plan your wedding however you want.  YTA for trying to bully your sister to comply with your wishes.  Your sister has the right to comply or not attend.", "YTA. She decided she didn't want to go because of the rules you put in place and you're mad she's choosing to not go. This is all on you. You made an exception for someone elses kid, but not hers. I get her irritation. You're totally the asshole in this case.", "YTA. At this point I'm suspecting these kids don't match your colour scheme. Huge AH.", "YTA but not for the adopted kid part. I mean you are TA for that too, but this post isn’t about that so my comment is specifically about two things.\n\nYou’ve made an exception in one instance, so you can again but are choosing not to - perfectly within your right, however rude.\n\nYour sister and niece are perfectly within their own rights to decline attending, criticizing your sister for such is TA move. If you won’t sway on your decision, why should they?", "You set the parameters by being selfish. You have the right to invite who you want and set whatever rules you want, but you don’t get to be shocked when people do not attend because they don’t want to abide by your rules. And to top it off you’re not even consistent with your own rules.\n\nYeah, this isn’t on your sister, and had you simply accepted her explanation it wouldn’t be on you either. But you couldn’t handle it and made a mess. YTA", "YTA Wow “I’m not trying to be the younger ones aunt because they’re adopted.” You’re a bad person. Full stop.", "I’ll never understand this. I personally do not have children but if I were to get married, I’d want my nephews there. I get not allowing everyone attending to bring children, but family members? I’d be heartbroken if they weren’t there.\n\nEDIT: clarity", "Wow YTA adopted children are family.", "NAH. the trade off for not wanting young children around you for no reason other than they annoy you is that some people are going to rightfully pick their kids over you.\n\nEDIT: wow, after seeing what you said about your other nieces, YTA", "You invited your sister on the condition of not bringing her youngest kids. You get to do that. She declined under those conditions. She gets to do that. You're now making a stink. That's not how it works. YTA.", "Wow, you are a huge asshole.  Your invite is optional.  If you can make a exception for the 11 year old, you can make it foe those 2 kids.  And they are your neices.  Like it or not.  Your sister should take a huge step back from you. yta", "NTA. Ignore the social justice warriors that litter this thread. Your wedding, your day, your conditions. People seem to think these days that weddings are public events that they have control over. \n\nTruth is, if your invited. Turn up, be polite, celebrate the newly weds and go home. Your opinions don't mean shit. \n\nOP, I would sack off anyone under 18 bar your own kids. People don't like that? Then they were never your true friends/family", "[removed]", "YTA, it's an invite not a summons, and if you choose to make two thirds of her children feel unwanted and unwelcome you have to accept that families may well choose to stick together and ALL not come.", "YTA. You have a right to invite who you like. Those invited get to choose whether or not to come.", "YTA You're entitled to have your guest list as you want it. You're also entitled to reap the consequences of that choice. What you're not entitled to do is be mad at someone who declines your invitation because of your arbitrary rules", "YTA", "Yta\n\nThe side of having a childfree (or this case, an age limit invite) event, is that some people can't/won't attend because of it. They accepted it (eventually) and just declined the invite. \n\nYou aren't allowed to be mad at them. An invite is just an invite, it's not a summons. They rsvp'd they weren't making it, accept it and move on.", "YTA entirely for your comment on your adopted niece and nephew not being your “real” niece and nephew.", "You have the right to not invite kids.  She has the right to stay home with her kids.  Even without the adoption comments, YTA for not accepting the consequences of your original decision.", "YTA. You have the right to ban anyone from your wedding. But also, people have the right to not come to your wedding. These are your rules, these are your consequences.", "YTA your a total hypocrite. how can you allow your FBIL to have his 12 yr old there when you say no under 13 yet he is under 13 but wont allow your sisters. where's your thinking here because its unfair to have an under 13 from your fiancées side but to leave your sisters kids out. good luck having a relationship after this", "YTA. It is your guest list and you are using it to be exclusionary. That is mean-spirited and rude, and for you to call Tammy selfish is outrageous when you are the one being selfish. Don’t you see that this has the potential to damage your relationship with Tammy and all her children permanently? You’ve already caused harm. Apologize without delay and welcome them all or you may lose them all.", "It's your wedding and your choice. But don't be surprised if no one shows off they are not all invited. NAH.", "NTA. My mom is 1 of 7- each sibling had at least 2/3 kids - there are about 50 cousins and that's not including their kids or significant others. There was ALWAYS a cut-off age!!!! Whether it was 16, 18, or 21. I'm the oldest of 4 and I got to go to a bunch of weddings that my siblings didn't get to go to. If your sister is so concerned tell her she can foot the bill FOR ALL KIDS UNDER 16 🙄 I couldn't imagine making someone's wedding day about me, it's so gross.", "YTA. For your left-put comments about the nieces, and for ignoring the fact that this was entirely preventable. If you choose to exclude people from your event, then you have to accept that it will mean some people don’t come. This is on you, and no one else.", "Its clear from the comments that this isnt about age. Its about the younger kids not being biological family. YTA.", "[removed]", "YTA.", "YTA\n\nyou have rules that only seem to apply for particular children - that’s not rules that’s deliberate exclusion and unless they are uniquely unruly little hellions who absolutely everyone knows will destroy everything in sight then you might as well just tell your sister that you only like one of her children and don’t want the other two in your life - then wait to be estranged from sister and family going forward. Simple.", "You created this rule exclusively to exclude your non biological adoptive nieces. YTA", "YTA you’re including EVERY niece/nephew except the two non-bio ones", "YTA\n\n&#x200B;\n\n\"but recently told me she won't be coming because of this.\" .. Your sister and your niece are very reasonable. How else would you expect them to handle your not inviting part of their family?\n\n&#x200B;\n\n\"I told her to stop being selfish, my guest list is my guest list \" .. what a stupid statement. Your guest list IS your guest list - you are right there. But it is only an invitation, and she is fine to decline the invitation. YOu should have expected that. It is the perfect response to your invitation.\n\n&#x200B;\n\n&#x200B;\n\nSo: **While you get to decide who you invite, you are an AH for faulting them for not coming: that IS the reasonable choice here.**", "YTA and worse than a regular bridezilla! It’s so hateful to reject adopted kids. Karma will not be kinda to you. Apologize fast!", "YTA. You can have an age-restricted wedding if you want to, but that's automatically going to exclude some people. And when you start making exceptions for some family members but not others, you're just asking for drama. Just make a decision and stick to it, and accept that some people aren't going to attend.", "YTA. It’s fine. You can have whoever you want at the wedding because it’s your wedding but you can’t be upset because your sister decides not to come. You’re an asshole because of how you’re acting", "YTA \n\n\nYour within your rights to make any rule you want to make but your sister is within her rights to decide she doesn't wanna go", "YTA. You are free to make whatever guest list you want, but you need to also understand that people might not show up if they can't bring their families.", "YTA already, because yeah you can have a childfree wedding, but you do not get to be angry when parents say they won’t attend either because of it. you make your bed you get to lay in it. \n\nbut you’re an even bigger ahole for the way you talk about your younger niece and nephew. “they aren’t my real niece and nephew” then do them a favor and stop pretending you are. i hope your sister cuts you off because that is an absolutely disgusting way to view her children just because they were adopted. absolutely sickening, they deserve a far better aunt.", "People are 100% allowed to have a child free wedding. People  also 100% have the right to decline it YTA", "YTA.  You have a right to have a no-kids wedding, but you don't have a right to call people names for not attending.", "YTA\n\n It's okay to have a child free weddings. I applaud this. But it's perfectly normal for parents to refuse the invitation, because their priority are their kids, not your wedding.", "NAH.  It's your wedding, so you can invite who you want (although making one exception already is a little sketchy).  It's also your sister's right to choose to attend or not since you're only inviting part of her family.", "What does FBIL mean?", "YTA. I'm sorry but your FBIL's son is under the age limit yet he's invited? Plus you don't see the younger girls as your nieces because they are adopted?!?! WTF is wrong with you? \n\nI agree with your sister and your \"real\" niece that they won't come because you're a b with an itch", "YTA", "YTA.  She's allowed to decide not to attend events where only some of her children are welcome.  You can invite whoever you want, but you can't command them to come.", "YTA and an AWFUL person. Wtf is wrong with you?", "*An invitation is not a subpoena.* I'm going to give you the benefit of the doubt that this *really is* about their age and not their parentage: you are within your rights to set whatever conditions you want about your wedding, but *other people are within their rights to consider them dealbreakers and decline the invitation.*\n\nYTA for arguing the point. If you didn't invite the younger kids because they're adopted, you are an *irredeemable* asshole, and I sincerely hope that karma is nearly done with her drink.", "Wow. \n\nShe was TA before that, because obviously she can make any rule she wants, but prospective guests can choose not to attend because of those rules. She failed “Wedding planning 97 remedial”. \n\nBut this makes her a **wicked** AH.", "Aha. There is the reason. Op didn’t give a reason as 7 and 9 aren’t going to cry through the ceremony and can just chill in their iPads or phones so I was not sure what the real reason was. Op is a major AH. I hate how weddings turn people into entitled ah.", "She’s definitely the AH. Even your teenage niece recognizes your behaviour as wrong. No one should be forced to attend your wedding. Also the exception for the 12 year old makes much more sense now.", "Oh jeeze. I thought OP was TA even before thus, but damn....", "Even if I give OP the benefit of the doubt about everything, it's still YTA. You can have a 'no child' rule, but you can't get mad at people who can't attend or decide not to attend because you have a 'no child' rule.", "I missed that detail.", "Fight the power.", "I thought they said the 16 year old was adopted as well... All 3 are. But I am multitasking and this is a tad confusing so I may be wrong.", "To be fair I think the sister’s biggest problem is OP is excluding the two kids who are adopted but making exceptions for biological relatives.\n\nOP’s comment:\n\nI totally get where you're coming from, but this actually goes the other way too. They're nice kids, but I'm not really her younger kids aunt. 16 yo is actually my niece because she's my eldest sister's daughter, but Tammy adopted the others much later. And I just think my sister should be there for me on my big day.\n\nIt just seems like she's trying to act holier than thou and dragging my 16 yo niece into it. I mean technically the 16 yo is Tammy's niece too. We're both her aunts.", "This falls in the destination wedding area. You can choose whatever you want but can't get mad that people are unable to attend or simply choose to decline the invitation.", "This!! Freedom of choice doesn't provide freedom from the consequences of your choices. OP can choose her guest list for her wedding, but that doesn't give her subpoena power to enforce it. And being an AH about it doesn't encourage people to attend.", "OP clarified in another comment that while the younger two are good kids she doesn't view them as \"real family\" because they are ADOPTED.  Their older sister is the only biological child.  That is the real reason for OP refusing to give them an exception.  She's a massive AH.", "Oh, it's even worse than that.  Tammy's younger two are adopted so OP doesn't consider them real family.  BIL's kid is his bio-kid.", "BIL's kid is his bio- kid, Tammy's younger two are adopted so OP doesn't consider them \"family\".", "But OP doesn't consider her niece and nephew family because they're adopted.", "The 9 and 7 years old are adopted and not real niblings for OP.", "That was my initial thought, they're either a different race or something and won't match the \"aesthetic\" of this wedding.", "You do realize that no one is *required* to go to the wedding right? An invitation doesn't mean they *have* to go. You're not entitled to someone's presence at your wedding. You just sound like you think you're the center of the universe.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "If this is the case in am not sure why the didnt choose another age border.", "there must be others being excluded, for whatever reason, since the exception is only one year too young..", ">Not believing that adopted kids are 'real' family makes OP YTA\n\nThis bit here pissed me off, recently I experiecend the 180 version of it.\n\nMe and my older brother was adopted and all our lives (me from 1 y/o and him 3 y/o) knew her as our mother, last year though he stopped treating her as our mum, and he used words like \"shes not our real mum, she just adopted us\" to explain why he wont call her mum anymore (hes 47 now)./  \n\n\nIt rightly pissed me off and those feelings returned when I read what OP said", "Lol it's already been posted. It's how I saw this first. But I honestly expected this side to be deleted by now so I was surprised to find it scrolling through the sub.\n\nAnd yep. The younger two are adopted but the oldest is still related by blood just adopted by family. If that makes sense.", "They have a third sister. Apparently 16F is her daughter, but the girl lives with (and was legally adopted by) Tammy. \n\nOf the 3 nieces and nephews, 16F is the only one that OP considers “real” because they share DNA.", "Can't have your Kids and eat them too. No wait...", "Right, frankly I think excluding the children of your own siblings is kind of harsh, and I say that as someone also in favour of childfree weddings.", "Ah, but you've missed the comment OP made where it's explained that these kids aren't really family because they're adopted (and that's why the exception has been made for the other niblings!).  OP is YTA for multiple reasons, and a pretty awful human being!", "Why is there an exception being made for BIL’s 11 year old son?\n\nRegardless, YTA for your obvious disdain for non-bio relatives. News flash, sweetheart, the younger kids are your nieces too.", "Nobody cares for your excuses you just don't want your sisters adopted children there, her family and now she doesn't respect you and want to come to your wedding. \n\nWhen you do things that exclude your sisters kids on purpose she's not going to want to be around you. It's not hard to understand. People don't celebrate mean assholes who undermine their children.", "Interesting that adopted kids aren't \"real family\" but kids of finances family are", "YTA\n\nI can’t even accurately say what a truly horrible and disgusting person you are. I hope your fiancé comes to his senses before he’s stuck with you.", "You get to set the guest list, the guest get to choose whether to attend. Your sister’s first responsibility is to her children, not you. \n\nYTA", "YTA and a bad person", "What? \n\nWhy was this not part of the post? Maybe because you know that it makes you the AH. Because YTA and potentially an awful human being at that.", "I hate to tell you this, but she is holier than thee. You are treating her kids like strangers. I don’t think I’d ever speak to you again for pulling a stunt like that.", "You’re a nasty person for not viewing those other children as your family. It isn’t about being holier than thou. It’s about being fucking good to children, you ghoul. Hope it rains on your special day.", "Jesus YTA. The adopted ones don’t count? Wow", "Oh YTA, a ginormous AH. I am so glad my dad’s family considers me their real niece/granddaughter. She adopted them. That makes them HER children. And you ARE their aunt. Unless they don’t want to claim you after this. I wouldn’t blame them.", "Omg those kids are most certainly your nieces \nWow you are an even bigger AH than I first thought", "What an absolute shitebag you are.", "Yes, you are still the aunt to the adopted children. She adopted them. Therefore, they are her children. \nWhat's wrong with you?", "OMG!!! I can't believe what I'm reading!\nWhat a HUGE TA\n\nYou were already a TA for making an exception for your BIL, but now you're a huge TA for excluding out of prejudice.\n\n\nYTA", "So this is about blood. \n\nYou are unreal.", "YTA. You are free to have a child-free wedding, but that comes with the understanding that some folks may not come. (And now that I’ve seen your other comment regarding the younger two kids, I’m going to double-down on YTA)", "Way to bury the lede there, op. YTA, bigtime", "YTA you’re horrible!!!", "It’s the kid of the future groom… guess have to stay there. Oh I miss the adoption part. That is supper shitty. Ok changing my vote", "Thanks for stating the obvious. And no not centre of the universe, just in the same situation. Difference is I'm not pandering to people when I've spent a small fortune to celebrate my love for my future wife. If you don't like my conditions, let me know! I'll take you off the list without a second thought.\n\nI'm looking to celebrate a joyous day, not deal with entitled people", "Oh well that is a very TA move and obv was not in the post. \n\nI still don't think kids that young belong in (most) receptions BUT OP sounds otherwise horrible.", "Jesus Christ. I expect \"your not my real mom!!\" to come from a teenager going through some shit not a damn near fifty year old man.", "Yeah - especially knowingly drawing the age limit line where it excludes some kids from a family, but not all. Like, what is the sister supposed to do? It might be technically possible to find a non-family babysitter for the two younger kids (potentially overnight?) but it massively complicates the day - in addition to just being kind of mean IMO.\n\n(I'm ignoring the fact that OP is excluding the adopted kids because they're not \"real family\" for the purposes of this comment)", "I never once considered not having my nephews and nieces at my wedding. They were so cute and I love looking at pictures of them at my wedding. They made no trouble and it was a small wedding in a tight room. I understand not having random kids at your wedding though but children of siblings? Way harsh. And who doesn’t love looking at them coming down the aisle in their adorable outfits!", "My wedding was childfree with the exception of my cousins who were ages 12, 14, and 16. Had either of us had siblings with children they would have been invited as well. I agree that it's harsh.", ">finances family \n\nAppropriate Freudian slip?", "Not the gotcha you think, you’re still excluding the ones that aren’t biologically related.", "Answer the question. Why an exception for FBIL’s kid? \n\nYou won’t answer it.", "You still made it a point to say that only the 16 YO is your niece. You know, because she’s biologically related to you.  I think you’re the only one that doesn’t really have full awareness about what that means.", "[removed]", "not for long. she can't be an aunt if her sister goes nc with her, which is likely to happen given what an ass she is. i hope they both do", "The 16-year-old is clearly a better person.", "Sorry I miss the part about the adoption and that to be the reason of the none invitation, as there are many wedding without kids. That taken in consideration Omg YTA and a major one!", "> It’s the kid of the future groom\n\nIs it? I read the post to say:\n\n> We do have one exception to this, my FBIL's son who's 11 (12 at the wedding). \n\nThe FBIL's child would be the niece/nephew of the groom. Not their child. FBIL is \"future brother-in-law\"", "The only entitled person is you for thinking that just because you spent a lot of money on something they have to attend. What you're asking people to do is pander to you despite their comfort or convenience. Not to mention, that's what OPs sister did, and by you're advice OP should've have done anything but take her off the list meaning you agree she's an AH for her response. No one is obligated to do anything you ask of them and that's what an invite is an ask. It's that simple. You seem to make it an all or nothing thing when it's not. Either you come and support me no matter what or you're not a real supportive friend/family member. In OPs situation, sister is more supportive of her kids and not allowing them to be seen as less despite how OP sees them.", "Agreed. The only reason I mentioned this to you is that you were getting downvoted for an opinion you shared prior to that revelation.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You’re just a bad person. May you have the marriage you deserve :)", "I'm glad you asked because I didn't get it either", "Same here", "Yes. OP is really cruel.", "Love reading a comment that knows the difference between an initialism and an acronym!!", "Wait what does ymmv stand for?", "Thanks. I’ll admit I only learned it very recently… from a Reddit comment.", "I learned a new thing!!! Thank you", "Can you explain the difference?", "Your mileage may vary. It means you may have a different experience or outcome.", "\"Your mileage may vary.\" :)"]}