{"id": 12253, "submission_id": "11r1tl9", "title": "AITA for telling my sister if she was my stepmom I wouldn't name my kid after her either?", "selftext": "My sister has been married to her husband Nigel for 21 years and they have been together for about 23 years. Nigel was a widower of three years when he met my sister. His kids at the time of them meeting were 6f and 8m. Nigel's late wife's family was around a lot. My sister hated it. From the very early days it was clear she was toxically jealous of Nigel's late wife and the kids mom. She talked about how strange it was the kids, who didn't remember her, had her photo in their bedrooms, how her stepdaughter had a locket with a photo of her mom, dad and brother in it. I remember back then asking how it was strange. Her mom was loved and Nigel and his late wife's family likely didn't want the kids to not know they were loved by their mom. She said that was her job now. I told her it wasn't healthy to feel that jealous and put out over a mom being remembered. Think of how she would feel if our mom died.\n\nHonestly, I had a lot of respect for Nigel for the first two or three years because his kids seemed to be his priority and he seemed to still love and care about his late wife and not want to erase her but was also ready to be married to someone else. I had seen a lot of far more awful scenarios. But then he started letting my sister push herself onto the kids and try to force out their maternal relatives. It was very clear my sister blamed the maternal relatives for neither of her stepkids coming to think of her as their mom. She didn't want to hear any other reason it could be.\n\nNow both of her stepkids are adults and her stepson became a father for the first time in January. His daughter is named after both her grandmother's. But his mom's name is her first name. My sister was so unhappy about that. She told him it was disrespectful to her and all that crap. He told her to go fuck herself and told her she still hadn't figured out that she wasn't his mom, she wasn't his parent, she wasn't even his real family, because he would happily dump her out of his life for good and would never feel bad about that.\n\nMy sister bitched for weeks about it and then I told her if I was her stepkid, I'd do the same. That she had no respect for his mom and had no respect for his maternal family. She freaked out and told me that was a shitty thing to say and I should be on HER side, because she's my SISTER. \n\nAITA?", "created_utc": 1678786915, "permalink": "/r/AmItheAsshole/comments/11r1tl9/aita_for_telling_my_sister_if_she_was_my_stepmom/", "score": 521, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my stepsister that if she was my stepmom I wouldn't name my kid after her either when she was complaining about her stepson disrespecting her by naming his daughter after his mom. Maybe it was uncalled for and unnecessarily mean. I can't say my words were very compassionate.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Even if she was their birth mother, she would have no right to expect them to name their child after her. What an exaggerated sense of entitlement.\n\nSomeone needed to give her a reality check, especially as her stepson told her outright that it would never have happened, and she STILL didn't get it. \n\nAll she's done is ensured that she won't be considered either a parental OR a grand-parental figure to any of this family and has probably ruined the moment for her husband. What a peach!", "NTA\n\nI'm sorry he stayed married to your sister through all that and didn't kick her to the curb", "Nta, your being truthful. She just doesn't want to hear it. It's his baby and by the sounds is well aware how she was about his bio mum", "NTA.\n\nThe value of blood bonds seem to differ, depending on what is the most convenient for her.", "NTA. She had decades to figure this out (and you told her too).", "NTA - why are people so stupid when it comes to others (mostly children's) feelings for their dead parents. You can't replace that, you can try to love them and hope you get to a similar level but that's it. She's dead, she can't \"win\". Your sister has issues", "NTA\n\nand I'm surprised your sister didn't alienate Nigel's kids so much that they went NC with both of them.", "NTA, it sounds like she has been TA to the kid's family for years", "NTA. You can tell her that you thought she didn't care at all about blood relationships, given how she feels about the kids' mom. Those kids were on their mom's side, and your sister obviously thought that wrong.\n\nAlthough, honestly, nobody but the parents of a child should have a say in naming the child.\n\nYou sister has a long history of being butthurt over things that have nothing to do with her, so, she's got so much practice being an AH, how could she be anything else?", "NTA\n\nYour sister is completely the AH here.  Doubly so for being mad that you don't \"have her side\" when she's completely 100% in the wrong.\n\nI have close, long-time friends who will always be on my side **UNLESS I AM IN THE WRONG**.   If I am, they will tell me so.  That is what good friends do.  And that is what good family members will do as well.\n\nYour sister desperately needs therapy, but she would have to be willing to admit she was fundamentally in the wrong.  Which she won't do.  I wish Nigel would divorce your AH sister because he seems like a very good man.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister has been married to her husband Nigel for 21 years and they have been together for about 23 years. Nigel was a widower of three years when he met my sister. His kids at the time of them meeting were 6f and 8m. Nigel's late wife's family was around a lot. My sister hated it. From the very early days it was clear she was toxically jealous of Nigel's late wife and the kids mom. She talked about how strange it was the kids, who didn't remember her, had her photo in their bedrooms, how her stepdaughter had a locket with a photo of her mom, dad and brother in it. I remember back then asking how it was strange. Her mom was loved and Nigel and his late wife's family likely didn't want the kids to not know they were loved by their mom. She said that was her job now. I told her it wasn't healthy to feel that jealous and put out over a mom being remembered. Think of how she would feel if our mom died.\n\nHonestly, I had a lot of respect for Nigel for the first two or three years because his kids seemed to be his priority and he seemed to still love and care about his late wife and not want to erase her but was also ready to be married to someone else. I had seen a lot of far more awful scenarios. But then he started letting my sister push herself onto the kids and try to force out their maternal relatives. It was very clear my sister blamed the maternal relatives for neither of her stepkids coming to think of her as their mom. She didn't want to hear any other reason it could be.\n\nNow both of her stepkids are adults and her stepson became a father for the first time in January. His daughter is named after both her grandmother's. But his mom's name is her first name. My sister was so unhappy about that. She told him it was disrespectful to her and all that crap. He told her to go fuck herself and told her she still hadn't figured out that she wasn't his mom, she wasn't his parent, she wasn't even his real family, because he would happily dump her out of his life for good and would never feel bad about that.\n\nMy sister bitched for weeks about it and then I told her if I was her stepkid, I'd do the same. That she had no respect for his mom and had no respect for his maternal family. She freaked out and told me that was a shitty thing to say and I should be on HER side, because she's my SISTER. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nI don't believe it, after his former wife he ended up marrying your sister. As a parent you should always keep your kids first, I really feel bad for them.", "NTA. It's just a very sad situation all round. Your sister's sense of entitleent and jealousy are twisted personailty traits and it's awful it has negatively affected Nigel as well as his older children.", "NTA.", "NTA-  The problem with being on her side for the reason that she is your sister is that it’s complicated by the fact that she is also a first class AH.  You kind of have to decide if you are on the side of reason or the side of imaginary blood ties that some people fantasize are unbreakable in a moral sense (usually when they are desperate for support and can’t get it because they also are 1st class AHs).  I know which side I would be on and it’s the one that I can support with ease without having to lie.  She is even an AH trying to manipulate you into defending her AH behavior by suggesting you’d be an AH not to by breaking some moral code.  What an AH!", "NTA you have a shitty sister who doesn't seem to get it. Step moms need to find their place in a family and trying to erase a mom's place from a child's heart and life is not the way. Else someday they will be asked to step aside and forgotten. The kids have every right to honor their late mom and grandma and with the behavior your sister has shown, its no surprise they didn't even want her to be any part of their life. Shes just a spare who is trying to squeeze in and being miserable at it.", "NTA I think you sister like a lot of people are was never mentally or emotionally mature enough to be in a relationship with someone with a dead partner let alone one that involves children. To many people feel like they are competing with a ghost because their current partner never broke up with that person so they are always thinking 'if X was still alive would my partner still be with them and not me' and they just can't get over that so they do there best to erase the dead partner.\n\nThis seems to be quite common with step parent stories on here but it isn't just them. A couple of examples that come to mind were, one of a guy that came here because his at the time gf started freaking out about him visiting the grave of his dead childhood friend who he had a pretend engagement with and had about some mementos he had of her. Another was of a woman that started trying to one up the cooking of her bf's dead father because she became jealous of it (can't remember much more about this one)\n\nThe truth is we are all always going to lose when competing with a ghost because they are simply the memories people hold of a loved one covered in rose tinted glasses where we remember the good about them and gloss over the bad.", "So he beamed the daughter with the name of a person he hates? Wow ballsy. I hope he just say it cause he was hurt in the moment and could find a peaceful resolution. \nI think this family should have done some therapy. Which wasn’t so much talk about years ago. NTA at all, I am sure your sister could have found a healthier way to become a mother to those kids without not validating their live for their biological mother. Not saying it’s easy, but possible. But in all those years have you ever sit down your sister and in a peaceful way try to make her see reason?", "Yep. Sad thing is she and Nigel have kids and those kids will miss out too because of how she has treated Nigel's older kids. But he let's her treat them that way and stayed with someone so bitterly jealous of his late wife. I'll never understand after that.", "Same. I can't believe how much he was willing to let happen and he ended up ruining his relationship with his older kids.", "She never really tried to hide it from the kids. At first she hid it from Nigel but then he started just letting her do the crap and didn't put his kids first and then it never had to be held back. Despite that she thought the kids would love her.", "Honestly, for all the relationship that's left, I'm shocked too.", "The stepson named his daughter after his late mother (not stepmother) and middle name was his wife's mother's name.", "He named his daughter after his mom. He loves his mom. It's my sister who hates the memory of her and yes, I have tried to sit down calmly and help her see reason.", "You are definitely not the ass- your sister though W H E W", "Sadly far too many people prioritise their partner over their children", "My stepkids mum died when they were that age and I've been married to their dad for almost 9 years. I won them over with honesty and respect and I love them to pieces, and if they decide to have kids I'd be the first to suggest a daughter is named after their late mum.\n\nNTA, your sister is mean and delusional.", "NTA, actions have consequences, and the truth hurts.", "I'm sorry the kids had to live through that. She's probably lost all of them now. Good job! Had she come into the family understanding how much they loved their mom who died and been supportive and loving towards all of the family, she'd have gained a few new family members. She also wouldn't have cared whose name was first. Honestly, I'd be beyond shocked and incredibly honored if one of my kids chose and part of my name for one of their kids. \n\nIt wasn't a kind thing, what you said, but I totally think your sister walked right into it. She was deserving of every word. It was something she needed to hear. It's clear that she isn't going to change her toxic  behavior any time soon. I guess it hasn't cost her enough. Family members aren't 'owed' anything just by virtue of being family. You don't owe your sister a single thing. She was wrong and behaved badly. You don't have to support that, or her for that matter. You don't even have to talk to her anymore.", "NTA what you said to your sister is a whole lot nicer than what I would have said!", "NTA. Your sister after 21 years didn't learn a thing. You don't force the family card<love and respect>. Something she's very short on.", "NTA your sister sounds like a real awful stepmother.", "NTA. In the Jewish religion we don’t name people after living people and that prevents hurt feelings and just this sort of drama. I’m not sure if that was the reason for this custom, but it sure helps.", "NTA\n\nShe needed the reality check, but if the reality check from HER OWN STEPSON didn’t work then I’m not sure yours will get through either.\n\nIt seems that she’s cast herself as the victim of this story and she’s determined to see it through.", "NTA.   She complained about it an you gave your honest answer.", "NTA. You are being on her side, whereas she just continues to ruin what little relationship they may have at the moment. She is not entitled to anything and should be happy if they let her see the grandchild after this.", "NTA.", "NTA", "NTA - if you have to be on her side automatically due to your biological relation to your sister, then by the same logic her step kids need to remain on their late mother's side due to **their** biological relation", "NTA. I'm just astonished by your sister's hypocrisy. She thinks you should be on her side because you're her blood relative, but doesn't understand why her stepchildren feel so strongly about their late mother?", "NTA Your sister needs to grow up. She's not her step children's mother. That child was named after someone her stepson loved dearly. Shame on your sister for being so full of herself that she would try to deny him that. I would have told her to f*** off too.", "the truly sad thing is all she had to do was be supportive of the kids and they would see her as a mom.\n\nfunny how kids will just love you when you're there for them.\n\nNTA", "Nta. The entitlement is INSANE. She isnt their mum, and i hope he does.cut her out because those poor kids otherwise.", "NTA how much longer does your sister need to get it she is not the mom and never will be", "He did her a favor not considering her a parent because she would've been an absolute awful one. \n\nNTA.", "Ooofff\n\nNTA\n\nThis is all on sister! She messed up and now she's reaping what she's sown. You don't have to take her side just because you're family", "NTA! At all OP!", "NTA. I am surprised your sister’s husband has put up with her and her narcissistic ways for this long. She had no right to push the maternal side of the family away and those kids remember their mother. Of course, they’re going to think of their mother all the time, and want things to remind them of her. And your sister was never going to be a mother figure. She probably could’ve been if she hadn’t tried to force it like she did. I don’t blame the stepson for telling her what he did, and I would tell her the same thing if she was my stepmother.", "NTA at all", "NTA your sister sounds exhausting. She did this to herself and you were exactly right. I would do the same as her stepson, and I would say the same as you did.", "NTA. I'm truly appalled by the number of step parents who want to force the kids to see them as a mom or dad. It really isn't about them, it's about the kids and your sister blew it. Good for you for pointing this out to her. Too bad she didn't see it earlier so she could have had a good relationship with Nigel's kids.", "This is a very clear NTA for me.\n\nUsually I can see where both sides are coming from, and there's lessons to be learned either way, even if I have a clear judgement. Because usually, in *any* situation, we can always do *better*, even if we are not the AH... but... no. You're right.\n\nYour sister was wrong to hide her feelings about the children's mother from her husband.\n\nShe was wrong for trying to force a relationship with the children.\n\nShe was wrong for trying to erase their memory of their mother.\n\nHer husband was wrong for allowing someone to do this to his children.\n\nShe was wrong for telling her stepson that naming his child after his mother was disrespectful.\n\nHer stepson was in the right to name his child whatever he and the other parent wanted.\n\nHe was right to assert a firm boundary with her. (And some people might say the phrasing with gfy is wrong, here, but I don't think words are bad in and of themselves... it's how and when they are used, and here was appropriate!)\n\nYour sister was wrong for venting to you repeatedly about this without your consent.\n\nShe was wrong for stating that you must be on her side because of the relationship... for 3 reasons: 1) because it shows her value of blood relationships is based in hypocrisy and 2) because when you open a conversation with someone you have no right to control their replies! 3) a person should be on the side of who they think is right.... and **most** importantly, 4) There should be no sides. This is the stepson's child. No one but the stepson and his partner *have* a side.\n\nIn light of all of that... you were stating your opinion about a situation she was forcing into the conversation... defending the person who was in the right... addressing the issue (lack of respect) directly....\n\nSuper clear NTA\n\nI guess, if I *had* to say something you did that was *wrong*, I couldn't, but if forced to nitpick something that could have gone better... *Maybe*? Depending on the phrasing, the \"if I was your stepkid\" part could seem like an attack on her, rather than the behavior? But I don't think it was, really.\n\nLike ... I think you are fully in the clear here. Your sister showed all the AH behaviors. Her husband had a pretty big AH behavior. Her stepson, in this situation no AH behaviors. And you are definitely not the AH.\n\n(PS: I am really tired of people thinking they have a right to influence their children's choice of baby names in general. Like, I'm sorry you knew a bitchy \"Heather\" in high school, but you got to veto that name for *your* child. You don't get veto power for your child's child. wth)", "NTA  \n\n\nJust because you share her genetics, doesn't mean you're obligated to enable her bad behavior.", "NTA and I feel sorry those kids had to grow up with her", ">She freaked out and told me that was a shitty thing to say and I should be on HER side, because she's my SISTER\n\nSooooooo......To your sister, sharing DNA is important, even if someone is talking absolute BULLSHIT, you'll still have to be on their side, for no reason other than \"You're my sister\".\n\nOh the irony.\n\nShe is lucky that she's still with her husband, i would have thrown her out when started that bullshit.\n\nNTA", "NTA\n\nSomeone should have told your sister that years ago. Better late than never. Heck, keep calling her out on it. It won't fix anything but it's what your sister and her husband deserve.", "NTA in any way whatsoever. Your sister though... who is so jealous of a dead woman she is angry about her kids remembering her? Like did they woman ever do anything personal to your sister that she's holding a grudge over? Because if it's just jealousy they had a mom before her, she has some serious issues", "NTA\n\nYour sister sounds like one of those toxic \"family is everything\" people mixed with the entitled \"everything is about me\" attitude. \n\nShe managed to take her stepsons beautiful moment and memorial and make it about her.", "NTA - these posts make me appreciate how wonderful my stepdad is 👌 that man has gone with my Mom for nearly 20 years everytime she goes to the cemetery and helps clean my father's grave. She kept our family portrait up next to the fireplace until I graduated high school and he didn't have a problem. They continued to go to have Christmas Eve with my Dad's family until the pandemic (they've since had a falling out that is 100% my Dad's family's fault)\n\nMy stepdad got me concert tickets as a surprise for my 13th birthday. It was supposed to be for him, my Mom (her birthday is 3 weeks before mine), a friend and me to go, but my Mom was gifted tickets by a friend to go before she found out my stepdad had gotten tix. So he surprised me by inviting my 2 best friends and taking 3 13 year olds! I decided to do junior miss so there was a pageant I participated in and we had to build a float to ride through parades. My stepdad is an electrician and he put SOOOO many hours into making the stage and the float absolutely perfect! He hates wearing suits but he wore one to escort me in the pageant and made me laugh so I wasn't as nervous. He hauled our float to every parade and drove it and when we were in his hometown he gloated to all his friends about how he had helped to raise a queen.\n\nI miss my Dad every single day, but my stepdad is a gem and I am glad to have him in my life too.", "NTA. You warned your sister 20 years ago about the bed she was making, and she kept at it. Now she gets to lie in it. You don’t need to coddle the feelings of the inner kindergartner she never healed; she should have been in therapy long ago.", "Agreed. But it doesn't matter what anybody says to OPs sister or how many reality checks OP tries to give her. She will NEVER accept any blame for this. OP tried from the beginning to get the sister to stop being an ass about the mom and it didn't work. I would say it will take the step kids going no contact with her to be \"the reality check\" but honestly I bet she'll just keep blaming the moms family. Totally sucky situation but OP is NTA for trying to smack sense into the sister for being an overbearing and jealous stepmom", "> Even if she was their birth mother, she would have no right to expect them to name their child after her. \n\nThis is one of my pet peeves.\n\nWhen I was a teenager I used to babysit for a boy whose mother had been very abusive. So he lived with his father. He was 2 and he had no baby teeth left because they were rotted out, and he walked funny because his legs had been broken several times in falls.  It was really sad. I'd never met his mom, but I knew her name (I will use the fake name Heather, because of the movie) Heather. So I always hated that name because to me it stood for that person. So much that when I was choosing *my* child's name, I blacked it out with a sharpie in the baby names books!\n\nWell, when my kid was about 6 they got a new stuffed animal and named it \"Heather\" and carried it around everywhere and always talked to it and called it by name. So I have to say \"Go get Heather so we can get in the car!\"\n\nI was not thrilled at first, but even for a small child and a stuffie, it's not my choice!\n\nWell, eventually, because I said it all the time, \"Heather\" just became the name of the stuffie. And it makes me think of my child when they were small and sweet (no, they are not still sweet, teens are AHs, but they are pretty frickin cool instead). Anyway... it becomes a pleasant memory instead, if you let it. \n\nIf you try to control what choices your children make instead, you only end up bitter!\n\n(Yes, we still have Heather, but she sits on a shelf, for any who were concerned!)", ">She's dead, she can't \"win\". \n\nRight! I saw a movie not long ago where the MC was in love with a man whose wife had died. And she says \"How am I supposed to compete with a dead woman?!\"\n\nFirst of all, why do you need to compete?! Second, it should be easy... she's dead, she can't fight back!!", ">I won them over with honesty and respect and I love them to pieces\n\nThere are always sooooo many stepparent/stepkid stories on here, and almost always, the stepparents who love the kids and don't force a relationship and help them remember/respect *both* bio-parents end up being the ones the kids think of as parents. While everyone who tries to compete/force the issue ends up with a bad relationship with them. \n\nCrazy how life do that, huh? :P", "They might not think of her as a Mom but they definitely would have had a better relationship.  Sometimes it happens and sometimes it doesn’t but if stepparents are just supportive and not pushy then the kids will have a better relationship with them.", "Her argument that you should be on her side because she is your sister. Stepkids can use the same argument. That was their mum and death doesn't change that. So step-son chose his mum.\n\nEdit to include judgment. NTA", "Do you have a relationship with the two oldest kids? Have you told them you don't agree with you sister's behavior?", "Omg thank i understood that middle name was the stepmother.", ">Sadly far too many people prioritise their partner over their children\n\nPrioritize having a fuck buddy is more accurate."]}