{"id": 12297, "submission_id": "11r9hkc", "title": "AITA for lying to my mom about having sex?", "selftext": "I (23F) have been dating my boyfriend (26M) for a year and a half now. We’re in a LDR situation currently.\n\nI forgot to put away my birth control pack and my parents found it and now my mom isn’t speaking to me. When my mom realized my boyfriend and I were pretty serious, she told me how she expects me to wait until marriage and that she would be very disappointed in me if she found out I was having sex. She says that as a girl, if I have sex and get pregnant then I would ruin my life and career. Whenever I visit my boyfriend and come home, she always asks “ were you good”, “are you still a virgin”, “are you still clean”. I just always say yes. My brother (29) on the other hand never got a sex talk. She told me it’s different for him because he’s a guy so she doesn’t care and he’s not the one who would have to live with a mistake. I know she likes my boyfriend because she lets him stay at our house in the basement when he visits me.\n\nI probably could have lied but my brother, friends & cousins told me to have a civilized convo because I’m an adult and as much as she wants to, she can’t control my choices in this situation. At first she refused to talk to me, but then said she had no idea what to say to me because I betrayed her, I know how she feels about this, I lied to her and I know how much she hates liars. I apologized for how she found out, for lying and for hurting her. I explained how I didn’t want to disappoint her and I didn’t want her to think any less of me. She replied “Well I do think less of you now.” \n\nI told her I understood her expectations & beliefs but I just didn’t agree with them and I made my own choice. She proceeded to say that yup I made my choice regardless of what she thinks and that I think I’m so old now that I don’t need to care about what she says or about her protection. I apologized again for hurting her and for lying about it and at the end of it all she said “well you don’t have my forgiveness and I don’t forgive you or accept your apology.” I decided to just walk away. \n\nEveryone is telling me that my mom probably needs some space and time. My cousins told me they were just happy that I was being safe and using protection. My mom and I have a great relationship, we talk about everything else and I want to share stuff with her. We gossip like bffs and talk for hours every day. In every other way I am who I am because of my parents like how important school was and now how important my career has been. I did everything they wanted me to, I finished school, got two degrees, interned throughout school and now I’m working three jobs, one at a dream company of mine. I know she’s proud of me but I feel like this one thing makes me a disappointment in her eyes. I hate that I hurt her and I’m feeling so guilty about this. I know that I was wrong for lying but she never made it okay for me to talk to her about this without knowing she’d be upset. AITA?", "created_utc": 1678808365, "permalink": "/r/AmItheAsshole/comments/11r9hkc/aita_for_lying_to_my_mom_about_having_sex/", "score": 65, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I lied to my mom about having sex when I knew how she felt about it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "She needs space and time? Unless she's calculating your velocity, that's not what she needs. She needs to understand her 23 year old daughter's sex life is none of her business and that she's awfully sexist.  \n\n\nEDIT: NTA", "I stop reading after she asked you “were you good?”\n\nI don’t know how you could even stand to be around her. Absolutely NTA. You’re an adult and your sex life is your business. Even if you’re not an adult.  \n\nI would suggest looking into therapy from the possible trauma she has caused you over the years with her incredibly controlling ways.  If you’re bringing hidden trauma to the relationship, it could be a problem for you later on.", "NTA. You are 23 years old. You are an adult. Adults can do adult things and make adult choices, like sex with their partners. Just keep taking that birth control and make sure she doesn't tamper with it or hide it as revenge. People do crazy shit sometimes.", "NTA!\n\nLook to put it frankly your mom is..And I hope I use this right, misogynistic. She gave you the talk but not your brother. She kept trying to make sure you were pure but not him. She kept saying a baby for you was a mistake until you got married.\n\nHaving a baby even when you are married could not be the best thing. But a baby is not a mistake. The baby is innocent. You are being safe, even though no form of birth control is 100%. You are doing all you can to be protected.\n\nBut she feels if a woman is not pure on her wedding night, then she has ruined her life, but it doesn't matter about men. Men can do as they please. That's what Im getting from this. What did she expect to happen once you do get married?\n\nOr what if you decide never to marry and just have a life partner that you aren't married to live with you. Or what if you decide not to have kids or whatever else that could possibly happen. So long as you are making the best choices for yourself, you are fine.\n\nThis is something you want. This is not something she needs to know about. This is not something she can dictate. You need to move out of there. Get your own place. Did she expect you to stay living there until you are married? Does she really think having a baby would cause you to leave your job(s)? Because if that is the case, then millions of married and single women with babies would have left and stayed at home.\n\nIf they are married, then they would just let men do work for them, or if they are single, the government. But that is not the case! Women fought to be independent and have their rights. As I said, a baby is not a mistake. They are innocent. They did not ask to be born.\n\nThis just shows me that if you ever get pregnant before marriage, she will treat that child differently than any you have after marriage. She is not your friend. She is your mom, and she is not doing a good job of it. I'd say this is just no territory. I would love to suggest r/justnomil to you. But maybe Im wrong. Maybe she is a lovely person. Maybe she will get over it, but I doubt it.\n\nYou are an adult. She can not say what you can or can not do. You need to move out. You need to be your own person.", "NTA Everyone lies about sex. (Ask you mom's sister about when mom was younger.)", "NTA she never made you feel safe to talk to her about this because of the double standards she has for men and women. Yes you lied but had she made you feel truly comfortable with her you wouldn't have. I will say that when she does move on you do need to bring it up and that it hurt to see her follow such misogynistic beliefs", "NTA what you do is your business.", "NTA.\n\nLife is too short to deal with misogynists, whether you came out of them or not.", "Wow.  Your mom is toxic AF.  Wouldn’t be surprised if you chose to go NC after all this.\n\nNTA by a long shot!", "NTA\n\nYou’re a full grown adult and your mom doesn’t get a say in your love life. \n\nHer views are horribly sexist and it’s quite sad that she thinks women have such little value. \n\nAlso, if she is not prepared to accept the answer to the question, she shouldn’t be asking it. Most people have sex before marriage and she should know that. If she can’t handle real conversations then she needs to not ask or bring up any of that sort of thing with you. She sounds incredibly immature", "“She told me it’s different for him because he’s a guy so she doesn’t care and he’s not the one who would have to live with a mistake”.\n\nUmmmmm", "NTA. Hope your mum can take some time and come around and you’re relationship can get back to what it was. You are an adult now and have the right to make that decision on when you’re having sex. And I do t understand how it’s okay for your brother to do as he wishes but not for you? If you don’t believe that you shouldn’t have sex until you’re married it should go for everyone surely?", "NTA. Your body your choice. I have kids your age and their sex lives are none my business unless they decide to to share.", "Your mum is mysogynistic asshole. If your brother gets somebody pregnant he doesn't \"have to live with his mistake\"? For real? You feel bad but she's the one who's wronging you.", "NTA. Having a baby absolutely would not hurt you or your career. This is 2023, not 1950. You're an adult and are allowed to make your own decisions.", "NTA. Your mom is intensely hung up on this one aspect of your life and it's not acceptable. Don't apologize to her any more than you already have--SHE is the one who should be apologizing to YOU for speaking to you so cruelly. Telling you that she thinks less of you and then the guilt-tripping bullshit about how you must not care about her and all that? UNACCEPTABLE. You deserve better. Your mother is letting her hang-ups destroy her relationship with her daughter, and I want to make this perfectly clear: SHE is the one destroying the relationship, OP, not YOU.", "NTA\n\nYou are 23, an adult.  You are allowed to make adult decisions.  This includes deciding to have sex with someone.  Your body, your decision.  The fact that your mother has some very biased ideas based on gender is ridiculous.", "NTA. Unfortunately your mom still holds some archaic beliefs about sex. The fact that she feels differently about your brother, and saying he wouldn’t have to live with the mistake is crazy! She’s ok with/ expects your brother to become a deadbeat dad, but you can’t have sex with a great guy while on birth control??? Wow.", "You’re NTA for being your own person—with beliefs, values, and morals separate from your mother. My relationship with my mom was exactly likes yours. I basically felt like I couldn’t be happy unless my mom agreed with and supported all of my choices. This went on into my late thirties. I ended up married to someone she didn’t like, and this forced me to get therapy, put up boundaries, and understand that the only person’s opinion about me that truly matters is my own! Live your life for YOU, not your mom or anybody else. As you age and experience more situations separate from your mother, your mom is going to attempt to exert more and more control over your choices —all in the name of love and concern. Unfortunately, all it is is emotional blackmail. Your mom means well, just like my mom. It’s up to you to realize that what she’s doing is not healthy and put a stop to it. You’ll have a much better relationship with your mom once she sees you as an adult separate from her. You’re going to have to do the hard work though. It’s painful to separate yourself from the person you feel closest to, but trust me when I say, it’s even more painful to sacrifice the relationship with yourself in order to make mom happy. And good for you for being responsible and taking care of your health!  Your mom doesn’t have to agree with you having sex outside marriage but she should applaud you for being responsible. Good luck!", "NTA. You're a 23 year old adult! Highly recommend talking to a therapist to get some context on how fucked up your mom's attitude is here.", "\\*sigh\\* \n\nNTA at all. It's YOUR body. YOUR choice. YOUR life. You don't have to disclose personal information to anybody, including your family. My mom was the same way, so traditional. Until she got cancer and was dying and realized there were far worse things I can be doing than having sex. I never got safe sex talks, I never got positive sex talks, I never got any of that until before she passed and she told me to wait on having kids. I'm sorry to say your mom isn't going to magically change her beliefs. She's always going to have that sentiment. And that's okay, that's a reflection of her not you. Give her time and she'll come around, but unfortunately, she's not going to be magically open up and accept that part of you. Sex can be a very healthy part of life, so enjoy it!", "NTA. Your mother is showing some classic aita parent narcissism here.", "NTA but.......\n\nLying is never good and you ARE an adult. Even if the conversation doesn't go the way you want, it's better to have a calm, civil one than continue to lie, or own the fact that you did for so long. \n\nIt sounds like you were raised properly to determine what you can/want to do with your life and body.  Parents worry about us till the day they die (I'm 38 an my mom still worries) and while it can be nonsensical and overbearing to us,  it usually comes from a place of love.", "Your mom is old school for sure. The different expectations for a son vs. a daughter is wrong but it’s how she was raised and how she feels. \nI would write her a letter and tell her all the things you have said here.  Tell her how much your discussions mean to you and also, how much your boyfriend means to you.  \nI would also explain to her how much the different expectations hurt you and how you have taken every precaution to not “make a mistake”.\nIn the end, only time will tell if you can change her mind.\nNTA", "You're 23.  Only you (and to some extent your partner) get to decide if you have sex. \n\nYour mother doesn't have to like it but it is not her choice. \n\nLying to her doesn't help anything, but I understand why you did it. \n\nESH.  She is more the AH than you, but you need to be able to tell her that it's not her business.", ">My mom and I have a great relationship, we talk about everything else and I want to share stuff with her.\n\nESH.  The lie is always worse for a relationship than whatever is behind it. \n\nIf this was more a \"last straw\" kind of issue, then it could be a fork in the road for you. If you and your mother want a way forward in your relationship, a family therapist could help navigate this.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23F) have been dating my boyfriend (26M) for a year and a half now. We’re in a LDR situation currently.\n\nI forgot to put away my birth control pack and my parents found it and now my mom isn’t speaking to me. When my mom realized my boyfriend and I were pretty serious, she told me how she expects me to wait until marriage and that she would be very disappointed in me if she found out I was having sex. She says that as a girl, if I have sex and get pregnant then I would ruin my life and career. Whenever I visit my boyfriend and come home, she always asks “ were you good”, “are you still a virgin”, “are you still clean”. I just always say yes. My brother (29) on the other hand never got a sex talk. She told me it’s different for him because he’s a guy so she doesn’t care and he’s not the one who would have to live with a mistake. I know she likes my boyfriend because she lets him stay at our house in the basement when he visits me.\n\nI probably could have lied but my brother, friends & cousins told me to have a civilized convo because I’m an adult and as much as she wants to, she can’t control my choices in this situation. At first she refused to talk to me, but then said she had no idea what to say to me because I betrayed her, I know how she feels about this, I lied to her and I know how much she hates liars. I apologized for how she found out, for lying and for hurting her. I explained how I didn’t want to disappoint her and I didn’t want her to think any less of me. She replied “Well I do think less of you now.” \n\nI told her I understood her expectations & beliefs but I just didn’t agree with them and I made my own choice. She proceeded to say that yup I made my choice regardless of what she thinks and that I think I’m so old now that I don’t need to care about what she says or about her protection. I apologized again for hurting her and for lying about it and at the end of it all she said “well you don’t have my forgiveness and I don’t forgive you or accept your apology.” I decided to just walk away. \n\nEveryone is telling me that my mom probably needs some space and time. My cousins told me they were just happy that I was being safe and using protection. My mom and I have a great relationship, we talk about everything else and I want to share stuff with her. We gossip like bffs and talk for hours every day. In every other way I am who I am because of my parents like how important school was and now how important my career has been. I did everything they wanted me to, I finished school, got two degrees, interned throughout school and now I’m working three jobs, one at a dream company of mine. I know she’s proud of me but I feel like this one thing makes me a disappointment in her eyes. I hate that I hurt her and I’m feeling so guilty about this. I know that I was wrong for lying but she never made it okay for me to talk to her about this without knowing she’d be upset. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA. We live in a different time.  Mom needs to open her eyes and ears. Hell, they even pass out condoms in high school.", "NTA it’s none of her business.", "NTA I fail to see how waiting for marriage alleviates the risk of a pregnancy ruining your career/life.", "NTA Why is your mom involved in details of your sex life? Need to create some boundaries here.", "NTA. You don't owe her a thing and she's being really obsessed with your body.", "NTA\n\nI didn't even read half of your post. You are 23! You can fuck or not fuck whoever you want and as much as you want! You are a grown ass person! Your mom can say whatever she wants, it's your life, not hers! Sorry for the rant, but i just can't wrap my head around that bullshit of \"staying clean/untouched\" till marriage...", "Nta. Her internalized misogyny is not your fault. It’s deeply rooted in sexism to think that way towards women. You are allowed to do whatever the heck you want with your ass, you body belongs to you only, and she does not have a say in this. No parent has a say in this.", "NTA. Your body, your choice. She can make her values known to you but the way she did it was overbearing and incredibly shaming.\n\nIMO the most appropriate response to  “Well I do think less of you now.” is \"Feelings are mutual\".", "NTA. Your mom shouldn't be this concerned with her adult childs sex life", "NTA\n\nNext time she asks, just reply, \"You want details? Just watch the videos, they're all online.\"", "Careful there, I can see your mom trying to fit  you for a chastity belt. It is not her business. NTA, but your mom is", "Definitely NTA - I (25F) was/am in a very similar situation. My parents never asked me directly if I was still following all aspects of their religion, including no sex before marriage so I \\*technically\\* didn't lie. But I definitely withheld the information. My fiancé (at the time) and I decided that we were ready to have a baby and started trying a few months before we got married thinking it would take a little bit to get pregnant. Well, it did not and I got pregnant right a way. \n\nWhen I told my parents my dad didn't speak to me for 2 weeks, then when he did it was to tell me how disappointed he was and how he would just have to \"live with his failure as a parent.\" It has been about 2 months since and things are still weird, but he is coming around. My mom has been very excited and supportive the whole time, so I'm sure she is keeping my dad under control lol. \n\nI was sad he felt that way and did not want to be a disappointment, I'm sure you feel the same way. But ultimately its your life and if they want to take your decisions personally that is their problem.", "NTA your body your choice.", "Info: when will you move out?", "NTA\n\n&#x200B;\n\nJust tell her it is none of her business. And STOP apologizing to your AH mom.", "Nta. You’re an adult, none of this is ANY of these peoples goddamn business and your mother is so filled with misogyny it’s disgusting.", "NTA. You mother was free to express her views when you were growing up, but it is inappropriate for her to make any such comments now that you are an adult. \n\nMy guess is that your mother wasn't a virgin when she got married and has carried shame because of it. Oh, she might act like she was, but I bet you she wasn't.  I had a mother who was very much like this.  I could never figure out why she married my father when they clearly were not a match.  Turns out she married him because they had fooled around, and she didn't want to have to tell someone that she wasn't a virgin.", "Damn what a line.", "😂", "Actually lol’ed at this one. Good show.", "OP should have replied: \"yes, I was very good!\".", "[removed]", "NTA\n\nLet's not be naive, the mother doesn't give a crap about career, she just wants to shove religion through her throat.", "This is...demonstrably untrue (at least in most countries). Working mothers in the US have it extremely hard, and a baby is a huge risk to your career across pretty much every industry due to poor protections for parents in general but women in particular. Not the point of the post, of course, but still.", "I mean, it doesn't seem like she lied. It seems more of omitting of information. And personal information like that doesn't need to be shared. There are ways to shut questions down without lying- mom: \"what is this? are you having sex?\" daughter: \"I don't think that's information I would want to share with anybody.\" or \"that's a very personal question, i don't feel comfortable asking\". I get parents worry about you, but, in my opinion, the positive love worry would be that she's having safe consensual sex, not that she's having sex.", "What? Trying to equate the two of them is nonsense. The only mistake OP made here, in my opinion, is actually telling the truth. \n\nThe mom is a bigoted (against her own gender!) AH. OP just had sex. Those are not remotely comparable. I feel no pity for the mother that her daughter “betrayed” her.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Are you clean?\n\nYes, we showered together and he got EVERYWHERE with that loofa.  \n\n\nhonestly, \"are you clean?\"  This seems like a weird phrasing choice.", "Ha ha ha.", "I’m not sure what that comment is meant to mean. I didn’t copy it from anywhere else, but I am quite active in that subreddit, so I may have given similar advice elsewhere", "Lies of omission are still lies.  Honesty, even if it's uncomfortable, honesty is 99% of the time the best policy.  Also, this is a blatant lie:\n\n>Whenever I visit my boyfriend and come home, she always asks “ were you good”, “are you still a virgin”, “are you still clean”. I just always say yes.\n\nThere's kind of a fine line, too, since it sounds like she still lives at home - you need to be respectful of the rules of the household. I think the mom just has to get past the point of OMG SHE IS HAVING SEX to the \"if you're going to do it then at least be safe.\"", "This! There is NO equivalence between OP and her mother. None. Whatsoever. Basically, this abusive, controlling mother forced her daughter to lie by emotionally blackmailing her and threatening to withhold affection and comradery unless OP fell in line with her mother's disgusting beliefs about women and sex. \"Are you still clean!?\" WTF? OP has the right to make adult decisions about her own body and she is doing it responsibly, using birth control. OP betrayed her mother? No, it's the other way around. OP, I'm convinced that your relationship with your mother was only \"great\" in your opinion, because you were allowing her to control every aspect of your life and that's what she required to accept you. To me, a mother of 2 daughters, 19 and 22, that is NOT a great mother. NTA for sure, but your mother is. You need counseling so that you see your mother and relationship with her through reality's lens.", "So with her knowing the rules of the household, should she have come out and just told her mom \"hey btw i'm having sex\"?", "Yes?  It's better than lying.  Own your shit, you're an adult.", "But the mom isn't entitled to know all of op's personal shit. Op is under no obligation to share intimate details of her life with anyone. There's such a thing as privacy ffs", "Yeah, sorry but owning your shit is entirely different than not responding to intrusive questions. That’s like when people ask “how many people have you slept with” or asking people “do you smoke weed?” Or other questions that are nobody’s business. Her mom has absolutely zero valid reasons to know whether she’s having sex or not. Her mom is not going to get past any point. Her mom is going to hold this against her grown ass daughter. Whether she lives at home or not. Because the principle of the matter is her mother is so rooted in her own traditional beliefs, she believes her daughter in impure.", "There is, but there are better ways to go about it than lying about it.", "I actually disagree, with a bit of mature conversation mom can get there.  I know because I've had to do it and help others through it. It sucks and can take a while, but eventually they come around. \n\nDepending on the asker, those questions are totally valid. Your mom asking if you had sex when you visited your bf?  No, not really appropriate for an adult to ask another adult. \n\nAs you said, she's a grown ass OP. Her mom may or may not change, but at least OP can say she did everything she could."]}