{"id": 12336, "submission_id": "11rq3ei", "title": "AITA for telling for girlfriend that I was disgusted seeing a spicy pic of her?", "selftext": "Throw away because she follows my main account.\nFor context, my girlfriend (19f) does OF which I (18M) have no problem with, as we both benefit from it. The other day, the topic of her account came up the other day and she asked if I was still okay with it, to which I said yes. She then brought up that she had taken some new photos earlier and planned to sell which I was more than okay with. \nAfter uploading them, she asked if I wanted to see them to which I responded with \"I'm good, I don't feel the best with seeing explicit photos of you that other men have seen, in fact I feel kind of disgusted\" \nShe took a while to respond, and when she finally did she called me an asshole for saying her body is disgusting. I tried to clarify I didn't mean it like that but she wouldn't respond and still hasn't. \nSo aita? \n\nQuick edit: I think people will see the OF thing and immediately jump to \"So you must not be okay with it if you said that\" so let me clarify. I'm not disgusted seeing a photo of her, as much as the title may illude to that. I'm disgusted seeing an explicit photo of her that other men have seen and masterbated to\n\nEdit 2: As a lovely redditor put it, I can be okay with the work but not okay with seeing the stuff that she posts. And the only way I \"benefit\" from it is sometimes she helps pay the bills\n\nFinal edit: Jesus Christ some of the messages I got were absolutely brutal, some of y'all's need to chill out. Also, she finally responded saying how she let her feelings get the best of her and apologized for not hearing me out. She also said she understood I wasn't calling her or her body disgusting. We agreed that she wouldn't send photos from her account anymore, as well as not posting the photos she sends my first unless I say it's alright. And I know what some of you may be thinking \"that's controlling of her body\" and to be fair, yeah I can see why you're saying that but she was the one who suggested that. Also, to whoever sent me death threats, get therapy, please. It seems like you were projecting a lot.\n\nFinal, final edit: Yes, I apologized, yes I still feel like shit, and no I'm not going to stop her from posting pics, and no I'm not going to send the link to her account, please stop messaging me and asking.", "created_utc": 1678868205, "permalink": "/r/AmItheAsshole/comments/11rq3ei/aita_for_telling_for_girlfriend_that_i_was/", "score": 63, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my girlfriend I was disgusted seeing an explicit photo of her that other people have already seen. I believe I'm the asshole for saying it the way I did.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA\nYou obviously aren’t okay with her doing OF. This is a bit of a tricky situation but you’ll need to decide whether her OF is something you can get past to continue your relationship but do not keep telling her you are fine with OF (maybe it’s because you benefit from the profits) it you really aren’t.", "YTA\n\nThe idea that it’s disgusting to see these pics just bc other people will also see them really indicates you aren’t as ok with her work as you claim to be.", "It is okay to not want to see the content marked for OF. It is also okay to not want to date a sex worker if thats your choice. Whats not okay and what makes YTA is making a comment like that after you consented to being in that relationship.", "YTA - quick answer? Never use the word 'disgusting' in relation to someone who you have sex with. Unless you want to stop having sex with them. It's that simple. \n\nLonger answer? You're young and trying to navigate something hard here - being open to her work and not control it - while maintaining a (presumably) monogamous relationship. But your reaction to her pictures is so strong (the word disgusting is shocking, but also the *feeling* of disgust is such a strong feeling, regardless of whether you'd said it to her or not) that it just undoes all the work you've done telling her it's ok. It's clearly not ok. She knows that now. So, why are you pretending that her work is fine, and then telling her that facing the reality of her sex work disgusts you? Cant you see how that would be upsetting / seem judgemental to her?", "Op I think you need to reflect on how you feel about your gf doing OF", "Short answer yta, you want to benefit off her, but you make her feel disgusted because most likely your jealous other dudes are seeing the same stuff you see, cause if she said she did them for you, I’m sure you’d of loved them.", "YTA, not just for not really being OK with it despite telling her you are, but also for how you reacted even though you “both benefit from” her OF work.", "YTA.\n\nYou're obviously not \"ok with it\" if you're saying you're disgusted by the pictures of her because other men have seen them (which is the whole idea of OF), so why are you lying and telling her you're fine with it?", "You tell her you are okay with it multiple times but then also tell her you are disgusted that men see spicy pictures of her.\n\nYes you dont have to like her doing OF but you literally said it disgusts you that she sends men spicy pics. And if you didn't benefit from it aswell then you wouldnt be okay with it.\n\nYTA.", "You say you ‘have no problem with it’, but then also ‘feel disgusted’? YTA for not being honest with either her or yourself about how you feel about it.", "If you’re feeling “disgusted” by your girlfriend doing sex work, you’re nowhere near “more than okay” with it. You’re looking down on her and for that, YTA.", "YTA- she seems to be wanting your approval because things like that are very important to women (that their SO finds them attractive). To say you feel disgusted would have really shattered her self confidence and I can almost guarantee she is rethinking all the things she has done. This one is going to be hard to fix man. Dont do that stuff.", "You could have worded your response much better to her. And you obviously have an issue with it! YTA", "If She does OF you knew there is nothing you see others wont", "I feel like she wouldn't of reacted like that, but you worded it terribly. \n\nYou also keep saying you're fine with it, but clearly you aren't. Its okay to be uncomfortable but you have to come together about this. You either both agree its okay or its not okay. This impacts you both, so it needs to be unanimous. \n\nLook at it this way: \n\nShe isnt with them shes with you. \nNone of these guys will ever breach your relationship \nYou're gonna get the best christmas gifts. \n\nJust relax okay?", "INFO: You're disgusted by looking at a picture other men have seen of your girlfriend because? Does it have to be a picture taken specifically for your viewing otherwise it is disgusting?", "YTA\n\nNot for not wanting to see the pic, that's totally your prerogative, but to say you feel kind of disgusted was totally unnecessary. Of course she was going to take that personally!", "YTA.\n\nJust to be clear, there's nothing wrong with not wanting to see explicit pictures. However you have nothing aganist seeing her spicy photos - as long as those are not her OF pictures, because... you find the fact that other people have seen them disgusting? Sounds like you don't really accept her job, because people seeing those photos and enjoying themselves is a part of it. At best, you seem to be okay with it as long as you can focus on the profits and ignore the rest.", "NTA, there definetly should be a boundary between her bussiness and your personal relationship. And you have the right to ask for these boundaries as much as she does.\n\nPeople are gonna overreact on this sub and call you an AH because you used to word 'disgusting'. But you didn't call *her* disgusting, you simply don't want to be lumped with her clients, which is more than fair.", "YTA, you claim you are ok with it and then turn the tables on her. You aren't ok with her doing OF as your response clearly makes it evident whats on your mind.", "Like you’re kinda TA but it may just be an age thing to where you don’t know how to word things better and communicate effectively? It’s ok to want certain exclusivity in a relationship but that doesn’t mean you get to use words that will make your partner feel negatively about themselves. Otherwise it comes off as you’re a hypocrite just trying to benefit from their work 🤷‍♀️", "YTA\n\nYour choice of words was shit. You owe her an apology for that and as you messed up, she's the one who dictates the pace. \nMake it up to her and I don't have a reason to roast you over it.", "NTA for wanting the spicy pics she does share with you to be exclusive. I get that.\n\nYou're slightly an ass tho for the words you used. You could have worded it way better and explained that to her.", "Both of you are AH. You for deluding yourself that you're okay with it, and her for misconstruing what you said to try and make you feel bad.", "NTA. You just don’t like thinking about other people masturbating at a person you care about. You haven’t said anything about what she does but what other people do. So hard NTA", "Yta as much for torturing yourself as much as her.\n\nIs it the fact she's nude and being sexual in the photos what bothers you?\n\nI think you need to get over other people wanting to fuck her. Face it: there will be people who never saw those pictures thinking about her while they jerk off. There will be people thinking about YOU while they either jerk or Jill off. \n\nSex is a part of life. Finding others attractive is just how people work. So is wanting to keep our loved ones safe. It's what we do about these feelings that matters. You need to examine what you're doing with your own feelings because you're letting them pull you down a pretty silly rabbit hole.", "NTA there's a difference between being OK with your girlfriend being a sex worker and doing quality control on her product. In short: she asked you to be involvesd in her sex work, you didn't consent.", "NTA she could have asked to clarification seems she took the worst case and now you feel bad. Good on clarifying but if she isn’t responding you she’s not keen on communication", "YTA. If you say you're okay with her doing OF, you have to really and truly be okay with it. \n\nAnd I want to be clear. It would be alright if you weren't okay with her doing OF. Some people aren't comfortable dating someone who is in this industry, and that's fine. But you have to be honest with yourself and with her. You can't say you're fine with it and then shame her for it. That's a real dick move.", "Nta", "YTA. You clearly do have a problem with it if knowing dudes have jerked off to a picture causes you \"disgust\". If that's an issue for you, I have some real disturbing news for you about her Facebook and Instagram profiles.", "Of course yta", "ESH. The old-fashioned term for what you're doing is living off immoral earnings, or pimping, so you're being a hypocrite or operating a weird double standard. She's a smaller A for twisting what you said.", "YTA here. There are probably more normal photos of her that other dudes have seen and also jerked off to (bikini or even fully clothed). You're being unkind to her under the guise of being ok with sex work but stating you're \"disgusted\" by her in certain contexts.", "You’re not okay with this. It’s okay to not be okay with this. It doesn’t make you a bad person for you to not want your significant other to do sex work. I don’t think you’re compatible and think you should seriously consider this relationship if you don’t want resentment to build up", "YTA\n\nYou say an awful lot for someone who's profiting off of those pictures there.. Like I get not wanting to see it (as a dude with a sex worker partner) I get it, however don't say disgusting.. Thats just too far, Especially if that masturbating money is something you're also benefiting from.", "YTA. You should just break up FYI.", "I’m going with NTA for stating your boundaries, and gentle y t a for using “disgusting”, but based on how you’re describing your relationship, I think you used it flippantly and would have changed that wording if you could go back in time. I feel like you’re getting railed for the wrong issue here", "OP, it sounds like you definitely have an issue with your girlfriend having an OnlyFans and there's nothing wrong with that. Maybe you could have a conversation with her about.....not?\n\nNAH.", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrow away because she follows my main account.\nFor context, my girlfriend (19f) does OF which I (18M) have no problem with, as we both benefit from it. The other day, the topic of her account came up the other day and she asked if I was still okay with it, to which I said yes. She then brought up that she had taken some new photos earlier and planned to sell which I was more than okay with. \nAfter uploading them, she asked if I wanted to see them to which I responded with \"I'm good, I don't feel the best with seeing explicit photos of you that other men have seen, in fact I feel kind of disgusted\" \nShe took a while to respond, and when she finally did she called me an asshole for saying her body is disgusting. I tried to clarify I didn't mean it like that but she wouldn't respond and still hasn't. \nSo aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Saying that you find a sexy picture of your girlfriend disgusting is pretty much a relationship-ender. Do better in your next relationship.", "YTA.\n\nYou need to evaluate how you see women. You cannot in any way be ok with “benefitting” from the financial windfall of her sex work and then imply your disgusted by her sex work. Because *that* is disgusting. \n\nAfter seeing all these edits, this is what your takeaway should be: either find a therapist and work through your issues or date someone who isn’t doing sex work. Your off-the-cuff comment showcases resentment, and it isn’t a healthy feeling to have towards a partner. \n\nYou may have worked through this conflict as your girlfriend thought you were disgusted by her body, but your explanation of your reaction doesn’t make it better. Figure out how you feel about women, and sex work, and then figure out if you’re set in your ways or if you want to change your views to get to a place of peace with your girlfriend.", "YTA", "YTA, you literally said you were fine with her doing it but when she asks if you want to see you say it’s disgusting? I’m sorry but I think there’s a bit of a double sided thing here", "YTA. Because you said you were fine with it, but you actually aren't and you need to admit that to yourself.\n\nI think that it is fine with not being ok with your partner doing stuff like OF. To me, both parties need to be ok with it or it's probably better to not be in a relationship. Some people are good with open relationships, swinging, and all sorts of other non-traditional set-ups. And that is fine for them. But it's ok to admit that you aren't into that kind of thing.", "YTA you're letting her exploit her body  for money and that's what I think is really disgusting here.", "NTA, failed communication on his part, but she has to respect that he didn't want to see the same pics other man masturbate to.", "I'm all for women doing only fans but goddam why are teenagers doing it. Grow up a little first. Makes me sad.", "You had me at \"as we both benefit\"\n\nYTA and need to grow up at that.", "This isn't black and white, but overall 'slightly' TA in my opinion, as there is some assholishness wrapped up in this... only because of all the general societal judgement that is related to anything sexual that we all tacitly level against each other for all kinds of reasons. You're participating in that one way or another. But you were also being honest and it didn't sound like you intended to hurt your GF. If you intended to make her feel bad, well ya obviously TA then.\n\nIt should go without saying that adding the reason why you didn't want to see the photo is the problem. You could have said 'no that's ok, I get to see the real thing and that's enough for me', and kept the \"disgust\" to yourself.\n\nDo you actually feel disgusted by this activity(the posting and selling of the photos)? You say you aren't, and fair enough.\n\n You just add the meta-layer of imagining others jerking off... That is what disgusts you, I think, when you see specific photos, not the photos themselves, or person in the photos. You should imagine the exact same thing when viewing an porn of any stranger then right? So maybe porn disgusts you, because it makes you think of strangers acting sexually? Seems a little odd in context. Porn is for everyone who wants to view it right?\nAsk yourself instead why does the mere idea of others jerking off disgust you? Everyone does it. It's not disgusting, it's human. It doesn't sound like anyone is running up to you, showing the photos of your gf to you, and then whipping it out in your face and rubbing one out. No, that's just all in your head. Get over that, and you can move on.", "NTA! Could have chosen better verbiage but I understand what you were trying to say. You aren’t being mean or body shaming you. You just don’t want to see the work. Simple.", "YTA for using the word disgusted. That is such an ugly word. Yeah you didn’t mean it about her body but you are disgusted at your girlfriend’s choice to sell those pictures which in turn is saying you’re disgusted about her behavior and ultimately, her.", "Nothing different than a strict division between work and life. You're ok with her work on OF, but have no desire to hear/see it. And the money is nice to pay bills.\n\nNot much different to someone whose partner unclogs toilets for a living. Great that they have a job, the money comes in handy for bills. But no-one wants to see pictures of that job.", "NTA. She asked a question and you answered honestly. Everyone is just used to ‘protecting’ women from men they automatically sided with her. And to call you controlling when you don’t want other guys seeing some of the pics is ridiculous! It’s no different than any other relationship when one person doesn’t want the other to show people their nude bodies.", "I don't really benefit from it, as I have my own job and I really am okay with it, it's the sharing of the photos with me that I'm not okay with", "She didn't make the account until after we got together, but I get your point", "I genuinely don't mind, it's the sharing of the photos with me that I'm not okay with", "Yes! He is OK benefitting off her but needs to put her down. \n\nKinda sounds pretty Pîmpy!", "You’d have*", "Seems to me like he doesn't actually like her all that much", "Nah she's the ass because if your going to have an of you already have no self worth and he shouldn't be with someone with no self worth its also prevalent she does because of her reaction", "I don't think that's the case. Maybe he doesn't want to share their relational intimacy with others. Doing sexwork or not, i'm sure you'd agree that there is an intimacy they share together that isn't comodified. It could just be the fact those lines blurring makes him uncomfortable, intimacy designed for others, but given to him is probably the part he hates.", "I am okay with it, it's the sharing of the photos with me I'm not okay with, read the post please", "I don't think that's the case. Maybe he doesn't want to share their relational intimacy with others. Doing sexwork or not, i'm sure you'd agree that there is an intimacy they share together that isn't comodified. It could just be the fact those lines blurring makes him uncomfortable, intimacy designed for others, but given to him is probably the part he hates.", "I told her I was disgusted with seeing pics that others have seen, not with the pics itself and the only way I \"benefit\" from it is that every couple of weeks she pitches in for a bill", "What about OPs self esteem though? He is the AH in this situ for sure as he’s not being honest with himself and his partner but I’m sure it isn’t easy for him either", "I really don't", "I don't think that's the case. Maybe he doesn't want to share their relational intimacy with others. \nDoing sexwork or not, i'm sure you'd agree that there is an intimacy they share together that isn't  comodified.\nIt could just be the fact those lines blurring makes him uncomfortable, intimacy designed for others, but given to him is probably the part he hates.", "Thank you for not being biased", "Ewwww do people actually do this?", "To which she doesn't have", "She didn't twist what he said she was hurt by the fact that he's \"disgusted\" by certain photos of her while claiming he's ok with her OF account.", "same, i think OP is not a native english... i guess that's lost in translation. so better wording could apply in the own language", "how would that make OP TA? it's her body... not OP's", "“which I have no problem with, as we both benefit from it” it sounds like you do tho??\n\nit’s fair to not want to see those photos I guess… “out of sight out of mind” type thing, but don’t shame her for it. your delivery was not cool", "Then you're not okay with her job - because doing OF means taking spicy photos and sharing them. You don't mind her taking the pictures but the idea of other people seeing them disgusts you.", "Then you should leave the relationship, save wasting anybodys time and mark it down as incompatability.", "doesn't matter you don't like it dump her don't call her disgusting", "Are you chained to her radiator? You can leave someone if you're disgusted by how they make a living.", "For the record I wouldn’t be okay with this either OP and I’m a woman", "Doesn't that kind of ring any bells to you? İt's one thing if it was before but after?", "Can you put into words why, exactly?", "That's not what prevalent means. Also, your attitude sucks.", "As many have pointed out here: are you actually ok with it, though? Your comment to her - that seeing evidence of her work makes you feel disgusted - suggests your trying to split really fine hairs here. It sounds like you’re “fine” with it in theory, but when presented with the reality of it, you can’t deal. \n\nMore importantly - and this is what I’m more concerned about - you are “disgusted” by the reality of her work which you “both benefit” from. That’s mighty rich, isn’t it?", "It’s wild to me that you seem to be the only one who gets what OP is actually saying.\n\nIt’s him wanting to keep the intimacy between them separate from the intimacy of her line of work, and he’s not an AH for that.", "Then he can use his big boy words and explain that. Him calling it/her \"disgusting\" is evidence that he's not mature enough to be in a relationship with this dynamic. Hes calling her/her work nasty names when he could have easily said \"no thank you.\" Huge red flag. YTA OP.", "> I don't think that's the case. Maybe he doesn't want to share their relational intimacy with others.\n\nThat's literally not being fine with it.", "Her whole job is to throw ass for me and see alot more than just a spicy pic. You said its disgusting. End of story.", "You do and this is mild OF stuff only (photos), my best friend does OF and it eventually will lead to video calls where your girlfriend and another man will masturbate in front of each other on camera. Are you prepared for that? By the way it’s hard to do consistently well on OF$, the vast majority of creators make peanuts - so be more supportive if you’re really ok with it (which I don’t think you are).", "Dude, Reddit is the worst place to get good advice on these types of topics.", "It's not exactly something to brag about, but yeah. Lots of dudes getting caught out there for accidentally liking a 6-year-old bikini IG pic or screenshotting public Snaps, LOL", "Way to completely miss the fuckin' point, dude", "No, the idea of seeing the same pics other people have seen disgusts me", "I don't get whats so odd about this. Makes sense to me that he could be ok with the idea of it, but not like seeing how the sausage gets made.", "Because other men have seen it and masterbated to it", "existing very commonly or happening often: These diseases are more prevalent among young children. Trees are dying in areas where acid rain is most prevalent. commonWorking from home has become increasingly common. \n\nThis reaction is prevalent in woman who have low value of themselves. That's the dictionary definition pal. Any woman who sells her body obviously has low self worth", "Reread it please", "Most of this sub has a hard time understanding the nuance of different situations.", "Did you actually read the whole reply or just half of it?", "Comment history checks out, I think you're a bit biased", "what a bizarre commment", "That is absolutely stomach turning", "Its still her body. Your seeing the same person who is in the pics you find gross. If she does video clips they have seen everything. You arent ok with her doing sex work. Which is fine but dont act like you are.", "Which is entirely understandable. You’re not compatible. You’re values are different and that’s why you feel disgust", "I showed your post to my boyfriend and he agrees with you. Still, if you didn't want to see the pictures, you could've said \"No, thank you\", without mentioning being disgusted by aspects of her work, because that's obviously insulting and - in my opinion - needs and apology.", "I'm just wondering if you're breaking free from a Purity culture community? That's a real weird hang-up.\n\nWhat if she wears a bikini at a pool or beach? Will you be \"disgusted\" that people saw her in that bathing suit and not want to see her in it? Because people absolutely sexualize almost anyone in a bikini.", "Do you feel the same when you see her nude? It's still the same body other men have seen and masturbated to.", "(Not trying to be a jackass here) but why does that disgust you?", "Ok, but that's not what you said.\n You said \"it's prevalent she does because of her reaction\". Maybe it's your sentence structure that needs work, because that doesn't make sense.\n\nIf you have ever watched porn or had a tug over a sexy picture of a woman, you have zero right to say that the women providing you with that porn/picture have \"low self worth\". Men buy into the market and then hate the seller, it's such a shit attitude.", "Can reread it a thousand times and you still come off as TA who is disgusted by his gf doing sex work but doesnt say anything because he benefits from it.", "Hard agree on that one.", "Pfft OKAY.", "They are a super young couple just starting out dealing with OF and I wanted to inform him what OF can consist of down the line.", "Yeah. OP says his girl doesn't have any socials, but I find that hard to believe if she's doing OnlyFans. Twitter and Instagram are two of the biggest sites used to drive traffic to their \"spicy\" content. So if he's disgusted by a picture of her having been used to jerk off by other men, he's gonna have a bad week.", "I knew someone would say this and to answer, I think there's a difference between a photo and the real thing", "It just does, I just don't want to see photos that other people have seen", "I watched porn when I was younger like 15 and below but realized how gross it is and haven't every since. I get pleasure from my girlfriend being in a relationship and selling your body to others is one of the most disgusting demeaning things you can do regardless of gender I this case it's a woman of it was a man I would probably shame him more. And yes probably sentence structure I tend to type my thoughts then edit later bit for reddit I don't bother because idrc", "You cant read then, obviously", "I get what you're trying to say, but I still think you're biased", "For sure there’s definitely something fishy going on here (mind the pun)", "But the OF viewers aren’t experiencing the real thing either?", "Yeah, it might actually make sense if you were more upset by other men experiencing the real thing. She's not putting herself out there because she wants to think about other guys getting off over her or because she's into them, she's doing it to make money. It's that simple.", "Are you okay that people sexualize your girlfriend in real life in front of you? Just not in the privacy of their own home away from you and with a flat photo? \nYou're seriously concerned about people you don't know doing things, in the privacy of their own home, that you don't really about? \n\nHer work bothers you more than you are willing to admit.\n\n You need therapy.", "I can actually understand that. I think it’s a primal response. It can be hard to explain why you feel how you feel because might be coming deeply from the subconscious, from the part of the brain/body that is animalistic and territorial. Disgust is a strong emotion and is often instinctual - its purpose is to help us survive in the wild. I think it is totally fine to feel how you feel and does not need to be justified. It’s ok to have boundaries. Your girlfriend is twisting your words a bit, although it’s understandable that she might be hurt.\nAlso as others said i would examine how you really feel deep inside about her doing this work.\nI’m a woman btw.", "Ahh. Because those photos aren’t just for you kind of thing?\n\nAre you feeling jealous? Protective? Possessive of her? (I’d don’t mean the third one in a bad way, trying to translate while high.) \n\nI don’t think it’s unreasonable of you to have boundaries, but I’d encourage you to explore that train of thought a bit more.\n\nIt seems like you’re ok with the theory of sex work, but in practice there are things that are making you feel uncomfortable. \n\nTry to put your thoughts down on paper. And then talk to your girlfriend. You’ll need to discuss this and perhaps lay down some rules if this relationship is to continue. \n\nIt’s a tough situation. I wish you all the best. But just please be careful with your words. “Disgusted” is a devastating word to hear from a significant other.", "You're acting as if all work doesn't require selling your body. Are you not using your body during manual labor?", "You are whack", "Im not but okay.", "It could also be for both reasons, we don't really know.", "Did you really just compare to selling your body for sexual pleasure completely demeaning yourself and your worth for someone else's sexual gratification when you're in a relationship to working a physical job? I wpuld get a psychological evaluation because there's no way you genuinely believe that either you're a reddit troll or have a coomer mindset ruined by the access of porn at a young age", "That's fair, but I think it's safe to say that the vast majority of women don't create an OF for the attention from creepy guys. Sure, some are flattering, but most of them are gross. \n\nI'd 100% understand if he was put off by the messages she gets, but it sounds like he's just young and insecure."]}