{"id": 12391, "submission_id": "11sb5r7", "title": "AITA I created a tech support Help Desk for my family and now they're mad at me.", "selftext": "I'm female, 24 years old. I'm studying computer science and I'm currently doing an internship at a medium-sized company that hasn't laid off 30% of its employees (yet).\n\nSo, since I'm the one who knows about computers, my family sees me as their personal tech support. And my family is B.I.G. I live with my mom, my little brother, 2 of my aunts and their kids. The kids are lazy when it comes to tech shit because they know I'll do it for them, but my mom and aunts are beyond tech illiterate, they're tech morons.\n\nI am constantly interrupted in my studies or word because my cousins forgot their Disney Plus profile pin, or my mom needs to reset her email password again, I actually set up a cloud password manager for them that they do not use because they always forget that it is an option. \n\nSo a few weeks ago, one of my little cousins wanted me to help him reset a password after he got locked out of Google, and he aggressively knocked on my door demanding that I help him.  I asked him, \"Do I look like TS to you?\" and he said yes with a straight face.\n\nSo I got a domain and set up a help desk. Then I told my family that if they wanted any help from me, they should go to the website and submit a ticket for my help. My aunt said I was being ridiculous, but I was deadly serious.\n\nIn the following days, I would give them the cold shoulder if they tried to come to me with technical problems, and just tell them to submit a ticket and I would send them the solution by mail. Forgot your mail password? Too bad, use someone else's mail. Fortnite is lagging? Get a ticket and wait till I'm home. That helped me a lot.\n\nBut then yesterday I came back from the university and the whole house was sitting in the living room telling me to sit down. They were doing an INTERVENTION on me! WTF!? They said I was rude, cold, condescending, and unhelpful. My mom said she's tolerated my \"manly ways\" (no idea where that comes from) because I'm helpful with technology, but now they won't stand up to my disrespect and I'm treating them like children. I said no, I'm treating them like customers.\n\nThe discussion got heated and turned into a screaming match. I said I would move in with my ex-stepfather because he doesn't ask me to do shit, I'm still with my family but I feel like everyone hates me now, but my ex step father says I'm on my right to be annoyed by them. AITA?", "created_utc": 1678918483, "permalink": "/r/AmItheAsshole/comments/11sb5r7/aita_i_created_a_tech_support_help_desk_for_my/", "score": 1919, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I set up a help desk for my family's technical problems because they were constantly interrupting me. I told them to submit a ticket for my help, because they are useless when it comes to basic tech so they rely a lot on me solving everything. The help desk is working great for me. However, my family is now mad at me, saying I'm rude and unhelpful, we got a heated discussion and I feel like everyone in the house hates me now. I ask myself if I'm in the wrong.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", " Ok, this is BRILLIANT. If it was once or twice in a while, I’d say you’re an ass. This consistently with no respect for your time? Not only NTA, but genius.", "NTA    No good deed goes unpunished.\n\nI'm sympathetic with folks who are technologically illiterate if they're willing to listen and at least try.  Less so with those who are lazy entitled jerks.  You're facing a mixture of both, compounded by the numbers.\n\nYour solution was ingenious - good show.  I'm hoping you don't actually have to move, and that the threat gets them to shape up.\n\n(Edit: typo)", "NTA.  You help desk still got them help and allowed you to help them on your own time and when it was convenient to you.  They seem to not value your time or effort.  They need to calm down and learn patience.", "NTA - replace tickets with invoices for your time... They'll beg for the tickets back!", "NTA.  It is very inconsiderate of them to think that you are going to be the geek squad at the drop of a hat.  You were still willing to help them but they didn't appreciate you setting up boundaries.  It is understandable that you are annoyed by their behavior.", "NTA. They have such a sense of entitlement, don't they? Expecting you to provide free labor on demand, and throwing a massive tantrum when you don't. Is moving in with your ex-step father a feasible option? I suggest you seriously consider it.\n\n(And if you do move out and are no longer dependent on them for shelter, then you could consider charging for providing tech support.)", "NTA. IT guy here. I don't do support for friends or family. At all. If they insist, I tell them it's $250 an hour, two hour minimum including travel time. That's the family rate.\n\nShockingly enough, no one takes me up on it.", "NTA. You have a life and a job of your own. Helping occasionally is a fine expectation for them to have, as it is normal to help people you have a close relationship with. But for them to expect you to help ANY time anything goes wrong, especially a forgotten password, is insane. They have access to the internet. They have google. Resetting a password isn't even hard; most websites literally walk you through it step-by-step. The adults are being lazy and choosing not to read. You've even helped set up a password manager for them that they choose not to use.\n\nThe children especially should be learning this stuff, since this is something they're growing up with. If I was able to reset my webkinz password at 9 years old, they can reset their google password. Hell, I was doing netsh wlan in cmd to find my friends' wifi passwords at 9 years old. If the kids are old enough to play fortnite, they're old enough to learn basic computer literacy.", "NTA. They don't have the right to constantly interrupt you. You can get to their tech issues when you get to them. Btw, I hope you're charging $ for your services.\n\nYou may lose the ability to live there over this, but they may also decide that your help is worth it and decide to be more polite about requesting your help.", "NTA.\n\nAnd they are the ones who are disrespectful, treating you like an TS - and never get their shit together and LEARN!", "NTA and I suspect you're going to go far in your career before too much longer!\n\nYour family are behaving like spoiled, entitled, obnoxious AHs and your mother's whole thing about \"manly\" just means she hates the fact that you aren't being a submissive doormat and kowtowing to their every demand as if you were nothing more than an unpaid servant.  I seriously hope that you are able to make a change in residence and it's probably time to block phones and media access and let them figure out how to deal with the modern world on their own.  A few weeks of that might (but it's a really weak might!) make them appreciate you and treat you and what you do for them with more respect.", "EPIC idea!!!!\n\n\nNTA", "NTA. They're bad clients. Fire them.", "NTA. Some of their quotations could easily be answered online, they’re just being lazy. I’m not the best with computers but if I can’t find the answer online, I ask a teenage family member for help, and I freaking pay them for their time. (They love helping me now)", "Clear NTA. Move out and be done with the useless ungrateful inconsiderate lot of them.", "NTA. Remind them that you are not their tech support but a family member. It is your right to tell them no when you don't have time. If they wish to press the matter, tell them you'll charge them for your time and don't help them.\n\nI have friends who ask me for help and they have no problems paying for my time. That payment can be anything from actual cash to food, but they do pay for my time.", "NTA. The only way I would help them is to print out directions and tell them to figure it out. They will never retain it.", "NTA.  You're a genius, but also the fact that it's come to this means they are relying on you WAY TOO MUCH already.  Don't let them weaponize incompetence.  They are capable of figuring this stuff out too.  It doesn't take a CS degree to reset an email!", "NTA this is brilliant", "NTA.\n\nFrom the limited info, ex-step-dad sounds like a better person to live with. If I had a situation like this that escalated to having to move out, I'd never help them with these things again. Not even advice on how to figure it out themselves or find someone else to help. You've given them every opportunity to figure things out, and make a system that works for everyone.\n\nFrom my perspective, they're treating you like a free service, not a family member. They're being selfish, expecting you to drop what you're doing the second anyone has a problem. They don't even have the slightest hint of respect for you if they're interrupting when you're studying. Yet, they expect you to do everything for them, as soon as they want it, just because they don't want to utilize the solutions you've already freely given to them.", "NTA - As a data architect, I appreciate what you've done. I went through the same crap when I was in college like 15 years ago. I told everybody the only solution I'm offering going forward was Linux installed on everything. Suddenly everybody started trying to solve their own problems and stopped going to shady sites", "NTA. They are not my family, never even met them, but I'm annoyed by them and would even help you pack up your stuff to move out. \n\nGenius idea about the online ticket, btw. They think that system is rude and condescending? Wait until they have to figure it out themselves or else pay someone to do it. I think your system will look wonderful by comparison, but that's too bad as you will have already moved out.\n\nBest of luck with school!", "NTA. God-Tier move. Well done.", ">I said no, I'm treating them like customers.\n\nNot if they're not paying you. Now each ticket is $50. NTA", "Y(N)TA only because you thought of this amazing idea and I didn’t. I am legitimately jealous.", "NTA and damn I wish I’d thought of this many years ago", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm female, 24 years old. I'm studying computer science and I'm currently doing an internship at a medium-sized company that hasn't laid off 30% of its employees (yet).\n\nSo, since I'm the one who knows about computers, my family sees me as their personal tech support. And my family is B.I.G. I live with my mom, my little brother, 2 of my aunts and their kids. The kids are lazy when it comes to tech shit because they know I'll do it for them, but my mom and aunts are beyond tech illiterate, they're tech morons.\n\nI am constantly interrupted in my studies or word because my cousins forgot their Disney Plus profile pin, or my mom needs to reset her email password again, I actually set up a cloud password manager for them that they do not use because they always forget that it is an option. \n\nSo a few weeks ago, one of my little cousins wanted me to help him reset a password after he got locked out of Google, and he aggressively knocked on my door demanding that I help him.  I asked him, \"Do I look like TS to you?\" and he said yes with a straight face.\n\nSo I got a domain and set up a help desk. Then I told my family that if they wanted any help from me, they should go to the website and submit a ticket for my help. My aunt said I was being ridiculous, but I was deadly serious.\n\nIn the following days, I would give them the cold shoulder if they tried to come to me with technical problems, and just tell them to submit a ticket and I would send them the solution by mail. Forgot your mail password? Too bad, use someone else's mail. Fortnite is lagging? Get a ticket and wait till I'm home. That helped me a lot.\n\nBut then yesterday I came back from the university and the whole house was sitting in the living room telling me to sit down. They were doing an INTERVENTION on me! WTF!? They said I was rude, cold, condescending, and unhelpful. My mom said she's tolerated my \"manly ways\" (no idea where that comes from) because I'm helpful with technology, but now they won't stand up to my disrespect and I'm treating them like children. I said no, I'm treating them like customers.\n\nThe discussion got heated and turned into a screaming match. I said I would move in with my ex-stepfather because he doesn't ask me to do shit, I'm still with my family but I feel like everyone hates me now, but my ex step father says I'm on my right to be annoyed by them. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - I love it when people can't be bothered to deal with their own issues but it's somehow trivial for you to take them on. \n\nI do think you are kinda treating them like children... And also that they are acting like them. The difference between that and you treating them like customers is that they aren't valuing the service, ie paying you", "NTA. Not even a tiny bit. Don’t give in to them. Please.", "honestly have a ticket is great it tracks the effort made to resolve the issues\n\nNtA", "Stand your ground. Great idea setting up a help desk. Nta", "NTA.\n\nI absolutely love that you set up a Help Desk.\n\nIt doesn't sound like your family is even trying.", "You are in the right. Asking for help is one thing but ignoring boundaries like your work, studies and sleep/ rest time ?? They need to learn to WAIT. I can’t believe they are so selfish and demanding. Are you like this with them ?? Do expect laundry, meals and everything in your life from them instantly?? It seems very likely to find a new place to live. NTA. Best of luck", "NTA   I'm old and my sons and DIL are patient with me but I try my best to remember instructions (reboot, Mom, reboot) and I even write shit down to refer back to.  There's no excuse for asking the same dumb shit over and over again.  You are absolutely justified in your response.  Leave them in the dust.", "NTA. Your tech support solution is hilarious and brilliant. If they can't see your value beyond the favours you keep doing for them, add PayPal to the support site and start charging them per ticket.", "NTA.\n\nGenius move!", "This post made my day!!\n\nNTA", "NTA. I know I shouldn't laugh, but I giggled at your descriptions. I think you're a superstar. You are a role model. I love what you did. They'll get over it.", "NTA. Are they paying you? If no, they can shut the hell up. IT work is awful when it comes to friends and families. \"You can sign into a computer so why isn't this power outlet on the wall not working?\"  \"My printer says it's out of ink, but I restocked the paper and threw a black cartridge into the cyan space.\"\n\nOnce you touch something, a computer, printer, switch, you're going to be on the hook for the rest of your life. 'I can't access the internet. So what if my power is out.\"\n\nGood luck OP.", "NTA - you should outsource it to a call center in India.", "NTA. Well they don’t seem to like your help desk, so unfortunately it looks like you’ll have to announce you’ve gone out of business and can no longer assist them with anything.", "NTA.  \nFrom one tech to another KUDOS!!!!  \nNot only have you found a way to manage their constant needing support BUT you built a help desk and implemented it, that’s resume worthy, especially as a CS major!!", "Nta", "😂🤣😂 NTA and if living somewhere else makes you comfortable, do it", "NTA at all, you have forced them to look at their demanding ways and they hate it.", "NTA OP.\n\nYou're doing them a favour when they ask for tech support.  If they're rude, entitled or sexist (that's the 'manly ways' bullshit your mother came up with) then you're more than entitled to stop doing them favours.\n\nI'd suggest you move out (to your ex-stepfather if he's willing to let you live with him, by yourself if not).  Some family members need to learn how to do not be assholes when asking for favours.", "Oh mate I feel ya. NTA 100%", "NTA. I helped family for awhile but after getting yelled at and cussed out related to an I’m-Lost-In-My-Smart-TV issue I refuse all requests.  “Ask somebody from your church.”", "NTA - when your mother said 'Manly ways' she means that you demand respect, won't be a door mat.\n\nPeople much prefer a woman to do what she is told, be silent etc.  A woman who says 'NO' freaks people out .  If a son did what you did, she'd be so proud, bragging to the neighbours, saying how my son is going to leave and have a career in IT but she would rather you stay home and fix their minor IT issues", "NTA and you, ma'am, are a genius. Tell them to be glad you're not charging them hourly for your assistance. \n\nMy grandfather is like your family. He has to have the latest and greatest gadgets, and he has zero idea how to use any of them. Brand new Droid smartphone, the flagship model, bit \"it's too slow.\" Why was it slow? Because he had 147 tabs open in Chrome. No, I'm not kidding. We love him, but he makes us all crazy. We take turns being tech support for him. And that's *one* person split among 3 people. I can't imagine a whole family ganging up on one. \n\nI say continue with the ticket system. And if your family doesn't like it, they can contact an actual tech support, where they will wait longer and likely pay through the nose. And it will be entirely their own doing.", "NTA, you should start charging them for your time.\n\nAlso, \"manly ways\" wtf?", "This is fantastic, I love it! Tech is changing so rapidly that I can’t really blame the older people in your family but the kids? My 8 and 13 year old know possibly more than me, who has been messing with computers as a hobby for decades. They figure it out so easily, I’m sure they’ll be teaching me soon enough.\n\nIt’s ok to ask for help, it’s not ok to act entitled to it. NTA", "You are savagely amazing. And I bow down to your brilliance. Bravo", "NTA. \n\nYour family is kind of weird and entitled.  I legit laughed when I heard your \"manly ways\" are too much for her.\n\nGet your stuff and leave. Your ex stepdad can help you and you're manly ways until they appoligize.", "NTA. What a brilliant solution, I wish I had thought of it decades ago.", "Thanks, but I got the idea in a flash and set it up in some few hours, so I didn't think it might be that ingenious. Seems like I was wrong based on the comments, no one else had this idea before me? I'm very used to think of a project and turns out 1 hundred people already did it before me.", "Love that suggestion. Post your charges for various assistance. It could be money, performing some if your chores, etc. it the don’t pay up the don’t receive further assistance.", ">weaponize incompetence\n\nDid you come up with this? I may use it later.", "Yeah! Linux for the win", "I was starting to suspect that might be because I keep my hair short and always use male jeans because WOMEN'S JEANS ARE USELESS AND WAY TOO TIGHT, I NEED POCKETS! also I hate skirts, I cant wear them without a fear that somehow someone will wait for an opportunity to lift them up or take a look under them. \n\n&#x200B;\n\nBut might also be what you said. My aunts raise my little girl cousin to be very girly and have lady manners.", "NTA. This would have saved me years of my time as a free tech support person for my family and friends. It's definitely brilliant.", "You need to charge them money. They‘re already mad at you so you might as well get something out of it.\n\nNTA", "\"Weaponized incompetence\" is a whole big topic and it turns up everywhere in relationships. \"Oh, you're so much better than I am at cooking, tee hee\" or people will *on purpose* do a shitty job of some task they don't want to do, knowing they can bamboozle someone else into picking up their pitiful slack.", "Damn, is that a thing? sounds like my entire environment, from my family to my ex boyfriend and some ex friends. I just thought they were clinically stupid.", "I mean, stupidity is always a possibility. There's a saying, \"Don't attribute to malice what can be adequately explained by stupidity\" BUT some people are clever schemers. Drop a couple of the nice plates and voilá, you're off dish duty forever.", "You are a genius.   And your Mom gave the game away when she talked about \"tolerating your manly ways\".   The reason the family is constantly interrupting you because your womanly time isn't valuable.\n\nDo move in with your ex-step, and cherish the sweet sweet silence.", "NTA this is amazing and good for you!\n\nMy husband has a shirt that says No I Can't Fix Your Computer.", "So wait. You’re still doing all of this for them - much of which any adult of normal intelligence should be able to do for themselves these days, like resetting a freaking password - FOR FREE, you’ve just set up a system so they can submit the problems to you in a form that is less disruptive to your studies? And they think this is not just something worth complaining about, but something an intervention should be staged over??\n\nNTA to like, HILARIOUS levels. Like what the actual fuck. Do they have ANY idea how lucky they are that you’re putting up with this at all, let alone setting up entire systems to make it easier to deal with??\n\nIf your ex-stepdad is truly ok with you moving in, I say go with it.", "Hahahaha \"your manly ways\" 🤣🤣🤣\n\nYou know they mean things like being good with technology and science, and standing up for yourself in a distinctly unwomanly way, right? 😆\n\nIf your family is paying for your studies, then it might be worth trying to work this out. Get them to understand that if they want you to have a good enough career to attract a rich spouse 🤢 then they need to support you by giving you time and space to study and work.\n\nOne thing that might help is a super loving but firm sign on your door while you're studying. *Hi! I'M STUDYING DO NOT DISTURB. I love you, but I need to focus on my work. If you have a problem, please submit a ticket, or come back at Xpm. Hugs and kisses!!*\n\nIf they're not financially supporting you in any way, then any support *you* offer *them* is out of the goodness of your heart, not obligation. Move out to your ex-stepfather's place and help him out instead. Sounds a lot less exhausting.", "NTA and hilarious. I hope you move to a better environment. Good luck.", "NTA", "NTA. Wish I would have thought of this when I started IT.", "NTA. That’s fucking hilarious. They’re mad because you’re no longer enabling their laziness or letting them take advantage of your kindness. \n\nAdd a page to submit customer complaints. Print up some business cards with a QR link to hand out as needed. And then move, obviously.", "Your family seems a little toxic. They don't respect your boundaries. Not good. NTA.", "NTA. If they suck so much at technology, maybe suggest some tech classes at a local library or community center (if those exist in your area…)\nAlso you should probably move out so you can get work done. This craziness will make your job performance suffer in the long run, hurting you more than them.", "Move out. See how fast they suddenly become tech literate when that can’t make you do everything for them.", "I read it fully, but all I needed was the title. Thanks for the laughs.\n\nNTA in the slightest.", "NTA\n\nMove. They don't respect you or what you do, and they never will. You have work and your studies. Their demands are ridiculous.", "They want to treat you like a slave, instead you treat them like customers. Brilliant.  \nI hope you manage to get away from them.", "They're interrupting your studies - tell your family point  blank that your studies are more important than they are. I'd be petty and bother them at all hours of the day and night. 5am - wake up your mother to get you a drink of water. cousins playing fortnight - interrupt it- unplug it and say. So ...how's your day going. bang on the door when any of them is in the bathroom saying - are you done yet?? and keep doing it. when they come out and ask what you wanted say - Just wanted to say hello -- and walk away. Let's see how they like being interrupted all the time :)", "NTA\n\nI LOVE IT!!!!!\n\nManly ways?  WTF?  nope, you were acting like a professional.  \n\nSounds like it is time for you to move out.  Good luck.", "NTA - The fact they tried to group shame you says everything. Team step dad!", "NTA. Also in IT, used to get similar requests from family and some friends.  Even if they offered to pay,  everyone, except for my Mom, can find their own tech support. Will always gladly help out my Mom for free whenever needed.", "Oh my you definitely are NTA\n\nYou've been very gracious giving them tech support and they've been abusing the privilege so much so that they are interfering with your study's and your life.\n\nI've been in IT for the last 30 odd years and I DO NOT do tech support for family or friends.  If they ask I tell them that home computers and networks are NOT my wheelhouse.  I'll give them pointers of what to look for or they are buying a new computer I'll tell them that if all they are doing is browsing the web and email then any low price laptop/desktop will suit their needs, gaming computers I have no idea about, Google accounts - never used them. TV subscriptions - not IT related. You get the picture.\n\nIf they are going to insist then I'll tell them that my TIME costs $200hr minimum for one hour.\n\nHead over to r/sysadmin and do a search on this subject and every single post will say the same thing - You do this shit for a living and all you want to do at home is grab a drink and unwind.  In your case all you want to do is get your study done, graduate well and unwind in your spare time from study and your internship.\n\nCUT THEM OFF!", "NTA\n\nI'm actually a Helpdesk Technician and laughed so hard at your solution. Did they turn it off and back on again??", "NTA and I’m shocked at their audacity!!! They basically had an intervention to demand you continue te be available for their convenience and use at any time!!! Very selfish!!", "NTA\n\nYou are right to be annoyed. Especially because they are interrupting you when you are trying to study.\n\nIt is NOT your fault none of them have tried to learn or too lazy to want to learn.\n\nInform them that they can either learn about computers, write down their pw or WAIT for you like they should.\n\nThey ALL give me the vibe that what you want and need to do as well as the fact that you have a life, is less important than what they want right now.\n\nInform them that their intervention was warped, their inability to do anything computer related themselves is no longer viable and that them being dismissive of your concerns is abusive.", "NTA but the website thing was a little extreme if you didn’t communicate with them all about using you as tech support first…but if you did and they continued acting that way they had it coming", "Absolutely NTA. Similarly, I just google and send my family whatever how-to guide fits their problem. If they won't allow me remote access, they can damn well fix the problem themselves.\n\n(I don't really want remote access to their hot mess — I'm hands-off.)", "NTA. A true Pragmatic Computer Science Student right here.\n \nStick to your guns. This is a great idea to manage your time. There's nothing they can say after you say, look the work they are askng you to do is getting difficult to manage, and frankly it is inconvenient and annoying to be interrupted while you are doing something more important. Perfectly reasonable and professional response. Your time is becoming more precious, you are simply trying to manage it better, what parent wouldn't be proud of that?\n\nGenius move, you could even put in a FAQ page with step by step guides for reseting passwords.\n\nI'm going to do this for my family, wonder why i didn't think of that - fellow family tech department engineer here. Good job", "NTA for doing this to your friend.  But you would be the AH if you start giving my brother ideas.", "My husband's side of the family does the same thing to him. Last time they bought a new phone (6 months ago), my husband was on the phone with them for 9.5 hours trying to tell them how to set it up. I told him to tell them they have 2 choices, he can drive the 18 min to their house or they can come here. But no, they can't because of covid. No one was sick or exposed. We would wear masks, but nope.  My way of thinking is if they can go into the store to buy the stupid phone, they can come here to set it up. But they wouldn't. 3 weeks ago, they called again, wanting my husband to walk them thru cleaning up and setting up their laptop with a factory reset because it was running slow. 12 hours later, he was still on the phone with them because again... they wouldn't let him go there or them come here. We had plans that day, and he kept telling us 10 more minutes. The kids and I finally left and went to do our thing. Meanwhile,  husband is upset we didn't wait. \n\nI WISH MY HUSBAND WAS AS CLEVER AS OP!!!! Granted, those 2 cases above were the extreme ones, but they call once or twice a week with \"little\" things (Amazon won't load, forgot my password, do I need to update all the apps on my phone if I don't use them at all) and it drives me crazy. \n\nNTA", "Omg - OP someone needs to give THEM and intervention.\n\nTech problems take a bit of time to solve and now multiply it by like 5 family members daily and you can easily lose hours every day. \n\n90% of these tech problems you describe are just lazy problems to solve, such as resetting a password etc and especially for the kids who are more tech literate. \n\nMy brother is better at tech than the rest of my family, he doesn’t help unless we first have made a serious attempt at first finding a solution on our own. \n\nHaving the same problem over and over wouldn’t be an excuse as you’re expected to learn at some point. \n\nFor the most common problems. Make a step by step guide how to solve them. Put it in the cloud and also print one or two versions and leave in the house. \n\nIf you didn’t exist, what would they do? They are acting extremely entitled to your time and they all need to start to become more independent. \n\nLive your life OP, focus at your studies and work. After X number of hours of unsolved problems they will all have more incentive to try to find a solution without you. \n\nGood luck.", "I honestly wonder what the adults do for a living. Like, even working at McDonald's requires more tech literacy than that these days.", "Mmmmm, where can I get a pink over sized hoodie with the same text?", "I have a scholarship.", "Thus is an excellent idea, Wish I had thought of it. The last time I did family support was when my mom called me from another state at 2 o'clock in the morning because her and her friend were drinking and decided to install a mouse and were having problems. I said you know what you should probably look into Geek Squad. I talk to you later hang up phone rolled over and went back to sleep. Lol Nobody got mad at me, but they know how I am. Mom's had geek squad ever since. She will bring her PC when she comes to visit and I'll do some maintenance and stuff. Like that on it for her but that's it.", "Next start a knowledge base.\nI also like the idea of monthly reporting. \"Auntie G got locked out of her eHarmony account 6 times last month.\"", "You should have a monthly meeting with the family with an analysis of the tickets.  \n\nPareto analysis because I'm willing to bet you a cookie that '80% of the problems can be traced back to 20% of the causes'.", "https://youtu.be/52DZ3x_TGUk", "Nta.\n\nThey say you're being disrespectful, but how are they being respectful of you, your time, or your expertise?\n\nGlad you have you ex-stepfather in your corner at least.\n\n\nAlso, your plan is genius.", "I think this is brilliant as well. I have three degrees in CS and some of my family still see me at someone that works at the geek squad (and nothing wrong to work at the geek squad but it is not what I do). I just simply don’t help them. \n\nMy “friends” used to ask me for help too. One person wanted me to help with the computer and I said sure. However, I needed the computers to come my house and he would get charge 150 an hour. He was mad and never talked to me again. Yet, he had plenty of money. \n\nI just don’t help  people. I will ignore family request unless they are from my mom and i still punt them. I dont have time. \n\nBut what you did is out of this world!!! I want to be like you when I grow up!", "I'll give you the same advice as I just wrote for the OP.\n\nIT support for family and friends is a HARD NO for exactly the type of shyte your husband is going through and by the sounds of it is ruining your family time.  Your husband needs to tell them to go to Geek Squad.  He needs to tell them that his time is worth $200hr and can they afford that.", "I mean, tbh most people who think women are required to go out of their way to look “feminine” also aren’t big on those same women having opinions on things beyond their hair, so it could very easily be both.", "If you ever want to wear a skirt or dress, just wear shorts underneath.  Workout shorts\n/ compression shorts / booty shorts work great under skirts.   I wish I'd had that option 20 years ago when i was having to crawl around under desks to hook up Ethernet cables and the jackasses were trying to look up my skirt - which was required by dress code. Grrr.\n\nAnyway, you never have to wear a skirt if you don't want to.  But don't let fear of lifted skirts stop you from trying them out if you ever feel like it.  Just add some shorts.  In most places you'll likely find you'd be okay without the shorts once you get used to it.\n\n[Princess Awesome](https://princess-awesome.com/collections/adults) has comfortable dresses with prints like math symbols, dragons, etc, if you ever feel like having fun and outraging your mom at the same time. \n\nKeep your great boundaries in place - they'll serve you well in this career path.", "He bought it from ThinkGeek (RIP), but you can probably get one made.", "Yep. Write them an email that the fees are increasing. Make the IT support a monthly subscription model.", "that's where I thought the story was going", "A family dashboard and a knowledge base of self-help articles! Love it.", "I like the way you think", "It is so much a thing. I don’t think it’s always done to say, hurt you. It’s more that they quickly learn that by feigning ignorance you will fix it for them. \n\nIt’s become a well discussed issue in relationships, I even ended up sitting down with my spouse about it. I got sick of hearing “but you do the laundry so much better/ I don’t know the settings/bs bs bs”. Basically pawning off anything someone doesn’t want to do by saying they don’t know how or yo do it better. It’s annoying as hell. \n\nAnd the fact that the kids refer to you as TS AND they staged a damn ‘intervention’ when you stood up for yourself…. Holy hell. I am so sorry they try to manipulate you like that. And now they are stonewalling you to get you to do what they want. That’s why you’re getting cold shoulder. Are you usually a people pleaser? I feel like they don’t like that you’re standing up for yourself and you definitely need to get away from that.", "NTA. At all. The tech world need more innovative thinkers like you!", "Nta", "Tell them that you are now done helping them.\n\nSince they are so rude to think you are at their beck and call, they can now find someone else.. and probably have to pay as well.\n\nNTA", ">My mom said she's tolerated my \"manly ways\" (no idea where that comes from) because I'm helpful with technology, but now they won't stand up to my disrespect and I'm treating them like children.\n\nLol!\n\nI'm getting the vibe that your mum was raised in a misogynistic environment. You being a career woman = manly.\n\nAt any rate, YTA. Your family is being extremely disrespectful of your time. Yet they seem to be offended if they perceive you being disrespectful to them (you weren't -- your intent in setting up the Help Desk was only intended to discourage their abuse of your time).", "I think of your situation this way. As a crafty person, my friends, family, and coworkers have often decided that I should make them things for free. I love making things, I do it all the time, but I choose who it goes to and how it's made. When someone tries to dictate to me how I spend my time they get a HARD NO. If they want to pay market value for my time and materials, I MIGHT consider it, but I still usually decline. My time is precious. It doesn't matter if I have a skill others don't, it's my time that's being wasted. I read a story once about a women who knitted as a hobby. She had a rule of thumb to charge friends and family double what she'd charge strangers, she called it a \"friends and family\" discount, lol! OP while I love your idea of setting up a help desk for your family I think you're just continuing the enabling behavior. Are you going to be at their beck and call for the rest of your life? These are easy things that they should be taking care of themselves, that's what google is for. If I were you, I'd be seriously considering cutting them off 99% unless it was for a legit emergency. Or at the very least, work out a trade so that you're getting back something of equal value, say house cleaning, personal shopper, cook you dinner?", "Lol!! Nta", "NTA they don’t respect your time and your mother clearly doesn’t respect your chosen profession.\n\nMove out, save your money and stay out as soon as your working full time", "NTA. They are abusing you with the demands, not requests and it is interfering with your studies. They can either learn to be polite and ask without making a burden on you or deal with the ticket system and you will handle their issue when you can.", "Out of curiosity, do your family members provide any free services to you? Grocery shopping, meal preparation, laundry etc.?", "NTA. They are taking advantage of you and your knowledge and skills for free and even DEMANDING you do it all for free whenever they want you to, not even asking if it's convenient. I applaud your pettiness and loophole find where you made the TS. Go live with your step dad, he seems to respect you as a person and not only wanting you there to solve problems. Best of luck!", "Offer to sell them a support package where they can bypass your ticket system and contact you directly.", "NTA", "NTA and seriously I'd consider moving in with your ex step-dad if you can cause this is never going to stop", "NTA. If they're being asshats and can't be grateful for \\*free\\* tech support, then they don't deserve it.\n\nNext time they ask (and there will be a next time), tell them you aren't available to help and they should call someone else.", "NTA. And my techie husband said to use this for papers. Alsp, use this on resumes. But seriously, what are they going to do when you move out?  Because they will expect you to keep helping them at all hours all the time. I'm not saying we had to move out of state to stop my mil from constantly contacting my husband about tech support issues...but I'm saying incidences have dropped to practically zero.", "Hi from another Tech Support worker, chiming in to tell you GOOD JOB. \n\nIdea: no idea if it'll work, but perhaps you could give examples they'd understand to explain: \"Mom when we were kids, and we all wanted stuff from you at the same time, what did you tell us? 'One at a time!' or 'wait, lemme finish ____.' Just liked then, my time is valuable too.\" If you want to be snarky, you can add some platitude like \"This will help me help you!\"", "NTA - Next time help them and just do it wrong. Do it wrong enough and they will stop asking.", "NTA", "NTA.\n\nYou are. Family, not tech support. They can learn how to google shit", "NTA.   Charging works.  I saw someone mentioned $50.00 per ticket.  If the old formula is used, that is $50.00 standard fee.  Double per ticket if they try to help.  Triple per ticket if they stand there watching you and constantly ask questions.    Always worked well.", "Don't forget to reiterate your Service Level Agreements on every ticket and use your ITSM skills. \n\nIncidents\n\n\"Critical/P1\" = 3 hours. Defined at many companies as $10K/Per hour/ Enterprise wide issue\n\n\"High/P2\" = 6 hours. Defined at many companies as multiple sites down.\n\n\"Medium/P3\" = 2 Business Days. Defined at many companies as a single use issue impacting work directly, no work around.\n\n\"Low/P4\" = 7 Business Days. Defined at many companies as no work stoppage, work around available.\n\nRequests.\n\nNo SLA, I'll get to it after this YouTube video, if you shut up.\n\n\nPlease feel free to reach out with any questions.", "Hahahhahhaaaa an intervention for being manly, you calling them customers, a tech support for people in the next room and moving in with an ex-stepfather, this story is GLORIOUS!\n\nNTA and the family, so entertaining in the intervention, NTAs because fair enough they want your help, feel like morons and you then make it official by declaring them morons! Or ESH, but I'm laughing, so really I 'd say this is just FAMILY lol", "NTA\n\nThey have zero respect for you and are now abusing you. Don’t stand for that. You’re doing great and being really creative and actually trying to help your family while maintaining sanity. \n\nMove out and let them have their Jesus moment when all the tech in the house shits the bed and they have to cash out their retirement to pay the Geek Squad for their many fix appointments that can’t happen for three weeks.", "NTA modern problems require modern solutions.", "People who disrespect your time, knowledge and pursuit of job training thinking you’re the one being disrespectful? Classic and totally expected. If I were in your position and had other housing options, I’d move too. It says a lot about both of you that you’ve maintained a relationship with your ex-stepdad.\n\nNTA btw.", "Totally NTA. They can't even reset a password? You should give mandatory classes. If they miss class, they have to pay you in chores for every ticket they submit.", "LMAO this is great. NTA. You don't owe them help. At all. You are being generous by helping. They are acting entitled. You got overwhelmed with their requests for help so you said, okay, i will help you but on my terms. They got mad you had terms. They decided to trash you because you weren't letting them walk all over you.\n\nTBH, I think you *should* move. Your family doesn't respect your time or capabilities. They take you for granted and trash you for not bending to their every whim. That's pretty toxic.\n\nI love how the second you say \"actually i'm not going to be a doormat\" they have AN INTERVENTION hjdhgjhs like god sakes", "NTA. Lazy people refuse to help themselves. I would do what they want and get rid of the helpdesk.  They can find help elsewhere.", "You are brilliant!!! Not TA", "NTA and bravo!\n\nI work in IT and tech capable. I have built my own computers. \n\nThey don’t understand it is time consuming. And if it was just so “easy” then they could just do it. They also don’t pay attention to your help and just expect you to do it for them. \n\nAs I tell support people at work, business thinks IT are lazy wizards that don’t want to push the button. \n\nSo after years are getting pissed like you I stopped helping in the sense of doing it for them. I make them do it and assist. It takes longer but they learn to do it because I don’t do it for them. I even ask questions on what they think they should do and let them make mistakes and help them understand why and then make them do it the right way. \n\nBtw my family doesn’t ask me to help anymore. I love it. Years ago my mom called about a printer. I was harsh and said I won’t help. My ex who is a senior programmer said I was being TA. Now this woman would buy new digital cameras when her storage was full for years until I told her to buy external storage drives. (Her computers are junk that die so it is safer.) I said go ahead and help her then. After hours on the phone he said never again! And he apologized. He said he had no idea how awful it was…\n\nNow what you did was brilliant! You set up a system to say I will help you once I have time. They are not made about the ticket system but that you won’t drop whatever you are doing to help them right now at their convenience. F THAT!\n\nYou are not their help desk. Hell most help desks don’t respond that second! You need to make clear you are fine helping them but it is when you have the time. And going forward you should say you will assist them but will not do it for them. If they refuse then say this is the last time on this issue since you can’t be bothered to learn and you can’t be bothered to keep helping them. \n\n\n\nOmg this happened this weekend. My friend’s bf’s 14 year old couldn’t figure out what email was for Fortnite. After 15 minutes he offered me to help. It is Saturday night and I had a few drinks. After he offered my help I loudly said NO. \n\nDo people who don’t know think we enjoy helping people on our own time? I don’t even work in tech support!", "NTA.  I genuflect before you!", "NTA. no respect for you or your time. Honestly, it's amazing you simply set something up to manage their requests better instead of charging.", "They don’t respect your time, they don’t respect you. Stick to the system you’ve set up and tell them that’s the only way you’re going to help them. Tell them you feel disrespected and taken vantage of.  Don’t waver.", "NTA. Just start charging people and they'll fuck off.", "NTA. Please don't give in to the pressure! Speaking from experience, if you let it go on it will only escalate and go into other areas like TVs, and washing machines and you'll have to do things on their timeline or face outrage similar to anything on /r/talesfromtechsupport", "NTA. They wouldn't expect you to drop everything for them if you were a guy. Move out", "I think it's beyond time to stop doing ANY help desk stuff anymore.  Tell them your help was a favor to family members, but they've started treating it as an obligation, and it's been interfering with your work and studies.\n\nThey won't be happy with this either.  But better to set down a solid brick wall of boundaries now, rather than the passive aggressive ticket system you've been doing.\n\nNTA", "NTA. As someone who is also in CSAIT I applaud you for this", "They’re taking you for granted, the younger ones especially can learn how to fix small issues they come by. I am not the most tech savvy by any means, and my family most definitely aren’t either, but passwords? Write that shit down somewhere. If not, it’s not like you’re asking them to get their help elsewhere, you’re just asking them to value the fact that you also have a life of your own. NTA, and good for you.\n\nEdit: my dumbass consistently forgets to add all points on first attempt.", "NTA, I’d be well pleased if someone in my household set up an exclusive help desk just for us.", "NTA. I’ve been the tech support family member so I get how awful it can be, especially when it’s constant. You deserve to have your time and work respected.", "You're a genius. Now you just have to start changing them.", "Maybe a white board signup for the older family members, and scheduled times to help? A list of days and times?", "NTA\n\nThey called you tech support so you embodied the role. They don't like it? They can take it up with customer support.", "NTA, brilliant: )", "op=NTA\n\nThey need to learn to do their own sh\\*t.\n\nI love your technique.  Move in with Ex-SF.  You need physical distance from them.  They may eventually learn respect that way(don't hold breath on that).", "NTA. As a fellow IT person going to school full time with a family of help desk tickets, thanks.", "You should charge money for change request. Service requests should get a 3 day turnaround time. 🤣", "Too funny! If you feel like offering them an alternative, tell them you will hold a walk-in office hour twice a week and they can get help in person at that time and no other time. :)", "NTA", "NTA\n\npeople who want to take advantage of you get offended when you say no.", "Oh man. Your first paragraph cut deep. We were on pins and needles if my husband was going to be one of the 30%. So far he has not. But they aren’t done giving pink slips out yet.", "NTA what's so ever. I don't care if it's family. I would call them morons right then and there. And if they can't see that they are actually acting like little children then it's more evidence to prove your point.", "NTA  I’m not really tech savvy only compared to my parents. Can’t count how often my mom calls me for help with passwords or email. It’s enough I have all her passwords memorized at this point. I don’t know my own passwords as well as hers.", "my mom is technologically illiterate but every time she asks me to help with something, she specifically asks me to show her how to fix the problem so she can do it herself next time.\n\ni’m happy to help her with anything she needs at any time because she’s appreciative and tries to learn. a little effort goes a long way!", "They definitely need to learn patience, but they also need to learn how to do stuff all by themselves.", "I used to try to help everyone but it got out of hand really quick. I started saying no, or maybe in a few weeks if I have time. They all have seemed to figure it out without me.", "What is TS?", "Wrong post?", "I would just like to add. \nThat even the elderly cannot deny that we now live in an age, where computers are a part of our everyday lives. You say you have computer morons living with you, fine,  but you have to remind them that society waits for no one. Where if they are not willing to learn a few computer basics - they WILL be left behind.\n\nMy grandmother is in her eighties and is more tech savvy than most of her peers, this is due to me sitting down showing her. She now offers advice to her elderly peers.", "I showed this too my husband. (Also the family/ friends designated tech expert). He thought it was hilarious.", "Oh this is total genius. I am a certified database administrator so I have been in your shoes. Five siblings, parents, etc...it sucks. I didn't even live with any of them. I also second charging an hourly rate.", "This is how my mother asks for help. My MIL, on the other hand, is the type to call every single time she's trying to login to her work website because she can't find the red login button in the top right corner of the page... because she is the most unobservant human being I've ever met.", "My mom asked me to write out step-by-step instructions when she was learning how to use a computer. It honestly worked really well - now when she wants to learn a new thing she requests new directions for whatever thing. She’s also taken initiative and learned some very simple things on her own.", "I wish my mom were like that. She thinks it’s faster if I just do it than show her how. Which… isn’t necessarily wrong, but dammit I don’t want to do something ten times because she won’t let me teach her. \n\nEven when she does let me show her how to do stuff, I can tell she’s not really paying attention and probably won’t remember the next time. \n\nI love my mom but I wish she’d just *try.* I wouldn’t mind showing her something multiple times if that were the case.", "Tech Support", "Monthly metrics. _With graphics_.", "Totally, like $5/ticket, maybe they will learn to remember how to do something for themselves instead of paying. Totally NTA. You got your own shit to do. Anyone else providing this service charges money", "Last time I visited my mother she was complaining that she was out of storage on her Gmail and asked me to \"help delete a few emails.\"\n\nShe had never deleted an email since I set up the account for her 15+ years ago.\n\nIt took a loooooooooooong time.", "Tell him I say \"thank you random somebody's husband\"", "That's what I keep telling him. He doesn't do tech stuff for a living. He actually works ALOT. 13 days on, 1 off in a completely different field, and has over an hour drive each way to work. I wish he would put his foot down and say no. I quit tolerating it a while ago, I refuse to cancel plans because of it, I won't keep dinner warm for him because of it and I absolutely refuse to assist in those phone calls in any way shape or form (not even a \"hun, can you being me the manual on their phones?)", "Is not about shorts, is the fact that skirts can be lifted in the first place.\n\nI went to a private school where girls had to use mandatory school branded skirts. Then there was a group of boys who had fun lifting skirts and trying to hide cameras in certain spots on the floor to take pictures when girls were standing on there to have pictures of our underwear.\n\nThe school did NOTHING to fix it. Until some moms ended up suing.\n\nEver since I stopped going to that school, I haven't worn a skirt EVER again. I turned down jobs where the dress code included mandatory skirts.\n\nNo one I didn't have sex with has seen my thighs in ages.", "I'm thinking four color glossy brochure monthly newsletters. With ads.", "Ugh!  That sucks.  I totally understand your refusal to wear skirts having had to go to such an awful school.", "sometime it isn't even clever scheming its utter laziness combined with entitled attitude of someone else will do it or fix it so they half ass it when asked and just expecting the 'magic fairy' as my mum would call it to fix it.", "Hanlon's razor is the official name for that saying!", "NTA - Also I would love the link to your help desk ha ha JK GENIUS", "NTA asking for help resetting a password is ridiculous. This is hilarious", "NTA\n\nBrilliant! You will go far in the IT world.\n\nDo it, if your ex step father is willing to let you live with him, go there. Change the domain to say IT support is now closed due to a reduction in staff.\n\nThey are just mad because you called them out on them constantly using you.\n\nHell. Put up some of the comments here. I know I am not going to be the only one.", "NTA - you are preparing these brats for the real world where they don't get their way the moment they demand it. All of us with real jobs have had to submit tickets to the help desk.\n\nThey only did their \"intervention\" because they are unable to look at themselves and realize what a bunch of AH's they really are.", "NTA \nWhile it’s good to help, you are allowed to set boundaries. Them hounding you every time even when you are busy just because they are too lazy or careless to remember things like passwords is not ok. They treated you like an unpaid round the clock tech support and now and now they are angry because they can’t do that. Let them be angry. You aren’t obliged to be at everyone’s beck and call.", "NTA and that is awesome!\n\nFor years I was my mum's tech support. My brother would buy her unnecessarily complicated tech, an iPad, a smartphone, an expensive laptop, but I lived closer so in her head I was better positioned to help.\n\nShe was convinced that I knew how to send a message in iMessage that would somehow turn up as an email.\n\nShe couldn't hear her phone ringing. Twice. First one she had turned it to silent, second time it did make noise but I had to show her the volume buttons.\n\nShe clogged up her e-reader with free books. She would download every single free book that came with her weekly Amazon suggestions, then insist it was broken because she couldn't download the one book she wanted to read.\n\nShe clicks 'yes' on pop-ups because 'it makes them go away'. Her laptop kept seizing up and we found six antivirus programs all arguing with each other.\n\nShe still doesn't understand cloud storage, and thinks all her pictures are on her phone and iPad and cannot be moved.\n\nShe constantly complained that something wouldn't turn on. Turned out she hadn't charged it.\n\nShe even did the classic of insisting to me, (as if I could fix it), that she should be able to connect to her WiFi while out shopping!\n\nI am so glad she moved closer to my brother.", "Like all good tech support there is an option for expedited service.  You can pay per request or purchase a block of expedited hours at a lower price point.  Otherwise take a ticket. NTA", "NTA - log the time you spend helping them, then call a meeting listing all their demands on your time And say that is too much. Then to Each time they demand you help - sorry got an assignment due, a test to prepare for Etc going to meet xyz at library.", "They mad you for streamlining the process? For making it easier (for you) to help them? For valuing your own time? \n\nNTA. Bunch of entitled people that want it here and now.", "As long as you're not charging them for the help the ticket system is hilarious. NTA", "Oh girl, I feel your pain! It’s one thing to help the older folk who usually don’t have a clue, but only if they’re not demanding. Your cousins in the other hand are just being dead lazy. They’re just entitled and taking advantage of you. The ticket idea is brilliant.\nNTA obviously", "My husband is a software engineer. Hes dealt with the same issue a lot. We made timed appointments with the bigger more important issues (like setup, or changing /updating parts). The times were made at our earliest convenience. Mostly weekends. If they didn't like it we encouraged them to take it to a computer shop and provided a number. Stuff where people were locked out or needed immediate assistance. Google the problem and find your own solution. People were upset at first, but figured it was easier to just Google. Now we only get a few requests a year. I thought the help desk was a brilliant idea. I wish we had thought of that  (NTA btw)", "NTA. But the email solution on how to get their email password is rather mean. \n\nYou need to write down the solutions and put them in a binder. Then tell them you will help after they and one other have tried to fix the problem. Walk them through the steps and see where they got lost,  edit your instructions and repeat. \n\nThis should eventually solve your home problem Ms. TS, and help you understand your own job in the future. Communication is everything at work if your want to get ahead.", "NTA. I need this for my family. I finally just told them, if you need me, text it to me and I will get back to you when I am free. Then again, they didn’t mind doing it either because they actually know that I have a life outside of them.", "NTA, this is awesome. Setting up a help desk system is good skills practice, and being able to set the boundary of no ticket = no help will come in very handy in a professional setting.", "NTA But I just want to offered my method to combat this more diplomatic way. I made them learn how to do this by themselves and made the lesson way hard, long and tedious than neccesary and definitely more hassle than just do it themselves. Follow up by routine check if they can remember what I thiught them week/month after etc.", "Hahahah. I know you didn’t intend for this to be funny but this is the most brilliant thing I’ve read. NTA.", "Personally, I started just telling them what to do but not physically doing it for them. I find it helps. I might stand next to them and point where to click or what to plug in but not actually do it.", "NTA and also hilarious. Just preparing them for the real word of having to deal with It departments.", "NTA\n\nI'm sure you've received this advice. Listen, you hold all the cards here. They want you to help them, think their requests are more important than you and your life. I would cut them off and stop providing help whatsoever. Respect is earned, not given, and they're not respecting your time.", "NTA\n\nI’m that person too, and it activates me that they can’t take me the time to read what the pop up/ error / web site tells them to do, or to do a basic google search and they have to ask me to come over to read it for them or google for them. And they don’t listen to half my questions or directions when I’m helping so it takes 3 times as long.\n\nSo I started saying “I’ll help you after you tried 3 things yourself”. And now every time they call me or ask I say “ok which 3 things did you already try and what happened with that?”\n\nThat doesn’t always help but it has gotten them to be self sufficient.\n\nAnother thing I’ve been doing  is “I’m in the middle of an important work call, see if Google or trying again and reading the instructions work? If not I’ll come by in a couple hours”.\n\nThey either forget about it by then, or actually figure it out, or actually try pretty hard and we’re able to do it in which case I’m happy to help.", "NTA. \nThey have become lazy and putting all the responsibility onto you. They are just upset that you won't help them anymore at the expense of your own time and energy.", "I think it's awesome. They are using you as tech support, they should have to fill out the ticket.\n\nGo live with your ex step father for a bit and see if they can manage to do anything tech related\n\nNTA", "Your solution to dealing with tedious technical trivia made me laugh! What a wonderful idea.\n\nYour family are not AHs for wanting help. I know many people who have difficulty navigating IT problems and are too afraid of trying to deal with it themselves for fear of blowing up their computer, or the world, if they hit the wrong key.\n\nWhere they are insufferable is in their ingratitude to you for helping them and their belief that their lost password is more important than your desire and need to study. Mind you, I suppose it's your fault for being 'manly'... /s\n\nGo and stay with your ex-stepdad. He sounds pretty relaxed by comparison and it will force the rest of your demanding family to use the Tech Support site you set up. If they ring you with an IT problem, you can block them one by one.\n\nNTA", "NTA charge them as well. Jk, say no, you have no idea what they are asking you about. Just play dumb..say you don't know it.", "NTA - and brilliant as well! I absolutely detest helping my family with tech (they come to me 1st because I’m also in tech). My sibilinos close to my age are absolutely capable of also helping older family members with basic shit like passwords yet I’m always the one being interrupted at cookouts and gatherings to help with this stuff. One of my aunts even asked me to help her message an ex boyfriend from her island without my uncle knowing. I’m like wtf?! So fed up with it tbh", "Edit: NTA. Your family is still being helped, just on your time table instead of theirs. That seems fair, no one expects anyone else to jump up and do a chore immediately", "NTA I think it’s brilliant and hilarious plus it’s setting boundaries hopefully they’ll catch on", "NTA\n\nDue to my profession I am my extended family's handyman. They point out that I know what I'm doing and they don't. So now whenever they ask me to do something for them I ask them to do something back for me.", "NTA and honestly great. I'm kinda worried this is actually taken from a sitcom, but if it isn't, it'd be a great idea for an episode", "They’re taking advantage of you by not respecting your time. NTA", "NTA, and you showed excellent leadership skills here. Identified the problem, devised and implemented a creative solution and set a healthy boundary. Boundaries are hard, especially with family but they are healthy and important!\n\nThese are all awesome life skills they will help you in your career too!", "I had the same problem with my team mates and it ended up I was repairing computers for the whole weekends. I finally made them pay and it stopped as fast as it started …", "Haha, I did the same thing! Some of my family members are still using Linux, they don't know how to get rid of it and I certainly won't help 😆", "That they all sat around together in a group and didn't realize how much work they generated for you is astounding. My kids started doing my \"tech\" stuff when they were 3. It was mostly reprogramming the remote when it got messed up. So the young people can start looking after mom and auntie", "You know this is just the tip of the iceberg though, right? There’s a whole lot under that “manly ways” and I bet when it starts leaking is is not gonna be pretty. \n\nNTA but honestly I’d be planning on talking to stepdad sooner rather than later before it turns into demands that you get a dress and a husband.", "NTA. As an IT guy for home and work, well done. But you need to stop doing it for them. Create guide(s) with screenshots of how to do it themselves. When they 'open a ticket', send them the guide. When they try to do a 'driveby', hand them the guide or ask them if they Googled the answer. Basically, it's the teach them to fish kind of thing. If you keep fixing it for them, they will never learn nor leave you alone.", "Move with tour step-dad. This isn't going to change. Your mother thinks computers are for boys, thus her comment. When you are gone, they can figure it out for themselves. They treat you like a servant, stop serving them. NTA", "I would add FAQ to the website with instructions on PW reset and other basic stuff. If they can’t use that then they can open a ticket.  BTW…I found getting a Google voice number to be a godsend. They can be required to identify themselves before the call is put through and you can create different vmessages for different callers.", "This was years ago but I was in boarding school and one of my fellow boarders was a bona fide maths genius. The entire residential block would be queuing outside his room to get help with maths. In the end he did something similar to you: he put up a notice that there was a two hour consultation period outside of which he was not available to help.", "If you know the show, THE IT CROWD, you will know the way we address tech problems with my dad. It git so bad that every time he called for about 2 months, I would answer the IT way. \"Good morning/afternoon. Have you tried tuning it off and on again?\" My dad copped it sweet because he knew it was a joke and he also stopped calling every day for tech help, he would save it and call on the weekend when hubby or I (depending on the issue, we have separate strengths) could help while the other watched the kids. Honestly, though, he wouldn't have been able to use the help desk function even if I did try to set one up for him.\n\nIf it doesn't settle down with your family, try a different approach. Find out the average wage for a TS in your area then work out how many times each of them has come to you over the past month or so, point out that they would have been  charged a minimum hours pay call out fee for an in person consult and then tell them how much their bills are. Maybe then they might start respecting your time. NTA in the long shot.", "The beauty of having an Android while most of my tech-illiterate family has iPhones.... \"Sorry, i don't have an iphone and i have no idea how to fix that\"    \n\nAt one of my old jobs, a guy in the cubicle across from me used to ask once a week or so, \"Hey, how do i get on the in-TRA-net?\" .... for all the company's forms and policies and crap.  But he'd say it like that, emphasize the middle syllable lol.   IT WAS REALLY EASY.   But one day i made it even easier, and i bookmarked it on his browser.   He'd still ask for help.  But instead of having to get up and go over to his desk, I could just talk him through it.  \"Click those little dots on the top right.....\"  We'd go real slow, one step at a time.  One day after i talked him through it, the guy beside me asked if that's the voice i use to explain things to my daughter 😆", "That's how my grandma was. She had her little notepads and would write down step by step instructions.  She got better at working computers than all 4 of her kids!", "if OP is living there for free or low-cost, this could backfire exorbitantly", "One of my computer friends likes to say that 90% of computer errors are either:\n\n1) Between the keyboard and the chair \n\nOr\n\n2) I-D-10-T errors. (Remove the hyphens.)\n\nYup. That’s me! But at least I know a few things and I know the basics of trouble shooting my own computer!", "Your husband is choosing them over time with his family that he can never get back.\n\nHe’s def an A H. There’s nothing wrong with making them wait rather than you.", "this would only work if OP is not paying any rent.  I'm betting if she starts charging 5 dollars a ticket,  she'll be charged rent & not be invited to family gatherings.  When you start making things transactional with family, they will start making things transactional with you as well.     You want to go on a family trip?   $ 500 for your portion. why? 5/ a ticket for IT help.\n\nand I don't think OP is a butthole here. She needs to find a better solution though rather than trying to get her family to submit tickets for her to help them.\n\nit seems like OP comes from a pretty tight knit family.", "I thought it would be hard with 15,000 emails but Gmail has things separated by promotions and other categories. I selected just the promotions category and deleted all those. 8000 emails disappeared real fast.", ">Between the keyboard and the chair\n\nPEBCAK - Problem exists between chair and keyboard.", "“Learned helplessness” is another good one.", "this reeks of desi 😭😭😭 bc it's so relatable", "NTA.  Your family, on the other hand... all sound like entitled a-holes.  Good for you, way to shut that BS down!", "YTA. Don't like it move out.", "NTA. If you don’t pay rent, maybe give the direct homeowners you are staying with X amount of free tickets per month. If you move, you gave give them some codes for free ones. I don’t get one they were talking about. They were just mad that their free support person isn’t available on their time table. That doesn’t mean they don’t have to fill out the form. The rest are $5 each though or something where you could say each ticket takes me 5 minutes and I’d charge X per hour, so that makes each ticket y. I’d factor in your equipment too. That’s what we were taught in art school you charge for services to include paying for a portion on your equipment per shoot because you eventually have to upgrade and use it for Wi-Fi.", "NTA\n\nI'm the tech guy in my family and got annoyed daily for the simplest problems that could be solved by a 6 year old , if they would just read the damn error message instead of calling me.\n\nThis stopped instant when I started to charge money for my work.\n\nDon't forget the most important rule of the world:\n\nIf you're good at something, don't do it for free!", "NTA. Actually I think we might implement using this for little tasks at home, you know change the light bulb, call somewhere. You know the stuff you need the other one to do it, which takes no more than 10 minutes and it takes days/weeks to complete...", "NTA. I have an advice-based job. It is a thing that people treat you like an advice button in any and all situations. In my industry we joke that if we were in the middle of surgery, the doctor would wake us up to ask questions about our jobs. I have to have very firm boundaries with people.", "NTA. It's a hilarious way of setting \"boundaries\" that should have been respected in the first place. Sounds like you are totally willing to help, just not at the INSTANT they need it.  \n\n\nBut then I got to the last couple paragraphs and started to wonder what the hell is going on here??? Sounds like this family has much bigger issues than being tech-dumb.", "NTA, but that help desk idea is brilliant! 😂\n\nTake it from someone who was a skilled trade (mechanic) who switched to another skilled trade (IT), one thing family will do when they know you have the skills is they will think they're entitled to free services of that skill and they will abuse it. I spent the majority of my adulthood  car repair questions and expectations of free repairs to the point it drove me nuts. Now that I made the jump to IT, it's continuing with the same problems you're facing. \n\nStick to your guns, your time is valuable and it's clear they don't appreciate that. Also, start charging an hourly rate on that help desk, especially if they continue their ways.", "My parents are not the best with computers. Whenever they need help they start by jokingly asking if tech support is open. Next question is if I have time now to help them or if another time would be better (it’s usually on the phone). They ask their question and I can usually either help them or Google my way to it. Now as it is on the phone they have to do it themselves. Sometimes I need to be able to see what’s happening and we will do a zoom call so they can share my screen. \n\nOnce I was at home and they needed my help. I was trying to figure it out via trail and error. They specifically asked to show them as me just doing it doesn’t help them long term. I had to ask for them to wait until I found the solution before I show them as showing them my failed attempts would just confuse them more. \n\nBut they are always respectful of my time and happy that I will help them. If I fail to find a solution their next step is one of my uncles who works with it. But no need to bother them with the small stuff that I can help with. They also have a family to spend time with. \n\nIf you want help the first step should always be respect and gratefulness. If you don’t show that people will stop helping you. \n\nNTA. And a brilliant solution although I would probably be petty and all of sudden not be able to solve any of their issues. “Sorry I don’t know what’s happening here, I can’t help with that”.", "NTA and brilliant solution from your end. It can also apply to people outside of your family, mind. If they want free tech support, then submit a ticket and wait for your reply.", "NTA\n\nDid you use GLPI for the help desk?", "NTA, they treat you like garbage, leave and dont help anymore", "NTA almost no one who asks for tech help understands how easy most of the things they want fixed are to fix and the issues that are not easy to fix actually take a lot of time and effort. 10 min on google and a few rational thoughts can fix most fissues. \n\nThey are saving their time by wasting yours.", "NTA. I'm an IT guy. I've set up password managers for family but nope, I'm always expected to know their Facebook, Online Banking, Email passwords.\n\nI say it's a genius idea and love that it got them rattled so much that they spat the dummy out and went OTT with an intervention", "Sorry to laugh because it sounds awful for you but you are a GENIUS! And you are definitely NTA.", "NTA. Cracking up at the \"intervention.\" You have a good sense of humor.", "This is the life of an IT person. Doesn't matter what field of IT.\n\nIf you don't set boundaries now your family will not stop and what's more they will volunteer you to others.\n\nNTA.", "\n>So I got a domain and set up a help desk. Then I told my family that if they wanted any help from me, they should go to the website and submit a ticket for my help. My aunt said I was being ridiculous, but I was deadly serious.\n\nFirst of all. HAHAHAH, this is amazing. Of course it's ridiculous. But mostly it's ridiculous that you were forced to a position where you felt this was necessary. \n\n>But then yesterday I came back from the university and the whole house was sitting in the living room telling me to sit down. They were doing an INTERVENTION on me! WTF!? They said I was rude, cold, condescending, and unhelpful.\n\nMaybe you were, but I would be too.\n\n>My mom said she's tolerated my \"manly ways\" (no idea where that comes from) \n\nI don't know you, your cultural background or your family, but I'm making a guess to where it comes from. You are (in their words) \"rude, cold, condescending and unhelpful\". I bet \nyour mom thinks women should be nice, soft-spoken, helpful to the point of self-sacrifice. While the more \"aggressive\" approach is more masculine. Hence \"manly ways\". \nI might be way off, it's just my guess. I'm about as woke as a grandpa at Thanksgiving, but even I react to that as outdated way of thinking\n\n> AITA?\n\nNTA", "NTA - I was in a similar boat with my family and their friends. But I put my foot down one day and instead of ticketing system I simply started charging them money (back then €10/hr - not much but more than 0).\n\nObviously there was a pushback but then they found out how much real service/technician costs per hour (+ combine that with I was still willing to do more for no extra cost above €10). Now they know if they just ask some question about their devices I answer it for free but if they want me to do something it will cost them - but these days they often pay me triple or quadruple willingly just because I do it fast, friendly and they know me (so no chance they'll get ripped off).", "Myself and my spouse are in tech. He used to be the guy that his whole 75+ sized family would call for anything computer or internet related. The number of weekends spent \"hanging out\" at an aunt's or uncle's house was such a waste of time for us. After a while he slowly stopped answering their calls and would often refer them to the tech support for whatever product they were asking about. \n\nNTA. You need to study.", "NTA they sound like lazy assholes", "NTA, you're describing my childhood. Not to mention my mom also lended me out to her co-workers/friends and always told them no payment was needed.", "Wooooooow, NTA and your family are huge AH's", "NTA. Complete your tickets with a “How did we do today? Your feedback is important to us.”", "\"You all founded a tech moron support group? Great!\" NTA at all.", "Payment up front too", "This exactly. Also women are expected to be self-sacrificing and helpful to anyone around them who asks, men don't have the same obligation.", "“Your family is being extremely disrespectful.” \n\n“Y T A.”\n\nI am confused.", "Around 45% of people working in IT don't tell their family what they do for a living, they just say they work at \"X\" business, not their specific title or responsibilities. This is to avoid the 3 AM phone call because their parents WiFi is out and they don't know how to reset the router, or the printer isn't working right, etc.", "I am absolutely in love with you for this!\n\nAnd as a response to some of the tickets you can send them LMGTFY links, showing how they, too, can use the Googles!\n\nObviously I have to be a bit polite to my clients, cos they pay me and all, but my response (after a hell of a lot of walk-ups) became \"I'm right in the middle of something at the moment. Would you do me a favour and submit a ticket, and I'll get on that as soon as I can?\"\n\nYour story makes my heart happy!", "NTA.\n\nIt's a cute idea. If I didn't hate everyone I know and still agreed to help anyone whatsoever, I'd totally do this!!!", "They don’t know that this is how tech support works as customers. Maybe send your mom a link to an explainer video - does she know how to click links?\n\nAnd then you can email everyone a link to the customer satisfaction survey 😂😂 avoid future interventions.\n\nJokes aside, I’d have just said no to helping them and given them a link to Reddit or an actual tech forum to ask for help. NTA - you were actually putting your skills to use in making this support more streamlined and efficient RATHER than giving them a flat no. Maybe explain that to them so they know their options with you. Good luck", "This sounds like a resume item - buff it up a bit and show your internal networking skills.", "Add a service fee", "If you're ok with wearing men's pants, I can strongly recommend men's tigh length boxers. So much room. So comfy. As long as you don't wear a lot of tight pans it works beautifully.", "And apparently raised your little girl cousin to be incapable of remembering a password. This isn't even tech support at this point. This is doing weird menial tasks for them that they have decided they don't need to handle. This is like the tech version of tying their shoelaces.", "nahh then your on the hook for ownership of the issues. If you dont take money you can just shrug your sholders and carry on. If you take the money every issue from that point on will be related to the initial issue and you will just be getting into argumnets over nothing all the time. \n\nbest to setup the ticket system and reply with let me google that links.", "Yep. I was the go to pc problem fixer for family and friends. It took hours to fix some of the issues. I started to charge them like $50. Somehow they stopped asking for help. Maybe they found another sucker to fix their problems.", "I'm the opposite. I make a systems engineer sound like an aerospace physicist, so they think the work is so complicated it can't be anything remotely related to \"can you help me with my wifi?\"", "Most I ever did was charging my dad $5 bucks for not at least turning what ever it was off and back on again before consulting me. I love this.", "Have they tried the O-N-O-F-F function to help? 😂", "It can start off from a base of stupidity, but people can quickly learn it's the easiest way of solving their problems. If someone else does all the heavy lifting, why bother trying? \n\nI've had coworkers try to leach too much - usually get them to work through their own problems. Then they will know that asking for help on the stuff they can do is more work than just doing it for themselves. Or if they genuinely didn't know how, now they have some foundation on how to solve stuff for themselves. \n\nFor resetting a password 'do it yer damn self' is a valid response.", "🤣🤣🤣🤣My ribs .", "PICNIC - problem in chair not in computer. Same idea", "Oh my God thank you. I did not know this existed and you have probably saved me hours 😂", "Chair keyboard interface issues"]}