{"id": 12469, "submission_id": "11t6xfb", "title": "AITA for not giving my family a heads-up that I'm dating again after my husband's death?", "selftext": "My (45F) husband (\"Tim\") and I married right out of college. We had a very happy first decade of marriage, including having two children (\"Luke\" and \"Beth\"), who are now 21M and 19F. However, when in our 30s, Tim developed severe depression and substance use disorder (alcohol and painkillers). His depression was treatment-resistant and that made him unable to fight his other addictions. Despite numerous inpatient psychiatric stays, and several stints in rehab, he passed away of an overdose 5 years ago, at age 40. We don't know, and will likely never know, if the overdose was accidental or intentional.\n\nAfter Tim's passing, I was 100% focused on helping our children be as okay as possible. Despite his demons, he was a great dad when he was able to be, and losing him was completely devastating for all of us. Lots of individual and family therapy helped, and Luke was able to graduate from high school with high honors and get a college scholarship (out of state). Beth graduated last year with similar honors and is also now in college, several states away. \n\nWith both Luke and Beth now adults and away from home, I can finally focus more on myself. It took me a long time (at least 3 years) after Tim's passing before I could even think about wanting to date again. Then for the next year I was focused on getting Beth through her last year of high school and off to college. However, once she went off to school in the fall I started to dip my toe into dating apps. It's been slow going; I've probably had a dozen or so dates total, mostly first dates that didn't go anywhere. There was one guy I went out with 4 times, but we decided not to continue as we weren't feeling a more-than-friendship spark. \n\nSo, here's where the problem is - last week, a cousin of Tim's saw me out on a date - she was in town for business and just happened to be at the same restaurant. She made a bit of a scene (coming up to the table and demanding to know what I was doing with betraying my husband - which really confused the gentleman I was out with). She then stormed out and, apparently, called Tim's parents, who then called Luke and Beth. \n\nNow everyone is furious at me because I hadn't given a heads-up that I was starting to date again. My thought was - I don't need to give the play-by-play on my dating life, especially when it might be hurtful - I figured that if I actually started seeing someone regularly, I would let folks know, but until then there didn't seem to be anything to tell. Especially as Tim's parents live across the country and Luke and Beth are away at college. However, everyone involved (Tim's cousin, his parents, my kids, and assorted other relatives and friends who now know) say I am a huge AH for not telling people in advance that I was moving on.\n\nSo, AITA here? (Not asking if IATA for dating at all; I've been a widow for five years! Just if I am the AH for letting people find out without a proactive heads-up.)", "created_utc": 1679002281, "permalink": "/r/AmItheAsshole/comments/11t6xfb/aita_for_not_giving_my_family_a_headsup_that_im/", "score": 1996, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took that should be judged is that I didn't give anyone in my family a proactive heads-up that I have started to date again, after being widowed 5 years ago. This might make the AH because people found out by seeing me on a date, which caused a lot of shock and hurt as they didn't realize I was starting to move on, and my telling them proactively might have let them adjust to the news and saved some hurt.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You are a grown woman with a right to a life and privacy. You owe no one the details of your life, not even your adult kids. Your cousin is a huge AH for the scene she made. Am sure everyone still feels the loss of your husband but that doesn’t mean they get to dictate how you live your life now. Well done for being brave. Keep going", "NTA. Are you living in a country besides America? What’s with the whole “betraying your husband” crap? Is she delusional? You have more than every right to date and it’s nobody’s freaking business!!! Three years? You’re a saint!", "NTA a 45 year old woman doesn't need anyone's permission to do anything with her life. Your husband died, you are not betraying him. The only people who have a right to know anything are your children.", "NTA. Their misguided ownership over your private life is mistaken. The only people you have any obligation to communicate anything with is your children--and even that is a courtesy, not to ask permission.", "NTA.\n\nIt has been FIVE YEARS. Your loss was terrible- I’m so sorry for what you’ve all been through - but you deserve to have companionship and romance back in your life. You put your kids first and made sure they were okay. It is absolutely okay for you to focus on your needs now and it’s more than okay for you to keep your private life private while you explore that area of it. \n\nYour late husband’s family had no business expecting to be told about your dating and they had no right to tell your children.", ">I hadn't given a heads-up that I was starting to date again  \n\nNTA  \n1. You are 45  \n2. You need NO ONES permission to do anything  \n3. Its been FIVE YEARS   \n4. No one gets a say in this other than you  \n5. Good luck with everything", ">everyone involved (Tim's cousin, his parents, my kids, and assorted other relatives and friends who now know) say I am a huge AH for not telling people in advance that I was moving on.\n\n\"Everyone involved\"????\n\nYOU and the person(s) you're dating are the only people \"involved\" in your dating life, and these people sound fucking insane. Like, truly, batshit insane. If anyone said this to me I would never speak to them again and let them no in no uncertain terms how fucking insane they were. NTA", "NTA - the cousin is though, for how she’s decided to portray the situation. \n\nI would probably have told the kids that I was starting to date just so they were aware, and had the conversation with them that no one would ever replace their dad, etc. \n\nBut it’s no one else’s business. Marriage is “til death do us part” is it not?", "NTA.\n\nIt's been five years. It's a reasonable inference that you would expand your social circle once the kids are off at college. If they stopped to think about how your life might play out, they would see that for themselves, no heads up required.\n\nIt sounds a bit like you starting to date has burst a bubble for his family, as if they haven't quite accepted that your husband died long ago. The line about you betraying your husband is a give-away, it's so out of line with reality.", "NTA. If it was my mom, I would be more upset that she didn't tell me she was out alone with strangers, than the fact that she's *dating*. But the rest of the family doesn't need the details. \n\nYou mourned your husband, I'm sure, before he ever passed away. You lost him to addiction first. You're fully entitled to figuring out how to live your life with an empty nest now. \n\nIf you were out with friends I feel like the extended family would have the same reaction, that you shouldn't have a night out while your husband is dead.", "NTA! You don't have to give anyone an accounting of every aspect of your life. These are casual dates to see if you meet someone interesting. As such, it isn't really anyone's business!\n\nI suppose that you could have mentioned in passing that you might have thought about dating again, to let them get used to the idea, but I don't think you're an AH for not doing that. It's your life, and you have a right to live it without other people's \"blessing\".\n\nThat cousin is an AH though...", "NTA, it's been 5 years. That's a very reasonable amount of time and I find it appalling that you are getting any negative comment at all.", "NTA\n\nYou don’t owe anyone any explanation or heads up. This is your life, and you are free to live it the way you choose. \n\nI will admit that I personally would have given the kids a heads up, but that’s me, and it definitely wasn’t a requirement. They’re adults. And while they still might have mixed emotions about the idea of you dating again, you don’t need their permission. \n\nThe cousin is a giant AH for causing a scene, and spewing asinine allegations. And Tim’s parents don’t have any sort of say on this matter. \n\nI obviously didn’t know Tim, but if he really loved you, he would want your life to move on, and for you to possibly find love again. He wouldn’t want you stuck in your grief and alone. \n\nBest wishes and virtual hugs to you!", "NTA, but I'd probably have given my kids a headsup that I was dating. But you owe your in-laws nothing, especially after 5 years.", "How dare you not join a monastery, become a buddhist monk, or go live on a mountain top to avoid all human contact? Obviously, NTA.", "NTA- this cousin of Tim's is sticking their nose where it doesn't belong... Especially if this is a casual date (not like a serious/regular relationship)", "  \nNTA. You are dating, not planning a wedding. You are an adult and can have  \nmale and female friends. You can date men to see who gives you the spark. Everyone  \nelse has moved forward, they should allow you to do so too, especially as you  \nfeel comfortable to do so. You do not need to tell them, until you find the one  \nwith the spark. I think they might have tried to guilt you into not dating if  \nyou would have told them ahead of time. Only you know when you are ready and  \ndon’t need pressure otherwise.", "Nta - Tim's family will NEVER be happy with you moving on. The only people you should care about are your kids and you should have a rational talk about why they don't want you to be happy.", "NTA, Tim's cousin needs to mind their own business and you did nothing wrong.", "NTA\n\nIf it was really soon, I'd suggest that a heads-up is a fairly reasonable courtesy (though not an obligation).\n\nAnd I'm sure the cousin was just ... in a bit of shock.\n\nBut it's been 5 years. You don't owe any of his family any information about *your* life. And that level of verbal attack and accusation was unacceptable.\n\nI *would* have suggested telling your children you're dating again, so they won't be blindsided if something gets serious. But, again, it's been years, and everyone involved is an adult and there's no obligation here.\n\nVery solidly NTA", "NTA 100%, what do they want you to do? You’ve waited 5 years. They are being very unreasonable", "Seriously?\n\nSeriously NTA.\n\nWho in the fuck would think that they can gatekeep your private life like that? You have done everything right, nothing wrong, and don't owe an explanation to anyone. Congratulations on getting back out there!", "NTA.  Be careful what way you handle this, I wouldn't be one bit apologetic, simply shut down Tim's family \"I didn't tell you because it is absolutely none of your business, cousin has an absolute nerve making a scene and involving herself in my business and this is absolutely not up for discussion\".  To be honest I would say the same to the kids only nicer, they are adults, but are being likely riled up my the family.  Say what you said here about not telling them until there was something to tell, same as you would expect from them.", "NTA!", "NTA. Your life your choice. Over 21 don't need permission.", "NTA, you're a grown up and everybody should support your decision; they may be ok or not with it but at the end it's your life, you're not at fault with your children, you're not being unfaithful, you lived your grief and is ok for you to keep on living.", "NTA.  It's called your *private* life for a reason.   You didn't owe it to your family to say you were dating.  If you got serious with somebody, yes.  But having dinner out with somebody?  Is nobody's business but your own.\n\nYou aren't even moving on yet.  You're exploring the possibility of moving on.\n\nAsk your kids if they tell you about every date they go on, and ask why that should apply to you.", "nta it is none of their business", "NTA.  I would have given the kids a heads up, just because I wouldn't want them to have to get used to the idea of dating and a potentially serious partner at the same time, but you aren't TA for coming to a different conclusion.  I also think your kids are NTA for having feelings.  Tim's family is definitely TA.  You aren't betraying anyone, and confronting you in public is terrible.", "NTA\n\nyou're a grown woman whose husband passed away five years ago; you're more than entitled to see other people without alerting your entire family. why do they care so much? i genuinely can't wrap my head around that. why do they feel like they need to know that you're casually dating? how does that impact them? (there's no good answer here that justifies the backlash they're giving you)", "NTA\n\nYou owe none of these people, aside from your kids, an explanation of if or when you're dating. Even then, with the kids, it would have been helpful so they wouldn't have been blindsided by this lunatic cousin, but how could you know that would happen? Besides, you know your kids best, you'd be the best judge of when and what to tell them.\n\nYour marriage sounds like it was up and down, that your husband had hard times you tried to deal with, but overall I get the sense that he tried, and you all loved each other. You can't ask for more than that, I don't think. \n\nI hope you find happiness, whether that's another relationship or not. But you aren't betraying anyone.", "Soooooooo NTA. You could have given them a heads up sure, but you are not obligated to coddle anyone’s feelings.", "NTA - You’re a grown ass adult and have raised your kids to adulthood. You don’t owe anyone anything.", "OP may very well be the only NTA in this story.", "NTA.\n\n5 years you have grieved and put your kids first. Everybody is settled into their own lives. \n\nYou deserve all the good things for being so respectful then and continuing to be so.  You have nothing to feel bad about and I hope you enjoy companionship and find love again.\n\nI do think you should have a frank conversation with your kids though. Not to apologise as you've done nothing wrong, but to let it be known that this wasn't an attempt to hurt them in any way, but you can do what you like and you would tell them if there was anything serious. I think it's important to try and keep a good relationship with them and they might be hurting a little because it was unexpected.", "Not at all! Most people in your position would do exactly the same thing and keep it quiet until you find someone you're interested in. At this stage, you're just starting to socialise. After all you've been through and five years of focusing on your children, you deserve some time to rediscover yourself. NTA.", "NTA.  You are under no obligation to inform *anyone* about your personal life (not even your college-age kids).  You seem to be reasonable & thoughtful about the process; I hope your kids can see your point of view, especially after all the years you spent dealing with your late husband's issues and then caring for them as a single parent after he died.  I hope you find someone special.", "NTA they can all mind their business. You have grieved raised young adults who have their own lives now it's time for you to move forward with your life. You owe no one anything.", "NTA Its your life , and yours alone. its non of their business what or who you date.  \neven if you planned to date the whole college football team  \nIts your life and none of their business\n\non a personal note I think its great you getting out there at 45 , a lot of women would stay at home with their cat", "NTA\n\nIt’s honestly nobody’s business at this point. Perhaps a heads up to your kids but you know your kids best. But like you said, you were just going on a few first dates. You did absolutely nothing wrong. You put your kids first and got them through a rough time in their lives. I assume the kids are dating and seeing people. Why can’t you?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (45F) husband (\"Tim\") and I married right out of college. We had a very happy first decade of marriage, including having two children (\"Luke\" and \"Beth\"), who are now 21M and 19F. However, when in our 30s, Tim developed severe depression and substance use disorder (alcohol and painkillers). His depression was treatment-resistant and that made him unable to fight his other addictions. Despite numerous inpatient psychiatric stays, and several stints in rehab, he passed away of an overdose 5 years ago, at age 40. We don't know, and will likely never know, if the overdose was accidental or intentional.\n\nAfter Tim's passing, I was 100% focused on helping our children be as okay as possible. Despite his demons, he was a great dad when he was able to be, and losing him was completely devastating for all of us. Lots of individual and family therapy helped, and Luke was able to graduate from high school with high honors and get a college scholarship (out of state). Beth graduated last year with similar honors and is also now in college, several states away. \n\nWith both Luke and Beth now adults and away from home, I can finally focus more on myself. It took me a long time (at least 3 years) after Tim's passing before I could even think about wanting to date again. Then for the next year I was focused on getting Beth through her last year of high school and off to college. However, once she went off to school in the fall I started to dip my toe into dating apps. It's been slow going; I've probably had a dozen or so dates total, mostly first dates that didn't go anywhere. There was one guy I went out with 4 times, but we decided not to continue as we weren't feeling a more-than-friendship spark. \n\nSo, here's where the problem is - last week, a cousin of Tim's saw me out on a date - she was in town for business and just happened to be at the same restaurant. She made a bit of a scene (coming up to the table and demanding to know what I was doing with betraying my husband - which really confused the gentleman I was out with). She then stormed out and, apparently, called Tim's parents, who then called Luke and Beth. \n\nNow everyone is furious at me because I hadn't given a heads-up that I was starting to date again. My thought was - I don't need to give the play-by-play on my dating life, especially when it might be hurtful - I figured that if I actually started seeing someone regularly, I would let folks know, but until then there didn't seem to be anything to tell. Especially as Tim's parents live across the country and Luke and Beth are away at college. However, everyone involved (Tim's cousin, his parents, my kids, and assorted other relatives and friends who now know) say I am a huge AH for not telling people in advance that I was moving on.\n\nSo, AITA here? (Not asking if IATA for dating at all; I've been a widow for five years! Just if I am the AH for letting people find out without a proactive heads-up.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nAbsolutely no one gets to tell you how to grieve or when you should be ready to move on. I understand from your comments that things are complicated because they want you to be responsible for his depression and addiction. That's rough. And that's their issue to deal with in therapy. \n\nNo matter what you and your kids are the center of the loss here. You have done absolutely nothing wrong. Although it would have been better to warn the kiddos. No matter the circumstances around his death your husband is gone. There is no way for you to betray him by dating. People with your best interests at heart would ask about how your feeling not tell you how to feel. You and your children are the center of this loss ring. No one else should be expecting support and coddling from you.", "NTA, at all. They have no right to your private information like that. It’s time to come down hard on your boundaries, because I don’t doubt they will try and have a say in who you date, when you can become engaged, etc.", "NTA. If mostly 1st dates you're technically meeting, not dating. I would have a conversation with the kids to introduce the idea before you have to introduce a person. Wouldn't really care about how cousins or anyone else takes it.", "NTA. Their demands are completely inappropriate! Your reasoning is very clear and sane.", "Nta!!! \n\nYou decided to tell them if it became serious! That's all anyone who does not live with you is entitled to.", "Edited:\n\nNTA.  Based on further review, the vote is changed.", "100% NTA", "NTA It is ur choice whether or not u tell people about ur dating life. All the people who feel entitled to that information need to be checked. Tell them that it's ultimately none of their business, and I don't mean that in an ugly way. But u do need to set a boundary here bc they will use this as an opportunity to walk all over u later.", "!updateme", "It might have helped some people if you gave them a heads up but you don't owe anyone an apology. \n\nBe free and may you find love again soon!\n\nNTA", "NTA- it’s not like it’s been a few months. It’s been 5 years! You don’t owe anyone an explanation for wanting to find someone to love again", "NTA. You are not your husband's family property. They don't get a say in anything you do. They may blame you (wtongly) for what happened to their loved one but that doesn't mean they get to make you wear sackcloth forever. You have a right to happiness.\n\nI might have warned your children as most impacted emotionally but also get why you didn't as early days. The cousin seriously overstepped.", "NTA. They should be happy for you that you are living your life.\nWho wants a family member live in mourning for the rest of their life.\nAlso it doesn't affect them at all.\n\nI lost my mum in 2020 and my dad started dating 5 months after. I thought it was fast but I saw how happy he was and it made me happy knowing that he isn't alone.", "NTA. I can't even imagine having the audacity to approach my cousin's widow to confront her about what she does with her private life FIVE YEARS after her husband died. Mind your own business, wtf?", ">coming up to the table and demanding to know what I was doing with betraying my husband\n\nWhat the fuck.\n\nEasy NTA and frankly some of the family sound like nutcases.", "NTA\n\n&#x200B;\n\n\" She made a bit of a scene (coming up to the table and demanding to know what I was doing with betraying my husband \" ... NEXT TIME, just call the police.\n\n&#x200B;\n\nAnd: You are an adult, and don't NEED permission. Ignore this.", "NTA, I think your plan of telling people if anything got serious makes perfect sense! Imagine the shit talking his family would do after your 12th different update on dates. You gotta \"move on\" eventually if that's what you want to do! I definitely see why they could get upset, because that's just gonna bring back memories and make people sad, but to actually get upset AT you is ridiculous.", "Definitely NTA", "You are NTA for any part of this, but that cousin is a huge asshole. \n\nYou don’t owe them a heads up for starting to date.", "NTA\n\nI’m sorry all those folks in your orbit aren’t on your side in this. You’re practicing a social activity after a lot of heartache, stress, loss, and fulfilling phase one as a parent. You deserve to go out with people, get to know them, and have fun. You aren’t secretly marrying someone - you’re going on a date. It’s an experiment in friendship, and intimacy, and mostly just getting the opportunity to get out and get to know somebody again.\n\nEveryone else needs to work out their feelings. You have every right to have a fulfilling rest of your life in all the ways you see fit. And you don’t have to seek permission to do so.", "NTA", "NTA\n\nYou lost the love of your life and the father of your children, you chose to put 5 years into making sure they were okay and out in the world before even considering dating. A heads-up would have been nice, but in reality, it's not necessary. You'd probably just worry them because no one will ever be good enough for their mom. \n\nYou are owed privacy and to figure out how to proceed with your life as an empty nester. The kids aren't little and it's been enough time here you need to have your own life. As for the cousins and in-laws the need to respect you and your boundaries. Most men start dating within months of losing their wives you waited years. No need to feel guilty.\n\nGood luck dating I hope you find someone who gets along with your kids, loves, cherishes, respects and blanks you well.", "NTA. Is Tim's cousin four years old? Does she like starting drama?", "NTA\n\nYou don’t own anyone explanations about sharing a meal with somebody.\n\nDid your kids even asked you if you are thinking about dating again?", "NTA. It's been five years. You aren't betraying anyone.", "NTA.", "NTA. Maybe it would of been good to tell your kids but if all of these dates were only 1st ones (besides the 1), I could see your reasoning of waiting to say something when there was someone more serious. As for your in-laws/other family, you don't owe them anything. Sounds to me your IL were looking at something to be mad at again due to your comment of them blaming you for Tim's death. \n\nWish you luck in dating and being able to continue to heal for yourself!", "NTA. I’ve been adjacently in your shoes. My husband passed away four years ago. It took a good three years to climb out of both the grief and just adjusting to life as someone ‘new’.  You never really move on, you just keep moving. You don’t owe anyone any sort of explanation, whatsoever, as to whom you’re dating, seeing, one night standing, just grabbing coffee with…nope. That’s your business, and yours alone. The only asshole here is the cousin, who wanted to stir up some shit. Your husband is dead. He’s never coming back. You remaining in a constant state of mourning isn’t going to change that.  I can understand, to a small degree, your children being upset. That’s on them to figure it out. They’re always going to be your children, and their father is always going to be their father. If you run off to Vegas tomorrow, and get married, it still won’t change who their parents are. You’re not Victoria (and even she, by all accounts, found love after Albert).  The ONLY people who deserve to hear something from you, right now, are Beth and Luke. And the only thing they need to understand is that, while you dearly loved their father, you also love yourself, and you owe it to yourself to enjoy life. Life is for the living. You aren’t replacing your husband, and you’re not ‘moving on.’  The only thing that you’re doing is living, to the best of your abilities. Love, should you find it again, isn’t a zero sum game. You can both love (and forever grieve) who you’ve lost, as well as love someone else. If you ever need and/or want to talk, don’t hesitate to send me a message.", "NTA. OMG you’ve done everything just fine. The last thing you needed as you ventured out there again was the opinion of a bunch of people, particularly ones who clearly don’t have their own emotions remotely in order. You’ve done absolutely fine, I’m really sorry for your troubles", "NTA", "YTA for not at least letting your kids know.  It is no one else's business, but letting them know would have made this a non-issue.  It also gives them lots of time to slowly adjust to the idea instead of you suddenly telling them you are dating and want them to meet someone.  The cousin is a huge A.  I would text her and his parents and tell her that her behavior was disgusting, that your husband would have been ashamed of her and his parents, and that both she and his parents owe your kids and you an apology.  Then block them all.  I would apologize to your kids as they did deserve to hear it from you, not someone else.", "I'm in America!\n\nTim's family somewhat blames me for his death. I think they know, on some level, that his demons were just too strong and that I did everything I could to get help for him, but they are still reeling from the loss and need someone to blame. I do get that and don't think there is anything I can do to change that sentiment. So because they blame me, my dating again adds insult to injury. I just wish they wouldn't have involved the kids in their badmouthing of me.", "Not the OP, but I think she is in the USA, given the word-choices: *college* being the strongest example.", "And its been 5 yrs by now since her husbands death!", "I would 100% tell the kids if I actually had a new BF/steady companion, but I figured that the play-by-play on my dating life would be weird and way TMI.", "It sounds like his family are just looking for any excuse to make trouble for her. There was no reason to get mad at her dating *five years* after he died and especially no reason to cause drama with her kids. I’m really rather disgusted with them for dragging her through that.", "I would absolutely have told the kids if they were living at home (or even in the same city), but I'm not sure what they would do at a distance of 1000+ miles even if I did encounter trouble on a date. I do always tell at least one local friend when I'm out with someone new, for safety reasons.\n\nAnd yes, I think that Tim's cousin would have reacted badly even if I were just out with friends or at a business event, because how dare I be out and about having any fun when I'm a widow...", "In retrospect, maybe I should have told the kids - but when I started with the apps I didn't even know if I would meet anyone, or whether I'd go on one date, say, \"NOPE\" and decide to be single. I figured that with being away at college they would have more pressing matters to worry about than my day-to-day social life.", "I definitely would have if they were at home, but didn't see the point of telling them about casual dates when they were away at college. Otherwise I assumed I should share if I actually got into a relationship and was seeing someone regularly (more than a few times anyway). (Just like I don't expect they are going to tell me every time they go on a date, but hope they would tell me if they had a steady partner.)", "I definitely do not think my kids are TA. I understand that a parent dating again after one parent's death is going to be a difficult adjustment, whether it's after 5 months, 5 years or 20 years. They are just upset that I didn't tell them (but not upset that I'm dating in general) and now that the cat's out of the bag, I will be able to share more with them to the extent they want to hear about it.", "Thanks! Yes, it was a happy and loving marriage overall. Tim just got sick with something that turned out to be terminal. We always want to believe that depression and substance abuse are treatable, but in rare cases the battle can just be lost despite exploring all available treatment options. He did try to fight and wanted to be here for the kids, it just got too painful. I forgive him for needing to leave us and work to remember all the good times.", "Yes, I'm already having discussions with the kids. They were initially very upset with me but mostly because it was a rude shock to learn that I'm actually considering having a romantic life after their father. They have both assured me since then that they aren't angry and that I deserve to be happy, that it's just a lot to get used to. They are by far the most reasonable people in this equation, even though they are the most affected if I get into another relationship.", "It's actually a pretty good age to date - I mean, I haven't found anyone I want to be in a committed relationship with, but there are quite a few men in my age range who are divorced or even young widowers, folks who have already had the children they want to have and are looking for a mid-life companion. I'm having a lot of fun getting out, even the one-time dates are generally nice evenings out even if we agree not to continue.", "Really? I'm not there yet but mid 40s hardly seems like an age to give up socializing.", "Yes, that's exactly right. Most of the first dates have just involved a conversation over coffee, a glass of wine, or dinner, to see if we actually want to try dating in a more romantic way. And most of the time, the answer has been, on both sides, \"had a nice time tonight, but not the right match for this time.\" \n\nProbably TMI but I haven't even come close to being intimate with anyone yet...had a few good night handshakes, hugs, and a couple closed-mouth brief kisses but that's all.", "I probably would have given more of a heads-up if we were close. But this particular cousin I hadn't seen or spoken with since Tim's funeral; she didn't make an effort to stay in touch with me. And as for Tim's parents, I had tried to reach out to them regularly after his passing to stay in touch, but they were only occasionally responsive. About a year after his passing they said it was too painful to continue a close relationship with me and that they wanted to keep contact to holiday greetings, barring dire emergencies (they do speak to the kids regularly, though).\n\nAnd I'll also say that none of these people (meaning the adults in Tim's family) reached out to see how they could help/support us while he was battling depression and addiction. His parents were regularly upset with me for not doing enough to \"fix\" him (in their view) and his other family (including the cousin mentioned above) decided they needed to \"detach.\" I do appreciate that is a valid choice, however, I think it minimizes what say they should have in how I currently live my life or communicate about it.", "I’ve lost family too. They don’t need to be told OP is dating again; that’s literally none of their concern. It was disrespectful in the extreme for that cousin to interrupt OP’s date. Five years is more than enough time for them to have come to terms with that grief.", "Sure, that's fair that it probably would have been best to tell the kids I was going to be going on some dates (and that I would let them know if anything came of it). It's just that I didn't start going on dates until they were both out of the house at college, and...it wasn't really the kind of thing I wanted to tell them over text or a phone call. When I got on the apps I wasn't even sure anyone would be interested in a 45-year-old widow.\n\nI will apologize to the kids for not letting them hear from me directly that I've started to get out and meet new people.", "In my case, the family that blamed me was fairly directly responsible for several traumas that resulted in the treatment resistant mental health issues. They likely just don't want to admit it. The only people you may need to talk things through with are your children and your therapist.", "You need to date someone else, and his family is creepy. I’d stay away.", "Wtg OP. Have fun. And go LC with that cousin (And anyone else that gets too judgy)", "As the poster above said, you are a saint. They should be grateful for you  doing everything you could, being the responsible parent, being the rock.", "The whole “betraying your husband” from a freaking cousin of his, in public, just seems like something off a movie like “my big fat Greek wedding” or something. Like… the absolute audacity.", "Your logic is sound and reasonable. Even if it wasn't, it's still your business and not theirs.", "Honestly I think you handled this the best way you could have. There’s no guidebook that tells you how long you have to wait to date after your spouse passed away, nor are there rules that you’re obligated to follow regarding who needs to know and when. Had you been able to tell them I think your kids would have handled this better even if you were saying hey I went on some first dates that weren’t worth anything. Had I been in your shoes I would have wanted to tell them in person and not over the phone. Do whatever you need to do for yourself, because there isn’t a set right way to proceed.", "You’re not wrong about the assumption that they’re busy in college and therefore don’t need to worry about your social life. And again, I never said I thought you should have told them, just that I personally would have. These are your kids, you know them better than anyone (definitely better than me lol). You could always tell them now what you just told me. Be open and honest with them. They might feel weird about this right now (again, pretty mixed emotions, I’m sure), but I bet they ultimately just want you to be happy…regardless of what that looks like.", "I have been in your kids position and honestly, I think they probably would have reacted badly even with the heads up. It is a shock to the system (omg, my mom isn't just my mom) and it hurts (dad is never coming back). I was a total brat about my mom dating again at first.", "For what it's worth I think this is a perfectly reasonable standard! This cousin is bang out of order, and I don't think you need to assume that you must have done SOMETHING wrong and maybe it's not informing your kids that you're going out on a few dates.\n\nReasonable people could choose either path: informing the kids/not informing. That's totally separate from this cousin, who is a loon.", "I would explain it to the kids that way. \n\nYou were not hiding anything from them because you are casually dating. Just like you expect that they are not going to discuss every date they have with you. However if you found someone that you intended to date Long tern of course you would introduce them and discuss it with them. Just like they would do for you. \n\nSometimes it's hard to remember our parents are people too.", "I think it's a bit different when it's your parents, and one has passed away. I probably would have given a general notice that I was dating, not necessarily give them specifics.  Or maybe they already knew that you were dipping your toe again? Not clear.", "I know I'm just some random person on the internet but you sound like a level-headed person and you are NTA at all.", "NTA that cousin is a real jerk. You are totally within your rights to privately give her a piece of your mind", "That’s so nice you’re having fun! As a young woman, men on dating apps (even the ones that are supposed to be for relationships) only ever want to hook up and not even take me out on a date, it’s terrible!", "Holy hell OP...perhaps that should have been in the original post as it really does change things significantly. Lol.", "Please don't apologize to anyone about this. If you feel one is absolutely necessary, please use the weasel-form of an apology - \"I'm sorry you're upset\" - in other words, not an apology for your action, but an expression of your regret at their reaction.\n\nIt's intrusive and gross what they are doing. The only appropriate reaction is \"oh, great, I hope it works out for you.\"", "[deleted]", "Given that Tim's parents (and family in general) have treated me coldly and distantly - not just since his passing, but since he got sick with depression and addiction years before - it definitely wouldn't surprise me if there were some past trauma he just hadn't relayed.\n\nWe all did do lots of therapy, but perhaps another round would be in order now that I'm moving on \"intensively grieving widow\" to \"middle-aged, available single mom.\"", "Yes, I wanted to tell them in person instead of over the phone. I had been thinking about telling them over the winter holidays, but they both decided to spend their break with Tim's parents (both of their colleges are much closer to Tim's parents) and with friends instead of coming the longer distance to see me. This was 100% fine as they hadn't been able to see other family much for the prior couple years because of the pandemic. So I figured I had more time to see if any of my dating attempts amounted to anything.", "Yeah, they are good kids and want me to be happy. I think they are just upset that they found out from others, who told them in a very accusatory and contentious way.", "I had the best of intentions here, in that I thought that my dipping my toe into dating wouldn't hurt them because they wouldn't know about it unless there was something to tell. I didn't want them upset and worried while away at college. I thought of it the same as any other (non-romantic) social activity I have tried out since being widowed, that they're busy with their own lives and don't need the minute to minute detail on mine.", "I think I was following the rule that I've heard for divorced parents - keep your dating life away from your kids, unless it's serious enough that a new partner is going to become a real part of your day-to-day life. Maybe it's different when a parent has passed away...", "Thanks! I will definitely assure them of that. I was not trying to hide anything as much as figure out if there would be anything worth sharing. And of course I would tell them if I started a real relationship.", "No, they didn't know - I hadn't discussed it with them. By the time I went on my first post-widowhood date, both of the kids were away at college. I didn't want them to be worried or upset over nothing (and again, I still haven't met anyone I want to continue dating).", "I was going to originally but ran up against the character limit! But anyway - yes - I do understand that Tim's parents and family are in severe pain from losing him and that the loss of a child or other close relative isn't really something you ever get past. But they have treated me pretty coldly/distantly, and since they told me they didn't want to hear from me except for an emergency - why on earth would I tell them about my casual dating life?", "It is none of the cousin's business.", "I mean, the cousin's reaction doesn't exactly scream \"brought up with healthy emotional coping strategies\" to me. I wonder if that's a common family trait. \n\nAlso, my suggestion for therapy was because you seem to be questioning your decisions, and you're way more likely to get good advice from your therapist than AITA. \n\nEither way, NTA.", "You didn't do anything wrong. I was 22 and living away from home and still didn't take my mom dating well. But it was all about me and not her.", "I am divorced but I can say that I believe you are right no reason to add stress to your kids and probably a lot of emotions they don’t need to worry about while in college unless it is something that could be serious (partner wise).", "I think this is the right way to go about it.\n\nMy mom started dating a few years after my dad died and she gave my sister and I the disgusting play by play (sleepover details and all) about every guy she dated. A few of them tried to be our “new daddy” and I had one come by my work at one point to “make sure I was okay”.\n\nKids do not need to know every single detail of your dating life. When you find someone you really click with, that’s when you should tell them. As for your husbands parents, what jerks. They had no business getting upset or even getting your kids involved. I’m really sorry they’re causing so much drama for you.", "Your reasoning is exactly right, 2 of my closest friends are widowers before 30, they did exactly what you are doing, the only exception is their respective families respected them enough to know it's not really their business and let them know that as well. NTA.", "Exactly. Tell them that. \n\nIt's hard to see your parent as a sexual being. Especially dating. But you are entitled to see to your own needs.", "I guess what matters is their opinion on it. Did they assume you would start dating at some point-or did they think you would remain single?  I would have been upset to find out, from someone else, that my mother was dating after my father died. Also, it's not something I'd be expecting, given what I know of my mother. I wouldn't have been upset about the dating, mind you, just being in the dark about an important part of her life(looking for love again).", "You are definitely nta, and it is your life to choose how much to share with anyone, honestly. That said, I would have recommended sharing *that* you were casually dating, not the specifics, early on. Why? Because they're gonna have feelings about it at some point and it's probably better to give them time to adjust to those feelings before you *do* meet The One™, so that they don't associate those negative feelings with the person you want them to like and invite into their lives. The divorce rule is really about minor children, yours are adults.", "That's totally fair. I shall change my vote to NTA. Thank you for clarifying.", "Yes, I could definitely use a therapy tune-up. My prior round of therapy was aimed at dealing with grief and loss and being supportive for the kids, and at that time I wasn't even close to contemplating dating again (or dealing with people who might judge me for it).", "Their opinion does not really matter. They are adults now and away at college. She is an adult her husband has been dead FIVE years. How she handles her dating life and when she chooses to divulge thay information is solely her business and no one has any right, not even her kids, to be mad at her about it.", "NTA It sounds like you are the only one with healthy mindset regarding the loss of your husband. And the cousin is a HUGE AH. I can’t even fathom how any of them think it’s their business. What exactly is their expectation of you? You are a grown woman who stuck it out through a very difficult situation and obviously loved your husband unconditionally. I think you need to set some boundaries with all involved and remind them that you are a grown woman who is still young and deserves joy, love, compassion and companionship. None of which any of them seem to be providing. You have every right to go out, date and enjoy yourself without justifying any of it to anyone including you adult children.", "NTA. It is absolutely no one else’s business if you’re dating or not. I would let them know real quick it doesn’t concern them and you won’t be listening to their opinion on anything.", "Maaaaaan fuck them people…you don’t owe them shit. YOU live YOUR life and do what makes YOU happy.\n\nNTA\n\nAlso your kids are ASSHOLES.", "NTA- you are an adult, your children are adults. You don’t need to give anyone a heads up.", "NTA. You were casually dating. No need to inform anyone—especially cousins!", "NTA. You dont owe them any explanations, they need to mind their own business, and it's certainly not a \"betrayal.\" If anything, im sure your late husband would want you to be happy", "NTA - that’s insane behavior on their parts.", "NTA! It’s none of their business.", "Your children are grown and your husband has been gone for 5 years. Put everyone in their place ASAP this is crazy. NTA.", "Nta, did they all expect you died with him? If it was 5 months and you were dating, maybe warn the kids. But after 5 years, how could anyone think you weren’t? Seems like a ridiculous expectation after FIVE YEARS you would have to inform anyone.", "Absolutely NTA. It's not really Tim's family's business either! Your kids are grown and out of the house and you deserve happiness.", "NTA\n\nIt’s strange they think they need that, obviously you’d tell them if you met someone worth mentioning.\n\nIf I were any of them my first response would’ve been ‘oh I’m so happy for you! Wish I’d known, now spill the tea.’ \n\nIf they want to be involved in your life, they’ve gone about it the wrong way imho.", "NTA- It's your private life, you shouldn't be obligated to tell them when you're dating or not.", "It's your life to live...not there's.  You've passed your grieving stage and have found the wherewithal to 'move on' with your life.  You owe absolutely no explanation to no one.", "NTA. I think the “tell people when there’s something to tell” approach is reasonable. The only people I can maybe understand the frustration of is your children, but at the end of the day, “hey, I’ve started seeing [x]” is a much more concrete and easy-to-know-when-to-mention conversation than “hey, I’m casually dating.” It would maybe have more necessary if your kids were still living with you, but as it is, I don’t think you did anything wrong.", "I'm sorry, what? It's ONLY been 5 years! Your whole wardrobe should be all black for AT LEAST another 5!\n\nNTA", "NTA I’ve heard the general consensus is after 1 year of being widows it’s safe to date again.", "NTA he has been gone 5 years. Do they think you need to join a nunnery?", "NTA. It is none of their business. You have a right to be happy and his family should have no right to know what you are doing. You are an adult woman who made sure that her family was settled before diving into the dating pool. I think it may be time for you cut ties with them. It sounds like they all haven't gotten over Tim's death.", "NTA. Man, OP, I’m sorry. It sounds like you loved your husband very much despite his problems and that’s a tragic thing to have to deal with. I’ve had a few alcoholics in my family, some who didn’t make it and some who came out the other side and some who continue to flail and drag the people around them down with them, and it’s incredibly painful for the people that have to deal with that day after day. More power to you for seeming to have such a level head on your shoulders after all of that.\n\nAll of which being said, you don’t owe your in laws or even your kids any explanation whatsoever. You’re dipping your toes in the water *five years* after the passing of the love of your life and the father of your children. You took time to grieve, heal, work on yourself and move on, and you can’t be expected to be a widow for the rest of your life. It doesn’t matter if you’re 45 or 65; if anything, you’d be betraying yourself by denying a possible future with a new romantic connection. \n\nGood luck to you and I hope you don’t let your in-laws hold you back. It’s a tragic loss, but no one has endured more pain in this situation than you, and you have the right to be happy. You don’t need anyone’s permission to be happy.", "NTA.  \nThis wasn't you bringing a date to a family event, this was just a dinner date, after five years. I can see why at some point you would tell your children rather than them find out, but you were not at that point in any way shape or form.", "NTA you don’t owe them anything in that regard. But how did she know it was a date?? Could you have just been having a meeting or with a friend? Seems outrageous that she would make an assumption and accost you that way.", "NTA\n\nI was widowed at 41 with two kids, 18 and 15 at the time, after almost 15 years together (my kids were not his biologically). The only reason I mentioned that I was dating to my late husband's brother was because I knew it was going somewhere. A slightly different situation with the kids though. My ex-husband and I got back together. But why would anyone think that you would remain single? (Unless that is what you want). I think it's easy for some people that have not been widowed to say \"Oh, I'll never date. He's my one and only love\". You can still love your partner that passed away and love someone else. \n\nRegarding the kids, make sure they know it has been casual and if anything had begun to develop, you would have told them.", "Tom’s cousin’s behavior was outrageous. “Everyone” who is furious with you for living your life can take a flying leap. NTA.", "Not that it matters, because you’re NTA, but how did she know you were on a date?? You could have been having dinner with a friend, or a business dinner. Kind of seems like she was jumping to conclusions.", "NTA.  You are right, you don’t owe them anything.  By her reaction you’d think your late husband died recently.  There are certainly plenty of those stories out there but it has been years.  You are entitled to privacy and letting people know on your own terms.  Personally, I’ve never really announced I’m dating unless it’s serious.  It seems kind of weird to inform everyone of a few casual dates.  You have dedicated your life to your family and deserve something for yourself.", "NTA. You don't have to give anyone a heads up about going on a few dates. If it gets serious, you should let people who matter to you, like your kids, know. But you do not have to tell your in-laws about your dating life. \n\nYour vows were til death parts you. Death parted you. You don't owe his family celibacy for life.", "Jeezus!  You have a right to your own happiness!!  You've waited long enough, certainly!  5 years?!  I doubt your dead husband would want you suffering and alone the rest of your life-  if you want to date,  there's absolutely nothing wrong with it.   Your husband's family, if they truly love you, will understand.   NTA", "NTA and I’d urge you to reconsider how much your former in-laws will be involved in your life if they think that who you date is any of their goddamn business.", "That cousin is out of line and needs to be silenced", "NTA\n\nHubby is dead and has been for a respectable and respectful amount of time. \n\nYou did your motherly duty and saw to your kids' well-being.\n\nThere is NOTHING WRONG with dipping your toes into the dating pool again.\n\n\nIt is none of their business if or when you ever start dating again.\n\nIt would be....nice? ....polite?.....meh! of you to keep other grieving family members who loved and lost your husband informed about the progress of your emotional recovery so you can help and support one another on your individual journies but omfg are they blowing this out of all reasonable proportion!", "NTA. This is one of the craziest things I've seen on reddit. Why on earth would you make a big announcement that you are dating? Just block all these people from your life. And good riddance.", "I don't understand why this is anyone else's business.", "No NTA- It is nobody 's business.  The cousin is an asshole though.  You could have been having dinner with a friend for all she knew. She had the audacity to even go to you table and start a scene.  Toxic!! You have the right to date. You don't need anyone's permission.", "NTA\n\nFrom the title I thought you were going to say that you brought someone new to a family gathering without a heads up but — you were out one on one and a member of his family randomly happened to see you and then accused you of betraying your husband. Not even of betraying his memory (which would still have been bullshit) but literally talked about it like you were cheating on a living person. \n\nYour late husband’s family need some fucking boundaries.", "NTA, and it's insane that someone who has no stake in your life would confront you in public for dating after 5 years of being a window. Shut them all down real hard because it is none of their business.", "NTA.  It's been 5 years.  You've said in comments that Tim's family blamed you fir his addiction and depression and then his death.  They are 100% wrong and them grieving doesn't give them a right to be so horrid to you.  Block your former inlaws.  Video call your kids and gently explain that you loved their dad and will always remember him but that you are allowed to date again as it's been 5 years.", "How did the cousin know it was a date and you weren't there on business or he wasn't a cousin of yours or something like that?", "Him dying was not your fault in the slightest, don’t let people tell you otherwise", "NTA, but your deceased husband's cousin most certainly is.  It was not her place to go spreading your personal business all over the family with her big mouth.  You've waited more than a decent amount of time to start having a social life again, and there's no reason to tell the world about every one-off date you have because it's nobody's business but your own.  That cousin is so far out of line she's in a different country.", "NTA. You don’t owe anyone any explanation as to how you live your life.", "NTA.  Tim’s cousin is the AH.  If I remember my marriage vows the statement was “Until death do we part”. He died. You were parted.  Instead of worrying about whether or not you are “betraying” a dead man,  They should focus on how often he betrayed you and your children with his addictions.", "NTA its been five years ago they all need to get over themselves.", "NTA.\n\nAnd your husbands cousin owes you a big apology. As do your in laws, for calling your children. Both of those actions were way out of line.", "NTA, Jesus what part of the \"death do us part\" do they not get? Your still alive and are an adult. You do you and live your best life, you don't need their permission", "Absolutely NTA. You are a human. You’re not Tim’s wife anymore.", "Hi. Widow here. You are NOT the asshole - I’m so proud of and excited for you that you are dating. It’s a huge milestone in our grief and I am just genuinely thrilled for you. You don’t owe a single person an explanation for this choice. \n\nAnd to state the obvious you are not betraying your late husband. You fulfilled your vows to a tee - death did you part.\n\n100000 hugs from across the internet!", "NTA\n\nYour dating life is your business. If anything got more serious, that’s when you tell the adult kids, and then if it’s super serious, you could tell the in laws from your late husband if you still talk to them.", "SO NTA! You have EVERY right to enjoy your life with someone who is not toxic. I am incredibly sorry about your ex--living with and loving addicts is so often thankless. I went through something similar. You endured so much. Shame on anyone who would judge you for living your life.", "NTA.  To put it bluntly, your husband died-- you did not.  How long you grieve and the timeline and arrangement of how you put your life back together is no one's business.\n\nYour late husband's family is out of line.", "The cousin is the ass. How dare she! You have every right to date and be happy. I’m sorry for your loss and hope you find Mr. Wonderful.", "NTA these people are insensitive and off their rockers and the cousin was way way out of line. Every single one of them including your children owe you an apology.", "NTA. you lost your husbandyoure allowed to build a new life . Youre not doing anything wrong or inappropriate. I'm sorry for your loss.", "NTA, but the cousin and in laws (ex?) sure are.\nYou are an adult that has every right to companionship and love again.  It has been 5 years which is frankly longer thank most people wait.  \nThese other people don’t get to dictate your life.  Trying to shame you is just disgusting.  Trying to turn your children on you, even worse. \nTalk with your kids.  Be honest.  I am sure they will be fine.  Tim’s family…just sad how they reacted.  You owe them nothing.\nI wish you luck and hope you find love again.", "NTA", "NTA. Your kids are the only ones who may have a somewhat justifiable reason to be upset, only insofar as telling them you’re dating again to avoid this situation. That said, not going to call you an asshole for it and your kids are adult enough that they should be more realistic. \n\nHowever…\n\n>\tAnd I’ll also say that none of these people (meaning the adults in Tim’s family) reached out to see how they could help/support us while he was battling depression and addiction. His parents were regularly upset with me for not doing enough to “fix” him (in their view) and his other family (including the cousin mentioned above) decided they needed to “detach.” I do appreciate that is a valid choice, however, I think it minimizes what say they should have in how I currently live my life or communicate about it.\n\nThis is complete crap. I would cut your ex in-laws out of your life. They abandoned you emotionally while you and your husband were struggling and now they have the balls to say you’re wrong for dating? Fuck that noise. They are so out of line, they are in another country.", "NTA\n\nThey are reacting poorly. But it is a hard thing to take in. \n\nIf in a week, they haven’t figured this out, it’s time for some hard truths and boundaries.", "The cousin needs a serious talking-to. WTF.\n\nNTA, missus, not at all. Go have fun, you deserve it.", "NTA.  How is it any of their business what you do in your personal life at this point?\n\nAnd \"Betraying your husband\" exactly how?", "NTA. Wow, your family is being super weird about this. Waiting 5 years is plenty, and you shouldn't need to announce to anyone that you're ready to re-enter the dating pool. Seriously.", "NTA. I think it is a good plan not to say anything to anyone unless you were starting to get serious with someone. And Tim’s cousin? WTF? How were you betraying him? Unfortunately he is gone. The vows say til death do us part for a reason.", "Absolutely NTA. Please update us on how you decide to respond to your family- you deserve support, and although I only speak for myself, I'm sure that many other people here want to be able to offer you that, even if just in words, whether it goes well or poorly. \n\nAnd by the way, congratulations on your healing and being willing and able to begin to try and move on. This is a step some widowers never reach, and it's a testament to your tenacity and strength that you've kept yourself and your kids afloat so well in the wake of your husband's passing, and even before that with the issues that plagued him in life. You are a powerful, incredible woman who is deserving of a new chance at love, and I truly hope that your family (especially your children) will be able to see that sooner rather than later.", "I've always hated the term \"moving on\".  What you are doing is living, and you are in the deciding stage of what the term \"living\" will mean to you.  NTA, keep trying to find what will bring you enjoyment in life and don't worry about all the others.", "NTA - wow, you seem like a very thoughtful person and have helped your kids and yourself through the loss of your husband with therapy and time. Maybe your other family members need to do the same and butt out of your business. There’s nothing inappropriate about you dating. It is not their business   and you don’t need to ask them permission.", "Nta. It really is no ones business until you get serious with someone. Just ignore them. Reassure your children.", "NTA\n\nTo be fair, I think you SHOULD if you have young children and actively-involved grandparents. I think a heads-up would be in order in that scenario. But in your case, your children are grown and YOU are likely no longer actively involved with their grandparents.", "If it were Tim, these same people wouldn’t bat an eye if he got re-married in less than a year after you had died. Trust. They would’ve said the kids need a mom, they would’ve said Tim deserves happiness. They definitely would not be complaining about him dating if he stayed single raising your kids solo for five years.\n\nNTA, they don’t deserve to know you’re dating. You don’t need their permission. You’re not a teenager and their response just gives off intrinsic sexism vibes.", "Not her cousin, her late husbands cousin. But yep op is NTA", "Whoever called your kids are the biggest AH! \n\nDo OP’s kids inform OP of all their dates? I understand that they might be surprised and need to adjust but…they will. OP should distance herself from ex-ILs.", "I think the expectation is that I would be too consumed with grief and guilt for the rest of my life to do anything but wail and rend my garments...", ">YTA for not at least letting your kids know.\n\nThe kids *don't* need to know unless OP has started seriously seeing someone. But going on a few dates with someone is not major life news that needs to be reported. Yeah, it'd be nice to get a heads-up, but OP is allowed some privacy in her dating life until it becomes relevant to her kids. \n\n>It is no one else's business, but letting them know would have made this a non-issue.\n\nExcept for all the other ppl in O's life who are upset, you mean? I don't know how the kids knowing about this would have affected the cousin's reaction. \n\n>It also gives them lots of time to slowly adjust to the idea instead of you suddenly telling them you are dating and want them to meet someone.\n\nBut that's not what happened, so why are you comparing these two scenarios? It's not like OP has to introduce her new boyfriend to her kids the second they get serious. She can still give her kids time to adjust to the knowledge of her having a boyfriend before making them meet him. \n\n>I would apologize to your kids as they did deserve to hear it from you, not someone else.\n\nWhy should OP apologize for someone else's behavior, especially when OP's own actions weren't in any way bad?", "Yes, most of the dates were first dates.\n\nOne person I went out with twice, but it was a quick coffee one day and then dinner a couple days later (after which we agreed it wasn't a match) - so still not really worth sharing.\n\nAs for the person I went out with four times, we really liked each other as people but just never developed a romantic spark (we were both hoping it would happen and it didn't). Those dates were over a period of about two weeks, but happened to coincide with when both kids had finals at college at the end of the fall semester. So I definitely wasn't going to say anything emotionally upsetting during their finals period, and by the time they were done with the semester, the connection had ended.\n\nI was actually quite disappointed by that one not working out (he was a very nice person, and I wish I felt more of a spark), and took a break for a couple months before looking for/accepting any more dates.", "Thank you, I really appreciate the advice from someone who has been in my position.\n\nI've been talking a lot with Luke and Beth since they found out, and they are over the worst of their upset (at least so they say), they just hadn't any inclination that I was ready to date as I hadn't said anything at all to that effect while they were still home. Once I explained that I had waited until they were away from home so as not to have a bunch of different men coming in and out of their lives casually, they understood why I did things the way I did, even though they are still getting used to the idea of me dating.", "I was also thinking that telling them I was casually dating might be interpreted as \"running around with different men,\" which would somehow seem disrespectful to their father's memory, more disrespectful by far than having another serious, loving relationship.", "Thank you for sharing your story. I am so sorry for your loss, especially while your kids were teens. \n\nWhile Tim was going through his illness, in his moments of clarity he told me several times that if he couldn't conquer his demons, he hoped that I would eventually be able to move on and find someone else (or at least be open to it). Of course at the time I told him not to think like that, but I think of that now when I start to feel guilty about imagining a life beyond Tim.\n\nI did tell the kids (after my secret was spilled by Tim's cousin and parents) that I have only been on a handful of casual dates and that there are no worthwhile connections to discuss in detail yet.", "Hmm, you're right! I mean, she wasn't wrong, but that would have been pretty embarrassing if she had been. \n\nAnyway, she has always been a bit of a dramatic busybody so it's not too surprising things would turn out like this after she saw me.", "The funny thing is that Tim's parents are involved very little in my life these days, by their choice! They went low-contact with me (perfunctory holiday greetings only) shortly after Tim died because they said having a close relationship with me was too painful. So, that's another reason I didn't think to tell them I was dating - because they actually asked me not to reach out to them except for an emergency because it was too hard to hear from me. And I didn't think going on a handful of casual dates was an emergency. If I were getting remarried, then yes, even on a low-contact basis I would have told them, but not about casual dating...", "Thanks! It's scary at times, and I never wanted to be in this position, but I'm (cautiously) excited for the opportunity to make new connections.\n\nAnd I know Tim would want me to find happiness again, especially after the past decade (his illness plus a long period of grief) has been so difficult.", "I’d probably give the kids a general, “Hey, I’m going to try dating again.  I’ll let you know if anything looks like it’s going to go somewhere.”  It would allow them to absorb the idea before you got serious about someone.\n\nThe rest of them can go F off.  They are not entitled to any information at all. NTA", "NTA, it's been 5 years.", "There was a similar post here the other day so I'll comment basically what I did there. It is fully up to you to move on at your own pace and however and with whomever you wish. Your kids and their grandparents also lost someone so it's normal they might be upset at first, but that doesn't mean they get to dictate what you do. \n\nCasual dating is completely normal and you only have an obligation to tell people close to you if something starts to get more serious. It might be tough for your kids to accept at first, but you still get to live your life. There is nothing wrong with you trying to see what's out there and trying to add to your life.", "They are probably really young and think people in their 40s are almost dead 😂", "In which case, I’m sure you know you aren’t an AH. Please don’t allow them to make you feel bad. Your reasoning for not bringing it up are entirely valid and in all likelihood they would have had the same response if you had spoken to them preemptively. \nTake care of yourself and I wish you the best!", "Hey, as long as you're having fun on these dates and being safe. That's all you can hope for!", "I think the kids will be okay.  The rest of them can go pound rocks. One day at a time, that’s all any of us can do.", "So wait, they can’t be bothered to have any involvement in your life, but yet you need their permission to move on?  Wow. \n\nI know Reddit tends to recommend this extremely cheaply, but you may want to think about a permanent break-up with them.", "Yes, I probably should have said something last summer, when Luke was home from college and before Beth left. But at the time I hadn't even downloaded any apps yet so it seemed premature, plus I was worried it would seem like I was looking forward to having them gone so I could date freely.\n\nIn any event, they know now and will have time to get used to the idea before a serious partner enters the picture.", "Just because they are also my children's grandparents, I do want to leave the door open for a continued relationship, and I don't see the need to escalate to something more contentious. Although I don't see that happening anytime soon...", "I think you are a wonderful and compassionate person -not just a mom - based on all your responses. His family, like you said, just wants someone to blame (was the same with my mom all “woe is (my mom)” until my dad died of alcohol related death and then she was the devil.). They can screw right off.\n\nFor your own kids, they most likely are just upset due to the shock of his family wrongly shoving their noses where they don’t belong and telling your business. They probably always suspected you were dating and now this verifies it and they feel betrayed. But honestly? They are adults. This really has no effect on their day to day (maybe when they come home from school - rare) so you really don’t owe them an answer until you were ready for it. \n\nI promise you they’ll get over it.", "As an adult myself I would be happy for my mother for getting on with her life. It’s been 5 years they can’t expect you to be single forever,I’m hoping after the initial shock wears off they can find a way to be happy for you. You’re definitely nta and you deserve happiness just like everyone else.", "you can do whatever you want.I think your kids want you to be happy especially since a good chunk of your marriage was spent dealing with pretty heavy stuff. I am surprised they are upset. It is very immature of them but I am sure they will come around. Your husband’s cousin, however, deserves a good dose of Karma.\nOP, be happy, stay healthy, NTA", "I don't think there's a set rule to go by. I think it's going to be different for everyone and you just have to do the best you can, which is what it sounds like what you're doing.  I was a kid who lost a parent and personally, I would prefer a heads up that my dad was getting back out there so to speak. I don't want or need a play by play or even that they're going out on specific dates. Just to know that that's where he's at. Not because I'd have a problem with him dating again but because I think it would be really jarring for me to meet someone he was in a serious enough relationship with for us meet when I didn't even know he was dating in the first place.", "I would think it's appropriate to tell kids if there was a good chance they and your date would run into each other at the house. Otherwise, take your time & enjoy", "Right, one of the main reasons I waited until they were both out of the house to start dating again is that I did NOT want to bring a bunch of new men in and out of their lives while they were still actively grieving their father. By waiting, I thought I would be able to explore dating discreetly and at my own pace without subjecting them to all the ups and downs - and then if I did meet someone who was actually going to be a regular part of my life, I could share that. I just didn't count on the coincidence of running into Tim's cousin while on a date, thereby spoiling the chance for discretion...\n\nI suppose the bottom line is that my starting to date probably would have been upsetting - or at least an adjustment - either way. I had the best of intentions here even if I didn't quite get it right.", "The kids are more upset that they found out from someone else rather than from me directly. They have both said since then that it is understandable I would want to date after 5 years, although they need a bit of time to get used to the idea. And thanks for the good wishes!", "That definitely makes sense! I think I did guess wrong regarding whether my kids would have wanted the heads-up about casual dating. All I can do now is apologize, explain, and be more open with them to the extent they want to stay apprised of things.", "Yes, in retrospect I do wish I had gently broached the subject of being ready to start meeting some new people, including dating and potentially finding a new partner. Anyway, now that they know, I can answer all their questions and be more open about what is going on in my day-to-day life.", "I've found it immensely helpful to pick up with my therapist again every time there's a big life shift. Even if I'm not in acute distress about something traumatic, being able to talk to the same person who guided me through those hard times puts my growth into perspective and keeps me from backsliding. \n\n&#x200B;\n\nNTA, btw. Your in laws really crossed a line by contacting your children to badmouth you.", "I was in my 20’s at the time this happened and my sister was in college…my mom just has no boundaries. Lol\n\nI think this was always going to be a difficult thing to navigate. Not because you were wrong in how you went about it, but because there’s always going to be an adjustment for the kids. My dad was a wonderful father and we loved him so much; his sudden death was very hard on all of us. So it was always going to be a bit weird that our mom was dating again. And it wasn’t because we didn’t want to see her happy, it was just weird seeing her with someone other than our dad.\n\nI have a feeling your kids are probably similar. Once the initial shock wears off they’ll come around. You did *nothing wrong*. The fact is, the cousin went nuclear when it wasn’t necessary. And involving the whole family in your dating life was just vile. You did not deserve that.", "You did nothing wrong. As you are saying, maybe it's dating itself that is the issue, rather than not telling them. Maybe it was a lose lose situation.\n\nYour late husband's cousin, however... What an awful human being.", "I get it. I mean the past few years between your husband’s struggles, and his passing, were no picnic for anyone, I am sure. I am glad they want to see you happy. They were obviously raised well :)", "Yes, they will get over the surprise and upset, and I'm sure they just want you to be happy.  And even as adults, it can take an adjustment period to start seeing our parents as 'people' rather than just parents. Best wishes to you on your journey!", "I wish you luck. Most likely, they will eventually calm down, but it may be an uphill battle for a while due to how they found out.", "I can understand the kids being upset, it’s their own issue though.\n\nOP definitely doesn’t owe anyone anything here and she’s handled it fine.", "I meant, their opinion matters more than any of our comments. I'd be curious to know how her kids felt. If they didn't care, the point is moot(to me).  She's obviously an adult and can handle her life as she wants. But I'd say every parent/child relationship is different, so what should be expected is different, even with adult children.", "Yes, the therapist who helped with my individual grief counseling was fantastic. I have seen her for a couple tune-ups since then, but not in the past couple years. We also had a great family therapist, so I could check with the kids to see if they might be amenable to a Zoom session or two so we can all talk through our feelings about my dating again, with professional guidance.", "NTA. As a very recent widow, I have to just check in and say that it’s no one‘s business what you do who you do it with when how or anything else. They have a fat a lot of nerve scolding you. Your cousin is psychotic. Who on earth reaches out to the widows children to gossip like that?", "NTA, your husband passed years ago, did they expect you to never have a relationship again or were you supposed to wait for their permission? You have done nothing wrong, I'm shocked that they think it is any of their business what you do. \n\nMy husband's own immediate family would never interfere like that and his cousins don't even know what I look like. No one I know would ever act like that. This sub has the most ludicrous behavior that I have never encountered IRL.", "NTA we’re you expected to send out the mass text?", "NTA - I would rip the cousin (who is of no relation to you a new one for “telling” as if she has any say in your life whatsoever). Then I would ream your former in-laws for overstepping with your children. \nGo low, low contact and cut them off for holidays. When everyone is ready to apologize and stfu, I would tell them that any more commentary on your life or interference with your children will result in a permanently severed relationship.", "NTA   I would apologize to my kids though.  (Being open with them encourages them to share with you.). Explain you would have informed them if anything was serious.    \nIf they really upset I would push it.  Each and every time you plan to eat lunch with someone call your kids and act like you are their age and talk about your future plans.  Then afterwards call because you are disappointed.    When my Mother started dating she called me one night crying because she liked a guy that didn't like her.  Middle School all over again!  They will back away.", "NTAH and it's none of their business", "Um. Its literally been 5 years.  My own father died of cancer when I was a baby and my mother was dating by the time I was 2. Absolutely not a soul thought she was in the wrong and I can assure you she wasn’t making announcements to the family about it. And for this cousin to come up to you and start accusing you or betraying your husband?  Who the fuckkkkkkk does she think she is!?  In what world are you expected to need to announce you are dating AFTER 5 YEARS!   Jesus.  People are absolutely insane.  NTA", "NTA She was out of line.  They don't own you.", "This is ridiculous. You owe nobody in his family an explanation of your life. That they are upset after this long suggests there thinking is crooked and nonsensical. NTA.", "NTA.   \n\n\nYou're literally 41 years old. Not a damn teenager. It's also not like you started dating a month after his death. And you had a planned to tell others if anything got serious. If they can't see that, then that's a 'them' problem.", "NTA But the cousin sure is. Did they expect you to wear black for the rest of your life and never partake of any social activity. (Of course if that was your choice.) You owe no explanation to anyone. They owe you an apology, especially for making it sound like you were currently married. Dating is difficult in the best of times. I feel certain that if you connected with someone, you would say something when you were comfortable. I am sorry for your loss and happy you are doing something for yourself.", "NTA- I think waiting until you're seeing someone regularly makes sense. My dad passed almost 2 years ago. I wouldn't want to hear about my mom dating around, and would be totally okay not knowing she was dating until she actually found a partner.", "Firstly, sorry for your loss. Next definitely NTA.\nI can relate to this story more than anything I have ever read on here. I am currently a middle aged woman, but when I was 14 my father commit suicide after several years of illness and depression. My mother started dating my now stepfather a few months after and boy was I angry and judgmental. To be fair, it could've been several years later and I probably still would have felt the same way. I was wrong. My Mom, though she loved my Dad had not been a wife in years. She was a nurse, she was a therapist, she was crisis negotiator at times, all while trying to raise two kids into functioning adults. But she was not a wife anymore. \nYour kids will never have another Dad, your in-laws will never have another son. But you have the chance to love and be loved again and you deserve that. \nYou didn't need to tell anyone you were dating, you have done nothing wrong. It may take a while, but they will come around. Grief is weird and manifests itself in strange ways. Your kids don't see the whole you, they only know you as their Mom, their rock, and the wife of their father. But you are more than that.\nGood luck with everyone! But from a daughter who has been your daughter and has a few more years under my belt now, she will see the light, as will your son.\nSide note that stepfather I referred to earlier is the super most-best Grandpa that my daughter and her cousins could ask for!", "NTA, on the one hand, I can understand why your kids are upset, I probably would’ve been upset if my mom didn’t give me a heads up when she started dating after my dad died, but ultimately your dating life is nobody’s business and I don’t blame you for not wanting to tell your kids until you felt like you’ve met somebody you might get serious with.", "NTA \nYou have the right to your privacy, and to find companionship. \nSorry that you have to deal with all the family drama.  \n\nTotally agree that your husband's cousin completely crossed the line.", "I am so sorry for your loss 💕🙏🏼. This is your life to live! You’ve been through so much.. you don’t owe anyone an explanation. It’s honestly none of their business. You deserve to be happy. You absolutely do not have to tell anyone anything. They are selfish for spinning this around and making you feel guilty. Shows their true character, not yours.", "NTA. Your late-husband’s cousin, however…\nLook, you don’t owe anyone a “heads up” that you’re getting back out there, and you certainly aren’t “betraying” your late-husband.  Once you find someone you’d like to build a relationship with, then yeah I would let your kids know, just as you would probably like to hear if they were in a steady relationship…but again that’s only once you’ve gone past the early dating phase with someone, and only regarding your kids. You owe nothing to anyone else in that regard.", "NTA. The cousin is a major one, though.", "NTA", "NTA For goodness' sake. You're a young woman. It's been five years.\n\nMy late husband told me to find another man after he'd gone. I have no interest in that - I'm in my 60s and it's only been two years.\n\nYou have all your life in front of you. Your husband's family needs to butt out.\n\nETA And I'm sorry to say that your kids need to grow up. Tell Beth to try watching 'All that Heaven Allows' some time.", "NTA", "NTA. Your private life isn't their business.", "NTA", "NTA at all, you seem like a thoughtful, caring and sensible person. I have to ask (apologies if someone else did and I missed it) but hadn’t it ever occurred to any of these people that you might someday date again? Why is it all on you? They could have asked earlier if the issue was this important to them. At the very least I would think they would assume you might, especially after a very appropriate and healthy five years have gone by, and not be so shocked.  \n\nI do understand as a mom it might be harder to navigate this with your kids; I think your reasoning was quite sound.  I actually lost my father to addiction my freshman year in college, and after a couple years I actually asked my stepmom (my parents were divorced in my case) if she thought she’d date again someday.  She said she wasn’t ready then but maybe at some point, and to be honest I wouldn’t have needed to know what was going on if she started exploring the idea and meeting dates — I was off to college again experiencing it like those of us who are lucky enough to go are supposed to, which is as a kid/young adult venturing forth in the world (again luckily :)  In some situations there just aren’t easy, perfect-all-around answers for how to handle things. We do the best we can, and no doubt so have you and your kids - sometimes both sides of the situation being a bit imperfect can still be just right.  Good luck with this new phase in your life, wishing you the best 😊", "NTA, although I wouldn't say 3 years is a long time. I'd say that's shorter than average.", "You sound like a great person !! I hope you enjoy dating", "NTA- wow they have some nerve. I’m pretty sure if it was the other way around they would have been ok with him dating. You waited nearly 5 years to start dating. You deserve happiness, love and romance. I understand why it would be hard seeing you with another man, but do they really expect you to forever be alone? Sheesh", "NTA- it’s none of their business", "I wouldn't call you an AH but I personally would give my children a heads up it'll be an adjustment but they'll need time too. I understand it is your life and you owe nobody an explanation but out of respect for your kids IMO you should have told them (not ask permission or anything like that).", "NTA, these people wouldn’t be any more forgiving if you had given them a heads up.", "NTA. \n\nYou can make it very clear that you are an adult and if you decide to get a meal with someone that is your business.", "Very, very soft Y TA, but only for not telling your kids. Even with them being away at college, there's still probably a pretty good chance that someone who knows them would see you on a date. Then, not knowing it was a \"secret,\" mention it to them. You absolutely deserve to be able to get out there and date, but they deserve to hear that from you. \n\nMy mom passed away when I was 22. She had cancer, and we knew it was coming.  My brother and I even knew that she actually wanted my dad to find love again. (They'd been married a few months shy of 30 years when she died.) So, when the time was right, dad let us know that he was going to start dating. He's been married to my stepmom for 24 years.", "NTA And you didn't tell them because it's NOT THEIR BUSINESS! 5 whole years have passed! You date anybody you want... You definitely have that right!", "Aw HELL no, you are NTA. \n\nAnd WTF is wrong with your former in-laws?", "NTA.\n\nWho does Tim's cousin think she is?  You were a woman out on a date who's been widowed for *several years,* not a thirteen year old caught about to have sex and whose parents would have to be notified.  It sounds like you're still just dipping your toes in, but even if you were engaging in casual sex, it's really no one's business until you meet someone who's going to be a fixture and therefore needs to be introduced to your kids, relatives and friends, with a courtesy heads-up to your late husband's parents.  What was the point in telling your kids?  To have them shun you?  This isn't even a \"the family doesn't understand that you did most of your mourning before he was actually gone\" situation.", "NTA. And none of their beeswax until you’re ready.", "NTA, you have the right to be happy. It sucks sometimes for people involved. But you did nothing wrong, just moving on…", "NTA!!!!! Hugely and completely NTA.\n\nYou've lived through so much tragedy and disappointment, and you've been so devoted to helping your children carry on.  You are a strong, mature adult, and an excellent parent.  You deserve every happiness.\n\nAll that said, you owe no one information about your social or romantic life.  No one.  It's your own very private business.  You don't need permission, approval, or an informational podcast.", "Til death do us part.  They are way out of line.", "Definitely NTA. Your reasoning is sound although it would be upsetting for the kids to find out in the way they did. Two things can be true.", "Men are literally dating before the end of the year when their wife dies, bless your heart. Maybe a heads up would have been nice but certainly not a requirement. Honestly everyone is moving on with their own life, why wouldn’t you?! I mean are they really mad you didn’t tell them all about it! I’m just super confused but honestly it’s none of their business and you are definitely NTA for not “informing” them of whatever news they feel entitled to…", "NTA. Even if this had been a month after your husband passed away, his cousin's behavior would have been inappropriate. You are an adult and don't owe anyone explanations. It would be another thing if you were getting serious about one particular person and your kids didn't know, but you don't owe anyone any details about your dating life, non-existent or otherwise.", "Whatever happened to people minding their own fucking business??? NTA - you owe nothing to anyone!", "\"Til death do us part.\"\n\nNTA.", "NTA.  Are you supposed to tell them about every person you might have a casual first date with and never see again or just a serious one that might develop or ?  I mean, who do these people think they are.    \nYou spent 5 years focusing on your children post-lost of their dad, that's admirable.  You deserve a life, too.  Again, NTA", "Sorry, but you don't owe anyone one details of your personal life. I would have reemed her out for starting crap. You deserve to be happy. Nta", "NTA. It’s none of their business plus it’s been 5 years.", "Your love life is none of their \\*expletive deleted\\* business.  Tell them to mind their own business.  You were married for several years, during with you were faithful to each other.  It's been 5 years since he passed away (and I am so very sorry for your loss, however it happened) and... you are allowed to start dating again.  Again, it's been 5 YEARS, not 5 months.  Honestly, I'd be inclined to block them all after telling them where to go.  The only people who you might need to inform would be your kids... and that only if you're getting serious.  \n\nI am curious... how do your kids feel about you dating again?  Are they alright with it?\n\n&#x200B;\n\nNTA", "NTA, just because your spouse died, doesn't mean you died.\n\nIt's really pathetic and sad the way people are around widows/widowers. They either get upset you don't get on the dating scene again, or they're upset you do.\n\nDo you think your husband would want you to be alone forever?", "Nta. It’s been a few dates. Not a relationship. It’s been 5 years. It’s “till death do us part.” Not “and be alone forever and ever.”", "NTA. My mom started dating 4 years after my dad's passing. It's not our business. She's an adult with her own life and my brothers and I don't expect her to remain single forever. \n\nIt's been years since your husband passed. You don't owe anything to anyone.", "NTA. You’re an adult. Your husband passed away years ago, there is no shame and should be zero guilt with wanting to share your life with someone again.\n\nWhile it may hurt to know you’re “moving on” (I kinda hate that term in your situation, as it implies you had any choice), they do want you to be happy. The reaction from the cousin is totally unfair and selfish, but it’s her problem.\n\nMy MIL passed away and FIL was married 4 months later. We would have definitely liked a little heads up, as it was SO soon, but in the end, we want him to be happy and not lonely.", "NTA. Tell them all to stay in their freaking lane, you don’t owe anyone an explanation or justification for when/who you decide to date.", "Sone people think the “left behind” spouse is supposed to mourn forever but don’t realize that if your husband really loved you and it seems he did, he would want your happinesses.", "NTA - might have been a good idea to tell the kids.           \nJust so it came from you not anybody else.         \nBut you don’t owe anything to any of the others.", "NTA I once worked with someone that was with someone 2-3 weeks after her husband overdosed and died.  And this person was his brother!", "NTA\n\nDamned if you do and damned if you don't.\n\nPeople either mad that a widower has started dating or they are mad that the widower isn't dating. Usually depends on if they are related to the living or dead spouse it seems.\n\nI don't see anything wrong with your logic - but I have never been in this situation on any side, so idk.", "NTA. It's your life, not theirs. I remember my mother telling me she was dating someone after my dad died and she was so nervous until I told her I knew she was a grown adult and she had to live her own life now. They didn't need a heads up.", "Nah. You got it right. Children may not want to hear it but parents can date.", "NTA and they're being weirdos. It's been 10 YEARS since he passed, you don't need to tell anyone who you're seeing unless you want to or if its serious. How do they figure, telling a 45 yr old woman who she can and can't date? Ridiculous.", "NTA!  You don’t owe anyone in this scenario an explanation unless you are getting serious.  I’m sorry for Tim’s parents loss but this is really none of their business.  If anything, they should be happy after what you’ve been through the past decade.  You’re way too young to be sitting around waiting for your children and relatives to come visit you.  Maybe have a discussion with your kids but besides them, it really is no one’s business.", "As someone whose mother died at 14, NTA. I WISH my dad would search for a real connection.  23 years later abd he has a friend he's \"miserable with\". He doesn't really like her but it's better than doing rare outings alone. His words, not mine. \n\nYou should definitely talk with your kids, but outside of your immediate family unit, it's no one's business,  you're a grown ass adult with wants and needs. YOU didn't die, he did. Live your life the way you need to. You've deserve AT LEAST that much", "NTA. 5 years is a lot of time. You speak with the most respect about your late husband (my mother had the same faith and took me like 15 years to heal what she had done, my father wasn't as good as you are as a mom so I had to heal alone, and I was furious with no support). You deserve happiness, cut that people of your life.", "What do they expect? You sit at home and be alone all the time….. NTA", "NTA you are an adult, and you have been a widow for five years, it is perfectly natural for you to date again, and frankly, it’s no one‘s business.  Even your kids, you can tell them when you are ready, or when you meet someone worth talking to them about. Unfortunately, this cousin has taken that away from you, and no one has any right to be angry at you for continuing to live your life.", "This so much all of this. My dad died seven years ago. We learned my mom was dating when my BIL drove past her house (his Gma lived up the street) and there was a strange car in her driveway. It was weird for sure. But my mom deserves to be loved and have companionship. We still honor my dad’s memory and his life. Nothing will ever change how much he is still loved. And expecting my mom to stay single is just selfish and shitty. \n\nOP - NTA. You are an adult and the family is very out of line.", "Cousin sounds absolutely unhinged", "I came to say exactly this...your dating life shouldn't be anyone's concern but your own\n\nNTA but the only people whose feelings you should consider and maybe have a conversation are your kids that's it no one has a right to dictate your dating life tho", "Sounds more like she just wanted to freak the guy out so he would quit seeing OP! She made it sound like OP was currently married on purpose!", "For real. Of all the stories of this nature I've ever seen, there's only been a single instance I could, right or wrong, totally understand why everyone was pretty unhappy and uncomfortable with person's timeline of dating again post-widowhood (or, in that case, getting engaged), which let's say was far, *far* shorter than five years. \n\nI get things are different for different people but I feel like starting dating again after *five years* is incredibly reasonable.", "Thank you for taking the time to offer such kind thoughts, especially in the wake of your own recent loss. I am so sorry for the loss of your spouse and wish you comfort and healing in the times ahead.", "Awww, thanks! I appreciate it. I'm finally in a place to look forward to my next chapter and just glad I was able to get through the worst of my grief in order to get here. I do hope the family will come around, but if not, I still deserve to live my own life from here.", "I do believe Tim's family expected me to be so consumed with grief and guilt that I would essentially be a selfless nun for the rest of my life.", "I truly think that Tim's family felt I was (or should be) so devastated and traumatized by Tim's passing, especially the way he went, that I would never recover, that I would be miserable every day for the rest of my life. As I said in other posts, they blamed me for not being able to help achieve consistent recovery from depression and addiction and think that his death was all my fault. So in their view, I don't deserve any joy or happiness ever again. Of course that isn't a reasonable way to think, but they remain in so much pain that they have to blame someone.\n\nI am so sorry that you lost your father in a similar way (and thank you for sharing that you were able to be understanding in connection with your stepmother). Truly, I hoped that my kids would be happily enjoying their semi-adult lives in college and not really so concerned with whatever I was doing day-to-day at home. After all, they have their own lives and friends. And relationships, they both have partners at the moment. Given their reaction, I did misjudge in thinking they wouldn't want to know about my casual dates, but I didn't mean to mislead them so much as not burden them with things that would be potentially upsetting but ultimately have little impact on their own lives. I do hope they can forgive me, I think they will but it will take a bit of time.", "My husband passed away 5 years ago. I am not sure if that is within the average, but most of the people I know who lost spouses either to divorce or being widowed started dating again within a year or two. In any event I think 5 years is a long enough time to be completely single, without a single date.", "I understand this, and in retrospect I likely should have found a time to tell them, at least after I'd been on a date or two. It definitely wasn't great for them to find out from someone else. But now they do know and we can talk about whatever details they want to ask me.", "In terms of Tim's cousin and parents, I'm sure you're right. I do wish the kids had been able to hear it from me instead of someone else, though.", "I suppose I thought there was very little chance that anyone my kids knew would see me \\*and\\* tell them about it - I'm in a pretty big city (meaning the odds of running into someone we know while on a date are quite low), and as far as I know most of their friends from high school are away at college in other parts of the country.\n\nHowever, this experience, has certainly taught me not to assume that anything will be kept secret! So I will certainly be more open from here. Because you're absolutely right that the kids deserved to hear from me, and not someone else, that I am dating again.", "Thanks! As I said in another post I haven't even come close to being intimate with anyone. Most of the dates have just be conversations with no physical contact, and didn't end up being romantic at all - they were more like job interviews than anything - another reason I felt I didn't have anything noteworthy to share.", "My kids both say that they understand my wanting to date again and being ready to do so, they just need a little time to adjust to the idea (which doesn't mean I can't date until I have the okay from them, just that I need to understand it may take them a bit to warm up to the change). They were mostly upset because they found out about my dating from someone else, especially from someone who took a harsh and judgmental tone about it, and they wish I would have discussed it with them myself (not for permission but just to ease them into the idea).", "No, Tim definitely didn't want me to be alone forever, During the years when he was sick with depression and addiction, from time to time he would say that if he didn't make it, he hoped I would be able to move on and find someone else who could make me happy. Of course at the time I told him not to talk/think that way, because I wanted to believe he could defeat the demons, but I often think of those talks now when I start to feel guilty about looking forward to happier times.", "Agreed, I don't love \"moving on\" either. A big part of me will always be Tim's wife and that doesn't change with his passing. But I do like the term \"looking forward,\" as in, thinking ahead to the next several decades of my life and what to do with them. I have spent the past five years either looking back or just trying to survive, and it's time to think more about the future.", "No, the kids definitely don't tell me about all their dates. They both have committed partners now that I know about, but I'm sure they have both been on plenty of other dates that I wasn't apprised of. Which is fine, they are adults!", "They wanted her to throw herself on his funeral pyre.", "As a young adult whose mom started dating when I left for a summer, it was jarring coming home to a man I never met at our house all the time. Cats out of the bag now but even with them gone it wouldn’t hurt to tell them so they aren’t blindsided by it if they were to visit and you had a gentleman caller.", "I don’t think you’d need to tell them every time you went on a date, but I would have sent them a text (or a call) letting them know that you’d _started_ to casually date, just so that they’re aware. That being said, you would have notified them about an actual relationship, which is the more important thing anyway", "I am an adult child (35 years old) whose mother passed away about 18 months ago. Having gone through this with my dad (he’s already started considering dating), while I agree you don’t need to give your children a play by play or let them know every time you go on a date, I think the compassionate thing might have been to let them know you were reentering the dating field. This is how my dad approached it and it allowed me the opportunity to process my own feelings about it before being introduced to a new partner. This means that when he does find a partner, I won’t have to process the idea that he is dating again and has found someone new at the same time. I definitely don’t think you owed your in-laws a conversation but I think your children should have gotten a heads up because they probably will have a lot of feelings about it.\n\nJust the perspective of someone who has gone through it with their parent.", "I’m curious what was said to your kids.  I can assume they made you the villain.  I would make sure they understand that the ex in-laws tried to make you look bad because they wanted you to look bad not for your kid’s benefit.", "Please don’t do that to yourself. You have so much more life to live. Take happiness wherever you can find it. Your in-laws are ridiculous. Talk to your kids. They were told by your in-laws.. it was probably in a not very nice way either.", "hey if you're ready, you're ready", "NGL we lost my mom last year and I know my dad is absolutely allowed to move forward when and if he's ready but it will HURT. Does not mean he's not allowed to (my mama would want him to too)but we would be heartbroken if we found out from anybody but him and if we saw him with someone else not knowing he'd started to date again. Again it is your life and you are allowed to do as you please but think of the kids lol (I'm 40 so not a child and clearly projecting here 🤣💖). Good luck with it all.", "Exactly.  Nothing to see here yet.  No news to tell.  She was so far out of line it isn't even funny.", "[removed]", "I'm glad my mom had a discussion  with my brother and I 4-ish years after my dad died.  But we were 10 and 14, so it was a much MUCH bigger deal.  \n\nMaybe, you should have talked to your kids?  I'd be surprised if they wouldn't be in support, but I can also see where the gossip cousin could swing their emotions in this.  \n\nBut they are adults, it's not like you're bringing in a \"new parent\" on any level.", "Are you by chance on a life360 app where his family is stalking you? The odds of this accidental encounter while on a date seem pretty low unless there’s some shenanigans. Reddit skeptic in me want some additional story here. \n\nNTA - live your life.", "Ok, but did they start dating without telling you? Look, you aren't ana asshole, and your late husband's family are being unreasonable. But it would have been better to tell your children, not about your dates, but that you were dating, so that they wouldn't be blindsighted.", "That certainly makes sense - I absolutely would have told them if I were seeing someone regularly whom they might meet. And now we'll have time to talk about it if I do meet someone I want to date consistently. I definitely would not want them to be blindsided by encountering someone at our home.", "I suppose I just thought that since the kids were both 1000+ miles away at college, and none of Tim's family lives around here, there would really be no chance that they (the kids) would have a chance to hear about anything before I was ready to tell them. After all - I don't get secondhand reports on the kids' movements at college, and there was no reason to expect they would hear about my day-to-day movements.\n\nBut now I do see that trying to keep things private may not always work, and can inadvertently cause hurt, so I do wish I had been upfront.", "Tim's family seems to think that our vows were for all eternity, not just \"till death do us part.\"", "Right - my kids are adults, and also away at college and not at home - so I figured that gave me some time and privacy to figure out the whole dating thing before making any disclosures.  It definitely would have gone differently if my kids were a few years younger and still at home!", "Not as far as I know, and I don't post much on social media, certainly not about my dates.\n\nI do live in a major city that hosts a lot of conferences and was at a popular restaurant, so it's not completely implausible that I would have run into someone I know eventually, although it is an odd coincidence.", "Ha, no, I have no idea whether members of Tim's family are dating or not.\n\nIn retrospect, I agree it would have been better to tell the kids that I was starting to date. I just thought that with them away at college, I had a measure of time and privacy to figure out what to tell them and when.", "Might be a little different but it’s also about the age of the children. Yours are adults so I think it’s up to you whether to inform them you are dating or not, whereas if they were children it can be very destabilizing to have multiple people come in and out of your life as a parent dates", "Are you Mormon? \nEven Mormons date after a spouse dies.  So I'm really confused at that stance.  The person could have been anyone you were at dinner with.  How dare that relative say you betrayed your husband.", "Tim’s family are AH.  First for thinking you need there blessing or permission. And second calling your kids to tattle on you about something that’s not there business no matter how they want to justify it.   5yrs seems like more than enough and it’s nobody else decision.  Next time tell them you and tim had an open marriage and often joined other couples.  Just to get them going crazy.", "I hope your kids don’t feel the same way. You’re NTA at all. The fact that you waited until your kids went to college and put them first is very thoughtful and selfless. I hope you find someone who makes you happy you deserve it.", "Did your kids care?", "Nope! Not religious at all and neither is Tim's family. Which makes it even stranger.", "No, the kids are just upset that they found out from someone else that I am dating, instead of hearing it straight from me. They do say they understand it is time for me to get back out there and be open to a new relationship.", "The kids were upset that they found out from someone else that I am dating, instead of me telling them myself upfront. They need a bit of time to get used to the idea that I'm dating but did say they understood that I was ready to date and should be able to do so.", "Commenting on your last sentence - you did things quite right actually. That cousin acted really shi^%y and made things out to be gross when they weren’t.\n\nYou gave yourself and your kids enough time to grieve your late husband and all of you have somewhat moved on with your life. Your kids maybe a little surprised initially to see you with someone else but it’s not going to be an extreme feeling on their part.\n\nThis incident has done you a favor- all the relatives who have been giving you hell about dating again, feel free to weed them out of your life. Now you know which people are the decent ones and who aren’t! NTA", "Tell your children that. Tell them the truth- it was the first date with that gentleman, you didn't tell them because you didn't know if there was even going to be a second date, and that you were not intentionally keeping them in the dark. When there was something to discuss, you planned to discuss it. You love their father, but he's gone, and you want to try and find a similar level of happiness again. Tell them that what the cousin did deeply hurt you because of how badly it hurt *them.* Acknowledge their pain, but don't apologize for deciding you're ready to move on.", "We found out my mom was dating because there was a strange car in her driveway. Was it weird at first? Yes. But she had her own guilt about dating and didn’t even know if it would last. Why add other people’s opinions to the mix?\n\nLol it’s been a few years now and my mom still won’t call him her boyfriend. They travel together, spend every holiday together, etc. but he is still her “friend.” \n\nI can’t imagine losing your spouse and everything that comes with it. Everyone needs to do it their own way.", "I don't think it's their business until there's someone you want them to meet", "They are still grieving. You're nta, for sure.  You moving forward is reminding them of their loss. They will probably come around. Just talk to your kids,  if they want to.", "I would say this is part of the grieving process but would also wager that if roles were reversed Tim's family would NOT expect him to never date again.", "The kids are upset/disappointed that they heard about me starting to date from someone else, instead of directly from me. They said that it is an adjustment to think about me dating again, but they aren't angry about that. They just wish I would have told them. \n\nAgain I just misjudged how much info they would want about my casual social life while they are away at college.", "You are such a great mom! I know this is hard & has been devastating hard for years- just wanted to say you’re doing great. Handling it with compassion & grace, I think.", "This is another reason your ex in-laws suck.  It makes perfect sense what your saying about testing the waters before it’s anyone’s business.  Even your kids, not meaning it in a rude way.  It was going to be weird for them at anytime.  At least they know now.  But make sure they know that the way it was handled by these other people was completely dirty.  They tried to use your kids to sham you and you didn’t deserve that.", "Thank you, it's definitely been very hard, especially to keep it all together. But I think we all deserve to be happy now after all these difficult years.", "# WOW REALLY?!? NTA!!\n\n>Despite numerous inpatient psychiatric stays, and several stints in rehab, he passed away of an overdose 5 years ago, at age 40. We don't know, and will likely never know, if the overdose was accidental or intentional.\n\nYou sound like an amazing person for trying to help your husband through all of that.  I am sorry for your loss but sadly depression + alcohol + drugs is often a deadly combination. I'm just getting off the booze myself. It's literal poison for some of us...\n\n>After Tim's passing, I was 100% focused on helping our children be as okay as possible.\n\nYep. You're a good person alright.\n\n>With both Luke and Beth now adults and away from home, I can finally focus more on myself.\n\nWow, great person. And YES it's time you should look after yourself and your own needs.\n\n>So, here's where the problem is - last week, a cousin of Tim's saw me out on a date - she was in town for business and just happened to be at the same restaurant.\n\nOh wow. Asshole doesn't even cover that behavior. What, you're supposed to \"stay married\" to your dead husband? Who the fuck would even suggest such a thing? You're never allowed to be loved or held or anything ever again? After he (tragically) ended his own life by medicating his depression in the most dangerous possible way?\n\nYou were a loyal wife. You're an excellent mother. You owe NOBODY ANYTHING and you sure as hell don't need to explain yourself to anyone. If you were my close friend or relative I would tell these people off to their faces.\n\nThen I would unfriend them on social media!! UNFRIEND THEM I TELL YOU!\n\nYou've paid your dues and kept your vows. \"Until death do you part.\" Tell his idiot cousin to recall those words...\n\nIt's time for you to start living again.\n\nGo live.", "op=NTA\n\njeez, just go for ritual funeral pyre already.  Honestly, it's ABSOLUTELY none of TIM's family's business who you are dating except at time of marriage(if you want to invite any of these A-H's to the wedding).\n\nEnjoy your TOE dipping and tell Tim's cousin(who apparently lives in the area) that if she pulls a stunt like that again, she's going on BLOCK/NC because you don't need that drama in your life. It's simply NOT her business.  \n\nSmall reminder(for Tim's cousin--and family), Wedding vows are UNTIL DEATH YOU DO PART.   You parted 5 years ago.  No betrayal here.", "NTA it was none of their business. I do think you owed your kids a heads up but no one else. Especially not your former in-laws you are no longer their family and you are betraying no one", "NTA\n\nOP you don’t owe anyone an explanation or even a heads up. You’re single, smart and have barely put your toe in the dating pool yet. \n\nMaybe in retrospect you could’ve casually mentioned to you kids that you were considering it but it wasn’t mandatory that you did. Hindsight is always 20/20. \n\nDo you have single and married friends that could introduce you to someone they know and can vouch for so you wouldn’t be relying on dating apps? Nothing against the apps but a double date might be a little more comfortable and more casual and no expectations. Social gatherings, church singles groups, etc.\n\nGood luck, hold your head up, don’t pay any attention to the trash talk. You’ve got a lot of life ahead of you, enjoy it.", "NTA it's been years. You don't owe them a talk or need their permission. You are allowed to find happiness again. Did they expect you to wallow in grief forever? You can still love your late husband but realize life goes on. You deserve to be happy and loved.", "Absolutely NTA and this cousins behaviour is shocking! Firstly how dare they confront you and say anything like that. It is no one’s business but your own what you do at this point in your life. You have obviously worked very hard to ensure your children (and you!) made it through a tragic event and the tough times at school and you prioritised them to give them a great start in life and making sure their needs have been met. To be expected to tell extended family about your personal choices when you have obviously provided a safe and stable environment for your kids all this time is crazy. This cousin should be ashamed of their behaviour.", "NTA\nShe was way out of line to even approach you. His family's behavior is disgusting. Your children are grown right welp speak to them and let them know the situation and how you will not be associating with that family anymore. They were completely out of line there is no time limit or mourning if 5 was enough for you that's what matters. Do not explain yourself and do not respond them.", "Wow.  Just wow.  My husband passed away 5 months ago.  We had bought our home about five years ago in a 55+ community and made friends with many of the other residents.  I walked with a single male neighbor the two blocks to the community rec center and back home last week for a potluck.  We even sat at the same table.  Does that mean I have to notify my family that I am \"dating\"?  Does it mean I am \"moving on\"?  \n\nThat cousin was out of line and so is everyone else, including your kids.  NTA", "Wtf! Nta", "5 years is a long time.  They are all acting like you were caught cheating. Ridiculous.", "Very mild AH.  Very, very mild, and mostly to yourself.  Your kids don't deserve, or need, an ongoing narrative of your dating and relationships. But they also don't need to be protected from a potentially awkward truth.\n\nHowever, they do care about you, and it is a petty big change in your life.  A heads-up about this change lets you control when and how they find out, and gives them time to adapt to the idea.  It's easier to get used to \"mom is going out, now and then, with someone she met on a dating app\" than it would be if they only found out after your relationship was serious.  \n\nAnother point to consider is that your now-adult children probably have more recent dating experience than you do!  \n\nIf they're good kids, and if you're generally pleased with the people they've introduced to you as ones they are dating, they are a valuable resource for you, a window into how the dating scene has changed since you were dating before your marriage.  And if they're generally good-hearted and care for you, they can also be a source of advice, and people who can provide a gentle warning if they see a potential problem.\n\nWhen my parents divorced, me and my brother were adults.  When my dad started dating, both of us saw some red flags in the first relationship he developed.  My brother took him out for lunch, and had a quiet talk with him, explaining our concerns, and assuring my father that he could find someone who was more suitable, and didn't have to settle on the first interested woman.\n\nMy brother found out, then, that my dad had the exact same conversation with his father, after my dad's parents divorced when my father was already an adult!\n\nThe woman my father eventually married, after the divorce, was lovely.  Almost the same age as him, kind, and caring.  He, in turn, doted on her, and on her adult developmentally disabled son.  \n\nSo, talk to your kids.  If you've done a good job raising them, you don't have to stress about always being the \"grown up\" and protecting them.  You can be an adult along with them, now, and learn from the experiences they are having.  \n\nIf you think back to when you were young, and dating before your marriage, odds are good that you had friends close to your age.  And they would meet the people you dated, and if they thought there was a problem, they'd give you a metaphorical slap on the head and tell you that you can do better, and don't settle for someone who will be a problem.  At this point in your life, most of your friends are probably also married, and also years out of the dating scene.   Your adult children can be a way to not have to navigate this 100% alone.", "Nope. They're all lunatics. It's your life. You only live once.", "NTA. MYOB. That would be my response.", "NTA   none of their GD business!  Holy crap!", "NTA\n\nWTF? Tim is dead. How is it a betrayal? \n\nI can come at your kids *maybe* being a bit salty at it, but actually they don't really get to be either. I suspect that if they'd heard it from you, rather than an overly-excited relative, they wouldn't be calling you an AH either.\n\nWho the hell do these people think they are? Do they expect you to be running things by them when you're 50? 60? 75? \n\nHave you asked them when they think it'll be OK for you to live your life without their permission.", "nta! holy crap, FIVE YEARS. it's utterly absurd to think you wouldn't be moving on by then.", "NTA, You are not obligated to give everyone a play b play of your daily life. The cousin is a real AH for confronting you at the restaurant and telling all of your in-laws and your children that you were on a date. \n\nYou are testing the waters and didn’t yet feel comfortable or feel the need to broadcast your private life. All completely normal and understandable!\n\nAs you said, you are a widow 5 years now. Your in-laws should not be expecting you to live a single life indefinitely for them!!! They live cross country so there would be absolutely no reason to include them in your day to day life goings on!", "WTAF is wrong with your family members that they think you have to make an announcement when you're starting to date again? Definitely NTA", "nta. what a toxic family..", "NTA\n\nI can’t help but feel like this is misogyny. Would anyone bat an eye if a widower started dating after years with no children in the home? Their expectations aren’t your problem.", "I'd say NAH, except maybe the cousin for not talking to you in private.\n\nIt is a delicate matter, and while not everyone should have known about that, maybe there was a time where you could have talked about it with your children? grief is a weird and i can understand that other people that held your husband dearly might be upset.\n\nyou can also have a talk with his parents now and clear it up. maybe?", "NTA!!", "NTA but I would have told my kids that I was going to start going out on dates again. Nobody should expect you to be alone for the rest of your life. You’ve waited until both kids were adults so they can’t use the excuse of finding them a new daddy. I’ve seen that accusation flung around people. I don’t understand why anyone is giving you grief. It wasn’t like you had a perfect marriage and it’s only 2 months after his passing. You’re still young enough to enjoy traveling and taking trips to different places with a romantic partner. They should recognize that.", "Holy fucking cow!  Your personal life is literally no one else's business.  Please, please, please, do NOT apologize to anyone; do not attempt to explain anything (because it's not anyone else's business); and do not answer any questions you don't want to answer.  NTA, BTW.", "NTA\n\nTell evenybody nobody need to know when OP is moving on, to their terms, Its OP life, only OP will decide when to tell. Other can mind their bussiness and keep their nose to themselves.", "NTA. You really owe no one an explanation. Especially your in-.laws. sit your children down. Ask them when they are off living their life, getting married, traveling, possibly having children do they expect you to have no life? What do they think you will do? Do they expect you to sit in a house alone for 30 or so more years? You husband has been gone 5 years. Block your in- laws. Arrange family counseling with your children if needed..Get on with your life.", "Nta not really anyone's business.", "NTA. You only ever have to let your kids know, and that only if you think it might develop into something that could affect them. A cousin-in-law or former in-law of any degree, h3ll no. Technically, you aren't even legally in-laws anymore. It has been 5 years. Most people would assume you were dating again after that long. His parents should have kept their noses out of it and not contacted your children.", "NTA - you are a grown woman, your kids likely want privacy to live their lives, they owe you the same respect. As does the rest of your ex’s family.", "NTA. Honestly if I was your kid, after five years, I wouldn’t be shocked that you had a couple dates, nor would I be upset you didn’t mention it. As long as you didn’t lie - did they even ask if you were dipping your toes in the dating pool when they catch up with you? I think y’all deserve some grace all around. \n\nExcept that cousin. I hope a raccoon gets into her ceiling.", "NTA, and how dare they. Do they expect you to wallow alone, covered in cobwebs, as they live their fullest lives? Shame on them. I'm enraged for you. Keep your head up high becausw you've done enough... now go live and be happy.", "NTA but your late husbands cousin sure as shit is.", "NTA. Five years is more than plenty of time. You honored your commitment and then some. You don't owe anybody a heads up to get back into dating. \n\nIf you start to have mutual feelings with somebody and head towards an LTR, you should tell your kids, I guess. For a cousin, it's really none of their business. You do not need their permission to seek affection or date.\n\nYou aren't \"moving on\", you are living your life. You aren't betraying your late husband in any way. You made a vow to him and kept it, five years beyond \"til death do us part\". You have a fucking right to seek happiness and don't have to document every twist and turn to their satisfaction. Dating is hard enough without an audience.", "Obviously you’re NTA. But how do you plan on responding to a whole storm of people who trampled over your private life?", "NTA...  The kids are out of the house enjoy life.", "NTA  It's been five years.  That is a respectable amount of time.  You are a young woman and it sounds like you're handling the dating thing perfectly.  Good for you!", "NTA! That cousin is a real piece of work. Her behavior is so extreme, that I initially thought that this is fiction.", "Why did everyone think you wouldn't? Unless they want to spill the beans on every date they've been on there is no reason you should have to.", "It seems very likely that this strong of a response is coming from people's grief being abruptly brought back up, and not actual upset or malice towards you. That doesn't excuse it, especially as it's been hurtful and stressful to you, but it's also very likely they will cool off with time.", "NTA. \n\nFuck the cousin. \n\nHonestly, the only thing I think you might have done differently is tell your kids you were starting to date so they wouldn't be shocked when you met someone. But that's it\n\nEveryone else, you might need to lay down the law", "Definitely NTA! This is coming from someone who was in your kids’ position but WAYYY younger… my mom died when I was 12 and my dad started dating again when I was 14. He gave no heads up and I found out when he accidentally sent me a text meant for her (thankfully it was nothing gross). If you had done anything like that? Yeah you would be TA. But you didn’t. Your kids are adults and aren’t even living at home and have their own lives. You spent so much time focused on only your kids that you are absolutely allowed to put more time into yourself and your happiness. \nWould it be nice to tell them first? Sure. But your reasoning is completely sound. Everyone who is mad at you is completely wrong for how extreme their reactions have been.", "NTA.  You lost your partner for more than 5 years, since his addiction started.  You were put through so much trauma.  Why would anyone think you are cheating or shouldn’t find a partner? Shame on all of them. \n\nI hope you meet someone wonderful.", "NTA. His cousin should stay in her lane. You have every right to move on with your life without informing everyone of every step along the way. They do not have a right to know anything you don’t want to tell them. \n\nI wish you all the best moving forward and hope your family can learn to respect your boundaries.", "How can you betray a dead person? SIL overreacted big time and she’s the one that owes you an apology.", "NTA", "NTA.\n\nIt's, frankly, none of their fucking business.", "You did nothing wrong. If you wanted to let them know, you could have. You also didn't need to for any reason. Like if it had been to a point where it involved family, I can see a reason, but it wasn't there, and also still your choice. The fact this made such a scene is because of this cousin, whose focus seems odd and confusing. Ugh. I sometimes have issues with my family for not getting involved when needed, but compared to this....no thank you. NTA.", "NTA at all. Everyone has a right to move on and date post losing a partner. It doesn’t mean you didn’t love him or don’t miss him everyday. \nYou are also allowed to take your time telling people. I completely understand about not wanting to tell everyone until you are dating someone regularly/seriously as well! Why would you need to tell everyone in your family that you’ve been on a couple casual dates? It’s no one’s business.", "NTA. What normal person would be comfortable reporting every aspect of  their personal life to family members. I think you're entitled to some privacy while you're figuring things out. Give yourself this time, and create distance with relatives who want to control your behavior emotionally through guilt.", "NTA you have every right to date whoever you wish & hopefully find happiness. I have outlived 2 partners myself at 51 years old. It is difficult enough to go through such a loss w/o others unnecessarily making it more difficult! Very few people are happy to be alone & no one should “have to” do so unless they choose to.", "NTA.... though I do think you should've mentioned it to your children that it was on your mind to start dating again. I think they would've understood hearing it come from you rather than a nosey cousin.\n\nEdit to clarify, not ask permission because it's your life..but just to let them know incase word got back to them.", "NTA. They sound nuts and explains your husband's problems.", "NTA. It’s been 5 years. Why would anyone even be surprised you are dating? As you said, a head’s up about a serious relationship or a remarriage would be appropriate, but do they expect you to tell them every time you swipe right on a dude?!?", "She's lashing out at you in her grief and painting you as a heartless villain so it's easier to get away with her behavior.\nNo one in their right mind would punish you for trying to find companionship after 5 years of suffering alone. A decent, kind person would be happy for you. You put your family first, now it's your turn. NTA", "Thank you for the positive words and encouragement!!! Wishing you all the best in your own addiction recovery too, I know it is not an easy road.", "I know the current top comment is NTA, but still, this NEEDS to be the top comment!!  I mean, the cousin seems to be implying that OP should have asked her late husband's family permission to start living her life again.  Which is utter BS.  She should not only unfriend anyone from her late husband's family who adheres to this BS, she should completely block them.\n\nHowever, if her kids support their paternal family's views, she needs to have a very open and honest conversation with them about what their father put her through, if they don't know already.  And if they do, and still support their paternal family's views, well, I guess the berries don't fall far from the stem.\n\nNTA", "Thanks! I do think I want to branch out from just using dating apps. They are a good way to set up a good number of dates quickly, but I haven't really clicked with anyone yet; I think some personal introductions may end up being more effective. Appreciate the idea!", "The cousin was so far out of line.\n\nOP loved an addict for 20 years. She watched his addiction take him away. She mourned him for 5 years while ensuring her kids were ok. Then she finally starts to live for herself a little bit and her cousin in law accuses her of having an affair in the middle of a restaurant. Absolutely disgusting behaviour.", "I'm so sorry for the recent loss of your husband. I hope you can find happiness and companionship again, whatever that looks like for you. You definitely do not need to justify to anyone anything you are doing to feel less sad.", "Thanks for this perspective! I hadn't thought that my children could be a resource for me as a new dater. Yes, everything is completely different now. I met Tim in college over 25 years ago - I guess online dating was a thing then, but not really something that younger people did. At that time we just met people in class, on campus, etc. There certainly weren't any dating apps, you actually had to go out and meet people in person.\n\nI've had a fair number of dates but as I said, haven't met anyone to spend time with on an ongoing basis, so perhaps the kids would be willing to coach me a bit on achieving better success...", "I didn't start dating until the kids were both away at college, and it didn't seem like the sort of thing I should tell them over the phone or especially a text message - I know that may seem like an excuse now, but there just didn't seem to be a good window to really sit down with them to explain. But I do wish I had found a way.\n\nAs I said in some other posts, some additional info is that Tim's parents went low-contact with me shortly after his death . We still exchange holiday greetings and they are in regular contact with the kids, but they said it was too painful to maintain a close relationship with me. If we had remained very close, I definitely would have at least given strong consideration to giving them a heads-up that I was planning to start dating. But they asked me generally not to contact them unless it was an emergency, and \"I'm starting to go on a few dates\" didn't seem like an emergency given that they barely wanted to be a part of my life anymore.", "The kids never asked me about my dating life, no. When we talked a few times a week, we would talk more about what they were doing at school, their classes and social activities, etc. If they had asked me directly, I would have told them the truth, that I'd gone on a few dates but hadn't yet met anyone worth mentioning yet.", "That's certainly possible! But as I mentioned, Tim's family has been low-contact with me since his death (due to their grief, they said). I hadn't seen the cousin who \"caught\" me on the date since Tim's funeral 5 years ago, and his parents have had little communication with me because they said it was too difficult. Certainly, no one reached out to me to see how I was holding up or if I or the kids needed anything...so it's a bit add that their grief would come up suddenly now.", "THIS! She did this to punish OP, not because she thought the kids deserved to know. What a horrific way for the kids to find out. Ambushed with it by an angry relative, and in a way that makes them feel like they’re *supposed* to be upset. They have every right to feel their feelings about it, but the way your cousin set it up was callous and horrific. \n\nWhat does your late husband’s *cousin* even have to do with this? That seems like such a random relative, were the extremely close or something? What gives?\n\nAnd even then… op YOU are the one who needs to process you dating again.  That is a very, very intensely personal thing. Why on earth would you want to open yourself up to everyone’s opinions? Why do they HAVE opinions? It’s been years. Why would they not *expect* you to be dating at some point? And if it’s not serious, why on earth would you notify anyone.  You did not become your late husband’s family’s property when you married him, and you are not beholden to them because he died. You are your own person.  You don’t owe them anything, and if they want to remain in your life, they need to let you have one.\n\n**Everything about this is just ludicrous to me. And to be honest it is far from the first time I have heard this happen to someone trying to move on and have a meaningful life after a spouse has passed.** Not just from the late spouse’s family, but from friends and coworkers and even mere acquaintances.  They’re given such sympathy initially, but then expected to remain in perpetual mourning, as if to somehow prove to the world that they loved their spouse at all, as if dating anyone ever again is proof that they *didn’t,* or somehow diminishes it.\n\nPeople who mourned with you or gave your their sympathy don’t need to be acting as if that means they get to have expectations for how you mourn or live, for frankly any length of time. It’s like they put you on a widow-pedestal and expect you to simply stand there alone and in mourning to signify to all that your late spouse was loved. It’s insane, and frankly it’s cruel.  \n\nI think a lot of it has to do with people’s personal insecurities. I feel like people close to him are afraid he will be forgotten, but it’s up to each of them individually, not you, to keep his memory alive for themselves. And I feel like other random people who judge are just afraid to accept the transience of life and the resilience of humanity. People have romanticized marital love into something mythical or destined and don’t want to think of it as it is - real, raw, circumstantial, with no guarantees. **Marriage is a two-way street — you can’t “betray” someone who isn’t there to reciprocate your loyalty.**\n\nThe traditional line was literally “til death do us part.” That’s the timeframe for expected loyalty to a spouse. Not “until my dying day” or “in perpetuity and/or until your cousin says it’s okay to move on.”", "OP was having dinner, with a fellow human.  Years after her husband's death. Presumably fully clothed at the time.  She wasn't grinding it out on the dinner table in public.  The cousin is an absolute shit.", "I agree with your intentions to wait until you were seeing the same person consistently before telling your kids!  \n\nUnfortunately your in-laws overstepped and hurt your children!!\n\nYou did nothing wrong!", "It is more likely that the people who raised him and had an impact on the formative years of his life are intwined in his depression and addiction, rather than someone he met as an adult!\n\nSadly the parents are burdened with a level of guilty feelings re: their sons death. And they are pointing their anger at you to avoid acknowledging the feelings, that they let their son down!", "How would the cousin even know if it was a date. You could have been hanging out with a male friend, a coworker, the neighbor…", "I forgot to say in my post (I’m very much a newbie here in my defense :) that I’m very sorry for your loss. Thank you for writing back and answering my question; I’m also sorry your husband’s family is so unhealthy and a burden rather than a source of support (I understand you realize they aren’t reasonable, and instead of a long explanation of why I think so please let me just say that they are not only not reasonable they are wrong. Extremely, callously wrong.).\n\nYou’re being very considerate; I don’t think you did anything that needs forgiveness from your kids - acceptance and adjustment perhaps, but stronger than that I just don’t see. I did see you mention that your husband’s family cut you out and are still close to your kids; I hope you keep an open dialogue regarding their grandparents and their ongoing relationship with them. Wishing you happiness 😊", "Theirs are the only opinions that might actually matter... and they're ok with it. Yes, you could have said something sooner... I expect you would have eventually... but your cousin was a raging AH for everything they did. No way are you in the wrong. Feel free to cut your cousin and everyone else if you feel you need to. You did not owe them a heads up. After 5 years, it should not have come as any surprise that you would want to date again. They seem to expect youto stay alone for the rest of your life... and that is grossly unfair, and unreasonable. I hope you find someone that makes you happy.", "No problem!\n\nDo remember that they are still your kids, and talking about dates should not be the same as it was talking about dates with single friends of your own age.  The TMI line is quite a bit shorter!\n\nBut something as simple as inviting them over for dinner to meet your dates after a month or two, and a simple \"hey, it's been a long time since I dated, give me a warning if I'm doing something foolish\" might not be amiss.\n\nA great deal depends on the nature of your relationship with your kids, and how you're used to talking to each other.  I wrote a bit about my father on this comment thread: [https://www.reddit.com/r/AmItheAsshole/comments/q47upk/comment/hfwqxc6/?context=3](https://www.reddit.com/r/AmItheAsshole/comments/q47upk/comment/hfwqxc6/?context=3) to give you some context on the type of relationship that led to where we were when he started dating again.", "well that makes the parents of him maybe a little more a-holy... but the matter stands, grief is difficult, you didnt mean to hurt anyone and i understand that windows to talk to your children were rough. While you were not able to talk to them before, you should find a way to talk to them about it now, probably best if to both at the same time, if that is somewhat possible, but no one can and should hold you accountable for it. i just think, that especially your children are overwhelmed by it as well.", "the “not giving a heads up” thing is just…not something i think anybody should call you an AH about. Like maybe it wasn’t their preference but honestly I think they’d be unhappy either way. \n\nyou spent a decade caring for someone with addiction and depression and raising kids. you deserve love and grace.", "And So Are You!!! NTA. Live you truth & never let someone else's opinion hold you down!!!!", "Listen u/Mountain_Tomato_566 I assume you are second guessing yourself because of the uproar surrounding you. **Do not continue doing this.** You mourned your husband truly and deeply, and your mourning period was not short by any means.\n\nIf people expected a heads up, that was an error in assumption on their part. Can you imagine how it might go if someone in your shoes announced to the extended family chat every time you scheduled coffee or a movie with a potential date!?! That would be utterly ridiculous. They are allowed to feel raw about their loved ones passing, but taking it out on you in the form of misplaced harassment is not okay in the slightest. NTA", "Even if she was grinding it out at the kitchen table she's a  grown woman that can make her own decisions", "The cousin puts the \"freak\" in freaking.", "Thank you for sharing your experience from the perspective of someone who has recently lost a parent. I do see that it would have been kinder for me to tell them I was starting to date, especially so they didn't hear it from someone else.", "Tim's cousin told Tim's parents that I \"was defiling Tim's memory by screwing around\" and that she had caught me \"in the act\" (Tim's parents relayed those exact words to me). (Of course that's not what happened, she just saw me sitting across the table from a man at a restaurant. I did clarify that to Tim's parents but by that time they had already called the kids.)\n\nThe kids do understand now that I was just on a dinner date and that I've been on a handful of dates since the fall with nothing more sordid happening, but Tim's cousin certainly sensationalized everything.", "Does it make a difference if the kids are away at college - 1000+ miles away? I do talk to each of them several times a week, but there wouldn't be much of an opportunity for my kids to meet my dates in person. And again I haven't dated anyone long enough yet to even hit that one-month mark.\n\nGiven that they are busy with the own (academic and social) lives, I think I do need to tread carefully with how much I share, so as to make sure I don't add anything to their plate that would make them feel burdened or overwhelmed.", "Stranger things have happened. My sister lives in Minnesota. I live in Wisconsin. My husband and I were on a motorcycle ride and decided to stop at a restaurant in another town in Wisconsin. As I was waiting for my husband to lock the helmets in the back box, I looked at the person standing in the window of the restaurant we were headed to. I told him it looked like my sister as we crossed the street. I got to the restaurant and sure enough, it was my sister from Minnesota.", "Well yes of course she can, but the cousin saw her in a restaurant, not in a private home, and went completely off the rails because she saw OP, um, having dinner.  The reaction was completely out of proportion to the situation.", "I think the main difference is not that the other parent has passed away, but rather the age of the children of the person resuming dating.\n\nThere is no real chance that anyone you date would step into a \"new dad\" role for your kids, or that you'd wind up forming a blended household.  The most change the kids would experience would be having someone new around when they came for the occasional visit. \n\nWith little kids you want to protect them, because it's hard for little kids to repeatedly bond with and then loose the adults in their lives.\n\nWith adult children, that's not so much an issue.  But there is a greater chance that a relationship you have could be quite developed before they hear about it and meet the fellow.  The same privacy can easily blur into secrecy and learning things through gossip and family rumors.  \n\nFor kids young enough to be living with the parent, they're going to pick up on the general fact that the parent is dating, even if they don't meet any of the dates.  Things like the parent going out at dinner time or on a weekend afternoon, a night with their favorite babysitter while the parent is out, etc.  It's bonding with the specific individuals that's an issue.\n\nAdult children, living on their own, won't have those types of clues that dating is happening at all, leading to them being blindsided.  \n\nAnd as adults, they're less likely to worry about a new parental figure in their lives (and be sure to draw boundaries with people you date that they're not going to be new parental figures to your kids!) and they're more likely to be thinking \"Is this person good enough for Our Mom?\"  Just as you make the same evaluation for dates that your adult children might introduce.", "You’re welcome. And for what it’s worth, it’s not like there’s a handbook of how to handle these situations. We all just kind of muddle through and do the best we can. I think that if you’re honest with your kids that you were trying to approach it in a way that you thought would be best for them but realized it might not have been, it’ll be ok. You seem like a great mom and compassionate person.", "The cousin is a coward to not talk to you before the kids were told.  She created a seen and your kids paid the price for her selfish behavior.  There’s a difference between your moms dating and your mom is cheating on your dad.  I would make it a point to let her know that I’m a very passive aggressive way. But you don’t seem that aggressive like most of us.  This whole story just irritates me more than others.  I think you handled this the right way with good intentions.  Your kids are probably tough having had to deal with there dad and then leaving home to go out of state.  They probably get it.  It’s just drama for the cousin to be center of attention.", "This is tricky and you are correct you do not need to tell your kids your every move. Again I know I'm projecting here lol. Your husband's cousin was waaaay out of line and you certainly don't owe her or anyone, possibly a heads up to the kids, an explanation though. Do you.", "How did the cousin know that you weren’t just grabbing dinner with an old friend? Totally uncalled for and honestly it’s no one’s damn business and they need to treat you like a person with your own wants and needs.", "I meant your children, not anyone else. Frankly, I think you made it into a much bigger issue with your kids than it needed to be.", "No, the kids definitely won't be getting a \"new dad\" no matter what happens. My son is graduating from college this spring and will be attending law school in the fall (in another part of the country, not here). My daughter is just finishing her freshman year, but her post-college plans at this point also include grad school (also not in our home city). So they are both headed towards full lives in other places. Which is what I want for them as long as they are happy with those choices! \n\nBut in any event, even if I did get a new committed partner, that person would not be a part of my kids' daily lives - because the kids are now adults who have their own lives.", "Tim's cousin definitely views it as \"cheating on Tim's memory.\" Except that isn't really a thing - the vows are only \"till death do us part,\" and even if I have some obligation to conduct myself in, I don't know, a classy manner afterwards, all I was doing was having dinner with a gentleman my age at a nice restaurant. It's not like there was any hanky panky or PDA going on. We were only maybe a half hour into the date and were just talking when Tim's cousin accosted us.", "Your kids don't need a heads up every time you have dinner with someone.  Nor do they need to update you about every single outing they have with someone they might potentially want to be involved with. If you start seeing someone on a consistent basis, then mention it.", "Do your kids, their aunts, uncles, cousins etc announce to you everytime they start dating or are interested in someone? Probably, no.\n\nOP you're being viewed as your husbands property. That's how his side of the family sees you. They think that they own you.", "I mean, I understand why they’d be upset finding out from someone who isn’t you, but that’s your husband’s cousin’s fault; not yours. \n\nThat cousin should’ve kept her mouth shut and not spread rumors around because otherwise your kids would’ve found out from you. It’s honestly really gross that your late husband’s family think they have a right to your dating life. It really isn’t any of their beeswax at all. \n\nNone of this is your fault and you’re absolutely NTA.", "This is all on the cousin. Had she not taken upon herself to make public your private matters, you would've had time to figure out when and how to tell your kids. This was not her business to intervene at all although she may have had an emotional response to seeing you on a date, that's about as far she should've left it and kept her opinions to herself. While she was family and may have her own special bond, your husband's death absolutely hit your and your kids lives hardest. For her to insert herself and go publically and judgmentally announcing your personal matters is wildly inappropriate and immature. She is behaving like a child who found her mom dating after her father's passing. It likely required a herculean effort to swallow your grief to care first for your children and now you've done a wonderful job of raising your children and can now focus on yourself. I'm glad you are ready to explore the possibility of finding someone to share the remainder of your life. That's nothing to be ashamed of. If anything, cousin should be ashamed for her inappropriate conduct and she should be the one apologizing. Don't worry about them, OP. Wish only the best for you and much happiness.", "Yeah, definitely not. A few extended family members are active on social media and seem to document every aspect of their social lives, but for the most part, romantic connections fly under the radar until they become more serious. Even with my own kids, they have told me about their committed partners (my son is on his third relationship that I know about, and my daughter on her second - she broke up with her high school boyfriend last year, and recently started seeing someone new in college) but I'm sure they have been on plenty of other dates. And maybe even hookup-type encounters, not that I want to think about all the details, but they are adults and it's their business as long as they're safe.\n\nIn retrospect, Tim's family did always treat me as an accessory instead of as my own person, so it's not surprising they would continue to do so long after his passing.", "NTA. You focused on your kids after your husband died and now they’re off being successful. If anything, I think it’s better you didn’t tell your kids. Not until you actually meet someone your serious with. Your children very likely have “daddy” issues, so it wouldn’t be good for them to hear about you dating random dudes, it’d be better if they knew you were with someone who loved and cared about you. As for your in laws, you don’t owe them shit. Your late husbands cousin is clearly a pot stirrer, if I were you I would try to cut her out of you and your children’s lives.", "NTA- I was honestly expecting something a lot more risqué than being caught out at dinner by an extended family member. I can imagine those last years of marriage were really tough and probably not a real partnership where you could lean on eachother. After five years you deserve to enjoy yourself especially since your kids are grown. \n\nMy uncle passed away and when his wife started dating again some family members of mine treated her horribly. You deserve to be happy again. You could have another 40 years to spend with someone. Enjoy it.", "You are definitely NTA. You don't owe anyone any explanation about your life and how you see fit to live it. \n\nCalling your kids is a huge AH move. Calling all of these other people? Another huge AH move. \n\nThe only people in this scenario that I'd even think about telling would be my children, but even then,  you're still NTA for not telling them.", "NTA it's your decision when and how you tell people. \n\nMy personal opinion would be to tell the children tbh, maybe the MIL/FIL, but that's it. What the cousin did was a major AH move. To disrupt your date and then calling everyone behind your back...the cousin really needs to think about her/his actions. Wow.", "NTA.", "YTA for not telling your kids but NTA for not telling anyone else.\n\nI feel like, at the very least, a heads up to the kids would be nice. I know they’re adults away at college and you don’t necessarily HAVE to tell them but morally my opinion is you should have. Everyone else can just butt out.", "NTA. You don't owe your late husband's family or anyone else for that matter, anything.", "NTA! You’re a widow of 5 years. Your children are not small and you did everything you could to support them following the death of your husband. You don’t owe anyone any explanation as to your dating life. If there’s anyone to have a conversation with, it would be your children but again, that isn’t anyone else’s business! \n\nYou aren’t moving on from anything. You’re living your life. You’re were widowed, you didn’t die. You did nothing wrong and I wish you the best in this new phase of your life.", "Man, Tim's family sounds terrible.  \nNTA.", "Honestly the only ones that matter are your kids. Ask them how they feel, and then explain you didn’t want to talk about it unless something serious happened. You thought it would gross them out to talk about your dating life (even if that’s a lie). After all I doubt you hound them for every failed first date \n\nNta", "NTA unfortunately, I lost my father as a teenager, so it might not be the same circumstances as your life, but I feel my opinion is valid here. My mother did start dating again a little over a year after my father passed, when I and my younger brother found out we were actually happy for her. We knew we would never get a new “father” but what we were concerned about was her being alone for the rest of her life. She has since stopped dating which I am sorry for her, but it’s her life and all I want for her and you is to be loved and happy. \n\nPlease sit down with your kids and remind them that you are not and could not replace their father, everyone else can fluff off. And if they won’t send them my way, I can prepare a few choice words for them. \n\nIf you want to be way more generous than they have any right to have, you can let them know that your life was destroyed when your husband passed away and you will always love him, but you arnt dead and deserve some sort of happiness and that they are not entitled to know about it and definitely not entitled to an opinion. If they can’t handle that, they can support you by not being part of your life. \n\nMany hugs. Do not worry you did nothing wrong and in my opinion doing something positive for yourself. This is the exact advice I have given my mother.", "NTA. You owe no one an explanation. It’s your life and you should be happy too.", "NTA. My beloved neice died of cancer and 2 years later I heard her husband was starting to date. I was saddened but I asked myself what would I have told her if he was the one to pass. I would have told her we want to be alive to live. And having love is part of living well.", "Oh dear, I have second hand anger for you. I would have read Tim’s cousin and parents the riot act for telling my children. It is so incredibly inappropriate and inconsiderate…. There would have been a severe consequences for such an egregious laps in judgement. YOU should be the one to tell your children, in your time. Tim’s cousin is a selfish prick. Nta", "NTA  You grieved long enough for propriety and for yourself.  You don't have to tell anyone what is going on in your private life until it's pertinent.  Good luck.", "So it's been at least 4 years since he died and they still feel entitled to control your personal life? NTA", "NTA. Dating again after the death of a spouse is a vulnerable and private thing. That is even more so when you’ve had as painful and complicated a second half of marriage as you must have had. You are not betraying anyone and you didn’t owe anyone a heads up - not even your own children,  certainly not this outrageously rude and interfering cousin. \n\nYou had every right to keep this private aspect of a new chapter of your life to yourself until you felt you had something meaningful to share. And frankly, hysterical and unreasonable attitudes about ‘betrayal’ of husband who has been dead for 5 years and who you stood by in difficult times when many would not, are a good enough reason not to have wanted to tell people right away.", "To Tim’s cousin:\n\n“Who the F do you think you are? And why the F do I owe you or ANYONE a report or explanation of MY activities?\n\nDoes ‘till death do us part’ sound familiar? You called Tim’s parents and involved MY children. F you!\n\nDo not be defensive. \n\nNTA", "NTA, your family needs to learn boundaries. \n\nTheir expectations of you have nothing to do with you, and the feelings they’re experiencing are due to whatever they have going on in their heads. \n\nYou don’t have anything to do with the version of you they created in their heads.", "NTA. You have been a widow for 5 years and only middle aged. Stats say you about 30 years left of life. That's 30 more summers that you don't want to spend without a romantic partner. Would a heads up been nice for your kids and in-laws? Sure but given this reaction they had it seems doubtful they would have taken the news well anyway.", "NTA.  For the reasons you stated.  It is your life.  If you found someone you were interested in for more than just a couple of dates, but since you haven't, there was no reason to tell anybody (except maybe a close friend for safety reasons who can keep tabs on you while you are on said dates with people you meet from an app).", "NTA.  You should tell Luke and Beth that you're starting to date again because it's important to model thriving after tragedy to your kids.  You should also tell the rest of those people to fuck right off because it's important to model healthy boundaries to your kids.", "Make it right with your kids. Ignore anyone else, they should be ashamed of themselves. \n\nNTA", "Wow, NTA it’s been 5yrs not two weeks. It was one date and there was nothing to say. You’re not a child who needs to tell everyone what they are doing.", "I’m so sorry your privacy and your autonomy was disrespected in this manner. You deserved your space and your freedom to explore and your husband‘s family made it all about them and their grief. It was despicable.  \n\nGoing on you need to sit down and have a talk with them. Tell them if you’re still grieving you understand and you will not wave your relationship in their face, but Your dating life is no longer their business. Tell them you won’t hide if they ask about how you’re doing if you’re dating again but you won’t go and report to them your every move. Firm boundaries.  With your family, kids and everyone who thinks that you’re dating life is part of their business.\n\nNTA", "It is none of their business. NTA.", "FFS, it's been five years since Tim passed, it's absurd that they would be angry, and no, you don't owe them a heads up AT ALL.", "NTA. You devoted yourself to your children after becoming a widow and didn't date until they both graduated high school and moved on to college. Not everyone would sacrifice having a personal life even under those circumstances. I commend you for it. It sounds like your kids got all the attention and support they needed. Single parenting is an extremely tough job, especially to grieving kids. You deserve respect for that. Instead you get abuse, being yelled at in public and torn down by your late husband's family? Did they expect you to stay in a formal state of mourning for the rest of your life? It's just plain weird. I don't blame you for not mentioning it to your kids. Like you said, they're away at school and you thought you could have some privacy. Maybe you should have said something, but honestly, this is one of those parenting decisions where you could flip a coin and go with either approach. Some kids might get annoyed and prefer not to know about their mom going on dates. You did nothing wrong.", "NTA, they didn't need a heads up about what you do with your life, Tim's cousin should have minded her damned business, and 1. Not make a scene, and 2. Not blast you to everyone else. I understand your kids being upset that they found out from someone else, but that's the thing, they would have found out from you when you were ready to tell them if the cousin kept her mouth shut.", "The AH is the one who confronted you to start with!!!", "NTA you’re a grown woman and you don’t owe anyone an explanation.", "I'm glad this wasn't a business meeting. Your husband's cousin had no reason to confront you. Five years is more than respectable for mourning. NTA", "NTA", "NTA", "NTA but that would be startling but NOT ENOUGH TO MAKE A SCENE AND SAY YOU BETRAYED SOMEONE WHO OVERDOSED?????", "NTA. That cousin sounds annoying as shit. You're a grown up doing grown up things. You deserve to live life to the fullest. I've already told my wife that if I passed before her, she should do whatever she wanted. If that means her finding new love, I support her decision 100%.", "Your private life is… *drumroll* private! You have zero obligation to anyone to talk about if you are dating or not. Not a single person in your life needs a ”heads up”, its not about them and it will never be. Im so sorry about your husband, but im glad to hear your kids have been doing well and im super happy that you are out dating again. I wish you all the best!\n\nSuper NTA", "NTA. this is the same as outing someone to their relatives. i get the kids being upset, like \"ma i cant believe youve moved on. i havent.\" what i dont get is why the extended family is upset too. like, are they jealous you're getting some excitement after all that?", "NTA. Apparently your former in-laws expected you to never move on from their relative. Probably because they put him on a pedestal he shouldn't be on. That can happen when we loose someone we love. The only 2 I feel you should have let know you were going to try dating again were your kids. Why, because they're your kids. If they're mature adults they would understand and be supportive. You didn't give them that chance. They heard it from everyone else in the worst light possible. I know how your kids feel on a personal level. My Mom moved on after 2 months after my Father died. She told us she was going to start trying to date 8 months after he passed. We were cool with it until we found out she lied about the time frame. She was seeing our future step-father for 6 of those months. It was a shock and betrayal big time. Not the fact that she was dating, but the fact that she didn't tell us and chose to lie about it. Omission is a lie. I realize it's been 5 years. You didn't rush things. You are right to not hold the candle and vigil for Tim forever. You have the right to love again. Go for it. All I'm saying is you should have let the kids know first. Then if they weren't the mature adults you worked so hard to raise, you could work from that with them- as a family. You need to talk to your kids, have a frank and open discussion with them. You don't owe Tim's family ANY explanation. When it comes right down to it, they aren't family anymore except emotionally.", "NTA\n\nYou don't need anyone's permission to date. Your husband is dead. You're vows say that death will part you, and it has. As you said, it's one thing if you were in a more serious situation, but you are only casually dating at the moment. That cousin of Tim's deserves a serious verbal lashing for not only imparting themselves during you date, but also going to everyone else. I would make a public post online and tell anyone who wants to tell you how to run your dating and sex life must first tell you about their love life and sex life, otherwise, they can f\\*\\*\\* off.", "What, do they expect you to be like fucking Rose in Titanic?\n\n>It's been 84 years....\n\nIt's been 3 YEARS, and more importantly, it's your life. \n\nNTA.", "OP, do a mass FB post. Talk about how lived your husband was by you, but it has been years, and if they cannot support you dating or not, they will be blocked fully.  Then do it.  You did a great job with your family.  You did good.  You need no permission. Your kids, have an adult talk with them, point out they do not clear their dates with you or you them if they say one word.  Ask how long you are supposed to wait, then hand them logic.  This is a them problem., Be kind but firm.", "Fellow widow here….NTA!!!! You don’t owe anyone, anything! It won’t affect how your children are raised anymore. You aren’t looking for a new son or brother or cousin for the family. Your private life is private and that cousin should have kept their mouth shut. Try to remember that their reaction is a product of their own grief and not your job to take on their grief.", "NTA. It's irrelevant if it never gets past first dates. It's only important if it actually becomes something.  And you aren't betraying anyone, you are allowed to move on and tell people when you are ready", "As a widow, I told my deceased partner's mother (who I remain on excellent terms with) and that was it. And I still only told her after there was something to tell. A few random dates that don't go anywhere aren't changes to what's going on to the lives of other people. I was a little worried about how other people might take it, but honestly, I just really didn't want anybody else involved until I'd figured it out myself. \nIf you've never been through it it is very hard to convey how entitled to being involved in your life after being widowed other people think they are. It is astonishing how many people after my partner died decided they needed to be involved in every action I took afterwards. I want to be charitable and say that it is because they wanted to retain any piece of my partner they could cling to in their grief, which definitely made me the main focus, but going through it was horrible. I was already an introvert before he died, but that experience (not just his death but other people's reactions to me and continued barging into my life and involving themselves with my choices and path) nearly made me a complete recluse.", "It appears as if they expect she will be alone and grieving forever, that was soooooo mean. She is trying to get a life and they have invaded her privacy, horrible horrible people.", "She even mentioned these were casual dates. It’s not like she was in a full blown relationship and just not telling anyone (her kids really). I wouldn’t really care to know about a ton of casual one or two time dates my mom had been on.", "Yes, that's exactly it - I thought it would make them upset/anxious for really no reason, and also be a bit of TMI, to tell them specifics about dates that didn't mean anything. I do believe I took that too far by not telling them that, in general, I was starting to go out on a few dates, but I had the best of intentions, to try to figure out this dating thing, something I hadn't done in over 25 years, without involving the kids emotionally.", "Thanks! For safety reasons, I do tell at least one friend when I am going on a first date with a new person.", "You're exactly right in thinking that way. I'm about your age, and dating is tough. You could go on 50 dates and only end up with  with 50 meals with strangers that range from painful to mildly entertaining and nothing else. Unless something grows from that, I would see no reason to tell anyone of it. Especially since meeting people you don't know is emotionally exhausting all by itself, much less adding having to give a summary report about it to everyone you know.  \n\nAlso, you're cousin's a real asshole.", "No, don’t change your mind.  You dating is none of your kids business until you decide it is.  If the guy/gal isn’t moving in or showing up to family events, it is not their concern.  They may want a heads up, but wants aren’t rights in this case.  They don’t have a right to your private life at their age.", "I think that your kids deserve a bit of a non-apology from you — an “I’m sorry you didn’t find out from me.” Reassure them that you had planned on telling them as soon as you progressed past the ‘first dates’ stage and into genuine connection (you *did* plan on doing that right?) This should be a conversation focused on the adult relationship you’re clearly cultivating with your children, but needs to take into account the fact that they’re still, in many ways, your *children* and not independent adults — not least of which is that they probably still are financially dependent on you and live in the family home on breaks. \n\nThey need to know that you’re not trying to keep them in the dark, them finding out from a cousin surely caused them to doubt what their family life and support will look like in the future. Just let them know that whenever there’s something to share, you’ll share it, and be prepared to introduce them to future partners.\n\nNTA.", "Yes - I have already apologized for not giving them a general heads-up about dating - and explained that I have been on a handful of dates, but haven't really connected with anyone yet. That there didn't seem to be anything noteworthy to share given that I haven't made an ongoing romantic connection yet - but that of course I would share if I actually got into a relationship.\n\nThe kids have already accepted my apology and have just said (understandably) that it will take them a little while to get used to the idea of me dating again.", "NTA. You don't owe anything to Tim's family, especially if they didn't see you as anything more as Tim's wife and caregiver."]}