{"id": 12489, "submission_id": "11tccig", "title": "AITA for not wanting to split stuff by income?", "selftext": "I’ve been a lurker for a hot minute and I never thought I’d post here but I feel like I’m going insane.\nI (24, f) and my bf (25, m) have been together since our senior year in college. We come from different backgrounds where his family was comfortable middle class/edging more towards the poverty line with inflation. My family has always struggled. We are immigrants and so I have a very strong work ethic. I’m also an introvert and don’t have many friends. While I was in college I worked two jobs, one was remote which helped a lot because I would do homework while working. I got a job in my field right out of college paying high 5 figures and decided to continue working the remote job I had during college. It brings me an extra $1200 - $1500 a month working 10-25 hours a week and it’s easy to do.\n\nMe and my boyfriend just moved in together. I asked him to sit with me to budget. We have three trips we want to take this year. Two small ones for birthdays and a big one for our anniversary so we needed to figure out what was going on money wise.\n\nThe first thing he asked was how we were splitting bills. I said 50/50 obviously. He said that wasn’t fair because I make a lot more than him. I reminded him that most of that comes from my second job and I didn’t think it was fair to count it because he could also work a second job if he wanted more money. He said it wasn’t fair to only count some of my income and not all when making the budget because he’s putting all his money into our future while I get to keep some of mine for myself. I don’t think this is fair at all. \n\nI don’t make more money because of my career or because I got lucky, I literally work 10-25 extra hours a week to have this money and I save all the money I make from this job. Plus we’re not married, we’re only dating right now and for all I know he could break up with me tomorrow and I would have poured my hard work and money down a well. He thinks if we take x amount out of my full salary then we have to do the same for him because he shouldn’t be punished for “not being a workaholic.” I told him it’s 50/50 or I break the lease and go back to living alone which I can afford to do very comfortably while still saving for my future and we can revisit this convo if/when we get engaged and plan to start a family.\n\nAm I wrong? I’m already so emotionally invested in him and I feel like this is asking too much before he makes a full commitment to me/vice versa.\nAITA?", "created_utc": 1679014256, "permalink": "/r/AmItheAsshole/comments/11tccig/aita_for_not_wanting_to_split_stuff_by_income/", "score": 209, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We are building a life together and I guess it might be unfair to keep $15,000 ish a year to myself that he doesn’t get to benefit from as a unit.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info:\nAre you willing to live at the standard his budget can set? Then 50/50 is fair but if you want a higher stand of living then you should pay for the difference. \n\nIt's not fair for him to be maxed out to keep up with the lifestyle you can afford. Even if he can afford it technically but he would have no money left over. You both have a right to set your own budget based on your own prioties. \nIf the roles were reversed all these people saying \"keep your money girl\" would be saying he needs to pay up. \n\nNow if he is the one pushing for all the extras because he sees you making more, then he is the asshole.", "NTA. It's 50/50 or he can fuck off. If he didn't have the capacity to earn more money the story would be different but he's just asking you to subsidize his laziness.", "INFO: does he pick up a disproportionate share of the chores while you're working your second job?\n\nDid you choose the place with his budget in mind?", "NTA  \nI love your shiny to the point spine!!  \n\"I told him it’s 50/50 or I break the lease and go back to living alone which I can afford to do very comfortably while still saving for my future and we can revisit this convo if/when we get engaged and plan to start a family.\"", "NTA. Usually I think couples should split things proportionally, but your situation is different for the two reasons you stated in your post: \n\n1) You literally work longer hours than he does and have multiple streams of income. It’s not like you’re a lawyer and he’s a teacher both working 40 hrs a week. You were right on the money (no pun intended) when you said he could ALSO get a second job if he wanted more income. He just doesn’t want to because he wants to passively benefit from your extra work. \n\n2) You just moved in together, are still pretty young and aren’t engaged or married. The commitment is still low-level. (Not to minimize your 2-3 year relationship but you’re right that he isn’t bound to you in any way legally or financially. What you give him right now is pretty much a free donation.) \n\nHe wants wife behavior with gf commitment. No.", "So you are suggesting you split based off both your first job/40hr work week incomes? Are they similar? If so, NTA I think that’s fair. 10-25 extra hours on top of 40 hours a week at a 2nd job is extra and shouldn’t be counted. You’re putting in the work and sacrificing quite a bit of free time to do that. It’s just just excess.\n\nIf you both worked 1 job full time and he made a third of what you make or something, then I’d question 50/50 a little bit.", "ESH, because you moved in together without figuring all this out in advance. \n\nForget fair/unfair. You're just dating, not even engaged, so there's no \"future together\" yet for either of you to be saving into. \n\nDon't get stuck on the idea of having already invested time and emotion here, living apart sounds like the better choice right now.", "Nta\n\nI’m not sure when this became a thing. Just because you can afford to pay more doesn’t mean you should have to.  He’s using 50% of the apt, utilities, etc.  why should he pay less than half?", "NTA, you are being very sensible.  And you are also very clear that this is a deal-breaker for you at this time.  I'm not saying splitting 50/50 is right or wrong in the abstract.  You are allowed to ask for what you need, especially when it comes to self-preservation like this.  Good for you!", "NTA.  But some folks have these discussions before moving in together to make certain they are compatible and in agreement. I am guessing you would not have moved in together had you understood this was his expectation.\n\n&#x200B;\n\nTake Good Care.", "Obviously NTA, do not let him steal your money!!\n\nYou are a total badass, I wish I was more like you. If you were married it would make sense to merge finances and pay based on income, but it’s not fair to you to have to pay more just because you make more, which you only do because you work more. Do not let him get into your head and convince you. You got this!!!", "NTA because you are not married. If you marry that’s a whole different ballgame", "Lol he literally wants you to subsidise his desire to work less!!!! NTA and your suggestion will tell you how much he values the relationship.", "ESH for the basic fact that you already moved in together and only now are discussing how to split bills. It’s way to late to only now be talking about this", "NTA, I am typically in favour of a proportional split but you’re literally working a second job. Do you expect him to do more stuff around the house because you have less time or do you do 50% of the chores?", "I think the problem is that he can’t afford the trip you want to go on. Maybe y’all need to acknowledge that and plan something reasonable for both your incomes. Is there a reason only one person is paying for furniture?", "RUUUUNNN!! RED FLAG, for sure!! You do all the work, he gets the benefits! Please reconsider your living situation. He will not now nor ever contribute more than you, in this relationship. Take heed! And be glad you found out sooner than later. Blessings regardless! Keep being a strong woman", "\"I have a very strong work ethic.\"\n\n\"I do my homework while working my remote job because they can't see what I'm doing.\"\n\nI'm pretty sure everyone who works remotely takes some liberties but the proximity of these statements was pretty funny.", "INFO- What's his income like? What is the household chores situation?", "NTA. You work overtime for your extra income, and without a full-on commitment the idea that your money should be “our” money is not fair. If you earned vastly more than him while working the same number of hours, that would be a little different, but that isn’t even close to the case. You earn a little extra for quite a bit of extra work. Those earnings are for your future, not whatever little luxuries he decides you can afford to share with him.", "NTA but you may have to take one less trip bc he won’t be able to afford it if you’re 50/50 unless you pay for him.", "Nope NTA. Protect your future", "NTA, three trips is already a lot for most people.  If he cannot afford HIS HALF then you can both take cheaper or less less trips so he can comfortably afford them. It is also not fair of you to ask him to pay what he cannot afford,  so please keep that in mind.", "NTA but ... Why did you decide to live together?  Don't you have the goal of staying for a long time with him or is it a trial ? I mean you are obviously not OK to share everything with him, meaning you don't trust him. I get that you work more for more money, but you are basically forcing him to work as much as yourself if you ask him to bring as much money as you. Either you accept that he might have different values either ask from the start for someone working as much as you do, because you're not being fair there. And why didn't you discuss this before living with him ?", "Couples who live together have different ways of sitting expenses, not always 50-50, especially if they are building futures together. It sounds like you consider yourselves more like roommates with benefits.", "NTA keep your money girl!!! He’s trying to take advantage of the fact that you’re hustling. If you were married it’d be different but yeah no he wants more of your money so he doesn’t have to work.", "I do not agree with others that state your BF is lazy, sounds like your 2nd job is pretty cush if you were able to work from home and do your homework while doing so.  Expecting him to have a 2nd job isn’t realistic. With that said, I agree 50/50 is the way to go, perhaps revisit how to split expenses if you marry.", "NTA. 50/50 is reasonable if you both work full time.", "YTA I hope he gets the fuck out of here, holy cannoli. Bless up.", "NTA. \n\nUnless he had some sort of illness or obligation that prevented him from working as many hours as you, your extra hours should not come into play for any calculation. \n\nThis sounds like it could be an ego problem. Some guys can't handle not earning the most. His problem, not yours. He has the opportunity to earn more, and its his choice not to. He doesn't get to make that choice, then use you to get the rewards anyway. \n\nJust be aware that this is a flag. Not a red one yet, but definitely hints towards one. \n\nWhat happens if in the future, you get an amazing promotion or opportunity and suddenly earn twice what he does. Would he expect you to be fine with him not contributing?\n\nAnd if you get married and decide to share finances, is he going to overspend and leave you with nothing? Sounds like he might be the type of person to feel entitled to \"shared\" money, and not care if you do all the work and get nothing from it. \n\nIf he can't treat you as an equal now, what will happen if/when you have children? Will he expect you to do more than him because you're a woman and that's your job? Or will he throw a tizzy if you suggest that you keep working and he be SAHD? Will he blame you for a reduced income when you can't work? Will he keep spending the same way, and leave nothing for you or the kids?\n\nWhat happens if you get sick or injured? Will he pick up the slack and pay more when you can't? \n\nIf he out earned you, would he really be happy to pay more? (If you're game, you could try that out and cut back on the hours. But that's manipulative and if you get to that point, the relationship likely won't work out anyway.)\n\nThese may sound wild and they might well be, but definitely something you should think about. If you dismiss these concerns, make sure it's because you've talked to him, or you truly know him and have thought about it. Not just the reflexive \"internet stranger doesn't know my life\" (I don't. I could be way off base. But think about it properly before dismissing). \n\nI got caught out by a guy like this. Started small. I earned more, so he expected me to pay for more. I earned about 30% more, so I paid about 30% more of the bills. When I lost my job, he threw a massive tantrum and still tried to spend what little money I had. He spent the $5k I got as a gift from my grandparents on his hobbies, and then managed to con me into getting a 10k loan so he could buy a ridiculous car that broke down within 3 months of purchase. \n\nI just don't want you to fall into this without realising it. I see the possible beginnings of financial abuse in your post, and wish somebody had told me to really consider the colour of the flags he was putting out when it happened to me. (My dad tried, but he's hated every one of my male partners for the simple fact that they're male, so I ignored him).", "NTA Living together means two people sharing space.\n\nHe is taking up space. 50/50 or bye bye", "Info: could he be saving up for an engagement ring? He mentioned he was saving for your future together.\n\nIf that’s the case would you consider a cheaper ring? Or contributing towards it? Rings can be very expensive and he may have planned to propose soon. Meaning his extra cash is going/went towards a ring and not the vacation", "And why are you a hard worker wasting time on someone that will be in conflict with you 24/7. He’s mediocre and you’re not. Plan and simple. He isn’t lazy but he isn’t on your level and his desire to just be that is fine but not form you . \n\nHe will try to nickel and dime you. That’s not a relationship", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’ve been a lurker for a hot minute and I never thought I’d post here but I feel like I’m going insane.\nI (24, f) and my bf (25, m) have been together since our senior year in college. We come from different backgrounds where his family was comfortable middle class/edging more towards the poverty line with inflation. My family has always struggled. We are immigrants and so I have a very strong work ethic. I’m also an introvert and don’t have many friends. While I was in college I worked two jobs, one was remote which helped a lot because I would do homework while working. I got a job in my field right out of college paying high 5 figures and decided to continue working the remote job I had during college. It brings me an extra $1200 - $1500 a month working 10-25 hours a week and it’s easy to do.\n\nMe and my boyfriend just moved in together. I asked him to sit with me to budget. We have three trips we want to take this year. Two small ones for birthdays and a big one for our anniversary so we needed to figure out what was going on money wise.\n\nThe first thing he asked was how we were splitting bills. I said 50/50 obviously. He said that wasn’t fair because I make a lot more than him. I reminded him that most of that comes from my second job and I didn’t think it was fair to count it because he could also work a second job if he wanted more money. He said it wasn’t fair to only count some of my income and not all when making the budget because he’s putting all his money into our future while I get to keep some of mine for myself. I don’t think this is fair at all. \n\nI don’t make more money because of my career or because I got lucky, I literally work 10-25 extra hours a week to have this money and I save all the money I make from this job. Plus we’re not married, we’re only dating right now and for all I know he could break up with me tomorrow and I would have poured my hard work and money down a well. He thinks if we take x amount out of my full salary then we have to do the same for him because he shouldn’t be punished for “not being a workaholic.” I told him it’s 50/50 or I break the lease and go back to living alone which I can afford to do very comfortably while still saving for my future and we can revisit this convo if/when we get engaged and plan to start a family.\n\nAm I wrong? I’m already so emotionally invested in him and I feel like this is asking too much before he makes a full commitment to me/vice versa.\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You don’t have to do this. You can also both live within his budget range and pay equally. You cannot expect him to pay a rent that is within your budget but not his though, you need to go down to his level of living.", "NTA but this should have been discussed before moving in. You’re right, you work more so you make more. He has that option. Bills should be split evenly.", "NTA.  Don't move in with this guy.", "NTA At all if the difference is indeed the extra hours you work and the housework load is shared and the income discrepancy between full time jobs with regular hours isn't big", "NTA. Spending should be proportional to resources used, not spending potential. If you were spending a ton of electricity and water on a hydroponic farm and he got no money from it, that’s a reason to split the utility bill in a different manner than 50/50. If you got two bedrooms and he got one, again a 66/33 split for rent makes sense. The “I’m lazier than you so I should pay less” argument is laughable at best, and concerning for him being a moocher for life. I think he is more committed to your money than to you, while simultaneously insulting you for having better hustle game. If he was coming from a point of concern about you, he’d say “i appreciate you working hard to make a lot of money, but I wish you would drop the second job and spend more time together”. That is not what he’s saying, he’s fine with you working hard and wants to benefit from it more than he already does!\nI agree with others he is embarrassed since you are more successful, and will take it out on you long-term.\n\nTell him 50/50 or leave. And if you marry him, get a prenuptial agreement.", "NTA, but like same time… are you really that invested into him if you can just break lease and boot him….. just saying, sounds like it may lead to further problems", "You sure don't sound like one to me. I wonder what he would think if the two of you were getting money instead and your shares were based how many hours you worked and how much money you brought in. He wouldn't like that either. You tell him 50/50 or KMA.", "50-50 is fair in that situation. Him arguing for anything else is not a good look.", "NTA.", "NTA\n\nThere isn't really much \"budgeting together\" to do , and definitely shouldn't have joint finances.  You just moved in together, so don't have the kind of truly long term relationship where you should split any expenses proportionally based on income.  But if you did split expenses proportionally, the only expense that should ever be considered to split proportionally for a little Ng term unmarried couple might be housing.  You mention that your BF wants to \"split bills\" proportionally, which implies more than just splitting rent and that's where he really veers off into being an asshole.  You working more hours doesn't mean that you use more electricity or eat more food, so he's not entitled to have you supplement those expenses.\n\nA 50/50 split is fair.  If he doesn't like that, then the two of you aren't compatible financially.", "NTA. Proportional splits are only for when both sides work the same number of hours. Not for when one works significantly less than the other out of choice (disability would be another issue).", "NAH \n\nYou are not ready to move in together.   Both 50/50 if you live at the level of the lower salary and income splitting are valid approaches but you need to agree.  You don’t want to subsidize your BF, your BF doesn’t want to subsidize you.\n\nSo let me ask you, are you living at a cheap enough level that 50/50 on the bills leaves your BF with enough money to put in savings, and have fun money?  Or are the 50/50 split taking all of the BF’s take home pay?  With a 50/50 split can he afford the trips?", "NTA, but you need to take a hard stance on this and let the results play out for themselves. If he doesn't come to his sense, I don't see the relationship being sustainable.", "There are a lot of variables here. \n\nHow disparate are your incomes? You said \"high five figures, \" so say $80k, plus the ~$21k from your second job puts you near 6 figures. If he's making $35-$40k, that's a big difference.\n\nWhat about where you're living? Are you in a nicer place because you want it and can afford it? Would he choose a similar place if he had to pay 1/2 the rent and utilities? My roomie and I choose to share a relative dump because we can easily split $1400/mo and still be able to have savings and afford to get out of the house once in a while. Paying half of a $2500/mo rental is out of the question. We could do it, but would be living on nothing but ramen and have no extra money for anything else.\n\nWhat about household chores? Does he do more of them because you spend more time working? If he's taking care of the bulk of the cleaning, laundry, dishes, etc, that should be accounted for.\n\nOr is he expecting you to foot the bill for a nicer place with no intention/capacity to increase his own earning power? Does he love you for your sugar mama potential?\n\nIn any case, it's good you're finding these things out now, before much more time and rent payments have passed.\n\nNTA.", "NTA. I don’t see no ring on your finger ;-). If you would have equal pay and your part time gig is extra icing than the guy can fuck right off and go get a 2nd job.", "NTA if he has an issue, drop him.", "Curious to know how it would pan out if you both only counted your full time regular jobs?  Frankly, your entrepreneurial spirit on a second job maybe should be completely discretionary income for you.  How would the chips fall if you only compared your regular job to his?", "NAH for having different ideas on how to budget. If you want to split things evenly then I hope you are willing to live within his budget. Rent, food, travel expenses should all be planned with his budget in mind.", "I used to work 40-45 hours at one job and 30 at another and made less than my partner working 40-60 depending on the week because his wage is higher, we did 50/50 then eventually he paid more because i carry other things for the house and horses", "NTA\n\nTime to go back to living alone", "NTA, you’re smart and don’t let him convince you otherwise.", "Nta\n\nHe’s not being punished for not being a workaholic, but is expecting you to be punished for working extra.", "Info: how is the distribution of housework?", "But did you get a place that was dependent on your extra income? Because that kinda is a factor. But if y’all got a place based on his salary than yours then still nta. \n\nI’m all for getting a place both people can afford on their own so it’s not the issue", "NTA 50/50 is completely reasonable or a general 40 hour comparison this is Bs he just wants the money for himself. He either takes it or leaves it", "NTA he’s not being punished for “not being a workaholic” he just doesn’t get to benefit from you being one ;)", "NTA because the same rules apply to him if he got a second job. He could pick up a couple of shifts bartending or as a security guard etc a week and he could keep all that money. It’s on him if he doesn’t want to go after extra money like OP has", "Nta and do not back down or compromise on the 50/50, you will regret it", "INFO: Why would you wait until **after** you moved in together to talk about this?!?", "NTA. Even if he married you this wouldn't work. You know you would hold it against him.", "INFO\n\n1. Is the conflict only over the trips or over the trips, plus the cost of daily living? \n2. The 50/50 split approach CAN fit your situation as a couple, BUT ONLY WITH one clear and very important stipulation.\n3. Since your bf earns less, what the bf can comfortably afford to spend on any shared expenses (whether it's the apartment, living expenses, and/or the two small trips and the big trip) determines the budget. You don't have to contribute more than he does, but you CANNOT demand more than he can afford.\n4. If you want a more luxurious or larger apartment, fancier or more frequent meals out, bigger/better travel plans; then it IS UP TO YOU to pay for those extras. You either decide that having them is worth it to you to pay for or that living within the means your bf can afford is more important to you. You cannot have it both ways. Neither can he - he can't want luxuries he's not willing to pay his share for either.\n5. Are you asking him to foot half the bill for things he's telling you he cannot afford? Is he trying to enjoy a lifestyle he cannot afford without extra help from you? Or even a little bit of both? That will tell you who, if anyone, is the ahole here.", "Yes I am. I was in charge of apartment searching and I used the 50/30/20 method. I took 50% of his monthly salary and took away groceries, his car payment, insurance and gas and utilities and then I searched for apartments within what was left of that portion of his income. And I still got us a pretty nice place that we could both afford. He’s not wanting to spend more per se. He said he hates the idea of not being able to keep up with me. He brought up the issue of us buying a house in the future and said it wouldn’t be fair for me to have to pay more than 50% on the down payment because I had more savings. I suggested we would wait until he could match me and he said he didn’t want to play catch up, then I suggested that I would pay more than 50% and we could have a contract stating that I had more of an ownership of the property and he got upset. Idk what to do.", "Amen. OP is not this guy's meal ticket.\n\nOP, at this stage you are roommates who are dating. You're not married. That automatically puts you into the **50/50** category. If there were three roommates you'd be at 33% each, and so on. \n\nWe split bills **proportionate to income** when it's a committed relationship, *both folks are working equally hard*, and they each have had roughly *equal opportunities.* You might find yourself here someday if BF matches your work ethic and still can't earn as much as you, but you're sure not there right now.  \n\nWe split bills **unevenly** or not at all when one person CAN'T work because of an agreed thing -- like, they are staying home raising babies, they're getting their Masters, the other person makes loads and wants to support them through illness or help them start a business-- but this has to be by mutual agreement.\n\nOP I don't understand why he said he's \"putting all of his money into our future\". What is that about? He should be saving money under his own name, just like you should be for yourself. And a budget for trips is a great idea.\n\nNTA and stick to your guns OP", "Amen to that\n\nNTA", "I’d say we do chores 50/50. He stayed at my place for 2 months waiting for my lease to be over and the chores were split pretty evenly despite me working both jobs.", "Exactly. Finances should be discussed first.", "Valid take", "OP isn’t an asshole just because they didn’t discuss this ahead of time. 50/50 is the default, the BF is the asshole for assuming OP would subsidize his lifestyle.", "It became a thing because sometimes the situation is more complicated than it is here. If the partner who works less also does more housework, thus enabling their partner to work those extra hours, their unpaid labor should be taken into account. Or if the partner who makes more doesn’t want to downgrade their lifestyle to what their partner can afford, they may prefer to pay more than 50% to get the nicer apartment. But in this case, it sounds like he is just an opportunist.", "This should only ever be a thing if you're a married couple who is keeping separate finances. And then it's because you're in a committed relationship for sure. \n\nLiving together boyfriend girlfriend is far closer to being roommates.", "I honestly don’t see the contradiction. It’s all work; she’s just hustling for herself. If the employer is satisfied with her productivity and she can get her homework done, more power to her.", "It was a call center job at the time, while I was waiting for calls did you want me to twiddle my thumbs? Or stare into space? I did homework where i could and I still took enough calls and had so many positive customer reviews that I got a promotion. You will not make me feel bad for working smarter and still working hard.", "What do you expect her to do? Twiddle her thumbs in her free time at work? That’s ridiculous. Work smart.", "I laughed at this too.", "This made me cringe too.", "He makes $5k less than my salary from my main job.\nWe’ve only lived together for a week. His lease ended before mine so he stayed with me for two months. He didn’t pay any bills because I pay my rent in advance. While we lived together he did more of the daily stuff like dishes, dinner, light dusting because I was working 12-18 hours. I did more of the deep cleaning on my off day like laundry, bathrooms, vacuuming and just deep cleaning spaces.", "Or revise the budget and not spend so much on them. Op would be the AH if she wanted nice trips but he couldn’t afford it. He shouldn’t have to be forced to work a second job to keep up with her lifestyle choices and I hope she understands that. Hopefully that is not the case though.", "Right. I agree OP is not an asshole but let’s not normalize working more than 40 hours a week as a good thing.", "Ok so it sounds like he is the asshole. You did everything for him to make sure you both have a comfortable life and sounds like he is just upset he isn't the \"bread winner\"\n\nWhen you're married (or whatever long term relationship status you want) then he can talk about pooling your income to raise both your living standards but at this point (I assume it's early if your just moving in together) I would keep things 50/50", "Hmm, maybe he doesn't like the fact that you make more than him? It doesn't sound like your incomes are too different, but that fact you have more is making him almost resource guard what he does make. Either way, I'm voting NTA.", "Sounds like he's not going to be happy unless he gets his way and you pay more.  He got an excuse for everything.  Stick to your guns.", "My partner and I split bills extremely unevenly because we moved for my job growth, to a city where he can't get paid as much, I make over 2x his salary. I have a second job instead of him because he has MS. Before, when our incomes were closer together, it was more 50/50, and will be again when we move because our incomes will be closer together. \n\nAlso we're married and have dogs together, so it's pretty committed. \n\nI would never split expenses like this for some dude I just moved in with.", "This is the way. Prior to marriage if both were working a full-time job we put an equal percentage into the bills based on our income. If I made 1000 and she made 800 I'd put 500 and she'd do 400, all cool. You're in the right here as you're doing an extra job on top of that, unless he wanted to, say, do all the housework/cooking while you worked your extra shifts.", "“Don’t cling to a mistake just because you put a lot of effort into making it.” \n\nI can see both sides here, but they’re not married and this kind of stuff usually helps to predict whether people are compatible long term. I think these two simply aren’t. It’s good that they’re fighting this out now before they make a mistake. Opposing approaches to money management can utterly destroy a relationship.", "I think it also depends on the disparity of income/spending expectations.  2 people making £30k and 40k can probably split fairly easily, a couple making £19k and £75k is harder if the higher earner wants to maintain a certain standard of living and the lower earner doesn't want to be struggling every month.", "Usually also because it would otherwise be out of budget for one party.", "I honestly don't care - I wasn't trying to make you feel bad. It just sounded funny the way it came out - you went out of your way to basically say you had a strong work ethic and then two sentences later you're talking about doing your homework at work. It was simply funny timing. Really nothing more than that.", "As I said in another comment, it was simply funny timing. \n\nHowever, if you really WANT to get into it, then the answer is that it depends on the job. She said it was a call center job. I work on software that is used in a lot of call centers and I have almost 15 years of working with the management and agent sides of call centers across the entire globe.\n\nSome call centers, particularly huge ones, just have a minimum quota and if you meet that quota, then that's all they care about as long as your CSAT scores are good. The call routing software usually distributes calls evenly based on skill, so you don't get a lot of say into how frequently you get calls. So if you're in one of those, then yeah, you find something to do between calls.\n\nOther call centers distribute calls on agent availability, and agents are supposed to handle their availability status or click a button when they are ready to receive the next call. That way the agents have time to go to the bathroom or grab lunch or take care of lengthy wrap-up, but some agents intentionally don't make themselves available as often as they are supposed to, so they can do something else.\n\nThis can be a problem because the company is literally paying you to take calls and if you're intentionally spacing out your calls to do less work, then you might get great CSAT scores for the calls you DO take but this might mean that the company has to hire another agent to keep up with the call volume.\n\nSome call centers have weighted skill-based distributions so basically you tell your supervisor if you don't have a lot of calls, and they increase the percentage of calls you get. But agents rarely say anything because they figure they're not getting paid per call, so there's no incentive to take more calls.\n\nEvery call center does things a little differently, so without knowing her specific call center policies or job contract, it's hard to say what the company expected her to do. \n\nNo matter what, the company is paying people for their time, so unless you KNOW for certain that the OP's company was okay with her doing homework, don't just assume it is ridiculous. Maybe it was fine, maybe it wasn't. \n\nI was not judging her - I was simply entertained by the timing of her sentences and how they read.", "Ouch", "I think 50-50 sounds like a more than adequate split. I was wondering if it is a situation where you make money from the second job, but he takes care of the house while you are working those extra hours. It's sounds like you split these tasks evenly (or at least, you take a portion of them and he takes another portion). NTA", "Props to you both for agreeing on what to do, building history (and raising dogs!) together, and staying committed through adversity. I hope the future is brighter for both of you  ;-)", "I appreciated the lightness of your joke. Didn’t seem judgy. Made me laugh!", "It wasn’t funny though. Ironic? Yes. Funny? Only if you were being judgmental.", "No, you aren't wrong. You are working more. So, what, he gets to work less and pay less. Not cool. Don't marry a guy that wants to wine and feels entitled.  That is taking advantage if he doesn't want to pay his half. He wouldn't say that to a normal room mate.", "NTA. My husband and I have been together for 29 years, since high school. At first, we shared one bank account and paid for bills out of that account. It caused so much stress because we forced ourselves to keep track of each others spending. We now have separate accounts and a shared one for shared living costs. I make less than he does and I contribute 40 percent of my pay, while he contributes 60 towards the shared account. I do IC or sell things in Marketplace and eBay on the side. He has a consulting business. We don't expect anything from our side jobs to be contributed, but of course wouldn't complain if it did. This works for us. We can save together, and save or spend our money that we have separately, freely. OP you are NTA. You work hard for that EXTRA money. It's not his to lay claim to.", "ESH. Just putting it out there that I’m not picking sides! You absolutely seem work hard for you money, and your side job is a nice for a little extra, but ask yourself, if the roles were reversed, would you be happy with the situation? Say you made less money than him, would you accept paying bills at 50/50? If your answer is yes, then by all means, stick with the 50/50 plan you have now, but if your answer is no, you’d expect to pay less because you make less, then I’d reevaluate my thinking if I were you.", "NTA but you shouldn't be living together. You have to discuss money ahead of time and if you don't agree, it is likely the end of things unless you both compromise. That compromise shouldn't include you working two jobs to subsidize him. If you two were just roommates, he would have to pay 50%. If he can't afford that, he should get a second job like you.", "NTA\n\nFinancial exploitation isn't pretty and sadly, that's what your BF is demanding.  The more you work, the more you get to subsidize him?  The less he works, the less he has to pay for joint and personal expenses?  No way.  \n\nAs for his argument that he shouldn't be punished for not being a workaholic -- well, neither should you!\n\nI suggest that you back slowly toward the door, clutching your credit card before your BF decides it's unfair he can't use it to equalize his spending power.", "YTA if this was the other way round, with the girl earning less, everyone would be saying the guy needs to understand that the girl earns less etc. complete double standards. I do think things should be split based on income, and that it can change. What would happen if he starts earning twice as much as you? Would you still be happy with 50/50? If you have kids and stop working to look after them, would you still want 50/50? No because it wouldn’t be fair. It’s not like he’s not working or contributing, you saying he should get a second job if he wants more money is ridiculous. You are lucky to do your school work during your working time, most jobs wouldn’t allow that", "I'm so confused. Ive seen this scenario posted time and time again and the judgement is split cost equally to what each partner earns. But for some reason because she's a woman and he's a man. He's evil and she's gotta run, red flag. Honestly this subreddit disgusts me. You don't care about equality only getting one over the other. Honestly do yourself a favour.  Quit this sub before it damages your world view. What did I expect from the degenerates of this sub. The top votes for the post are fuck this guy and she ain't his meal ticket. Imagine the downvotes if the roles were reversed. I really hate this argument of switching gender roles but the insane hypocrisy because he dares to ask for equality. We are so lost. You can't even hide your sexism. People can't even build meaningful relationships anymore. Most people have a foot out the door. Just waiting for a \"red flag\" then they sprint.  This isn't a redflag. You're just selfish and looking out for yourself. Don't be in a relationship don't live with him. Just be selfish. It'll totally help your introverted nature. They'll love you", "I came here leaning more the other way, but I have to say if his salary is in line with that of your full-time job, NTA. I think you have exactly the right idea about this.\n\n1. If he wanted to make extra income he could also get a second job\n\n2. You’re not married, so there is no protection for you if you pour more equity into this relationship than he does\n\n50/50 is what makes the most sense for your situation, and in my opinion he can take it or leave it. I’m right there with you — I’d also go back to living alone as opposed to being extorted by someone who is supposed to be my partner. Why should you sacrifice all of your hard work that you could be saving for your future (and his as well if he’s a part of it) so that he can coast by a little easier now and prepare better for his future (that you may not end up being a part of). If it were really about saving for your joint future, then he shouldn’t have any problems with you saving your money for that in your own account while you split bills equally. After all, if he fully intended to be a part of that future, you’re inevitably going to spend that money on your joint goals anyway, right?", "NTA.   Why is he expecting you to pay his expenses?  You aren’t even married.", "NTA but can I ask what the extra job is? Cause I'm looking for a similar grind", "NTA. Hes looking for an almost free ride. You arent married, you don't have children. You're suggestion on what happens if he wont pay his share is golden and you should definitely follow through with that. Stand your ground. Don't be taken for a fool.", "I wouldn't say he's asking her to \"subsidize his laziness\" if he's working a full time job. That's not lazy. OP is just going above and beyond with how much she works. Which is obviously totally fine! If she's happy with it, then that's great.\n\nI would absolutely call him greedy and entitled though! He has no claim to the money she works extra for.", "I think OP is NTA but I do agree with you that it's shocking that they moved in together without discussing finances. That being said, I don't know where the BF gets off thinking it would be anything other than 50/50", "These are not bills that necessarily need to talked about beforehand. In her other comments, she has said that they split all things 50/50 be it chores, rent, utilities, eultc.  So, she would not be wrong in assuming that their trips expense would be the same way too. NTA\n\nAlso, she is putting an extra effort to earn that part time money. Her boyfriend could also do the same if he is so jealous of her extra savings.", "Omg too many people here are calling bf lazy for only having one job. Who tf is commenting today??", "Jfc calm down.", "And I think the key factor here is that you are both happy with this arrangement. OP doesn't owe this guy anything in this regard. NTA!", "I agree. For a relatively small income disparity between unmarried couples, it should be 50/50 or close to it. For a large income disparity, the higher earner either needs to bring their standard of living down to what the lower earner can afford or foot more of the bill. One person shouldn’t be struggling to pay bills while the other is living the high life in a relationship, that doesn’t work.", "Well according to most commenters here, the £19k person is just \"lazy and shouldnt have their lifestyle subsidized\"", "I dunno, utilising time efficiently to be more productive sounds exactly like something which could be described as having a work ethic... \"Time theft\" shouldn't be something considered unethical imo.", "She could do homework if she was sitting in a call center. I have worked at a few call centers when I was younger. Tech support at Apple didn't even care about what I was doing as long as I wasn't surfing the internet. If the job cares so much about trivial things like that , then it's definitely not a place where one would experience job growth.", "Yeah, I'm also kinda reacting to the \"he's lazy\" comments. I don't think \"only\" working a full time job is lazy.\n\nThat being said, I don't think he should feel entitled to the money OP earns for working a second job. Seems a bit greedy to me."]}