{"id": 12516, "submission_id": "11trxqv", "title": "AITA - Refusing to cook", "selftext": "I (41F) live with my husband (41M) and daughters (10, 17). Husband is a picky eater, which I've known about for 20 years.\n\nI'm used to making food and having husband and/or kids making faces, gagging, taking an hour to pick at a single serving, or just outright refusing to eat. My husband is notorious for coming home from work, taking one look at the dinner I've made, and opting for a frozen pizza.\n\nMost of the meals I make cater to their specific wants. Like spaghetti: 10F only eats the plain noodles. 17F eats the noodles with a scrambled egg on top, no sauce. Husband only eats noodles with a specific brand of tomato sauce with ground beef in it. If I use any other sauce (even homemade) I'm going to be eating leftovers for a week. So it's just the one recipe of spaghetti.\n\nThese days, husband complains that we have a lot of the same meals, over and over. It's true, but when I've explained WHY that's true, it doesn't seem to sink in. I can only make a few things that everyone in the family will reliably eat and those get old.\n\nA couple of nights ago I made a shepherd's pie. I used a new recipe with seasoned ground beef (3/3 like), peas (2/3 like), and tomatoes (1/3 like, 1/3 tolerate) with a turmeric-mashed potato top layer (2/3 will eat mashed potato). Predictably, 10F ate a single bite then gagged and ended up throwing hers away. 17F ate part of a single bowl then put hers in the trash. Husband came home late and \"wasn't hungry\".\n\nI was so tired of reactions to my food and putting in the effort for YEARS and it all finally came down on me at once. I burst into tears and cried all night and the next morning.\n\nSo I told my husband that I was done cooking. From here on out, HE would be responsible for evening meals. I would still do breakfast for the girls, and lunch when they weren't in school but otherwise it was up to him.\n\nHe said \"what about when I work late?\". I told him he needed to figure it out. I told him that between him and the girls, I no longer found any joy in cooking and baking, that I hated the way he and the girls made me feel when they reacted to my food, that I was tired of the \"yuck faces\" and refusals to eat when I made something new and that it broke my heart EVERY time.\n\nThis morning, he had to work, so he got up early to do some meal prep. He was clearly angry. He said he doesn't understand why \"\\[I\\] said I hated him\". He said he \"doesn't know what to do\" and thinks I'm being unfair and punishing him. He said I make things that \"don't appeal to kids\" sometimes and I can't expect them to like it when I make Greek-style lemon-chicken soup (17F enjoyed it, 10F and husband hated it). I countered that I make PLENTY of chicken nuggets, mac & cheese, grilled cheese, etc but that picky or not, there's such a thing as respect for a person's efforts.\n\nSo, Reddit: AITA?", "created_utc": 1679061658, "permalink": "/r/AmItheAsshole/comments/11trxqv/aita_refusing_to_cook/", "score": 662, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be TA for suddenly dumping a major chore onto my husband. We both work, but he works longer hours so being made to cook dinner makes a huge impact in his schedule.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Of course NTA. OP you have the patience of a saint to have cooked all these years and put up with their dismissive comments. They have to experience what it is like to have to sort out their own meals, to everyone's liking. Then maybe they will be more appreciative of your efforts.", "If he can afford to be that picky, he needs to cater to himself. You’re not a short-order cook, and no one is helping you. NTA. He knows what things he will eat; he should also know how to prepare them, not just how to make faces at what you prepare.", "NTA at all!!\n\nLots of people would’ve refused to cook anymore, except maybe for the youngest, years ago. \n\nHe’s a grown-up, he can figure it out and potentially deal with the same frustration you have faced all these years. Good luck to him.", "17 year old needs to learn to cook. When she goes to college or out into the world nobody is going to give a damn about her picky eating habits. She will shop/cook or starve.", "NTA. Since your husband is so picky, he should man up and cook for himself and the kids. Better yet, get the 17 year old to start cooking her own meals too. \n\nI’d personally tell him if I was around that he and the children caused this and they reap what they sow. \n\nDo not cook for them again until it sinks in.", "NTA went through this with my husband and I stopped cooking for him - best decision ever.  I started making double of what I eat , he was given the choice of eat what's there or cook it yourself - if he doesn't eat it leftovers for me. He got tired of peanut butter sandwiches and started eating what I eat. If he complained I just said then don't eat it. He decided it was easier to not be picky and he now cooks in turn. Make what you want, put it down and if they hate it they can make it themselves- but you'll probably have to have a back up for the 10 yr old. And the 10 yr old is most likely following dad's example - stop catering to them!", "Absolutely NTA. They are all perfectly capable of preparing their own food and cleaning up after themselves in the kitchen. My husband will eat just about anything but my children learned quickly if they didn't like what I prepared for dinner, they were free to have a bowl of cereal. I was preparing one meal, not three.", "NTA.\n\nYou've sucked it up for years while they acted like you were going to poison them. They're all old enough to cook. (Yes, the 10YO as well, under supervision.) Let them make meals for a while.", "NTA. You have had the patience of a saint. Enough's enough already!", "NTA. \n\nThis was exhausting and irritating to just READ, I can't imagine actually *living* it. \n\nI would've done this years ago, honestly. And it's not even that they're picky, really, it's that they're so damn rude about it AND your husband has the audacity to complain about the lack of variety in the meals. \n\nNo, it's time for him to deal with feeding the the picky eaters in the house including himself. I suggest you start finding some delicious recipes for two for you to make, so you can cook and eat exactly what you want with a meal leftover, and no worries about feeding your ungrateful family.", "NTA.  This is a very difficult situation.  I'm sure you know the advice that you put the food out, and the children at the table choose what to eat.  \n\n\nIt's really disenheartening to make an effort to cook, and then have the food get rejected.  \n\n\nThere are several issues here:  \n\n\n1. no one should be gagging or otherwise rude about the food being served.  If they don't like it, they don't have to eat it, but they need to be polite.\n2. Everyone in the household needs to help with meal prep.  Your husband is a grown ass adult, and he needs to be able to prepare a few meals.  The children are old enough to start helping with making dinner.  The 17 year old will be an adult soon, and should absolutely be able to make a complete meal, without much supervision.  The ten year old should be able to do a lot of the steps.\n\nLuckily, there's a solution to all of these problems.  You are no longer the cook for the family.  Instead, the family is going to have a schedule by which everyone in the house will make dinner once or twice per week.\n\nThey're going to be 100% accountable for that one or two dinners.  That means that on Sunday, there's going to be a family meeting.  Everyone will put their food needs on the shopping list, so that whatever they need will be stocked.  You will also buy a few emergency back up items (bread, peanut butter, yogurt, etc.) so that everyone has \\*something\\* they can fall back to, if they absolutely cannot eat what is on offer.  \n\n\nAdditionally, whoever cooks dinner is not the person who cleans up.    \n\n\nGet a big ol' wall calendar, and you can either let people sign up for the days they want to do dinner, or you can literally roll dice to assign it.  \n\n\nEither way, you are no longer a short order cook in this family.  \n\n\n(The suggestion I'm making here was implemented by a single dad and his two 11 year old sons, and those boys grew into adults who knew how to cook and how to clean up a kitchen.)", "NTA. You have more patience than me. I can't believe your husband complained about not having variety in his meals.  Everyone can cook something. If you eat and  read you can follow a basic recipe. It may take a few tries but it's possible.\nTeaching your kids and husband to cook for themselves is not a bad thing.\n\nI would buy frozen food for them to eat and cook for just myself.", "NTA. My 14 year old was an insanely picky eater and I spent a decade cooking gross basic food and lost all the joy of cooking. When he turned 13 I laid down the law - I cook what I like and every meal will have one basic element that I know he likes. If he's too picky to eat the rest of dinner he can make a sandwich or cup of noodles or have fruit. It took a few months and now he eats without complaint. You are a couple decades late doing this for your husband, but he is capable of learning. \n\nIf you can afford it, make the meals you want but enough for everyone. I think after a few weeks of whatever bland ass crap your husband manages to pull together, people will slowly drift towards your cooking.", "My sibs and I (mostly boys) could cook before we were 17. We each had things we liked to make, and together we could make a meal. Mom (who was a very good,  from scratch cook) let us have at it. She had been the baby of the family and her big brothers didn't want to eat her cooking, so she learned to cook after she got married.", "Good Christ NTA everyone is old enough to make their own damn food at this point. You're their mom and wife not a short order cook.", "NTA. I can understand why you’d be fed up. \n\nI don’t understand your husband’s complaint about “what if I work late?” He already has no problem pulling a pizza out of the freezer when he gets home from work. He just doesn’t want the responsibility. \n\nAlso - treat yourself. Go away for a weekend, by yourself or with a friend. It doesn’t have to be lavish. But you need to do something for YOU. This will also let your family get a sense of what it’s like cooking for them.", "Why are you coddling these people? The children are going to grow up to be unbearable just like your husband. Cook whatever you want, and if they don't like it, they can be fuckin hungry. NTA.", "Without detail, I'm leaning toward NTA.\n\nHubs and 17f can absolutely cook for themselves at this point, and unless you don't work at all, and you are the homemaker for your family, the OTHER PARENT has some feeding responsibilities towards their picky-eating children themselves. \n\nDetails I'm interested in are you and your husband's work schedules and other household/family chores, INCLUDING any child care/transport. If you're a f/t homemaker, I do view not cooking as not doing part of your job, but if you have ANY outside employment your husband shouldn't put the entire burden of cooking on you.", "NTA all power to you.", "NTA. You’re still doing breakfast and lunch for your children, so it’s not as if you’re making him do ALL the cooking.\n\nOut of curiosity, what’s your “policy” when your husband or kids doesn’t want to eat the meal you’ve made? Some parents make their kids eat what’s on the plate, others don’t, etc. My parents would be fine if I didn’t eat what they made as long as I took care of what I was going to eat instead.\n\nI feel bad because I’ve been a picky eater too, especially when younger, and also often didn’t eat the meals my mom made. I tried to keep her feelings from getting hurt, but did I? I tried, but still… I’d usually try a bite of it at least, and if I didn’t like it (she’d often ask), I’d say something like “I can tell it’s a good [whatever dish it was], but it’s just that I don’t like [that dish, or some characteristic of it like being super spicy, etc.].” (Meaning that for someone who liked that dish, they would love it; it wasn’t how she made the food that was the problem, it was just the dish itself.)\n\nI wouldn’t it throw away however. I’d let someone else have it, and I might say “At least this way there’s more for you (who like it),” as in, the food will be eaten by someone who likes it this way. \n\nWe reached a sort of compromise: I didn’t complain about what she made and she didn’t have to make dishes that I’d like (for example, it was fine for her to make seafood even though we both know that’s something I don’t like), and she wouldn’t “force” me to learn to love what she made. (Example: when she made seafood, she didn’t force me to eat any of it).\n\nAs for the faces your kids make, I would (if you haven’t said it to them before) tell them that it hurts your feelings when they do that. Since their dad does it too, they might not realize that you’re not okay with it. Not that it’s an excuse but it may help going forward.", "NTA.  I flat out refuse to cook for this same exact reason.  I haven't cooked for months now and believe me your point will get across.", "NTA. One of my kids is a picky eater. He had to be taught not to be rude about it.", "NTA. Barring any sensory issues from your children --and it doesn't sound like this is the case--this is 100% a learned behaviour from your husband. His behaviour caused this problem, he can put in the effort to solve it, especially with the level of disrespect he's given you.", "Nta the first time they gagged and were rude, they would have gotten a warning. After that,  they would be getting pb and j sandwiches the rest of the week.\n\nI honestly can not believe it took you this long to be fed up with their behavior!  \n\nThe fact that he thinks cooking is a *punishment* makes him an even bigger ah. You've cooked for years, was all of that a punishment for you????", "NTA idk how you lasted this long OP. I have a \"won't eat vegetables in any form\" at home and I honestly made him cook for himself as soon as I realized I wasn't gunna be able to flex my favorite skill. He works at a restaurant so I didn't leave him floundering. You have the patience of a Saint.", "NTA. Your whole family needs to get cooking. Unless having a sit down, family meal every night is important to you, I’d let everyone fend for themselves. This sounds like a nightmare", "NTA\n\nThis made me so sad to read because it reminded me about my long-time friend, her husband every meal without fail will taste the food she prepares and makes a face, Every Time. She offers to make him a different meal and he says no but acts like a martyr while finishing his food.\nMy friend cries in the shower so he and their sons don't hear her, pretty sure husband is verbally abusive in other ways but she says very little about it, for her to tell me that story it must have been  a heavy load and she told me.\n\nOp, I am so sorry they are so cruel about your cooking, let them fix their own dinners.", "NTA even one tiny bit! I'm right there with you! So tired of making toddler food for my whiny family! I'm an adult! I like to eat grown-up food. I've decided to cook only foid that -*I* want to eat. Either they eat it or I'll pack it for lunches all week, but I'm no longer catering to their picky, toddler palates. BTW, my kids range from 12-19 and my husband is just as bad as yours sounds.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (41F) live with my husband (41M) and daughters (10, 17). Husband is a picky eater, which I've known about for 20 years.\n\nI'm used to making food and having husband and/or kids making faces, gagging, taking an hour to pick at a single serving, or just outright refusing to eat. My husband is notorious for coming home from work, taking one look at the dinner I've made, and opting for a frozen pizza.\n\nMost of the meals I make cater to their specific wants. Like spaghetti: 10F only eats the plain noodles. 17F eats the noodles with a scrambled egg on top, no sauce. Husband only eats noodles with a specific brand of tomato sauce with ground beef in it. If I use any other sauce (even homemade) I'm going to be eating leftovers for a week. So it's just the one recipe of spaghetti.\n\nThese days, husband complains that we have a lot of the same meals, over and over. It's true, but when I've explained WHY that's true, it doesn't seem to sink in. I can only make a few things that everyone in the family will reliably eat and those get old.\n\nA couple of nights ago I made a shepherd's pie. I used a new recipe with seasoned ground beef (3/3 like), peas (2/3 like), and tomatoes (1/3 like, 1/3 tolerate) with a turmeric-mashed potato top layer (2/3 will eat mashed potato). Predictably, 10F ate a single bite then gagged and ended up throwing hers away. 17F ate part of a single bowl then put hers in the trash. Husband came home late and \"wasn't hungry\".\n\nI was so tired of reactions to my food and putting in the effort for YEARS and it all finally came down on me at once. I burst into tears and cried all night and the next morning.\n\nSo I told my husband that I was done cooking. From here on out, HE would be responsible for evening meals. I would still do breakfast for the girls, and lunch when they weren't in school but otherwise it was up to him.\n\nHe said \"what about when I work late?\". I told him he needed to figure it out. I told him that between him and the girls, I no longer found any joy in cooking and baking, that I hated the way he and the girls made me feel when they reacted to my food, that I was tired of the \"yuck faces\" and refusals to eat when I made something new and that it broke my heart EVERY time.\n\nThis morning, he had to work, so he got up early to do some meal prep. He was clearly angry. He said he doesn't understand why \"\\[I\\] said I hated him\". He said he \"doesn't know what to do\" and thinks I'm being unfair and punishing him. He said I make things that \"don't appeal to kids\" sometimes and I can't expect them to like it when I make Greek-style lemon-chicken soup (17F enjoyed it, 10F and husband hated it). I countered that I make PLENTY of chicken nuggets, mac & cheese, grilled cheese, etc but that picky or not, there's such a thing as respect for a person's efforts.\n\nSo, Reddit: AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nHowever, you set yourself up to fail by trying to cook for everyone in a single meal.  Big fam here, and while it is a bit demoralizing when there is only a handful of meals that \\*everyone\\* will eat, there needs to be some expectation management. Currently, it's \\*you catering to everyone's wants & nothing of them taking ownership of their own behaviors. \n\nI think your spouse doing the cooking for a bit, will set you up nicely, if you choose to go back to making meals. \n\nMy own \"goal\" was meals that at least half of the family liked.  If we got to 80%, approval, I was thrilled.  I often had meals that went well with plain rice/pasta/veggies, and very few 1-pot meals. We almost always have plain rice or pasta in the fridge, and ramen in the cabinet.  If someone didn't like \\*anything of the meal, they were free to eat leftovers or cook their own.  I am not even making a quesadilla.  They can do that themselves.  Even little guys can make a pb&j or ham sandwich.  They may feel a bit left out on a nice, hot dinner, but whatever...they'll learn to enjoy their sad dinner or eat more adventurously. \n\nBut mostly, it goes like this: Say we have swedish meatballs w/rice, veggies on the side.  Like 2 people with eat veggies, all but one will eat the rice, one of them \\*only eating the rice  One will eat the meatballs without the sauce (so I'll put some meatballs to the side before finishing up).  The one that only eats the rice, will go in the fridge to put some cheese on top.  Whatever, we're good. That's a WIN. Even if only half are really \"happy\" with the meal as a whole, everyone had something hot to eat. \n\nWhile I don't cook stuff only one or two of us will eat for dinner, I \\*will make those things for lunch.  Lunch is a free-for-all, and everyone is responsible for their own.  My youngest is now 12, but it has been like this for a few years.  Sometimes they will cook their own mac&cheese, chicken nugget or fish sticks. lol.  I will make things no one else will eat, like cabbage rolls. lol", "NTA at all! It was frustrating just reading it! I can’t imagine living with it and for decades at that! Let him deal with and finally understand the frustration. You seriously have the patience of a saint!", "NTA - why have you put up with this for so long. Especially from your husband? NTA - hold your ground.. Reading it again infuriated me. Throwing away food is a horrible thing to do in general especially in these times of high food prices. Do you compost? I'm guessing you do - but throwing food away in the trash wrecks the environment.  If you are to ever cook again there need to be rules established including EVERYONE takes. night and makes a meal.  NO faces. NONE.", "NTA All the effort and they can't try to enjoy your efforts? Yes they should cook for themselves. As far as the children are concerned they're old enough to cook for themselves. Tell your husband it's his fault. He's the one who taught them how to be ungrateful for your efforts and how to be picky eaters.", "NTA .... \"YOUR passive aggressive attitude and verbal negativity is unnecessary and unappreciated and THAT is why I'm not longer cooking meals. It is not up for discussion and if you continue with the verbal assault I will be cooking for myself only moving forward. \"\n\nYour kids are old enough to cook for themselves; teach them how; this includes BF and lunches. \n\nMy 8yo can cook for herself most meals and she voluntarily gets food for my 3yo even tho that's my role since he's so young still. \n\nLastly; why are there so many alternatives? \"You eat what I cook or you can go make cereal or PBJ yourself.\" Period. Giving them options makes them feel unappreciated of the effort you make and ignorant of the cost food entails because \"it doesn't matter what mom makes, if I don't like it she'll just give me what I want. \" No,  you eat what's cooked AS IT IS COOKED or YOU can go make yourself a PBJ or cereal. If they don't like those options then they can chose to go to bed hungry, missing one meal won't hurt them and missing 2 may teach them humility and appreciation. \n\nAnd before the populous jumps on my comment \"tHaTs AbUsIvE\".... blah blah blah; no it's not. I have food and sensory issues and guess what? I eat what's served. Period. Food is food. If thru don't like it then they have 2 options.", "NTA. You did right to stop making dinners, don't start again until they learn to be grateful or make their own meals", "NTA My mother in law is a wonderful woman but a terribly picky eater. I refuse to cook for her since, one mothers day, I cooked specifically for her tastes but included a chimichurri sauce for everyone else to eat with the plain grilled chicken. I didn't ask her to eat the sauce, I just let everyone else at the table know it was there if they wanted it and she made a puke face. My mother will do the same thing with food she doesn't think sound good. I was taught by that same woman, that I if I didn't like something to not make a big deal but put it on the side of my plate and ignore it.  I don't understand what would make grown women think this is acceptable behavior.\n\nYour husband is out of line with his behavior over the years that has taught your children that it is ok to make a gagging face if they don't like something. Would they do that at someone else's house?", "NTA. Damn, you are so nice, bet you're a real people pleaser too. Your husband and children aren't picky eaters, they're AH's.  Stop wasting your time catering to them.  Fix smaller dinners that you like, if they don't eat them, that's their choice. Just like it's your choice to stop being a doormat for them.", "NTA. Unless there’s a real, medical/dietary need, in my house they eat what I make or they make it themselves. Those are their only options. The fact you’ve put up with this for so long is mind-blowing.", "Please update us on how his meal went down with the kids!!\nEdit: NTA", "NTA. Your kids act like that because your partner does. I was socialized in a home where my mother would have me try things. If I tried them and I didn’t like them, she wouldn’t force me to eat them. My dad however ate every bite, because he loved that she would take the time out of her day to take care of us. \n\nMy dad spent his late teens/ early 20’s in poverty and ate everything under the sun. He was always so happy my mother made him food. His favorite meal is breaded chicken. My mom would make it every other week, and each time he came home he would be so excited. He would always say “is it my birthday” even though this was a regular, biweekly meal for us. \n\nIt’s so insane to me the direct line between being a “picky eater” and being well off in life. Poor people can’t afford to be picky. \n\nNow, I’m an adult who will try any foods. I’m 26 and when I was 19 I worked at a Chinese restaurant and there was a woman there I barely knew who liked me, she spoke very little English but she found it amusing to give me different foods. Chicken feet, squid, different roots, lots of spicy sauces. I always tried them willingly because my mom had one rule. “You’re allowed to not like it, you just aren’t allowed to not try it” \n\nAttitude about food is astonishing to me, but I don’t live to eat, I eat to live, and my parents nurtured a healthy relationship with food. \n\nI’m afraid of dogs because my mother was snd made it clear in my upbringing. Consider the socializing aspect.", "NTA, you're braver than the troops for putting up with this as long as you have OP. Please, for the love of all things yummy, go out to a restaurant by yourself and eat something that isn't buttered noodles ❤️‍🩹", "NTA \n\nI like that he thinks cooking is a punishment, but is entirely okay with you doing it.", "NTA\n\nI would have made them ALL start cooking a LOT sooner.", "NTA\n\nAt this point, I'd be making what I wanted to eat, and telling the rest of them, \"Here is what I made.  If you won't eat it, then make your own.  I'm done catering to all of you.\"\n\nHusband and 17F are absolutely old enough to fend for themselves.  10F can learn to eat what you provide or can start to cook for herself with some supervision.", "NTA the lack of consideration is bad enough, but they are so rude. It's terrible to teach children behavior that will make other people avoid them.", "My mum did this when I was younger. She was cooking every night for four kids and our dad is picky too. We actually picked up his food dislikes even if we hadn’t eaten it before. Mum got fed up and stopped cooking for us and I’m so happy she did because we started appreciating her and learnt to cook as a bonus. NTA", "NTA.\n\nI would cook for your 10 year old and yourself only.\n\nYour husband can cook for himself. The 17 year old can cook for themselves. Problem solved", "I'm 17 and have been the one soely cooking for my family since I was 13. 17 is more than capable to make their own food if they don’t like anything served.", "NTa, but you let this go on for too long.  On top of that allowing your husband's picky eating to rub off on your children.  If he wants to be picky fine, but he should have never let his behavior reach your children.  Keep you stance.  Don't cave because he whines.  He made his bed he can lay in it.", "NTA at all. Matter of fact you should make a yuck face, throw it away his cooked food and heat up a frozen pizza. Then when the dust settles down remind him that was just once, and you've dealt with it for years.", "NTA Yikes.", "I am shocked your husband has openly and aggressively shown such disrespect to you all these years.\nHe has taught your daughter to do this is acceptable and trained you to consider it your fault?!\nIf you make dinner they can eat what you made or make something else.", "I might be TA because I've suddenly dumped a major chore on my husband when he's already  got a full schedule.", "NTA- from the sound of it, it’s very possible that you just don’t cook well, but it’s not an excuse for your family to be rude, unappreciative and plain disrespectful. Only worry about yourself from now on. Dude can cook for him and the 10yr old, and the 17yr old can figure it out herself.", "NTA! Growing up, my mum had a rule, eat what she cooks or don’t eat at all (no take out/no frozen food when she cooks). Sounds like a pretty good rule. Cooking is not easy and a lot of effort goes into it. It’s ridiculous how little your family values your effort. Don’t cater to their picky eating habits.", "OP have you ever expressed your dislike of their reactions before? Have you ever told them that this is not acceptable. If not, YTA for not communicating maturely and letting it boil up. \n\nClearly, husband and kids are TA in this scenario for acting that way instead of being grateful.", "ESH sure they’re rude but you’re a doormat. Why would you marry/stay with someone who can’t show you basic respect or encourages your children to treat you so poorly? Why don’t you enforce even the most basic of manners with your children? My three year old knows how to politely let me know he doesn’t like something and he shit in his pants until three months ago.  He’s an ass but you chose him, they’re spoiled but you spoiled them.", "Yes, YTA\n\nYou live with a bunch of picky eaters, and expect them to magically stop being picky. You cook food you know they don't like, and are then surprised and upset when they don't like it.\n\nYou don't say whether you work or not - it's not clear from your post whether your job is homemaker (and so feeding the family is a normal part of your job), or whether you both work outside the home, and could be expected to divide the domestic labor equally. It is clear that cooking has traditionally been part of your responsibility. If you no longer want to cook, you don't say which other domestic responsibilities you intend to take on instead.\n\nI understand how boring it is to make the same meals over and over because the picky eaters in your house only eat a few different things. Husband appears to be an idiot - he cannot simultaneously be such a picky eater and complain that you eat the same things over and over, when the reason that you eat the same things is that he complains when you make something different.\n\nI have picky eaters in my house. When I cook, I tell them what I will be making. If anybody doesn't want the meal, I am always prepared to boil plain pasta (which is basically zero additional effort if I'm in the kitchen anyway), and they can grate cheese on to it.\n\nThere is such a thing as respect for a person's efforts, but there's also such a thing as common sense. If you live with people who don't like broccoli, then it doesn't make the slightest bit of difference how much effort you put in to preparing a meal with broccoli - they're still not going to like it, and you're delusional if you think otherwise.", "NTA for going on cooking strike.\n\nSlight YTA for conflating Spaghetti and Noodles - they're different types of pasta and the terms are not interchangeable", "You make all these things, but do they even taste good? Lol. It’s odd they have a problem with everything you cook, lol. You’re not wrong for not cooking. Everyone in a household should be responsible for a meal or two during the week. \n\nNTA", "NTA. No one should be gagging and complaining about every single meal. Either your husband and daughters are capable of sucking it up and eating things that aren’t their favorite, or they have ARFID or some other medical issue and your husband needs to take them to the doctor and come up with a feeding plan that works for them. Refusing to eat anything but a few foods and then complaining about you cooking those few foods too often is ludicrous.", "NTA He is whiny and miserable when you cook, he is whiny when you don't cook.  You are tired of his picky ass and his complaints.  Good for you.  These people you raised though that is on you.  They got it from him but the kids are old enough to learn to always be polite when refusing food.\n\nI would make them figure it out for themselves.  If you do not eat the family meal, you have to make your own food.", "NTA. A couple of my kids are picky eaters too. They absolutely are not allowed to be rude. No faces, no nasty comments. They can ask for accommodations- like no sauce or a small portion, but if they are rude, they get in trouble. \n\nIf I try a new meal and they don’t like it, I ask them to try a few bites and then they can prepare themselves something healthy instead. My 6 year old can make his own sandwich and has been able to for a couple years. If he can manage it, your teens and AH husband can too.\n\nCooking strike is 100% valid here. Also; consider making yourself all the delicious interesting foods you’ve been denying yourself all these years. It’s your turn to enjoy your meals.", "NTA.  Obviously your husband needs to behave better and not make faces and complain.  Same with the kids.  They are old enough to be polite.  I hope they don't make faces and throw food away when they eat at their friends' homes or in a restaurant.  They can be as picky as they want, but they don't need to be rude.", "NTA. Everyone in your household is old enough (even the 10 yr old) to cook at least once a week. 17f, you and hubby can cook twice a week and 10y once a week. Once they’re involved in the process they may find more things they like.", "NTA since you tried your best and it might be easier for everyone to have appropriate food if they can decide what to make for themselves.\n\nHowever, the gagging and taking hours to get down a normal sized portion of food doesn't really sound like picky eating out of entitlement. Has everyone been checked for allergies or overactive poison response (not too sure how to express that in English, but normally, tastebuds only react to high and actually dangerous amounts of toxic substances, however, if these tastebuds are oversensitive, they might also detect small, harmless amounts of toxic substances that are normal in lots of receipes and the body will react with a poisoning response. It's assumed to have a genetic component.). Both of these things can lead to the throat closing or narrowing, gagging and physical pain whilst eating (and presumably weird faces). My brother, mother and grandfather and a cousin on my mothers side all have that, and it took ages to find out about it. \n\nSo your idea to let the affected people do the (or at least their) cooking (and omitting whatever they think they can't have) seems to be a good solution. For the late shifts - I don't think that it's the law anywhere to have the warm meal of the day in the evening and not in the morning / midday / whenever there is time, so maybe having a warm meal at another time of day would be an option? Also, if that's possible where you live - get your family seek medical evaluation for these issues, there really might be more to it than just entitlement or rudeness, and quality of life for everyone could be improved with a diagnosis.", "NTA - why did you and the 10 yo tolerate this for so long !  Why don't you 2 cook normal food and let the other 2 fend for himself.\n\nYou have been sainted in putting up with this nonsense from your husband and your eldest.", "NTA. \n\nHe is complaining about lack of variety AND that you are trying new food. He can cook for himself. \n\nIt's one thing if he is a picky eater and happy that you make him what he likes, but he has made it so he is impossible to please. \n\nDon't fully give up on your kids yet, but you can certainly stop catering to your husband, and I think putting him in charge of cooking is a great way to do that.", "Nta", "NTA And I'll also add that you should sit your entire family down and make them watch the movie The Menu. Let them see what happens to the woman who makes a critical dig at the food she's served.", "NTA. I feel this in my soul. A person can only take so much.", "NTA.  Gagging faces and refusing to eat doesnt fly in my house, no matter who cooked. \n\nA polite \"I didnt particularly enjoy that, lets try something different\" goes a long way after the fact.", "The title of “Mom” does not equate to “short order cook.” I was a picky eater growing up and that meant I had to fend for myself or go hungry many nights. I’m still alive and learned to cook.", " \nI'm sorry they are so cruel about your cooking, let them fix their own dinner.", "And to that end, DH should've long since learned to cook and appreciate the effort it takes to meet his requirements", "I don’t even offer cereal. You get what you get and you don’t get upset!", "Spaghetti should be the 10yo’s responsibility.", "I would keep emphasizing to the children that taste buds change over time, and that a person needs to try something \\*eleven\\* times, on average, to develop a taste for it.    \n\n\nEven if they didn't like something last time, they might develop a taste for it, but they'll never know if they don't at least \\*taste\\* it.", "He works as a retail manager every day except Wednesday and Thursday. I WFH on Tuesdays, Thursdays, and Sundays (afternoon-evening shift) \n\nWe live on a hobby farm, so farm chores fall to me (unless it's plowing the driveway, because the tractor is old and fickle). We typically share large outdoor projects like firewood stacking, coop cleaning, and yard cleanup. Daily chores are mine. I also do all the housecleaning, laundry, paperwork/bill paying, school events, pet care/vet appts, medical appointments, child care, gift shopping/shipping, and errands. Husband is usually good about picking up some groceries on his way home from work, and has recently stepped up to making some of the meals on nights when I work (if I didn't already have something in the crock pot).", "The policy has always been \"try it first\" and then (especially with the 10F) to ask WHY they don't like it. So if it's a texture thing, or flavor, or ketchup would help, I work with that. Like I KNOW the youngest doesn't like sauce/gravy, so I'll usually keep some of whatever it is reserved to the side so it doesn't get sauced. The family likes over-baked fish, but 10F said she doesn't like the \"black stuff\" (pepper) so hers is lightly salted and done.\nIf she picks at a meal without eating a reasonable amount, she's allowed to be done IF she agrees there will be no snacking/dessert afterwards. If she (or any of them) puts in the effort and it's just not their favorite but they TRIED, that's good enough for me.\n\nIt's the facial expressions and complaints that do me in. They don't have to love it, but if you're going to pick at it and then dump the plate and grab a bag of chips, I'm going to be hurt and upset, you know?", "Most of our scraps go to the chickens, ducks, or dog. This time I was out of the room (crying) when they threw the stuff away in the trash.", "I agree with you!", "I am, and I'm working on it. Boundary-setting is something I struggle with which is most of the reasoning behind the post. I can't tell if it's a reasonable boundary or an irrational one.", "Last night was corned beef with potatoes, carrots, and cabbage.\n\n10F ate the meat, but wouldn't touch the cabbage. She did eat a small amount of carrots and potatoes, which is typical with her.\n\n17F picked at the meat, ate a single piece of carrot, and seemed to enjoy the potatoes.\n\nOverall, he didn't do badly, although the veggies were a bit mushy from boiling. I ate my plate except for all the cabbage, because I was given an entire quarter of the head to start. \n\nHe complained this morning that the kids didn't enjoy it and that he \"followed the online recipe\" and the irony was apparently lost on him.\n\nTonight is homemade pizza. 10F said she hopes it's only cheese, and 17F says she's sick of pizza (heavy rotation because, again, very few things I can make work for everyone). So this will be fun.", "That's what puzzles me about my husband. He grew up with a single mom (divorced when he was about 8, she never remarried, she never graduated HS, and worked at a factory until she retired) who made a wide variety of nutritious, if cheap, foods. I've asked her about her son's pickiness and she just rolls her eyes because she struggled with it too. When he got old enough to do farm work with his cousins (13/14) he started buying his own food: chicken-flavor Maruchan ramen, Apple Jacks, and Knorr noodle packs. That was what he ate rather than mom's food.", "No way. This all sounds difficult and he’s also a grown ass man and should also be setting a good example. Honestly it should’ve been done years ago to start the process but no, NTA. Anyone would feel burned out over that. He can suck it up.", "NTA the kids will have learnt this reaction to food from him. If he acts this way over food they will too. (my dad refused to eat veg so my brother did too thankfully grown out of it both of them)\n\nMaybe a few weeks.of this and he will understand the issue.", "I don't think it was dumping it on him, it sounds like you finally hit your tipping point", "Is there a chore that he does that you can take over? If the outcome you want is that everyone is fed and happy, and your husband is taking over that work, I would trade another chore that takes a similar amount of time an effort. Of course if the chores were unbalanced before, this could be harder. I’d sit down and hash it out with him and come to an agreement. You aren’t wrong for how you feel here. I do all the cooking/shopping, and if they ever purposefully made me feel bad about something I made, I’d be done too.\n\nNTA", "No! They dumped a major chore on themselves", "Many, many times. I sat down with my husband when we first got together and worked out a list of things he WOULD NOT eat, so I could develop workarounds. To his credit, he's made progress over the years in trying things before he rejects them, and has learned to like, for example, sour cream in his mashed potatoes, even though he hates sour cream by itself.\n\nMost of the things he DOES like are isolated flavors in a particular style. He eats exactly two kinds of pie: Raspberry and French Silk. But the Silk has to be on a Graham cracker crust with no whipped cream or chocolate curls, and the raspberry has to be a classic double-crust (no tart-style, crumble-top, or other cobbler-adjacent types). Using apples is a mortal sin.", "No one should have to explicitly state that they don’t like it when people gag and throw their food away.", "That's fair.\nI do struggle a lot with being a people-pleaser, and making (and holding!) healthy boundaries. There's a lot of trauma in both our pasts and maybe in trying to be gentle I went too far.\n10F does know her reactions hurt me, and usually apologizes for it. We're working on \"apologies are meaningless if you don't work to change the behavior\".", "I DID have employment info and extra detail but I ran out of space in the post. I commented it elsewhere, but we both work. He works as a retail manager with Wednesday and Thursday off, I WFH on an afternoon/evening shift on Tuesday, Thursday, and Sunday.\n\nAside from that, we live on a hobby farm where I do the chores. I also handle all the housecleaning, laundry, bills/paperwork, appointments, school events, child care, doctor visits, etc. We share responsibility for large outdoor projects like firewood stacking, coop cleaning, and yard cleanup.\n\nThe problem isn't that they're picky, it's that they're not picky in the same direction. One picky eater LOVES tomatoes but hates chicken. The next gags on tomatoes, loves chicken, and hates gravy. The other likes chicken with sauce/gravy, but can't stand tomatoes. So finding one dish that everyone likes is a big problem. If they ALL hate something, I don't make it (none of them like curry, so I only make it for myself or company if THEY like it).\n\nHusband agrees with me that making plain pasta or rice to accommodate one of the kids every time I cook is silly, but the alternative of \"if I cook it, you eat it\" also doesn't work. Seems a lot like \"damned if I do, damned if I don't\".", "Picky eating shouldn’t be tolerated.", "Sorry, they're the same thing to 10F. When she suggests \"noodles\" for dinner, she means spaghetti. She'd be weirded out if I made \"chicken noodle soup\" with spaghetti. I accept your judgement.", "Whether or not spaghetti is a noodle is a question of local dialect.", "This behaviour has been learned and allowed for a long time, but they’re still old enough to know better or to see how it makes you feel. \n\nOP, unfortunately you sort of created this dynamic for yourself by catering to them at all in the first place. In my house, a meal was made, that’s what was for dinner, if you wanted an alternative, you were welcome to make something, but all we had were ingredients. Mostly meat, fruit, and veggies. We didn’t have frozen pizzas, nuggets, etc.\n\nAnd we absolutely didn’t make a fuss or call something disgusting. No need for a whole theatrical production. If you don’t like it, don’t eat it. \n\nGood news is, you’re doing the right thing, really all you can do, to get yourself out of it now. Stay firm! \n\nIf you know your husband is doing something like frozen pizza that doesn’t take a lot of effort and that’s not what you want to eat, make yourself something you want and that you find joy in making. Make enough for you and maybe a day or two of leftovers. If anyone else wants some, they’re welcome to have some, but they’re not welcome to offer their opinions about what you’re eating, as you’re not forcing it on them. Maybe even ask if anyone is interested in helping you cook. Kids are often more willing to try things they were involved in helping create. Like, tumeric is very yellow. I can understand why a kid who’s used to buttered noodles would see yellow potatoes and be like “I’m unsure about this.” But seeing and tasting the components could help demystify it.\n\n…\n\nMaybe also be aware, and make your kids aware, that this behaviour is not okay at other people’s houses either. They can decline to eat, but politeness is expected and there not to ask for special meals or accommodations. When we were kids, it was exhausting to have some of our friends over because they were unapologetically and irrationally picky. My sister had a friend who “only ate marble cheese.” My mom grated up cheddar and mozza and mixed them up and he didn’t know the difference. Others would have a list of only like four items they would eat, which  they requested at mealtime. We ended up just not having them over as much because we lived out of town and my parents didn’t want to have to do a specific grocery shop just so I could have a friend over for the afternoon. I had a roommate in college who only ate boiled chicken and boiled canned peas and corn and rice and potatoes. But she didn’t stop there; she also threw out my stuff or scoffed at my perfectly normal food. It ended up embarrassing her in quite a few situations when she was called out for being unnecessarily judgemental, sheltered, limited her experience with food. I just told her to shut up and eat her buttered instant rice, but I can see how she could easily have been a bully, say in a school setting, if someone more shy or less confident came in with a perfectly lovely ethnic dish that she wasn’t familiar with.", "Yeah - you're not the asshole here. You've got a full life too, and SO MUCH love and energy goes into cooking that rejection of that work is ROUGH, especially when you're tired to start and trying to make three people happy. \n\nBeing on a farm, I'm sure the kids have chores too - maybe it's a good time to multi-task and teach your older girl to cook, since she'll be out on her own soon herself - teaching kids to cook is a great bonding experience AND my guess is that her school work and other chores would allow her to practice this life skill once a week - say, Tuesdays - to balance it out for everyone. Heck - even the little one can help, with supervision. Something easy for her, like soup and sandwiches on Sunday night, might be a step in the right direction. It won't necessarily fix your husband's complaint about variety, but it's a start to evening out the workload. \n\nI'm also thinking that if they understand the work that goes into the food, it may help with broadening their palates. \n\nJust suggestions of other ways to tackle the issue!", "so nta. bravo. Worst case scenario he starts making a lot of frozen pizza.", "Right, that’s very understandable", "Ha, well let him get on with it now. After a few more experiences like that maybe he will develop some empathy and understanding regarding how you've been feeling. \nFor now, breathe a sigh of relief you aren't on the receiving end of any more gaggy faces! Well done on sticking through it!", "You are definitely not the asshole. \n\nCooking is a lot of work and it sounds like you are really into experimenting and treating your cooking like artists would treat their art. Don’t let them rid you of your passion and joy! Keep cooking - it doesn’t have to be for them!", "I get the thought process, but keep in mind that not holding boundaries and allowing this type of behavior is actually hurting your child(ren). You are arresting their emotional development and encouraging antisocial behavior that will affect their lives negatively. Think of it this way: who will want to spend time with people like this as adults? This is absolutely unacceptable behavior that no one else will tolerate. How many dinners will they ruin by making rude faces at a restaurant? How many friends will stop calling when they realize your child throws a nasty fit if someone doesn’t kowtow to their preferences? What will happen the first time a date wants to cook them dinner? When they’re meeting a potential in-law and immediately sour the relationship by gagging at what is served to them? Beyond food, tact is a skill they need to be taught, in general! How many friends will they lose because they’re making faces about their friends’ outfits, or gagging about who their friend is attracted to? Your children are going to be adults and they need to be taught the skills to navigate situations in which they won’t be treated like toddlers. Nobody likes the “I’m just being honest” guy, and that’s what you’re creating with your lack of boundaries. You’re doing the right thing. Stand your ground.", "Gosh yes! By age 10 I could make breakfast! (Not necessarily pancakes, but certainly scrambled eggs, bacon, and toast). Some of this is your daughters are copying their dad. Maybe instead they should be involved with the meal prep. Tuesday for the eldest daughter, Thursday (with help) for the youngest. Or, if they agree among themselves, Tues/Thurs with both helping each other. \n\nMake sure to be very, very gracious about their meals (although tempting to spit it out and say yuck) to model the behavior they SHOULD have. Also...your 17 year old daughter...does she do this at other people's houses?? Because (as I strongly suspect) if she doesn't, then you have a different issue.", "All good points. Thank you!", "Clearly NTA, but do go on about this Greek-style Lemon Chicken soup 🤤", "NTA the only thing you'e done wrong is perpetuate this problem. \n\nSee, the problem is your husband has normalized your children ALSO being 'picky eaters' and 'picky eaters' ain't cute. It is my number one red flag in a person. \n\nYour kids learned the gagging and WASTING FOOD (wtf) from your husband.  They're throwing food in the trash that costs actual money.  Edible and probably honestly delicious food.  Why? Because they're following your husband's lead that it's ok to use being a 'picky eater' to cut down on mom. \n\n17 year old is old enough to cook: I was cooking for the family at 13 (because my parents worked alternating shifts and some nights a week my sister and I were on chef duty).  Let her and dad work it out.  Just be classier than she is and don't gag at her food or throw it out.", "NTA\n\nYour family is unbelievably rude.", "As a male who learned to cook at the age of 11, this is a phenomenal learning oppty for the kids.  I did it as I was put to work helping (and omg what a great move by my mom that has paid lifelong dividends),   Either when I saw what my mom was making (at age 13) or if she was tired, I didn't whine at all. I just asked if it was okay if I cooked something else, then grabbed some veggies, etc, and got to it. \n\n&#x200B;\n\nI don't mean grilled cheesee either, I made legit meals. Mom went from being angry that I turned into a better cook than her to being stoked that she could go back to buying \"ingredients\" and I could deal. Plus in college, post college, later with kids, I could make a phenomenal meal in 30 minutes flat.", "NTA.\n\nFour kids all near the same age and my husband; from the get-go I made it clear that they got what they got and I didn't want to hear a damn thing negative about it. Unless there's something really wrong with the food. I was fine with the kids trying and opting for a PB sandwich instead (no dessert).\n\nIf they liked something, it would be on the menu more frequently. If they wanted to try it with salsa or whatever, that's cool. But don't you dare make a face over tuna noodle casserole when I spent the effort and we're down to nothing in the pantry.\n\nSaved me a lot of grief, as everyone has different tastes.\n\nMy husband was the one who had the hardest time with it. I ended up on the road during weekdays and he had to handle the dinners. That finally got me some respect.\n\nYou're long overdue to walk away from the responsibility.", "NTA but turmeric in Shepherds Pie is weird.", "lol...totally NTA...but in all honesty? very very soft YTA in the sense you brought this on yourself...by even marrying and him and having his kids, who HE allows this kind of behavior. I mean, from the sound of his diet even with his OWN mother, he is MEANT to be a lifelong bachelor. Period. If he won't change his dietary behavior at least the comfort is that all that processed food will take its toll sooner than later?", "[deleted]", "People here have been talking about how the family's reaction to your food is a learned behaviour.  You've also mentioned that you do almost all the work on the hobby farm.  I'd suggest you're complicit in teaching them bad things.  \"Mother does everything, mother does what I want or I can complain as much as I want\"\n\nWhat if you're a genuinely bad cook.  My mother is a terrible cook but makes fancy little desserts at Christmas so whenever we have relatives show up she looks like a superstar.  Through the week she just makes trash food from the cheapest and worst ingredients and we're supposed to be grateful for it.  She won't let us cook.  If we're at her house for dinner we must start the washing up immediately after the meal, no five minute pause, and it's handwashing even though they have a dishwasher.\n\nI'm going to say you and your husband get the YTA stamp right here right now.  Train your kids to be nice and please learn to cook.", "YTA, your husband shouldn't be the only one cooking, both kids should be helping cook at this point, 17 year old constantly, and 10 year old as assistant and possibly doing an occasional meal herself with help from her parent or sister.  \n\nIn fact, you should not be involved in deciding who cooks at all.  Just say that you're cooking for yourself only from now on and let your family figure out what to do.  Make sure the 10 year old has access to plenty of simple recipes, screen time to do video cooking tutorials if needed, and supervise in the kitchen if you can do so silently.", "It's hard to say, I'm leaning towards NTA, but you could just be a bad cook. My fiance came into our relationship and \"didn't like\" tilapia, pork chops, broccoli, chicken breast, or mushrooms. Then i told her to trust me and made them, and now they're some of her favorite foods. This was all because her parents didn't prepare them properly. Assuming you have any kind of kitchen acumen, you're prolly fine, though. Have you asked them what specifically they don't like about it?", "I have 1 incredibly picky child and 2 great eaters, 1 veg hater. I make one dinner and that's it. I try to be considerate of what everyone likes but it doesn't always work out, does it? \nI was also an incredibly picky eater as a child and would gag on almost everything. I still don't know why. My mom also gave up. I became a pretty good cook and expanded my tastes once I moved out of the house. \n\nFood preferences are complicated but with my own child I do take some responsibility for catering too much to her pickiness. We had a bit of a breakthrough recently when the doctor told her she had to at least try a \"thank you\" bite every meal. That wouldn't really work on an adult man so your husband has created his own undoing. You still have a chance with the 10-year-old. \n\nIt sounds like you make amazing food and I would love to be your dinner guest. \n\nNTA", "NTA. When my husband and I got married, my husband was a picky eater. I told him I would cook and he was free to eat it or not. We have the same rule with our kids. My husband (who hates cooking and loves me) now eats more diverse foods and our kids outgrow the picky stage after a year or so. You have the patience of a saint. Your family needs to learn some manners and respect for others.", "NTA.  It’s also time for the kids to step up and learn to cook for the family as well-10 yr old as a “soul chef/prep” and 17 yr old is definitely old enough to do so!\nHave them be responsible for dinner once a week.", "NTA. I can understand kids pushing back but your husband needs to grow up. Sorry but you’re wasting a lot of food. Most likely you didn’t sign on to be a short order cook let them cook for themselves", "Holy Christ NTA.\n\nThere are a lot of things I won't eat, and now I've got a bunch of thing I *can't* eat, but I had \"restrictions\" like this, I would definitely just cook for myself.", "17 is old enough to learn to cook for herself. Your husband can cook, he’s old enough. I’m wondering if the girls learnt that behaviour off him with gagging and pulling faces.\n\nI’m a picky eater but I still try new foods as there might be something I like that I haven’t tried before. I won’t dismiss something straight away. \n\nNTA. Just cook delicious meals for yourself and let your husband work it out. He can live on frozen pizza.", "NTA\n\nSeriously just make dinner the way you want and leave the rest of them to either eat or fend for themselves. But please start making the 10 year old eat atleast half the food. Get her out of that picky stage before they make their future spouse's life a living hell also. Freeze single portions of leftovers so you have dinner for night you don't want to cook.", "Oh jeez, OP, absolutely NTA. \n\nYour family IS full of assholes though. I’m not a picky eater so I don’t know how I’d navigate mealtime, but I wouldn’t dream of exporting responsibility for my particular tastes onto someone else. Say, in what other ways does your husband display this pathetic learned helplessness? In how many areas of life has he decided that you’ll be changing his diaper?\n\nOP, please do NOT back down from this. He will learn to feed this family of picky eaters one way or another, and I sincerely hope you’ll stand aside and let him grow up.", "I stopped cooking for a long period of time, not because I felt unappreciated but because my spouse and I fought about what to make for dinner every single night. And they were petty fights too, which were only really resolved when I made a decision about what to cook. \n\nIt was surprisingly an easy and good decision. Now there’s better flow of communication about the dinner question. If one of us really feels like eating something, we cook it. If not, cold sandwiches are perfectly fine. \n\nNTA", "Honestly OP my heart breaks for you reading this. The fact that not one member of your family seems to respect you or what you do for them is so sad and I feel like this stems all from your husband. Kids are don't act like this of their own accord.\n\nPlease don't back down, you are so NTA and they don't deserve you or your cooking. BTW greek lemon chicken soup sounds banging.", "your food sounds delicious and i wish you could cook for me! 😋", "NTA. Your husband and kids are rude! He should have taken over feeding himself from the start if he can't show the most basic courtesy.", "NTA even a little bit. My kids have gone through a lot of picky stages and when my husband was deployed it almost broke me because I was already exhausted and then having the only other person who would reliably eat my cooking gone was a lot. \n\nYour kids are old enough to help with dinner. Assign them a night to help cook. The 10 year old will obviously need more help but the 17 year old should be able to cook with just you being there to answer questions. Husband should also take on several nights cooking too. I find it a lot easier if I only have to come up with meals a few times a week over every night. I care a lot less when they don’t like a meal.", "NTA. OP, have you heard of ARFID? The fact that all three of them have such specific things they’ll avoid, and your husband was buying his own food at 14/15 when his mom was cooking for them, sounds like something psychological or physical going on. Might be worth looking into.", "NTA. If I were you, I wouldn't cook for any of them AT ALL. I would only cook for myself. I love cooking and baking but if all my hard work is going to be brushed off an unappreciated like that, why would I continue? They're fully capable of making their own food. 17 most certainly can make her own meals, including breakfast and lunch. I'm a little iffy on 10 but even I was making food for myself at that age.", "I know that picky eating sometimes comes from trauma, from being on the spectrum, not standing some textures... maybe your parent was a terrible cook and you had to stomach lots of terrible things when you were growing up. I know, and I accept that. Other than those reasons, really, picky eaters suck. They just do. Because except for any of the above, it just means you were spoiled to heck and didn't grow out of it.\n\nFood is such an inherent aspect of social life, of acceptance, of being welcoming of different things and other cultures, of comfort. Of course we all have preferences, but that does not mean you are entitled to make yucky faces to something that was made for you. That's just preposterous in my book. You've been so patient for all these years, I have no idea how you did it. And you know what's worse? Dad's behavior has rubbed off on your daughters. Shame on him. You are completely and totally NTA. Enjoy making a bunch of awesome, different foods just for yourself.", "NTA  But my 1st thought-ramen for everyone!", "NTA but like, enough of this. Your kids and husband are being absolute ungrateful brats and should eat what you make or starve.", "H can cook for himself and both kids.\n\n17F can learn to cook.\n\n10F can microwave stuff and make sandwiches.\n\nNo one's going to starve if you stop cooking 4 different meals 3x a day. NTA.", "NTA\n\nTell your husband the truth. You don't hate him. But you hate the way he reacts to your cooking and 20 years of dealing with his and your kids shit, you've had enough.", "Why in the world have you been catering to this? Make 1 meal and they eat it or its leftovers. You are turning the kids into being like their dad, not to mention what happens on overnights or when they go to college. Nobody is going to starve if they have to just eat part of their dinner. My kids were somewhat picky and could usually find something in each meal or they made a snack later. Give them each a night a week to cook. I imagine they will expand their repertoire as they learn to cook.", "NtA and update pls!!!!!", "NTA\n\nWhen I was a young picky eater I remember one day saying that I thought something my mom cooked was \"disgusting\" I'll never forget how hurt she was and how angry my dad got at me for saying that.", "NTA. I’m an adult picky eater (mostly a texture thing for me), my partner is very adventurous when it comes to food. Typically, we just make separate dinner every night for ourselves. At this point, I’ve accepted that my menu is going to be quite limited if I’m not willing to try anything new and it sounds like he needs to arrive to this conclusion as well. What does he expect you to do? it seems that every time you try to make something new they make a stink about it. There’s only so many meals you can make with such parameters. I usually try to incorporate little things to my regular meals (like adding green onions to my Mac and cheese lol), gives a little variety without compromising on foods I like. He could always try that instead of making you work with near-impossible requirements for dinner. It’s just not fair to expect all this of you tbh. Not to mention it’s a slap in the face to put effort into making food just for it to go to waste when he makes a pizza or something. I would be hurt/annoyed too.", "NTA. Two choices on the menu; take it, or leave it. They chose the second option, now they get to feed themselves, and you get a break.", "NTA - but you really need to work with your daughters on their attitudes. It’s fine not to like foods, it’s not ok to gag or make faces at something your mom cooked. That’s just straight up rude and it’s not going to serve them well if they ever go to someone else house for dinner. \n\n\nMaybe involve the girls in cooking? Have them pick a day and they decide the menu or they have to participate in making it. They can find out how much work goes into cooking and maybe they’ll find some other ways to express themselves. \n\nYour husband is an AH is likely not going to change but I’m glad you’re putting your foot down.", "NTA.  Unless the kids have actual food aversions (diagnosed by a professional), they just picked up your husband’s food pickiness because you accommodate him.  That sort of makes this an E-S-H as you could have made an agreement that when you have kids, he will make an effort to try foods, not make faces or negative comments about food, and if he can’t do those things, he will have to eat elsewhere after everyone else eats.  I’ve seen it in families, kids pick up picky eating from a parent or sibling and then you are screwed.  They are all old enough to learn to make something they will eat.  I was younger than 13 when I was taught to make something for myself because there were a couple dishes my mom cooked that so could not stand and she didn’t have to make more than one dinner.  Get those kids cooking their own dinners.  Also if dad is going to set a terrible example by relying on mass produced frozen dinners, he should be the one grocery shopping for them.  You can also make the kids responsible for putting ingredients they need to cook on the grocery list.", "NTA. You are a saint for putting up with it that long. I started asking men before I dated them if they were picky eaters because I am not and I love to cook and despise picky eaters. I wouldn’t entertain one at all. Then throw in your children being picky eaters. Yikes! I would go on strike too!", "NTA.  If they're not going to eat what is put in front of them then they can cook for everyone.  If it's something you don't want don't be shy about tossing it and getting fast food for yourself only.", "NTA. I went thought something similar with my family. I ended up cooking off a few pounds of chicken breast with nothing but salt and pepper and a pound or two of noodles every week and putting them in the fridge.\n\nI would still make dinner, but if you didn’t like it, make a chicken sandwich, butter some noodles or pay for some takeout.", "NTA. I am so sick of the stereotype that there's \"kid friendly\" food. I ate what my parents cooked as a kid, with the sole exception of lima beans. Kids prefer those things because they're given them as a placation for not eating their dinner, so they associate it with a reward. You can't eat chicken nuggets the rest of your lives. Feeding them \"kid food\" all the time breeds adults that eat like children.", "NTA my mom’s rule growing up was you eat what I make, this isn’t a restaurant. If we didn’t didn’t like something we had to make food ourselves. Now that Im an adult I appreciate my mom more and guess what? My taste buds have expanded. I went from being a very picky eater to a foodie who loves trying new cuisine.", "NTA. This is so rude and I completely understand why you’re hurt and don’t want to cook anymore. I would NEVER disrespect my mother or partner like this by pulling nasty faces and throwing plates of food away. \n\nNot only are they disrespectful, they’re WASTEFUL. They’re old enough to feed themselves. Let them have at it and eat sandwiches everyday.", "NTA either way, but I am curious if your husband and kids are neurodivergent? Doesn’t forgive the rudeness but would explain the picky eating", "NTA NTA NTA but your husband sure is.\n\nThis is outrageous. Your husband has modelled absolutely unacceptable behaviour for your children. I am a picky eater, and one of my children was also, but that doesn't entitle you to be so incredibly rude to someone who has laboured over food prep, and made significant effort to cater to different tastes.", "I remember being about 5 when my mom made a new dish. My dad took one look at it, after he sat at the table because he had fuckall to do with cooking, and said, \"Ok, who else wants a pizza\". He got up and ordered one. At the time I thought it was funny, but after a few years I realized it was an asshole move. OTOH (on the other hand for you ESL students and boomers), my mom was always a bad cook. I appreciate it because I can eat almost anything. I still haven't tried lutefisk or century eggs yet, but one day!\n\nNTA", "Definitely NTA, I have one picky eater in my house and it is a total pain in the neck, I can’t imagine having 3 of them.", "NTA, while growing up, my mother would cook a meal and if we didn't like it, she told us to cook ourselves something else or go hungry", "NTA\n\nStick to your guns.", "NTA. You’ve put up with this long enough. Please don’t cook for these entitled people. Let them figure it out on their own. You’re not their maid/cook.", "NTA. Honestly I would have done this sooner.  How is the 17 year old not also cooking?", "NTA.  You have to stand up for yourself.  I have been you.", "This is exactly why I stopped cooking when I was with my ex, though it was mostly him being downright nasty about anything I cooked or baked. I finally gave up and left all of it to him. \n\nI'm now in a much healthier relationship, and am relearning the joy of cooking. \n\nOP, you are NTA. Your family needs to learn just how hurtful and ungrateful they have been.", "Absolutely NTA.", " He said he \"doesn't know what to do\"\n\nHe is a grown ass adult he can figure out how to make food\n\nHonestly OP, your 17 yo is old enough to be cooking meals and 10yo is old enough to start learning and helping prep meals", "NTA, not even a little bit.  \n\nI grew up in a restaurant family.  My stepdad was a chef and mom a waitress while I was growing up.  Due to their schedules, working late, they didn't cook at home very often, if they did it was a special occasion and the food was amazing.  My sister and I had took cook for ourselves at a young age.  I remember eating a lot of cereal (that I now hate) and relying on food from school a lot.  On the flip side we were also often in nice restaurants eating amazing food there too as booth kids.   My parents had one good rule about food is that you had to try everything at least once (fresh oysters for example).  I would never in a million years dream of rejecting food like your kids did.  One of my favorite memories as a child was sitting outside in an ornamental garden (around age 5) being served enchiladas rojas stuffed w/ cheese by my great grandmother.  \n\nIt seems like you have some nice cooking skills and have been generously cooking for everyone for years.  Time to get everyone else on board.  If the children don't feel like cooking, have basic snacks they can eat like apples and cheese.  It's fine, really they won't starve!  Start w/ the older one.  They NEED to start cooking as well as a basic contribution.  When my son was a teenager, he learned how to cook reasonably well and now comes over and can do the entire Thanksgiving meal.  It's wonderful.  \n\nIt's outrageous to me that DH is \"picky\" but would rather eat a frozen pizza than a home prepared meal.   \n\nHere's it's reasonable to cook when and what you feel like.  Cook if it pleases you on the weekend.  Make some quiche (yes w/ veggies that the kids will complain about) then help them make one that's plain or w/ just ham.  Make a pot of chili or soup for DH and keep in in the Instapot for a day or so.  He can eat that!  Teach the kids to make easy things.  After a couple of months of this, I hope they come to appreciate your hard work.", "NTA and as a former picky eating child who would still (begrudgingly) try most stuff, I feel so much for you. \n\nSucks to be your husband, smh. I don’t care if he works 180 hours a week, the tantrum he threw was immature, ungrateful, and selfish. You’re 100% right in this situation. I hope they get over themselves, especially him. It kind of seems like the kids are parroting after him, because he shows them that it’s ok to behave this way", "NTA, if they refuse to eat anything and constantly throw away food, let them make their own meals and clean up after themselves. If they're lost they can find recipes online. Enough is enough.", "NTA and in fact I think you could pawn off some more chores in order to have more time for yourself. Like your husband and eldest daughter can do their own laundry. And the kids can help more on the farm. Also maybe get them to take a cooking class.", "I used to have some slightly picky eaters (hubby grew up on meat & potatoes, and one of my kids is not a fan of pretty much any cooked veggie).  I have 3 kids - 12 & twin 9 yos.\n\nYou know what helped?  When everyone was responsible for one night of cooking - from choosing the meal to making it. \n\nOf course I help my 9yos, but they’ve gotten quite a bit of confidence in the kitchen, and we all have expanded our horizons on foods we might never had tried before. (We use a kids cooking subscription that has 3 recipes a month, and vary in theme - sometimes it’s an ethnic meal, sometimes it’s based on a holiday.)\n\nMy veggie hating kid recently had broccoli cheddar soup and ate the whole thing without complaining!\n\nThe kids learned not to yuck someone else’s yum, because they don’t like it when someone complains about the meal THEY love.\n\nNTA", "NTA at all. I think EVERYONE should get involved in the menu making AND the cooking. Me (56M) and my Wife (56F) sit down, plan our menu and then spend a couple of hours cooking two lunches and two dinners. If you are already doing breakfast and lunch it should be cake for you to prep 4-5 dinners.  We find it very tolerable to have the same dinner twice in a week.  So, M/W one dinner and T/TH the other. So, it should be easy for you all to make several dishes ensuring that everyone gets two meals they like for the week.  With EVERYONE cooking (kids too!) I bet the complaining drops like a rock.  Plus, the kids should learn to cook anyways.  17F is virtually and adult.", "let’s be sure to clarify: you are a mother of 3, not 2.", "The most repeated saying in our home when it came to unreasonably picky eaters - \"This is not a restaurant.\"\n\nThe gagging and making faces is incredibly disrespectful and a learned behavior on the part of your children.  I can't believe that this was not corrected and allowed to continue for so long.\n\nYour husband and 17YO are capable of fending for themselves individually to suit their tastes.\n\nYour husband should take over cooking for your younger daughter so he can see what you've been dealing with for so long.\n\nUntil your family can show you respect and appreciation for your efforts, cook what you enjoy and only for yourself.", "NTA By my count, there are 3 people in your household capable of cooking and a 4th that's of the age to learn. It shouldn't fall on you every night. Especially when they are all so picky. Let those other people take a turn trying to cater to everyone while you take a well-deserved break.", "NTA. They need to learn what it’s like to try to cook for people. Each of them should have to make a dinner or two a week. If you took something they made and after trying a bite throw it in the trash it might start to sink in the way they’re treating you. Don’t let them whine and pout their way out of this one. I think your husband has just found himself on the f around and find out graph and doesn’t like it.", "NTA and a big hug. I understand how it breaks your heart, it does mine too when my cooking is unappreciated but yours is a huge bump up than what I experience and I'm sorry for you.  And I think you are doing the right thing, not to punish them but to protect you.", "NTA - if it were me, and I spent the time cooking, and my husband came home and made frozen pizza, I would tell him to shove it up his ass.", "NTA. Your husbands insanity has sadly turned your children into dysfunctional eaters, a problem that will haunt them for life. He’s a bum.", "No way I would have catered to picky eaters choice. Eat whats on the table or make your own food NTA", "Is \"you eat what's put in front of you\" not a thing anymore? This is how I was raised and I am the least picky eater I know", "NTA. But maybe it's time to teach the kids to start cooking. Especially the 17 yr old. They have to learn at some point. Also talk to them about how their reactions and disrespect make you feel. So it's now their turn to step up and cook a meal every week that they're responsible for, and mom or dad will supervise.", "NTA he's got every right to be picky, and being so picky he's got every right to make it his way his damn self.", "NTA - I have a very low tolerance for picky eaters. Exceptions of course for allergies and religious reasons. I would have woken up three days laters if I had some of those reactions to food as a kid.", "When my mom changed work hours and started to come later, she asked me to make dinner. I was in HS. Basically she took out some meat from refrigerator and make it thaw until I come back. The first few times I tried to appease everyone. Later I decided screw it if I have to prepare it, they will eat what I made or prepare something themselves and started experimenting. \nOP. Husband is lazy, doesn’t want to do it and is trying to guilt trip you. The options he had is to cook himself or eat what you prepare.", "NTA. Picky eaters can fend for themselves. A 10 year old can make herself mac and cheese. A full grown adult can put on his big boy pants and make scrambled eggs to his own liking.\n\nMake food that you want to eat. They can join in, or you'll have leftovers.\n\nI can't imagine cooking for people who gag at my food. It's gross that your husband taught them to act like that.", "NTA!!!  \nIt greatly depends what people think \"appeal to kids\" means. I don't make Greek-style lemon chicken soup, but as a person who grew up in Chicago with a very specific style of Greek-style roast chicken, I always season roast chicken with lemon, garlic, and oregano. It's just the way chicken is made, right? \n\nAnd I've got teens who have eaten that kind of roast chicken their entire lives and loved it.\n\nSo it's not about your cooking. It's about them refusing to meet you half way.", "NTA because regardless none of them should be acting like that \n\nrude is rude, and is unnecessary. ur husband is immature and awful for treating you so terribly and then having the gall to say that you \"hate him\" for simply being tired of ur efforts not being respected\n\nhim complaining about meals being repetitive got me. how is he so unaware? \n\ni do wonder though, is he maybe on the spectrum?? needing spaghetti with only one specific brand of sauce & this comment makes me think that's a possibility\n\n>I've asked her about her son's pickiness and she just rolls her eyes because she struggled with it too. When he got old enough to do farm work with his cousins (13/14) he started buying his own food: chicken-flavor Maruchan ramen, Apple Jacks, and Knorr noodle packs. That was what he ate rather than mom's food.\n\na lot of adult \"\"picky eaters\"\" or people who have a \"texture thing\" are. people on the spectrum usually have \"safe foods\" that they can always eat unless the brand changes its recipe or something. i'm no expert though just a thought. \n\neither way, there's no excuse for being this rude and disrespectful. you are not their servant, being respectful is the least your family can do", "I am more concerned about the daughters being unappreciative and flat out rude to the mother than about the husband being upset that he finally got to cook his own food. I think OP needs to work with the youngest daughter at least (not sure if the oldest is the salvageable case), to teach her how to be considerate and grateful. I hope it's still possible. NTA of course.", "NTA he's just mad he has to be responsible. Let him cook for them since they all want to be picky and then he complains there's no variety because they're all picky as hell. All spouses of picky eaters should just make their spouse cook their own food if they ever complain. If you can come home and eat a frozen pizza, I'm sure you can figure out something to eat.", "Why is cooking default your chore and then when haters hate and you wanna switch suddenly it’s a punishment? Screams of rude sexism. NTA. Let mans cook for the next ten years, see how he does.", "NTA when I was a kid there were two options at dinner. Take it or leave it.\n\nI do cater around specific tastes myself but I wouldn't put up with this.", "No more cooking — that is the only plan of action. Your daughters are old enough to assist their dad in cooking. Make it one night a week for the 10 year old, two nights for the 17 and the rest dad. The 10 year old can easily make delicious sandwiches. You can just do the dishes. But no cooking. What a wasted effort! As a hobbyist cook, I would be heartbroken. NTA", "NTA of course, but you should be expanding on what you’ve already done. The 17 year-old can *also* cook their own food if they don’t like what’s being served. Honestly, both children have probably learned from their father’s example of refusing to eat perfectly good food.", "NTA & I'm shocked you've put up with your DH this long.  Do any of them have genuine food aversions or are they spoiled?  IF they have food aversions, then it may not be able to be helped  All 3 of my kids are AuDHD & along with that comes food issues.  I came from a home where you ate what was put in front of you & survived.  I was also government cheese poor but my mom was a fantastic creative cook who could stretch a dollar.  I thought I'd be the same with my kids.  Having a kid scream & cry all night long because they were hungry but literally could not eat the food you'd served them for dinner broke me of that notion.  Instead I educated myself on food aversion, saw a dietician & work with them to make sure they get the needed calories & don't go hungry.  My oldest was in the 1% for weight.  That's more than pickiness we've got him up to around 5%.  We do introduce new foods & try to expand their palates.  Success varies.  Sometimes we made two separate meals.  Sometimes we make a meal that everyone will eat different elements (plain spaghetti for two, spaghetti with meatballs for the third) & there are a few winning meals we all will eat.  I could not have survived this if my DH also had food issues & was an ass about it.  He's an adult & can help you plan & execute a meal plan.  I'd also involve the kids in meal planning.  And finally, have a standby meal for them.  My DH's standby was PB&J or JTM burgers when he didn't like what his mom was making.  He also had to make his own food if he wanted something different.", "NTA I grew up with my grandma and my brother and I were really picky eaters. I've never gone into it much but it's probably boarders more into food sensitivity due to neurodivergce. The one thing we never did was complain. If you didn't like something it was said politely, there was never gagging at the table. It was up to you to suggest an alternative not for the cook to figure out. It was also understood that variety was not going to happen.", "NTA Your family members are all cruel. \n\nI won’t even cook for friends who feign gagging, describe how disgusted they are by what I cook and/or eat. In fact, I avoid picky eaters unless they have a medical reason for their dietary restrictions.\n\nObjectively, your family has made you cook multiple meals for every dinner only to insult you. It’s long overdue for your husband to get a taste of his own medicine. \n\nI recommend that you start cooking for and eating with friends who will enjoy your cuisine. Cooking for open minded eaters is a pleasure.", "NTA! Grown ups. 17 and 10? And a Grown man??? You have drawn the line. Stick to it! Dad can feed the selfish nitwits for a while. Prepare food for yourself AND ENJOY IT! Have these people learned good manners? Uh....no! I am not a good cook but my children knew where to find the peanut butter!  Sad for you that your feelings have been hurt. We can't please everyone, might as well please ourselves.", "No, you are definitely NTA. I get that people having varying tastes but the rude behavior alone would have had me on strike a long time ago. There are plenty of ways to express opinions without being shitty, especially to someone who made an effort for you. Your husband has set a horrible example in HOW he rejects your food \n\nI suggest continuing your strike but also requiring your kids to start helping him in age-appropriate ways. And I hope you have some personal disposable income so you can indulge your own tastes while this is in progress. \n\nGood luck.", "Doubt my input is even needed but absolutely NTA.  Your family wants to complain about meals all being the same and boring, while also complaining whenever you try something new. Your response was perfect and honestly was due WAY sooner than this. You laid it out pretty clearly. If your family isn't going to eat the meals you make, and what's worse they're going to show clear blatant disgust and disrespect towards your efforts, then fuck it you don't have to cook for them. It's not like it was ever your duty to do the meals.\n\nA couple extra points:\n\n1. Personally, if it were me, I'd even just start cooking dinners just for you. You clearly enjoy a wide variety of food and like to explore new options, and if you're already committed to having the rest of the family manage their own dinners (absolutely reasonable, again as I said above), then you might as well occasionally try smaller recipes just for yourself. And who knows, maybe you can get your family to occasionally try small bites to see if they like it and maybe work back to making meals for them again, IF that's something you have any interest in, which leads to:\n\n2. While I don't ever want to discount that many people can be picky eaters or even just have specific food aversions (especially at younger ages), based on your daughters' reactions, I think it might be more of a learned behaviour than genuine dislike or pickiness. They both seem incredibly comfortable with showing a frankly absurd amount of disgust, and throwing meals away, on a seemingly regular basis without even a concern for your feelings or efforts.\nI think they're mostly picking this behaviour up from your husband and feeling emboldened by him. Even if this isn't true though, your husband really really needs to be freaking talked to. He's acting like a damn child and the only thing that I think his longstanding history of pickiness truly says is that he's not actually picky, he's just stubborn and close minded. \n\nSo anyway yeah! I sympathize with you pretty hard, my family has a similar lack of interest in the food I try to make (but I'm not cooking *for* family, just occasionally around them, my parents and siblings) and I just decided a long time ago that I'd rather put in my own effort to make food I really enjoyed than be stifled by my family's pickiness.\n\nOnce again NTA, and I hope for the best for you, I'm sorry your family has been treating you this way for so long", "Nope! NTA. I am the pickiest eater in a family of picky eaters.  There are things hubs and I eat that the kids won't do my 12yo will make mac and cheese and hot dogs on those nights for herself and 2 younger siblings. On nights where hubs, 9, and me eat stroganoff? Her and 4 decide on what the 2 of them will eat. On nights where they want spaghetti  (which I don't touch) I make that and the a little something for me.\n\nYou have the grace and patience of a Saint. It will do good for them to make their own food and plan their own meals without \"being repetitive\"", "NTA. How old is your husband? 11? He sounds like a baby lol. When I was a kid we got 1 option.", "My 3 year old eats better than your husband, it’s not you, it’s them.", "I grew up in a time where you ate whatever was cooked or you didn’t eat. Maybe you should start cooking things you like and they can eat it or not. NTA", "Ugh. As a person who absolutely loves cooking and looks every time to see my husband's reaction at the first bite...this would kill me. NTA.", "NTA. Domestic neglect and weaponized incompetence are marriage killers.", "Off topic, but I can’t believe how many situations in this sub have me profusely thanking my husband for not being a prick.", "NTA, and your daughters are also old enough to cook dinner once or twice a week (together with the older one supervising)", "NTA. They would starve at my house.", "Nta. I did the same thing. Sick of complaints about what we were eating or how often we ate something, yet no one wanted to offer any ideas. That was 10 years ago. Now my adult children beg me for my city chicken, fried chicken and roast and potatoes. Now 2-3 times a month I will cook for them and enjoy it but that's it. Once I got over the \"mom\" and \"wife\" guilt I couldn't be happier.", "Jesus fucking Christ, you are living with three kids, not two. Stick to your guns. NTA", "You realize your husband admits he is a child?\n\nThe fact that you put up with him for that long is honestly a miracle.\n\nIf his excuse is that you can’t expect kids to like it, what about him?\n\nHow long has it been since he started cooking? What has he cooked? How many people have eaten it (primarily the kids)?", "NTA. I was cooking when I was 10. Things were different in the 70’s, I know. However, they are both old enough to learn how to prepare their food. A fun kid’s cooking class or even a “weekend with mom” shopping/cooking adventure could help instill a sense of accomplishment and knowledge. \n\nIf you show them how and (not make it a punishment) they can fix things that they like, your struggles will ease.", "Nta, get that 17yo to work too. She's old enough.", "NTA. I was getting a headache just reading about all the various things your family does or doesn't eat/like etc.  And I don't even live with you.  I don't know how you can keep track of it all.  Actually, I do know.  Because I'm a parent too and everyone has something and as mothers we kill ourselves to take care of our families.  But to have responses like gagging and making faces over and over and over for meals you work at to prepare, your whole family is being disrespectful to you.  Your girls do it because your husband modeled it.  Cook for yourself.  At 41, 17 and 10 they are more than capable of making meals for themselves.  Take care of you. And don't feel guilty.", "Your family is beyond rude.  NTA", "NTA, it’s unfair to make it mainly your problem and that’s what your husband is doing. Could your family be autistic though? That would explain a family of picky eaters (at least it’s the explanation for mine) \n\nAlso sometimes it’s impossible to make something everyone likes and that is really annoying and impractical, but it is what it is. Then planning alternative meals is the best solution, though again that should be on everyone, not just you. Like maybe you start telling them what you plan to make in advance (if it’s new, include the ingredients too) so they can tell you beforehand if they will eat a full portion, want to try it but aren’t sure if they’ll eat a full portion, or if they will arrange an alternative for themselves. That way you can make something without eating leftovers for a long time or throwing food away", "NTA I have a similar issue with my husband and kids. I'm a SAHM, but I'm not willing to make 3 separate meals. Our compromise is that I feed the kids and myself. My husband can either eat what I've made or fend for himself. Thankfully though he's happy with that deal and it's been working for us.", "NTA, he & your daughters can do the cooking. & when they complain, remind them of their behavior.  Especially your husband.", "NTA, Wow. Let them get hungry, they'll figure it out or they won't.", "NTA, your husband needs to appreciate the effort and open his eyes to the pickiness that is in the house. I say turn to frozen meals going forward. No prep time, everyone can still get a healthy meal, and everyone can choose what they want.", "NTA you can cook for me and my family and we will enjoy every bite", "NTA. Also, a suggestion for your 10F child, instead of nuggets and mac & cheese. You could opt for a healthier option of what my parents used to make me as a kid when I didn’t want the original meal. It was a simple egg fried rice and sometimes I’d mix ketchup on it. The flavours are mellow and enough to appeal to a kid’s taste buds without the nasties of frozen nuggets etc.", "NTA - everyone in that household is old enough to cook for themselves.", "NTA.\n\nI've faced this myself. My ex-husband and 2 older kids were old enough to cook unsupervised. My youngest liked everything. Every so often, I made a meal from the small list of things that everyone would eat, but the rest of the time, I cooked for myself and my youngest. Of course I got complaints, but I told them I wasn't making 4 different meals any more. The ingredients for meals they liked were always available, but they ate cereal for dinner quite often. It worked. Now I laugh when my oldest son complains about his picky kids.", "Omg sounds just like my dad. He”ll only eat like 10 things (all junk) but complain to my mom he’s tired of the same things. I don’t know how she puts up with it. This is the same man that yelled and ranted at me as a child if I didn’t eat what was given to me. I don’t like meat. But I eat a much wider variety than he does.", "NTA. They are being incredibly rude! Moving forward, you should cook only for yourself. Your husband and 17 y/o should be capable of making their own meals, and the 10 year old can assemble a sandwich if need be. (For the sake of thoroughness though I will say that some of the dishes you mentioned, like shepherd’s pie, would be a hard sell even in my family of not super-picky eaters.)", "NTA.", "NTA. Not even close.", "NTA. And I’d get them each involved in meal planning and cooking.", "NTA - Christ that sounds exhausting. I don’t blame you for not casting your pearls before swine.", "NTA, honestly your husband and the older kid can fend for themselves, I’d say maybe keep making something for the 10 year old but start teaching them to cook simple stuff until they become self sufficient in the kitchen.", "NTA. Invest in an air fryer and send your hubs and kids a few YT videos on cooking. They will learn right quick how to be respectful.", "NTA. You are my hero.", "Oh my.\n\nNTA\n\nAnd that's coming from someone who doesn't cook.  They've been fending for themselves for many years.  It can be done.\n\nMy husband eats frozen microwave dinners, frozen burritos, etc because he doesn't have the patience to actually cook.\n\nMy kids are grown, but when they started part time jobs in high school, I stopped cooking for them because I wouldn't cater to their schedules.\n\nI was a full time working Mom. If you are old enough for a job, you are old enough to fend for yourself.  Did their own laundry too, because I wasn't going to jump to \"I need it washed for tomorrow\".\n\nHaving said this, I bought a TON of frozen prepared things, or quick meals, so that it was quick and easy when they were hungry.  If they were \"cooking\", I'd teach them as they wanted to know.  If husband grumps, I say \"tough\".  We can swap alternate cooking days, prepping meals for both of us. He grumps about that idea even more, so he eats what he scrounges.\n\nMy kids have been gone for years. They have always functioned well as adults, caring for themselves, because I sent them out with skills.  In fact, my son is a way better cook than I, and he insists on doing family dinners, in my kitchen.\n\nThey all say that I \"can't\" cook.  I am a lousy cook.\n\nI'm not. I'm actually very good when I choose to be.\n\nI just don't choose to be.\n\nGood luck, OP.", "NTA. I am not necessarily a fan of \"eat what I cook or don't eat,\" but there is a line and all of your family members are crossing it. Your husband and eldest are old enough to understand why this is a problem, why it is hurtful, and how their behavior is exhausting. The 10yo gets a pass because, obviously, little kids can't always think empathetically. The spaghetti example is a good one. I would literally say \"okay you all want it differently, you won't try eating each other's versions, so I'm going to boil the noodles and heat a sauce and the rest is up to you.\" Like... literally everything would need to be taco bar style, if that makes sense. You want an egg? You make the egg. You want ground beef? You cook it. I would get you halfway there.\n\nThat or eat a frozen meal. Honestly OP, stick to your guns. Start making servings of what you love to cook for 1 and tell them they're welcome to figure it out, especially the older two. If they're not even going to try new things and not act like children (except the one who is a child ofc) about a free meal, then they can make it work. They're not treating you like a person with feelings, they are treating you like an in-home chef they can boss around ad there's 0 gratitude. The only other thing I would suggest trying without compromising your very correct feelings is to say \"okay, why don't you two look up some recipes for next week? Find two each that you really think you'll like and I'll make them, but I'm not putting in all the effort anymore. And if you don't like it, then either eat it and suck it up or go grab a can of spaghetti-os.\"\n\nAnd a final thought: if the teenager and the hubby decide to live off frozen food and fast food... let that be on their dime. I would not even give them money for it when you've already cooked all these meals for naught.", "JUST FYI: Shepherd's pie is made with lamb. Cottage pie is made with beef. \n\nNTA for expecting them to fend for themselves if they're so picky though.", "NTA\nHusband isn't helpless and he does not understand how unreasonable he is. You constantly whine and cry about the food you make then he can make his own. As for the 7 year old est or go hungry because at this point will not be running mama into the ground. 17 would immediately be getting a cookbook and cooking for themselves no arguing or excuses. They can make their own lunch and heat up all the microwave meals they want. Stick to your guns. Make and explore food for yourself and enjoy. While they sit at the table and enjoy their meals. No attitude at all let them know they won't like it and if they don't want to try it here is the recipe to make it, however you will not be cooking for them.", "Absolutely NTA, and the only person in this story who gets kind of a pass on their behavior is the 10 year old. From what you said it seems like your main problem isn't even having to prepare variations of meals but the way your family reacts when they don't like something. Your whole family could do with learning some basic manners, especially your husband who is in fact an whole adult who should be supporting you. I can almost guarantee that it is his example of dismissing your cooking that the kids are following.", ">A couple of nights ago I made a shepherd's pie. I used a new recipe with seasoned ground beef (3/3 like), peas (2/3 like), and tomatoes (1/3 like, 1/3 tolerate) with a turmeric-mashed potato top layer (2/3 will eat mashed potato).\n\nSo, you made something you knew wouldn't go over well with most of them, and got upset when it didn't go over well? That's a bit silly, IMO.  \n\nI don't think you're an AH, though. Trying to appease everyone seems impossible, and instead of helping, it seems like your husband is just complaining.", "Your husband and children sound very ungrateful. \n\nNTA\n\nI hope that they learn how to be respectful and polite and not be such absolute immature babies about food.", "NTA at all, but out of curiosity, have any of them been assessed for something that could be *causing* the pickiness? I only know of three things that could cause it: ADHD, Autism, and ARFID.\n\nADHD and Autism both tend to come with sensory issues, though they aren't the same 'type' so to speak. With Autism it's that the food texture, taste, or smell can feel bad or wrong. In my experience, it usually makes me literally feel nauseous to try and eat things with a 'bad' or 'wrong' texture or taste.\n\nWith ADHD it's more that those things can be overwhelming or underwhelming, which makes it difficult to eat those types of things.\n\nARFID, however, is the one I'm honesty more leaning towards. It stands for Avoidant-Restrictive-Food-Intake-Disorder. It's relatively new, I think. You can probably learn more about it here: [https://www.nationaleatingdisorders.org/learn/by-eating-disorder/arfid](https://www.nationaleatingdisorders.org/learn/by-eating-disorder/arfid)\n\nWhile I think ARFID may be more likely, don't dismiss Autism or ADHD as impossible. Girls actually usually show vastly different symptoms, or present those symptoms differently, than boys. If you go to look up the symptoms, try putting in 'Girl ADHD/Autism' instead of just ADHD and just Autism. Also, maybe try to find some personal stories from women with ADHD or Autism. They may be able to explain some things in a way that normal google can't.\n\nThere also may be other similar things that can cause pickiness to such an extreme, but I don't know what they could be. You're kids also really could just be that picky, which is being enabled by their dad essentially doing the same thing as they are. It honestly could be any of these things.", "Oh no. NTA stop cooking for these ungrateful people. Tell them to figure it out for themselves. Your mistake was putting up with this crap in the first place. Time to fix it.", "NTA\n\nYour husband is immature and manipulative. He's basically trained your kids to hate your food because of his behavior. Aside from the fact he has the palette of a 4 year old and similar maturity around the subject, the diet is completely unhealthy. There's no nutrition. If he wants to live off box foods forever, he's perfectly capable of doing that for himself.", "My mom made a lot of prepared food I couldn't stand.  Ate it all thankfully because I didn't want to cook anything.\n\nNTA.  Don't cave, and only cook/bake if you want to.", "But there is no way I would put turmeric in a dish with picky eaters in the house. Do you always add strong spices like that? Just wondering. That said, I would not tolerate those reactions in my house. No way. You eat what I make because I go out of my way to accommodate everyone's likes and dislikes. Show the cook the respect she deserves. NTA", "This is the damn hill you die on OP! Jesus let them feel how much you actually do for them all! \n\nNTA but honestly ur husband and kids sound ungrateful af!", "OP, your family is treating you like garbage and you don’t deserve it. Even the 10 yo is well old enough to understand it’s hurtful to gag & make nasty faces over food someone took the time to cook for her. Nta. And if they’re all gonna be that picky they need to learn how to feed themselves and deal with it!", "Ikr? How is he 41 and ‘doesn’t know what to do’. That’s beyond pathetic and embarrassing. NTA", "If my parents made something I didn't like, for example gorgonzola sauce for pasta, I had to make my own sauce. \nAnd I learned to cook when I was 14-ish and took up the task after my dad moved out and my mom had different working hours. \n\n>She will shop/cook or starve.\n\n\nYeah, well. That, if you don't have a good meal service at your college/uni. The ones in germany mostly serve lunch Monday through Friday, maybe on saturday \n\n or you can do it like my roommate and eat lots of ramen and other \"just add water\" stuff and toast. She can cook, rather well as far as I know, she just choose not to", "DH needs to get them all into some cooking instruction, since he set the pattern by being so egregiously picky in front of them", "Honestly these are the kids that get upset and grossed out when other people eat normal fucking things. \n\nNo one is gonna accommodate them in the real world and they will definitely feel entitled to that tho. \n\nI cant imagine her meeting future in-laws and actively gagging at something like a pasta dish or any type of fusion or asian dishes. \n\nJesus my son should bring a girl home and myself loving to cook got told my food is gross.. the door !!!!", "A 10 YO is old enough to make a PB&J or bowl of cereal if they don't like what's on the table.", "And why is it he can’t cook?! Why is it default the woman’s job?", "Absolutely no. It doesn't matter if she works or not, it is not that she is not willing to cook, but about her not willing to cook eith the amount of disrespect the rest of the family is giving her. Gag? Make faces? Really? OP is NTA, the husband is.", "If you continuously make efforts for people who are incredibly rude about those efforts you don’t have to keep doing it. Stay at home parent or not.", "To be fair, the person that ought to have taught them not to gag and be rude is their parent, so OP is mildly TA for not doing that and letting more rude people into the world.", "Avgolemono! I had some leftover rice and it was super easy and tasty!\n\nI thought so anyway, and 17F said it was very good as well.", "It was only in the mashed potatoes, not the meat. I usually make Shepherd's pie with meat, regular mashed potatoes, beans, and maybe another veg. It usually goes down well but it was made \"too often\" and if I didn't use the right kind or beans or if the potato layer was too thick it got funny looks so I was just trying a different recipe.", "You shouldn't have had to dump it on him, he should have been helping cook for the family this whole time. NTA", "I mean, not me usually. It was a new recipe since my usual Shepherd's Pie was made \"too often\".", ">please learn to cook.\n\nProjecting much? Did you read the question? Literally about OP no longer cooking and nothing here suggests that the kids are prevented from cooking\n\n\nOP has stopped cooking so its up to her husband or the kids to learn to cook. OP can cook for herself and enjoy her meals", "I mean, I might be a terrible cook? No one else has ever complained, and I often get asked to make the pies for family gatherings. I practiced tiramisu using three different recipes for a solid month before I considered it \"good\". I used my husband's coworkers as test mouths since he wouldn't touch it.\n\nAs far as chores, the girls do sometimes help but I can't reasonably expect 10F to haul bales of bedding or shovel muck. She has a chore schedule that includes helping to make breakfast on weekends, grooming the pets, sweeping the walk, etc. 17F is mostly buried in school work and sports practice but she also helps out filling the wood stove, vacuuming the carpets, etc as needed.", "/r/iamveryculinary", "Yes, and sometimes it's understandable. Like husband always said he can't stand pork chops, because his mum grilled the life out of them. I made them baked and glazed and those went down better.\n\nHowever he also said he couldn't have tomatoes as he was allergic. I asked how that could be since he routinely ate pizza, tomato sauce, ketchup, and chili. He said he's only allergic to it is it's in pieces.\n\nI called bullshit and he grudgingly admitted that he probably just didn't like tomato pieces.\n\nSo I guess... sometimes it's a traceable thing and sometimes it's just bull?", "Husband has a mild food allergy to onions, so those are not used in the house (unless it's something solely for someone else like salsa - he has to ingest it or handle peeled onions to get a reaction). He's been to a doc for stomach/digestive stuff and aside from a recommendation for more fiber, there was nothing wrong with him. 10F's regular pediatrician says she seems healthy and isn't malnourished so they're not concerned much over her pickiness as a medical problem.", "Thing about that: I bet they’d all make whatever individual thing they wanted, then leave those individual messes for her to clean up. If they are this picky about meals, and used to being cooked meals, I guarantee they expect her to do dishes too.", "Turmeric is a strong spice?????", "Turmeric is not strong, holy hell. It's less of a flavor than black pepper.", "is turmeric considered a strong spice? i’ll throw it in a lot of dishes that don’t even call for it or isn’t typically used with that kind of cuisine just bc it’s apparently really good for you and it doesn’t really taste like anything imo. i find it quite mild", "Lmao. Tumeric mainly colours food: it is not a strong spice at all.", "I don’t know if it’s strong but it sounds gross in Shepherds Pie.", "DH? Deadbeat Husband?", "This! I dont give a shit whether my kid is a grl or boy... in my family some feel men shldnt cook fuck tht. \n\nI will teach them! I am a mom not a slave! \n\nAnd cooking is a damn life skill. If u dont like wtf i make go make urself something by all means. It helps kids learn the value of someone actually taking time out to prepare a whole meal for them", "You are so NTA, OP.\n\nWhen we didn't like what my SAH mom made for dinner, she'd tell us \"you know where the hot dogs are\".   Even as little kids we all knew how to cook a hot dog.  This was about 60 years ago.\n\nNow with microwave ovens, it's ridiculously easy for a child/teen to make their own dinner.\n\nAnd I just HATE to read that someone casually throws food in the trash.  They know they are picky eaters and so do you.  Insist they take a taste rather than fill a plate they are likely to toss.", "We had the option of a peanut butter sandwich, with or without jelly, and we had to make it ourselves, if we didn't want the dinner Mom cooked.\n\nMostly, we ate dinner. The PB&J option was designed to be as boring as possible, to encourage us to eat what had been cooked for us.", "One of the first meals my kiddo learned to make was pasta with a butter sauce and oven roasted veggies. \n\nThere are so many really simple and delicious foods young kids can make.", "Stop second guessing yourself.  You have let them erode your self-esteem.  Start enjoying your life.  Learn to cook some gourmet dishes.  You seem like you really enjoy cooking.  Don't let them take that from you.", "This is totally reasonable. Over covid, my husband got it in his head that going to get take out twice a week was the same as me making breakfast, lunch, and dinner 6 days a week and refused to lean in with dishes (which were reasonable, I only cooked one pan meals at the time becuase of the volume of how much I was cooking) or even take a couple meals off my plate because \"he didn't ask me to put in that effort\". He also would get himself snacks without bothering to ask me if I wanted anything, so all my food effort was his, but his food effort was also only his, and he didn't see anything wrong with that. \n\nSo I said fine, you're right, if you can't pick up even a couple dinners and you don't value my efforts to ensure you're always fed with a decent meal, then we're going to be responsible for our own meals from now on, because I value my cooking even if you don't. He made his own cereal for breakfast because I no longer made hot breakfast, he made his own sandwiches for lunch because I would make whatever I'd make for myself on my own, and he was on his own for dinner. I'd buy groceries if he asked, but he'd be the one in charge of figuring out what he was eating each night. We also washed our own dishes and pans that we used the entire time. \n\nIt took 3 weeks before he finally started missing the meals I made him and he apologized. We trade off breakfast, he makes every lunch, and he takes at least one dinner a week off my hands now, which has taken so much pressure off me on a day-to-day basis. \n\nYou enabled your husband by allowing these habits of his and his treatment of you to go on for long enough that your kids think that it's okay too. Getting him to take responsibility for his meals if he's going to complain about them incessantly and making your girls recognize that you deserve respect for your efforts is a better late than never endeavor, because nobody but you and a restaurant are going to allow them to behave that way at dinner inside their homes.", "It's a reasonable boundary. Late to be set, but totally reasonable.", "I'm kind of aghast that they're allowed to *throw it away*. That's such an incredibly wasteful thing to do. I know you probably don't want to be eating leftovers for 5 days, but allowing them to dump it into the trash hurts my soul (unless they're tossing it into compost which is slightly less bad).", "It's ok to show your children that you are hurt and upset.  As a good parent you should also model healthy self-care, which includes not doing things that hurt and upset you on a regular basis.", "She's 10 and didn't know what pepper was? Your husband has done them a serious disservice. It's one thing for an adult to be picky about what he eats, that's fine, he can do his own thing. Definitely not okay when his childishness has consequences. \n\nAre the young ladies at all interested in learning how to prepare versions of things they do like? Maybe if they start having to help prepare their own picky ass meals, they may realize how tedious it is. Or they'll at least have some skills besides frozen pizza.", "I don't mean to be That Redditor, but reading made me wonder if your husband and possibly both your daughters but especially 10F have ARFID. Or even if not explicitly ARFID, that doesn't mean their \"picky eating\" isn't based on something diagnosable--it's SUPER COMMON to have texture/taste issues if you're on the ASD spectrum, or have ADHD. This isn't to let your husband off the hook at all b/c he's totally an AH with how he treats you and has trained your daughters to also be disrespectful toward you/your cooking, but I honestly would consider a medical evaluation for all three. If you can identify the reason, it will be easier to approach therapies/strategies for the \"picky eating\" to at least try to make your daughters functional for when they are adults.\n\nI can tell you as a mildly picky eater (like SUPER mild compared to your family--I have issues with seafood, pork, and mushrooms) that you face ridicule, censure, and judgment from some people for these things. They will treat you like you are \"crazy\" for not liking X thing, then be annoyed, and in many cases treat you like a burden. You may be excluded from friendships/relationships because of it. I haven't experienced the latter much because my list is very short BUT I have friends with comparatively severe dietary limitations who have faced ridicule and exclusion their entire lives. They've expressed shock when I've bent over backwards to ensure they are NOT excluded from eating out with me, or a dinner party... through my mild pickiness, I've learned how I like to be treated, so I do unto others.  Yet I'd definitely struggle w/ a person like your husband b/c attitude is very important. No one likes an entitled, petulant picky eater.", "Hey. Your husband making faces and gagging at your food is completely unacceptable, picky eater or not. And he’s taught your kids it’s ok to disrespect your hard work. You deserve better than that.", "Start cooking for you and just you. Maybe the kids will want to try. Maybe they won't. But don't bother actually making anything for them. \n\nI would have lost it years earlier than you did.", "So a sexist division of labor. Hell nah. You’re overworked and he can do all the cooking for here on out!", "I totally hear ya - I just wanted to give the benefit of the doubt and acknowledge they may have divided labor with consideration to whose-job-was-what initially in their family.\n\nAnd it does matter if she works, and here's why: \n\nSome couples have one person work outside the home and agree the other will take care of the work at home, which usually does include cooking. Being a homemaker IS WORK, so if that's the job she agreed to do to support the family while her partner leaves to get cash income, and it's balanced in that fashion, her not doing part of it would have been something that required renegotiating, which is totally normal as familys grow and age. It would require a different tactic to get what she needs fairly, but knowing how their home works is important to giving useful advice, so I asked.\n\nHere's the thing about gagging/faces at food: LOTS of folks have taste and texture sensitivities and don't have control over what their reactions are. Picky eaters are often neurodiverse and experience actual suffering at some things you might just think of as unappetizing. \n\nYou're right - the disrespect is one thing. But having food sensitivities isn't disrespect. It's just a biological difference. The only disrespect I see here is Hubs' refusal to acknowledge that his wife is cooking a minimum of two different dinners a night, that he doesn't try to help, and that he feels it's appropriate to critique her labor's variety. Which is about the WORK, not about the food. People are allowed to not like foods as long as they take the responsibility to work around that distaste themselves.", "I mean. Nobody ever has to anything, really. \n\nBut I'm hearing other issues that are important to consider.\n\nThe experience of not being able to swallow food is real. You're lucky if you've never had to live with it. It doesn't give the right to be rude about it AT ALL, but the reaction itself is valid, and Mom here is cool AF to acknowledge the issue her kids have. The rudeness issue isn't the gagging. It happens, and it sucks for the person gagging just as much as the person who put the effort to cook in. I'm super hesitant to characterize that part as rude.\n\nThe rudeness comes mostly from Dad's comaints about variety, because it's just whiny and unappreciative in this situation. It's OK to dislike food and be unable to swallow, but you have to be considerate and respectful about it and willing to help yourself find food you CAN eat. A 10yo is ready to learn this, the 17yo needs to learn this, and the husband should have learned this a long time ago. \n\nI've kept saying, over and over, that Mom/OP is NTA. But not being the asshole doesn't make the situation better for anyone. \n\nWhether or not she works is actually really important when you look at rebalancing the division of labor in families. So no, this doesn't excuse family rudeness, and no, she is NTA. But her time available is part of the big picture. So I asked if she worked.", "Boo fucking Hoo, the kids didn’t like it.  Welcome to your wife’s world, pal", "Excellent, thank you!", "FFS He is past the point of reason. So he will eat pie crust for a classic raspberry pie but use it on French silk now he hates it? Hell no. There are things I don't like and my SO as well. Everyone has some foods they don't care for but this is like it's his personality trait at this point. Monkeys would fly out my butt before I would keep catering to him.", "NTA\n\nGet a loaf of bread, some lunch meats and cheese, peanut butter and condiments and put it all on the table. Fix what YOU like and let them fend for themselves for awhile.", "Oh no, that sounds like mostly bullshit. Props to you for sticking it out for so long. Your husband is setting an awful example for your kids. Good luck!", "Its so wild for me reading some of this because I grew up in a \"you eat what's on the table or you don't eat at all\" type of home. I don't agree with that method and think that if someone doesn't like what's there they should be allowed to make something else.  But it kept me from being picky. I remember going to my cousins and her mom saying she would make kraft dinner and being heartbroken when they brought out a homemade Mac and cheese that wasn't good but I still ate it all and didn't say anything till I went home.\n\nI also discovered I loved Bortch this way (idk how you spell it but the soup with beets) went to a friend's and they had canned bortch and showed me how to warm it up. I loved it after that!\n\n\nI have two best friends who are some of the pickiest eaters I know (textures really bug them) but they are always willing to try something, which makes me love them even more.", "Strongly repellant to me. Not strong in the classic sense, but I would not serve it to eaters like the ones in OP's house.", "No stronger than mild ginger but it's SO yellow that it gets strong  reactions", "I only use tumeric for colour basically when i make curries.. it doesn't really taste of anything. It has a strong smell yeah bt i use it whenever i wanna make yellow rice. I didn't know people considered it spicy lol", "Personally I consider it a food coloring :D\n\nWould definitely add some to shepherd's pie to make it look better.", "Lmao this.  To me it adds no flavor and just turns things yellow, so I add it to food all. The time because it's good for you...or if I want yellow food.", "I guess this shows my strong aversion to it! I can taste it in micro doses. I much prefer saffron for coloring.", "The name explains so much.", "My hubs makes a great shepherds pie with Indian spices in sauce and mash. Mmmmm. Now I want some.", "Generally \"dear husband\", just an online abbreviation for \"OP's husband\".", "Not usually, but in this case, accurate.", "Lol it’s Dear Husband", "Supposed to be dear husband but yours works better!", "Yeah kids can make a sandwich on their own if they don’t want to eat dinner. Both are old enough to deal with it. Husband can make himself a sandwich too!", "Agreed. I have incredibly picky niblings. I always said to them they had to try one bite and if they didn’t like it, that was fine. But they had to try it before saying they didn’t like it. Then they could make some chicken nuggets for all I cared.", "My mom: “There are no hooks in your butt,” implying we could get up and take care of ourselves. \n\nWhen my dad got older and was going through some mental decline we hadn’t yet realized, he turned up his nose at something (uncharacteristic) and my mom said he could eat it or wear it. She felt bad later but I still think it’s funny.", "My friend Renee often tells her kids \"if you're not hungry enough for an apple (or banana, peanut butter and jelly, whatever is offered) you're not hungry.", "I agree, especially with how expensive groceries are. They're creating a ton of food waste but they're also just shaking her wallet out over the trash bag too.", "If you have a shitty boss (your work analogy) who acts like this you wouldn't accept it. Let alone from your partner. She didn't mention sensitivities, just asshole behaviour.", "You might not be able to control your dislike of a food, but you can absolutely learn to control your reaction to it. Plenty of people do it, neurotypical and neurodivergent alike. I’m tired of neurodivergence being used as an excuse to be an asshole. Just because it’s harder doesn’t make it impossible.", "Borscht! in case you want to find the can or a recipe.", "wow. this is crazy just reading. i wish i had the luxury for being \"picky eater\". when i was child. i consider myself lucky for being able to eat. when i was able to. but it was lots of hungry days and nights.", "I feel like there's picky and there's picky. There's \"EWW disugsting!\" and there's \"I don't like this one ingredient, I didn't like it last month, I won't like it next month, and if you put it in my food, I won't eat it.\" For my daughter, it's mushrooms. For my son, it's green peppers. I avoid cooking with those ingredients. If I do, I offer them leftovers, or else I put the offending item in a side dish they can skip. They don't complain.", "You should make borscht from scratch. It’s delicious. Fair warning, it will ruin you for store bought borscht, especially Manischewitz which is way too sweet.", "[deleted]", "Same. My mom was a great cook and she had that rule u eat what i made. Unless ur allergic to it, physically can't stomach it or gonna die if u eat it..\n\nYou get what u get and u don't get upset! \n\nI always tell my cousins whose kids are literally the same as OPs because parents jst allowed it they honestly can't say they hate something when they've never even tried it before. Those kids are skin and bones. They dont eat fruit or veggies or even any meat except for sausage. They won't eat mash so it's usually just junk food in the form of sugar, plain rice and noodles. \n\nNothing that actually adds to their diet properly.", "I am also very surprised and confused", "I love turmeric and to me,  it does have a strong flavour.\n\nIt's definitely not spicy but it is flavoursome to my taste buds -  i could easily tell if it was in a dish.", "Spicy and strong spice are not the same thing. Cumin is a strong spice because it's very flavorful but it isn't spicy. Clove is a strong spice but not spicy. For some people (like me) tumeric has a strong flavor, so I could personally consider a strong spice. I rarely cook with it because it overpowers the dish if it's more than just a sprinkle for color.", "I wonder if it's something like cilantro, where some people are getting a completely different flavor than what most others would taste.", "I mean, I'm a poor enough American that I *do* in fact have to take this shit from my boss. So there's that. \n\nAlso, everyone keeps harping on the family reactions as rude. Again, if you can't eat tomatoes because they make you gag, that's a food sensitivity that tons of (very frequently undiagnosed) neurodiverse (ADHD, ASD, OCD, etc) people have, and it impacts neurotypical people to different degrees as well. I reject the gagging as rude, because I know what it's like to have totally reasonable food in your mouth and be unable to make yourself swallow. It really, really sucks. \n\nThe Dad is being an asshole in his demands for other reasons, and I do keep saying Mom is NTA for refusing to keep cooking. But again, her not being the asshole doesn't improve anything for her, and it doesn't keep her kids fed dinner. What her and her husband's time constraints are is a reasonable thing to consider when looking for solutions to redistributing the household labor so everyone is fed and happy.", "There's a difference between a dislike and a food sensitivity when it comes to sensory processing. You're right - tons of people can and do control dislikes of food, and even sensitivities. And I never said it was an excuse for rudeness. I'm just saying it's not rudeness ITSELF. There are two big issues with what you just wrote:\n\nOne - Sensitivities of this type are not perceptible outside the head of the person who has them, at all, and they come in all types and scopes. Some folks can swallow, others truly can't. Just because some folks who use wheelchairs CAN walk doesn't mean it's easy or that we should force them to. I think it's cool AF that Mom has been accommodating so far, but I also see that it's a ton of work that she can't do on her own anymore. She's in no way the asshole to limit her cooking to breakfast/lunch/snacks for the girls. \n\nTwo - please consider that I, along with my ND counterparts, am more tired of being neurodivergent than you could possibly be about hearing how it affects our lives, and complaining that other people have it hard and that you're tired of hearing about it is incredibly narcissistic. Sure, be tired about it. But saying it creates the impression that you're insensitive at best and a bigot at worst. You're tired of hearing it? Help us fix the issue and we'll shut up.", "Growing up with food insecurity sucked, upside is I’ll happily eat anything\n\nCan’t recommend it, though. Eating paper to stop my stomach from growling in class was awkward", "It's not a luxury for many people.  People with food aversions will literally starve because they cannot eat something that is \"wrong\" to them.  It's not within their control.", "I do make my own but I've used word of mouth recipies from Ukrainians in my area. They just have the best damn food.", "I wasn't disagreeing with you......", "Lol honestly my spice filter is broken so u might be right it is noticeable yes. It definitely gives rice s distinct flavor.\n\nBut as far as spicy goes.. i don't see it. Bt then again I've eaten and made so many spicy dishes in my life what i consider mild is scorching to others. I get into trouble for it alot 😂", "Yes, I found a turmeric chai tea once and it was delicious. Very distinctive flavor, imo.", "Um, I am neurodivergent (ADHD and autism spectrum). What I said stands. You can’t control it but you can control the reaction. My whole point.", "I feel u on this one. Going to bed hungry sucked my family always tried their best. Kinda why i hate soya now tho had a stage where that was literally all we got from shelters. That and like the type of cereal you had to mix with water kind of resembling baby food. \n\nAnd after soya pasta, with rice, soya pie... i just actually started hating what we call struggle food basically because it's all we had as kids so i just had my fill of it and the thought makes me want to throw up.", "Gotcha - I misread your first sentence. I’ll delete my comment. Cheers!", "Me too, love. So you know not all of us are the same, with the same issues, and that saying that if some folks can do something ALL of us should be able to do it is reductive and ableist. \n\nSOME people can control their reaction. Some can't. I'm able to eat strong flavors most of the time and actually like them. Sometimes, though, I legitimately can't swallow them and I gag because my body is trying not to choke because my senses are overwhelmed. It happens, and I'm more than prepared to believe that others have it worse than I do. I gag on food I love sometimes. It's sensory processing, and saying \"you can control the reaction\" may be true for you, but it's not the only experience of neurodiversity.", "The rudeness described isn't the gagging. That's a reflex. \nThe rudeness is insisting she continue to pour time into something that isn't working without respect for the consistency of her prior effort to be accommodating."]}