{"id": 12539, "submission_id": "11tv1vx", "title": "AITA for telling my sister she is better off being infertile?", "selftext": "Despite trying to conceive for years and having no success with her husband every month, my sister (31F) felt like a supreme disappointment. Her head knew she was not at fault, but she was saying that not being able to give her husband \"the gift of children\", which is seen to most people as a wifely duty made her feel broken and not whole. \n\nFinally she consulted her doctor, only to be diagnosed with endometriosis. A simple surgery, which was scheduled for last week, was supposed to correct the problem. She was ecstatic. Only to come out of anesthesia and be told by the doctor that he is sorry but children would not be an option. \n\nAs you can imagine, she felt devasted by these news. Yesterday I went to visit her to try to lift her spirits. I told her how incredibly sorry I was. But then I also added that being infertile may not be all that bad. Raising kids isn't all sunshine and roses. There is the added stress, expenses, sleep deprivation and time commitment. I told her to look at all the unhappy couples with kids, and that at least she and her husband would enjoy some extra freedom.\n\nAfter these comments, my sister's sadness turned into anger. She started shouting at me and told me to leave her house. She had also informed our mother because she called me later to tell me that my comments were disgusting and I should feel ashamed of myself. I feel like me trying to help my sister only made the situation worse.", "created_utc": 1679068522, "permalink": "/r/AmItheAsshole/comments/11tv1vx/aita_for_telling_my_sister_she_is_better_off/", "score": 1691, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my sister that she may be better off being infertile. I may be the AH because these comments only made her feel worse.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Don't ever again *in your entire life* invalidate someone's grief and anguish by pointing out some lying fake \"bright side\" so you don't have to feel uncomfortable about their feelings.\n\nWould you say \"losing your husband to cancer isn't that bad; you can find someone else to fuck!\" to a widow?\n\nWould you say \"is it really that big a deal having both your legs cut off? Now you don't have to buy shoes!\" to an amputee?\n\nWould you say \"hey, being in agonizing pain 24/7/365 isn't terrible; now you get to take opiates!!!\" to someone in chronic pain?\n\nNo, you would not. You ground dirt into her wound and made things that much worse for her. You weren't trying to help her; you were trying to stop her from making you feel bad. You did very wrong, and you must apologize.\n\nOh, and stop it with this \"look at the bright side\" crap. If someone is grieving VALIDATE their grief; don't make up crap to explaaain to the stupid dummy that they shouldn’t be grieving.\n\nEdit to add: the point is, there is nothing you can ever do or say to make a grieving person feel better. Words don't help. You can however make them feel much worse by invalidating their grief by pretending it isn't that big of a deal, they're over-reacting, there's a \"bright side\", etc.", "YTA - unsure why you are even questioning it.. what a horrible thing to say to anyone, let alone your own sister.", "YTA\n\nImagine one morning you are blind. You are devastated, and your sister comes to comfort you:\n\n\" Cheer up, Op. Maybe it is not so bad. Not everything in the world is pretty, and at least you do not have to see the misery. \"\n\nWould that cheer you up??", "YTA- No matter your intentions, that was the absolute last thing she wanted to hear. She WANTS kids, you don’t think she already knew raising kids would be hard? She wanted that and you basically threw it back at her and told her what she wanted was not what she thought it was and that her and her husband being alone and “free” was better. If you truly want kids, nothing will ever fill that gap in your life", "YTA. Your sister wanted to have children and to tell her she is better off is very insensitive. \n\nYou shouldn’t have children if you don’t want them, but you need to respect that your sister wanted them and must feel a tremendous sense of loss right now.", "YTA. That was not appropriate, supportive or even necessary to say to her. I’m sure she is very aware of the cost of children and took that into consideration when she repeatedly tried to conceive. Double YTA.", "YTA\n\nWhy did you think that would be at all helpful?", "YTA jeez dude. I’m sure ur sister brought into consideration pros and cons of having children before trying for one. I’d give her space and eventually apologize", "YTA. While those things maybe true, the time to say them was not while she was in the early stages of grief. She just found out something she really wanted was never going to be possible for her. This is the time to be supportive of her loss.", "Ummm did you read a special textbook on what NOT to say to someone mourning the loss your sister is facing? Because that’s bad. Those are all the wrong things to say. YTA.", "YTA, and you need to go apologize to your sister for your insensitive comments. You did not make her feel better. I think after you told her you were incredibly sorry, you should have stayed quiet and just sat with her. A lot of people have no idea what to say to others when they’re grieving. I think “I’m really sorry, I’m here for you” and then some silence is just fine.", "YTA. You need to learn how to provide the support a person needs, and not only the support you want to give. You were insensitive to the point of cruelty.", "YTA\n\nNo empathy. Better shut up than rubbing salt into her wounds. \n\nIt‘s like telling a person who is in a wheelchair that they are better off that way because standing and walking all the time is so tiresome.", "YTA\n\n>As you can imagine, she felt devasted by these news. Yesterday I went to visit her to try to lift her spirits. I told her how incredibly sorry I was. But then I also added that being infertile may not be all that bad. Raising kids isn't all sunshine and roses. There is the added stress, expenses, sleep deprivation and time commitment. I told her to look at all the unhappy couples with kids, and that at least she and her husband would enjoy some extra freedom.\n\nUmm, you may foster and adopt children or did you not factor that into your fake pep talk to your imaginary sister.", "WOW your poor sister YTA", "YTA. Your sister is grieving the path she thought her life would take. This is as hard as anything she will grieve. But you told her the thing she was seeking sucked anyway so why be sad? This conversation should have never happened but especially not when she is mourning the door that closed in her pursuit for a family. Its vile and disgusting to shit on someone's hopes and dreams.", "#**YTA**", "YTA not the time!", "YTA. I’m sure you meant well but it was a terribly insensitive thing to say. It’s like saying when someone you love dies, “well, he was kind of a jerk sometimes anyway wasn’t he? So you shouldn’t be that sad that he’s gone.”", "YTA\n\nThat is horrible to tell a woman who has been wanting kids and your timing was trash. That's not how you cheer people up at all.", "YTA. You trying to help your sister did make the situation worse. \n\nYou listen, you support, but that was not the time to talk to her about how much kids suck. Because, right then, she wanted them more than anything else in the world, and all you were doing was making her feel even worse about something she wanted so badly.", "The robot doctor needs to change your empathy chip, yours clearly has a factory defect \n\nYTA", "YTA. I can't have children and it angers me when people say things like that because that's all I ever wanted. Motherhood may not be right for you but don't dump on someone else's dream. Do you know how hard it is trying to conceive and not being able to? Do you know what's it's like to feel like less of a woman because your body is wrong. If you don't, then keep your mouth shut.", "YTA are you deranged? What kind of person does that?", "YTA.\n\nAll the things you said ARE true, and might bring comfort some day. But the time to say them was NOT right after her hopes were raised and dashed again.", "Your sister was devastated that her life course would be different than she wanted, outside of her control, and your attempt to “help” her was to say that it was maybe for the best? That it was a secret positive?\n\nYTA, whether the underlying impetus was tone-deafness or straight-up cruelty.", "YTA\n\nYou definitely made the situation worse.", "YTA. I personally struggled for 20 years with infertility before having my daughter. It was heartbreaking, depressing, deflating, infuriating and very sad. It can make you feel hopeless, helpless and broken. You have no idea what your sister is going through. You made light of her pain. Go apologize.", "YTA, god you are dense. Think of it this way. If a family member’s spouse dies, you don’t go up to them and say “well so many married couples get in fights and divorces, now you won’t have to deal with that.” \n\nYou say you are sorry that you are experiencing this, what do you need from me. AND then you stop, don’t add anything more!", "YTA. You think she isn't aware of what children entail? That she's done all she has to bring a child into the world thinking that they're perfect angels at all times? That she's not prepared and doesn't feel the good outweighs the bad? Your comment was dismissive, insensitive, undermining, and condescending. No respect for everything she's been through to make this happen.\n\n\"It's fine that you can't have the one thing you want most in the world. Think of all the hassles you won't deal with.\"\n\nDo you have a roof over your head? Do you own or rent? Think of the freedom of living in your car. No rent or mortgage. Repairs to cars are cheaper than home repairs. It's mobile. If you lost your home today, it would be even better than her losing hope of biological children. Think of how great it would be.\n\nI hope you don't have children who might find out you feel having kids is so bad that it would be a relief not to have them.", "YTA I am gleefully child free and I would rather stick a fork in my eye than wipe buts and listen to screaming and inane questions for years and I still would never say something like that to a person who wants children but cannot have them.", "YTA. That was the most inappropriate thing to say to her when she was going through this.", "YTA!! I understand you may not have KNOW WHAT TO SAY, but sometimes saying NOTHING is enough. Actually, more often than not it’s best to just be a shoulder!!! \n\nI’m sure you didn’t MEAN for it to come off like it did, but you definitely need to tell your sister you felt like you needed to say something to fill the silence and you were just trying to make it a positive and it turned into a negative. \n\nIt happens. It’s how you deal with it now that’ll dictate your relationship with your sister going forward.", "YTA, read the room. In no way was that helpful when you KNEW how she felt and how badly she wanted kids.", "YTA.  When somebody has had a great grief -- and this is, for your sister -- you don't comfort them by saying it's actually a blessing.  That is to say, it is not comforting to be told 'This thing that pains you so much is actually a good thing.\"\n\nYou should meet any grieving person where they are.  Don't tell them how they should feel.  Listen to them telling you how they feel.  You lift a grieving person's spirits by listening to them, supporting them, maybe bringing small treats.", "YTA - what a horrible thing to say to someone", "You're not just an AH, you're a major AH.\n\n1. Invalidating your sisters grief\n2. Obviously trying to push your disgust against kids onto said grieving sister\n3. Claiming that couples are unhappy with their kids.\n\nI am a single mother, DA survivor, my daughter is literally my saviour. Yes, I have no money or time but my heart has never felt more full from the love I receive from my child. Your views are pathetic, should have been kept to yourself. YTA, apologise to your sister and seek therapy yourself", "YTA. The absolute last thing you say to somebody who wants kids is that you're better off being infertile. I'm sorry your sister is going through this. Sometimes you're better off saying nothing than saying she's better off not being able to have the child she really wants. I understand that you don't know what to say and it's hard being in that boat but sometimes just leaving it at \"I'm sorry\" is enough.", "Wow. Your sister wanted children, got surgery in hope that it would allow this, and then got devastating news that it would never happen. And you managed to say EXACTLY the wrong thing. Your sister is right: you should be ashamed. YTA.", "YTA - you said something awful and tone deaf. If your truly intended to lift her spirits recognize that you failed and just apologize.", "Ah, yeah, YTA. That was not the time and place.", "YTA for assuming you can determine what does and does not represent a valid life goal.", "YTA.  What you said was cruel and dismissive of her desire to have children.", "YTA  \n\n\nThere is no 'bright side' to situations like this, and if there is, it's up to the person who has experienced it to decide where and what that is. Trying to cheer her up didn't require you to share an opinion about how she should view her own situation. You could have just brought flowers and talked about the sky being blue.", "YTA. You may be right in all your observations, but this was not the rigth time to voice them.", "As an infertile woman that went through a dozen surgeries, years of trying, and rounds of fertility treatments only to end up with a \"radical\" hysterectomy and PTSD, you are unequivocally a massive AH. \n\nYou should be ashamed beyond measure of your words. \n\nYTA", "You weren’t helping.\n\nYou looked your sister in the face and essentially said, “not only is your dream unrealizable for you, but it was the wrong dream to begin with.”\n\nIn her despair, this was rather brutal proverbial slap in the face - to an already bruised face. I’m not sure how you don’t see that?\n\nYTA", "Look at it this way. Although your insensitive words do alienate the people you love, and make you someone that people don’t want around them in their hardest moments, that can really be a gift in disguise! Having friends and close family members in your life can be a real burden. Sometimes they need help or money. Birthday gifts can be expensive! You can feel grateful at your life of solitude and loneliness, knowing that although closeness with other human beings dan be one of the greatest gifts and joys in life, it’s really a blessing that you won’t have to experience it. YTA. Obviously. Ugh if I was your sister, this would cause permanent and irrevocable damage to our relationship. Please reflect on your lack of empathy before you hurt more people.", "YTA\nEndometriosis surgeries are never *simple* or easy. They're also never a full cure. She has to live with this disease for the rest of her life, and now she has been told she can't have children, on top of recovering from receiving a life altering medical diagnosis. \nEverybody knows kids aren't 100% fun and games. You were condescending, heartless, and honestly I wouldn't be surprised if your sister goes NC after this extremely low blow. You kicked her when she was already down, shame on you, OP.", "YTA. I understand you were trying to make her feel better but you went about it completely wrong. The things you said might be objectively true but that’s not what someone who just had their dreams of having children squashed wants to hear. This is a thing she wants more than anything and you’re basically telling her it’s not that great. I’d apologize for being so insensitive if I were you.", "My wife and I went through that exact thing. It was soul crushing.   \nYTA and due to the rules of the sub I can't describe how I really feel about you doing that.", "For the love of god. You can’t seriously be asking if YTA? It should be obvious. Yes YTA.", "YTA \n\nAre you really that callous?  You need to take a long hard look at yourself if you need to ask Reddit if those kinds of comments are insensitive.", "YTA. How dare you.\n\nI'm infertile. I am so angry right now just reading this. I can't even bring myself to write any more. How dare you act like that.", "No no no! How could you think that would make her feel better? I hope you’re just stupid and didn’t do that on purpose. Yta", "If someone lost their ability to see would you tell them vision is overrated? Yta.", "YTA. are you unaware of how to properly interact with other ppl, or just tone-deaf about devastating events in other ppls lives specifically??", "YTA - a lot of times we try to 'silver lining' things in a way to make people feel better, but in reality we're trying to make ourselves feel better.  A simple \"I'm so sorry you're going through this and I wish there was something I could do to help\" goes MILES.", "So, you don’t state your age or relationship status but imagine you never thought you would find a partner and you always wanted a spouse. Someone to love you, hold you, encourage you, laugh with you. Imagine you were madly in love with that someone, engaged to be married, so excited to begin your life together, and your fiancé leaves you abruptly, no warning. Would you want to hear “well marriages can suck and be hard and expensive and a lot end in divorce anyway so maybe it’s a good thing.”\n\nI’m guessing not, because you would be grieving *what could have been*. Which is exactly what your sister is going through. She has an ache in her heart that isn’t going to go away, the same as the loss of a person. Grief is a time to shut up and listen. Advice isn’t wanted. Just be there.", "YTA. There are few things worse to hear when you're in distress, than somebody telling you that you have no reason to be in distress. It feels so violating, like somebody telling you your own thoughts and feelings aren't real or valid. Let her process, and don't try taking that process away from her.", "YTA. How hard is it to just let people feel what they’re feeling?  Regardless of your intent, you knew damn well that your sister wanted to be able to have biological children.  Hearing that it’s not an option, when one wishes it so desperately, is shattering. Truly, I get that you were looking to cheer her up. That was not the time, nor the place. You owe her a massive apology. Something like, “I realize what I said to you wasn’t helpful. I failed to take into consideration what you were going through. My heart breaks for you, and rather than giving you the support you needed, I chose to diminish your feelings. I don’t know what you need from me, but, I am here for you. If you just need to talk, I’ll listen.  No advice, no sunshine and rainbows, just ears, and a box of tissues.”", "Wow YTA! Infertility is such a draining and isolating journey. I watched my sister go through it. It was brutal. Eventually IVF gave them a child but after years of failure. I’m fairly certain if I told her she’s better off infertile that she would never talk to me again. So insanely insensitive and literally invalidating someone’s feelings! Yes her baby can be difficult at times but she wanted one so bad and now feels so fulfilled by motherhood. Just listen and be there for her. I hope this is a fake post because that poor girl.", "YTA. All you had to do was validate her feelings and listen. Not provide your (disgusting) opinion on such a sensitive matter. You should be ashamed of yourself. You know how important this was to her and you completely diminished her feelings and grief.", "YTA\n\nYou attempted to gloss over her grief with stupid platitudes that even you didn't even believe. All she needed was an opportunity to grieve and have your support. Instead, you minimized and invalidated her pain. Shame on you.", "YTA, you may not want kids for a variety of reason but this was clearly important to her, so you invalidated her feelings and dismissed her and were insensitive. Instead you could have just listened to her and left it at being sorry. When she's ready you could talk about adoption or other methods of having children, but when she wanted to have biological children and you immediately dismissed her, that's an asshole move.", "YTA, you should probably see a therapist and get diagnosed for autism or something if you literally cannot pick up on any social queues.", "YTA\n\nAnd now I have Monty Pythons “Always look on the bright side of life” stuck in my head.\n\nThanks.", "YTA. Your sister is heartbroken over not having children, so you start to insult children, and being a parent? Are you normally this thoughtless? You owe her a very big apology, if she decides to speak with you again.", "YTA... have you no compassion or empathy for people?  Your opinion on the matter has nothing to do with how SHE feels.  You are a very cruel person.  Hopefully she goes NC with you.  She doesn't need people like you in her life.   I cannot agree with your sister more.  I am just shocked at how cruel you were to her.", "Yes, YTA.\n\nShe wants children and can't have them which can be devastating emotionally.  \n\nTry showing empathy than trying to go 'well akshually here's why your devastating emotional trauma is actually a good thing.'", "Yta", "YTA. You want to try to make her feel better, you comfort her by telling her she's valuable and a wonderful wife even if she can't have children. Maybe even talk about some harmless things, like sports or puppies or crafts or wheel of freakin' fortune. You don't tell her she's lucky she can't have something she so desperately wanted.", "YTA Next time try “I’m here for you.”", "YTA. \n\nAs a male who is infertile, if you had said this when I found out, I would have punched you as hard as I could in the face and dragged you out of whatever room I were in with you.", "YTA. Maybe it’s for the best your family goes no contact with you. Now you won’t have to deal with family gatherings, texts, calls, exhausting questions about your life, visiting them, etc. you’re better off being cut off so you don’t have to deal with all of that. look at the bright side sweetie… things happen for a reason. It’s gods plan for you to be cut off from family. ❤️ (again, YTA.)", "YTA\n\nWTF she went through surgery. She also can use a surrogate or adopt so it's not like she's totally out of options. Man you are horrible. \n\nThat's like saying, 'well you have one less mouth to feed' if someone lost someone they loved. \n\nAre you by any chance challenged in some way with social skills? bc that is really the only excuse for such obtuse behaviour.", "YTA. i know it shouldn’t at this point, but it baffles me how people could lack so much empathy even to those closest to them", "Oh no. Yes, YTA. What you said is incredibly insensitive. She has suffered a massive loss and will be grieving for a long time. As much as you want to, you cannot cheer her up. Her life is irrevocably changed. Give her time and space to come to terms with the fact that her body betrayed her, the life she wanted isn't going to happen for her, and all the other stuff - her womanhood, her feelings of femininity, her relationship with her husband. Women without children ARE treated MUCH differently and will be for the rest of their lives. We are excluded from friend groups, treated differently at work, and CONSTANTLY asked if we have kids. And then the follow up - well are you going to have kids? And then the constant \"well-meaning\" advice to do this, do that, just relax, you can always adopt, etc.\n\nMy heart breaks for your sister. Please do whatever it takes to genuinely apologize and NEVER EVER let yourself be this unkind again.", "YTA. It's no help to point out the \"benefits\" of a deep loss.  \"It's just as well you don't have enough to eat; you might get fat if you weren't starving.\"", "YTA.\n\nI’m a big believer in finding the bright side of things, really big believer in it. But this was not at all the right timing. And when it was the right timing it’d be better to focus on the positives, like freedom to travel more, and leave kids out entirely.", "Yeah, YTA and it was an absolutely WRONG thing to say.", "YTA, and insensitive, out of touch AH. I can’t believe you would think that this would be in any way appropriate to say to someone dealing with infertility who desperately wants a child. You weren’t helping in any way, you were being cruel and projecting your own issues onto your sister. Just because you see childless life as a good thing, doesn’t mean she has to. I’d cut you off for good if I were your sister. You need to apologize and give her space. You can hope for forgiveness but the relationship will never be the same.", "YTA. You disregarded her feelings and dismissed her dreams. If you failed an interview for the dream job you had hoped for since you were little and I came and told you \"well you'd be working a lot of hours, you'd deal with irritating coworkers\" etc how would you feel? No one who dreams of being a parent thinks it's an easy job and that it's going to be easy peasy. Telling people to essentially get over their grief is not helpful or kind. You should apologize and depending on your relationship and how she's healing see if she would like help looking into being a foster parent or finding a baby to adopt or if she decides to go that route you would love to help her.", "YTA, of course you are!\n\n\"Sorry your whole family died in that plane crash but look at all the people whose parents lecture them or who get divorced or fall our with their kids.\" Ridiculous and insensitive, right?", "YTA. Jesus Christ, how can you think that's a helpful thing to say? She's grieving something she's just found out isn't a possibility for her (although there are always options so maybe she can consider other avenues), and instead of just supporting her and validating her sadness, you do the opposite by telling her she's actually lucky. There's plenty of happy people with kids, pointing out the unhappy ones or the stresses that come with having kids doesn't magically fix her sadness. Baffled by the lack of common sense, OP.", "YTA\n\nIf there's nothing I've learned, better, as I've grown old, it's that \"I have no words of comfort, but I am here for you\" is all I will say. Period.  I might change it up with \"There are no words.\". And then I DON'T TRY to \"words\".  \n\nAt some point, people will let you know when they're ready. You just need to be alert to it. Figure out how to gently dip your toe to see if they are ready.\n\nOtherwise, yer just pissin' them off.", "YTA. For every single effing reason stated above. \n\nShe. Is. Grieving. For something she will never get to experience. Pointing out the potential \"bright side\" is NEVER the good thing to do.\n\nYou a major apology to her, if she'll ever speak to you again.", "YTA\n\nDude, read the room. They clearly wanted kids despite the downsides kids may come with. You seem to understand she is very upset about this. Your comment was not helpful in anyway.", "As a person who can't have children without it being extremely dangerous for me (not infertile but having children will definitely kill me), when I first found out I was devastated and would be angry if they told me something like that so YTA. I understand your comments were meant to cheer her up but in a time like that, validation is key while also cheering them up. I now look at my own issues with the same light you looked at it for your sister but it took me a good year and a half to come to grips with it.", "YTA imagine how you would feel in her position. No one wants to hear that especially when they are grieving. You may not have meant to hurt her but telling her it’s not all that bad is rude and invalidating.", "YTA. This is a classic example of what not to say to someone experiencing grief or loss. Your comments were incredibly invalidating. I hope you learn from this, and don't ever do it again.", "Pal. YTA. In these moments you just need to listen. Tell them you're sorry, it sucks, it's so unfair but don't tell them how it's better this way. That's so invalidating and makes their grief seem like it's nothing. Particularly this situation, your sister has been struggling and has even confided in you how she's struggling and you brush her off. This isn't something that can be simply fixed with an introduction of a different perspective.", "A gentle YTA. While it seems helpful to show people the “bright side,” all it ends up doing is making them feel worse. It seems like their feelings aren’t valid. So while your intentions were good, it’s not the way to help people. Leave space for her and her feelings, and just support her.", "YTA \n\nBruh….", "YTA. As someone who was born wanting to be a mom, the love I have for my children and now grandchildren was and is worth every struggle. I would be lost without my kids. I always thought I would fall apart when they were grown and on their own but instead I ended up with 3 very beautiful unique new friendships. Don't belittle your sisters feelings. When my son came out as gay he said he was just worried about never having children, you know what his sister did to comfort him? She is going to be his surrogate. Now that is sibling love.", "“I said something incredibly insensitive and horrible to my sister when she was going through the worst time of her life, AITA?” \n\n\nObvious YTA", "Just to prevent the spread of misinformation, it’s important to note that endometriosis can’t be fixed with a simple surgery. Surgery is a treatment for it, but there is no cure. So somewhere along the lines there was some bad communication, and I just want to make sure that’s clear to anyone reading. Endo can’t be fixed. A skilled surgeon can remove most of it, but there’s no way a doctor can know in advance how much they can remove because it doesn’t show up on imaging.", "YTA \n\nIm not infertile but the amount of times people say “ya know kids are *difficult* right”? Is freaking annoying. You treated your sister like an idiot and literally at the worst possible time.", "YTA\n\nWhat you said was very insensitive! \n\nBy the wording of your post you don’t have kids. If you don’t, how do you know!?!\n\nHaving kids isn’t all sunshine and roses BUT it’s all worth it! The joy children bring to your home is worth the sleepless nights!", "YTA… what a horrible and insensitive thing to do! What in the world is wrong with you to even say something like that?! The only thing you should’ve done was just be there for your sister and support her. That’s it!", "what an incredibly insensitive thing to say!!\n\nYTA", "YTA! Don’t try to lift someone’s spirits when they are grieving! NOTHING you say or do will lift their spirits. Just say “I’m so sorry” and shut up and listen.", "YTA. You basically told her  the equivalent of “Cheer up bitch.”  My husband is infertile and after 26 years of knowing this we both have points where we are sad and wonder what might have been. It is so callous to say what you said to her days after her learning she would never be able to have children.", "Holy shit YTA. There’s toxic positivity and then there’s this. Being infertile is not a light diagnosis in any way, shape, or form. You need to profusely apologize.", "YTA and I say so coming from the perspective of a female who has tried conceiving for 6 years, now.  Those kinds of comments or the \"if it's meant to happen\" kind of stuff is enough to tear someone apart.  It really does hurt and it truly feels like you're broken as a woman. Whether you want to consider it a \"wifely duty\" or not, not being able to create life as you realistically should is a kick in the face.  I feel like a failure constantly for failing to give my husband a child.  Think before you speak, especially to your loved ones.", "I chose self sterilization because I never want to have biological kids and yeah, you’re the asshole here. How can you even imagine otherwise?", "NTA for trying to make your sister feel better.  Your approach to the situation was…indelicate.  It’s akin to going to someone who has lost their legs and saying “Hey…cheer up shoes are EXPENSIVE and now you get to wear shorts all the time!”\n\nMy wife’s parents tried for 10 years to have her and dealt with infertility back in the late 70s early 80s so there weren’t many medical options back then.  I still remember how devastated my wife was when she figured she’d have the same difficulties.  Was not the case we found out we were having my son a little over a month after we started trying.  \n\nFor those who are faced with the reality that they’ll never be a biological parent I can’t imagine the emptiness and loss.", "Gentle YTA. I know you meant well, but in times of grief and anguish, people respond very poorly to those around them being overly positive or identifying the “bright side” of things. What your sister needs is support, for her family to validate her feelings, and for those closest to her to share in some of the pain she’s feeling so that she doesn’t feel alone.\n\nI would encourage her to join a support group. Endometriosis is extremely common, and lots of women go through the same emotional roller coaster she’s going through.", "Yeah you fucked that one up a bit. Time will heal.", "I'm sorry to hear about what happened with your sister. It's completely understandable that she would feel devastated by the news and that it would be difficult to hear any positive aspects of being unable to have children. Infertility is a deeply personal and emotional issue, and it's important to remember that everyone processes their emotions differently.  \nWhile you may have had good intentions, it's important to understand that minimizing your sister's feelings or trying to put a positive spin on her situation may not have been the best approach. It's natural for your sister to feel a sense of loss and sadness, and she may need time to process her emotions without feeling like they're being invalidated or dismissed.  \nAt this point, it may be helpful to reach out to your sister and apologize for any hurt or frustration that your comments may have caused. Let her know that you're there for her and that you support her, no matter what. It may also be a good idea to seek out resources or support groups for infertility, as they can provide a safe and understanding space for your sister to process her emotions and connect with others who are going through a similar experience.", "NTA\n\nYou meant well it was just bad timing. That doesn't make you an arsehole", "Honestly, NTA. I also don’t understand why it’s unacceptable to share the downsides of huge life changing events with people. Even in this situation, it makes sense to me because you didn’t say anything untrue.", "What you said isn't AH-y, but the timing of when you said it makes you a pretty big AH. You're making her feel stupid for being upset.", "Nta! Timing maybe could have been better, but people need to stop having kids. She can always adopt!", "NTA. The planet is far overpopulated and people and religious organizations need to stop implanting the idea that you have to grow up and have kids in your head. Save a child and adopt if you want children so badly.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nDespite trying to conceive for years and having no success with her husband every month, my sister (31F) felt like a supreme disappointment. Her head knew she was not at fault, but she was saying that not being able to give her husband \"the gift of children\", which is seen to most people as a wifely duty made her feel broken and not whole. \n\nFinally she consulted her doctor, only to be diagnosed with endometriosis. A simple surgery, which was scheduled for last week, was supposed to correct the problem. She was ecstatic. Only to come out of anesthesia and be told by the doctor that he is sorry but children would not be an option. \n\nAs you can imagine, she felt devasted by these news. Yesterday I went to visit her to try to lift her spirits. I told her how incredibly sorry I was. But then I also added that being infertile may not be all that bad. Raising kids isn't all sunshine and roses. There is the added stress, expenses, sleep deprivation and time commitment. I told her to look at all the unhappy couples with kids, and that at least she and her husband would enjoy some extra freedom.\n\nAfter these comments, my sister's sadness turned into anger. She started shouting at me and told me to leave her house. She had also informed our mother because she called me later to tell me that my comments were disgusting and I should feel ashamed of myself. I feel like me trying to help my sister only made the situation worse.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Do you also go up to people who just lost a spouse and say \"oh well, cheaper than a divorce\". YTA.", "YTA.... so the way you try to cheer your sister up, who wanted to go through the nitty and gritty of it all, was to try and put her off with reality when her reality just went to shiz?", "If you wanted to comfort her, you went about it the wrong way. Offer condolences. Give her an ear to listen to and a shoulder to cry on. Don't say infertility is a blessing because parenthood is hard and expensive. Pretty sure she knows that and still wanted it.\n\nYTA", "YTA. I understand that what you said came from a good place but those words will have hurt your sister more than helped.", ">I told her how incredibly sorry I was. But then I also added that being infertile may not be all that bad. Raising kids isn't all sunshine and roses. \n\n\"Sorry your house burned down, but hey, you'll get to pick out new curtains.\"  \n\"Sorry your dog was run over, but just think, you won't need to worry about cleaning spots on the floor anymore.\"  \n\"Sorry you were diagnosed with cancer, but hey, you'll lose some weight.\"\n\nI'm honestly surprised that OP made it out without getting punched in the face.  YTA.", "YTA\n\nDo you lack empathy?   You might not want children but this is a huge blow to her.", "YTA, although I understand you meant well. I am also infertile, and it is taking a long time to come to terms with it. The best you can do for your sister now is to apologize and offer empathy. Do not invalidate her grief, and do not offer alternatives to biological children until she is ready to discuss them. Do not assume she is ready to discuss them until she brings it up herself.\n\nTry to put yourself in her place: imagine all the wonderfrul experiences that come with growing a family of your own, wishing for it, and then one day learning that none of that will ever happen because your body is 'defective' in some way. Not only are your dreams dashed, but at the same time you learn that your body is 'broken.' In your mind, you may well know that a person is not less of a person simply because they are unable to have children, but it is hard to shake the gut feeling of being 'broken' because you are unable to do a basic biological thing. It is a painful experience and the best you can do is find peace with it.\n\nSome people may suggest adoption or fostering as alternatives, but they are not perfect alternatives—they come with their own challenges.", "YTA, even if you didn't intend to be. Telling someone about all the stresses and irritation that comes from something they dream of doing or having doesn't lessen that want in them. It just shows a lack of gratitude on your part if to happen to have whatever they are dreaming of.", "That is not how you cheer someone up. YTA!", "YTA\n\nYou were trying to cheer her up, but what you actually did was show her you were incapable of empathizing. You need to let people grieve.\n\nAnd none of the positives you pointed out were things that she was unaware of--she's an adult, she was already aware of both the pluses and negatives of having children, and had decided that she wanted them.", "Jesus YTA. Her dreams just died and you try to tell her she'd be better off. I don't understand how you could possibly think that misguided attempt at Solace would work", "YTA- Your sister is going through an incredible sadness. It seems like she really wanted kids and now she can never have them herself. Instead of being a supportive sibling, you try to minimize her emotions. She had every right to get angry with you, comments like this are enough to push someone to be low/ even no contact with you.", "Basically that was the worse possible moment for you to say those things. She’s grieving and she does not want to hear that because she most likely doesn’t even think those things you said as being true. I’d apologize ASAP.", "Yes, OP, YTA.  People who are freshly grieving DON'T want to be \"cheered up\".  It doesn't help.  They just need to heard and hugged.  They must go through the grieving process.  Go apologize for your error.", "YT. Your comment was so tone deaf to your own sister and her pain and you need to give her the space away from you", "NTA. You told her truth. It is wonderful not having kids. They are body destroying time consuming financial drains. Enjoy your freedom, travel and health. The breeders of the world can't understand that people without kids live much happier lives.", "Look at the bright side. Your sister may be yelling at you, and your family may know now that you are an asshole, but on the bright side you may have gained some awareness or empathy (although maybe not, since you went on to make this post...)", "YTA - as some that also had endometriosis and a total hysterectomy at 28, none of comments would be welcome.  I at least was better off than your sister because I was able to have a daughter before any of that came up.\n\nIt’s about as stupid as telling someone that they miscarried, it’s gods way of correcting an error, oh, you didn’t really want one now, etc.\n\nOf course the most hurtful one came from my dr because he couldn’t take 2 seconds to look at my chart.  ‘How are things growing?’\n\nYou might be able to discuss things like that down the road but not in the moment that she is trying to wrap her head around it.", "YTA", "YTA", "YTA\n\nIt's like going to your brother in law funeral and telling your grieving sister \"you know what? He was an AH, you are better off now\"", "Good Lord, YTA. Absolutely disgusting.  Do you even love your sister? \n\nWTF is wrong with you?", "YTA. You owe her a big APOLOGY and from now on think before you speak. She JUST found out she will never be able to have children, then you just gotta open your big mouth. Do you even love your sister?.", "There's no way this is a real question.\n\n>I feel like me trying to help my sister only made the situation worse.\n\nHow did you try to help her, exactly?\n\nYTA", "YTA- \n\nthis is the definition of sour grapes, and not your place to say.", "YTA and very cruel.", "YES YOU ARE. you seriously misjudged the situation, and your sister has every right to be FURIOUS with you. that was not at all the right thing to say in that situation", "Yes you are 100% YTA", "YTA. I think you meant well but yeah that was not the right thing to say. Apologize and hug your sister", "YTA\n\nTo people who want kids, all the free time and money in the world is meaningless without children to pass it on to.\n\nThat was an incredibly callous thing to say to your sister. Like honestly, wtf were you thinking?", "YTA", "YTA", "YTA my god", "YTA. Holy shit.\n\nShe is GRIEVING. It's not your place to decide how she can or can't feel. All you have to say is \"I'm here for you\" and \"I'm so sorry\", you can even preface it with \"I don't know what to say but-\"\n\nOtherwise SHUT THE HELL UP.", "YTA.  Maybe six months from now when she’s had time to digest the news and come to terms with it, you can  maybe point out gently a few downsides of parenthood.", "YTA\n\nQuick question:\n\n  \nWhat the hell is wrong with you.", "YTA\n\nIs everyday peaches and cream with my kids? Nope. But I’d go through the ordeal my husband and I went through to have our kids 100 times over.\nI feel bad for your sister in that she has a poor support system in you; infertility is no joke, and I relish the people who stood by us every step of the way.\n\nAdditional acceptable things to say:\n“I’m sorry for your loss.”\n“Is there anything I could do? Any options to help you look into?”\n“Do you need a log of cookie dough and a shoulder to cry on?”", "YTA\n\nIs everyday peaches and cream with my kids? Nope. But I’d go through the ordeal my husband and I went through to have our kids 100 times over.\nI feel bad for your sister in that she has a poor support system in you; infertility is no joke, and I relish the people who stood by us every step of the way.\n\nAdditional acceptable things to say:\n“I’m sorry for your loss.”\n“Is there anything I could do? Any options to help you look into?”\n“Do you need a log of cookie dough and a shoulder to cry on?”", "Your sister was dealing with grief around a huge life issue, and you were uncomfortable with her feelings, so you tried to make those feelings go away so you would feel better. If you can't be with someone where they are when they're hurting, just stay away. YTA.", "My wife and I have been unable to have children in 25 years of marriage.  Yes, I have money and time that couples with children don't have.  I have latitude to be involved in activities people with children can't pursue.  I'm doing my level best to retire by my mid-50s - no point in punching a timecard any longer than absolutely necessary.  And I have no problem saying I'd give all that up in an instant if we had a child.  \n\nI understand that you were trying to soften the blow, help your sister look on the bright side.  But right now she needs people who will support her and let her grieve her loss her own way.  And believe me when I say she's grieving right now.  \n\nUnequivocally, YTA.  Figure out a way to make amends with her.", "YTA!!! DONT TRY TO DOWNPLAY PEOPLES GREIF!!!!", "Ooof, I get that your heart was in the right place, but no. You don't say that to someone grieving over their infertility. I know it's uncomfortable not to be able to help, but sometimes you just sit with someone and grieve with them. You definitely owe your sister an apology for being massively tone-deaf. Soft YTA.", "I mean. I dont think you are... personally if you have to have surgery or have another women carry your child because you can't. Its a sign saying you're not meant to have children. I think those surgeries and everything to help people have babies shouldnt be a thing personal opinion. So no you're not to me you did that rather kind!", "YTA - even though you meant well.  Let her grieve in her own time -- hopefully the benefits of a childfree life will come clear to her in time.  In her time - certainly not today because you told her all the wonderful things that will be possible.  She just had surgery for goodness sake.", "YTA Jesus Christ you suck.", "So if her husband had died, would you have started quoting the articles and statistics about how women generally have lower quality of life when they’re married, or….?", "YTA what the hell is wrong with you…", "Cheer up, OP. Since your sister is going to disown you now,  you don't have to say incredible insensitive things to her anymore.  YTA.", "YTA. What you said was breathtakingly cruel.", "YTA big time-yikes", "Oh wow, OP. You made the classic mistake of offering sympathy instead of empathy, and it does make you a bit of an AH. Check out the link below - it's 3 minute cartoon based on a Brene Brown talk that sums up what you've done pretty succinctly. Your heart may have been in the right place, but your timing and sensitivity leave something to be desired.   \n\n\nhttps://youtu.be/1Evwgu369Jw", "YTA\n\nJust because you see it that way, does not mean your sister does, nor should she have to. I understand to an extent that you were trying to offer her some sort of different perspective, however, for something such as this, it was incredibly insensitive. Being told you cannot have children is not easy news to hear or come to terms with. \n\nYou need to take a step back, get out of your own head, and instead look at your sister’s perspective. She can’t have her own children with the person she loves. That can be incredibly difficult for a woman to cope with. She is not only dealing with that news itself, but now likely the fear that her partner may not be okay with it. Not having kids is often times a deal breaker for certain people and drives some couples apart. \n\nI highly suggest you maybe take a moment and really read through all these comments and understand the severity of what you said, and then apologize to your sister when she is ready to give you the time to speak with her. \n\nEmpathy is a very important tool to possess in life. I would suggest learning how to master it.", "YTA\n\nNo one wants to hear that and it's not like other posts here where the infertile person is some kind of abusive monster.\n\nWTAF", "How old are you? Has something like this ever worked at making someone feel better?\n\nYTA. I would tell you to apologize to your sister, but I feel like you would make a mess of that too.\n\nGet someone to apologize on your behalf.", "YTA. You're the people r/TryingForABaby warns us about. Heartless, cruel, with 0 emotional depth.", "YTA Get out of here with that toxic positivity BS. Not everything has a bright side. She is hurting and all you did was make it worse. She needed comfort, not invalidation to what she wanted.", "YTA - But look on the bright side. You now don’t have to talk to your sister which means more time to figure out how to AH to everyone else in your life.", "Good god you misjudged this BADLY.\n\nShe didn’t need to hear that her loss is somehow a magical gift. She just needed support in her time of grief. She needed to be looked after and for someone to be strong for her. \n\nYTA.", "YTA. And this is coming from someone who willing had the whole system ripped out because I don't want kids. How on earth was that supposed to help? If you were trying to be positive you could have gone with pointing g out there are other options but even then, you just have to support your sister while she grieves.", "YTA, without a doubt. \n\nDid you really type that all out and think people would be on your side? Come on, now.", "YTA.\n\nJust because you're right doesn't mean it's the right thing, or time, to say. If she wanted kids, this is a huge deal for her, and she may well be staring in the face of her husband bailing if he's the traditional type.\n\nI'm still baffled why you wouldn't bring up surrogacy or adoption if you know it's so important to her.", "YTA!!!! She wants kids, and of course she knows that parenting isn’t fun and games. She wants to be a mother, and she’s grieving the fact that she can’t. You’re invalidating her very real feelings, and your reasoning is that having kids is stressful? SHE KNOWS. She wants the good and the bad of parenting, and you’re acting like she doesn’t.", "Thanks for the laugh.\n\nI now have a visual in my head of OP uninvited, yet popping up in the situations you described above. With a wild smile on her face, offering alternative ideas that no one asked for. All the while Monty pythons “always look on the bright side of life” is playing in the background, on repeat, forever.\n\nEdit: Typo", "All this, plus never say *\"everything happens for a reason\"*", "the only thing you can say to someone grieving is, \"I'm here for you.\"", "Bravo! Well said. For all the reason stated here- YTA", "Reminds me of people trying to make me feel better about being a chronically ill recluse with no skills, life experiences or social life for 14 years by telling me at least I don't have to deal with the stress of working. Like yeah that's true, I don't have to work, that's totally worth the pain and misery lol. People are weird sometimes in what they think will be genuinely helpful.", "I could just feel the anger & disappointment radiating off of your comment.\n\nWhen I first read the title, I thought the reason behind saying such a thing might be that OP's sister abused OP when OP was a kid or something. But I was legit shocked reading this. I somtimes say things in situation where I should not and make it awkard, but even I don't remember doing something like this.\n\nOp is such an AH. YTA", "I wish there was a mic drop emoji, because that’s all that needs to be said.\n\nI dealt with infertility for years, and got those type of “helpful” comments from people. IT DOES NOT HELP.", "Beautifully said! As someone who struggled with infertility then several losses before my rainbow baby, this whole post pissed me off", "Excellent examples to drive home the point.", "I plan on sharing your post with others who do this; you nailed the definition of invalidation on the head!", "Sooo many people need to hear this!", "There's an even more straightforward way to test this.  Suppose that OP's sister had managed to give birth, but the baby died a month later.  How would OP's \"bright side\" arguments sound now?", "Well said! I'm hopping on to add to your comment with a video to illustrate what it means to have and show empathy.\n\n[Brene Brown on Empathy](https://youtu.be/1Evwgu369Jw)", "So in order, no, yes and yes, my girlfriend has been living with both of those and that's just how we deal with it", "YTA. And this∆", "This is why I never talk to people about anything going on with them. I hate dealing with other people’s grief etc.", "Bad analogies though. In every one of those, you've experienced the thing, and then have it yanked away from you.\n\nAnd I really feel like you're reaching for the whole \"invalidating\" nonsense. She never told her sister she was dumb for grieving, just that there's pros and cons to having kids, and trying to emphasize the pros.", "THANK YOU! Your anger perfectly\nMatched mine and said it in the exact way I felt!", "Yes exactly. And not to mention, endometriosis excision is not a simple surgery in the least. OP made it sound like she was getting her tonsils out. YTA", "On the bright side, OP DID take her mind off her troubles for just a little bit /s", "I don’t think the “bright sides” pointed out are lying or fake, but yea they were unnecessary to point out and invalidating of the person’s emotions, yes, fake no.", "I obviously didn't tell her \"You're better off being infertile\", I just told her some of the cons of having children in order to help her see a different perspective. I don't see how that's horrible?", "exactly, especially after trying hard to have children", "Great post", "This, right here. It’s something that perhaps could be brought up in about six months or so, and not with anything approaching “it’s for the best” but with empathy and gentle redirection: “I know how devastating this is for you. You deserve something nice to take your mind off of things. Maybe we can plan a trip to Peru, like you’ve always wanted?”", "Honestly I'm not entirely sure they ment well. The way she described her sister seems a bit condescending.", "It kind of does though. She literally just had surgery and is processing her feelings, then her sibling thinks it's a good time to basically tell her she dosen't have it that bad. The whole post reads as a little judgmental and condescending towards their sister. When exactly is a good time to tell your sister that you think her lifelong dream was stupid and she would be unhappy if she had children?", "There’s literally never a good time to say something like that.", "Suppose OP's sister had successfully conceived, but the baby died shortly after birth.  OP visits the hospital and tells sister the exact same thing:\n\n>I told her how incredibly sorry I was. But then I also added that it may not be all that bad. Raising kids isn't all sunshine and roses. There is the added stress, expenses, sleep deprivation and time commitment. I told her to look at all the unhappy couples with kids, and that at least she and her husband would enjoy some extra freedom.\n\nNow tell me how it sounds.", "there is a time and place. someone is upset and just found out. you don't tell someone things that you know will further upset them and paint what they want in a negative light while they are still grieving and the wound is fresh. you wait.", "\"Who needs the Quickie Mart\" popped into my head. Glad I am not the one that has tv/movie references come to mind during inappropriate moments.", "Glad I'm not the only one who immediately had Monty Python pop into their head. lol", "Or \"God never closes a door without opening a window.\" Or my personal favorite, \"in a few years you'll look back and see this was the greatest thing that ever happened to you.\"\n\nPeople said that crap to me when I got laid off from a job I loved and it made me want to stab them. Multiple times.", "Omg yes! Every time I hear that phrase I want to punch someone in the face. My favorite was when someone said that to me after I got hit by a semi truck on the freeway….just wtf?", "Omg yes! Every time I hear that phrase I want to punch someone in the face. My favorite was when someone said that to me after I got hit by a semi truck on the freeway….just wtf?", "Are you me?!  Cuz that’s exactly my life", "Jesus, people can be so stupid! Sure, doesn't EVERYONE want a chronic illness so they \"don't have to work\"!\n\nI'm so sorry you've had to deal with a) chronic illness and b) assholes like this!\n\nAnd, OP, YTA!", "As the husband of an infertile couple, I just wanted to congratulate you on your rainbow baby!", "She's probably say something incredibly sensitive like \"You can finally get all that sleep you've been missing!\"", "Ikr", "Someone struggling with infertility is already aware of the pros and cons. They're infertile, not stupid. They've made the decision that they still really want children, so invalidating that is shitty and unkind.", "Do you honestly think she didn't already know said cons without you stating them and making them obvious? Yes, having children is not an easy ride, but she already KNOWS this. Yet, she still wanted to try and got devastating news regarding it.\n\nYou're little tidbits of information added absolutely nothing she already didn't know and made her feel worse that she can't experience the good nor the bad of having and raising a child. YTA", "Because she's recovering from painful surgery, will likely have many more in the years to come, and is mourning the loss of her dream.", "You actually DID say that; you’re just being deliberately obtuse about it.", "Really though? You don't see how that's horrible? Let me try to help you understand. If someone were talking about wanting children and didn't know they were infertile, it wouldn't be horrible to discuss the cons of having children. It's a logical discussion and it's not a bad idea to make sure someone isn't romanticizing parenthood. Make sure they understand all angles. Ok. Let's try something else. Marriage. If someone is discussing that they want to get married, it is perfectly acceptable to discuss with them the cons of getting married. It's a big step and a serious decision. There's nothing wrong with wanting to make sure that someone has considered all aspects of marriage. Now, if a guy was discussing proposing to his girlfriend and his girlfriend gets killed before he can ask, it's *not okay* and is *really horrible* to have that same discussion with him. He doesn't want to hear about the cons of marriage and how he lucked out that his girlfriend passed away because he's avoiding all the cons of marriage. There's a time and a place and when someone is grieving, that's neither the time nor the place to discuss other perspectives.", "How did that work out for you? \n\nWhether you can understand why it’s terrible or not, your sister experienced it as terrible. Do you want to be supportive and compassionate, or do you want to be right?\n\nYou are not right.  But also, try to let go of whether you are right.", "Because you’re only thinking about your feelings not hers. That makes you the ah", "You are not even trying to understand what people are saying. Doesn't surprise me when it comes to you. Instead of trying to sympathize with your sister's grief, you thought it was better to make her see the \"brighter side\" of her not being able to conceive. If you did not have the willpower to sympathize with her, the least you could have done was listen to her or not visit her at all.\n\nYTA", "I don't think many people are unintelligent enough to want kids desperately but to not expect that there are stresses to it. You basically did an infertility version of telling a depressed person to look on the bright side. What's the point in saying it? People know that already, it doesn't change the circumstances.", "Jesus christ when people are grieving they don't need someone swooping in trying to \"**HeLp** tHeM sEe a DiFfErEnT pErSpEcTiVe\" (the audacity of thinking you can bring some fresh insight they surely haven't thought of!!)  just s*upport them through their grief* instead of trying to push them into bottling in up and getting over it for your convenience. \n\nYou were incredibly insensitive and out of line. YTA", "That’s not a kind way to talk to anybody going through something bad, even if it’s not as big as this.", "I sure hope *you* are childfree or at least mature a lot more before even thinking of having children. Like *a lot* a lot. You showed your sister the empathy of a rock and the sensitivity of a bull. Shame on you.", "\"Hey, I know you just had breast cancer, but think about all the money you'll save on bras\"\n\n\"I know you have 6 months to live, but at least you won't have to do any Christmas shopping this year!\"\n\nThat's you.\n\nThat's what you sound like.", "I hope your sister cuts you out of her life.", "Do you have a fucking heart at all???", "So if someone tells you they have a terminal disease you’re going to point out all the cons of being alive and expect that to not be horrible?", "Honest question: Do you think this would have helped you if the roles were reversed? When things happen to you, does it help you grieve to hear about how whatever happened is for the best?", "What you said was absolutely heartless and devoid of any empathy whatsoever. That you can't see how horrible it was is very worrying.", "Nah to me it's obvious she cares about her sister and was trying to make her feel better. Yes she said the wrong thing but there was no malice maybe just ignorance. She's not an arsehole, an arsehole wouldn't be trying to comfort her in the first place", "When my wedding was cancelled because of COVID everyone was all \"I wish *I* had saved all the money instead of having a wedding.\"\n\nLike, no you don't, you decided to have a wedding instead...", "yep to both of those and the one I hate \"god wouldn't give you something you couldn't handle\"", "This. People say the stupidest crap. Honestly, I have learned to be super careful with what I say to people about their grief (big or small). I’ve taught myself that sometimes, it’s better to just be there for a person and not say anything, rather than make stupid remarks.", "I'd add \"God only gives you what you can handle\" to that list.", "My boss \"This is God's way of saying you weren't ready\" after informing her I had a miscarriage.", "Thank you kindly! She’s ten years old now but I will tell you that it was not easy to bring her here", "Right! If that was true there would be far fewer/if any, suicides.", "That's the worst, most malignant lie of the bunch. People are given things they can't handle all the time.", "\"What doesn't kill you makes you stronger.\"\n\nBecause you never hear of someone turning to drugs or alcohol to try and cope with trauma.", "...YTA. You basically told your sister that you know better than she does whether having children would have been the right decision for her, after she went to great lengths to be able to carry a child. It's insulting to the extreme.", "YTA Your sister needed comfort and you told her, in her grief, that what she wanted wasn’t worth it.", "What is wrong with you??  You are a BIG ASSHOLE.", "YTA. My sister told me it was probably a good thing I had a miscarriage. One reason I still don’t speak to her more than a decade later. I really don’t know what to say besides how incredibly insensitive and cruel of you.", "Oh you are a terrible sibling and human being. What is wrong with you?", "Obviously YTA.\n\n100%. No question. Not even a remotely close call. What an insanely horrible thing to say to someone.", "YTA. I’m sure she is not stupid and recognized that there would be challenges to raising children - but she still hoped to have children and that choice was taken from her. She needs time to process this change in direction for her life. She is allowed to feel grief.\n\nPeople really need some lessons on how to treat people dealing with infertility, or who have landed at being childfree as a result of infertility. It is not for you to tell them that they should just shove aside their grief and be happy for what you perceive them to have instead.", "yta. NEVER EVER tell a person grieving infertility that it \"could be worse\" or \"oh you don't want kids anyway\". it's insensitive and dickish and it belittles their grief. \n\nand she IS grieving. It will take time for her to come to terms with something that's thrown her entire life trajectory off kilter. \n\nYeah, parenthood is hard, but many of us desperately WANT to experience that regardless. We'll take the sleepless nights, the stress, the lack of freedom because we deeply crave parenthood. \n\nShe was perfectly justified in kicking you out and you SHOULD feel ashamed. You were out of line.\n\nShe's been through a lot and endometriosis surgery isn't \"a simple surgery\". Endometriosis is nasty, it literally CLINGS to internal organs like a sticky goop and even if they manage to get it all off it leaves scarring and it often comes back. It's awful and vicious and being put under so they can attempt to burn that stuff outta you is by no means straightforward. It can be everywhere, not just the uterus but adhering to the liver, the kidneys, heck, it can even get itself inside the muscle wall and proliferate (a condition called Adenomyosis). Endometriosis is NASTY. \n\nHaving gone through infertility I empathise greatly with your sister. It HURTS. It hurts every time you see a happy family, every time you see a baby or a pregnant woman, every advert and movie, every family gathering. It hurts. You grieve for something you'll never have and it leaves you feeling broken and empty but also guilty because people like YOU make us feel like our grief is unjustified or unworthy. We're told \"oh but you havent' really LOST anything\" or \"it's not like you had a baby and they died\" which absolutely trivialises the grief. People don't seem to get it. And they make stupid remarks. \n\nInfertility is a very specific sort of grief and a very specific sort of hurt, one that those who don't experience I think really struggle to wrap their heads around. For those fortunate enough to have never once had to question their ability to concieve, to have the CHOICE to be childless or not, they never ever feel that sense of loss and have that choice forcibly taken from them. \n\nI was 17 when I was first told \"you won't be able to concieve naturally\" and at the time I had people thinking they were being helpful saying things like \"oh well you're young, you dont' want to think about babies yet anyway.\"\n\nno, but I kinda anticipated i'd have some sort of CHOICE in the matter and the ability to do so in the future thank you very much. \n\nYou need to appologise perfusely to your sister who didn't deserve you pouring salt in her wounds. She sought comfort, instead you slapped her in the face. You owe her big time. \n\nI hope she recovers well from her surgery and I also hope the doctors were wrong about her having no chance. I'm so sorry for her loss. Because it IS a loss.", "YTA. When someone is grieving don’t tell them they shouldn’t be. You clearly know being a mom and having a child is important to her - she literally had surgery in hopes of it improving her chances of having a child. So for her to receive devastating news and you to double down on it…what were you hoping her reaction would be to you saying that? Did you really think she’d say, oh I never considered that, how lucky I am now that I physically can’t do a thing I wanted to do, simply because you said something completely obvious? \n\nYou absolutely should apologize to her.", "YTA. She knows that kids aren’t all “sunshine and roses”. It doesn’t matter. She just got told that something that she wants (it feels like a deep in your soul need), is no longer an option. She feels like something got taken away from her and she is justified in feeling all of her feelings. If she had a miscarriage I’m betting you’d have said that same thing. If you want any relationship with your sister whatsoever you need to apologize profusely and then wait for her to come to you. I’d have cut off communication with you if you were my brother for that kind of HORRIBLE invalidation.", "YTA, holy crap. You are a disgusting human being for trying to downplay somebody’s grief like that you’re supposed to be comforting her!she wanted children, and you knew how badly she wanted them and then you have the audacity to say those things. How would you feel if somebody tried to downplay the death of your lover you would be rightfully just as pissed off as your sister is so don’t ever do that shit again and honestly I would not be even surprised if your sister goes no contact with you for doing this crap.", "YTA. The entire subject aside, which is a big thing to put aside, but still... the entire subject aside, your role as a family member is to support someone you love who is feeling bad. If you didn't make her feel better when she's devastated, and if you in fact made her feel worse, then you're wrong, and you fucked up. Saying \"I don't see how what I said was wrong\" is willfully ignorant--if you made her feel angry and upset and horrible, then you weren't helping. If you can't apologize, I think you should bounce out of her life, because nobody really needs to be around someone who makes the hard times even harder.", "YTA. I am child free. I never felt anything that even vaguely resembled a maternal instinct. But holy smokes, yours was an incredibly insensitive comment.", "YTA BIG time...OP you have NO right to speak on what may or may not be best f,o,r som,,,'ź''eone. As someone who may not be able to have children, and has at the very least a high chance of miscarriage due to medical issues I know how heartbreak it is and how shattered your sister probably feels. She's understandably upset over the fact she won't be able to have kids, she probably has thoughts that she's disappointing her husband, that he'll love her less, etc. Shes devastated and reeling in disappointment And then her sister comes along and tells her that the thing she's been hoping and praying for \"isn't all it's cut up to be and maybe it's best you don't have children\" it's a slap in the face and a knife to the heart. Maybe you were trying to help, maybe you meant for it to be sweet, I'll give you the benefit of the doubt, but you really need to take a look at what it was you just said to someone who's mourning the loss of their ability to bring life into this world. Who already feels inadequate, heartbroken, lost, confused, etc. And now probably feels like her sister doesn't care. Who probably is already so full of self doubt and anxiety that now thinks her sister thinks she'd be a bad mom. Because I can promise you that's how I'd feel.", "Your mother is right, your comments were disgusting & you should be ashamed. You should have left it with 'I'm so sorry'. You know what being a mom meant to her, & you knew she was devastated. But you had to double down & remind her of all the \"**awful**\" things she'd be missing.\n\nYTA", "Soft YTA because you meant well, unfortunately you went about it in a really terrible, insensitive way. If someone is suffering or grieving, trying to show them the “upside” isn’t helping. It’s diminishing and invalidating their feelings. OP, sometimes you have to sit with the discomfort of not being able to help, and of allowing other people to feel what they are feeling, even if you wish they would cheer up. You can’t solve every problem, and you can’t talk grief away. You CAN be there for the other person. Apologise to your sister, and next time you are called on to console someone, just BE there for them, you don’t always have to try and make things better. Give them a hug if they want that. Tell them you will listen. Tell them you understand that it hurts. Allow them that space, and set your discomfort aside.", "NAH when you don’t want kids yourself it’s really hard to conceptualize why people would be upset with being infertile. I do think you were trying to cheer her up without truly appreciating how big of a deal this was to her. I think you are slight AH for your comment that’s it our wifely duty to give our husband the gift of children. It’s weird you said that but also seem to be childfree.", "YTA. Don't punch someone while they're down.", "Jesus christ YTA. \n\nIt's fine if you don't like kids, but you don't get to make the decision that she shouldn't like kids either.", "YTA. My wife struggled to conceive at first and if I'd have heard anyone say something like this to her I'd have broken their jaw.", "Holy shit YTA. \n\nCLEARLY she wanted kids. Your thought is to say “well no biggie kids suck”. What? Gfy.", "YTA. You were coming from a good place, but speaking as an infertile person myself I would feel so shitty if someone said that to me. I’m now (a year later) firmly in the “being childfree is awesome” camp, but it took some time to get there. She really just needed a shoulder to cry on at that moment and time to grieve what she thought her life would be. I think a sincere apology is warranted. \n\nIt’s a delicate situation and really hard to navigate for people who haven’t been there. Hopefully she’ll give you some grace, but you need to apologize profusely and keep in mind that all things fertility/kid-centric may be triggering to her for awhile. You need to be really aware of what you say for awhile.", "Bro…you are definitely TA. I can’t believe you typed all this without 100% realizing that you’re an ass 😂", "YTA. You are such an asshole it beggars belief. Congratulations on being the first person I've encountered on whom I would actually wish the infertility experience.", "YTA.\n\nI don't think you are a bad person, you just made a few ignorant, tone deaf, and rude comments. Like other comments say, give her some space now. If you are truly sorry, you can apologize, but maybe not right now.", "That was not helpful at all.  You don't tell someone that when they actually want children.  Sometimes silence is golden and next time, practice that.", "YTA. Your comments were insensitive and inappropriate.", "When people get news like this, they need time to mourn the future they had envisioned for themselves. She wasn’t looking for anyone to cheer her up. She just needed someone to sit, listen, and just say “I’m sorry. This sucks.” YTA.", "You weren’t trying to help, you were trying to stop her grief from bumming you out. YTA and just permanently damaged your relationship.", "YTA, what is wrong with you? Imagine someone did the same thing to you about something you desperately want. What an ignorant way to try and cheer someone up.", "Yta. If my sister said that to me, our relationship would never be the same. Just evil and mean.", "Yta. What did you think would happen? She would leap out of bed and go “oh hey! You’re right!”", "YTA\n\nTop comment says all there needs to be sad with the same amount of anger I feel right now.", "Yta with the way you said it. You could have said that with \"there's always adoption\" or,\" there are plenty of ways to start your family\" things tend to be better when you use the right sentences in the right context", "I know you meant well...but how can you fuck up this bad? YTA", "YTA. Repeat after me: \"I'm so sorry.\" Now's a good time to say it. Better time would have been when you said all the other stuff.", "YTA. This is what I was told too when I was told I was infertile. Guess what, it's not a gift of a \"new life new possibilities\" it is the literally closing of a choice without your consent. I truly hope if you have any shred of dignity you apologize but if you don't actually see what you did wrong, I hope you don't ever say that to anyone else.", "YTA, women already know that raising kids isn't all sunshine and rainbows. She had years of IVF and now surgery cause it's something she wanted and now will never have. Your comments were insensitive and just outright idiotic. Apologize and don't do it again", "Your sister badly wanted kids and based a lot of her self worth on the ability to have them. Piling on and telling her that her dreams she'll never get to fulfill are stupid was a really bad take. Try to have empathy for a moment.\n\nYTA", "\nYTA\n\nPlease learn to sit with that which makes you uncomfortable. \nA simple, “Do you need anything?”\ngoes further than any piece of advice", "***YTA***", "YTA. That was a terrible thing to say.", "YTA\n\nI think your heart was in the right place, like you were trying to cheer your sister up. But really... she just needed someone to be sad with her.", "YTA. You basically invalidated her feelings by saying what she desperately wants (but can’t have) isn’t worth it. Which is just awful to say. Let her have her feelings.", "YTA!! Learn to read the damn room!", "YTA. You knew it was important to her. Why would you try to minimize her loss? She was obviously grieving. \n\nIs this that toxic positivity people talk about?", "You said the quiet part out loud. YTA.", "Just went through this in my family....^(DIL ranting and raving about how difficult her life is with a 2 and 4 year old (and pregnant again)).....told my daughter (who is dealing with 10 years of infertility and now going through surrogacy) how exhausted she is (**while she has a nanny and a housekeeper**)...my daughter finally responded, \"why are you having another baby?\"  Brother  (husband of DIL) got mad and pushed my daughter into the wall, telling her to \"never speak to my wife like that again\"  **Literally, no one is talking to each other and I'm pretty sure we're all fine with not having to deal with DIL anymore**\n\n**Forgot to add**, DIL said to my daughter, \"you wouldn't understand how tired I am because you're not a mother\"  Nice, right?", "The real TA is society for pushing this belief on everyone that being unable to have kids somehow makes you \"lesser\"", "I really hope your post is fake", "oh boy as soon as I finished reading I grabbed the popcorn for these replies. OP got Lambasted and Keelhauled by the comments", "Why. Why would you have done that? Don’t do that again. YTA. Do some serious self reflection.", "As someone who hasn't been able to have children, it has taken me 15 years to come to terms with it. The comments people came up with in the beginning just p*ssed me off and made everything worse.\n\nToday, when someone asks if I have children I just say no and leave it at that. I really don't need the pitying looks and idiotic comments.\n\nWhat you should have said to her was \"that's really sad; I'm sorry\".\n\nYTA!", "“Oh your mom died? No problem you’ll save so much money on birthday cards and you’ll save so much energy not hugging her.” Don’t try to do the whole “silver lining” crap in heartbreaking things.\n\nYTA", "YTA", "YTA", "NTA. You raise very valid points. Bad timing tho. Probably should have waited until after grieving to tell her those things.", "Wow, YTA", "I’m sorry to say but your attempt to help *did* make the situation worse. \n\nWhen people receive devastating news that causes grief the last thing they want to hear is you going on about the “bright side” of the devastation, especially right after receiving the news. By jumping to “solutions” right away you completely invalidate their real, lived experience that is happening right in front of you. They are sad and grieving and what they need is for you to recognize *that* and talk about *that*, not jump to cheering them up by changing their thoughts about the situation.  \n\nYour sister likely wanted to process, to cry, to grieve. She might have needed silence & a hug, or simply to hear you say that you’re sorry it’s not going to work out. What should happen is to let the upset person guide you in providing the support they need. By jumping to the “bright side” you basically told your sister that you didn’t have time or mental space to support her in the way she needed it and chose instead to jump to what was comfortable for *you* to say. \nUnfortunately, it was not what she wanted or needed at the time. YTA.", "YTA your role as a loving sister was to comfort your sister. Tell her that when she has come to terms with her immediate grief she can look at other options to become a mother and you will support her.  Not to tell her that her loss - which has devastated her - is ok and has a bright side. You were really insensitive. Your sister is owed an apology.", "YTA, WTF is wrong with you???", "All you needed to do was be there for your sister and just be a good sibling. You wont be able to change her body or change her heart but you can help give her happiness by spending time together , having fun together, crying over cheesy hallmark movies together while stuffing your faces with Oreos, swapping books to read, learning new hobbies, etc. \n\nYou should want your sister to be able to say when  her time is done that she had a great sibling that helped add joy to her life and gave her so many great memories.", "I am genuinely surprised you were able to write the title without realizing that YTA.", "Oh good lord YTA. Very much so.\nI am TTC for a year now without any luck and a friend just said: 'be glad you don't have kids because mine is crying all day today.'\nWell no I'm not glad, i actually want to be the one complaining about it because then at least i would be a parent. \n\nYour sister is very very right to be extremely angry with you. I understand it is difficult to respond to this kind of devastating things. You hate seeing someone you love in pain and try to make things better. But you wont. Just be there for her. Ask her what you can do for her. Don't try to make her feel better this way. Please dont. Here dream and future just got crushed.", "YTA 100%\n\neveryone who wants kids knows that it isn’t all positive\n\nbut it is still something many people want \n\nand you dismissed her grief just bc it’s not always a 100% happy time w kids", "Ok as someone who is happily childfree, yes YTA, big time. There are people who genuinely want to be parents and this is hurting her as she is one of them. Its ok that you feel parenthood isn't great, its not ok to argue that point to your grieving sister. You need to start apologizing and fast.", "YTA. This post made me so angry. I am currently going through ivf and the process is one of the toughest things I’ve ever had to do. How dare you say that to your sister. You’ve completely invalidated her feelings and dismissed the grief she is experiencing. When you want children that badly and you can’t have them, your whole world comes crashing down. An apology is bare minimum what she deserves.", "YTA  You should have kept your mouth shut.\n\nI'm childless - never managed to carry beyond the first couple of months.  You do NOT try to cheer up a childless woman by telling her she's better off that way.  \n\n\nEdited typo.", "Yta\n\nI have had seven miscarriages (3 living children now) and the amount of thoughtless comments I’ve heard is huge but none of them were as hurtful as what you said to your sister.", "Wow.. Yes YTA. A HUGE AH.\n\nHey I'm sorry you're blind, but look at the bright side, you don't have to look at ugly people.\n\nHey sorry your spouse died suddenly but you're going to have so much fun being single.\n\nHey man sorry your dream future you worked so hard for isn't going to happen through absolutely no fault of your own, but don't worry, it was a stupid expensive dream anyway.\n\n\nYou told a grieving person their loss is not a big deal and they're better off. I don't think you have ANY IDEA how hurtful and insensitive that was.", "Tact. Learn it. YTA.", "YTA.  Please read up on toxic positivity and the stop doing it to people who are suffering.", "YTA \n\nYour sister was just diagnosed with a horrible disease that affects every aspect of her life and gives her no chances of experiencing motherhood. You don’t know what that feels like unless you have endometriosis or any other gynecological condition that affect fertility. It was extremely insensitive of you to say that to your sister, even if you were just trying to make her feel better.", "I'm childfree and YTA no duh raising a child isn't 100 percent rainbows and sunshine believe me you didn't need to tell your struggling sister. \n\nYour mom's right you should be disgusted. Do you even love your sister?", "YTA. I'm not even going to bother reading past the title. If you actually said that, WTF is wrong with you?", "YTA. You were trying to help but understand that to someone trying as hard as she was, this was the very wrong approach and way, way too soon. She desperately WANTS those moments. Perhaps those parts of parenthood are enough to turn you off to it a bit but she wants every part of it more than anything else. The way you approached it sounds dismissive. Like an “oh well, you probably wouldn’t have liked it that much anyway” which is alright about very minor things.. but not about parenthood and about wanting desperately to create a family. And certainly not that soon. She likely feels like you dismissed her pain and are trying to push her along to getting over it already. Like it was not that big of a deal. It’s probably life-shattering to her. In future.. IF she ever shows her vulnerability about this part of her to you again, and she likely won’t unless it comes with a ton of resentment about your comment.. she is looking for a safe place to speak about the devastation. No feedback is going to help. Just listen and offer love and support. Nothing you say will diminish the pain and to try to diminish it is likely going to feel like you want her to hurry up and move on.", "NTA.\n\nI'm going to disagree with what appears to be the majority here. I feel like you were trying to help her out, and with more time removed from the situation it might have landed better. As someone without kids myself, I agree with all of your points. However, she'd just been through an awful emotional rollercoaster, and was dealing with very fresh wounds. I'd just give her time and space for now.", "YTA. Learn to read the room. She wants children and just learned, after being given a glimmer of hope, that she’s still infertile. That was not the time to tell her she’d be better off. Your job was to console her. Bring wine, chocolate, ice cream, pizza, or whatever comfort food she likes. Hug her and tell you you love her. That’s all.", "YTA- folly and wholeheartedly. She had every right to be upset, sad for not being able to fulfill something she wanted. How dare you find the need to justify why she shouldn't be upset.", "Soft YTA.  I think you were trying to make her feel better, but hearing any of that won't make someone feel better.  Tell her you are sorry and just take responsibility.", "YTA. The lack of empathy and even common sense…wtf", "YTA. Not tactful. Maybe I a year. Too soon.", "YTA, a heartless AH", "If I ever need an example to explain toxic positivity, this will be it! YTA", "Don’t be surprised if your sister does not want a relationship with you, because holy shit, I wouldn’t. YTA.", "YTA.", "YTA. You weren't trying to help her at all. You were trying to make yourself feel less awkward", "Shit man, that's insensitive of you.\n\nYTA", "As someone that suffered from infertility for 7 years, you are the biggest and most complete YTA I have read about.\nDoes your sister somehow live in some sort of bubble or cave where she doesn’t talk to friends, watch TV or even have a Reddit account where people bitch and complain about children all day long? Have you not seen Tiktok? We know how hard it is. That doesn’t negate the feelings of disappointment sadness and other life heart crushing emotional despair that she’s going through. YTA", "YTA. you just topped my husband saying my ongoing miscarriage was a blessing in disguise.\n\nHow could you? For hell, just support her and help her feel better. Let her grieve and when she possibly looks into other options around having children just shut up and be optimistic and help pick out baby stuff and name suggestions etc. It's so ducking hard for some people to be aware of others sadness. Wtf.", "YTA. I know you were trying to maker her feel better, but she was devastated and all she wanted was miss. Do you really not think she’s had these thoughts throughout her infertility process? Apologizing profusely is your best route", "Yta..... how dare you. I was blessed to have one. A few years after my son was born I suffered a miscarriage. But it wasn't just a miscarriage.  After some testing I was told Id never beable to carry another baby to term. My goodness I was heart broken.....still am.", "This is one of the biggest asshole posts I think I've ever seen, to the point that I don't actually believe it's even real.", "To be fair, I, currently going through fertility issues and a miscarriage, would find a joke about not buying shoes as an amputee much more amusing and acceptable than someone telling me to be happy if I couldn't have babies. Idk why One feels more like dark humor the other just legitimately telling the other person to shut up and be happy", "Very well said! Trying to help her sister my ass, it was an absolute shitshow and I feel for the poor sister.", "Applause 👏🏻", "OP's lack of compassion and empathy is astounding.  Like you, I was thinking of equivalents when reading this.  It reminded me of when my friend's husband died and one of her family member's said, \"it was meant to be\" and \"you have to find the positives\" of the situation.", "This was said sooooo well!!! I struggled with infertility for years before having success with IVF. People were always so careful with how they talked about it around me. It was appreciated! It sucks in so many ways. It feels like nothing anyone can say will make you feel better, but dang, as op showed, there are sure things to make you feel WORSE!\n\nHuge YTA", "As someone in chronic pain...I don't hate the bright sides being pointed out, but I am usually the one that does that. Like \"Sure, I can't stand for more than a few minutes without my spine stabbing my back with several daggers, but hey, I get to skip the lines at Disneyland for most of the rides. I mean, I'd rather be able to sit, walk, or stand without pain every single day but bright side!\"\nBut I am probably an odd duck here.", "Perfectly said. We can call this one a wrap. YTA.", "Well I just typed a very similar response, should have read ahead lol because exactly this.", "I liked your first paragraph. Well said.", "The time to say it was never. Those aren't helpful things to say. Everyone already knew that and her sister wanted kids anyway. This isn't some amazing insight or advantage sister was unaware of. \n\nImagine if someone you knew lost the use of their legs. So to cheer them up, when would be the right time to say \"Being quadriplegic may not be all that bad. Standing and walking isn't all sunshine and roses. Take a look at all the unhappy people with jobs or lifestyles where they have to stand all day and at least you will get to enjoy being comfortably seated all the time,\"?\n\nA week, a month, a year? There is no period of time that makes this a less stupid offensive condescending unhelpful thing to say. And I took OP's exact quote and just changed a few parts. \n\nIt's concerning to me you think this would ever be a good idea.", "Ah yeah, I’m sure the deeply emotionally damaged people at childfree understand how it’s really supposed to be.", "Omg I hate this so much. I dislike anyone who ever says this about a serious issue. Like, I didn’t click buy fast enough on a pair of designer heels that were on sale? Not meant to be, everything happens for a reason. Cool. A woman gives birth to her child who then dies an hour later? You had better effing not say that shit or I will lose my cool. \n\nEqually as bad is “in gods plan.” I just respond “why would you ever worship someone so cruel, freak”", "As a Christian who does believe this, it blows my mind that some people think it’s ok to walk up and say it to someone grieving.", "Especially after JUST finding out it will never be possible.", "If you really can't understand what you did wrong here, I'm concerned your empathy and other social skills aren't fully baked.", "I bet your parents  suffer so much raising you you massive ah. YTA.", "Because there’s a time and a place. Even I, an autistic person, know that.", "Honestly, it just wasn’t the time. It’s a fresh wound and she just needed support. You were coming from a good place, but she didn’t need to hear anything more than “I’m sorry you’re going through this” and “I’m here for whatever you need”.", "Why did you have to say that?  Why couldn't you just be supportive?  Instead you opened your mouth and said a very braindead statement.", "YTA! Um, what is this emotional and social ineptitude you have going on here? Are you not around people all the time? Are you a robot in disguise?  What you said to the person who was just told that their dream of having a child was a gift in disguise cause raising and paying for children is hard and expensive was distasteful, rude, and heartless. There is no other perspective she wants to hear right now. If you can't do better than what you have explained here then do her a favor and be quiet.", "What a daft asshole you are...", "Are you usually this cruel, or is this a one-off?\n\nYTA", "Ooo boy. You’re the absolute worst kind of person. Get help.", "The cons don't matter right now (or perhaps ever), she's grieving something that she lost and you are supposed to support her. \n\nI've known people who have been adamantly childfree for years. But when the choice got taken away from them, they grieved. Because it wasn't their choice anymore. Somewhat illogical? Maybe. But that was how they felt, so I just hugged them while they cried.\n\nYour sister wanted children, apparently badly enough to go under the knife to fix something so that she could get it. That didn't work and she is SAD. Just support her in her sadness. You don't have to cheer her up (and your idea of doing so obvs didn't work). \n\nApologize for your misguided attempt. Tell her that you wanted to see her smiling again, but you were selfish in that attempt and know that right now, maybe she just wants to cry. And that you are there for her if that is what she wants to do.", "imagine losing an arm and then someone told you \"hey, at least you can't break that arm now that you don't have it\"\n\nthat's what you did to your sister and I can't believe you don't understand it.", "You didn't see how rubbing her face in her infertility was horrible? Lol how patronizing you are. You just had to inform her of how bad parenting is right? Like she's not a fully capable and aware woman. YTA", "Really? You read all these comments and you still don’t see?", "I told my mom at my dad's viewing/funeral that I was going to punch the next person who said \"Trust in god, he has a plan\" or \"everything happens for a reason\" directly in the face, and I meant it.", "Makes me want to defenestrate the person right through that window God supposedly opened. It's not kind or helpful to think God gives kids cancer for a reason. Sometimes bad things happen to good people due to a shit roll of the cosmic dice", "My husband died of Covid 2 years ago. My only child died almost a year to the day after him. I actually had someone say, \"Well, at least the house will stay neat and the light and grocery bill will go down.\" They were VERY lucky I was so shocked they'd be so insensitive and stupid for saying something like that or else they'd have found out what it was like to have a boot in their backside for their entire march home. People can say the dumbest things at the WORST times.", "At least now you don’t have to worry about them getting shot during a school shooting!", "Yeah that is the literal title, what am I missing", "Ha ha, right? Like you always had the option to save your money and just not have a wedding. You chose to have a wedding", "This!!! Ugh I have two special needs children and I dont understand why people think its comforting when they say this. I also love when people randomly tell me Im doing a great job for literally just being a parent or “ It takes a special kind of person, I could never do what you do.” \n\n😳 fml. \n\nPlease learn to sit with that which makes you uncomfortable. \nA simple, “Do you need anything?”\ngoes further than any piece of advice", "Or \"it's all part of God's plan\". If that's his version of a plan than he just sucks.", "Oooo that’s just… I know it’s easy to say when it isn’t you? But FUCK that’s awful and I feel like my reaction wouldn’t have been pretty.", "Oh my goodness. That is such a shitty thing to even think about someone, let alone say.", "I hate that phrase so much. What doesn’t kill you doesn’t make you stronger, it gives you trauma and directly harms your ability to form and maintain relationships with people.", "YTA.\n\nShe literally just learned the news, had zero time to grieve said news and that's how you chose to comfort her?!\n\nYiiiiiikes. I don't think you could have been more insensitive if you tried.", "YTA. For fun do you go around telling kids Santa isn’t real too?  I think it might be time for some serious self reflection of you thought that was an appropriate thing to say to anyone, let alone someone you supposedly love? How do you have so little empathy? You have a whole world of technology at your disposal, use it to find a clue. At the very least find some empathy training.", "YTA. What if your husband died and someone told you to look on the bright side? At least you can have independence without worry! Now you can do whatever you want!\n\nDoesn’t sound good does it?\n\nYour sister didn’t want someone to tell her “the bright side” of being unable to have children. She wanted them. She  *hoped* for them, so badly, that she had a surgery that was supposed to allow her to have them.\n\nAnd instead she woke up from that, to the very opposite of that news. \n\nYour sister is grieving on multiple levels.\n\nShe is grieving not having a child. She is recovery from a surgery that she thought would secure that hope. She is grieving and worried for her husband who wants children.\n\nThere is no upside. There is no light joke that explains it’s okay. Her reality is and has been shattered and she is *literally* grieving and probably worried for her marriage.\n\nAnd you thought it would help to give her the bright side? That parenting is hard? She wanted to parent, she wanted that hardship. You are throwing it in her face that she will never get to experience that hardship.\n\nPlease please recognize why this is wrong. And just how badly you mad this worse. Apologize and give a brief explanation that you intended to help but you realize you went about it wrong. And then be there for her. Listen to her woes, let her vent. This is a very hard thing to go through", "YTA - I actually don't want kids. Never wanted kids. I've always known I've never wanted kids. Yet ironically, being told I couldn't have kids or would have difficulty having them was still strangely devastating. \nBut your sister wanted her own children more than anything in the world. All you needed to do was be there for her.\nDon't try to \"fix\" or \"solve\" anything because there's no answer to this.", "My wife went through the same shit. I can't imagine a family member saying this. YTA. Yes having kids is not sunshine and roses but she wanted it. She had no choice as to whether have kids or not. It was taken from her. Grief is grief. You don't get to decide if it's a big deal or no.", "Idk but you should send her information about gene editing and that surrogacy and designing her baby may help her feel more like its hers.", "Why did your sister not know she wouldn't be able to have kids until after the procedure? Didn't the doctor explain that he would be literally removing her uterus or ovaries?\n\nIDK, this post doesn't make sense to me. Can anyone imagine someone getting surgery to have their uterus or ovaries removed and then being surprised they can't get pregnant?", "YTA. What is the matter with you! Omg.", "Come on now. \n\n\"Do not worry that you're not in a relationship, partners require time, attention and money, and they may need you in an emergency, it's not really worth the effort.\"\n\n\"Do not worry about taking care of your elder parents, I know you love them and they have been amazing parents all your life, but they're old and require a lot of work, it's just not worth the effort.\"\n\nI'm sure the sentiment you gave your sister may be true for you if you're childfree. I am childfree and share the same mindset. Your sister is not, to her she wants children and they are worth the effort, and everything that comes with kids, good and bad. YTA for being insensitive regardless of your intentions. You owe an apology to your sister.", "NTA", "YTA - What OP said was highly insensitive even if it came from good intentions. For someone who's wish to have children is as deep as it has been for OP's sister these words will trigger anger and more hurt than she already is going through. So I would agree while your intentions may have been good, in context it was the wrong thing to say to the person concerned.", "YTA and wow you have a lot of relationship repair to do with your family.", "YTA I don't want children and never had. But the news that I was unlikely to still hit very hard. It is a grief that something you should, could of have been able to have will never be an opportunity. And because child bearing is so tied into societal notions of being a \"good woman\" or a \"desirable woman\", it took me sometime to reassure myself that I still had worth and still was feminine. \n\nThough what you said came from a good place,it is a little akin to saying to someone grieving \"Oh, s/he is better off dead and at least you don't need to worry about taking care of him or her\". If you wouldn't say that, then don't say there are benefits to not having children to someone who is not choosing not to but is unable to have them. Especially when it is fresh. At that point, they may be willing to bear all those burdens just to have a child but it'snot a choice open to them.", "YTA. I am CF by choice. My oldest sister is trying to come to terms with being infertile. I would never, EVER try to convince her that CF is the way to go. You know why? Because it's fucking insensitive. But you know what makes you the AH times 1000? Trying to convince her of that a week after she's gotten the news. She's barely had time to begin to process and here you come with all the Answers To The World's Problems and thinking you're some kind of saint.", "Damn I’m childfree and even I know how much YTA. Infertility grief is a real and devastating thing for a lot of people, and you may have meant well but you completely minimized that at the height of your sister’s suffering", "YTA, and also YTI, because only a hopeless idiot would say something like that to that particular person at that particular time.", "Ngl I can see what you were TRYING to do which I guess is look for the silver lining. But dude (or dudette) timing! \nI’m also infertile I have hydrosalpinx & it kind of broke me for a little knowing I would never be a mother, never be pregnant and have a baby to term. It’s beyond hard to come to terms with as you feel like your body betrayed you, the one thing it’s supposed to be able to do as a woman and you can’t. You feel like you let your husband down and it nips at you every day. Sometimes for stupid reasons (for example I feel like I cannot enjoy Meghan Trainors new song mother cos I’m not one - dumb right but it almost brought me to tears this week) and I’ve been aware of this for 9 years. \n\nBut I will say getting through the disappointment relies on two things -  1) grieving your ‘lost’ life and 2) planning happy things for your future life. \n\nNow it’s 9 years later and I’m buzzing with my life, I travel, have hobbies that take me away for trips, go to live music at the drop of a hat, spend loads of time with my husband, volunteer, learn languages and musical instruments, I get to spend my life having fun, caring for the vulnerable, loving my husband and just feeling really fulfilled. A lot of my friends with kids have complained about losing themselves to parenting and feeling lost and though they are happy they are a bit jealous of me sometimes, which feels great because sometimes I’m a bit jealous of them too. \n\nApologise to your sister, let her grieve and try to be there for her in the ways SHE needs you to be. \nBut best of luck to her xx", "Damn you're an ass.  How the hell is that supposed to help her?  You're one of those people that just have to rub salt into a wound.  YTA.", "YTA, your intentions were good but it was not an appropriate comment for the situation.", "YTA. If you don't realize why you are the asshole please let your mother explain to you why your comments were \"disgusting.\"", "OK I understand why people are saying yes and I know this is the unpopular opinion but I say NTA.\n\nMy situation is similar to your sister's situation. Depending on how I where I was on the journey, one of my siblings would say similar things to cheer me up. Occasionally they would misjudge and make me angry or hurt. \n\nI don't know how your childhood was but we were always pressing each others buttons. Trying to make each other laugh. Trying to annoy the crap out of each other. We still do.\n\nYour intentions were good. She probably isn't ready for an apology but wait a day or 2 and try  to explain it was just a bad attempt at making her feel better.", "YTA It is a special kind of insensitive and cruel to invalidate someone's fresh and real grief by trying to point out some kind of \"brightside\". Her life just changed dramatically and what she wanted for her future is no longer an option. She has every right to mourn the loss of the life she expected and wanted with all her heart. Just damn dude, I'm child free and what you said was just so ignorant of her feelings!", "YTA. You are an incredibly large asshole and people like you are the only reason I’m pro choice. Infertility is so hard and not a choice anyone makes. Learn some compassion", "YTA! When I was in the middle of infertility hell, my MIL brightly told me \"you can still have a happy marriage without children!\" and I will NEVER forgive her for such a cluelessly bullshit thing to have said. If it turned out that I was 100 percent not able to get pregnant I would have been  devastated to my core. You weren't trying to make her feel better, you were trotting out toxic positively  bullshit so she could shut up about her pain so YOU'D feel better. If I were your sister, I would never want to speak to you again. EVER. You kicked her when she was down, when she needed love and understanding.", "Yta instead of what you did say you could have tried hey have you ever thought about adoption I do not mean derictly after her ordeal I mean wait awhile and then mention it", "Massive YTA- that is a disgusting thing to say, not only to a person who just found this out, but to anyone ever.", "Y’know, sometimes I say something stupid, or do something stupid, and after the fact I kick myself. Like, how could I have not realized that wasn’t the best decision, or why did I make a bad choice?\n\nAnd then there are people like you, where your purpose in life is to make people who are occasionally stupid feel better about themselves.\n\nYTA, if it wasn’t clear.", "YTA. 100%", "YTA… what went through your head as you typed all this out and thought “yup, this is a difficult question” 🤔🤔", "Aren’t you the best brother she has", "Yta! Omg.", "Look at the bright side, you don't have a sister anymore!  No arguing, no rivalry, no time commitments to family gatherings, no sharing clothes and makeup, etc.  So many good things about not having a sister.\n\nAnd keep it up. You won't have a mother no more either!   \n\nYTA", "In what universe is making a comment like this OK? Your sister is grieving and needs your support, not some stupid comment like this. She shouldn’t have involved your mother, but every word of what your mother said to you is true.", "The same BULLSHIT you said to your sister was the same BULLSHIT someone said to me after my son died. You are a big ASSHOLE and was very out of line.", "Soft YTA. I don’t think it was your intention to invalidate your sister’s feelings. It’s hard to know what to say to someone struggling with infertility. Call your sister, tell her you’re sorry for what you said and that after thinking about it you’ve realized your efforts to comfort her were ultimately more harmful. Validate her feelings by saying something like, “I’m so sorry for you, you must be heartbroken.” And let her know that you’re there to listen if she ever needs to talk about it.", "YTA. As a woman who has lived with infertility if a member of my family had been so cruel and thoughtless in their comments in the immediate aftermath I would not have stayed in contact.", "[removed]", "\"Sorry your mom died\" \"It's not that bad though, many people are unhappy with thier mothers\"\n\nYTA", "YTA\n\nWow, just wow.", "What in the actual fuck is this BS? YTA. If this is how you comfort her I'd hate to see you be mean.", "I'm sure most 31 year old women are perfectly fine with being reminded they're infertile and will never be able to produce and offspring....YTA.", "Yes, YTA. Infertility is a very difficult road for many couples. Trying to offer someone a “silver lining” by telling them they’d be miserable with kids is so so inappropriate. They want children and their dreams are being shattered. Your sister needs empathy and you gave her apathy.", "Big YTA. There is no positive side to this situation for your sister. This is something that not only impacts her feelings towards herself but also has the potential to end a relationship if a partner is set on having biological children etc.", "YTA jesus christ op what kind of thing is that to say to someone who is grieving", "Probably a nerve you shouldn’t have found.", "Imagine being told your husband was dead, and then having your sister at the funeral say, \"Well, he could be an ass sometimes, left the toilet seat up, made a mess and didn't clean it up, maybe you are better off without him.\"\n\nYTA. She is mourning the kids she will never have, and you are not helping.", "and I thought my father was the worst when he told me \"you really should thank you're ra\\*ist. without him you never would have met your husband!\"", "[removed]", "So, in addition to her grieving the life she thought she would have, you also tried to convince her she was a bad person for not being able to “see the bright side?” \n\nIf her husband had just died in a car crash would you show up to her house immediately after and say, “Look on the bright side, now you can go date around and live that single life!?” I sure hope not.\n\nYTA \n\nPlease, for your sister, be better. If you need to say nothing, say nothing. But never spew this toxic positivity again.", "YTA\n\nI’m no longer a practicing Christian, but there’s a verse that always stuck with me that I think applies to anyone, religious or non-religious:\n\n“Rejoice with those who rejoice; mourn with those who mourn”\n\nNow is not the time to offer a different perspective. Now is the time to mourn with your sister.", "YTA, sorry but she just needed to mourn in that moment and not “look at the bright side”", "YTA.\n\nThat is absolutely the wrong way to comfort someone experiencing grief. What you said is soul crushing, not uplifting. She deeply wanted to have children with her partner, and now she can't. To make it worse for her, her sibling comes along and basically rubs salt in the wound.\n\nConsidering that infertility is never something that anyone asks for, you should never, ever, ever make it sound like there is anything positive about it.", "You minimized everything she was feeling.", "YTA. As someone who was never able to have children of my own, what you said was awful, even if you actually had good intentions and believe what you said.\n\nIt took me YEARS to come to a place where I could let comments like yours roll off my back. I do see the plus side now, many many years later. But back then, I’d have gone off!!", "YTA, \n\nYou are the most insensitive, callous and idiotic sibling in her family. How could you say something like that to somebody?!?\n\nThat’s a very, very offensive thing to say something so heartless, cruel and insensitive.\n\n How dare you!\n\nAll you had to do was to give her a nice hug and say “I am so sorry for your loss.” and just let them know that you’ll be by their side no matter what. \n\nIs that hard?!?!", "NTA, but understand your sister's beliefs are good and your beliefs aren't hers. For her producing children with one's spouse is the ultimate achievement for a family. Next time just sit with her and say nothing...that way you can't be blamed for upsetting her in this time of disappointment.", "YTA.  My husband and I strugged with infertility for years (I have PCOS and he has low sperm motility).  A year or so after accepting my child-free reality, I had a DVT and PE which were caused by the birth control pill (I had gone back to college and did not want an unexpected pregnancy, no matter how small the chances).  After further testing, we discovered I had Factor V Leiden, which meant that my blood clots were estrogen linked - so anything such as pregnancy or hormone replacement would be dangerous.  My infertility may have saved my life; however, that doesn't mean that I celebrated my infertility and I would have still slapped anyone who said it was a \"good thing\" I didnt have children.  It's been over 10 years since I accepted my child-free status, and even now I still wonder \"what if\" we had children - and it still hurts to realize that I will never have children or grandchildren.  Don't ever demean anyone's sadness or grief - it isn't yours to bear so you have no right to tell them how they should or should not feel.  It's OK for them to realize that maybe being child-free isn't that bad aafter all, but don't force that point of view or opinion on them.", "I chose to get sterilized. That was my choice, because pregnancy to me is a nightmare. But I know that to a lot of people, it's a dream, and they'd *kill* for the opportunity to get pregnant. Honestly, if donating eggs wasn't so tough on the body, i'd have done it a long time ago. Hell, if uterine transplants were possible, i would gladly do so! Not like i'm gonna use it.\n\nBut despite my own personal feelings or decisions, i would *never* shame anyone who desires to get pregnant (unless they would be a horrible parent). Because telling someone who *can't* bear children, who desperately wants children, the things that you told your sister, is one of the most disrespectful and hurtful things you could ever say! You need to apologize to your sister, yesterday. The *audacity* you have to tell someone who's infertile to \"look on the bright side\" can only be expressed in words i cannot say on this sub.\n\nYTA, YTA, YTA. ×1000", "YTA what the fuck is wrong with you jesus christ.", "YTA.  I guess you meant well, but you royally fucked up.  Never tell anyone that they're better off anyway without the one thing they desperately want.", "Not only are you an asshole, you're also quite stupid for not even realizing it.", "YTA - just reading the title.\n\nAfter reading the post - YTA!", "Yta", "YTA!!!!!!!", "Soft YTA. I’m sure you were trying to make lemonade out of some bitter lemons for her, but some people REALLY want kids. They don’t feel like their life is complete without a family. They dream of it since childhood. I was never one of those people, though I did eventually have them myself. But I know not to invalidate people’s experiences and sadness. This is something your sister needs to mourn. She needs to come to acceptance, or look into surrogacy or adoption. Whatever she wants or needs to do. She doesn’t need people to tell her that it’s not a big deal! It is. To her.", "YTA - This kind of toxic positivity is infuriating! \nYou’re the person that tells someone with an incurable cancer that they’ll “beat it”", "Being the biggest AH of the day isn't that bad, you have tons of attention/harassment on this subreddit and dms, people calling you out for your insensitive behaviour and your zero emotional intelligence, and toilet theme awards given to you to show how much of the AH you are.\n\n\n\nSarcasm aside, OP is seriously the AH and the worse one I ever seen Today.", "YTA that was incredibly insensitive of you", "I speak as an infertile guy who desperately wanted a family of his own, the RAGE that I would have given you is beyond comprehension. You have made fun of her and her deepest worries. I would honeslty be surprised if she ever forgives you. However, I can guarantee she will never forget it. If I could vote YTA a million times, it would not be enough. This kind of situation is enough to destroy her relationship with her husband and you think you are helping? No.", "You may have thought that you were doing something good, but in reality you said perhaps the worst things you could’ve said. She is grieving, and she has every right to that grief. Your job as someone who loves and supports her is to simply witnessed that grief, acknowledge it, and let her know that you are there to support her in whatever way you can. \n\nWhat you could do now is to reach out to her in a way where she has the power to read your message on her own time. Perhaps a card. And it simply say that you are truly sorry for the things that you said, that you were trying to help but you realize that it was really really wrong. Ask for her forgiveness, and state that you will do better in the future.", "YTA…. Some people WANT children. And unfortunately that population tends to also be those who CANT have them. That was an incredibly shitty thing to say. I can’t even tell if your intentions were good…. That’s an awful thing to say to someone who wanted to carry a child of their own. Wow…. I wouldn’t blame her for going NC with you after that.", "Nta", "Yta.\n\nI thought this would be one of those switcheroo situations where it turns out the potential act of assholeness is justified (happens!) But noooope. Just full-blown, show your ass move.", "Obviously YTA, then idea is to go over there to lift her spirits not to invalidate her feelings.", "YTA. The only appropriate answer to news like this is “I’m sorry”", "YTA\n\nWhat an absolutely horrible thing to say to anybody - If you can’t think of something nice to say,  say nothing. \n\nDo you go around telling people who are paraplegic that they are better off in a wheelchair because buying shoes is difficult?", "YTA.  You have no idea what a devastating experience this is and your words likely made it much, much worse.", "YTA Oh my god how are you this insensitive and dense??? She is grieving. She has had the possibility of biological children ripped out from under her and that was your response? She WANTS kids. Your words were hurtful.", "YTA.\n\nYour advice to her is callous and completely lacking in empathy.  It demonstrates a total lack of understanding about her grief.", "NTA. You were trying to give her encouragement, but you did it in the wrong way. I don't think you had ill intentions, but you should seriously go back and apologize to her.", "Even if you don’t want kids and maybe even feel like they’re a burden doesn’t give you literally any right to force your opinion on someone else who had their options taken away especially when it’s something most women have been raised with as something that’s natural and something everyone should want.", "YTA - wow, beyond the pale: you need help, therapy is a good idea.", "YTA YTA YTA what is wrong with you??? If I were your sister we would never speak again!!", "YTA motherhood is something she wants in her heart of hearts. She isn't ready to look at the other side. She is grieving over 6 wants but can't have. You have no idea how heartbreaking that is", "YTA. it's like this: imagine you were writing a book that was taking you a **lot** of time and effort- all for it one day to get deleted or something. No chance of getting anything back. Would you like it if someone came up to you and said 'well don't worry publishing is hard anyways and being an author is stressful so it's for the better!' I hope you said no because that would just be incredibly insensitive and disrespectful on their part! Let's try to understand people's grief instead of invalidating them in the way you did. PS: apologize to your damn sister.", "My blind mother would have lost it if someone said that to her lol. Sometimes in this subreddit I find harsh replies I think we're a bit unnecessary. But this is so deserved. This is just common sense, OP. Hopefully they learn for next time someone confides in them over a painful experience or new loss.", "Oh come on. This isn't invalidating someones feeling. OP never said you are wrong for feeling this way or you shouldn't feel this way.  It came from a place of love and helpfulness.   \nThe edit is better, but you really do not have to be an asshole while telling people there are better tools available.", "Well said  👏  OP YTA massively. OP had better start apologising and grovelling.  Just delusional.", "Couldn’t put it better. Hard YTA. I have heard “oh you can always adopt” so many fucking times and it drives me nuts. Yes, I can, but that doesn’t take away the fact I’m grieving right now.\n\nI’ve noticed people tend to do this when they don’t know what to say or aren’t comfortable with other people’s big emotions, but it’s still AH behaviour", "The thing you can do to make a grieving person feel better is to just be present. Some people don’t seem to get that.", "100% I am 40- have to have a hysterectomy. Will never be able to have children. Never wanted children- but I feel a strange loss. If someone told me it was \"better\" for me that now I don't have to worry about getting pregnant I would never forgive them.", "Nothing else can top this comment, nailed  it commenter. Spot on.", "I absolutely agree with this sentiment.", "Everything in this comment 👏🏻\n\nYTA", "Thank you!! \nThe amount of people that tried to tell me to „look on the bright side“ after my miscarriage was astonishing and I didn’t have the words to describe how inappropriate it was and why it made me mad. After all they were „just trying to help“. Thank you for explaining it so well", "Ugh, my aunt A (mom's sister) told my aunt B (mom's sister in law) that at least aunt B and her sister weren't that close when her sister died. Except they were that close and it was her only sister and a sudden loss. \n\nKarma came around to aunt A though, two shitty kids, a shitty husband, and ms.", "This is a great way to explain it! I have had my feelings invalidated from when my dad died at 12, having fertility issues, my chronic pain, and so much more. It is so frustrating and makes you feel so much worse!", "I do not believe she meant well for a second. Nobody who means well is this ignorant.", "I'm infertile and, though I don't want children, I don't understand how someone can \"feel like less of a woman\" because of it. I can understand the disappointment or even anger and sadness at not getting to achieve a dream of yours, but to go that far? That feels like an insult not only to yourself but to countless other women who go through that and it perpetuates the misogynistic idea that childbirth is all women are good for. Where did this idea even come from for you personally? Forgive me if I sound a little perturbed at that but I am curious. I hope you're getting or have gotten the help you need.", "This mentality is disgusting and sucks even more when its people u care about. I was once in a car accident that totaled my parents car and left me injured. Both said it was a blessing bc they got a bunch of money from insurance, and they didn’t want the car anyway. Op YTA full stop.", "They are lying and fake 100% because no adult desperate to be a parent would mind what OP thinks are the hard parts. They want the \"hard parts\", because they're part of being a parent.\n\nIt's the ineffable *arrogance* of OP that she thinks she can *tee hee giggle* teach and train, oh teach!!!!! and traaaaain!!! her dummy dummy sister to be happy!!!!! about having had part of her soul gouged out.", "Since you can’t understand how hurtful your words were, best to just shut your mouth and say nothing. Your sister is grieving very hard and is in a lot of pain and you added to it. Stay away from her. YTA", "I'm not really sure disability and infertility are really comparable. OPs sister can still be a mother right. It's kinda extreme to say its the same. \n\nI'm not saying OP is right here, clearly not the right thing to say! For the record I am both disabled and infertile. Being disabled is something that affects your life every day for the rest of your life. I'd much rather be infertile than disabled, a million times over. I'm not saying OPs sister shouldn't grieve over this, I just felt a bit uncomfortable with the analogy and wanted to just write my bit.", "Agreed. As a woman, it’s very insulting. I genuinely feel for women who see their worth tied to marriage and children. They infuriate me because they say insulting things like this, but I also have compassion because that state of consciousness must be hell. No longer tying one’s worth to the fulfillment of desires/external validation is a liberation I wish for everybody.", "I thought of Lilo and Stitch when the alien tells Nani “at least you won’t have to yell at your sister any more”. Right after her sister was kidnapped in a spaceship.", "She wasn’t trying to teach or train the sister she was misguidedly trying to comfort her, just like the people who point out that they can still adopt, it may be true but isn’t what the sister needs or wants to hear. Just because you think the negatives are worth it doesn’t make it false. Also I think a lot of parents underestimate the hard parts that why your more likely to hear of parents who wanted 4 kids stopping at 2 than parents who want 2 deciding to keep going for 4. \n\nAnd yes I guess I missed all the places where women were talking about how much they looked forward to episiotomies and being sleep deprived from being woken up every 2 hrs for feedings for years and all the Drs bills.", "They decided but then realized it wasn't worth it. That's just hindsight.", "When my daughter died, an acquaintance of mine who had also lost a child reached out to me immediately and said “Please, brace yourself. People are going to say the most horrible and insensitive things to you. They don’t know any better. Our society is really bad at grief”\n\nIt was literally one of the most helpful things anyone said to me during those dark days.  I wasn’t as blindsided, even when people did indeed say some absolutely daft bullshit to me. Imagine telling a grieving mother that her baby is “in a better place”???\n\nI am deeply sincerely sorry for your losses. It’s unfair and it’s awful, and none of us should have to endure that kind of pain and agony.", "I overheard that said to a 24 year old father of two dying of brain cancer.  I was too stunned at the time, but later I was wishing for a baseball bat to check out how that idiot would deal with some alleyway attitude.", "Someone had the absolute gall to tell me \"she's in a better place now\". I was attending the funeral of my 14-year-old niece that I loved more than anything. I got very heated and damn near yelled back that no she's not, a better place is here with her family and friends who love her.", "As someone who struggled with infertility for almost a decade YTA. You are a terrible and cruel person. If someone dies do you tell people at least you don't have to deal with the negatives of said person? If someone loses a leg do you tell them at least their feet won't hurt anymore? You are awful. I hope others have less angry more logic based responses on why you're terrible here bc I find this so infuriating that I cannot be logical right now.", "YTA! What in the world is wrong with you!?!", "YTA and even more so for thinking it's ok to be so extremly insensitive.\n\nYou knew she wanted to have children, you knew she was having trouble and already having a hard time, you knew her diagnosis was part of that, you knew she was happy that the surgery may help her do the thing you want and then you STILL decided to completely disregard her feelings on it and belittle her?\n\nThere is no situation here where you aren't the asshole. \n\nYour comments were disgusting and you should be ashamed of yourself. She is grieving the process of not being able to do the thing she so badly wants to do after being given hope and you disregarded her. Just wow.", "YTA. Why would you think you aren’t?", "I don't even need to read the whole post. YTA", "Oh my goodness YTA. Do you also tell amputees that it's not all bad, now they never have to worry about their foot falling asleep again?", "YTA, Jesus Christ.", ">Yesterday I went to visit her to try to **lift her spirits.** \n\nwhat did you try to lift her spirits with, BRICKS?? \n\nYTA", "YTA. She wants to have kids so it’s not some sort of secret blessing that she can’t have them just because you apparently don’t want them. This is why I tell people I’m incapable of having kids instead of I choose not too have them despite both being true. I don’t want to be associated with the childfree stereotype shown here.", "YTA in a big way\n\"I feel like me trying to help only made things worse.\"\n\nDamn! Very astute observation! She now not only has to grieve for her inability to have children, but for her loss of a sibling.", "I am myself struggling with infertility, PCOS and endometriosis, and jeezus you're a raging asshole. Blame this rant on my raging hormones since I am on IVF protocol. WOW. Everyday I am baffled that ignorant and idiotic people like you exist. Fucking hell. I swear. \n\nYTA\n\nApologize. You were in the wrong. Your sister is grieving this part of her life. Offer support and empathy.", "YTA\n\nAs an endometriosis sufferer who has had 7 miscarriages and is now infertile I can say in all honesty to SHUT THE FUCK UP! KEEP YOUR OPINIONS TO YOURSELF!\n\nShe has had the worst possible news that can be given to a woman who wants to be a mother. The feeling of failure doesn't go away. Do you have any idea how horrible it is to know the one thing your body is supposed to do, doesn't do it?\n\nThe feeling that you've failed your husband is real. So much so I even told mine that he could leave me and if he met someone and had a child I would be happy for him. That how fucked up in the head it gets a person.\n\nYour comments weren't helpful. They couldn't possibly lift the spirits of someone who is devastated. \n\nThere's not much help for people in your sisters position, and what help there is is super expensive and takes its toll mentally and physically.\n\nYou owe her an apology, big time.", "[removed]", "YTA.  I'm left to wonder if it was intentional or if you really are that dense?", "YTA YTA YTA YTA so many times Y. T. A.\n\nAll those things you said, about kids being difficult and costly and everything else? She knows. She has known for years. THAT'S WHAT SHE WANTED. She wanted the hardship and pain, emotional turmoil, and the utter joy and literal instinctive fulfillment of raising a small human. And you took the VERY THING that was hurting, and told her how that was the best part about this.\n\nStay away for a long time. Think about what you've done. Then go grovel at her feet for forgiveness.", "YTA\n\ntalk about not reading a room. she wants to grieve. let her and support her in grief. like damn some things just aren't said.\n\nand so she may not be able to conceive, you have no idea the next step in her journey to parenthood if she chooses it.\n\nedit removed something that felt like it would be read as insensive", "YTA. As someone who has been through infertility and has a child through IVF, I cannot tell you how incredibly grateful I am that I get to be woken up in the middle of the night by a crying child. That I get to revolve my life around my toddler and her schedule. I'm so glad that I get to go shopping and buy her things and take her to places. \n\nYou're right, it isn't all sunshine and roses. But even when things feel really hard, me and my husband still stop and say that at least we are lucky enough to experience this. \n\nApologise to your sister and just listen to her and be there for her. She is grieving the life she thought she would have and the children that she already loves with all of her soul. She is a mother already without a baby to pour her love into. Her family feels like it's missing a piece. Yes she and her husband will have more free time but I bet she would give up all of that just to have her own child. She must be so incredibly heartbroken right now. Stop diminishing her feelings just because you feel awkward and you don't know what to say to make her feel better. There's nothing you can say or do to solve this. Please try and be kinder to her.\n\nThere are plenty of resources online that begin to describe how infertility feels like. There's some great Instagram accounts that are very easy to find. Maybe have a look at them before speaking to her again so you can have some understanding of what she's going through, maybe it will give you a bit of empathy to her situation.", "YTA", "Soft YTA, I get where you're coming from, trying to \"the grass is always greener\" thing. but this is not the time to do that. especially when its something they've been actively trying for. \n\nSimply apologize, you said the wrong thing when trying to console them. \n\nanyone going \"your the asshole majorly\" is being kinda ridiculous. there is no manual in \"how to handle X emotional situation\" clearly you weren't trying to be rude or mean.", "YTA, I think you were trying to help but you messed up badly. You should tell you sister your sorry for being insensitive, be sincere. When and If you sister is ready to talk to you, don’t try cheering her up, just listen to her and be there for her and let her process her feelings, she’s probably not gonna be ok with this for a while and you need to accept that.", "Wow, I almost want to say you are but I won’t. Please be mindful of how painful it is to not be able to have children. Apologize, don’t forget to hear her side and be mindful words are eternal and manifest back to us.", "YTA. It breaks my heart that my body said I only get to have 2 kids. And I have kids. I can’t imagine not being able to have even one. It’s heart breaking.", "You can’t be serious OP! That is one of the worst ways to console someone who just found out she cannot have children she wanted so much. \n\nI know people who cannot have kids. Do I complain about being exhausted and dealing with their shenanigans? Absolutely. But I would never in a million years tell them they are better off without kids. Because this is a dream they have and are unable to fulfill. \n\nYTA", "YTA. BTW, reading these comments make me feel validated about the anger I feel when a certain family member always throws my infertility in my face.", "OP what the absolute hell is wrong with you?! don’t you ever say that shit again. i really wouldn’t be surprised if your sister goes no contact with you in the future. i feel bad for your sister \n\nEDIT: YTA and a major asshole because that was extremely petty and extremely mean", "I don’t think you were in any way intentionally trying to be anything, but supportive and try to paint a “look on the bright side” sort of picture. YTA in that there is no other way to paint the image, at least at this moment. Emotions are raw and the support your sister needs is to just be present. No words. Just a loving shoulder and ear.", "Soft YTA I'm assuming you don't have children if I'm wrong then it's not a soft. While I understand you thought you were being helpful there are people who view all the things you listed as wonderful. That being said I'm probably alone in my judgement.", "YTA.\n\nI'm in your sister's shoes, and my sister would never have said such a thing to me.", "YTA I say this as someone who doesn’t want kids and I would never tell anyone that their infertility makes them better off. Especially when I know that they’ve been trying to get pregnant for years. \nYour sister has just found out that it’s a low probability that she will have the kids she wants and you chose to ignore her grief and even if she forgives you, she will likely never trust you with meaningful information again", "Massive YTA", "YTA but with kindness\n\nI understand that you wanted to cheer her own but you did it in the wrongest way possible. This is not a subject that a problem solving male mind, it was a time for listening and letting her express feeling and nodding in agreement.\n\nLets take fatness as an exemple and let me demonstrate your help.\n\n-in the airplane, needing two seats means less people arouns you to annoy you\n-you can taste the food for longer since you eat so much\n-when you dont like a shirt anymore, you can turn it into a curtain, something thin people cant.\n-Why be thin and sexy, being looked at all the time is exhausting. Now youll have some peace, people will like you for who you are instead of your look", "I’m sure you have no idea how challenging it is to live with endometriosis. It is not a “simple surgery”. Your body isn’t fully healed until 6 months post op. It typically is associated with other chronic illnesses and auto immune disorders. They have no idea what causes it. They have no idea how to fix it. It is a debilitating, life long condition. \n\nDo your sister a favor and go read r/endo. Read our stories. Read our pain and know you will never understand. Then apologize profusely and ask how to support her.\n\nYTA", "YTA.  You don't seem like a stupid person so you know darn well that was twisting a knife in her rather than \"helping\".  If you are a parent with children just because you wish you didn't have them now and then doesn't mean she would feel the same.  If you are child free and ever get hurt/outraged by people's commentary about your desire and choice, you just did the same thing to someone else.", "Not quite sure if I've seen a more clear cut YTA in here.  \nIf she lost her legs too would you tell her \"well legs are overrated, now you don't have to cut your toenails, shave your legs or even walking anywhere, walking is exhausting you know!\"", "YTA, I would never speak to you again, Sister or not.  What is wrong with you?", "YTA…….. who says that to a grieving person bro 😭", "YTA and just so so so thoughtless", "YTA", "YTA, I dont care what your personal opinion on having children is but saying this to someone who wants kids so badly and can't have them is cruel IMO. Having kids may not be for everyone. I love being a mom, I chose this life knowing what I'd be \"giving up\" and I honestly wouldn't trade it for anything. To you it may be a burden but to someone else it could be everything. Should've just apologized and left it at that.", "As a person who has gone through infertility treatment the last thing I'd need to hear is it's ok not to have kids. That's no one's business. I feel sad and it's my legitimate feeling. YTA.", "NTA you were trying to be positive. We live in a victim society", "YTA do you completely lack empathy and compassion? Let the woman grieve her loss. You can't \"lift her spirits\" on this one. Your approach was on the same line as saying exactly that to a woman who has just miscarried. Good grief! YTA OP seriously YTA", "I’m not even going to bother explaining it; the other replies were enough. Just making my YTA judgment known.", "YTA - Anytime someone has suffered a loss, gotten bad news, etc. and your response starts with \"well at least\" or \"it could be worse\" or other similar nonsense, just stop talking.   There's a time to just shut your mouth, listen, and be there.  This was one of those times.", "YTA for sure. You should be ashamed of yourself.", "YTA.  Even if it’s true she doesn’t want to hear it.  You wouldn’t tell grandma it’s a good thing grandpa died of a heart attack because dying of cancer is more expensive.  I’m an infertile woman and a widow.  I was 37 when I was widowed.  My MIL said something to the effect of “aren’t you glad now those fertility treatments didn’t work” and I saw red and said things that can never be unsaid, things that caused irreparable damage to our relationship and told her to leave my house.", "YTA. That is not what she needed to hear. Why would you think that would help?", "Are you a dude? That would explain a lot!", "YTA.", "YTA. You invalditaed her grief so you could feel better. I'd be surprised if you still have a relationship with your sister after this.", "YTA … and I think I don’t need to explain why, since everyone else is already exposing why.", "YTA\n\nAs someone who struggled for years to have children I can't even imagine how your sister must have felt when you decided to spout that crap to her. \n\nYour sister is fully aware of the sleepless nights, the stress and cost of raising a child.", "NTA all the stuff you sais there was true but you couldve added that its not yiur place to tell her wethere its good or not shs cant children u coulda been like \"im still here for you\"", "yes you are an asshole. it took me 2 years to conceive my second. it sucks ass every single month", "YTA. She wants kids and her dreams were shattered.", "YTA. Your comments were dismissive and callous. You better apologize immediately and take accountability for your asinine behavior", "Wow you’re such a huge AH.", "I don't understand the people who feel the need to minimize someone's pain. Infertility is painful and isolating enough without dealing with toxic positivity and belittling comments from loved ones and random strangers. YTA", "I don’t even want kids and I’m horrified by what you said. Jesus, the hell possessed you? That was *horrific*! She want kids, downsides and all!", "YTA and you know it. The absolute callous disregard for your sisters heartache is astonishing. I am a female that was sterilized by choice. I am completely open about it and I’m willing to discuss it with whoever wants to talk about it however there are women in my life, friends and coworkers, that I do not bring it up to or tell. This isn’t because I’m ashamed or think they will judge me, it’s because they have problems with infertility. I willingly and eagerly gave up something they are desperate to have and knowing or discussing that I was voluntarily sterilized can hurt them deeply.\n\n\nTelling your sister that it’s a blessing in disguise is cruel and as hurtful as if I were to walk up to an infertile woman and gush about how happy I am to be sterilized.", "YTA. She is allowed to grieve. She is allowed to want kids. Yes, kids can be difficult, but your sister would take all of those difficulties in a heartbeat. Even the title is assholeish. She is not better off infertile. Infertility is a profoundly personal and traumatic thing. For many women, the idea of carrying a baby is a central part of their identity. It is how they define themselves as women. Your sister went into that surgery expecting to be told when she came out that she would be able to have kids. Instead her hopes were dashed very suddenly and she is now coming to terms with how this change makes her feel about herself as a woman. She needed you to be the shoulder she leaned on, to say “that really sucks” and grieve with her.", "YTA. I don’t want kids. I’ve never wanted kids. I don’t even disagree with the sentiments you expressed. But why, for the love of all things holy, did you decide to say those things to someone DEVASTATED AT NOT BEING ABLE TO HAVE KIDS? Some people want them, and your sister clearly did. Instead of being compassionate you totally invalidated her. I sincerely hope you learn from this.", "Ummm YTA Big time. As someone who struggled with infertility, I would have hit you… probably more than once!", "nah you tried to make the best out of a bad situation its not your fault", "She is grieving for the children she will never have and you try to get her to look on the bright side? YTA", "PREACH. YTA", "Unfortunately, yeah, a lot of people would.", "For all of this, YTA.", "Yes, this! YTA\n\nPLUS you are downplaying a chronic disease your sister has - endometriosis. FYI the “simple surgery” you mention left me off work for 7 weeks. Not to even get into that there is NO cure for endometriosis, it’s not an easy fix like you are making it out to be. Often it is repeated surgeries - repeated excisions and ablations - all the while being in unbearable pain. And each one of those surgeries comes with risks, particularly when it’s your third or fourth or fifth… oh and then the recovery time, physically, mentally and financially, can be incredibly taxing. YTA x 1000", "The only people the example comments would 'help' are people with a very, very, very very DARK sense of humor.\n\nYTA op", "Agreed, OP, you’re a massive AH.", "As a young widow, I can tell you people will ABSOLUTELY say \"it's ok you can find someone else.\" It's barely been three months since I lost him and I've lost count of how many people have told me \"at least you're young and can move on\"", "All of this!!!", "Take my poor award 🏆.\n\nThis.  My vote is also YTA.  She is allowed to grieve.  This is a huge loss-- of a choice, if nothing else.", "Wow, I’m so sorry for what you went through. One has to undergo infertility to comprehend the sadness. I always remember my OB GYN who said that during his residency the main hospital was flanked on one side with the oncology building and in the other the fertility clinic. Without exception the infertility patients were always more depressed and miserable than the cancer patients. \n\nSending you internet warmth.", "If this is the kind of support OP offers, it would be best to avoid her sister entirely.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", ">With a wild smile on her face,\n\nHer face?  I figured OP was a man.  They didn't say either way, only that the sister was 31 F.", "Exactly! This was said way too many times when I lost a child due to ectopic pregnancy, and I still get angry after 8 years. NEVER, EVER SAY THAT!", "I go through this! I’ve had ME/CFS for almost 20 years, and it’s been extremely hard. I still get people saying shit like, “it must be so nice sleeping in! I wish I could nap anytime I wanted! Must be nice to not have to work!” Why yes, I did love giving up on my dreams and facing financial hardship due to being unable to work. OP is one of those people, apparently", "and preferably mean it", "\"Well you don't have to start a college savings account and start planning that Hawain vacation\" while giving 2 thumbs up", "What exactly isn’t true about what was said? Those seem to be coming from a positive place", "I think it's different if you're the one bright siding your own situation. I think that's actually a healthy coping mechanism.   \n\n\nIt's volunteering bright sides to someone that never asked for them that comes across as invalidating what they're going through", "Why are you invalidating how their infertility makes them feel? You're as bad as OP was to their sister.", "[removed]", "\"God never closes a door without opening a window.\" \n\n\"Great. Time to go find the window so I can push you out of it, you asshole.\"", "But God never gives you more than you can handle.🤌🏾🙄", "I think I used to say this more because I felt like my body had failed me. Every single month. And at the time it seemed like everyone was getting pregnant really easily. In the media, some new celebrity was posting they were pregnant or their newborn pictures. I knew people who were getting pregnant on birth control. There was less people raising awareness at the time and I didn't see as many people post on social media compared to now so it was a very isolating experience. So I didn't say it because I felt like I had a duty to give my husband children, nor was it my only role in life to be a mother as I was very career driven. I had chosen a career that felt like my vocation in life and that was my identity.\nIt was more like why is everyone falling pregnant around me so easily? why is my body not able to? Am I not worthy of being a mum? It did made me feel like less of a woman because I had all the right parts to have a baby and we had a diagnosis of unexplained infertility so there was no explainable reason we couldn't have one. But still every month my period came and I felt like a failure. \nEven trying for my second child through IVF, my friends were trying at the same time and all fell pregnant with a couple of months and had had their babies by the time the IVF had worked for us. I still felt 'less' somehow but not as strongly as when I didn't have any children. \nSo for me, I think it came from a place of grief mainly.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Agent Pleakley. Also the same alien who wanted to conserve the mosquito population.", "How did you keep your composure?\n\nThe other one that pisses me off is when someone dies you hear, “They are with God now.  They are better off.”", "I’m so sorry for your losses. This person is proof positive that people should absolutely think before they open their mouths.", "I’m so sorry for your losses. It’s brave of you to be sharing now. Sending hugs.", "John Green has a great anecdote about learning how to help grieving people that ends with \"Don't just do something, stand there!\" Point being that when we do things to try and make it better it's often more for our sake than theirs. Often what they need is literally someone to sit with them and hold their hand while they cry.", "Oh god, that is horrible.  I am so sorry that was said to you.", "That’s hard. Thank you for helping me understand with your thoughtful response. Your thoughtfulness is a light in this world.", "Yeah lol, do these people not know what regert is?", "I was widowed at 24 with an infant in my arms while pregnant. \n'It was his time'\n'God has a plan'\n\nWell, God's a dick then, and people desperately need to shut the fuck up", "This is so true. My friend lost her husband of 40 years to cancer. Someone told her “I know just how you feel. My cat died last week.”", "The better place is the worst.  What better place is there than being with family?\n\nI am sorry for your loss.", "Ugh I had cancer on my spine as an infant and obviously lots of medical trauma growing up and still do. The shit people said to me and my parents. I've always said I can handle the disability. What's hard is how people treat me because of it.", "A quote from my own mother\n\n“At least you won’t end up like your younger sister, her kids ruined her life!”", "Gawd me too. Here, have my bipolar disorder. Maybe you can rule the world in reality , as opposed to only in your own head.\n\nI seriously started hating Kelly Clarkson when she resurrected that piece of claptrap for a new generation.", "To be fair saying now you don't have to buy shoes to an amputee may be exactly the right kind of dark humor to help normalize the situation a little.", "This was all that truly needed to be said. Well done. On that note, YTA, OP.", "YTA 💯", "OP may not have made the best choice in their attempt to make their sister feel better, but it does seem to me that OP was genuinely just trying to help. \n\nYou are right that the “bright-side” thing may not be helpful to a griever (then again, everyone is different and maybe it is helpful, or just the fact that someone is trying to make you feel better could be helpful in its own way) but either way, I don’t think OP is an asshole for not handling the situation with the tact of a professional psychologist. \n\nIf anything, you are an asshole for the way you are communicating towards OP. You also equated the situation to drastically different and extreme situations (comparing infertility to the death of a spouse?), and are berating someone who seems to genuinely just want to help their sister. \n\nOP: NTA\nU/Basic_Bichette: YTA.", "> are you unaware of how to properly interact with other ppl", "I’m so confused why so many of these YTA comments are getting downvotes of any kind. This one seems extremely cut and dry to me.", "I’m sorry you got any downvotes on this. My best friend is fighting through secondary infertility right now and it’s so painful to even watch her go through, I cannot imagine being the one experiencing it.", "Fuck off.", "Your post title literally asks about ‘telling my sister she is better off being infertile’. \n\nDon’t to come to AITA asking a question and then play dumb when you’re getting hundreds of comments not only telling you you’re TA but explaining why. I’d say owe your sister a big apology but if I was her I wouldn’t want to hear from you at all right now.", "Get the hell out with this toxic positivity stuff.\n\nThere is no different perspective here. She well wanted children, and she'll never be able to have her own, and she's grieving that.\n\nFor her, the pros of having children outweighed the cons and was something she was willing to take on. That's not something you should be trying to change her mind on.", "This sounds like a coping mechanisms. In order to not get insulted/ called lazy because people are ignorant you beat them to it, so they can't say anything stupid to you.\n\nReminds me if Tyrion Lannister from Game of Thrones.\n\n> Never forget what you are, for surely the world will not. Make it your strength. Then it can never be your weakness. Armour yourself in it, and it will never be used to hurt you. \n\nNot the worst way to cope with ignorant/ableist people though I guess. It would be different though if you want to vent about the chronic pain to a friend/ family member and they'd say \"ha come on... at least you can park right infront of the shop\" to you as if it's a special perk or a great privilege, not common sense or your right in an attempt to make the world a bit more equally accessible for everyone.", "Omg, don’t you wish those type of people could have it for just one day and see how they feel when they literally don’t have the energy to click the next page on a Kindle?\n\nMy male doctor, who told me for twenty years it was all in my head , got it and had to retire and sell his practice.\n\nIn all honesty, my first thought was ‘Yes!’", "Yeah, totally different. I have serious health problems and am a \"bright side\" person FOR MYSELF. But I would never invalidate someone else's feelings about their situation, and it ticks me right off when somebody invalidates my feelings. I'm the first one to tell you I'm lucky (my health is terrible, but somehow I keep surviving), but one time a hospital tech told me I was lucky and it was all I could do not to rip her head off.", "I agree with you. In the moment of wanting children and not being able to have them, it probably feels like a disability and the grief makes perfect sense. But I’ve known people who found out they were infertile, grieved, and then lived exciting child free lives — at some point they adjusted and didn’t feel the loss anymore. I wanted kids when I was younger, it never happened, and now it’s too late… and I feel great about how that worked out. It’s possible to adjust to being child free and actually love it and thrive even if it’s not the path you chose.\n\nBut OP couldn’t expect her sister to go there in one conversation. It will take years. In the moment it did probably feel to her sister that her legs had been chopped off. She has to re-conceptualize her life and that takes time.", "I am questioning a single aspect of their feelings, not invalidating. I am not insulting this person or talking down to her. I am not disregarding anything she has said. I simply would like to know where this feeling comes from because it is personally insulting to me.", "The denial of OP", "Well it's not your feeling to be insulted by is it? They feel like less of a woman due to this, and you do not. There is nothing wrong with having different thoughts and feelings than you. Everyone has different feelings and experiences and values. So carry on and let them feel how they feel with out requiring explanation.", "OMG yes people were so terrible after my child was stillborn", "This conversation doesn't have anything to do with you. If they would like to not answer then they aren't required to even respond to me. I'm not speaking with you.", "YTA\nYour “helping” was awful and insensitive", "YTA: sure, children aren't all sunshine and roses, but it's what she wanted. She had her choice stripped from her.", "NTA wanting a kid to \"give the gift of a child\" is one of the most f* up reason I've ever heard, motherhood isn't right in her head", "Now you get to have a dog you can bring in a restaurant!", "Except OP sister is not blind\n\nWould you call men blind because they can't have kids ?", "It's been 4 years, she's not in the early stages", "No time would ever heal this one for me. She would be cut out forever.", "Sorry all. I did mean that it was OK for me to point out. Should've been a little bit more clear.", "Probably because you're (presumably) not an amputee and don't actually have to deal with that reality the way you do with infertility.", "Are you also missing your legs? Because if not you’re just saying “somehow I find the comment about someone in a situation I’ve never experienced funny, but the one about someone in a situation similar to mine offensive.”\n\nThe shoe comment can be funny if it’s said by the person affected and also probably years after the fact when they’ve gotten used to living with their new normal. Not as they’re waiting for stitches to heal and are trying to figure out how to return to their 3rd floor walk up.", "It’s also insulting because you’re cutting off any indication of being able to mother something or be caring in that way.  Adoption exists, so it isn’t exactly a closed shut door.", "Maternity leave without that pesky baby to take care of! \n/s", "”At least the birth was easier then having to go full term”. Heard from people when my son was born premature and passed soon after birth.", "That is particularly awful thing to say to someone, because now God is allowing horrible things in one's life and they should feel somehow grateful about it.  UGH.\n\nI worked in health care as a medical social worker and I saw, on a regular basis, life circumstances and events completely overwhelm people emotionally and physically.  And not just temporarily, but utter devastation, that takes a LONG TIME to recover, IF they ever do.\n\nI'm agnostic, but I can't understand how that saying helps anybody feel comforted by the divine or able to fully put their trust in that God that supposedly allowed all the trauma and tragedy into their lives.", "Not op but I didn’t, I told people off for their comments and like a friend saying at least you already know you can get pregnant. Like what good is that if your baby dies every time. People are so ridiculous", "I don't. I gave my last fuck for appearances and social niceties the day my young daughter was diagnosed with terminal cancer. \n\nI finally told my MIL when she came in trying to tell me.what she thought my daughter wanted to kindly fuck off, I've been the one caring for her 24/7 not just through her cancer battle but her whole fucking life, don't waltz into my house and pretend you know better than I do what she needs. \n\nWhen people say insensitive shit about my daughter's cancer I let them know that was insensitive.\n\nWhen people ask me how I'm doing expecting me to say 'fine, you?' I say 'shitty, I'm in a living nightmare I can't wake up from'.  \n\nPeople really ought to stop talking when the truth makes them so uncomfortable.", "I feel that so hard right now.  My daughter has terminal brain cancer and is in palliative care. I kind of don't want to hear how strong I am or how good a mother I am.  Like wtf else would you expect me to do? Abandon my child? I just don't want to have to say 'I'm just doing what needs to be done for her' anymore.  I kind of wish someone would just come and say fuck cancer,  fuck this stupid brain tumor, this is all fucking bullshit.", "I have one friend who knows what the fuck to do and how do support a friend right.  My daughter is in palliative care at home with terminal cancer.  This friend comes over and always brings me food and I'll hear her rummaging about in the kitchen and realize she's just emptied and loaded my dishwasher and put all the dishes away and washed the counter. She didn't ask me every 2 seconds which cupboard each dish fits into,  she opened them and figured it out herself.  She's hands down the best support person ever and it's things like that that is struggling or grieving need.", "Are you my mom? I was 14 months old and my sister was 12 days away from being born when my mom was widowed. I can't even imagine the shit people said to her in the aftermath. It fucked her up for the rest of her life.", "Oh my God. I'm sorry, I'd probably start just cracking up at that. Seriously? I mean i get they're trying to be empathetic, but really? \n\nWe really ought to teach this in school. Not a full course, but maybe a class in the auditorium one day. Things to NOT say while someone is grieving. Cuz we really are awful at this. \n\nWhen the last ve of my life was killed, i was....yeah, \"fortunate\" is a fine word....to be active duty myself. We'd already deployed, we'd already lost our friends and loved ones, so no one around me said the dumb stuff.", "A friend said the same to me after my Mum and Sister both died. I could have swung her dead cat at her head and knocked her stupid ass out.", "Sorry to hear that. I had a stillborn last year and I want to believe our family members had good intentions but the things they said makes me think otherwise. We were completely isolated during our grief and were only invited to family events/parties. It sucked.", "No ragrets", ">Like wtf else would you expect me to do? Abandon my child? \n\nHonestly, yes, that is what they expect because it's what *they* would do.", "Fuck Cancer sideways with a fork!\nI'm so sorry for what you are enduring - please find a good support group or therapist when you are able to.", "Nope. Ages don't match, and my rapscallion daughters best not be on Reddit yet. \n\nMy girls are 13&14.\n\nThough, yeah. This will inevitably fuck me up for life.", "A friend of mine in college lost her fiance to a freak road accident - the police came to get me because I was closer than her parents... I'll never forget that heartbreak on someone's face. All I could do was hold on to her.\nI hope with time you find your grief lessens. \nNo one tells you it can take 7 years to grieve a loss. We're lucky if jobs give us a week off work. \nNo one is back to normal in weeks.... Ever. Nor months.", "I am definitely a fair bit older than 14, haha.\n\nSeriously, though, I hope you've had all the support and help you could ever want, and that your girls grow up amazing.", "I'm sorry, and I send her my love. \n\nMy plan, when I found out, was to go drink myself into oblivion for three days, then throw myself into work. My Platoon Sgt ordered me to see the Chaplain first. Didn't wanna. Didn't want the BS platitudes. But it was a lawful order, so i followed it.\n\nChaplain said \"I heard you wanted to see me?\" And looked mildly pleased. I said \"No.\" And his face fell a bit (I still kinda feel like shit for that lol). I told him the live of my life had been KIA, and what i WANTED was to go pass my young twins to friends for three days while I drank heavily and cried in the shower, thank you, so if he could just send me on my way, I'd be much obliged. He said \"Oh. Oh, I'm sorry. That's awful. Well, I'd love to tell you it gets better. But it doesn't. That you get over it. You won't. This is something you just have to learn to live with. Keep putting one foot in front of the other. One day, while walking your path, you'll hear the birds and think they sound nice. A moment of happiness. And eventually, years down the road, your good days will probably outnumber the bad, and you'll be able to think of him and it will make you happy rather than cry. But it's never going to be okay again, this is going to be a scar you carry with you, and I'm sorry.\" \n\n19 years ago now. And I still toast him every year. And I will always thank Chaplain Causey for his honesty. He and I ended up being good friends the next deployment. He's a good man. I hope he has the life he deserves.", "They are doing okay. \nWe were a military family and it was an active duty loss, so there are programs in place for that. \n\nThank you for your well wishes"]}