{"id": 12597, "submission_id": "11uo403", "title": "AITA for feeling humiliated after by boyfriend said Im a trash can?", "selftext": "I (18F) was at my boyfriend’s (18M) stepdad birthday party with their family yesterday, I didnt know anyone and I have difficulty in talking to people I dont know, I am very anxious in situations like this and he knows it.\n\nSuddenly they decided to play a game and I didnt wanna participate bc if I got anything wrong Id be feeling dumb later. When I said I didnt wanna play he said in a rude way for me to just say something fast as if im bothering the rest of the people.\n\nA few minutes passed and he took some candy out of my plate and gave me the paper for me to throw away.\n\nThen I asked him why was he giving me that, his cousin said he probably thinks im a trash can, and my boyfriend completed “yes bc she is”.\n\nI was in shock when he said this to someone who doesnt even know me, I just felt humilliated by the person who should be by my side.\n\nHe got mad at me saying I cant take a joke and he obviously dont think Im a trash and he was just joking.\n\nI tried explaining that It doesnt matter and it made me feel bad but didnt work,he didnt even wanted to sleep w me this night \n\nMy mom said im exagerating.\n\nAita?", "created_utc": 1679145037, "permalink": "/r/AmItheAsshole/comments/11uo403/aita_for_feeling_humiliated_after_by_boyfriend/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for being to exagerated, maybe de I made a confusion over nothing\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA when people show you who they really are believe them.  A good partner would never have thought to say this.  You deserve to be treated with respect, this man does not sound like he is a kind person.", "Nta. Show him who is trash and dump him, there are better men out there.", "NTA, and it wasn't \"just a joke.\" You don't call your partner a \"trash can,\" especially to your family and in front of a room full of people. You deserve respect. It's literally the bare minimum.", "NTA\n\nLet's get serious about your BF though. It probably was a joke to him, but it doesn't make what he said appropriate. The larger issue is that when you explained how you felt, he didn't respect your feelings, and tried to punishment you for all of this?\n\nRed flags galore.", "Nta Break up with this guy. You don't like him or his family and he is rude. No reason to stay and feel humiliation, leave and find someone who you feel confident around.", "Sounds about 18. You are communicating like a young adult and he's stuck in a child mindset.", "Time to find yourself another boyfriend", "Your boyfriend is the asshole. Please leave him and find someone who will respect your boundaries and support you when you experience anxiety in social situations. You’ve got this.", "NTA.\n\nGet rid of this guy and find someone who will treat you with the respect you deserve.", "NTA\n\nTake your boyfriend to the dump.", "It wasn’t a joke.  He was angry at you, but hasn’t developed the emotional skills to handle that emotion - so it came out in that nasty comment to you.\n\nThen he was a liar and denied it, because again, he has never bothered to develop the emotional skills expected of a boy his age.\n\n“Sorry, I was angry about you not participating in the games, and I took that out on you. I shouldn’t have done that.”    - this is what you need to hear from him.\n\nNTA", "NTA\n\nYour boyfriend is very rude and you should dump his ass for not appreciating you. You deserve better.", "> he didnt even wanted to sleep w me this night\n\nOh good grief girl. Please have some self respect and DTMFA. \n\nYou deserve much better than this arsehole. NTA", "NTA\n\nDump your AH boyfriend ASAP.  If your boyfriend said something that even **remotely** came across that way, then said \"I'm joking\", dump him.\n\nThere's playful teasing and jokes, sure.  But when I've seen friends and partners tease and joke with each other **it's always totally obvious to both people that it's a joke.**  In this case, your AH boyfriend just likes to be mean and say \"It's a joke\" when he hurts your feelings.\n\nHis actions after the fact made clear he DGAF about your feelings.  He didn't apologize for hurting you, or try to make amends.  He just wanted to have sex with you, anyways.   \n Dump him.", "NTA-He is though...I don't see one thing he did right in this post.", "NTA\n\nbut you obviously have low self esteem issues. You should look into therapy.", "NTA\n\nThat's a weird and disrespectful joke to make about your partner, especially since its the first time you're meeting his family.\n\nJokes are meant to make everyone laugh. You found it disrespectful, and it hurt you. It was no longer a joke, to you it was an insult. He didn't even have the decency to back up and say \"Oh i didnt mean to hurt you. Sorry, i wont do it again.\" He instead told you to just take it, and then punished you for being hurt from his actions\n\nDo you want to be in a relationship like this? Is he always gonna make hurtful jokes and throw a fit when you get hurt?", "NTA, this was his spontaneous, first reaction to that comment, You just learned what he really thinks of you. He's the AH+++++", "NTA. Please dump him. He doesn’t respect you nor does he really care about you. If he did, he wouldn’t have dismissed your feelings so nonchalantly. \n\nYou’re not a trash can! Be the wonderful person that you are! Someone out there will see it and treat you so much better! \n\nDefinitely recommend therapy to work on your self esteem! Know your worth! :)", "That wasn't a joke. Don't give him one more minute of your time. Someone that loves and cares about you will not make you the butt of a backhanded \"joke\".", "NTA- He is the trash and you need to put him out on the kerb by next collection day.", "NTA. \nThis boyfriend is very bad for you. I’m thinking maybe you should not be in any relationship. Sounds like you have some major self-esteem issues. Maybe consider therapy.", "That would be the last thing he said to me.  NTA.", "NTA. This is verbal abuse and should not be tolerated. What he said about you when you weren’t around is an honest expression of how he really feels. Tell him you’re tired of taking out the trash and dump him.", "NTA that’s not a joke meant for YOU to laugh at, it’s at your expense and insulting, and it’s meant that way. Dump him.", "NTA. He is just going to get worse. And your mother's response tells us how you got to the point where you would accept this behavior", "It sounds like this party has brought into focus for you that you don't feel like your boyfriend respects you enough. \n\nThat is a poor foundation for a relationship.", "nta if you don’t like those kinds of jokes he should aknowledge, apologize, and move on", "He sounds like trash! Does he make you happy?", "NTA.\n\nAnd you are not reacting enough.\n\n1. He called you a trash can\n\nBut the bigger issue\n\n2. You were scared to play a game for the fear being thought of as dumb. He got you that point in the relationship. Like not comfortable enough around him to play a stupid game.\n\nHe is toxic and a red flag.", "Btw his cousin is 10-12 so I believe he didnt really know what he as saying", "You must be a trash can since you let your bf inside you all the time. Please throw out the trash NTA", "Your mom knows you better than we do. You are nervous around new people and worry about making mistakes. You might be overreacting to a bit of thoughtless teasing.\n\nNTA, though. BF should have just apologized.", "NTA. I’d say dump him but the real problem is that you’re both so young and immature so I suppose there’s a chance he could eventually develop into a better person and you might develop self esteem", "Info: Did they take the candy from your plate, unwrap it, and return the garbage to your plate?\n\nSeems like a poor joke didn't land well and you took offense to it. If you really think this is something to break up over go ahead. I'm assuming you were not talking much and being somewhat awkward. Maybe the cousin tried to get you involved in some way and you didn't like the way. Some families are more prone to tease and straight up insult each other. If you don't like that make it clear why it was upsetting to your bf. \n\nThis is a great opportunity to learn about how you are in relationships! Can you effectively communicate your issues with your bf and maybe come to a healthy conclusion?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (18F) was at my boyfriend’s (18M) stepdad birthday party with their family yesterday, I didnt know anyone and I have difficulty in talking to people I dont know, I am very anxious in situations like this and he knows it.\n\nSuddenly they decided to play a game and I didnt wanna participate bc if I got anything wrong Id be feeling dumb later. When I said I didnt wanna play he said in a rude way for me to just say something fast as if im bothering the rest of the people.\n\nA few minutes passed and he took some candy out of my plate and gave me the paper for me to throw away.\n\nThen I asked him why was he giving me that, his cousin said he probably thinks im a trash can, and my boyfriend completed “yes bc she is”.\n\nI was in shock when he said this to someone who doesnt even know me, I just felt humilliated by the person who should be by my side.\n\nHe got mad at me saying I cant take a joke and he obviously dont think Im a trash and he was just joking.\n\nI tried explaining that It doesnt matter and it made me feel bad but didnt work,he didnt even wanted to sleep w me this night \n\nMy mom said im exagerating.\n\nAita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA he doesn't care about your feelings and gaslighting you. I mean, the way the cousin speaks and you being quiet and not wanting to engage in games and then being rude to you...you don't feel comfortable around them (and him).", "NTA- That is nowhere near an appropriate “joke”.", "Rude bunch of clowns. NTA. Even for 18 year olds.", "Your BF did though.\n\nYou are NTA, and you deserve better.", "Doesn't matter, he shouldn't have encouraged his cousin. And even if it was a joke, when you got hurt, he should have apologized", "No, he just handed it to me.\n\nAnd I believe I can come to healthy conclusions, the problem yesterday was that when I tried telling him how I felt he just got mad at me, I explained everything I felt but did not work, he just tried to blame me or wathever and I was the one who had to go after him", "Wait, so because she was being “somewhat awkward” it’s cool for his cousin to call her a trash can and then her BOYFRIEND to agree with it? You don’t even know how she voiced her humiliation or if she did at all. Based on the story, it sounds like she made an appalled face (understandably so) and then boyfriend blamed her for “not being able to take a joke”. Your girlfriend, wife, etc isn’t your punchline for a stupid, baseless joke, she’s a human. Get over your machismo bullshit and don’t humiliate people, it’s not hard", "This is what a good partner does. I said it in a different thread a couple days ago, but in a healthy relationship, it doesn't matter if you personally don't find an issue with something. If it's an issue for your partner, it's an issue for your relationship. Relationships are a partnership; issues and disagreements should be approached as the couple v the issue, not one partner against the other nor one partner against the issue on their own. He refuses to do this, and then takes it further by giving the silent treatment, which is inappropriate in a relationship, especially done by the person who did wrong in the situation. He just sounds *mean* and like he doesn't want to own up to his meanness", "I would say maybe try and bring it up one more time when stuff has cooled a bit more and really try to get them to understand your feelings in the moment. If they still continue to not respect or listen to you or your feelings, do you want to continue being with someone who does that? \n\nFrom my pov this is something very small and could sooooooooo easily be worked out. CLEAR COMMUNICATION FIXES SO MUCH!! If he doesn't even want to attempt that, what's he really bringing to the table?", "Did you miss the part where I put I'm assuming? I'm making my conclusions on the post. I'm assuming she didn't voice much. You are assuming she made a face? She was being introduced to a brand new family dynamic. It wasn't going to be seamless and perfect", "I have come to the conclusion this is your boyfriends burner account", "She literally says she was in shock and then he got mad, who would assume someone in shock said something and left that detail out? You’re reaching because you are likely this type of guy who insults his partner like this, thinks it’s funny, and when someone gets offended by your stupid, baseless joke, you blame the person. Things don’t have to be seem less and perfect, but if basic decency should be a bare minimum requirement", "Wrong, she was in shock, can you tell me exactly what a shocked face looks like? Or does shock affect each person differently? Also he wasn't mad at her in the moment, it appears he got mad after when she tried to discuss it. People can tease and joke with each other in relationships. You need to understand the dynamics of said relationship. Obviously this girl doesn't like to be teased like that. I wonder if the bf knew this? I'm ASSUMING this family makes fun of each other in an endearing way. YOU DONT HAVE TO BE OKAY WITH THAT. \n\nI'm nothing like your idea of me either! I need to play devils advocate here because the first 12 comments are just telling this 18 year old person to dump and walk away. You can learn so much from relationships if you just try! Obviously this guy probably isn't worth the effort but for some reason IDK they are dating.", "You have never heard of a shocked face? 🤦‍♂️ Her story goes from “I was in shock” to immediately “he got mad at me”, which is really odd you would assume that there was some gap in time, conversation, etc. Truth of the matter is, her boyfriend sounds like an immature kid who doesn’t have concerns for her feelings based on the initial action and his later reaction to her communication, she’s just meeting his family so it’s likely not that deep yet, so why should she have to sit through verbal abuse while some kids grows and learns? How about since she is the same age she focuses on her own growth by learning how to separate herself from toxic people? But then again, that would benefit the female rather than excusing the male 🤷‍♂️"]}