{"id": 12614, "submission_id": "11uv84b", "title": "AITA for how I responded to my nephew’s girlfriend digging up a past grudge?", "selftext": "I’m still dumbfounded over this whole situation and I don’t know if I handled it correctly but here we are.\n\nMy nephew (31M) began dating Jessie (28F) close to a year ago. They had met each others’ families and the relationship was progressing smoothly. I even met her myself at a recent dinner, where the situation in question took place.\n\nMy nephew and Jessie show up, and introductions are made. Everything was fine until I introduced myself by first name. As soon as she heard my name, Jessie asked me, “wait are you [first name][nephew’s last name]?”\n\nI confirmed that that was my name and she then asked me if I used to teach at an elementary school the next state over, which I confirmed. It was then that I remembered Jessie as a student there. \n\nI don’t know what disabilities she ended up having, but I do remember that other teachers wanted to have Jessie put in special Ed, which her parents were resistant to, so they pulled her out and homeschooled her to avoid any diagnosis (she revealed the last bit to us later that night).\n\nI told her my nephew spoke highly of her professional accomplishments and that I was glad that things turned out well for her in the end. She scoffed at me and said I definitely didn’t help. I was confused and asked for clarification, since I don’t really remember any specific incident with Jessie.\n\nShe told me that I clearly don’t remember writing her up for “fucking nothing”. I didn’t, and admitted as much. She then angrily told me that she vividly remembered that I made her take a note home to her parents to have signed for talking back to me.\n\nShe then ended it with “I don’t even remember what was said anymore but I can tell you that I wasn’t talking back to you. I was asking you to explain what I did wrong and why it was wrong.”\n\nI apologized for the misunderstanding but Jessie wasn’t happy. She continued to make snide remarks about how the school couldn’t leave well enough alone about whatever issues she was having and caused irreparable damage to her life. \n\nI tried to apologize for any upset but she didn’t want it. I don’t know if I was wrong here or not. I know the school had all students’ best interests at heart and I don’t remember the back talking incident but Jessie seems convinced of it. AITA?", "created_utc": 1679162460, "permalink": "/r/AmItheAsshole/comments/11uv84b/aita_for_how_i_responded_to_my_nephews_girlfriend/", "score": 119, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an AH for how I handled the situation and saying I didn’t remember instead of just saying sorry and accepting that Jessie’s version of events happened\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. It sounds like you were disciplining a child who probably needed it and the child instead of accepting correction wanted to explain to you why you were wrong and why you were misunderstanding her. Emotionally well adjusted 28 year olds don't carry grudges about getting in trouble for talking back in elementary school. That's not a particularly serious infraction.", "NTA. Girlfriend sounds a wee bit unhinged to be bearing a grudge over a teacher's note for two decades.", "NTA, if you're speaking the truth. And you didn't even flip out. You kept apologizing for something which you \\*probably\\* didn't do. That makes you the bigger woman \n\n&#x200B;\n\n*^(Even if you're lying, it's very silly to hold a grudge anyway. I still don't think that the \"talking back\" thing should be an excuse to send a note.)*\n\n&#x200B;\n\n*Jessie seems like an asshole though*", "In life, we don't always realize how our words and actions can appear to others. So things we say innocently can be very hurtful to the person we are talking to. And miscommunication often is the \"fault\" of both parties.\n\nBut let's assume that she is completely right and you were 100% at fault: she made a perfectly innocent remark that you took it wildly out of context and scolded her for genuinely asking for help. So you punished her by... informing her parents? That's not an unreasonable punishment. And if her parents were decent, they would have listened to her side of the story, spoken to her about how she needs to be respectful of others, how others need to be respectful of her and possibly followed up with you if they agreed that you had been unfair.\n\nAt the end of the day, you didn't do it to be mean. You didn't continue to punish her for the rest of the school year. So the only thing you did wrong was the miscommunication, which you have now apologized for. I normally insist that--to be a true apology--one has to make restitution to the victim, but in this case, that would be simply telling her parents that you apparently made a mistake and shouldn't have sent home a note. Since she is no longer a child living at home with her parents, that isn't *necessary*, but since she's still upset, you could offer it...but beyond that, there's really nothing more you can do.\n\nIf she has further grievances with you (with *you* specifically, not with the school overall), she should tell you. \n\nBut while she has no obligation to accept your apology, that doesn't give her license to be rude to you now. So regardless of who was that fault for the original conflict, you are NTA now.", "NTA. You apologized for it and did the best you could with what you knew. It was on her parents for not taking diagnostics seriously when that could’ve helped build a better relationship between her and the school.", "INFO: Your question is about how you responded, but the only thing I see here is you being honest and apologetic. What about your response could potentially make you an AH?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m still dumbfounded over this whole situation and I don’t know if I handled it correctly but here we are.\n\nMy nephew (31M) began dating Jessie (28F) close to a year ago. They had met each others’ families and the relationship was progressing smoothly. I even met her myself at a recent dinner, where the situation in question took place.\n\nMy nephew and Jessie show up, and introductions are made. Everything was fine until I introduced myself by first name. As soon as she heard my name, Jessie asked me, “wait are you [first name][nephew’s last name]?”\n\nI confirmed that that was my name and she then asked me if I used to teach at an elementary school the next state over, which I confirmed. It was then that I remembered Jessie as a student there. \n\nI don’t know what disabilities she ended up having, but I do remember that other teachers wanted to have Jessie put in special Ed, which her parents were resistant to, so they pulled her out and homeschooled her to avoid any diagnosis (she revealed the last bit to us later that night).\n\nI told her my nephew spoke highly of her professional accomplishments and that I was glad that things turned out well for her in the end. She scoffed at me and said I definitely didn’t help. I was confused and asked for clarification, since I don’t really remember any specific incident with Jessie.\n\nShe told me that I clearly don’t remember writing her up for “fucking nothing”. I didn’t, and admitted as much. She then angrily told me that she vividly remembered that I made her take a note home to her parents to have signed for talking back to me.\n\nShe then ended it with “I don’t even remember what was said anymore but I can tell you that I wasn’t talking back to you. I was asking you to explain what I did wrong and why it was wrong.”\n\nI apologized for the misunderstanding but Jessie wasn’t happy. She continued to make snide remarks about how the school couldn’t leave well enough alone about whatever issues she was having and caused irreparable damage to her life. \n\nI tried to apologize for any upset but she didn’t want it. I don’t know if I was wrong here or not. I know the school had all students’ best interests at heart and I don’t remember the back talking incident but Jessie seems convinced of it. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Unless you regular wrote kids up for “fucking nothing” than chances are she was acting up and still hasn’t gained the maturity to realize she wasn’t some poor out upon victim for being reasonably disciplined when she did so.", "ESH, I think. I will say that unfair situations concerning childhood teachers can have a lasting impact on someone’s outcome in life/education and she feels bitter and simply hasn’t forgotten it. She probably just needs time to sit with the realization, but I also don’t think she handled it in the most mature way. I would offer some grace, because she probably feels that the hand she was dealt screwed up parts of her life in the long term (ie what she said, irreparable damage).", "NTA Tell Jessie to get over it and get it in her head that whatever happened didn't involve you. While you're at it tell her to grow up.", "ESH. The situation could've played out way better and in a more mature way (especially on her side). But I think you suck because you're seem quick to forget your wrongdoing, while remembering what everyone else thought of her when she was still at school.\n\nYou were standing up for yourself, but I understand why she is upset. Some teachers are mean, and they don't really care if their opinions are overly harsh or not at all based on facts, thereby destroying children's self-confidence. \n\nYes, I understand some children do need special education, but not all do (even if they need special education... they could have gone through trauma, or have depression etc. which ultimately leads to poor performance at school).", "[deleted]", "No way did a single note lead to homeschooling. Sounds like her parents were problematic.", "I am a woman!", "100% this! So well-worded. \n\nThis conflict reminded me of an example with my brother when he was little. He got bullied in early grade school a lot. One time he decided to retaliate and hit the kid back to get them to stop. The teacher thought **he** was bullying the **bully**, and called parents in for a discussion. My brother said he was defending himself, but our mom agreed with the teacher and grounded my brother for a while, &the other kid didn't get in trouble at all. He still got upset about it years later because as much as he tried to explain, our mom didnt believe him. He used to get mad at the teacher too, but realized at some point it was misdirected anger at our mom. He finally talked it out with her, but it ate at him for a while.\n\nThere's no way to say what truly happened in Ops post because it's so long ago, but it even may be that she's angry at how her parents acted after being told by the teacher, or frustrated at a perceived injustice, regardless of what actually happened. If you don't let things go, they can fester and actually grow bigger, so you blow them up to have more of an impact than they did, or act more angrily than you would otherwise. Op's conscientious apology was the right response, and there's not much else to be done for an event that she does not remember. It's up to the gf to take the apology from op and let the issue go, or continue to let it eat at her.", "Looks like she dug up more than just a grudge, she also found the excuse she was looking for.", "The way that Jessie was still upset throughout. I know young people these days are big on apologies and accountability. I also know how problematic the older generation can be and wasn’t sure if I was displaying any of those problematic behaviors the younger generations seem to have with us", "This incident literally had nothing to do with special education classes, though? Or being a pushover? Did you read the post, at all? The girl's accusing op of a disciplinary write up, from several years ago. And decided attacking her about it, at a family dinner, would be a good idea. NTA op", "She told us she was diagnosed with Autism and ADHD and that tracks given some of her behaviors back then and from how she behaved that night", "I disagree. How can you be a person when you hold grudges for so long?", "Or OP treated her like they would any other misbehaving child.", "So true. When someone says something mean, they forget about what they said fairly quickly, but the person on the receiving end of the comment may never forget it and always carry it with them.", "thanks", "Chances are she was talking back and just remembers things differently as kids often do. Perhaps she should take accountability for that.", "People can have ADHD and/or autism and still be high functioning. It's a real struggle if you have these diagnoses because people aren't supportive. And having these diagnoses doesn't always mean you need special education.", "You are a person whether you hold grudges or not...? Some people have a really hard time letting go of situations that happened that negatively affected their self-esteem.", "That's called a grudge", "I can't really relate to disabled people, so I can't speak any further. I might just be naive", "In many cases, harboring resentment (or grudges) happens when a person has the need to gain compassion or understanding they were not granted in the past.", "You ‘can’t really relate to disabled people’?? The hell is wrong with you", "She probably had to get disciplined for her behavior. She might just be causing a lot of trouble in the class", "Maybe. OP did say she has ADHD and autism. But maybe it was undiagnosed back then, leading to everyone thinking she's stupid or something, when in reality, she just needed some compassion and help.", "Or she was doing things you often see in girls with undiagnosed ADHD like talking when they shouldn’t in class, having impulsivity issues that lead to them talking back, etc. That’s far more likely than her getting a note home because people thought she was dumb.", "NTA, Jessie still has issues and was inappropriate going on and on with her ridiculous grudge. It sounds like you had good reason to write her up. Too bad you couldn't write her up for her obnoxious behavior as an adult.", "Look, *teachers* may have students best interests at heart, but schools don’t. \n\nThere’s bleed over from that, too. Something was up with this child. She was neurodivergent in some way. Based on the fact that she’s a female, I’d be willing to bet ADHD, ASD, or dyslexia- you have NO idea the biases females face when getting dx. \n\nShe OBVIOUSLY didn’t need special Ed classes and the parents pulling her to homeschool was NOT the problem. Her current success speaks to that. I had to do the same exact thing about 15 years ago in order to get my now 19 year old the help she needed. \n\nThe fact that the parents couldn’t get the school to listen, the fact that she wasn’t getting proper support, the fact that she wasn’t properly dx means that YOU took her actions as misbehavior and punished her for something she wasn’t actually doing. \n\nYour school didn’t have her best interests at heart and their failure of her colored how you interacted with and treated her. \n\nYou and your school and everyone’s “best interests” traumatized that child and irreparably harmed her. That’s something that someone needs to take responsibility for but never will. She will never be validated for what she was put through as an innocent child. \n\nYou did the best you could with the info you had but it still wasn’t good enough. I would think long and hard on that. \n\nThere’s SO MUCH wrong with educational systems the world over and neither you nor I can fix it. But that doesn’t mean that you weren’t a cog in the wheel that abused her. NEVER should you blindly support the US Educational System, especially in the face of someone very real telling you how it hurt them. \n\nNAH- but she’s not wrong. You hurt her. You didn’t do it on purpose but you did.", "haha NTA. I have lingering beef with my kindergarten teacher — another kid in my class tried to SNATCH the glasses off my face so I instinctively hit him. I was bullied a lot and didn’t want to get my expensive glasses ripped off my face and thrown on the ground. My teacher ONLY punished me and made me sit in the back of the classroom for a whole week. I have not forgotten… but if I somehow ended up dating her family member I would not try to fight with her about it? It was literally 20 years ago. Like, I think I’m totally in the right, yet I would absolutely get over it in time for family dinner ya know", "NTA now. Maybe you were an AH back then for being somewhat condescending or overly strict with Jessie. But JFC, it was in ELEMENTARY school and she's still holding a grudge?? What a petty idiot.", "NTA but what a weird way for her to show she's still mentally a toddler.  I've run into my old bully from elementary school and the conversation ended with both of us laughing about how stupid we both were back then. Why? Because we're not in second grade anymore and we don't need to keep acting like we are.", "> So you punished her by... informing her parents? That's not an unreasonable punishment. And if her parents were decent, they would have listened to her side of the story, spoken to her about how she needs to be respectful of others, how others need to be respectful of her and possibly followed up with you if they agreed that you had been unfair.\n\nExactly. Having parents sign a note informing them of their elementary student talking back should be such a non-issue. To hold that much anger over something like that this many years later is unhinged, imo. If her parents had a disproportionate reaction to it, that's entirely on them. It's understandable to be a little upset over a teacher making a mistake like that and unnecessarily getting you in trouble, but to be as angey as she is is just ridiculous.", "Editing your comment without acknowledging the edit or that you were wrong makes you just about as mature as the antagonist in this post. But do you...", "Some kindergarten teachers are the worst. Mine hated me because I didn’t go to kindergarten round up. I had the flu and was running a fever and puking. I highly doubt the other parents would have been happy I was there but apparently she was insistent I come because it was important. She constantly yelled at me for being “hyper” when I was acting like the other kids and refused to let me get a band-aide when I got a nasty paper cut that was bleeding a lot because “it didn’t need one”. The paper towel I used as a band-aide had quite a bit of blood on it. Also the nurses office was right next to the classroom so….", "She sounds problematic. I'm guessing the homeschooling made her who she is today; with absolutely no resources or help, for whatever her problem was.", "some behavior by teachers is soooooooo overboard and unkind!!! I truly don’t understand it. everyone has bad days, but when it becomes a pattern it’s time to get a new job. like, you actually do not need to be out here bullying little kids lol"]}