{"id": 12720, "submission_id": "11w0syx", "title": "AITA for not letting my daughter move in with me?", "selftext": "I (49M) have two daughters one (20F) and (17F).Their mother and I are divorced and we do not live in the same state.My oldest daughter currently goes to a private university  near her mom which is mostly paid by scholarships and her mom pays the difference.While my youngest daughter was looking at schools during her junior year she fell in love with a school that is practically in my backyard. She called and asked if she could spend her Senior year with me and my wife in order to have in state tuition.For context my wife and I live in a two bedroom condo and one room is an office for my wife that she does not use as much because she has several back problems and prefers to work from her chair.We also have two dogs so it’s a small space. I told her I would talk to her stepmom about this proposition and get back to her.A week or so later she calls me and asks if we have made a decision on the matter and I said we do not have enough space and we think you would not have a good time here and would miss your mom too much.My daughter has now made a collage decision,she is going to a college that is across the country from me. I am concerned that she will be so far from me and her mom. Am I the Asshole?", "created_utc": 1679267185, "permalink": "/r/AmItheAsshole/comments/11w0syx/aita_for_not_letting_my_daughter_move_in_with_me/", "score": 399, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Should I have let my daughter move in with me so we would not have to pay as much.I complain a lot that college is so expensive and I kind of rejected her and now she is moving across the country to go to college.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. \n\nShe’s going across the country from you because you made it clear you didn’t want her around. \n\nThis is likely a moment that will define your relationship with her for the rest of your lives.", "YTA.  Your daughter is responsibly working on a plan to attend her first choice college and graduate with as little debt as possible.  You told her no because you have dogs.", "YTA. You have made it clear to your daughter that you don’t have room for her in your life and won’t make room for her in your life so don’t be shocked when she matches that energy.", "YTA\n\nYou could have literally had her in your home but shot her down. Now you are upset she's going across the country. \n\nYou can't crap in the room and complain it stinks....this is your fault.", "Can't wait for in a few years when you post \"Why won't my daughter talk to me anymore?\" YTA.", "YTA. You ghosted your daughter instead of calling her right away and are now unhappy that she chose a different school far away from you. And honestly you can't tell your daughter what she will feel or not as if she thinks she can be away from her mom then she most likely can. I hope she has a good time at college and stays safe.", "YTA thats your daughter and you don't want her to stay with you. Now you're worried she will be far away. You shouldn't be worried at all b/c she won't be in your place.", " YTA for not helping set up your daughter for success and doing what you can to ensure that she is financially able to go to her dream school.", "Well, your rationale seems really weak in that you do have the space with minimal inconvenience. The issue is more that you really don’t want to change your lifestyle to accommodate your own daughter. \n\nSo, congrats. You just lost your daughter. But you didn’t really want her anyway, so no biggie there. AND - most importantly - you get to keep your unused office! Yeah! Oh joy! We have a winner!!", "YTA she and her sister were raised by her mother and all she asked was to stay with you for one year so she could afford college. One year. And you can't be bothered with her? I don't think she can get far enough away from you now, good job!", "YTA \nShe's your daughter. If you don't have enough space, you could have gotten a place for her. You don't seem to be paying tuition, so that would be a fair thing to do. Also \"lack of space\" is a shitty excuse to give your own daughter. I understand why she's hurt.", "YTA and you blew the opportunity of a lifetime to spend a year with your daughter to help her achieve her goals.", "YTA for sponging off your exes unpaid labor to raise your kids, and when it was finally your turn to help, you rebuffed the opportunity because it barely inconvenienced your life.", "YTA. If you wanted her to go to college near  you, you should have let her live with you.", "It sounds like you said no based on space.. but the office it not used that much. So its doesn't sound like a really good reason to turn her away. Daughters need their dads as much as their moms too BTW.\n\nYTA.", "Yup. You are TA. You should have made room. You only have your kids as kids for a short period of time. You just cost yourself time with her that would have been precious. Congratulations.", "YTA. At the very least, you should have invited her to spend a couple weeks to see if it would work. But frankly, I can't even imagine saying no to my own child in this situation. The fact that you all wouldn't even consider it or try it out makes me wonder if your daughters ever spend any significant amount of time with you.", "YTA\n\nand your hypothesis is partially correct. YOU WILL NEVER SEE HER…her mother will still see her.\n\nYou are just another crappy father who abandons their child. \n\nAlso YOU DO HAVE ROOM. If I can live in a shoebox with two adults and two dogs, you can as well. So many people do it. You just wanted to be a shit father. Own it.", "So you have an extra room you don't use as much but still not enough space for your daughter? If you really cared about her you would let her come and decide for herself if she likes it or not instead of deciding for her and most importantly you wouldn't be so bothered by all the space one extra person would take, especially since she's your daughter. Sounds to me like you just don't want to live with your kid and you're making up dumb excuses to not make it so painfully obvious but I'll be honest, it's not working. YTA", "YTA. She’s your daughter. She comes first. I think you may have just permanently ruined your relationship with her", "I'm sorry, how is this even a question?\n\nYour daughter asked to live with you so she could attend school near you. You HAVE A SPARE ROOM that your wife currently has set up as an office but DOESN'T EVEN USE.\n\nWhat?!\n\nOf course YTA.", "YTA for complaining that she is moving far away and you won't get to see her when her first choice was to be near you and you refused to help her achieve that.", "YTA. Her mother is paying the difference for the older daughter. It would save your Ex-money if she going to help the youngest. Since if what you wrote this true, you're not helping at all. Great going dad. Don't be surprised if you don't get invites for future milestones.", "INFO: did you even talk to your wife about it? Or just forget the whole thing until she called back?", "YTA\n\nWhat kind of terrible father doesn't get a place with enough room for his kids? Wow just wow.", "When you only get invited to her future wedding as a guest and don't get to walk her down the aisle you don't need to wonder why and what caused her to make this decision.", "YTA\n\nYou picked your dogs and an unused room over your kid.", "YTA.    Why didn't you offer to pay for residence ?  She could stay with you  on weekends or visit during the week.\nShe could use your address  so she pays instate tuition", "Why are you complaining that’s she’s moved so far away when you had the chance to spend time with her if she lived with you? You can’t have it both ways \nYTA", "A two bedroom condo is small for three people, but your daughter was thinking ahead and being responsible, looking for a way to save on college costs, and willing to give up her senior year and graduation with her friends. That's not a small sacrifice for some kids.\n\nI can't blame you for deciding she could not move in with you - only you know the whole situation - but your concern rings a bit hollow. How would you know how much she will miss her mom? If you think she's too young to be away from family, why not take the opportunity to strengthen your ties with her? Did it occur to you that its proximity to you was part of the attraction of the first school.\n\nYTA, not for the decision to not let her move in, but for the \"concern\" that puts on the blame on her and undermines her decision.", " YTA but you don’t really care, right? You still got your wonderful wife and your dogs who are more important to you than your own daughter. Sigh", "King of the deadbeats over here good lord", "YTA\n\nSo you have the space and you definetly don't want her there, not even for the year she needs in order to get in state tuition.\n\nThat plus you don't support either of them...\n\nDon't worry, she won't be that far from her mom, she will find ways all her life to be with her, while giving you excuses (if you won't be blocked).\n\nAnd this way, you will be happy like you wish", "YTA\n\nBeing a Dad seem like too much of an imposition?\nDont get to pretend you’re childless?\nMight have to do some parenting?\n\nFather of the Year.", "YTA  You gave up the right to be concerned about your daughter for any reason since you essentially told her she wasn't important enough for you to clean out an unused room for her. I would expect her to go NC in the near future if she hasn't already.", "YTA\n\nShe wanted to stay with you and you turned her down.  And now you want to restrict her college choices?  Wow", "Of course YTA. You don't get be upset she's going to a college across the country. You told her no to living with you for a year to have cheaper tuition and said no based on what you thought she would feel? \n\nYou're making decisions based on how you think your daughter will react? Without having a conversation with her if you truly think she may be lonely without her mom? Nah, you missed your opportunity to have her close.", "YTA", "YTA. You had the chance to have her IN YOUR HOME. \n\nYou declined. \n\nThat doesn't make YTA per se, but it certainly cuts down your right to say a word about her choosing a school across the country.", "Don't really care much about your daughter, do you? And now you're \"concerned\"?\n\nYTA. And I feel so very sorry for your child.", "YTA. You said no, and for what? Because you have dogs? She can’t sleep on the couch? You can’t convert the office that you admitted your wife doesn’t use into a bedroom for your daughter? Your reasoning for saying no simply does not hold water. Your daughter asked you to make space for her in your life, and you refused. It should come as no surprise that she chose a new college as far away from you as possible.", "YTA you said no to your daughter because you’re more concerned about your QOL, and now you feel some type of way now that she’s decided to move and study elsewhere? In this economy as well. You sound like the type that thinks parenting is done once their kid turns 18. Your daughters heard your message loud and clear.", "YTA, and you blew it.", "🙄🙄, in a few years we will see a post from this OP wondering why his daughter completely cut him out of her life.", "yes you are an asshole. your daughter may never forgive you for this. you could have easily given her the office that is hardly ever used. YTA.", "You blew it dad. YTA. She’ll never look at you the same.", "YTA: \n\nYou can't be bothered to support either of your children. At all. \n\nYou contribute nothing to your oldest's education and housing. You contribute nothing to your youngest's education and housing. \n\nWhen you children reach out for support you make it clear you have no willingness to support them in any way. You don't even consider trying. You can't be bothered. \n\nAnd then you think you get a say in where either of your children go to school? Suddenly you're worried? Get out of here. You're an AH.\n\nWhere do you get off complaining that college is expensive? You're not paying for either kid to go to school. You're an AH.", "Your daughter was willing to sacrifice spending her senior year with her friends and mom because she was trying to make a responsible choice to set up her future. \n\nBeing able to graduate college with little to no debt in this day and age is HUGE.  She should be commended for making such a forward-thinking decision at such a young age. \n\nInstead, you told her no because you weren't willing to sacrifice a space that you barely use. \n\nYTA majorly.", "YTA. Christ, you can't even help your other child with her college bill, your ex does, and helping them save money for a year by her staying with you? She's 17, clearly responsible, and thinking ahead. Enjoy the shitty state funded assisted living facility you will languish in in the future.", "YTA\n\nThis happened to me and my mother years ago. My father moved out of state and soon after I lost my job. I had nowhere to go and asked her if I could stay with her for a few weeks, until I got back on my feet. She said no and I ended up homeless, living in a rental storage unit - in October in Northern Michigan. This happened 27 years ago and our relationship fell apart completely soon after. We haven't spoken to one another for over a decade now. \n\nThis is a glimpse of your future. You fucked up.", "YTA...for all the reasons that are being pointed out to you, but I'd like to point out to you that you made your own child **call you up to chase her own damn rejection**. BOOOOOO to you. You are not a father but merely a sperm donor.", "Not for the decision because it can be understandable.   YTA by trying to pass it off as something she wouldn't like.  Admit it's a selfish choice and stop pretending you are looking out for her.\n\nShe chose a place far away because she sees you don't look out for her.  It turns out that to get the benefits of being a parent you have to do the work of being one.", "I am really on the fence about this one.  It sounds like you blew her off as she had to get back in contact with you instead of you calling her after you made your decision. You try to make it out like you didn’t think she would like it there and you didn’t have a lot of space to try to act like you were sparing her misery but she probably took it very differently. At the same time these could be very legitimate points and could be a problem for your wife if she usually uses that office for work especially if she works from home. \n\nI will say as a woman in my 40’s I clearly remember how I felt about my dad and step mom when I was 17. I always felt unwelcome, like I was a burden to them if I wanted anything from them. Over two decades later I still feel that way sometimes and my kids basically have no relationship with them. I say all that because you should probably have a heart to heart with her to reinforce that you love her and we’re not trying to blow her off.", "NTA. A2 bedroom condo isn't big enough for 3, and it would have plowed up your home life having her there. Plus all she cared about was in-state tuition.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (49M) have two daughters one (20F) and (17F).Their mother and I are divorced and we do not live in the same state.My oldest daughter currently goes to a private university  near her mom which is mostly paid by scholarships and her mom pays the difference.While my youngest daughter was looking at schools during her junior year she fell in love with a school that is practically in my backyard. She called and asked if she could spend her Senior year with me and my wife in order to have in state tuition.For context my wife and I live in a two bedroom condo and one room is an office for my wife that she does not use as much because she has several back problems and prefers to work from her chair.We also have two dogs so it’s a small space. I told her I would talk to her stepmom about this proposition and get back to her.A week or so later she calls me and asks if we have made a decision on the matter and I said we do not have enough space and we think you would not have a good time here and would miss your mom too much.My daughter has now made a collage decision,she is going to a college that is across the country from me. I concerned that she will be so far from me and her mom. Am I the Asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. She’s literally your child and you’ve made it clear she isn’t welcome in your home. Enjoy the estrangement OP.", "YTA your a really bad father i hope she never talks to again", "YTA. Your job as a parent is to take care of your children and make them feel loved. You’re 0 for 2. This is something you can’t recover from.", "YTA \n\nThis put such a bad taste in my mouth and I would bet that it has soured your relationship with your daughter. Enjoy the repercussions.", "Yeah YTA. This is your kid. Be her dad, pendejo. Things didn't work out with your ex, cool. You owe your ex nothing. You owe your kids something. Get it together.", "YTA.\n\nMy parents have never, ever made me feel unwelcome in their home, even as an adult. I am actually writing this from their couch because I am going through a lot and need to be around people who love me. Do I have my own home to go back to? Yes. Can I stay here as long as I feel the need? Also yes.\n\nYou're concerned with your daughter being too far from you when she could have been in the same place as you? That's hypocritical.\n\nBottom line, you reap what you sow.\n\nDon't cry later down the line when your daughter is not apart of your life, and you have no idea about what's going on in hers because she's cut contact with you.", "YTA for making the decision and then guilting your daughter like it was her fault. Luckily you showed your true colors now so she can create a new life for herself across the country. You made your bed. Now lie in it.", "YTA! By reading what the OP wrote…he does NOT love his daughter.", "YTA. You're an awful parent", "YTA, Definitely", "YTA - I hope you’re fine with estranging yourself from your daughter.", "YTA. By your own admission you are not contributing anything to your older daughter’s tuition and you denied your younger daughter a chance to attend her first choice college at in state tuition because you couldn’t be bothered.", "Yes.  YTA.  I can't even imagine why you would post this, you are that much of an ah.", "YTA how do you even call yourself a dad when you clearly don't give 2 shits about your daughters.", "YTA and you'll be lucky if you're invited to her graduation. Cheap move daddy-o, kids still need parents even when it's inconvenient for you.", "YTA you literally told your daughter you don't have space for her. Why would she factor you into her college decision?", "You will never restore the relationship with your daughter that you’ve destroyed. YTA.", "You already know YTA.", "YTA, look at it realistically, this was probably the last chance you'd ever have to live with, and bond with, your daughter before she starts her adult life and you threw it away. She will remember that you had the choice to be there for her, and chose not to. Why did you reject her, knowing you DID have a free room there? What were the cons of her living there? You said your oldest daughter has scholarships and your ex pays for the rest, are you not contributing anything to either daughters education? This was literally the one thing you could give her, that costs nothing, and you declined?", "YTA!  She just needed one year of residency and you could t give her that?!?  And now you act put out because she is moving across the country?? 🙄🙄", "yta ... apart from being a sperm donor what have you done for your kids .... you dont pay for the older kids school do you even like your kids", "YTA. Enjoy the extra space, your daughter won't be coming to visit anytime soon", "YTA. Do you not think you have any responsibility for your child?", "YTA. She wanted to stay with you for a year, and you said no. And you made up lousy excuses to try to convince her she didn't really want to live with you. Now you're upset that she is moving somewhere else. It's time for you to behave at least as maturely as your teenage daughter does.", "YTA - you didn’t even help your first child with college expenses and left it to her mother, and then turned away your second? What is wrong with you? \n\nEnjoy the shitty nursing home your kids will put you in and never see you.", "YTA your daughter wanted to live with you. You said no. Now you have to live with the consequences of your decision.", "YTA because you could have tried and you didn't bother.", "YTA. Do you even like your daughter? You could have saved her so much money in tuition, why didn’t you? \n\nWhen my stepdaughter was getting ready to apply to college we told her mom it would help her if she lived with us (her dad and me) and we claim her on our taxes so she could get a great financial aid package since we made way less money than her mom. But nope, the ex wouldn’t give up the tax credit so my stepdaughter got zero aid and had to take out parent loans which she was over $60K in debt from after she graduated. She works 3 jobs to make her loan payments now. I’ll never understand why the ex wouldn’t do it our way and keep her daughter from starting out her adult life like that. It’s just selfish.", "Ohhhh- that sweet, responsible, vulnerable girl reached out to you. She came to her dad with an important request. Denied bc dogs? YTA", "Why don’t you like your child? YTA. Consequences of your selfish ignorance. Your decision likely just cause your daughter to see you in a differently light, she has seen your true colours.", "YTA You had 1 chance to spend quality time with your daughter and you CHOSE your new wife over YOUR OWN CHILD. you’re the biggest deadbeat asshole on the planet.", "YTA, she wanted to live with you and you said no. You can’t be upset she chose to go somewhere further away from you.", "Not only are YTA, you got exactly what you deserved.", "YTA\n\nOh you claim to be so concerned that she'll \"miss her mom\" but the message she heard was that you don't give half a crap if she's missed *you.*\n\nYou made it clear to her that there's no room (not even the barely-used spare!), no place for her in your life.  Of course she no longer wants to be near you.", "YTA you told her no so she's moving away. You did this to yourself.", "[deleted]", "NTA. But really rethink your decision. You could forge a much more rewarding relationship if you did.", "NTA - There isn't enough room, and your new wife would be miserable. There are lots of colleges out there for her to go to.", "[deleted]", "Not just dogs, they also have an unused spare room. There’s clearly no room for the daughter.", "I guess it's true what they say, you can lead a daughter to water but you can't make her live with her mother.", "You can't crap in the room and complain it stinks 😂😂😂 I love that I'm definitely gonna use that when I have the opportunity 100 percent agree with ya YTA OP", "It won't be that long. I think the next post will be something like: Why Won't My Daughter Invite Me To Her HS Graduation?", "He made up excuses, too, like the daughter would miss her mom too much. Please.", "You realize that he and his wife share their bedroom, right?  A 2 bedroom condo is exactly big enough for a married couple and a teenager.", "At least he won’t ever see her again.", "and he's her father legally he should have to", "But they use it sometimes! Maybe! Not much though! But what IF they wanted to think about maybe using it someday?", "😂😂", "YTA. It’s times like these that make me wish there was a “you’re the asshole dance” because words alone seem inadequate.", "Now she knows that she can't count with her dad I guess, YTA.", "Op is YTA and just the fact he’s not commenting proves it \n\n\nNext post a few years later will be \n\nMy daughter is getting married and won’t let me walk her down the aisle", "YTA. Why aren't you helping with her college? You sound like a deadbeat. Do you even love your daughters?", "YTA.  You might have just lost your daughters respect.  Small space or not, you should have offered it to her. Way to break your daughters heart", "YTA. {cats in the cradle intensifies}", "So, it was for one year? Her last year of high school? Then she would qualify for in-state tuition fees but presumably live on campus, or somewhere else that's not your apartment? You wouldn't 'squeeze' your own daughter in for one year? YTA.", "YTA - I expect you won't have to worry about much contact from your daughter.", "YTA. Did you even ask your wife? Or were you using your wife as an excuse to refuse your daughter?", "YTA it sounds like you might only have one daughter soon", "YTA. Clearly you’re seriously lacking in the dad department. And on top of that you pretend you’re not letting her live with you for her own good.", "So if your wife doesn’t use the office, repurpose it. There’s literally no reason to tell her you “don’t have enough room” when there’s literally a room that goes unused. Your daughter wanted to be with you. She wanted to actively be in your and your wife’s lives while she’s attending college, and you said no because precious wifey apparently *needs* an office space she does. not. use. YTA.", "YTA and a terrible father. If you can even call yourself that", "\"You would miss your mum too much\" bro... manipulative much? YTA", "YTA. She’s your daughter and you have a spare bedroom. She’s lucky her mom cares about her.", "I don’t think your an AH.  I don’t think your daughter moving in with you would be a good idea even if you lived in a bigger place.", "YTA. You literally told your teen daughter you don’t want her with you because new-wife and dogs are more important than your daughter is to you. Of course she’s going to distance herself. She’s already seen that you don’t help with her sister’s schooling. She now knows you’re not someone who cares about her. \n\nBad sperm donor. Don’t be surprised when she goes NC.", "YTA. You don’t love your own children and that’s really pathetic.", "YTA, way to help your daughter, I would have slept on the floor if that's what it took to made room for my kid - it's what parents do. Mark this moment OP, your relationship with your daughter is going to break into two relationships; before and after you made this decision.", "The fact that she had to call you to get an answer is just the cherry on top of the YTA cake.", "My dad did almost this exact thing to me back when I was young. I'm now 47 and i STILL cannot believe that he chose to create imaginary problems to prevent me from staying with him and his wife. I haven't talked to him in years and won't be attending his funeral when he dies. He showed me that he doesn't love me. His loss. YTA, OP. You really really are.", "YTA\n\nYour daughter needed you and you had the spare space too then too you told her no and now are surprised when she decided to go across the country.", "So you openly admit you have a 2nd room that is not actually really used for it's current purpose, but you still refuse to let her stay for a whole year.  Then you get upset that plan B for her was too far away from you.\n\nYTA, plan A was contingent on you giving her a bed and food for a year before she likely had access to dorm rooms that she could move into.  Instead you ruined that plan and are upset now that you are stuck with door number 2.\n\nI hope you enjoy the company of your dogs, because that's probably the only company your going to be getting  from now on.", "You just demonstrated how much you care about your daughter. Couldn’t make space in a room that’s ‘hardly used’. University isn’t forever - she’s your kid. Don’t be shocked when she doesn’t bother with you. \n\nYTA", "YTA, she’s still your dependent and you are responsible for her even if she is not living with you.  Get a bigger place, dude.", "I think OP needs to listen to Cats in the Cradle on repeat and wake up before permanent damage is done.", "I bet daughter didn’t even ask him for college costs!", "Daughters do need their dads as much as their moms, but not TA.\n\nDude just tanked his relationship with both daughters most likely and I'll wager if the youngest knows they've got a spare room and she was told No that she will absolutely put the bare minimum going forward with her dad.", "For real. Imagine your teenage child is like “dad can I live with you?” And you say “no” and expect to be respected as a father.", "Exactly. It sounds like he doesn’t want anything to do with them that involves being a parent.", "Nah, itll be \"AITA for not wanting to go to my daughter's high school graduation after she gave me the silent treatment ?\"", "She knows he’s not helping the other sister. I think both daughters have OP pegged for the deadbeat dad that he is.", "Stepmother should have stepped up too. She knew she doesn’t use the office and how much daughters need their dad. Both failed in my eyes.", "It doesn’t even sound like this dude talked to his wife about it.", "YTA\n\nIf she has to pay out of state tuition either way, why would she go to the school near you? If she has to travel from her college state back to her mom’s by expensive plane, why would she stay near you? She asked to stay with you for cheaper tuition and you said no. You told her you don’t have space for her, so why not go to an area where she’d like to stay over summer and holiday break since she has no home with you. You had an extra room that no one used. She’s a teen so she wouldn’t have everything everywhere. I’m actually shocked she considered living with you in the first place. You purposely have a home they can’t share in, I’m assuming they can’t visit since you have two dogs (?), and you don’t pay for either child’s schooling. She literally needed an address and your unused office and two dogs led to a no.", "Yeah YTA. Good job being there for your kid. Way to just phone in being a dad.", "What a truly awful parent.\n\nYou do not want her with you, simply because you don’t feel like it. Then are astonished when she doesn’t want to be near you??\n\nYTA - I hope that your ex who pays for everything, and daughters you barely care about, are happy.", "Nine months of your time to set your daughter on her life time path and you refused. I hope she doesn't give you the same crap reasons when she picks out your nursing home some day.", "You’re delusional if you have any doubt about being the YTA here", "Wish I could say I didn't expect this from a divorced dad but not showing up is the norm.", "YTA. Your daughter was willing to uproot her life in her final year of high school just to get in-state tuition, and you refused to make room for her. You should have at least offered to pay the difference for the price of out of state tuition. You're also TA because instead of contacting her and letting her know you made a decision, you didn't say a word and instead put her in the position of needing to reach out to you to ask what you had decided.", "YTA. You had an opportunity to connect with your daughter, have her close for college AND help her with expenses but you chose yourself. You deserve whatever consequences come with that.", "Is this supposed to be a toughie?\n\nYTA 😂", "YTA - you made it clear there is no space for your daughter in your life. She will be LC to NC for the rest of your life. Hope you never need a place to stay for she will not be taking you in.", "Hope you never wanted to see your grandchildren or your daughter ever again.  You seem like the kind of father who when their child is drowning you throw them an anchor instead of a life preserver. Hope your dogs and unused office are worth your loneliness.", "YTA\n\n1. That's your own daughter.\n\n2. Who are you to tell her what she would and wouldn't enjoy and if she would miss her mother? It isn't like she would be living with you forever and that would have been a great opportunity to bond as a family with her stepmother.\n\n3. Now you're suddenly worried about her well-being so far away from anyone she knows when you're the one who sent her away to begin with? What did you think telling her no was going to mean? Did you think she just wouldn't go to college because you told her no? That would be even worse. \n\n4. You knowingly have a room in your house that isn't used much she could have occupied or even sleep on a couch.\n\n5. You had and gave her no reason as to why you're turning her away. Did you even actually ask your wife because it sounds like you haven't. What you said was so cold and heartless and you're still her father and someone she thought she could reach out to.", "YTA. Hope the dogs put you in a good nursing home someday.", "Your so YTA for ghosting your daughter for a week without calling her back and then not sharing your home with her?\n\nBTW, are anyone else also getting the vibe that this is posted by either daughters or their mom? If it’s by the daughter then she definite got an objective answer what we think about her dad", "YTA don't be surprised when she goes no contact", "YTA", "My son is lucky to be here and my husband has a two bedroom condo. The extra room is my office I use. My son is in that room. We make it work. We are also looking for something bigger. My husband is my son’s stepdad. My son nearly took his life twice in a 30 day period. You seem callas and cold. You are more relieved you won’t see her. You are lucky your daughter wanted to be with you. My husband has been supportive. To bad you married someone who doesn’t like your children. You don’t deserve your children.", "YTA who doesn't want to hang out with their kids. Especially if they already live out of state. Now she wants to spend time with you. Yes it is to get in state tuition. But she still wanted to stay with you.  Remember these moments when your kids don't call on father's day.", "it still amazes me that people write these out and wonder if they’re the asshole. you can not be serious right now. YTA", "YTA.\n\nIf you were so concerned you would have let her stay at your place. You're her parent too. So you want her to be close enough so your ex wife can look after her. Sounds like you have more than enough room. This is probably going to be a turning point in your relationship with her. You are her dad and she's still a child but she can't move in because it disturbs you and the new wife's space.", "Yta and a big one.  You rejected your daughter for a room your wife doesn’t even use and she only wants to stay a year.", "YTA of course. You had a spare room that you don't use. You just couldn't be bothered to make any compromise for your child's benefit. And then ghosted and then gaslihted her.", "YTA", "YTA. Your kid and their aspirations should be reason enough for you to m a k e room.", "YTA\n\n“I’m concerned she will be so far from me and her mom.”\n\nSo concerned that you’d let her live with you while she goes to the school she wanted too?", "YTA \n\nI keep getting banned from this community for saying what I really think. So I'll stick with YTA. \n\nAnd I hope his daughter meets someone in her new hometown. I hope she has such a great time raising his grandchildren away from him", "be a father at some point op\n\nYTA", "YTA, obviously, but mostly for pretending you’re doing her a favor by refusing.\n\n>> we think you would not have a good time here and would miss your mom too much.\n\nLmao. Have the balls to pause at “we do not have enough space” (even though it’s not true) and don’t pretend like you have her best interest at heart.", ">You could have literally had her in your home but shot her down. Now you are upset she's going across the country.\n\nRight, this was a strange twist to the story. The whole read I was just assuming OP didn't really like his kid or want her around beacuse he was an uninterested deadbeat and was wondering  if not caring about or for his kid made him an asshole. And then . . . suddenly he dosen't want her to live faraway? What?", "OP can’t be this clueless. YTA. He sounds like an absentee father. He  lives in another state with his wife, I can’t imagine they see either of the daughters all that much now. He isn’t helping with the tuition for the  oldest daughter even with Scholarships it’s up to mom to cover the rest. Now the  youngest wants to go to school near him, and he makes  it sound, like a burden instead of a chance to be more a part of her life. She’s already living far away from him, but now it matters? And just like with oldest it sounds like they expect the  ex wife to be the one looking out for the youngest daughter. If he were so concerned about her being away from both her parents then  they would have made it work and told her that of course she can move in. Im going to guess the daughter is going to be NC pretty soon", "I don't think OP is as concerned as he tries to make it seem. This reeks of cover-up from a parent that doesn't want own the fact that he doesn't want his child around. Because what would that say about him? So he makes an AITA post to show just how \"concerned\" he is, but really it's not bothering him that much. If it was, he'd have offered her the extra room.\n\nYTA.", "What relationship? OP sounds like he's more of a dad to his two dogs and cares more about them than he does his daughters.", "Did you miss the part where he said he would call his daughter back to give her his decision and never made the call? His daughter had to follow up “a week or so” later because she never got a return call with his decision. Makes me wonder if he would have ever called her back to tell her no. That alone is enough for me to call him an AH.", "Then op can’t be upset", "Doesn't even sound like they had to keep her there full time. She just wanted to be in state long enough to qualify for in state tuition. Then she probably could have moved out into her own apartment or a dorm; while still being close enough for OP to help or spend time with her. \n\nBut, unless those discussions and details got left out of OP's post, it sounds like they didn't even take those options into consideration.", "And don’t forget the gaslighting when the op also told her she wouldn’t have a good time in his home either 🙄", "You don’t think the damage is already done?", "Yeah that bothered me nearly as much as OP's reasoning behind why he said no. Gaslighting his kid.", "Hapy cake day, always be happy ❤️", "Wow. You suck. I can’t believe you wouldn’t do this for your kid. It’s one year. Listen to the “cat’s in the cradle” song. That old man in the song will be you if you don’t invest in your child.", "YTA - Kids Always come First! You Chose an Office over your daugther and then Wonder why she Chose to move far away for College, next thread is you wondering why she goes LC or NC", "Yta", "YTA! You don’t deserved to be called a father!", "YTA. You and your current wife.", "YTA\n\nHope you don't care about grandkids...\n\n...that ship has SAILED.", "Yeah. In short you are. Don't expect her to call you anytime soon.", "YTA. You sound like a deadbeat dad. You've contributed nothing for your eldest daughter so I can't imagine how she must feel and now you've turned away your youngest daughter.\n\nI don't think your kids ever stayed over. If the apartment was so small, and you have 2 children why didn't you get a bigger apartment for when they stayed over? You want the status of fatherhood but none of the responsibility.", "Yes, your are an Asshole. \n\nNext question please. \n\nYTA", "How close to your daughter are you that you made the decision for her that she'd miss her mom too much?\n\n\nYTA though. You could have made it work. Talked with her. Instead you made her feel unwelcome And so she made a new decision for herself.", "YTA you already knew this and I feel you have come here thinking people are going to validate you not wanting your daughter love with you. I think this backfired.", "YTA your wife raised the kids, is paying the older ones tuition without your help. The least you could have done was let the younger one graduate with less debt. You’re the worst kind of deadbeat, the one that pretends you’re lifting your weight as a parent but doesn’t even do the bare minimum. \n\nPay her tuition if you want to redeem yourself and keep her in your life.", "YTA you had an opportunity to show her that she matters, that you love her presence … but that would be a bit inconvenient for you so you said no.\n\nYou made it clear where she stands on your priority list, and it’s below your own comfort.  \n\nShe heard you loud and clear.  \n\n#You don’t get the privileges of being a dad unless you’re prepared to pay the obligations of being a dad.", "YTA. YOU decided that she wouldn’t enjoy her time there. That’s a twisty way of saying ‘I don’t want you here’ and trying to sound like you’re doing it for her. She was trying to financially plan her college future (sounds like you’re no help there if it is only mom covering older sister), and you can’t let her stay a year to lower her fees. I wouldn’t worry too much about how far away she is. Chances are if she found a room down the block, she would still go no contact after your actions show you don’t give a crap about her.", "Honestly, yes YTA. Always gotta have room for your kids man. That should be a priority.", "I get the back problems and why your wife needs to work from home but instead of trying to figure a solution you basically told your daughter to go fuck herself. No", "YTA, in a very strong way.", "YTA\n\nYou are concerned she will be far from home when you refused to let her live with you? You admit in the post you have an extra office room nobody uses but also claim there's not enough space for her. \n\nShe made her choice accordingly to yours, you are an AH.", "YTA and you blew it already. That won’t be fixed easily.", "You’re not concerned. Her changing her mind means you can continue being a deadbeat dad. YTA", "YTA.", "YTA Jesus I can’t imagine failing one of my kids so badly", "YTA . You said yourself your wife doesn’t use the office as much . And to top it off you have the cheek to get upset that she chose to move further away to study . You don’t get to have it both ways", "I’m a bit confused because you seem to be explaining and pointing out that you actually have a spare room that is entirely free because it isn’t even being used as an office but then you have said you don’t have the space. I feel like you have missed out the real reasons why you don’t want her to live with you. Did your wife say she didn’t want it? I don’t think the full details are given here. Your reasons are you don’t have the space but you also explain you have a free room and also that you don’t think she will enjoy it there but I am assuming she has visited and would not have asked if she didn’t think she could handle the living situation so none of it makes sense. YTA based on what you have said. If you can follow up with a more detailed reason why the spare room is not suitable for her then I will review.", "I think the worst part is that OP tried to make it seem like they were concerned about her missing her mom. At least tell her the truth don't come up with an excuse like that. At least own up to the fact that YTA.", "[deleted]", "YTA. \n\nWe call this phenomenon, new wife new life", "I doubt either daughter will be inviting dad", "To me, it's obvious that his level of involvement is very low because he doesn't already have a place that she sleeps when she visits. It leads me to believe that she doesn't.", "He's allowed to not want his daughter to live with him, but now he complains she's moving across the country? And also admits he gives 0 financial help with his eldest daughter? He already lives one state away so I don't understand why he now cares about his daughter being away.", "I would not let my dogs stay with OP", "Why does not somebody think of the rooms?!? /s", "[deleted]", "She's allowed to change her mind just because of this, college is expensive and OP hasn't said anything about helping her afford it, and since she's not going to be able to live with him (even though he has an empty room, but somehow there's no space for her) her next option is the other college.\n\nOP isn't allowed to refuse to help his daughter and then act concerned about a college he's not going to help her afford, specially when he already lives a state away. He can try to talk to her about staying in a dorm and she'd give 0 fucks, honestly his relationship with his daughter is pretty much over at this point.", "There’s an assumption here on both sides that he may or may not be supporting his daughter, which is an important factor on this. In this case, assuming he’s financially supporting his daughters then it’d totally make sense for her daughter to stay at a dorm. It’d really suck if she’d completely change her mind just because she’s angry that he didn’t let her stay at his apartment but was giving alternatives. I’ll give you that he’s not giving any indications of this though, and in case he’s not supporting his daughters in any way that does make him an AH. I should be more careful of how I phrase my opinions on Reddit lol.", "He's not paying for his eldest daughter's college and has said nothing of contributing to his youngest, so I have no reason to assume he is financially contributing. \n\nI don't think she's angry, more like disappointed, he also didn't offer her any alternatives like a dorm or anything, he just said \"no you can't live with me\". \nAnd the daughter can stay in a dorm in another state, she'll have the same support from her father.", "YTA\nYou can't have it both ways and did you ever consider that by telling her that you'd discuss it with her stepmother and then tell her no you're essentially telling her that your wife doesn't want her there and damaging that relationship beyond repair. You're also telling her that her wants and needs are not as important as your wife's.", "YTA. You had a chance to be a part of your daughter's life. You blew it.\n\nThis was a \"sliding doors-moment\" in your life. You could have had a good relationship with your daughter. Gotten to see her become an adult. Be a grandpa to her kids one day. All that, you missed, because... what?", "YTA you dont want to look after her, you want her mother to look after her and now you are all concerned she is moving far away from her mother, not you. What an AH. Your excuse to her that she cant stay with you, she will miss her mother is very telling.", "YTA\n\nI'm just saying, one parent is willing to pay the difference for their kids college while the other parent won't even let their kid stay in a spare room because he has dogs....also you ghosted her.", "So your older daughter goes to school paid by scholarships and your ex. So you’re 100% off the hook for school with her. \n\nYour younger daughter asks for 8 months to help lower the costs (presumably to help her mother pay since you don’t contribute to your elder daughter’s education) and possibly even build a relationship with you. You shot her down (after making her call you back to get the “we’ll think about it” answer” and NOW you’re concerned she’s going to be “so far away”\n\nGet used to it. YTA and I’m guessing your younger daughter will be going low to no contact with you shortly", "YTA. Awful, awful behaviour. Your poor daughters.", "I am curious how you went from \"we don't have space\" to \"you will miss your mum too much\" ... come on, at least be honest. YTA, not for not having space but for clearly not being interested in your daughter and leaving everything to her mum.", "YTA. I'm not even going to explain my reasoning. You're the problem here.", "YTA", "YTA\n\nYou made it clear how you feel about her. If you did that to me, I’d write you off and that would be the end of our relationship as you know it.", "Yta, but you wife is a bigger one, just remember she did not want your daughter in her house, lmao good luck with her", "YTA. Look at it this way: she wanted to go to the school near you. She wanted it enough to give up her friend group in her senior year in order to afford to go to school near you. I don't know if you remember senior year, but those memories with friends that year are precious. That's how much she wanted it. Most likely, without the instate tuition, she now cannot afford the school close to you. She can probably afford the school across the country from you. It's probably what drove that decision. You can consider it a sound financial decision on her part - albeit one that you could have turned around by welcoming her into your home for a few months- if it makes you feel better.", "YTA. You’re a “father” who likes to do the bare minimum. Shameful", "You’re sooooooo fucking stupid. 😂😂😂😂😂😂😂 get ready to never see her again…just you, not her mother. 💀💀💀", "Yta \n\nDon't complain when she's across the country when she had the chance to be with you. It's one way to push your daughter away from you", "YTA dont worry now that she's  going far.... she probably did that  to get away from you.... don't  complain about how expensive college is when shes trying to reduce some of the fees and u shot her down due to small space.... she would most likely be at school most of the time.....", "YTA if you aren’t going to help her then you don’t get to cry when she tells you she is moving across the country", "YTA. I can't imagine how horrible let's be to have you as father", "P", "This is so sad. I hope you apologize and ask her to stay with you. What a missed opportunity for both of you.", "YTA. Are you even helping either of your kids with college or is your ex paying for it all? It's incredibly telling that your daughter who is a minor doesn't have a place to stay with you during your custody time", "YTA you have 2 daughters but you don't have enough room in your house for any of them??? Why???\n\nIt doesn't really matter if they live with their mother or not. You had kids so you should always have enough space and means to house them. Anything could happen, you should be their safe space too.", "YTA this is your child.....man up and be there for that child. Selfish man you are. Why do people have kids if they dish them out like this I cannot comprehend. Awful world we live in.", "YTA big time\n\nThat alone would make me go low contact and eventually cut you off from any contact. \n\nYou could have helped for a year to help relieve some financial burden but you chose to be a  AH and sent her away with a poor excuse. \n\nHey atleast you know your an AH with just 1 daughter now.", "YTA. Don't tell her where she will or will not be happy. It's only for a year, and you gave her a list of cons, let her decide.", "You ever heard the old adage about how your children come first?  I guess not.\n\nYTA", "YTA. It sounds like you didn't have your daughters living with you for a long time. She wanted to be closer to you and go to college near you and you shot her down because it's inconvenient for you? \n\nYou should support your daughter who's trying to further her education.", "Wow. An opportunity to be a dad arrived and you shit the bed. She certainly has gotten the lesson that she cannot count on you. YTA.", "YTA you had a chance to have your daughter live with you.  You had an opportunity to share your life with your daughter.  You blew it.", "\" you will miss your mum top much\"... yeah, right.\n\nYTA", "YTA. I would bet that neither daughter will want a relationship with you after this. Best of luck to you with your dogs", "YTA. You don’t want her with you but don’t want her away? Like make up your mind.", "YTA. Your daughter “falls in love” with a university so much that she is willing to move to another state and attend a new high school for her senior year in order to qualify for in state tuition. She calls you and asks if she can live with you for that last year of high school and you say you’ll get back to her. Only you don’t get back to her. So “a week or so” later she has to call you back and ask if you’ve made a decision. This is a huge thing for her and you tell her no. Not only do you say no you say that you don’t have much space but the “office” is rarely used. And you further justify your saying no to your daughter by telling tell her that she’d miss her mom and not have much fun. \n\nNot only are YTA, you are a terrible father. You should be ashamed of yourself. Also telling is that your biggest concern is if YTA and not the fact that you’ve set fire to whatever relationship you may have had with your daughter.", "YTA boohoo so now you're worried she's going to be far, dude you shot her down to be close, grow up be a dad", "So your wife barely uses her office, and still you said your daughter couldn't come live there...\nHmm, I wonder if you're the asshole", "YTA - \"I don't want my daughter to be near me\"\n\n\"Oh no, she is Moving away!\"\n\nEdit typo", "Youre concerned she is going to be away from you and her mum? Ey? What just happened? She was going to be right there with you but your partner said no.\n\nIm abit confused here. What did you expect to happen? Her to try and find something near where you are or what?\n\nIll be real, from your daughters perspective, she would rather have lived comfortably with family which is also much for affordable for a student.\n\nBut if thats not an option, she might as well go far away so she can do whatever she wants without interference from her parents.\n\nBit confused why youre upset about it", "Let's change this title. AITA for never taking care of my kids and letting their mom do ALL the work (and pay for it) while I move on with my life? Now she wants one year, one year of help and I don't wanna cuz my dogs. AITA?", "YTA- you do have room. You said yourself your wife doesn’t even use the office much. So what’s your real reason ?", "You can't be serious. YTA", "NTA. If you don’t have the space, you don’t have the space. But you can’t complain that she made a different choice.", "YTA. She can't stay with you, but now you're concerned about her moving cross country for school. Wow.", ">and we think you would not have a good time here \n\n>and we think *WE* would not have a good time with you here", "If it's like NY, she probably needs to graduate from an in state high school to be eligible for in state tuition", "[removed]", "Yea. This is an out-and-out lie to pretend he cares about her emotional welfare, which he doesn’t. And it was only for one year. One school year which isn’t even a whole year. And he’s destroyed his relationship with his child.", "Lol  my mistake.   That makes sense, otherwise  any student could rent an apartment and claim residence.", "Yes, this type of situations sticks with the person forever. Especially in her age. It's hard to feel rejected by a parent. \nYTA OP", "This comment was said word for word below."]}