{"id": 12735, "submission_id": "11wa1jy", "title": "AITA for yelling at my husband at 6 AM waking him up from sleep?", "selftext": "I 39 F yelled at my husband 34 M this morning at 06:00 AM, causing a huge fight. \n\nMy husband recently (around 3 months ago) got an office job where he has to be there on time instead of a flexible hours job. That's when I discovered he's the kind of person who has multiple consecutive alarms every morning and that he struggles to wake up on time. On the other hand, I am a morning person, and I wake up at the sound of his first alarm even though I only have to wake up at 08:30 or 09:00 AM\n\nThe issue is that he sets his first alarm at 06:00 AM and then sets four other alarms consecutively every 30 minutes. He usually ends up waking up around 8 AM every day and going late to work while I wake up at 6 feeling exhausted. \n\nMy first reaction to this was to calmly talk to him and ask him to set an alarm at a reasonable hour and offer to help wake him up. When I tried waking him up, he was extremely nasty. He would scream and beg and act very offended. Basically, he acts like a child and throws every trick he has at me. So I stopped trying to wake him up.\n\nYesterday I was at the office until around 09:00 PM so I was pretty tired and needed sleep so when I heard the alarm at 06:00 AM this morning I was furious. I immediately started screaming, asking him why he would do that and accusing him of ruining my day. It made me even angrier that he tried to deny it, saying the alarm never went off. Then he tried to give me a hug and comfort me, but I wouldn't have it. I told him instead he should just stop setting the alarm at 06:00\n\nHe was very angry and when he got up he accused me of being abnormal, he said that I'm always starting fights and that I was always hurt or upset crying about one thing or the other and that he's sick of it. He said that he doesn't care anymore and that I can be as upset as I want. I told him to stop with the theatrics and set the alarm at a reasonable hour instead.\n\nI feel childish for the way I acted, especially for yelling. I feel like this is a dumb fight, and I'm not sure if I'm being inconsiderate because I know he has trouble waking up, and it's causing him trouble at work. So, AITA?", "created_utc": 1679291286, "permalink": "/r/AmItheAsshole/comments/11wa1jy/aita_for_yelling_at_my_husband_at_6_am_waking_him/", "score": 50, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I woke my husband up by screaming and being angry. I feel that's immature and an AH move. I'm not sure if I'm being inconsiderate towards a problem he struggles with.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nI'd be FURIOUS if I was being woken up hours before either of us needed  to be! And my husband would be just as pissed if I did that to him. I don't  know anybody who is ok with being woken up every half hour, for 2 hours before its actually  time to get up. He needs to find a more reasonable wake up method, or start sleeping in another room.", "It seems to me that your husband has a case of gaslighting, based on the info that was given here. Also, I had a roommate that was exactly like your husband with the alarms going off every 15 minutes. If you talked to him, and he acts like this, and you aren't exaggerating... you might want to have a serious talk with him about your relationship/living situation if this is the hill he wants to die on.\n\n&#x200B;\n\nNTA", "NTA. sleeping habits are very important and it seems like you two aren’t compatible in that sense. i think you two could benefit from sleeping in separate rooms if that’s possible.\n\nIMO, he’s the childish one here. although i’m not a morning person myself, setting multiple alarms whilst knowing you won’t get up is selfish. he should be more considerate towards you and YOUR working hours.", "He should probably consider having a sleep study done.\n\nI have sleep issues that cause me to do the multiple alarm routine.\n\nThere are sleep related illnesses that could cause the type of behavior.\n\nAs a way of helping the relationship, sleeping separately May be the way to go until the cause is determined.\n\nNeither is the AH in my opinion.", "NTA\n\nThis is a reasonable thing for you to be upset about. It’s his behaviour that led to this fight, not your pointing it out.\n\nIt’s not like he’s hitting snooze for 9 minutes at a time. First alarm TWO HOURS before he gets up with half an hour in between is selfish.\n\nThe fact you’re feeling childish now after he called you ‘abnormal’ and said he doesn’t care makes me wonder what else he’s been unreasonable about in your relationship.", "NTA - I have two alarms, they're 7 minutes apart from the other. People who have multiple alarms that span ***hours*** are selfish assholes.", "NTA! It sounds like separate bedrooms might be in order. \n\nYour post reminds me a lot of my own headspace in the first year of my current relationship. My partner *also* sets consecutive alarms— and that shit is like my kryptonite! He also snores. I am a very light sleeper who has a ton of night terrors and I tend to lash out in my sleep. \n\nAfter a lot of silly, stupid fights, we realized we were constantly at each other’s throats because *neither* of us were getting the rest we needed. So, when and opportunity opened up for a 2BR place, we jumped at it! \n\nHonestly, I credit separate bedrooms for saving our relationship. We still cuddle and are intimate. We spend time together, and bond… but now we almost never fight. For us, it’s been a net positive! I know it’s not for everyone, but it works for us. Maybe it could work for you, too?", "Thorn between NTA and ESH your husband seems like a very weird, childish person, yet screaming and fighting doesn’t solve problems either \n\nMaybe consider sleeping in separate bedrooms in case in of you needs his/her sleep etc etc \n\nI don’t think you ate in the age where you have to act like his mom and „teach him“ / force your way of waking up on him so i don’t think there is gonna be a change soon. Breaking up would be irrational too", "ESH.\nYou are a couple who will be best served by separate bedrooms. Lots of healthy couples do thst", "I suggest trying every 15 minutes over the course of about 30-45. That is what works for me and my husband. Every thirty minutes won't help bc you are fully falling back to sleep in that time. I do think he may also have a sleep disorder. My husband has sleep drunkenness. It's a real thing. I swear to god I thought he was making it up. We would fight so much about his behavior for him to say he had no recollection of why we were fighting. \n\nThis is actually a hilarious story, once I woke up and realized the dog didn't come into the bedroom and got locked out when we went to bed. She had gotten into the trash. I started cleaning it and my husband was standing over me saying we can do this later. I knew he had to be up for work and I didn't so I said go back to bed and I'll get it. He continued to whine and complain saying we could get it later while I continued telling him to go back to sleep. Eventually I got mad and this devolved into a fight, one that seemed to make very little sense from his side. I finally slammed the bathroom door and when I came out he is sitting on the bed very confused asking why I am mad. I tell him and he has no memory of any of it. He was literally asleep the whole damn time. I called him a liar bc this felt like bs. Eventually, he got a sleep study and got a cpap machine and these bizarre things don't happen anymore. \n\nAll I'm saying is his behavior while sleeping may be fully unconscious and his struggles to wake up may be do to a sleep disorder. The crap my husband used to do in his sleep is wild. He once told my roommate he was gonna fuck him in the ear if he didn't leave him alone. He had fallen asleep on the couch and this came out of absolutely nowhere. It was funny as hell. \n\nI also have had issues with sleep. In college I used to answer the phone and have nonsense conversations with people. MY mom bought me an alarm in high school and refused to wake me up anymore bc apparently I would tell her to go fuck herself in my sleep. I never remembered doing any of this. Honestly, I probably need a sleep study too. \n\nI'm not gonna call anyone an AH. I think you two sleep different and he genuinely needs a sleep study.", "Hes not 12 fgs! Set the alarm for a decent time. NTA.", "No one sucks here.\n\nThis is the exact reason why my grandparents had separate rooms.\n\nEither you can find your own sleeping situation or you can file for a divorce because a person who won't wake up with one alarm won't suddenly get better. They need multiple alarms for a reason. My ADHD husband will *make coffee at 6AM in order to have some, and go back to sleep*. He places a cup on my nightstand for me to have when I wake, and it is normally cold, but it has put him back to sleep nearly 100% of the time, where one cup of coffee would have me buzzing around the house like a bee. We're all different and you may need your own bedroom for your sanity.", "It sounds like after three months of sleep deprived torture, and despite several discussions with him about how his behavior is effecting your sleep you reached your breaking point and uncharacteristically yelled at him - this does not make you an Asshole. If he is entitled enough to think that this 2 hour daily disturbance is normal and thinks your the unreasonable one I’m not sure how you adjust his entitlement without something drastic, but good sleep is a cornerstone for good health etc and you are going to need to drive that change before it leaks into more of your life", "Both the AH. Maybe you can ask him to move to the living room or something after his first alarm? That's what my boyfriend does. His first alarm goes off, he gets up, gets dressed and everything, then goes to lay on the couch for another hour. I hate mornings and this helps us both out.", "NTA\n\nMy boyfriend does this too, with the alarms and I've noticed if we sleep together for a longer time, I -over said time - become sleep deprived. \n\nThis isn't healthy behavior in general. He shouldn't need 4 alarms over the course of 2 hours to get up for his job. He shouldn't have to have more than one or two to get up to begin with and if he continues doing this he will be late. \n\nIt is an incredibly dumb fight, I will tell you that.. Especially since Mr doesn't see how A. It's bad for him and his sleeping pattern and B. He's not the only one in the house. \n\nIs this the first time you've mentioned it or lashed out in this sense?", "ESH. \n\nYou're absolutely allowed to be upset that his alarms are waking you up and cutting into your sleep. I would also be upset, however, as someone who also needs multiple alarms to wake up, it may be his only option if his body refuses to wake up at his first one. \n\nIt may be beneficial to sleep separately. Contrary to popular belief, sleeping apart doesn't necessarily mean you don't love each other. In this case, sleeping apart is *because* you love each other and have different necessities for a good night's sleep and comfort in waking up. Then he can have the multiple alarms necessary for his waking up without disturbing your needed sleep.", "I mean screaming isn’t ideal but I might lose my shit too if I was overtired and then woken for no reason.\n\nCan you move to another room? If he is unwilling to change how long are you willing to live like this? For me this would be a dealbreaker sounds like for you too. Is your husband aware that this inconsiderate and selfish alarm system might be the end of your marriage?", "NTA. Next time hold the first alarm directly to his ears and ask him if he hears something.", "NAH/YTA It sounds like you handled everything pretty well at first. When he threw a tantrum that made you stop waking him up, that would have been a reason for another conversation. Letting someone know how horrible they are when you wake them could help them realize and work on it. Nobody is perfect, but they can't get better if you don't give them a chance.", "100% YTA, \"ruined your day.\"   \n\n\nbeing tired makes people childish, so you were right to feel it was childish, but YTA because how you describe your issues and focus solely on yourself.", "YTA kind of. You know he wakes up differently than you so how is that his fault? You also say he's an extremely nasty man with childlike behavior and then go on screaming tirades at him. What do you actually like about your relationship? Your \"solution\" is just to change him to be like you and that is kinda toxic. On the other hand, I understand being upset at being woken up by such an early alarm when you're tired. Consider sleeping in different rooms if you have the space for it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 39 F yelled at my husband 34 M this morning at 06:00 am causing a huge fight. \n\nMy husband recently got an office job wgere he has to be there on time instead of a flexible hours job around three month ago. That's when I discovered he's the kind of person who has multiple consecutive alarms every morning and that he struggles to wake-up  on time. Me on the other hand, I am a morning person and I wake up at the sound of his first alarm even though I only have to wake up at 08:30 or 09:00 AM\n\nThe issue is that he sets his first alarm at 06:00 AM and then sets four other alarms consecutively every 30 minutes. He usually ends up waking up around 8 am everyday and going late to work, while I wake up at 6 feeling exhausted. \n\nMy first reaction to this was to calmly talk to him and ask him to set an alarm at a reasonable hour and offer to help wake him up. When I tried though he was extremely nasty, he would scream and beg and act very offended. Basically acting like a child and throwing every trick he had at me. So I stopped trying to wake him up.\n\nYesterday I was at the office untill around 09:00 PM so I was pretty tired and needed sleep so when I heard the alarm at 06:00 AM this morning I was furious. I immediately started screaming asking him why he would do that and accusing him of ruining my day. It made me even angrier that he tried to deny it saying the alarm never went off. Then he tried to give me a hug and comfort me but I wouldn't have it. I told him instead he should just stop setting the alarm at 06:00\n\nHe was very angry and when he got up he accused me of being abnormal, he said that I'm always starting fights and that I was always hurt or upset crying about one thing or the other and that he's sick of it. He said that he doesn't care anymore and that I can be as upset as I want. I told him to stop with the theatrics and set the alarm at a reasonable hour instead.\n\nI feel childish for the way I acted especially for yelling. I feel like this is a dumb fight and I'm not sure if I'm being inconsiderate because I know he has trouble waking up and it's causing him trouble at work. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Sleep in separate rooms or separate houses; this cannot continue.", "NTA, my rule with setting alarms in shared bedspace is you best be getting out of bed if it wakes me up or I'll be stealing all the blankets and pushing your butt right on out. If it wakes me it's damn well waking you.", "NTA. What everyone seems to be missing here is that this is *also getting him in trouble at work*. So clearly this whole thing isn't actually working, and he needs to be an adult and figure out how he can get to work on time and prevent you from being sleep deprived. You probably do need to sleep separately, but that's not going to fix his being-late problem.", "I’m saying NTA but also feeling guilty because I do this. Granted my situation is my partners alarm goes off at 5 and I have to wake up and pee (we have one bathroom) and then I go back to bed till he leaves for work at 6:15 and then I get up and get ready for the day. Unfortunately this has trained my body to want that extra hour in bed to relax. Getting up immediately just makes me so cranky now. So now when I wake up in the morning I need an hour in bed to doze to really feel refreshed for the day. I wonder if doing these extra alarms is doing that to him. Tbh him making it your problem by being extremely childish doesn’t help and definitely makes him the AH.", "NTA\n\nMy ex used to do this shit and it made me so mad. He didn't need to get up and drive 10 minutes down the road until 8:15 and his first alarm was at 6:30 and every 10 minutes til he got up over an hour later. His alarm was the loudest most obnoxious sound because \"he wouldn't wake up otherwise\" I straight up had to stop sleeping with him because he didn't take into account that I was waking up at 6:30 everyday and could never go back to sleep until he left, my class times were later around noon. I dont understand how people can be so inconsiderate. Even when I was working morning shift and had to leave by 5:30am to get to work on time id only let my alarm go off once and get ready/dressed in the bathroom as to make sure they could sleep peacefully. When you enter a relationship you compromise and try not to make your partners life harder", "He will be even more mad if you slept somewhere else 😂😂NTA. An easy fix but soooooo hard to toggle off an alarm. Omgggggg soooo difficult 😂😂", "He is really inconsiderate. I would be mad also. NTA.", "NTA. He can sleep on the couch or in the guest room if he wants to be offensive with his multiple alarms!", "NTA Betcha he was on time for his NEW job that morning!", "Prefacing this: Husband is the AH with how he handles his wife concerns and provlem, and I do think she is NTA. \n\nBUT saying this is not normal or common... I have to set multiple alarms like this, because my sleep is so deep, nothing else works and I have tried many different waking up methods. It's not that uncommon either for people who have very deep sleep. Edit: I don't hear my first four alarms at all, that's how deep my sleep is.\n\nI think sleeping in another room is the solution and tbh, it's generally a good concept for couples/married couples, because not everyone has the same sleep pattern and behaviour. It's not reasonable for him to not try to find a solution with her, but it's also unreasonable to expect him sitting less alarms and most likely guarantee to be late for work more than he already is.\n\nEdit: edit ³: I will strike it through once on the pc, I was informed the website quoting this info is clickbait from the website I looked at. Also, I looked it up, the average American sets minimum 4 alarms to wake up. So not uncommon.\n\nEdi²: Spelling", "\"He must change to accommodate me\" is asshole behavior lol.", "Well, if he wants to die on this hill, he better set his alarm for at least an hour later.", "ADHD is different because stimulant drinks and medication calm them. I remember 20 years ago when I was in my first teaching year, I had a student with ADHD unable to learn and stay put even though he had medication prescribed. The other's (more experienced teachers) guess was that his mother was stealing his medication to have energy (plus, the mother was a drug addict). The mother refused to send his medication to the school, so the staff would give it to him.\n\nThe moral is: usually things that give us energy, help people with ADHD to remain focused/calm.", "That would be ESH = everyone sucks here", "At first, I spoke calmly. I explained that, unlike him, I can't really go back to sleep and that it messes up my day. So we tried me waking him up, and when that didn't work, we had another conversation.\n\nHe opened up about struggling to wake up since he was younger. I suggested that he needs 8 to 9 hours of sleep, so that means sleeping around 11 or 11:30. He called me unrealistic.\n I also suggested a warm shower and a bedtime routine like going on a walk and other things that I do that help me be a good sleeper he rejected those. He basically thinks these things are stupid because the problem is psychological. I disagree because I think these things can affect each other.\n\nHe used to start the alarm at 05:30 am with birds chirping. He stopped that now. I think he feels he's giving this an effort, but like... that's not good enough. \n\nI've tried to just wake up at 06:00, but I just feel like a wet piece of toast bread 🍞 then I end up wanting to fall back asleep at 11. It's starting to really get to me because I feel like I've become grumpy, and I'm not focused at work. \n\nWhy can't we resolve this? Is it because he has a real problem I can't understand? Or is it because he feels I just need to suck it up and live with it?", "I’m not sure I understand how it works though. I can see how multiple alarms all at once increases the volume to wake you up or having a couple, maybe 10 minutes apart gives you some time to adjust to the idea of having to wake up. But how does an alarm, once every 30 minutes for 2 hours help wake someone up?  30 minutes and I’d have a shot at falling asleep again, but I’m a light sleeper don’t know what the deep sleep to awake feeling is like.  What’s the benefit for a heavy sleeper?", "Needing four alarms to get up shouldn’t need to be a thing. Try going to bed earlier (in case it’s an issue with a lack of sleep), sleeping with the curtains open so your body naturally begins to wake with sunrise or getting a different alarm clock (either louder, or one of the sunrise/daylight alarm clocks if the point above doesn’t work for you). \n\nI find too many people use mobile phones for their alarms and get too used to the tone", "Not when the behavior  is unreasonable in the first place, and is causing physical issues with other people. And knowingly waking someone up, several times, hours before they need to be awake is both cruel and physically harmful if the partner can't  get a full nights sleep. Two hours is a BIG DEAL sleepwise for some people.", "Telling someone to stop AH behaviour … is not AH behaviour.    \n\nTwo hours of alarms to wake up is ridiculous especially when your partner can’t sleep through them.", "😂", "I think it's a combination of things.\n\nI think he probably does have a real problem. It sounds like he's not great at sleeping and it may well be psychological. If he has depression or ADHD, for example, his natural sleep patterns are severely altered from what's typically considered \"normal.\" Sometimes this can be helped by medicating the \n\nBut at this point, you're so sleep deprived that it sounds like it's having an effect on your irritability. Which is not to say that you shouldn't be annoyed! You're having trouble getting the quality and quantity of sleep you need and you feel like you're going in circles on the subject with no actual change and understandably, you've finally hit breaking point.\n\nHave the two of you considered getting him a FitBit or other smart watch that can give him vibrational alarms instead of doing audio alarms? I don't know if it would work for him to wake him up, or if it would still wake you up, but it might be something to try, although a little expensive.\n\nAnother option is to sleep in separate rooms, particularly on work nights. Most people believe that not sleeping in  the same room is a sign of a failing relationship, but when people have incompatible sleep needs, the healthiest thing to do might be to sleep in separate rooms when you know the alarms are going to be an issue. You'll both get the sleep you deserve and you won't be fighting about it, and if this is the only trouble spot, you'll be better for it.", "You slightly wake up every time. For me, mine are an hour apart. I wake up, but any sleep I try to get back into will be easier to get back out of until I just can't deny waking up anymore. Going from deep sleep to awake is really hard, so having it spaced out enough where it's not continuous, but close enough together where you can't get back to as asleep forces your body to wake up*\n\n*please note that I'm not a scientist and that this is all from personal experience. I could be totally wrong about how it works scientifically, but it's how it works for me", "Neither works. Tried it all, including different clocks. Sleeping the recommended amount of 8 hours even made it worse long-term. There is also nothing wrong with me medically, I just sleep very deep. I was able to reduce from three separate devices for clocks to my phone nowadays, but I still need at least one hour to notice it's going off.\n\nThat's my solution that works for me and there's no reason for me to change it either, as long as it means I will wake up to get where I need to go.", "For some people yes, not all.\n\nOne of my exes did the whole 5 alarms thing, didn't bother me, It's not unreasonable behavior to set multiple alarms (Him) and it is also not unreasonable behavior to be upset by multiple alarms going off (Her). They are just different people, so why should her needs take priority over his? If he sets 1 alarm at 8am and then wakes up feeling really shitty because he hasn't had his 2 hour wake up period that he is comfortable with, how is that better? Either way, one partner in the relationship is suffering. They should sleep in different rooms.", "I do need 2 hour period to wake up via alarms, because I sleep incredibly deep. It's not uncommon either. \n\nThe issue is how he treats his wife concerns. Imo they need separate rooms to resolve this, because I can tell you, if you can't wake up easily, no matter how early you go to bed, it doesn't make a difference.\n\nEdit:\nEdit²: I will strike it through once on the pc, I was informed the website quoting this info is clickbait. the average American sets 4 different alarms minimum to wake up. So this is not that uncommon or ridiculous. I sleep so deep, I don't even hear the first four alarms.", "Why can't she just stop being bothered by it then? Why is it a one-way relationship? Clearly he needs multiple alarms to wake up properly so why is she right and he's wrong?", "That just sounds like you're either not getting enough sleep, not getting consistent sleeping times, or have a sleeping disorder such as apnea. You should be close to waking up on your own, without an alarm, when it's time to get up. Unfortunately most of us fall into one, two or all three of the problems above. But all those alarms over a course of 2+ hours is just going to make you more tired. Get those 2 extra hours of uninterrupted sleep and set one alarm. Put it across the room to train yourself to get up.", "Do what you need to do, but it isn’t a conducive arrangement to living with others", "Did you try the app where you get monitored at night via microphone and the phone wakes you up when you're not in deep sleep? There are a lot of apps like this although I've seen only paid ones (perhaps there are free ones as well).", "Which I said. Either find a more reasonable wake up method or move to separate rooms.", "Please show the source you have that shows the average American sets 4 alarms because that is the biggest crock of bullshit. And I mean a real peer reviewed study, not a random article with clickbait", "Needing multiple alarms over the course of TWO HOURS and still being late isn't normal. That's a bad sleeping pattern and is very bad for you. \n\nIt doesn't only disrupt the dudes sleeping pattern, causing him to be late constantly, but it's also disrupting OPs sleeping pattern who doesn't even have to get up until like 8.30 am.. Which is TWO AND A HALF hours later. \n\nIt's called having respect for your partner to not bother them with your shitty alarms.", "I have an inconsistent schedule because I work as a server, but also, one alarm has never worked for me, even when I started getting myself up in middle and high school. I'd rather do what I know will work.", "Which I agree with. I think they should have different bedrooms, not often spoken about, but quite a few couples do this, because of sleep differences. It's less stressful for both parties. Weekends can be used to sleep together if neither of them has to get up, so it can be special date nights maybe.", "I don't think I have! I'll look into it. I've done quite a few medical tests, including sleeping apnoea tests and everyone's result was just that I sleep like a rock and they can walk around me at all times when I sleep.", "It was deduced in a poll (onepoll) of 2000 Americans that responded. It's not a fully conducted study in a clinic environment, but a similar result was mirrored (by YouGov-Umfrage) in Germany that 23% press the snooze button once and 24% more than once. 1211 people responded to the German poll.\n\nhttps://studyfinds.org/snooze-button-social-life\n\nhttps://www.welt.de/gesundheit/article155784329/Stehen-Sie-frueher-auf-als-80-Prozent-der-Deutschen.html", "Oh okay he should just alter his biology to be okay with waking up the same way as her so they can live their happy, totally not controlling, lives together, great.", "I dont understand why this isn't more commonplace/acceptable. I love my partner and love cuddling and sleeping together. But I have diagnosed insomnia and am a light sleeper regardless. I love sleeping alone, I get a higher quality and quantity of sleep and dont have to listen to snoring or deal with tossing and turning.", "StudyFinds is a click bait article with no actual details of the study. It doesn’t show sample size, confidence interval, or confidence level. \n\nThe German study finds that 53% need only one alarm to rise. Only 23% use snooze once. And 24% more than once. 53% is higher and more “average” that Germans don’t use multiple alarms. The purpose of this study was also to find out when German wake up and how many use a smart phone", "He should get help so he doesn't need 4 alarms over 2 hours to still be late when doing what he has to do. This doesn't mean she's controlling him, this means his sleeping pattern is so horrific that otherwise he doesn't wake up. Which. Is. Not. Healthy. \n\nAlso if the boyfriend thinks it's controlling, nothing is stopping him from leaving.. Is it? If he has a problem he can get up out of there and also save OP the sleep deprivation.", "I don't have a partner, but I know people (ex'es too) who slept over and in the same room with me had trouble with me at night. I turn a lot, not only that, people have told me I have literally kicked them out of bed and then took up the whole bed. I occasionally talk in my sleep. Sometimes friends and family have held entire conversations with me. Which I don't remember. \n\nI sleep like a stone and I am a night owl... so if I ever get a partner, we will probably sleep in different beds at least lol Maybe even different rooms, too. Which imo is fine.\n\nSomething like this needs to be spoken about and normalised, that forcing people with very different sleep behaviour to sleep in the same room can actually ruin relationships. It's healthier sometimes to sleep in different beds or rooks to prevent this.", "Thank you for informing me about it being click bait, as I did not know that. I'll edit it out of my post, but in general, my post still remains the way it was nonetheless.", "My wife and I sleep in different rooms because her snoring is just impossible to sleep next to.", "But 53% of the Germans use only one alarm. That’s the majority so your point is also inacurate that the average American uses 4 alarms. Only 1/4 of the Germans use more than 1 snooze.  That’s not the average German", "Yeah, it's important you can sleep too lol No use trying to power through it. You both deserve good sleep!", "Yes, I get that and I have worded it wrongly. What I meant is that a German study shows similar results to my initial comment where I mentioned average American. \n\nBut either way, it does show it's not something that's ultra rare however. That was my main point, which I did not convey correctly. Even if what I said was wrong in some parts, which I admit, my initial comment still stands. People sleep arrangements can be so different that sleeping in the same room is counter-productive to their relationship and that it's okay to sleep in different rooms. I disagree with the way the husband is handling it absolutely, as he does not want to find a solution or try something else.\n\nIn my case, I have tried everything else already."]}