{"id": 12797, "submission_id": "11x14ld", "title": "AITA for yelling at a neighbors child?", "selftext": "Edit - the neighbor did call animal control, they came by and took my statement.  I told them what happened and they agreed the neighbor's dog is at fault so if anything happens it will be to them, not to me.  Still, I feel really bad about all this, I just wish it never happened.  I appreciate all the kind words of encouragement, thanks everyone.\n\nBackground:  One of my dogs (4 year old female GSD) is extremely fear reactive toward strangers and other dogs due to a bad experience at the vet when she was a puppy - her prescribed training is very short walks with some gentle exposure to strangers at a safe distance twice a day, I meet for progress evaluations with a canine behaviorist once a month.  She's improving and can mostly function in public now but still has a long way to go.\n\nToday on my afternoon walk I noticed a neighbor's 10-12 year old kid was playing in their driveway ahead of me so I brought her lead in closer and crossed the street to where she could still see him but would be far enough away that she could stay calm.  The kid noticed us and I guess decided to pick up and bring over his small, off-leash dog to say hi.  As soon as I notice he's coming my way I say \"not friendly, please stay back\" but he doesn't listen and keeps heading my way.  About 10 feet away from me he puts his dog down, it runs up to mine barking and this is where my dog loses it.  The dog is probably less than 1/10 her weight so I'm worried she could hurt it even if she doesn't mean to.  I scooped her up and throw her over my shoulder to keep them away from each other and said \"come get your dog, she's not friendly and could really hurt him!\"  Again the kid didnt respond, just stood there calling his dog's name.  I lose my patience and yell \"GET YOUR DOG RIGHT NOW.\" He then picked it up and ran back inside his house.  \n\nAbout 20 minutes later his mom came pounding on my door telling me I had no right to yell at her son.  I apologized for scaring him and tried to explain that I was just trying to keep him and their dog safe but she wouldn't listen - said she's going to call animal control and get my dog euthanized.  My county requires all dogs to be on-leash in public - mine was, theirs wasn't so I'm not too worried about her threats as they were unquestionably the ones legally at-fault, but still - AITA here?  Thanks everyone.", "created_utc": 1679357919, "permalink": "/r/AmItheAsshole/comments/11x14ld/aita_for_yelling_at_a_neighbors_child/", "score": 96, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action to be judged is yelling at a neighbor's child when he tried to introduce his dog to mine without permission.  It might make me an asshole because I feel really bad about it and now his parents are furious.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If animal control pays you a visit, make sure they know your neighbor's dog was off leash and yours was on a leash. The kid and mom need to learn to respect other dog's and give them space, especially when someone is literally telling you the dog isn't friendly. The kid could've been hurt, their dog couldn't been hurt, etc.", "NTA \n\nyou communicated clearly. Reactive dogs can be very dangerous, you did what you did to protect the kid and the other dog.", "NTA. Absolutely not your fault. I used to have a dog like yours. And everyone and their mother thought no matter how much I warned them, it was ok because THEIR dog was friendly. Yeah, well mine isn't. STAY BACK. Your neighbor needs to back the hell up and teach her son better.", "Of course NTA\n\nYelling is for danger. It's the time you can rightfully yell, to make someone understand that they need to act *now* to keep themselves and others safe.\n\nYou achieved that with your yelling. You were in control of your dog and keeping everyone safe from her. You got the kid to keep his dog safe. That's exactly what needed to happen. \n\nThis idea that everyone else's dog should be a friendly happy friend to every stranger around them everywhere is a recent thing and also ridiculous. It's just not how dogs work all the time in every situation. \n\nWhen I was a kid we were taught not to run up to strange dogs and how to approach a dog safely, knowing that they may or may not want to interact with us or our dogs. \n\nIt's complete BS that so many people now think that their precious little kid should be able to treat any dog in any public space like a plushy toy that's there for their entertainment instead of a real dog who acts like dogs may do. And it's dangerous for kids to be being taught that.", "NTA. You told the kid to stay away and the kid refused to listen and continue to come closer and then letting his dog loose. Better to yell at the kid versus an injured kid and his dog and a potential lawsuit. If she reports you, report them back. You abided with the law, they didn’t.", ">I had no right to yell at her son  \n\nNTA - At least she still had a functioning kid to worry about because of your actions.....some people are fucking crazy....", "NTA. You handled the situation correctly.  You screamed ONLY to save everyone involved from being hurt.  This is exactly what needed to happen to get him to move.  \n\nIt is worrisome that the parent can't explain this to the kid.  The kid would learn to assess intent and situations, act without panic, understand others, have an understanding that he is not bad, and still maintain a good relationship with the neighbor.  Instead she is teaching her son to believe that everyone needs to yield to his behavior regardless of the circumstances and none of those things will exist.  This doesn't bode well for his future.", "NTA You TRIED to tell the kid, he kept ignoring you, so shouting was evidently the only way to get him to LISTEN and get his dog. You may want to let things calm down for a few days, then go over and calmly explain that your dog is actively being behavior specialist trained due to incident xyz, and in order for your dog to advance to being less reactive there are things that your neighbors can do to help and teach them they CANNOT APPROACH your dog, PERIOD. I don't know if this will help, but if you talk to SEVERAL of your neighbors about it, don't mention the confrontation or fallout with other neighbor's kid and the mom, just as a \"trying to avoid an incident and would appreciate your cooperation\" kind of talk...the more people that know, the more your reactive neighbor who got in your face will hear about it and then maybe she can pause and think...\"oooohhhh, my son approached HER with MY dog off leash, my kid was WALKING INTO DANGER\".  \n\nThen again, hope springs eternal for me and it doesn't always align with reality, but it wouldn't hurt to try. At least you'd know you gave your neighbors the information THEY NEED to prevent an incident and to also help you with your doggy behavioral therapy. Good luck, I know you love your dog, you are being a GREAT pet parent by doing everything you can to make sure dog is rehabilitated and doesn't cause harm and that is no small thing. Thank you for being a responsible pet parent. \n\nI wish every person with reactive dogs would take the time to learn about and train their dogs. It helps the dog feel LESS ANXIOUS as well, dogs should not feel anxiety, and if they have trauma that creates it, WE have the responsibility to help them and train them to overcome those reactions and help them feel safe, secure, calm and loved so that the trauma can become a distant memory for them, and they can just live their best doggy life without anxiety.", "NTA - the kid is more than old enough to listen, you made it clear for him not to come over but he didn't listen. counter sue her, she is the one at fault", "NTA. You did what you could to control the situation. Mom needs to stop and listen to what you are saying for a minute to understand the danger her child put everyone in by not listening.", "NTA. The kid didn't listen. The mother should teach her kid better. You did nothing wrong.", "NTA and what the hell is wrong with people?", "Not at all.\n\nIgnore the moron in the comments saying yta, because you're definitely not. \"... don't yell at children.\" Children are dumb and this one clearly wasn't comprehending the seriousness of the situation. If yelling at it's stupid self was the only way to get your words through its thick skull, so be it.", "NTA. Get cameras, though.", " NTA but honestly that little boy didn’t tell the mother the truth. Kinda hope she calls and they at least speak with you and listen and then talk to her. Her son putting his dog and himself at risk by approaching a stranger and their dog and not listening to warnings could really get him hurt. I would’ve yelled too!", "NTA. You warned him to stay away and only yelled to make sure he understood the danger. Her threatening your dog was way out of line. She wasn’t even there. You did nothing wrong.", "NTA\n\nSome people just can't get it through their heads that even though their dog is little and cute (or a puppy--we had a post about that yesterday), leash laws apply to everyone, not just the big \"scary\" dogs. You were doing the right thing to have your dog leashed. The kid had his dog off leash and even after you warned him without shouting, didn't listen. You acted quickly to prevent anyone from getting hurt, which required raising your voice. Definitely NTA.", "NTA, you had to yell for the kid to finally listen. His mother probably didn't hear the truth that you told the boy over and over calmly to get his dog away. You did what you needed to do for everyone's safety.", "NTA. You yelled at a child out of fear for that child's pet, the same someone might yell at a child that is about to do something dangerous. It comes from a good place, and the way you handled things before was more than good.", "NTA . Fuck them kids", "I would NOT talk to the Mom again but if the kid's Dad is around I'd go have a conversation with him.\n\nExplain what happened to HIM not her. Keep it fact based, clear and concise. Not agressive - just fact based, clear and concise. \n\n\"Hey, I just wanted to let you know X happened while your boy was out.\" Spell it out. \"I hope I didn't scare him but I was concerned that your dog was going to get injured and your boy wasn't retrieving his dog so I yelled to get his attention.\" Quite honestly I wouldn't say anything about your dog's reactivity - just that your dog is not yet friendly towards other dogs and in the interest of all dogs' safety you'd appreciate if he would explain to his son that not all dogs are friendly towards other dogs.", "NTA.  You gave a command told child to stay back. Child did not listen.   Your dog is big and can become dangerous in the right situation.  You are doing the best you can to make him more friendly and social.", "NTA.  This was a safety issue and you were not deliberately chastising the kid for no reason.", "NTA - child would have been a lot more traumatised by seeing his dog killed or badly injured. You did everything right. If mother comes back round, point out to her that she left her child in charge of an unleashed dog without recall. That is a much bigger breach.\n\nCheck with neutral neighbours if any CCTV", "NTA.\n\nThe other option was the small dog getting attacked? Yeah. NTA.", "NTA.  You know your dog's behaviors, and how they react.  You are being a responsible owner, the kid wasn't, you tried reason, and had to resort to yelling to get the other dog safely away.  Frankly, unless the owner knows you and your dog well, and how they'd react, they should have asked if they could come over and say hello.  (Even though I totally get wanting to be the puppy.)", "NTA. He should have listened to you and not come closer to begin with.", "NTA \n\nYou did the correct thing controlling that situation. I've had similar loose kid and dog interactions and I have also needed to firmly raise my voice to convey that it is not time to fuck around.", "NTA. But call child protective services on her lol. Like Gandhi said, an eye for an eye", "This is a tricky one, but I think I'm gonna go with the safe ESH.\n\nYour dog reacts differently to interactions. You know this, and are actively trying to help it while simultaneously keeping others safety in mind. When the kind brought his dog up, you let him know multiple times to stay away.\n\nBUT, this is where it turns dicey. You yelling at the kid sure, got the job done, but the situation was no longer dire. You had your dog, and the kid was trying to call his. The yelling was unnecessary, and the kid committed no crime accept being kind of clueless. That's the only reason I consider you a ***very*** slight asshole. \n\nAs for the mother, her actions were also justifiable up until the end.  she didn't actually see the incident, and kids being kids, the story was probably exaggerated through staggered breathes of crying and explaining. But the moment she threatened to have your dog harmed was when she went from Mama Bear to Asshole Possum. I doubt she will follow through with her threats, but be prepared in case she does.\n\nI wish you and your dog luck on your journey regarding healing his trauma from the vet!", "YTA. Control your dog and don't yell at children.", "On the one hand, I think it's admirable to put as much effort as you're putting in to heal your dog's trauma. On the other hand, if your dog can't be trusted not to hurt another dog in a fairly ordinary kind of encounter, then you've got a problem. Yes, the other dog should have been on a leash. No question. But yelling at a kid because your dog is \"reactive\" is a bit much. When you're on a public street, unpredictable things can happen. So either walk your dog early in the morning and late at night when you won't be as likely to encounter others, or stick to the backyard if you have one.", "INFO:\n\n>As soon as I notice he’s coming my way I say “not friendly, please stay back”\n\nIs that the only time you attempted to warn the kid?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground:  One of my dogs (4 year old female GSD) is extremely fear reactive toward strangers and other dogs due to a bad experience at the vet when she was a puppy - her prescribed training is very short walks with some gentle exposure to strangers at a safe distance twice a day, I meet for progress evaluations with a canine behaviorist once a month.  She's improving and can mostly function in public now but still has a long way to go.\n\nToday on my afternoon walk I noticed a neighbor's 10-12 year old kid was playing in their driveway ahead of me so I brought her lead in closer and crossed the street to where she could still see him but would be far enough away that she could stay calm.  The kid noticed us and I guess decided to pick up and bring over his small, off-leash dog to say hi.  As soon as I notice he's coming my way I say \"not friendly, please stay back\" but he doesn't listen and keeps heading my way.  About 10 feet away from me he puts his dog down, it runs up to mine barking and this is where my dog loses it.  The dog is probably less than 1/10 her weight so I'm worried she could hurt it even if she doesn't mean to.  I scooped her up and throw her over my shoulder to keep them away from each other and said \"come get your dog, she's not friendly and could really hurt him!\"  Again the kid didnt respond, just stood there calling his dog's name.  I lose my patience and yell \"GET YOUR DOG RIGHT NOW.\" He then picked it up and ran back inside his house.  \n\nAbout 20 minutes later his mom came pounding on my door telling me I had no right to yell at her son.  I apologized for scaring him and tried to explain that I was just trying to keep him and their dog safe but she wouldn't listen - said she's going to call animal control and get my dog euthanized.  My county requires all dogs to be on-leash in public - mine was, theirs wasn't so I'm not too worried about her threats as they were unquestionably the ones legally at-fault, but still - AITA here?  Thanks everyone.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "Your dog should be muzzled for safety while walking.", "NTA you saved her dog and her child from a nasty situation. Anyone who has responsibility for a dog must learn not to let them run up to other dogs. Animal control absolutely 100% will not take your dog and put it down. You were the responsible owner with your dog on a leash. She allowed her off-leash dog to leave her property and engage with another dog. She is at fault.", "NTA. You were trying to keep everyone in the situation safe and the kid being a kid wasn’t listening and probably didn’t understand the severity of the situation.", "NTA but I want to also suggest working on muzzle training your dog so in the future if someone, like a kid and their off leash dog, cause a reaction that you don't need to worry as much that your dog might cause harm. You can't control what others do but you do have control over this one aspect. Again you weren't in the wrong at all but just wanted to suggest it as I know a few people who it helped a lot.", "Nta. Neighbor is an idiot. She might want to teach her kids how to leash her dog.", "> extremely fear reactive \n\nAggressive. You have a aggressive dog. Why is it not muzzled?\n\nThe kid and his mother are simpletons but there wouldn’t be any danger if you weren’t parading an aggressive unmuzzled dog around. You may not be quick enough to react if a loose toddler comes running to pet doggie.\n\nYTA. Muzzle your barely controlled dog.", "[deleted]", "This is definitely not about control. They had their dog under control and leashed. The kid didn’t listen to a potentially very dangerous situation and got yelled at to literally pick up their unleashed dog after several attempts. \n\nFuck around and find out. \n\nOP is NTA.", "the kid was in the wrong not the dog.", "Let them get eaten when they refuse to listen.  Same if they are about to touch a hot stove or walk in front of a car.  Don't you dare yell at them. Let them be.", "She was. Her dog was on a leash. The little brat had is off leash. She gave a warning, stupid kid kept coming. Kid deserved what kid got. Learn to stay away from others and their dogs.", "Would you please expand upon how I shouldve controlled her better beyond what I outlined in the post?  Keeping her home and isolated from triggers is off the table as that makes fear reactivity worse, also just for more context the incident occurred around 2pm - I live near an elementary school that lets out at 3 so I like to walk her at times when there's less of a chance of kids rushing her, but unfortunately it's difficult for me to predict days when other people's children don't attend their classes.  Thanks in advance, I really do appreciate your insight.", "it’s almost like she was told by a behaviorist to train the dog by walking her near people…", "Ya, dogs are just property. Next time OP should let her snack on the tiny dog instead of yelling.", "I warned him twice with a calm voice before resorting to yelling.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "She is.\n\nEdit - just realized this may be helpful.  On walks she wears a bright orange reflective vest with 'do not pet' badges on the sides, a safety strap that attaches to her collar in case she slips the harness, and a muzzle.", "Honestly? I'm not a fan of yelling at kids by any stretch of the imagination but I can absolutely see my son freezing in a situation like this until the adult yells at him to come get his dog.", "The adult with an aggro dog they can't control, out in public, is in the wrong. The kid is just a kid. Adults are supposed to handle that kind of thing. That's why we make a distinction between kids and adults. And that's why we call out adults when they don't carry their weight.", "Yes. And she clearly lives in a neighbourhood with children, where children do children-like things. So \"gentle exposure to strangers at a safe distance\" isn't necessarily a reasonable expectation all the time.", "No, that’s not even remotely a good comparison. \n\nLet’s break this down. \n\n1.) the owner is taking steps to ensure safety of the dog, the owner and others around it. \n2.) the owner is taking the dog to get trained. Actively being a responsible owner. \n3.) the owner of the dog is telling and warning the kid not to be go around a non friendly dog. \n\n\nIn which way is the dog owner irresponsible? \n\nIf you wanna blame an adult it’s the parent of the kid. Not paying attention to their child about to get into a bad situation. \n\nIt’s like letting your child run on a wet floor with a caution sign saying “wet floor do not run”. \n\nYour logical is dumb.", "OP did control their dog and they did handle it. \n\nThe kid's parent on the other hand thinks their dog and their kid should just be able to run around doing whatever even when it puts them at risk. \n\nThe person who needs to control their dog is the parent of the kid, who also needs to teach their child not to accost stranger dogs.", "The mom should be a real mother and teach her kid to not walk up to someone else and listen if they give the warning. 🙄", "Mate, judging by your post history your keyboard doesn't have a Y T or A printed on the keys  anymore.   \n\n\nWhy haven't you commented on the fact said child was out with the dog on it's own? Not gonna call out the kids mom? That'd be too easy. Now do something constructive, like taking your face for a shit.", "YTA. Fuck them kids", "LOL", "Nta god I hate entitled parents! I have 2 boys in that age range and if someone told them not to come close because their dog wasn't friendly they would listen. After the second and third time when craps hitting the fan anyone in your situation would lose their calm because you know what the stakes are. The fact that she didn't even attempt to get both sides, because I doubt the son's recounting of the event was factually accurate, she escalated to the nuclear option like a dolt. She should consider teaching her son about boundaries and get a tie out for her dog who's apparently as oblivious as her kid.", "NTA", "NTA.  She should have had her dog on leash and you should not be expected to hold an \\~80lb dog over shoulder.  If the dog has such poor recall why is it out in the care of a child?", "I have the same experience with one of my dogs all the time! Off-leash dog comes yapping at my leashed (and very closely held) dog. Other dog's owner says, don't worry, my dog is friendly. I smile grimly and say, well, my dog isn't. Only then does the other owner get the hint because apparently the fact that I'm holding onto my growling/barking/lunging dog for dear life isn't hint enough. Drives me crazy!", "I hope you didn't write this comment on a work computer ...", "What's a \"work computer\"", "Alternatively, perhaps the kid's mom should do a better job keeping an eye on her kid AND unleashed dog. Don't we still teach kids not to approach strangers...?"]}