{"id": 12910, "submission_id": "11yhprt", "title": "AITA for telling my wife to stop asking me to go to church", "selftext": "AITA for snapping at my wife and telling her to stop asking me to go to church? My wife these last few months has been on this spiritual journey thing and she has started going to my sisters church. Background on my sister church they are your typical Christian people (God is great, you are bad and if you don’t repent you are going to hell, if my god offends you then that’s your fault, blah blah blah) I grew up in church when I was younger so I know how religion works with the pray it away and have faith but don’t forget to tip god your 10 percent on a free tax me Sunday money. So ever since I was younger I disliked the idea of religion cause really who knows what happens when they pass. I believe more in the “let people live how they want and if they die and face judgement on the other side then so be it” but I’m straying away from the subject. So she asked me the first day she went and I said no thank you, I don’t feel the need to step into a church ever again. So then she asked me again 2 weeks later and I told her again no thank you and please stop asking. I don’t want to go. She asked me again a week later and I started getting frustrated because I already told politely no 2 times so I just snapped and told her to stop asking me I’m not going. She asked me again today and I kinda just blew up and told her “I don’t know what spiritual battle thing you have going on but it’s something you have to deal on your own because I’m not going to that stupid ass church.” I feel bad cause I snapped but at the same time I’ve told her plenty of times no and to stop asking. Aita? \n\nEdit: we have had talks in the past about how I felt about church and religion and she was okay with never going and just keep religion out of the home but now she’s pushing for us to go.", "created_utc": 1679488404, "permalink": "/r/AmItheAsshole/comments/11yhprt/aita_for_telling_my_wife_to_stop_asking_me_to_go/", "score": 2863, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I’m the asshole because I snapped at her and told her she needs to deal with whatever she’s dealing with on her own but at the same time I don’t think I did anything wrong except create a boundary and enforce it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - your wife is though. She should have taken your “no” the first time and not asked again. Since she’s your wife I assume y’all have had discussions about religion before so she should understand your viewpoint and let it go", "NTA. Why on earth does she keep asking if you’re clearly declining? How annoying.", "NTA.  You politely told her no twice and asked her nicely to stop.  Having people ask the same question multiple times and expecting a different answer are annoying.", "NTA. You clearly said no and told her to stop asking and she carried on. I understand the frustration of having to repeat yourself numerous times. There are plenty of couples where one is religious and the other isn’t and it works as long as everyone’s boundaries are respected. - hopefully it can be the case for you guys somewhere down the line.", "NTA.\n\nI agree that once you told her not to ask again, she should have stopped asking.\n\nHowever, I think you need to come to terms with the fact that your marriage will be ending soon. If she's as involved as you say she is, she will likely decide that it's not good to be \"yoked with a nonbeliever\" (paraphrase of II Corinthians 6:14).\n\nI don't say this as a way to try to coerce you to go to church, \"If you don't go to church, your wife will divorce you!\" (You wouldn't be sincere anyway, if you went to church because you thought it would be the only way to save your marriage.) I'm just saying that, this scenario plays itself out often. When one partner discovers religion, then they decide that the other partner needs to be traded in for one who shares the faith.", "NTA.  I hope this does not escalate to the point where her sister and church become the prominent thing in her life.", "NTA. One of my biggest pet peeves in life is when people don't let you say no, and break you down until you say yes. \n\nYou were very clear that you have no interest - she's trying to wear you down. \n\nSnap at her every time going forward. Tell her to repent for how badly she's treating you - ok totally kidding but that'd be funny lol", "Definite NTA and it's hard to see how this won't become a big issue in your marriage. If your wife goes down this path, it SEEMS that part of this path is about recruitment. Even if she agrees to stop recruiting YOU are you going to be ok with that being her agenda in every social interaction the two of you have from here on out? \n\nI don't mean to vilify your wife - marriages can work in which one person is religious and the other is not. But you would need to be able to reach some agreement in which you don't get in the way of her own personal journey or religious habits and she doesn't let it impact the dynamic within your relationship or with other people. There may be other specific topics you also need to sort out, such as if you donate monetarily to the church, and other values and philosophies, but I'd start with the recruitment issue.", "NTA. Church is weird and I would respond the same way if someone kept insisting that I go.", "NTA. I am sorry to tell you this but your relationship is probably doomed. Your wife has entered a socially acceptable cult that does not permit her to see anything in shades of grey. She asked, you said no. She asked again, you said no. You now have the first two data points in what will almost certainly become a pattern until one of you breaks it.", "NTA. Politeness ends after you got your answer the first time.", "This might eventually cause the breakdown of your marriage, unfortunately. NTA but your wife is and likely will become more of one - if she gets to a point where she truly thinks you’re going to hell because you aren’t going to church or on the same spiritual journey, that is wedge between you will be insurmountable. \n\nYou cannot have a healthy relationship when one person is trying to save the other person from a thing they don’t want to be saved from.", "NTA it’s ok for people to have their fandoms but it’s not ok to try to pester someone else into joining.", "NTA - Also, I feel this is going to get bigger for your wife. You need to sit her down and discuss what she is needing from the church, what she needs from you, what you need, etc. Things may be brewing towards irreconcilable differences, her finding someone within the church, etc.\n\nI'd also watch very closely to finances. I'd hate it very much if the money I earned was funding a religious organization, but finances get tricky if they are pooled together.", "Nta. Ask her if this ‘spiritual journey’ is worth your marriage.", "Whew. I have a mother like this. Her response always is, \"I'll keep asking because you might change your mind sometime.\" Next time she was at my house I had a cheap bottle of whiskey ready. She hates whiskey. Can't stand it. So I poured a shot and put it in front of her. She asked, \"What's this?\" I replied, \"whiskey.\" She inquired why, as she knew I know she doesn't like it. I said nothing and just went out and poured a second shot and placed it in front of her. Same response. Same from me off ignoring her displeasure. This continued until she had 5 shots in front of her. When she now, severely displeased, asked me what I thought I was doing, I got a sickeningly sweet smile on my face and replied, \"I'll keep setting these in front of you because you might change your mind.\" My dad chuckled. She never asked about church again.", "NTA\n\nBut if you don't go how will she ever save your soul from the fiery pits of hell?\n\nIn seriousness though it sounds like her particular brand of religion doesn't leave a lot of room for non-believers. She is going to keep asking you because, in her mind she is trying to save you.\n\nI decided a while back that I don't have time in my life for people that think I should go to hell (however they envision it). I have had one exception to my rule, my grandmother, and that is because she became obsessed way before I met her and I think there is no hope for her to change. Even she, however, had the courtesy to not try to pressure me to go to church (eventually).\n\nThis might sound like an overreaction, but if your wife cannot truly accept that you are non-religious, and that it is *okay to be non-religious*, then you might be incompatible. You deserve someone who accepts you.", "NTA. She needs to accept your no for an answer and respect your decision. \n\nIf anything, she could just say that you're welcome to join her if you ever change your mind, but that's about it. \n\nAsking over and over again and expecting a different answer is being pushy and disrespectful.", "NTA.\n\nAs an atheist myself, I've met people trying to change my mind - even trying to push me to go with them just to \"see what is like\". I have the freedom to not believe and I would never try to force someone to change their mind when it comes to religion, it is in their freedom to do what they want as long it's not hurting someone.\n\nThis can be applied to you and your wife, you said no plenty of times and yet she ignored it until you got so frustrated you snapped at her, that's a consequence to her actions. You never questioned but respected her decision though you have all the freedom to not go with her. Most religions talk about giving respect to people and spouses, looks like she's not really following those rules that much.\n\nWhile I would apologize for snapping, she needs to understand not everyone is a believer and no is a complete sentence, she's free to believe, you're free to not believe. Simple as that.", "NTA\n\nI cannot stand people trying to force their religion on me, there's absolutely no way I would have been as polite as you or as tolerant. \n\nIf she can't respect your answer, then this is a problem you're going to have to have a strong discussion about until she at the very least understands that she needs to stop asking.", "You don't understand! Your soul needs to be saved, dude!! How can a simple \"no\" stop her from saving you? You are a sinner, but there is HOPE for you, if you just stop pushing away the ppl trying to save you. I think she needs to involve her pastor in this, since she alone can't get through to you, sigh. You are a hard case, but if you are just willing to let jesus save you, all will be good and you will become a very strong believing member of gods holy family. Don't give up on yourself my dude, there is help waiting for you in this church. \n\nNTA ;)", "NTA. You said no and she needs to take that answer. Maybe ask why she’s pushing it so hard, but you don’t need to go. Possibly get something in place in case the “if you don’t go I want a divorce” thing happens like an emergency contract for separation.", "Invite her to do something she doesn't want to do for 2+ hours after having to get dressed up. \n\nChurch?!? Sure right after you caddie for me. Oh you don't want to spend hours of your day bored and all dressed up? Funny how that sounds eerily relevant to my Sunday morning interests.\n\nNTA", "NTA i dont get the N A H votes, she knew your stance on religion, you asked her to stop asking politely, yet she keeps pushing and pushing, its legit to snap and be a little less nice about it when you get disrespectes, it being about church is zero excuse on her side, frankly i think it makes it worse", "NTA especially with the context that you have had these conversations in the past, it’s extremely rude to try and force religious beliefs on someone. Protect your peace.", "NTA. You've said no politely twice, not politely once after that, and now you were rudely blunt. Personally that's at least 2 more chances than I'd have been able to be nice.", "NTA.", "NTA. Churches like that prey on women to “lead” their husbands to church with them and shame them if they can’t.", "NTA. I would be annoyed too.\n\n&#x200B;\n\nYou might want to reiterate to her that you don't care if she goes and are happy that it makes her happy, but you will not be joining her. I say this mostly to emphasize to her that you're not going to judge her for finding happiness there, but that it is something she will be doing without you.", "A lot of times church fanatics will not take no for an answer. They are taught to keep pushing until that no becomes a yes. \n\nThe only way to deal with people like that is to be rude and direct. Politely declining is more of an incentive for them to push and prod until you get so annoyed you just say yes to get them off your back. \n\nNTA. But you need to realize your wife probably won’t stop trying to “save” you.", "NTA.\n\nYou've been civil and polite and it isn't working. What she's doing is not ok.\n\nI don't know what kind of church/cult she's gotten involved in, but given her level of pushiness and disrespect I'd keep a very close eye on finances (make sure she's not \"donating\" your savings to her cult).", "NTA y’all will be considered “unequally yoked” and all of her friends will be praying for your soul and how hard it is on her to be married to a non believer. Expect a bumpy ride", "NTA\n\nBut it may be time to sit her down and say that this is a hard boundary for you.  You will never be a part of her new church and if she doesn't stop pushing you to go when she knows how you feel, then it may be time to seriously consider what that means for your future and if she can be happy with someone who doesn't have the same faith.  You haven't said anything negative about her faith (hopefully), so she needs to be able to respect that you are no longer a religious person.  If she genuinely can't respect that you don't want to go to church anymore, then you may no longer be compatible together.\n\nFaith is about your -personal- relationship to what you believe in and how it potentially enriches your life.  Not just showing up at a building and giving money to a business that profits off of believers.  If her faith requires that she convert you to please these people because thier opinion matters more to her than you, then you may have to go your separate ways.", "This is only my opinion, and probably not  popular. Organized religion is a business. Churches basically tell you that they're the gatekeepers of heaven, and you have to pay to get in. I also believe there's a difference between being religious and being spiritually aware.\n\nNTA. This subject was previously closed with both parties in agreement. Your wife didn't keep her promise to you. I'm glad you recognized that snapping at her wasn't the best reaction. The only thing you can control is you and your emotions. Maybe you could tell her if you ever change your mind, you will let her know. I wish you the best, OP.", "NTA - your wife is probably being told to ask you. It's pretty common to be told to \"have faith and trust in the Lord. Don't be swayed by a No! Let him see God's Love in you.\" They believe that if she keeps asking one day, you're just gonna break down crying and go.\" Oh God, how did you know?!??! I've been waring with myself for so long! Thank you for NEVER giving up on me. \"  It's a song and dance I've heard and seen my entire life. \n\nProstilizing is the \"duty\" of a true Christian cause you're not a Christian unless you've left the Holy Bible imprinted on their forehead. \n\nIf it were me, I'd say this. \"Thank you for carrying about my soul, but it's my soul, and I'm allowed to treat it however I want. I respect your passion on the subject, but I have no interest in Church, and if I change my mind, you'll be the first to know.\"", "NTA. You told her politely 3 times to stop.  When politeness doesn't work, it's time for bluntness.", "NTA.\n\nYou should not need to repeat yourself this many times. No is a complete sentence.", "NTA. Your wife sure is though!", "NTA", "NTA. Your wife is for trying to push her religious agenda on you. And I wouldn’t be surprised if she is getting pressure from your sister and other church members to bring you back.", "NTA. I have been an atheist for many years. I do not date people who have religious faith for obvious reasons. If my spouse suddenly found Jesus and then started pressuring me to find Jesus that would be a dealbreaker and the marriage would be over.", "NTA, it's absolutely okay if you don't want to go to church and you have made it clear multiple times to not ask you. If she asks again, try to have a calm conversation with her as to why you don't want to go and that she needs to asking.\n\nIn regards to the edit, allow her to express herself when it comes to her beliefs, but make compromises and boundaries. It's important for her, so it'd be good to allow her ways to keep it close to her, but make sure to talk about boundaries when it comes to your home.", "NTA for deciding what you do or dont do with religion.  Info missing from your post is whether you’ve had the conversation with your wife on your past experience with church and what’s driving how you feel about church now ?  Or do you just decline to go ?  If you’ve explained everything calmly and wifey keeps asking, then it can be understandable you recently got impatient.", "NTA. You can only bend a tree over so far before it finally snaps and you snapped. Your wife needs to respect your answer of no and move on. If she won't respect that, then I don't blame you for snapping at this point.", "NTA. She can go on her spiritual journey, that’s fine. When it becomes not fine is when she starts pushing that shit onto anyone else.\n\nShe needs to respect your boundary, period.", "NTA.  Just tell her you decided to give church another chance and you want her to attend with you.... at the Satanic Church. And then continue to ask her every time she asks you. \n\nBut on a side note, be prepared. I have seen multiple marriages end when one spouse becomes overly religious. I have lost a few friends myself. ( I don't believe in the church)", "NTA - she sounds like those Church of Latter Day Saints that go door to door despite being told numerous times and probably threatened, yet still go out. She's being indoctrinated into that church. (Read brainwashed) \n\nNot much you can do at this point. Except maybe every time she asks, ask her to attend a Satan worshipping group with you. You both politely decline.", "NTA..\n\nYour wife doesn’t seem to want to hear the word No…\n\nReligious or not, that’s just plain disrespectful, especially since you both have talked about your views on church and religion, etc.\n\nSome people don’t want to hear the word No unless it’s yelled at them and if that’s what it takes to get that through your wife’s head, then that’s what it takes. You have nothing to feel bad about OP. She disrespecting you so of course you snapped..\n\nIf this insistence on her part doesn’t stop, you may want to consider marriage counseling for you both…", "NTA\n\nNo means no, on any matter. She can ask if you've reconsidered sometime maybe, but repeatedly asking within a week or two of being turned down, especially after you've discussed this topic before and made your feelings known, is an AH move.", "NTA, she's a typical Christian who can't accept that people have different beliefs than her and wants to pressure you into conforming to hers.", "nta consent is a 2 way street maybe you should send her something which explains the concept of consent", "NTA, sit down apologize for snapping at her.  Tell you have discussed your feelings about church before. Her asking you to go is beyond annoying and to stop asking you.  Tell her this is a boundary for you, that she is disrespecting you by continuing to ask.  You will let her no if that changes.  You have no problem with her going, but your at peace with your decision.", "NTA ibhate it when churchy people get all pushy. Just live and let live, man. This is her spiritual journey, not yours! She doesn't need to pressure you into it too.", "NTA  She is probably being pushed to bring you by the other members of the church. Couples therapy might be called for, there is an unaddressed problem that your wife felt she needed to suddenly start going and has taken everything they say to heart without question.", "NTA, but your wife is. She's has some sort of religious renewal, and it's very common for people in her situation to try to share their \"awakening\" and \"good news.\" With others.\n\nDon't fight. Just keep saying \"No, and I'm not discussing it\" and change the subject.  If she pushes, walk away. Repeat as necessary. You have my sympathy.  My ex got like that when he started going to AA. It's maddening.", "NTA. You've already told her no several times. I'd have snapped too.", "NTA\n\nNormally, if you hadn't had previous negative experiences with a particular religion, or some sort of trauma related to that religion/identity... I tend to suggest accepting an invitation to visit. Not for the religion, but for the relationship with the loved one who is inviting you. \n\nI'm Christian, my next door neighbor is Muslim. She's invited me to her mosque. I've invited her to my church. Neither of us was attempting to *convert* the other, but rather to share experiences.  We both learned things. I will not hesitate to say, I probably learned more than she did. It made us closer, because there's that little bit of understanding.\n\nA couple of years ago, I found a new home church. My teen was 11 or 12 at the time (then agnostic, now atheist) and did not normally go to church with me. However, I was excited. I'd discovered something important to me, and I wanted to share with people I love.\n\nMy child went to the service, said they were happy for me, and that it was \"interesting\" and \"not bad\", but it wasn't an experience they'd want to repeat. They can now visualize the people and the place I'm referring to if I mention something that happened there. My kiddo has questions sometimes: \"Oh! Is that the lady who said I was 'too precious'?\" and we can communicate better because of that.\n\nThat said... none of these places I've referred to are the level of judgemental to which you've indicated your wife's church ascends. And you *do* have previous negative associations with Christianity.\n\nIn light of that, I think this:\n\n>So she asked me the first day she went and I said no thank you, I don’t feel the need to step into a church ever again.\n\nWas perfectly reasonable. Especially since you've discussed it before.\n\n>So then she asked me again 2 weeks later and I told her again no thank you and please stop asking. I don’t want to go. \n\nThis attempt, I'd likely have written off as your wife, who loves you, wanting you to have the same joyful experience she'd had. And your response as perfectly appropriate/legitimate.\n\nAt that point, in your wife's shoes, I would likely have said something like, \"well, it's an open invitation, if you ever change your mind,\" and left it at that.\n\n>She asked me again a week later and I started getting frustrated because I already told politely no 2 times so I just snapped and told her to stop asking me I’m not going. \n\nThis was pushy and inappropriate on your wife's part. And your frustration and your reaction are understandable. Even if your tone was a bit harsh, I think it was justifiable, and you didn't say anything inappropriate.\n\n>She asked me again today and I kinda just blew up and told her “I don’t know what spiritual battle thing you have going on but it’s something you have to deal on your own because I’m not going to that stupid ass church.” \n\nYour wife crossed a line here. She's definitely ignoring your boundaries. \n\nThe only (mild) fault I can find in your response is the:\n\n>stupid ass church\n\nI can see how your wife might feel like that was a personal attack on her belief and her community, rather than on her behavior. However, we have an increasingly reduced obligation to be polite/courteous when someone is consistently being discourteous to us. I feel that reply was... if not necessarily \"justified\", at the very least understandable and not too over the top in light of her seeming inability to accept a polite \"no\".\n\nI don't think you were an AH. I think your wife *was* being an AH, though not deliberately. I think she's probably being over-zealous because... well, it can be like that when you first find faith. That said, just because she doesn't have ill intentions doesn't mean she's not an AH. \n\nSo... yeah... you're NTA.\n\nBut... as some of the other comments have pointed out... there is scripture about relationships in which you are unequally yoked. And depending on your wife's belief set, she may feel like your attendance in church (at least superficially) is now necessary for her to remain with you. \n\nThat doesn't mean you have to go with her. Sometimes people change and grow apart. \n\nI might have suggested going once just so she'd feel you tried, if she hadn't been so ... pushy... about it. I think if you *went* just once, now, to keep the peace or whatever... she'd feel like she \"won\", and it would cause *more* issues with this in the future.\n\n> I feel bad cause I snapped\n\nBecause you feel bad, I'd address that. I might suggest setting a boundary during a day that's *not* a church day. Have a sit down conversation and say something like. \"I regret snapping and my word choice, but I will not accept having my boundaries ignored. I will not be going...\" blah blah, whatever else. Firm, but calm.\n\nIf your wife accepts that and chills out... maybe be open to a brief visit on a special occasion, maybe not. Up to you. It's your life, your beliefs, and you have a right to your boundaries.", "NTA \n\nNo means NO, and when someone says so, you stop.", "NTA\n\nNo means fucking no.  There's no other explanation needed here.", "NTA. I would honestly divorce someone for a sudden spiritual awakening. No religion for me ever.", "Christians tend to have a hard time with the word \"no\". They are the most goddamn persistent people in the world, besides the federal tax bureau.", "NTA. No does mean no, but at least be glad she wants to include you in her life. However, maybe you should go at least once to see for yourself what she's getting into. Sounds like she is being pressured to \"bring in the lost sheep\" or something. That group of new church \"friends\" could end up driving a cross-shaped wedge between you two.", "Sounds to me like you SHOULD go along, to find out what kind of shit they're trying to shovel into your wife's and SIL's head. Members of the church might use this as a way to isolate her from you. Best to know what you're battling!", "NTA but you better do something soon if you love this women. You know where this is going.", "How long have you and your wife been together?\n\nFull disclosure, I was raised Christian and I still participate in religion. It’s a big part of my life, but I also understand why so many people choose to have nothing to do with it after childhood. My husband is also involved in our church, and it would hurt me deeply if he chose to walk away from it. Conversely, I bet your wife feels very hurt at the idea of you not getting the same spiritual fulfillment that she finds. \n\nHowever, she had no need to ask you more than once. I could see her persisting reasonably, but only if your circumstances change. You’ve declined her invitation, and now she isn’t respecting your boundaries. “No” is a complete sentence.\n\nI do worry how your relationship may go forward from here. I’m sure you guys never discussed the possibility of religion and what kind of role it would play in your marriage because you assumed you would never have to have that conversation. It would be a dealbreaker for me if my husband stopped, going to church, and I’m sure it would be a dealbreaker for him if I stopped going to church. Our marriage is conditional on us both being involved because that’s important in our religion.\n\nIt’s probably time for a serious conversation with your wife. You don’t necessarily need to ask her why she insists on you getting involved, but what the expectations are for the both of you moving forward. Clearly you need to establish the importance of your boundary that she not ask you to participate in religion, but she also needs to communicate her boundaries to you. Be honest with yourself and with each other about what the best way to move forward is.\n\nNTA", "NTA, I’ve had a very similar background with religion.  Sounds to me like someone is getting their hooks into her, and more than likely they’re giving her a lot of crap because she is going, but you aren’t.  You need to have a serious conversation with her about her mental health.", "NTA. I sometimes go to church on Sundays because it calms me down (I'm not very religious but the quietness of churches brings me a sense of peace in the large city). My partner is not religious. I asked her once, she refused and that was it. I never asked again because I understood. It's easy to respect other people's boundaries. If she's insisting this hard however your relationship might be on its way out unless a conversation is had.", "Nta.  Let's assume the bibpe is right.  Her witness or invitation will not save you.  Only god working to soften your heart can accomplish her goal.  She has two options to be faithful to her beliefs.  She can harass you in the name of Jesus, which isn't really advocated for in the Bible and isn't really conducive to a freely given gift.\nOr she can leave you with the message she's delivered, pray to her god who's promised her miracles, and let the only function the bible says is capable of turning your thoughts occur.  Does she not trust God to change your heart without her constant intervention?  Does yahweh really need her help that badly?", "Nta,\n\nDear wife, no means no.\nIf I do go I'll get us all kicked out forever \n\nSTOP being one of 'those' church people.", "NTA for not wanting to go.  NTA for sticking to your boundary.  Kinda TA for calling it a “stupid-ass church.”   That’s just childish.", "Just as in the case of a man wanting ‘something’ from a woman, and us telling the woman that “No” is a complete sentence, so it is in this case. You’re allowed to say no, you don’t need a reason and once you’ve said no, your wife needs to leave you alone. Also keep an eye on your bank balance.\n\nETA NTA", "ESH  \n\n\nYour wife for not respecting your boundary and you for being so disinterested and dismissive of your wife and yelling at her and calling something she values \"stupid ass.\"  \n\n\n\"...has been on this spiritual journey thing...\" is vague and dismissive. Your wife is undergoing a significant life change and you are utterly uncurious. Do you care about your wife? Is she just furniture for you and if the furniture doesn't listen to you you get to yell at it? It doesn't cost you anything to say a polite no every time she asks and to engage in conversation to find out why she keeps asking. It would strengthen your relationship to do that. Instead you chose actions that damage your relationship with your wife.   \n\n\nYour yelling was about control. You want her to stop asking and you engaged in punishing behavior to get what you want. People who are confident in their position do not need to yell. Something about this is bringing out your insecurities. Are you afraid? Afraid she is changing and that will be the end of the relationship? It could be if you keep acting like an ass.   \n\n\nYour description of your values, “let people live how they want and if they die and face judgement on the other side then so be it” is passive and disconnected (and maybe incomplete). Not going to church, not believing in god (I'm an atheist) doesn't mean that you can't still have values that are active and build connection. Good values are evidence based and build connection. They have fuckall to do with god. I'm an atheist. I volunteer with habitat, for clean up days, on my kid's soccer team, at her school and enjoy the time I spend with my friends and family and doing nice things for them.  \n\n\nI don't have a lot to go on, but so far you sound like you live for yourself and are with your wife because she's convenient and you're angry she's becoming less convenient and don't know how to handle that constructively.   \n\n\nI'm ragging on you because you're here. But if she were here, I'd ask what has changed for her and why she can't leave you be on this knowing the background you come from. Maybe there is something deeper underlying this.", "YTA. Remember you’re asking for advice on Reddit who is full of hardline atheist. I personally am not a devout Christian, but my wife is. What’s the big deal about attending a service with your wife to make her happy? Sometimes relationships require us to do things that we don’t want to do to make our significant other happy. \n\nAlso, why do you think it’s ok to speak to your wife like that? She didn’t hurt you or name call or anything— all she did was ask you to attend church with her. You’re being dramatic.", "[removed]", "NAH.  She wants you to go to church with her.  You don't want to go.  She probably thinks it'd be good for you but you don't want to hear it and got frustrated.  Hopefully you can find a way to talk it out so you can both understand the other's viewpoint and she can learn to respect your personal system of belief.", "NTA\n\nOk nothing wrong with saying no. But remember that your wife believes in an eternal soul and is obviously worried about yours", "I’m going ESH. My guess is that she’s going to church for a reason. People don’t just up and decide to get active in a church unless they are trying to fill a hole in their lives. She’s trying to tell you she feels like there is something missing from your marriage, and you’re absolutely not hearing her because you made up your mind about the evils of religion long ago. \n\nYou don’t have to go, but you are an AH for not actually listening to her before deciding she’s way off base. If you don’t take it more seriously, this could easily be a marriage ender.", "NAH and ESH\n  \nSure there is the whole pressuring you to go with her but then there is also the way you snap at her.\n  \nHonestly IMO you guys need to sit down with a counselor and go over how you interface together.  She should not keep pressuring you when it should be obvious you don't want to go and you need to talk to her more civilly.  She is supposed to be your favorite person in the world.", "Yta", "YTA for posting debate bait and using this post as an excuse to shit on other people's beliefs.", "NTA - But you might be a little immature. Hear me out: I've been an atheist since I was 30 (almost half my life now) and when I was young and just breaking away, I was like you: reactionary and angry, and wanting nothing to do with churches.\n\nBut I'm older and calmer now, and I realize they have no power over me, no authority, no influence. Now my mom, who is in her 70s, is very religious and likes to go to church, but hates sitting alone. So for the last 2 and a half years, I've been going with her. It's one hour of my week. I sit and politely listen to the silliest, battiest nonsense in the world... because I love my mother and it makes her happy to have me next to her. We chat afterward with the nice folks there (who ARE nice, just rather crazy.) And there's cookies and coffee afterward.\n\nOnce you are secure in your atheism, it's no big deal. Like sitting through your kid's school play and clapping heartily at their miserable attempts at acting. You do it because you love them.", "YTA for assuming you know everything and being extremely prejudiced towards your wife.\n\nEdit:  OP, what your wife is doing is called a “bid for connection”.  She’s inviting you to do life with her - cause that’s what spouses do.\n\nYour issue isn’t with her, it’s with the activity she’s inviting you into.", ">I kinda just blew up and told her “I don’t know what spiritual battle thing you have going on but it’s something you have to deal on your own\n\nWhat is really happening, you are uninterested in her spiritual/emotional/mental challenges she's going through and she HAS to find a way to feel less lonely; that's where religion usually steps in (if an affair doesn't). It's not that your wife suddenly, over the course of a few months became religious. It's that she is feeling lonely and disconnected from you, and going to church gave her a feeling of support (however illusory). She asks you to go to church with her not as a way to \"make\" you religious, but as a last means of reconnecting. \n\nNTA for not going to church but huge YTA for not giving a shit about your wife's mental challenges and telling her she must be on her own in it.", "[deleted]", "She deserves better than you. Do you kick kittens, also?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAITA for snapping at my wife and telling her to stop asking me to go to church? My wife these last few months has been on this spiritual journey thing and she has started going to my sisters church. Background on my sister church they are your typical Christian people (God is great, you are bad and if you don’t repent you are going to hell, if my god offends you then that’s your fault, blah blah blah) I grew up in church when I was younger so I know how religion works with the pray it away and have faith but don’t forget to tip god your 10 percent on a free tax me Sunday money. So ever since I was younger I disliked the idea of religion cause really who knows what happens when they pass. I believe more in the “let people live how they want and if they die and face judgement on the other side then so be it” but I’m straying away from the subject. So she asked me the first day she went and I said no thank you, I don’t feel the need to step into a church ever again. So then she asked me again 2 weeks later and I told her again no thank you and please stop asking. I don’t want to go. She asked me again a week later and I started getting frustrated because I already told politely no 2 times so I just snapped and told her to stop asking me I’m not going. She asked me again today and I kinda just blew up and told her “I don’t know what spiritual battle thing you have going on but it’s something you have to deal on your own because I’m not going to that stupid ass church.” I feel bad cause I snapped but at the same time I’ve told her plenty of times no and to stop asking. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Religious people trying to recruit are the worst", "NTA.\n\nNo means no. She knows you don't want to go, and she knows why. She's out of line to keep pushing.", "NTA... definitely apologize for snapping... but sit her down and really have a talk... its not fair of her to force you into it.", "NTA\n\nOf course you snapped. She already knew that you don't want to deal with religion. It was common knowledge. \n\nNow she goes to church and wants you to join, probably to save your soul or whatever bullshit they fed her. You declined. You were nice about it. She was the one who couldn't accept your \"no\" which is unfortunately quite common for these types of \"Christians\". \n\nYou two need to sit down and talk though. The deeper she gets sucked into that cult, the rockier your relationship will become.", "NTA but you may want to consider sitting down and having realistic conversations about your future. If the church is something she is hell bent on, then I’m not sure how your marriage can continue. She won’t stop asking you to attend, resentment will be built up and you will continue to drift further apart. She is not respecting your decisions. She knew your feelings on church and is disregarding them. She can do what she wants but she has no right to impose her decisions on you. Children is another matter entirely. Can you imagine raising them with such different perspectives?\n\nUnfortunately, IMO time to consider divorce.", "NTA.", "NTA but your wife is now probably tinking your soul is going to be burned in hell. Expect a divorce in the future.", "NTA and don't have kids until you have a firm discussion on their religious upbringings too. I suspect, though, that you 2 may no longer have compatible goals in life", "NTA--Sounds like maybe on Sunday mornings you should go out for coffee, a paper and some salone time....right about the time she asks you to go to church with her.", "NTA no means no", "NTA\nYour religious views will be a sore spot in the future if you don’t tackle them this early. The way that church works, she will be made to feel guilty for not “ saving “ the rest of her family, and some of her views on life will change and will not align with yours. I absolutely am not suggesting for you to be against her religious/spiritual journey, but make sure it will not be a problem in the future.", "I grew up in an offshoot of a mainstream religion. It was a cult. They pull people in, then nag you to proselytize others (guilting you that people are dying and going to hell and you are partly responsible if you don't win them over to the religion). \n\nI would go to a secular, not christian, couples therapist. She's getting roped into a religion, or worse. \n\nHonestly, for me this could be relationship ending due to my previous experience in a cult. \n\nNTA OP she is not respecting your boundaries, but I highly recommend a secular therapist.", "NTA. You've said no multiple times and she continues to push, some times snapping is the only time people learn not to keep poking the bear.", "NTA - if she keeps insisting, you're going to need to involve a therapist or counselor. It's not even about church at this point, it's about respect. Her spirituality is her business, and if she's getting heat from church people she's going to have to deal with it. Religion is the original pyramid scheme, swear to god.", "NTA\n\nThe deeper she gets into this church the less compatible you're going to be.  Hold off on having kids until you figure this issue out.", "NTA\n\nThis needs to be a conversation regarding children.\n\nIf she is this fervent about her new church, and you are the opposite, y'all need to have a chat about indoctrination.", "NTA. You said no multiple times. No means no.", "NTA. I will also never again attend church.\n\nYou might need to go to (secular) couples counseling for this, though. She’s making an enormous change in her worldview and lifestyle by becoming a church goer. She may be afraid that the marriage won’t last if she can’t take you with her. You two need some really good communication to make you both feel at ease.", "NTA. No means No. It doesn't mean \"ask again in a week\" or \"keep asking until you get a yes.\" No is a full sentence and as a woman your wife should know exactly that a no means no.", "NTA.\n\nAnd I fear this is going to turn into a major issue in your relationship the longer it goes on. If it's the type of christian church you've described, then you KNOW she's getting bombarded with messages of \"you must convert your spouse or else they're going to hell,\" so she's just going to keep asking. The longer she's inundated with that, the pushier she's going to get in trying to get you to go. The frustration you felt after she asked the last time is just going to continue to build (and rightfully so!). \n\nI would try to have another sit down with her and make it very clear to her what your feelings are on church and religion. While it's fine for her to do whatever she wants in terms of going, if she keeps at it with trying to get you to go that it will likely have very negative consequences on your relationship.", "NTA. This is HER spiritual awakening. Not yours", "NTA.", "OP mistakenly thinks that 'no' means 'no'. See, just look at how you were dressed. You were asking for it.", "      I think both of you need to work on communication because she won’t take a clear no as an answer.\nBut snapping at somebody isn’t the correct way to go about something in a relationship. There’s nothing wrong with her going, or when she asked the first time, but she needs to take no for an answer, and there’s nothing wrong with saying no, however you’re an adult and should not have snapped like that. As adults in not just a serious relationship but a marriage you need to know how to communicate with eachother and how to initiate serious sit down conversations about boundary’s.\n\n     Ultimately well I do think that you shouldn’t have snapped NTA, she was pushing boundaries and not acting as though you’re allowed to say no. But overall you guys should probably have a long serious conversation about what happened and go over boundaries, values, where this situation leaves you, and how to proceed.\nAnd to clarify not being an extremism and saying to divorce, I think that for something so small if you genuinely love each other that wouldn’t be the correct move, but you both do need to have a serious discussion, as well as learn about how eachother can communicate better.", "NTA\n\n“No” is not just a word, but also a complete sentence.\n\n-an atheist of six years", "NTA but you should be concerned about how your wife is changing.", "NTA\n\nSounds like they're manipulating their new member (your wife) into being on a mission to convert you. That's usually their spiel. Recruit, recruit, recruit! Honestly, religious fanatics are exhausting.", "NTA but this is going to be a deal breaker. She's not going to stop trying to \"save\" you. And if you have children, She's going to want them to go with her and judge you for not going. Time for an honest talk.", "NTA. She ignored your \"No!\" multiple times.", "NTA. I think you know that snapping on her maybe wasn't the best move, but yeah after 3 no's, she should for sure drop it. Especially if it was understood and agreed going into your marriage that religion would not be part of it (as you indicated in a comment)", "NTA. My sister used to be fun and non-judgmental and then she started to go to an Evangelical church and turned into a very unhappy judgemental harpy. Once in awhile we see her true self but it is far and in-between. Good luck dude.", "Info: what’s your relationship with your sister like? Why does your wife feel the need to start attending church? Why does she think you should accompany her?", "OP, I just wanted to recommend the YouTube channel of Truth96130. He deconstructs the hell mythology in a way Bible-believing Christians do not have to compromise. It might bring your wife to a healthier place if you can get her to a more liberal denomination... it sounds like she has gone full fundie, which doesn't bode well for this relationship.", "Nope, NTA but your wife sure is. Sorry to hear she fell into a cult.  Maybe it's a phase ans she will wake up eventually.", "NTA, she was disrespecting your boundaries & badgering you repeatedly, eventually patience is going to run out.\n\nI would apologize for the yelling (not cause you did something wrong but for diplomacy's sake) but make it very clear & very firm that you don't want to hear of it ever again & that while you respect her doing what she wants she needs to respect your choices, too, & then if she ever brings it up again shut it down with a firm \"No, we talked about this already\"", "NTA\n\nYou have expressed your desire to NOT go to church many times. She knows the reasons why you are not interested in going. She has asked a couple of times and you have said \"no\". She needs to respect your boundaries just as you are respecting her beliefs. You do not have to follow her spiritual journey, because it is HER journey. \n\nOf course, you could always be really obnoxious and start worshipping the Flying Spaghetti Monster (https://www.spaghettimonster.org/). I am sure that she would freak out. (Don't do this. I am just being sarcastic).", "NTA\n\nIt's your soul, after all.  Seriously, though, it's your call.  Mom was Catholic, and insisted us kids had to go to church every week.  Dad was Protestant, and never, ever, went.\n\nWhen I was little, I wanted to be Protestant, because I thought it meant \"Doesn't have to go to church\".\n\nBUT! -There are no typical Christians.  Christian, as a term, covers about 2 billion people around the world, with lots and lots of different sects, and a lot of variation in attitude and beliefs.", "NTA \n\nOr: You could go, then embarrass her by standing and attempting a Q & A.", "NTA. I’m catholic but not pushy or anything- when my husband and I dated, he is agnostic and liked I didn’t force things on him. One day he asked if he could come with me to mass, and I said sure. He did it weekly with me when he wasn’t working (even after our wedding) until Covid hit (due to my immune issues). To this day I don’t ask if he wants to do stuff, if he wants to it’s completely up to him, and we both like that. You should be able to choose what you want, just like she does.\n\nETA: I used to be extremely religious as a kid, but growing up, I’ve grown tired of how tiered and catty it is. It got worse when one of my church friends said dating my husband was like the show married in 90 days because he came here on a student visa 6 years before we met….\n\nETA2: my sister corrected me and said the show is called 90 day fiancé lol", "Info: what has changed in your wife’s life to instigate a change in the way she views church and her need to dive so deeply into it? The promise of “salvation”, in my experience, from something they feel shame about is a strong motivating factor…….. anything like this happening?", "NTA. I understand your wife asking once, but continually asking is AH behaviour.", "NTA and you should have a serious discussion about your marriage. I’ve seen it too many times that one partner gets super religious, the other won’t join in so the religious person annulls or divorces.", "we have had these discussions and I told her how I felt and she said she didn’t like church either now she does and wants to drag me along", "I think it’s because the church puts it into peoples head that they need to be recruiting offices for the church.", "Because she buys into the church. They tell you to do this. Even if you are rejected keep doing it until your dying day.", "Because they are drifting apart", "This has crossed my mind though. Like I feel my sister and her people would try to sway her into someone that is there but hey if that happens then it was meant to happen for a reason. Just got to keep on keeping on at that point. I love my wife and I would be sad but I’m all for her trying to find better grass if she thinks she can.", "Never know but whatever happens happens I guess. Life goes on.", "I mean I know some scriptures. Lol “obey your husband” nah that’s not me", "Me too.", "This happened with my husband and his ex wife. She got really religious and he supported her but wasn't interested for himself. It got to the point that she was telling him every day that he was going to hell and they wouldn't be together in heaven and just trying to bully him into going. It finally caused them to break up.", "I understand this. I mean I love Star Wars but I don’t force her to sit there and join the dark side of the force by praying to Darth Sidious", "Never seen anyone describe religion as a fandom and that's 10/10! Love it.", "This is genius", ">In seriousness though it sounds like her particular brand of religion doesn't leave a lot of room for non-believers.\n\nThis. NTA OP.\n\nI feel the need to point out that her behavior is not necessarily a Christian thing in and of itself, it's a thing specific to the type of Christianity that she's gotten into.\n\nIt's easy to see it as a Christian thing, but a lot of that is because the most annoying Christians are the most visible with their butting into everyone else's business and fire and brimstone whatever. \n\nNot all people who go to a Christian church are annoying, nosy asshats.", "I just feel when I told her that I would never go to church again then that would of been a topic never discussed again but apparently not", "Sarcasm my 4th favorite language.", "Ace Ventura’s bumpy ride", "We have had talks in the past about this and she was fine with the idea of us never going to church but now she seems to want to go", "That’s where I was at with this. Like I’m happy you wanna do this and you can do this but I don’t want to this and it’s not something I can control.", "If it goes there it goes there. Two things you can’t stop and that’s time and something someone already put in their mind", "Me and her have been together for 10 years. Early 20s. When we first got together we touched the subject of religion and how I was raised in a fully Christian family. Church every day except Tuesdays. I don’t mean any disrespect by these next sentences but I feel like church when I was younger (I don’t know about now) was just emotionally draining and fear mongering. “If you don’t believe in god you will be thrown into the lake of fire and burn all of eternity while god looks down on you on his throne” to me that wasn’t a god that I would pray too. I’m happy you are husband are happy in your marriage and religion but I feel that’s something that I can’t come to terms with. Either we go to church or we are over.", "Dear slim I wrote you but you still ain’t called. Nah lol jk \n\nIt’s a conversation that’s gonna be brought up again.", "I appreciate this comment because it does seem like I have been dismissive but we have had talks about this before and I told her how little I care about religion. I say this spiritual thing because even though I don’t go to church I do remember some people saying that this a spiritual journey on her part. For the last 10 years I have cared about every one of her life achievements. When she got her dream job to when she wanted to start selling flowers on Etsy. She isn’t a piece of furniture to me she is my wife and I would even go further and say she is my soul mate. I’ve never once tried to  control her and never plan too. I’m not gonna tell her to stop going to church or I’m leaving. The reason I called it stupid ass is because I was getting irritated and after so many attempts of saying no it just got to the point where it just came out. If I could take it back yeah but the damage is done and I can’t. I’m not with my wife because it’s convenient I’m with my wife because I feel in love with her when we were in 6th grade and every time I see her it’s like we’re kids again not knowing what the hell we are doing but we would still face the world together. I kinda do live for myself because at the end of the day I have to lay in bed in my thoughts and reflect on everything I have done to get me to this point of life and if it’s something I could be proud of. Doesn’t mean I go around and be a selfish prick and make everyone’s life difficult. Live and let live is more or so how I look at it", "I 100% read what OP says and think the exact same thing. Dude has given up on his marriage or never really cared.", "First of all the username is funny. I don’t attend a service because that’s how it starts. “Oh you came to this service, come to Easter service, you came to Easter service come to thanksgiving service.” I just have no interest in it at all especially being force to do it for 14 years as a kid. I understand making your significant other happy but at what cost? Your own peace and happiness? I don’t think so. \n\nAs regards of talking to her like that it was spur of the moment. What’s said in anger can’t be taken back and now that’s something I have to live with.", "Not accepting the word “no” is a jerky thing to do. It’s very corrosive. And it’s clear that OP had a terrible experience with the church so it would be as unpleasant an experience being dragged to church as your wife’s would be being dragged to a Satanist temple.", ">What’s the big deal about attending a service with your wife to make her happy? \n\nWhat's the big deal with OP's wife respecting his decision to not go to church?  Why are her desires prioritized over his?", "“What’s the big deal about attending a service with your wife to make her happy? Sometimes relationships require us to do things that we don’t want to do to make our significant other happy.” \n\nYou have a very wrong perception of how relationships work. A healthy relationship is where individuals are allowed to have their personal beliefs and ethics without being forced to do something they don’t want to to “make their significant happy”. \n\n\nI’ll ask you the same question, what’s the big deal about him not wanting to attend a service and the wife just letting it be? Can’t she drop the topic to make him happy? Doesn’t make it lot of sense now, does it?", "Luck? Where we are going we don’t need luck… lol jk", "what the fucc", "Whatever happens to my soul after then I’m okay with it.", "How can someone go around meting out eternal punishments for things that happened over a 60 - 80 year lifespan? The scale just doesn’t make sense.", "She’s trying to tell me that religion is missing in our marriage? Bro I cook, I clean, i don’t hit her and seldomly do I raise my voice at her and I show her affection and we spend time together on the weekends via trips, or just bumming it? What would be missing? Afterlife judgment lawyer?", "“My guess is that she’s going to church for a reason. People don’t just up and decide to get active in a church unless they are trying to fill a hole in their lives. She’s trying to tell you she feels like there is something missing from your marriage” \n\n\nWhat an absolutely stupid thing to say. If the wife feels like something is missing from the marriage, maybe, just *maybe*, how about directly communicating it with her partner like an adult instead of being dismissive of his choices as if he’s a child who doesn’t know what he wants?", "Why is it “their marriage” that’s missing something? Why not just “her life?” How the hell do you know", "We were fine until religion got involved. I’ve never snapped at her like this. Two things I take into consideration when we do argue is respect and communication. If you don’t have those two things then it’s just yelling and trying to hurt each other and that’s a hard pass for me", "Not debate bait. I feel bad for yelling at my wife and telling her to deal with something on her own but at the same time I’m enforcing my own boundaries.", "i think you got ops post a little wrong. he is NTA but people who push religious things onto others (like his wife) are", "OP's wife's belief is that it's acceptable to harass someone to go to church when they have clearly expressed that they don't want to.", "i don't think OP is reactionary or angry - he's setting a boundary.  there's nothing wrong with that.\n\nwhat you're implying is that he is supposed to \"suck it up\" for 1 hour a week to make someone happy.  If his wife knows how miserable he will be, doing this for her, why can't she recognize that this is something she can do alone, or with her sister?  Why is she implying his attendance at her activity is more important than his happiness?\n\nAlso - the fact that your Mom attends a church and hasn't made ANY friends that she can sit with (your post implies she will only be happy if YOU sit next to her) is pretty close to the treatment OP is getting from his wife.\n\nwhere are the compassionate christians who are welcoming and supporting the members of their church?  why aren't they inviting new joiners or single attendees to worship next to them in their pew?", "Wtf? He said no thank you multiple times and she won’t respect his decision. No is a complete sentence.", "Much projection.", "Don't you think it's the wife pretending like she knows everything? And being damn pushy about it, too.", "Did you read the post above because I think you need to read it or read it again. Your answer doesn’t make any sense", "Note: I’m a Christian. \n\nThe Case for Christ isn’t written for people outside the church.  It’s written for people inside the church to help them feel validated.  \n\nThere is no book, no speech, no testimonial, no habit of church attendance that brings a person to faith.  God does it.  Yes, I’m a Calvinist.\n\nIf OP doesn’t want to go, then OP’s wife is **being a bad witness** by continuing to ask him to go when he’s clearly said that he doesn’t want to. \n\nMarried couples who disagree this much on the most important questions in life face an uphill battle.  OP has made himself clear that he doesn’t want to go.  Spouse should respect that decision and leave it alone.", ">you are lost\n\nWRONG.", "Every other day I do. Just straight punting them.", "If he pays 10% of his income and says he repents can he? \n\nWhy would she deserve better if she's the one pestering OP about going to church when he's made clear he doesn't want to?", "Huh? Has everyone taken the no read pill today?\n\n“ I don’t want to be part of any religion”\n\nReligious fanatic “ do you kill animals too?”\n\nLike what? How does your answer make any sense?", "Being frustrated and rejecting religion are the same thing as animal torture.\n\nGot it.", "I had my hoochie daddy shorts on and crocs.", "I don’t speak to my sister because she goes to church and was always reminding me how I was going to hell for not going to church. \n\nShe’s having some spiritual journey thing going on I believe and I don’t think I can help her with it.", "Lol I wouldn’t do that. Would be no better than some people just being dicks", "I have a feeling that, when at this church, she is getting constant questions like “Where is your husband?   Why isn’t he here?” and if the parishioners are fanatical enough, they may be borderline harassing her with questions and comments like “Doesn’t he know he will be going to hell?   Why aren’t you doing something about this?   Don’t you love him?”\n\nReligious people can be over the top sometimes.   It’s unfortunate she can’t just enjoy church on her own and leave you out of it.\n\nOn a day other than Sunday, sit her down and ask her why it’s so important to her that you go.   If it is indeed other people making her uncomfortable, perhaps you can get her to understand that this is inappropriate.   Make it clear that, no matter how many times she asks, you will not be going, and if she asks again, just walk away.   No need to keep beating a dead horse.  NTA", "NTA.\n\nThing is, she may have been given a target to engage subscribers and may be getting pressure from her ecclesiastical line manager.  Or she may now believe you’re going to have a red hot poker inserted into your fundament for eternity.  I’d try asking her about the reasons for her asking, once, to give her chance to explain.\n\nYou can then engage in a reasoned response rather than just a ‘no’, after which time you can revert to just saying no.", "She's free to like church and spend time there, but she can't decide that for you. It doesn't even \"count\" if you don't believe, does it? NTA.\n\nAnd yes, keep an eye on your finances.", "My husband and I have the same deal. I was Christian (Episcopalian, so a pretty mild version) when we met. He was and is atheist. He said we could raise the kids Christian but I was never to ask him to go to church. He has a few times - to see our kids in choir and their baptism - but I never ever push him.\n\nAnd honestly in the last six years, I can’t bring myself to go anymore. \n\nMy dad gave me a great bit of advice when dating - “never date someone who cannot accept the word no.” Your wife won’t accept the word no. That’s a problem and it needs to be spelled out. I get it - there are times when I really want my husband to do x or y, but our deal is that he will hear me out, I put all my cards on the table, and I accept his answer. This of course goes both ways. \n\nI think you need to have a conversation with her about respect and whether she’d like it if you were trying to convert her to pastafarianism?", "It sound like you'll soon have a difficult decision to make. Because \"live and let live\" is antithetical to conservative Christianity, which means--if she stays on this path--compromise will be impossible. She will continue to hassle you, because her religion tells her she has to to save your soul.\n\nNTA. I'm not a fan of ultimatums, but this situation definitely calls for one.", "NTA - you could turn this around easily by going biblical on her.  Loads of passages about women obeying their husbands and all good beating them if they don’t act right!", "[removed]", "Is this possibly a mid life crisis? Is she around 40 or so?", "Cool let her recruit elsewhere.", "That’s how cults work.", "Sounds like you’re not compatible", "It’s unfortunate that we aren’t better educated (culturally) on the elements of a cult. \n\nThere are churches that are *much* less culty – any chance you could talk with her and let her know the signs of a cult?", "I think this is exactly the case. They tell their followers it’s their responsibility to show others the light. It enrages me. Religion is truly the best scam in the world.", "Wow. I'm impressed. That's a very unselfish attitude.\n\nYou might be turned off by church, but you seem to have at least some of the values that Christ embodied.", "It's honestly very unsettling to see how little you care about the prospect of your marriage ending", "I grew up around a lot of very religious people - happened to be friends with some Mormons - and I just remember this underlying like “you can be friends with the little heathen but remember she is definitely going to hell” vibe lol and my friend trying to save me. It isn’t fun. I can’t imagine having to navigate that in a marriage, it was hard enough in middle school.", "People like that just dont accept that their beliefs are not truth. You cannot threaten someone about not going to heaven or going to hell if they dont believe in it.  \nHowever many christians should read more carefully the bible and what jesus tell them about the way of treating other people", "This happens all the time. OP knows this is going to happen and is letting it.", "Lol. I'm sorry this situation is happening,  but at least you seem to be able to keep a sense of humor about it! \n\nI absolutely hate organized religion.  I feel it's caused far more harm than good. If the way some of these \"religious people\" act is the way to get into heaven,  I'll take my chances with hell.", "Evangelical Christians are pretty famous for not taking “no” for an answer. Saying no to them is like saying no to *God*, and who would ever want to say no to God?? It doesn’t compute.", "You shouldn't have needed to make such extreme statements, to begin with. You got invited once and you politely declined (you said no, thank you. You didn't say \"not today\" or \"Maybe some other time\" in which case asking again would be ok). That should be enough to not push the issue again. \n\nShe isn't simply asking. She's pushing for the answer (and the action) she wants from you. That's not ok. \n\nIf she has a problem with you not going to church, she's allowed to. People change, their perspectives change, and their needs change. Maybe years ago she had no issue with this, and now she feels she needs a partner who is as spiritual as her. That's fine. But she needs to communicate that to you through an honest conversation. Not poke you with church invites all the time.", "Mmmmmm….  Then my vote is NTA for deciding what you do with religion and soft NTA for snapping after she repeatedly asked.", "Dude she is leaving you for the church because you clearly don’t care. I never seen someone give up so easy.\n\nDo you even want to be married to her?", "That’s not a God I would believe in either.\n\nIs that last sentence what your wife told you?", "I get you. My husband is very very similar.", "the person who cares least about the relationship has the most power.  his comments are telling..wonder if he married here because it was the easiest thing to do..", "Ohhh so you’re worried that if you attend once that she might try to pressure you more? That is logical.\n\nPersonally, I only go on the major holidays with my wife and family because it’s important to my wife. I really don’t mind spending a hour of my time doing something I don’t want to do to make my wife happy. God knows she does it for me too. I just feel like relationships are about compromises and maybe there’s a compromise somewhere in there.\n\nI can see religion is a touchy subject for you and honestly what do you care what a stranger on the internet has to say? I just want you to remember you’re on Reddit and the people commenting on this post are heavily biased against anything related to religion.", "“No thanks, I’ve been.” - this is what my Dad says to anyone that invites him to mass. Catholic school was pretty terrible as it turns out.", "She asked him again weeks later? You’re saying since he said no once or twice that she’s not allowed to ask him ever again? I am saying I think relationships are about compromise and if it would make the guys wife happy to attend one service with her that he should consider it. I don’t see the big deal about attending a one hour service as a non believer.", "I think I have a pretty good understanding of how relationships work and I don’t think you understand what I am saying. \n\nThe guys wife is not asking him to convert or anything. You can still maintain your beliefs and “ethics”, while attending a one hour church service one time. It’s not that big of a deal.\n\nRedditors tend to be hardline atheists and I think OP is getting bad advice.", "I think I have a pretty good understanding of how relationships work and I don’t think you understand what I am saying. \n\nThe guys wife is not asking him to convert or anything. You can still maintain your beliefs and “ethics”, while attending a one hour church service one time. It’s not that big of a deal.\n\nRedditors tend to be hardline atheists and I think OP is getting bad advice.", "My post isn't about the logic or moral of eternal punishment now is it. Just that the wife believes in it", "I dunno. “I don’t hit her” is a pretty low bar, dude.\n\nWhat purpose is your marriage serving? Do you do any community service together or give back to your community in any way? Sometimes people want to not be selfish and just bum around. Maybe she’s looking for meaning in this life—it’s not always about the afterlife.", "I get it but you **both** need to be better.  Just because the topic is religion is no reason to drop the civility.  Look at it from her point of view.  She may have had a true moment of personal enlightenment and just wants to share it.  \n  \nAt the very least IMO you guys need to sit down and quietly talk about it.  A counselor would make a good neutral party to keep it on topic and civil.", "If that were true you wouldn't have included all the typical anti-religious claptrap and cheap shots.", "My mom could sit with friends, but it's not the same as having a family member next to you. If this isn't something you are old enough to understand, oh well, but that's how it is. \n\nBut yeah, he should suck it up. That one hour isn't torture, and he (and you) would be childish to act as though it is. Like when a tween is told he can't play a video game till he makes his bed, and he thinks he's being abused. Oh, the drama.\n\nIt's just church. It's a mild annoyance, but actually... yes, if you love someone it wouldn't kill you to go with them at least a couple times a month. Love isn't just a feeling, you know. It's the occasional small sacrifice. And once you realize that church has absolutely no power over you, it's a sacrifice on par with going to your least favorite restaurant because she likes it.", "His reluctance is based on a complete fabrication of what Christianity is, what Christians believe, why they believe it and his wife’s motivation for asking.", "Asking your spouse to join you in an activity is not being pushy.\n\nI don’t like hanging out at my in-laws house, yet my wife still asks me to join her when she goes - and respects my decision when I say no.  Nothing wrong with it.", "I read it - I’m just not a rabid atheist so I don’t immediately jump on the bandwagon of “Christian = bad”\n\nIf OP was like “Am I an asshole because I yelled at my wife for continuously asking me to go grocery shopping with her?” the YTA vote count would be astronomical.  The only reason it’s not is because she’s inviting him to church.", "Haha this is gold \n\nHere’s an award OP 🥇", "Was there a family death or job loss or other incident that triggered the spiritual journey?", ">Religious people can be over the top sometimes. \n\nUnderstatement of the year", "Don't forget unequal yokes", "ding ding ding!\n\nThey are guilt-tripping her into recruiting OP. \n\nOP - you may try reassuring her that you support her going if that makes her happy - but you're not interested. \n\nNTA", "If people have to recruit members AND have a target number of people to invite, isn't that a cult or an MLM scheme?", "“ecclesiastical line manager” 🤣", "My brother-in-law went cuckoo for Jesus after AA, so he was really involved in his church, and more than once they reached out to us to either join or give money or whatever. But I looked up their church online and their mission statement, they value recruitment for their church ahead of their outreach. Like fuck you, you want money to advertise and to recruit? How about helping the poor or having services for community members? Get out of town with this mega church nonsense honestly..", "Pretty sure the higher ups could not care less about whether you believe or not, as long as you volunteer your time and resources and give money.", "Why do all that?  No means no.  Just point out that Jesus is like a penis, you shouldn't force people to see or touch your penis.  If they ask for penis, they get all the penis you want to give. If they don't ask for penis they should have to deal with exactly no penis.", "Yes I said that", "We were until religion got involved", "I’m just a go with the flow type of guy. I don’t like bothering people and I don’t like people bothering me. If I could I would build a raccoon utopia and just live within that community lol", "It isn’t unselfish if you read deeper into his comments. His wife is trying to find meaning in life.  She found this church and OP seems to care very little what she does or that she is getting sucked into a terrible church. OP “ oh shucks, I guess she is a gonner” \n\nIt that is anything like the rest of their marriage no wonder she is doing this", "I care about my marriage ending but like I said in other comments. I can control what I can control. I can’t change anyone’s mind if that’s the direction they want to go.", "He doesn’t have a choice. She’s a free human being. It isn’t his job to control her faith system.", "I’m not giving up. I just don’t surround myself with the illusion that people are always gonna be around.", "No she didn’t. I was just saying that I couldn’t agree to those terms. That I would say we are over then if it came to that. I don’t like ultimatums", "My sisters church is very high pressured church from\nWhat I’ve seen. It’s cool you go with your family to church and you guys made that compromise. To me though I will always pass on religion. That’s true about being on Reddit just felt bad you know. Felt like an asshole", "Still, I said what I said", "I mean now a days that’s a pretty high bar for some guys to not hit their significant others. I mean now they even broadcast domestic violence on the tv for ratings. If she wanted to go give back to the community I am all for it. We can go to the soup kitchens, we can go to the hospitals to hang out with people but I don’t see why church has to be involved. It’s like those people who do good deeds for people and post them on YouTube for people to see.", "He did nothing wrong. She needs to be better and stop trying to force him to join a cult.", "A “true moment of enlightenment” from an evangelical church would be reason enough for him to just divorce her, lmao", "I was just stating my opinions on religion. Wasn’t cheap shots.", "Yes he would, because it validates why he does not attend services.\n\nHe's said nothing anti Christ or anti God. He said anti organized religion. The church HAPPENS to be Christian, but it could be a temple or a mosque or anything else. OP has an issue with religion on the whole. He did not come for yours, so stop trying to make it seem like he did, just because you want to start a debate.", "Perpetual perceived victimhood where none exists…typical Christian.", "His reluctance is based on his first-hand experience with Christianity and Christians.  His wife badgering him to go to church when she knows he doesn't want to isn't likely to improve his opinion.  Her Christianity is causing her to be an asshole toward him.", "No his reluctance is off his own experiences - he literally states he grew up in the Church, he knows that it’s not for him and has no desire to ever be in a church because of that. He was not disrespectful, he isn’t stopping her from going, he politely multiple times declined to attend as he does NOT want to be involved. It was only when his wife continued to ask and ignore his boundaries that he snapped.", "Lmao no fabrication there. Have you ever met an evangelical Christian", "Repeatedly asking after being told \"no\" is pushy. Why are you deliberately misrepresenting what has happened?", "Asking repeatedly after being told no is being pushy. And she's absolutely not respecting his no.  Sounds like he's been perfectly clear about never going to church.  She needs to accept that.", "Harassing your spouse over and over again when they've told you clearly that they are not interested is pushy and extremely rude.", "\"And respects my decision when I say no.\"  So, the exact opposite of OP's wife.", "Ummm, so having food in your house it’s the same as going to church. Church is an outing , food can keep us alive…. I wonder why people don’t like when religious fanatic attack atheists for not wanting to believe the same they do. God damn, I thought I had free will , Christians like you apparently think that we shouldn’t have it …… your God will be disappointed, mine on the other hand will be proud , I don’t make anyone else do what I do . My god believes in love , not hate like yours does.", "Nope. She has a solid job, no deaths in the family. One day she hit me she wanted to go to church and I didn’t question I just said okay if that’s what you wanna do then go ahead. I support you but this is something I won’t be doing with you.", "All religions, by definition, are also cults. Following one leader, drinking the sketchy wine and eating the bread, doing everything they are told, attempting to convert others, half of them end up walking billboards for their religions.", "Remember that the difference between a cult and a organized religion is that someone decided the later to be legal", "That evangelical up-line", "That is a bot, they copy and paste other people's comments", "Yeah, sometimes that’s how it goes.\n\nFor whatever reason, your wife has developed an emotional need that she’s decided only church can meet, and the more devout she becomes, the more uncomfortable it’ll be for her to be married to someone who is utterly uninterested in that increasingly large part of her life. If the gap can’t be bridged, the marriage isn’t likely to have much of a future. \n\nYou might want to get into the office of a good (secular) marital  counselor before things really start to deteriorate. If she’s all-in on religion, and you’re not, that’s a really big change to your relationship dynamic, and it’s going to cause problems if you ignore it.", "You will likely find that this is a moment of epochal change. There's the relationship you had before The Religious Apocalypse  and there's the one after. They're often very different. \n\nSorry. Mourn the loss and move on. It's unlikely to get better.", "Can I join the raccoon utopia?!\n\nNTA, OP. You responded civilly the first few times. And your attitude about religion is healthy. (Your wife is TA for repeatedly asking.)", "Raccoon utopia\n\nSign me up!", "🦝🐾 A raccoon utopia sounds like my kind of Trash Panda Paradise. Where do I sign??", "Sounds like you are giving up on your marriage pretty easy. That isn’t laid back, it is weakness and apathy", "I have no idea what a raccoon utopia is but I want to live in one anyway.", "\"read deeper\"....excuse me, what?  She's an independent person who is capable of finding meaning in life in literally ANY way.  Church just happened to be what she chose.  I find meaning in life by volunteering.  Others find meaning in life by connecting in nature. \n\nswap \"Church\" with any other activity.  She wants OP to run.  He says - hey, I used to run in highschool, and i don't like it.  no thanks.  but don't let that stop you!  If you like to run, go ahead! \n\nOP's wife continues to run.  She badgers OP to run with her.  He declines.  OP's wife gets mad because OP isn't supporting HER journey of finding meaning in life.  \n\nWhat about OP?  Why isn't he allowed to find meaning in life, in a way that satisfies him, and makes him feel good about it? \n\nThere's nothing wrong with having different interests, or finding your own spiritual journey, independent of what your spouse does.  OP's wife is TA for not respecting OP's decision.", "I disagree. Spiritual\nJourneys are very personal. I’ve been on one myself - and my husband doesn’t “come with me,” because his struggles are not the same as mine. He also doesn’t hinder mine. I love him and he loves me. But if I said I wanted a divorce tomorrow he’d give it to me. He won’t be with someone who doesn’t want to be with him, and vice versa.", "My thoughts exactly. I’m not gonna force her into an ultimatum because that wouldn’t make me any better than a religious institution. Follow me or perish.", "Just go get the divorce now and get it out of the way.", "I think I might recommend you guys do some marriage counseling. That way you can have an unbiased third-party to help guide conversation. I also wouldn’t be surprised if you have some deep-rooted spiritual trauma, and maybe your wife needs to be more aware of that?", "You seem like a good guy man and I’m sure you have a good grasp of what is right and wrong and I’m not trying to pressure you to do anything you don’t want to do. I am just trying to give you a different perspective because after reading most of the comments I felt like you were getting bad advice.\n\nIn situations like this, I typically trust my gut. If I feel like an asshole more than likely I was being one.\n\nIf I was in your shoes I’d sit my wife down and tell her how you feel and how religion is a touchy subject for you and apologize for blowing up. I think she’ll understand whenever you explain it to her like you did on this post.", "\"Don't forget to tip God 10% on a free tax me Sunday.\"\n\nThat's a cheap shot. \"I don't believe organized religion has value to offer\" is an opinion.", "Victimhood? WTF are you on about? I just don't like the obvious debate bait.", "According to your logic, my wife is only allowed to ask me one time to go visit her parents.\n\nIf I say no, and she ever asks again for the rest I our lives, she’s being pushy?", "Wife could go shopping alone, both parties don’t *need* to go in order for there to be food in the house.\n\nRegardless though - the point of the analogy is that no one is agreeing with OP just because wife is persistent, y’all agree with him because wife is inviting him to church.\n\nKeep railing at those strawmen though.", "So odd. Anyway you’re not the asshole I’m just nosy.", "I think Judaism is the only one that doesn't actively try to recruit into the ranks, not sure of any others", "Well, except they aren't, except to edgy reddit posters.", "The raccoon utopia is for everyone", "I don’t view it that way…\n\nFor most people cheating is a hard stop and the marriage is over. If religion is a hard stop to someone, how is it any different?\n\nReligion would be a hard stop for me. \n\nOP, NTA.", "How do you fight religion?\n\nPlease explain it, we've been trying for millennia and it just contorts itself to manipulate people in a different way.\n\nChristianity, for example, doesn't have a single holiday of it's own, it's cannibalised \"pagan\" holidays to force convert people to Christianity.\n\nWhen someone finds religion, and is fervent about it you can fight them and you will lose them entirely. They need to realise the detrimental lifestyle that is religion themselves.", "There is a huge difference. I voiced my opinion and  OP doesn’t care. I have nothing more to contribute here.", "LOL man some of you people give up real easy", "What do you suggest he do?", "Well sorry if you took it like that but it was more aimed at those weird people like Kenneth Copeland and Joel olsteen but I see where you are coming from", ">\"Don't forget to tip God 10% on a free tax me Sunday.\"\n\nSounds pretty accurate to me.... the greed of many churches is pretty damn obvious. Not all of them of course,  but there are definitely a lot of them.", "Yes the wife could go alone, if they have a HEALTHY relationship though they have a schedule and either she goes alone or they change going because they need the food. \n\n\nShe suddenly said I want to go to church , husband not a problem have fun. Come with me ? No. Again she asked. He answered no thank you , I don’t want to go but have fun. She asks again and he snapped he does want to go. Because he doesn’t need the church to live . You might need to , he doesn’t, should he be crucified for not wanting to go? I mean how much hate do you have for non believers? Are u ok?", "Yes it’s because it’s church. Because his wife has done a complete 180 on it and is now trying to pull him in, he knows his sister so he knows the kind of church it is and it’s a cruel one, and because yes we dislike religion— get over it, we have good reason to.", "You find out why they needed to seek out that in the first place after a life of not believing. What was missing in her life? What happened?\n\nAdults don’t just go join a church for no reason.", "your comments throughout in the thread suggest otherwise.\n\nand I agree - you have nothing more to contribute.", "Don't apologize, you are absolutely right.", "I went through this when getting my kids baptized, which my wife really wanted. We were told that we had to attend church for six months straight to qualify. Okay, fine. But they also told us that our attendance was tracked through our donations. We couldn't be trusted to just go to church on our own, we had to prove it monetarily.\n\nSix months of a weekly five-dollar donation later, we could finally baptize our kid (they were born four years apart, had to do it twice). Stopped going after the baptism was done, each time. Wish I could have just paid up front.", "I haven’t even remotely suggested that OP should be punished or that I harbor any ill will towards them.  \n\nI’m sorry your disdain for people you disagree with makes you incapable of having rational discussions.", "If you wanna be inconsistent with what you think based on your own ideologies that’s certainly your prerogative.", "You assume that he's responsible for whatever was missing in her life.\n\nMaybe she entered into marriage thinking that it would supply whatever she was missing in her life. If that's the case, it's a mistake. Marriage is not supposed to make incomplete people into complete people. It's to make complete people even happier.", "If that was rational, you need to go to a mental institution…. Supermarket vs Church. What else am I going to see in here ?!?!", "I don’t think you understand what an analogy is.", "I don’t think you know how to make a metaphor…", "I don’t think you know how to make a metaphor…", "I don’t think you know how to make a metaphor…", "NTA. She’s being indoctrinated into the cult. Are they Baptist? 😂", "NTA. This is why religious people are an automatic no on dating apps for me.", "It is beyond annoying when someone doggedly insists on trying to get you to do something you don't want to do OVER AND OVER AND OVER AND OVER AND OVER AGAIN.\n\nNTA. But you really need to do something about this, because this is just the beginning oif a phase in which your wife will campaign to make you be different to please her current mania.\n\nIn your position, I would go ballistic to discourage her nagging, but it probably wouldn't work, and you must realize that she is probably being coached by the others in this so-called church, which sounds mor to me like a cult indoctrination center.\n\nI grew up in a very small town (in Pa.) dominated by Pentecostals. They were very intent on their beliefs, but they never proselytized. They were Christian and live and let live. \n\nYour wife isn't.", "NTA.  You were a little rough, but people normally are when someone won’t take NO for an answer, so I am ok with it.  But this doesn’t sound over, OP.  Think about confronting this head on, sitting her down for a couples-conversation.  Tell her she’s making you uncomfortable and angry, you’re ok with her exploring religion if she wants to but if she continues to try to involve you she’s going to cause permanent damage to your relationship, and try to talk this whole thing out, set boundaries, before the situation gets worse.", "How long have you been married, and have you ever heard of \"missionary dating?\"\n\nhttps://web.archive.org/web/20200423235336/https://slate.com/human-interest/2013/11/dear-prudence-my-wife-missionary-dated-me-hiding-her-religion-until-marriage.html\n\n> Q. Bait and Switch: I dated my wife for three years before we married. We were both in our 30s and had had all of the important discussions before we decided to marry (kids, religion, etc.). At the time, she told me she was agnostic, and not really into “the whole religion thing.” Now, less than six months into our marriage, she tells me she’s joined a church and expects me to join her for Sunday services. It’s only now that I learn that she has extremely right-wing, religious views. After talking with some of her friends, they couldn’t believe I didn’t know this about her. I asked them why they wouldn’t have mentioned this when they found out we weren’t having a church wedding and they told me that was probably done for my benefit. Now, instead of our not wanting any kids, she wants at least five and maybe more. Instead of no religion, she wants strict adherence to her religion. I feel I’ve been duped and that she’s lied to me about herself. Is there any way out of this short of divorce?", "NTA - as someone with a similar background to you, you probably are as aware as I am that churches are needling her hard about converting you. Telling her that if you die in sin you’ll spend eternity in different places. I don’t want to sound fatalist but more often than not, when I’ve seen people in this position, it either ends with the non-believing partner just deciding to give in, or in divorce. I hope neither happen with you. But they are going to work to convince her that you’re going to hell and that she’s the only one who can save you.", "You- NTA\n\nYou’re wife- TA", "NTA. Never feel guilty for telling Christians to back off. They make it their sole purpose in life to shove their faith down everyone's throat, so stand up to them as often as you can.", "NTA.  It's a deal breaker for me too. My SIL and BIL went off the deep end a while back after BIL's parents passed within short span. They eventually backed off from serving no alcohol at holidays.  Still pelt out grace at every meal.  They are currently church shopping again, as they can't find a flavor they like.  When we were getting married, they literally held an intervention to try to get us to marry in the Catholic Church.  We declined.  \n\nI suggest getting a nice colander and to start converting her to your new church...the church of the Flying Spaghetti Monster.  Ramen.\n\nhttps://en.wikipedia.org/wiki/Flying\\_Spaghetti\\_Monster", "As someone who is religious, you're NTA. You have expressed a boundary and she continues to cross it.", "These Sky Daddy believers will literally do anything to the non-believers once indoctrinated into the (socially acceptable) cult. coercing you into going & shaming you when you don’t are only the start. \n\nYou are NTA, but your wife is! I’m all for having a spiritual awakening, but it’s *your own* to go through. Not *your own to force upon everybody else*.", "NTA\n\nI believe in Jesus Christ and his teachings. I don't feel the need to go to a building where many of its occupants are judgmental. Christ was not a fascist! \n\nMy church is the forest.", "I’m gonna say ESH, but your wife sucks more. You’re not wrong for how you feel, just how you snapped, which isn’t a big deal. Your wife shouldn’t be pressuring you. I’m in a similar situation where I am going back to my religion and my husband hates it. I do extend the offer once in a while bc I want to share something I’m passionate about with him, but I still respect his free will. She needs to back off. Depending on the church she may be getting a lot of shit for you not coming, and is being pressured herself. Maybe have a talk about why you don’t want to go, and tell her she can have her religion, but to keep it separate. As your wife she should respect your wishes and as her husband you should control your temper.", "NTA. I'm a raised Catholic (shudder) born again Christian who took a 15 year break from religion. I've been in my current church for 8 years and only asked my agnostic (also raised Catholic and jaded against religion) husband to come to my baptism because it was a big day and I wanted him and our then 1yo there for it. I'd never try to force it.", "NTA.  Every time she asks you to go to church, ask her for anal. lol", "Who's wrong here entirely depends on her reason for inviting you. \n\nI'm an introvert and a hardcore homebody, and between work and family, my schedule is already pretty full. I usually don't go out much... But it's really nice when my friends reach out and include me in the invite to the things they're doing that they value, even if I politely decline the invite. There's no obligation to attend, it's a way of saying, \"hey, I care about you!\" If she's offering as a way of saying she loves you and wants to share something important to her, and there's no actual obligation or real pressure to join her, it's not ok to snap at her for saying she cares. ***If*** that's what she's doing, soft Y T A. Churches suck, they're not your thing, you've had some really bad experiences. That's ok, and it's ok to say no. \n\nIf, on the other hand, she's been sucked into one of those high pressure MLM-style recruitment churches and she's just pushing at you so that she can say she's recruited someone, you're N T A at all -- she should have respected your \"no\" and your reasons for not going, and she should not have asked again. \n\nHonestly, it would have (and still *would be*) good to find out where this is all coming from. Did something happen to make her suddenly embrace religion? Was there some sort of trauma that caused this? Did she feel forced to give up her religion to be with you and she's just returning back to it? Is she inviting you because she cares and wants to make sure you don't feel left out or abandoned? Did she get sucked in MLM style and now she's trying to do the same to you? Is she trying to recruit you? Is the tone you've had in this post pretty much how you've expressed your feelings to her? Maybe she's feeling attacked or judged and is trying to show you that not all churches are like the one you experienced.\n\nI definitely get why you snapped at her.. But rather than snapping, it might be good to sit down and have an actual conversation about what's going on.", "When my husband and I started having marriage trouble, I thought maybe going to church would help. Bring some kind of peace, or togetherness, idk. It didn’t help, but it’s worth considering. May not have anything to do with the marriage but some internal thing for her. Asking her why it’s important is a great suggestion", "Guess I'm going to go against the tide here and YTA. Your wife is going through something and looking for support. You don't have to go to church but yelling at her and telling she's \"on her own\" is counterproductive. I fully understand the frustration of being asked multiple times but it sounds to me like she's calling out to you for help and you basically told her to suck it. Also, the way you talk about her is very dismissive - \"spiritual journey thing\", \"spiritual battle thing\", etc. Have you tried to have a heart-to-heart with her about what the core issue/struggle is here? Why does she feel like needs to be on a spiritual journey or in a spiritual battle?\n\nMake a point to understand what she's struggling with and why she thinks church is the answer. Maybe there's another way you can help her that doesn't involve religion at all and then she'll stop asking you to go to church because she'll feel like you're supporting her in another way.", "NTA. Just pray for her.", "God is everywhere, not just in some church. You can Beleive in God whether you go to church or not. Church has become more of a fashion show to see who has the best clothing. He has to want to go if he doesn't, don't force your beliefs on him. Everyone is unique and not your clone.", "NTA, but you didn't have to word-vomit your **beliefs** onto US, either. Your wife is obviously T A here, but asking \"why is this important to you\" is a part of marriage. The fact that you don't know why she's asking, and just assuming in other posted comments her church made her do it, puts you equally at fault.\n\nAnd others here saying \"she might leave you\" and you saying \"you are preparing for that\"? Seriously?\n\nAny marriage counselor would be disappointed. Get help, sir. You need to stop assuming and start talking.\n\nSpeaking from experience. Hear her out. Mirror her. Do your best to understand why it's important to her, then tell her NO. Stop behaving like a narcissist who only wants to go back to being left alone, and thinking of ALL the worst scenarios along the way.", "YTA", "NTA, but ...\n\n>Background on my sister church they are your typical Christian people (God is great, you are bad and if you don’t repent you are going to hell, if my god offends you then that’s your fault, blah blah blah)\n\nThose aren't the typical ones, those are the in-your-face and visible annoying ones. The typical ones are much nicer!", "Edited to NTA upon further clarification from the OP\nOriginal: (y t a )not because your opinions on organized religion, you’re totally fine on that.  But unless you have been to this particular church and have found specific things about this congregation that really offend you, it is an AH move to be rude and call it “stupid ass”.  This isn’t about “church” if anything is important to your partner you should at least be willing to sit through it one time whether it’s a convention, a sport, a speaker, whatever.  I think a conversation like “here is what I found particularly bothersome” can be perfectly respectful and healthy for a marriage.  But right now you’re working off of assumptions (that let’s face it, are likely to be correct, but they are still assumptions).  I think this is more of a respect for your wife issue.", "As a Christian myself, her perspective is probably that she feels strongly she has found a truth and something she naturally wants to share with you. I wouldn’t completely take it out of the question to look into it.\n\nShe’s kinda the A-hole for not respecting boundaries, but you’re also reactive in a very negative way and denying your wife to share that side of herself with you (which is kinda an a-hole move too) Regardless if you believe in what she believes, to her it might be a matter of life or death.\n\nIf she is actually 100% Christian now, she probably wants to share that with you because she wants to see you in heaven. Maybe she isn’t going about it the best way, and you guys can have a fruitful conversation about that and set some boundaries. But I wouldn’t completely take it off the table. ask her what she believes that you guys can find a way to coexist together in the relationship. Or make a decision regarding how to continue. \n\nThat is the only way I see this continuing forward. Either you get mad and offended and traumatized and don’t talk to her about it at all and refuse to let her express that side of herself, (which is a very important side) or you try and talk through it in a civil way. Your choice! no one is the a hole entirely in this situation, it’s on both of you to figure this out.", "ESH - I was on your side, I hate when people force religion on others. But then I read this. \n\n> they are your typical Christian people (God is great, you are bad and if you don’t repent you are going to hell, if my god offends you then that’s your fault, blah blah blah)\n\nThis makes you an asshole. This is not what a typical Chrisitan does, so you choose to perpetuate a negative stereotype on significant number of Americans. Only assholes do that.", "YTA. \"stupid ass church\"; You were right in voicing your own views until those three words.", "YTA. Your views on “religion” are crampped in the same small box as everyone else in society that has no knowledge of God. As a Christian, you never give up on somebody that could be saved. Your wife could ask you for 23 months straight every Sunday if you wanna go to church and you say no. But maybe in 4 months you’ll say yes.\n\nIt wouldn’t kill you to go along with her once to experience what she’s into. Instead you’re so focused on yourself and how you feel. Not everything revolves around you. You grew up in church but that was a long time ago as i assume you’re a grown man now and haven’t stepped foot in a church ever since you were free to make your own decisions. Your opinions can’t be based on something you know of 20 years ago. Not all churches are the same, things change and people change.\n\nUntil you’ve went, experienced it and formed a new opinion on “religion”, you’re in no position to talk about how you know how churches are because you don’t. Go with your wife and see why she loves it.", "NTA", "NTA It came out harshly because she didn't listen when you spoke gently. Your message never changed, just the strength behind it. Good luck.", "NTA. I know a lot of people joke about how quick people on here are to suggest divorce but like religion is a pretty big thing and if it's getting to the point where she's pushing you to attend essentially converting you then this is divorce worthy. You can't live with someone who can't accept that your beliefs and practices are different from theirs.", "NTA since you politely requested not to be asked and she knows why", "NTA. What you need to do is cue up Seth Andrew's The Thinking Atheist podcast, and keep trying to get your wife to listen to it. Keep asking. Even after she tells you she's not interested.\n\nOh, she doesn't like that you keep doing it? She doesn't like to be forced into something she doesn't want? Tell her you hope she enjoys the proverbial mirror you're holding up.", "NTA, but my concern is that she’s gonna get sucked into a more fanatical/evangelical branch when you don’t have open discussions about both your beliefs, where she feels she’s headed, and knowing how influential your sister’s church is and can be.\n\nPart of being a couple is keeping lines of communication open and trying to ensure each other’s needs are filled. Maybe something that needs to be asked is what she’s getting - emotionally, socially, or spiritually - that wasn’t being looked after or addressed outside of the Church.\n\nIt’s okay to not want to go to a church, any church,  but sticking your head in the sand and ignoring that she is getting in thick with possibly extremely toxic people is *not going to do you any favors*.\n\nThere are lots of people that successfully navigate each partner being of different beliefs, but those are people that actually talk and communicate with each other regularly and address concerns and thoughts and issues concerning their spirituality… or non-spirituality, as the case may be.", "It is up to her if she goes to church. It's not up to her if you go.\n\nNTA.", "NTA. If this stops her from bothering you about going then good.", "NTA - you aren’t into religion and she needs to let it go. You aren’t some poor stray she needs to save with her new found religion.\n\nAlso, you’ve made me appreciate that me (atheist) being married to my wife (also atheist) is a pretty beneficial relationship lol", "NTA. \n\nChurch people will badger you till your head explodes. I've been through this with family for years. It never ends. \"No\" doesn't mean \"no\" at church. Verbal answers (even no) mean \"open to negotiation\". As someone who's attended several churches, they very literally teach this even if not exactly this verbiage.\n\nI'd say talk to your wife and tell her that she is aware of your \"no\" and that you will simply not be providing anymore verbal responses to her requests. Follow thru on that boundary. No yelling, anger, or insults from this point forward. Neutrality only. You are simply not acknowledging any more requests for this. \n\nJust be ready for this to affect your marriage. You may want to go undercover in the back if it's a big enough church to see what they're feeding her tho. Some of these places get pretty culty. \n\nChurch is personal and nobody should feel obligated or pressured to attend.", "NTA. But your wife is. She’s pushing something on you that’s supposed to be personal.", "NTA", "Because your sister and the church are making her feel less than for not aiding \"the Prodigal son\" back on the \"path of righteousness\". You are NTA.", "NTA. I'm not religious and have had to deal with this. In her mind, she legitimately does not think your beliefs are valid or equal to hers. She sees you as someone she has to fix, by god! This will unfortunately never end as long as she's on this path.", "NTA - She knows what she is doing. Never understood why they always feel so insecure about their beliefs that they have to badger everyone else.\n\nI will warn you though, the church will be telling her that “no marriage can work without everyone following Jesus” and other shit like that. I’ve watched it happen too many times. The first thing they’ll do is try to push out anyone who doesn’t fall for the grift. I’m sorry you’re dealing with this.", "You declined time and time again and knows how you feel about the subject. NTA. Tell her you cannot be saved. And if she asks you again, come back with: *Nah, but how about you skip today and we do some carnal sinning?*", "NTA\n\nI understand where you’re coming from. I was raised Catholic and don’t really like the Church as an institution. It’s created by men, of men and I don’t believe institutions of men can really know for sure the will of God. I’m not atheist but I have my faith and I refuse to go to church again and my family hates this. Stand your ground OP.", "NTA, you should only have to say no once.\n\nBut prepare for it to get worse as she's assuredly getting brainwashed into the cult.  Otherwise she wouldn't keep pushing.", "NTA.\n\nMy mom is annoying af about this. I’ve literally told her I’m agnostic and she keeps bringing this shit up.\n\nShe can’t see me for who I really am and she is always hopeful I’ll change.\n\nDrove us apart. You stand on your ground and like you say, this is her problem, not yours.", "NTA. You said no multiple times. I dislike organized religion and disagree with Christian beliefs on a moral level so I would be pretty upset if my partner (who is an athiest but was raised religious like myself) randomly decided to start going to church again and continously asked me to go with despite knowing how I feel about it.", "NTA. If my spouse suddenly became religious, I would leave. It goes against a core value that we share.", "NTA. You clearly communicated about it, and previously were on the same page. I know reddit is quick to jump to divorce, but that is an absolute dealbreaker", "NTA, you discussed this stuff and she knows exactly where you stand, she has no right to expect anything from you. Some context-I’m Jewish, my husband isn’t, but we had extensive discussions about the kind of lifestyle we want to lead and he was very on board with being active in the Jewish community and celebrating the holidays and whatnot. It’s a major part of our lives, and we discussed it at length when we were early in dating to make sure we could build a life compatible for both of us. If he ever wanted to go to church or stopped wanting to be so active, it would be very rough for us, but that’s a baseline understanding we both have. In your case, not going was a basic understanding you both shared. She has no right to expect more from you and she’s completely wrong to try to renegotiate on this at this point. Sounds like you have no problem with her going, so you’re abiding by your end. She’s majorly TA here.", "Nta\n\nThe cult she's joined has most likely made it clear to her that \"if she loved you she'd want to*save* your soul, and if you actually loved her, you'd let her. \"\n\nUnfortunately, with her getting sucked in, you get put in a really sticky situation.", "It won’t stop.  She will take your children to church.  She’s been indoctrinated.", "I think this is beyond AITA, because a dealbreaker may have changed for her.  Marriage counselling might help, with a good therapist who's neutral about religion.\n\nWhatever you do, don't have kids at this point.  You absolutely need this worked out before that would happen.  I'm absolutely sure it would only get worse, because it would raise the stakes in her eyes once you're responsible for the beginning of their spiritual journey.", "NTA and I would get out. Religion is an instant  deal breaker for me because that entire system is based on either roping others into it or judging them for not being part of it, even if that's like a judgement based on their own feelings of superiority.\n\nGet out while ya can", "NTA. People need to learn to accept a no. Especially when that no is paired with an entire background of why you are saying no and she knew it was a no. I'm going to be honest, if I was in a relationship and my partner got into religion, I don't know if our relationship would last. I left all that behind and am actively opposed to it.", "Gag. NTA, but your wife is. You set clear boundaries, she knows how you feel about religion and she’s intentionally pushing you anyways… and for what? I think by the trajectory of your wife’s asking it’s going to get a lot worse before it gets better. Good luck.", "NTA church is for sick souls you go there because you struggle being a good person literally the bible says not to worship in a church but in nature do christians even read there bibles?", "NTA. She kept pressing buttons and you eventually snapped as a result. She knows how you feel. She kept pushing. I would have snapped too. As long as you're respectful of whatever journey she's on, she needs to be respectful of yours. If she wants to discuss her beliefs with you, that's fine but she needs to understand that she's not going to change your thoughts. Just like you might not change hers. Agree to disagree. She can have church on Sundays while you can have time to yourself. That's fair.", "NTA. But wife will get over this. It will burn itself out once the contradictions and hypocrisy come out of hiding. Right now, she's in the honeymoon phase. Just tell her you don't believe in the precepts, but you support her. She'll come out of it - 2 years max", "NTA I believe in God and Jesus but after all the shady things the Catholic Church has done I’m not going.", "NTA. Trying to force religion on someone is one of the highest forms of assholery.", "NTA OP.", "NTA\n\nIf she can't handle being told NO after multiple times then that is completely on her. She can't force you to do anything you don't want to do. You have had multiple conversations about thia very thing.\n\nIf she is having an issue with you not being present when asked where you are then she needs to stop attending if she can't come up with an answer that will stop their pestering.", "NTA\n\nYour wife feels a compulsion to \"save your soul\", and so she will never stop. She has effectively joined a cult.", "NTA, but you need to be prepared for the end of your marriage. If she thinks it's God's will that she drag you to church, that doesn't leave room for your feelings on the subject.\n\nYou need to have a sit-down conversation about this with her. Also, make it clear that her tithe comes out of her half of the household financials, not yours.", "NTA in any way shape or form. Your wife is free to do and believe whatever she likes but should not be trying to shove it down your throat too.\n\nHowever, you need to be aware that her new journey down this road may change her and if you are not willing to at least make a gesture to join her (even if it’s an empty gesture) she may well change so much that she leaves you behind.\n\nAlso you didn’t mention kids, so I assume you don’t have any yet.    If one day you do have kids with her.   What will you both want with regards to religion and them?  You need to have these conversations now, so that she fully understands the ramifications of her new found faith.", "NTA...these fake Christians are all about acting like they're morally superior just because they run their yips about how great their imaginary sky-dadfy is and tithing...your wife needs to simmer down.", "Nta but if you guys plan on having kids, this is something you really need to talk about NOW. She was ok with no religion in the house (or at least in you) before, but it seems her priorities may have changed. If she really wants to raise kids in the church and you don't, that could be a big deal breaker.", "NTA  Have some fun with her and go out in Nature for hikes, walks, fishing, etc. and tell her God is everywhere and Nature is your church.\n\nOddly enough, I find that tends to shut folks up.", "NTA, however, why does your wife have a sudden interest in church and why does she want you to go? It's time to have a conversation with her. \n\nMy OH and I moved last year and he has started going to church with friends. I'm an atheist and feel it would be hypocritical of me to go so I don't. He's never pushed the issue.", "NTA - I’d be inclined to start responding “no, I think you need to stop going to this church” every times she asks you to go.  If she is offended, explain it is no more offensive that her repeatedly asking you to go.  If she asks why, explain this church is putting a strain on your marriage.", "Nta she needs to respect that u do t want to go and stop trying to push u to", "i think she kinda thinks she can change you", "I would talk to your wife about her need to share this part of your life with you even when it makes you so uncomfortable. There might be something you’re missing, like others have said…\n\nNTA", "This is really difficult, for me. On one hand I think it's apparent that she's TA for not taking no for an answer and continuing to push...on the other hand when it comes to religion and faith it's way more complex and difficult than a lot of people here seem to love to make it. From an atheistic standpoint it's easy to say \"I said no, so go away\", but from the faith-based side if they truly believe their loved-ones will go to Hell for all eternity if they don't join the faith it makes perfect sense why they'd go well beyond normal lengths to try and get people to go. People new to the faiths tend to be the most adamant about it, because they see it as like a \"World can end at any point and if I don't save you we'll never see each other again for eternity\"...but I can at least understand it.\n\n&#x200B;\n\nYou're definitely NTA, and she's TA...but I also think it's important to try and understand **why** our partners do things they do instead of just see it from our perspective and call it a day. In matters of the heart or faith I think there always needs to be room for understanding.", "> I think you need to come to terms with the fact that your marriage will be ending soon.\n\nI was looking for this comment. I got that sinking feeling reading this too. She is starting   \n her spiritual journey and he has largely deconstructed. I can't see them meeting in the middle here.", "And is she forcing any children to also be indroctrinated in this cult?  If so, this is also a problem.", "Pentecostal church", "That I have no idea of.", "10 years and this is definitely new not a bait and switch tactic", "😮😮😮", "I don’t even know if she knows why she wants to go to be honest we haven’t talked about why she’s going just about me going with her", "Thank you for this comment, So I tell her she’s on her own with her spiritual thing because I honestly believe that this is something she needs to do her self. I can’t influence her on what she needs to do. As far as the heart to heart if she wanted to have a heart to heart she would of let me know. We have been married for 10 years and openly discuss on subjects. She wanted to go to church I said okay go ahead I don’t pry into her life because honestly who would want a relationship where their significant other just hovers over them and questions their every move. My yelling came out when I was angry which I’m not saying is good but it happened, I can apologize and move on but I can’t take it back and that’s something I have to live with.", "I don’t feel like ima narcissist who wants to be left alone. I feel more like a guy who experienced religion found out it wasn’t for me and now I just wanna stay clear of it. It works for some people but doesn’t work for me.", "Well religion can only be harmful. So why allow that belief.", "So this is my sisters church which we have both in the past called it “cult like” and have laughed about how they go about their “teachings”", "what spouses do (or at least SHOULD do) is respect each other's belief systems (and that includes the choice NOT to believe). no one should ever be hounded to ignore their own beliefs and attend a church, ANY church. especially not from their spouse, of all people.", "You don’t have to attend church with her, but taking a moment to compromise and try to talk to her about how she’s feeling or what she believes might help with communication, and if she feels heard, maybe she won’t ask you as much. If all of a sudden you experienced something similar, you’d at the very least want acceptance.", "I haven’t been to church myself in a bit, but I do recall the eternal torment for nonbelievers part.", "I know. After calming down I realized it was wrong on how I said it but I can’t take it back. Just apologize for it later", "She’s the one who forced OP’s hand. 🤷‍♂️", "Thank you for this comment, So I am a very realistic person. I know that the world doesn’t revolve around me, my feelings and or my opinions. So now with your comment about how I haven’t stepped into a church in 20 years there’s no need for me to step into church. Everything now is on the internet. My sister’s church goes live on Facebook to spread their gospel and it reminds me of everything that was being said when I was younger “if you don’t go to church you are the enemy of god and he will strike you down on judgment day “you either join a church or will be casted into the lake of fire”. Now are there better churches maybe. Do I want to visit those churches? No. I have no interest of what they have to say. I don’t want to seem rude about it just the way I feel.", "This is a very holier than though mindset. People are allowed to form an opinion and keep them. OP does not need to \"check in\" to see if he feels the same way.\n\nYou sound like one of those pushy Jahovah Witness I slam my door on.", "He deserves better then her", "Only if she changes me into a beautiful raccoon.", "If you respect the spiritual choice of your wife she has to respect yours. She knows your beliefs, she asked you once and it should have stopped there. Everything else is disrespectfull. You can't be the AH if she pretends to just not ear your answer until you snapped. If she is mad, explain more calmly that you're feeling pressured by her constantly asking you to go.", "Do you have kids or are you thinking about them? This is often the biggest issue affecting a difference of religion within a marriage. \n\nIf you don’t have them yet, don’t have kids until you know for sure how you feel about your wife’s new spiritual journey", "Which is why she's putting the pressure on him to go to church.", "Yeah, isnt there something about how a woman shouldn’t ever try and teach a man? Let her be silent type stuff. /s", "I've been bullied for not going to church as well.  I've been bullied for not bringing my kids \"into God's light,\" whatever that means.  I've repeatedly told all involved that I am not interested.  They still ask, years later.  I snapped the same way you did, because sometimes, enough is enough.  No problems with religion per say, but I will not be shamed into going.  Same for my kids, they can decide at an appropriate age if church is right for them.  I'm not into indoctrination.\n\nYou shouldn't have to be asked over and over, it's a guilt tactic and it's used to wear you down.  I know many people who just give in because it's much easier than fighting.  Follow your own compass.  \n\nNTA.", "Run away as far as you can…as someone who grew up and later left a Pentecostal church, they are in essence a cult with all the hallmark traits of one…these people are judgmental and unempathetic as hell…good luck", "You and I both know what she’s being fed and she’s afraid for your eternal soul. But if she believes in heaven then the belief is she will not feel sadness or loss and shouldn’t be so pushy on you. Your soul your choice.", "RUN!", "Right now, I’d say NTA. But I’d really encourage you to step back, de-escalate and try to understand why the change has come about - there may be something underpinning all this that is troubling her.", "Obviously I don't know what your relationship is like, but I don't think you it's as open as you think it is. If she's holding something back it might because she felt like you wouldn't understand or support her (somewhat proven by the \"stupid ass church\" comment. \n\nI'm a lot like you in that I don't subscribe to organized religion and have no intention of ever going back to church/temple/synagogue ever again. And if my partner had formerly been of the same opinion and suddenly changed, I'd want to understand why. You don't need to \"pry into her life\" but I think it would be pretty important to discuss these types of things that form the foundation of your relationship so that you can continue to understand each other's boundaries and needs. You can make it clear that you support her but still hold firm to not attending church and she needs to not ask you. If you should decide to go for whatever reason, you will tell her. She needs to make clear to you what she needs to feel supported in her \"spiritual journey\". \n\nMostly, to me, it seems like there's an underlying issue (why she wants to go to church in the first place and why she thinks it will help her) that needs to be sorted out and understood first. I've seen people suddenly change their opinions on religion following the death of a close family member and such - it usually doesn't come out of nowhere.", "And you have to spend a paragraph explaining that in your OP? How about just \"religion is not for me.\"\n\nWhat makes you \"behave like a narcissist(I didn't say you were one)\" is your willingness to \"blow up\" on your wife instead of asking for more information. ALL of your comments on this post have pointed to the fact that you know very little about \"why\" and are just assuming based on your worldview.\n\nIt's also your assumptions that the worst will happen, playing into other people's posts about what your wife might do next. Have you even **ever** met someone who left their spouse for a Christian? EVER?\n\nI've been down this road buddy. It's rough, but you gotta do some hard work to make it work. She's T A for asking you a bunch of times. But you're T A for not talking it through. And you're FAR more the asshole for your humorous, incredibly hurtful and presumptive remarks about her behavior to play into the stereotype with others here.\n\nYelling at your wife while \"I don't even know why she's doing it\"? That's some high-school-level bullshit relationship behavior right there.  \n\n\nTLDR: This AITA post should have just been a sitdown with your wife.", "Then I change my verdict!", "Simply inviting ones spouse to join them in an activity is not “hounding”.", "lol i’m just saying his opinions about God are all wrong just like saying God hates you if you don’t go to church which is not true at all. It’s ok tho all i said was to make effort for his wife and he doesn’t want to so too bad i tried for her sake", "You've nailed it. The missing partner is an insidious thing because it implies a respectful free choice about religion. And that sort of tolerant attitude is not good for judgement and the tithing plate.", "This kind of approach, while worth trying, is far from guaranteed to work. It presumes rationality, and religion is fundamentally not rational, which is why it's called faith.\n\nOP needs to brace for the possibility that this causes a serious ongoing problem in his marriage. She may not be willing to take no as an answer.", "You won't go to hell if you don't go to church. You can believe in God anywhere it doesn't have to be in a church setting.", "Adding onto this, but the church folk might also be adding in things like, \"you aren't praying hard enough, your faith isn't strong enough, if you were a good enough wife then he'd want to go.\"\n\nThe push for invites can be as much about recruitment as it is about creating dependency on the church - \"see how the world is? it's awful, but we're here, and we/God loves you.\" It may be worth sitting down with her, apologizing for the harshness, but also reiterating both that you don't want to go and also she's not a bad anything for that.", "Excellent point. It reminds me of the time my husband's coworker told us that he was concerned that we and our future children would go to hell because we don't go to church or do the religious thing. We told him that we appreciate that he cares about us enough to be concerned but we're comfortable in our decision. This coworker seemed fine with that and the that part of the conversation ended. Now. If only one of us was getting that type of constant talk without the other being present, I can see where things get a bit fuzzy. In this case, it sounds like the wife needs to talk to the husband more about why she wants him to come. Again, you've made an excellent point.", "\"Over the top\".\n\nI'd say the crusades were a little more than over the top.", "That logic won't work. If she is in the church, she is supposed to be a godly wife and honor her husband who should also be an upstanding member of the church. \n\nThey're likely always asking \"wheres your husband?\" \"Why isnt your husband here at church?\" It doesnt matter if she brings 10 new recruits, they will ALWAYS want to know why her husband is failing religiously", "The trouble is that once a cult gets big enough, people stop seeing it as one. But a lot of these ostensibly mainstream churches really do have a lot of culty and MLM-y aspects.", "Yep, the old spiritual Me Too.", "Yeah I know. I was raised in the church like that. The running around had me in the best shape of my life though", "To be honest I don’t even know if she knows why she wants to go to church. I think this is new to her as well. All I can do is wait and see what comes of it and when she’s ready to have a heart to heart about this then I will definitely be open to hearing what she has to say about why she wants to go but I won’t strike down the idea of her going. She has my full support in anything she wants to do but if it conflicts with my peace then that’s another conversation", "> because it’s important to my wife.\n\nHas it always been important to your wife? It's a far different story going into the relationship knowing this is something important to your spouse. Instead of being on the same page and then having a drastic shift", "Yes - I am saying EXACTLY that.  OP doesn't want to go.  If he wants to change his mind, then he can do so, on his own time and at his own pace.  \n\nRelationships are about compromise - to a degree.  If OP was allergic to shellfish, would you consider it reasonable for his wife to demand he eats a crabcake?  It's SO DELICIOUS.  It doesn't matter that OP might get hives, or have trouble breathing, or be on the toilet for hours - she wants him to experience it.  He's really missing out on this.  Wow, he won't even try it just once, for her?  HOW SELFISH.", "Because you’re either ignorant of or obtuse to what churches and their people actually do, especially ones like OP’s sister apparently goes to. One service will not be satisfying; she went from “I’m not religious at all” to “now it’s so important to me,” you think she’s going to be so thankful that he attended one and is going to stop badgering him? Use some common sense", "> You’re saying since he said no once or twice that she’s not allowed to ask him ever again\n\n100% because he specifically asked the 2nd time it was brought up to stop asking. She should respect his wishes here, especially since this is a new desire for her.", "Show us on this jesus doll where OP hurt you.", "Cause god is aloe and anyone whose religious lies to themselves. You’re in a cult not spiritual", "Did you tell your wife that you will never go to your in laws house ever again and to stop asking you? Or do you occasionally join and just decline most of the time, which makes your situation entirely different from OPs?", "if you continue to 'invite' them when you know they have no interest (and are in fact very clear that they are not now and never will be interested) and have repeatedly said NO then i'd call it hounding.", "The thing is... is that church, religion, and people in power within the church, can leave lasting, traumatic impacts on people. just because it didn't happen to you, doesn't mean it couldn't happen to others.   would you say the same thing to a young man who was molested by a priest?  suck it up, get over your feelings and come to mass. it's just an hour. your mother needs you.  \n\nthe thing is - we don't know the full reason why OP isn't interested in ever setting foot in a church.  but what we do know is that he's set a boundary.  and his wife isn't respecting the boundary.  \n\nthis isn't a \"doing something for the sake of doing something\" straw man argument where you can compare attending church to going to the grocery store or a restaurant you don't like. \n\nYou've acquiesced to your mom - you're an atheist attending church to make your mom happy.  to you, it seems harmless.  consider that there are situations for OP where this is not harmless.", "Why can't she make an effort to respect clear boundaries he has clearly communicated?\n\nHarassing people is never ok. If someone asks you to stop, **Stop**.", "understatement of human history lol", "\"But she's only looking out for him because she loves him and doesn't want him to spend eternity in hell.\"\n\nAll my childhood trauma surfacing. The number of times I was told to harass people to make them come to Jesus...", "Lava can be kind of hot sometimes", "Sometimes? All the time.", "Unequal yokes applies only prior to marriage.\n\n1 Corinthians 7:13-16 offers some guidance:  \n“If any woman has a husband who is an unbeliever, **and he consents to live with her, she should not divorce him**. For the unbelieving husband is made holy because of his wife, and the unbelieving wife is made holy because of her husband. Otherwise your children would be unclean, but as it is, they are holy. But if the unbelieving partner separates, let it be so. In such cases the brother or sister is not enslaved. God has called you to peace. For how do you know, wife, whether you will save your husband? Or how do you know, husband, whether you will save your wife?”", "Matthew 18:20 \"For where two or three are gathered in my name, I am there...\" \"For where two or three are gathered in my name, I am there among them\"", "There's no zealot like a convert.\n\nAlso it's a common pattern, trading a physical addiction for a mental one. The fun part is when they're addicted to religion and they relapse and then they're addicted to both.", "I'm so glad my dad is as ateist as he was when he went to AA 30+ years ago. They left god out of AA in my country a while ago and I think it was a great idea.", "And you should treat your religion like you treat your penis - it's fine to have one and it's totally okay if you're proud of it - but don't wave it around in public and for God's sake don't ram it down kids' throats!", "I'll make them bowties and bake them cookies!\n\nIn seriousness though.. she sounds like my ex-husband. We were both pagan bordering on non religious and towards the end he got involved in  religious conspiracy videos and then turned super chriatian religious. It's one of many reasons we aren't together anymore.", "No, but you can tell her how you feel. I've gone through religious-or-not phases myself. Go to church a bit, get into it, and then get over it because, ya know, *church*. She may be wrongly assuming that your relationship would not be in jeopardy due to this. If she realizes how serious it is, her zealotry may abate or disappear. She'll have to figure out her priorities quick.\n\nWhat I'm saying is she may not have enough info to know what way she wants to go.", "I’d consider some counseling for you and for you both. \n\nIf you are blowing up about this, there’s anger that you need to work through. And you both need to communicate and hear what the you both need.", "It maybe your wife is going throw some sort of midlife crisis…see if you can get some counseling or a marriage counselor/therapy to better understand what’s going on…to go full Pentecostal usually means something serious is going on", "Lmao. Are you honestly comparing sitting through a church service with trying to force someone with a food allergy to consume something they’re allergic to? That’s bonkers.", "Yes, I think she could potentially be grateful he attended one service and be happy that he came with her. Of course he should discuss it with her prior to going and set boundaries prior to agreeing to go.\n\nMy wife is religious and I am not. I go with her and my kids SOMETIMES, and I honestly don’t think it’s that big of a deal.", "I have no idea what you’re trying to say.", "The only harm it can do is the harm you allow it to do.", "Its pretty hard when the whole religion is based on harassing people because you know whats better for their soul", "This.  One youth pastor I had referred to it as \"Scared straight for Christ!\" While wearing the WWJD bracelet....Jesus wouldn't harass people I think", "Eternity in Hell might sound like a better option to the OP than Heaven with her, his wife.", "This is not true and I’m no fan of religion.", "Saw this happen - the Church actively pushed my friends wife to recruit him.  They had their ways to shame her with his absence. Caused a lot of fights. \n\nHope the best for OP however they go about this.\n\nNTA", "I am definitely here for the Raccoon Utoptia!", "Come one come all lol", "He did communicate by saying no, it's not his fault if she is to blinded by religion to understand that no means no. The wife needs to work on listening skills not the husband with communication. Also the husband has had a pleasant attitude in respect to religion. If you are talking about relationship counseling sure that makes sense but don't put any blame on the husband when the issue is either the wife is not listening to the boundaries her husband is making because of the religion or she doesn't respect him enough to value those boundaries so walking right over them is a non-issue for her, he has done nothing wrong", "i asked if you would consider it reasonable - your response indicates that it's not reasonable.  \n\nHere's another example:  a person was assaulted at church as a child, leaving them with life-long trauma.  as an adult, they made the decision to never set foot in church again.  their spouse knows about this.  they've talked about it.  Spouse decides to repeatedly invite them to church.  \n\nwould the person who has church related trauma be expected to just \"suck it up\" and deal with it because it makes their spouse happy?  the answer is no.\n\nWe don't know the reason OP left the church, but frankly, we don't need to know.  it's a boundary.  OP is not impacting his wife's ability to attend church.", "Not all religious people are your wife. I assume your wife’s church isn’t like the one OP described?", "The fact that you think thats a cheap shot shows just how ridiculous the practice actually is.", "Said god is a lie.", "There’s a difference between asking to visit parents which is an activity. And hey come join me at my cult meetings every Sunday.", "because in his life he has had bad experiences with a church (being forced to attend when he didn't want to). the man knows what he believes & doesn't believe in. yet his wife won't let up.", "Right? If the people from my old church are going to heaven, I'll have a much better time in hell.", "You KNOW Hell has all the most interesting people. I've seen Heaven's fanbase. I'm unimpressed.", "Judaism is what folks tend to think of as the \"God, just leave us alone so we can eat babka and argue with very dead rabbis to find loopholes in texts from 2000 years ago and no we don't want to convert you\" and it's def true - some rabbis will still turn away potential converts three times to make sure they are REALLY sure. \n\nWith that said, the following religions don't proselytize either: Zoroastrianism, Jainism, Yezidism, Druzism, Taoism, (most forms of) Hinduism, (most forms of) Sikhism, and traditional/local religions.", "they are, except to the cult members.  oh look, i can do it too.", "Guarantee the words “unequally yoked” have been thrown around at this woman’s church.", "So you’re gonna be single soon, yea??? 😂", ">The raccoon utopia is for everyone\n\nUgh, so.......the crazy religious people will be there? LOL", "I just love racoons and their little grabby hands. I will never get tired of their hands.", "He wrote one day she said she was going to church and he didn’t ask why. Just said ok. LOL I would think step one is ask about her.", "Why are you giving these horribly drastic what-if scenarios? It’s weird.", "We are different people so of course it is going to be a different church..", "Not in terms of what a loving response looks like.", "The quakers also do not proselytize, and i sometimes think maybe they should", "Thanks, i knew there would likely be a few like that!", "Thank you for mentioning the others! I’m a religious Hindu and I keep it to myself unless it comes up (because I literally have zero interest in talking to those uninterested haha im jc over here w my nightly prayers lol not that deep) but it really bothers me when people say “all religions are…” things. It’s hurtful and also totally doesn’t acknowledge such a large percentage of the world population!", "According to some people yes lol", "The raccoons don’t discriminate. They are cuddly creatures", "I have been slowly domesticating one. He comes around 8:30 or 9 and I give him some food. His name is frank", "Most people join a church because they lack meaning (in this case this is also true) - another thing that religion tried to force upon us that literally means nothing, life has no meaning beyond living it, you don't matter, I don't matter, we are made of matter that's as close as we get to it - how do you reason with \"trying to find meaning in life\"?\n\nReligion forced the idea that life has a purpose and that purpose is to serve god/s. Life has never had a purpose beyond reproduction and living life. Tell that to someone following a religion and see how it goes.", "because you clearly don't understand the concept of personal (individual) autonomy.", "Well people are allowed to be snappy when asked countless times like op was.", "Nah this isn’t inconsistent with anything else I think, I consistently think religion is a nightmare\n\nYes your experience might be different but Based on the way you discount every other persons experience as a “complete fabrication” when it’s part of the reality of it I don’t really think you’re worth listening to", "I’m not saying they’re wrong - but who ever really knows? You’re NTA, FWIW. My former MIL turned to religion later in life and got really sucked in. She was driving an hour or more to go to a specific church. My ex is agnostic and she would cry to him about where he was spending eternity. I was unemployed at one point during quarantine and dealing with major depression and she said she knew a guy who was training to be a counselor and needed hours of unpaid practice so I agreed to see him. He AND HIS WIFE showed up, explained that they knew MIL through church and proceeded to tell me that salvation would get me through the dark times… I’m like you in the “live & let live” mindset, but I also think religion is a crutch. People lean on it like a superstition and believe that if they just keep the faith, they’ll get XYZ - even if it’s in the afterlife. Your wife’s newfound piety would cause me to be concerned, not so much for the belief but because she is pressuring you in spite of your stance and therefore likely being heavily influenced. She’s drinking the grape juice and will likely become sanctimonious…", "All hail Frank", "Sure - still an asshole move though.", "This discussion isn’t about religion though, it’s about the behavior of a man towards his wife.\n\nThe inconsistency is because he was unkind to her.  If the catalyst of that unkindness was *literally anything else*, y’all would be condemning him…but because wife is a Christian, she is automatically judged by the Reddit hivemind as being wrong.", "I don’t know what that last word is but it’s big and it looks scary lol. Jk yeah I don’t know just gonna have to have a tough conversation", "Nope. If the only way to get someone to actually pay attention to what you are saying is to snap then you can never be the asshole for it. She wasn’t listening to him at all. Never heard him say no. She’s the asshole for that.", "a supermarket comparison is ridiculous. supermarkets have not caused OP trauma. the church has. he doesn't believe in religion, and the idea of having to attend church makes him uncomfortable. why can't you understand that?", "It’s only about the behavior of a man towards his wife if you completely ignore context. It’s about a lot of things, and assholishness doesn’t stop and start at marriage\n\nI would not be condemning him for literally anything else. Get over yourself and your persecution complex. I would say he’s not the asshole for a lot of things if his wife was constantly ignoring his “no.” Religion is one of those things.", "You saying that you quit church long again has me thinking that it’s your sister that’s pressuring your wife to get you back going to church. \n\nYou are NOT the asshole.  Your SISTER is the asshole.", "**The church and it's minions have her in their clutches and they / she will not relent until she turns you.** \n\nThat is what happens. People become rabid about it and will hound you until you explode just like you did. \n\nYou repeatedly told her no and she needs to actually hear you. She is free to go but does not need to drag you in. The church will keep pushing her to drag you in. **More people = more $**. \n\nShe knew how you felt and respected that until she went to the church which shows you that they are probably telling her she is not a 'good enough Christian' unless she brings you into the fold. The pressure on her will be relentless and I am sure she has been told she will not ascend to heaven if her husband does not join. \n\nHonestly you need to get her out of the clutches of this church. \n\n**NTA**", "At this time there is 666 comments !", "YOURE NOT THE ASSHOLE! christians are the only religion that get away with trying to push their religion on people its unacceptable!", "NTA you've set boundaries and your wife is refusing to respect them.", "NTA. Couldn’t pay me enough to go.", "Religion divides... She has to actually accept that you are living life your way and she has to live religiously without you. That's really difficult. I hope she lets it go and lets you be. That's extremely uncomfortable.", "NTA religion is a load of bollocks and the root of so much misery in the world. Let her waste her time and money but you don't have to as well.", "NTA - if you do not have children, I would gently suggest not planning any until you are back on the same page.", "Religion scares me.. NTA", "Ugh.  Hell has nothing on the Born a\nAgain Christian.  You have my deepest sympathy.  NTA", "Not sure why but this sounds a lot like the Morman Church/ Church of Jeses Christ of Laterday Saints.\n\nSource: Me and my circus of life.", "You need to realize that she's not going to stop.  From her perspective, she's trying to save your soul, and she won't give up on getting you to go to church.\n\nI went through the same thing with my parents... they tried for years to get me to go.  I always refused. well into my adulthood.  Eventually they stopped... but it took years.  \n\nI honestly don't know what it'll take to get her to stop.  For me, it took years of refusing.  For you... maybe the same.  Get used to being asked.  \n\nAlthough... if it continued for too long, I would reconsider staying married.  This is a rather fundamental difference... I wouldn't choose to remain married to a born again Christian.  NTA to you.  Good luck with getting her to stop asking... I think you'll need it.", "NTA she’s probably applying so much pressure because people at the church are asking where her husband is", "NTA because you gave 3 polite declines before the 4th curt no, and you already asked her to stop asking. Even though you’re NTA, it might work better for your relationship to try saying “It’s still a no. I’m asking you again to stop asking.” \n\nYou could even throw in a biblical anecdote like, “I don’t have the patience of Job. Please stop asking.”  I myself would have lost my patience as well and would be sitting around wondering if I was the AH.", "Absolutely NTA. Religion is personal. If she wants to go on her spiritual journey, fine. But it’s personal. She should leave you out of it. \n\nThat’s why I dislike a lot of Christian denominations. They are so pushy about their beliefs and trying to collect others like fucking Pokémon.", "Most of the verdicts here validate you but in a not very helpful way. \n\nYou are NTA for not wanting to go, and you're NTA for declining. Your wife is TA for asking repetitively (and presumably showing little interest in how you feel). \n\nI do think you are lightly TA for snapping at her and not having a sit down about this after she asked you the second time. Assuming you love her, you should also want to support her and feel supported by her. This involves preemptive communication on both your parts. By neither of you sitting down to communicate more deeply on this, you're contributing to a potential rift. \n\nShe should have facilitated this conversation with you if she has some new need for support (for example \"I would like you to come around once in a while to support me in my spiritual journey\" followed by you sharing how you feel and a conversation about how best you can support her (which could include going or not going but maybe letting her tell you about her journey). But at this point it might be best to start this Convo now, with \"Im sorry I snapped earlier. I'd like to talk about why I did and figure out how we can improve our communication as a couple\" or something like that. Explain how you're setting a boundary around church, and how her ignoring that makes you feel.... \n\nIt's possible she'll share about wanting to include you in her spiritual journey, and you'll have to figure out how your relationship fits into that (or not). But you won't fix anything by not talking about it. \n\nGood luck. \n\n\nPS-- I am in a relationship where one of us doesn't like church and the other likes to go once in a while. We just communicated about it and sometimes if I don't have something I'd rather do we go together, to be supportive. Before we talked about though, it it was a touchy subject any time church came up (presumably because we both have church-related trauma that makes us feel like we're going to be forced to go or judged if we dont). It also came up in the conversation that a Christian/anti-christian pairing wouldn't work, which led to us realizing we're both just kinda anti-church but still spiritual, and one of us just likes the social support aspect.", "Your wife is the asshole", "Looks like she got sucked into an evangelical church. Be careful OP. I am not joking at all when I say those are cults. She will not stop. Your 'No' will only encourage her to ask more and more.\n\nETA: I'm ex- evangelical.", "NTA. I have zero respect for people like her.", "NTA - You are being harrassed, and it may progress to religious bigotry and persecution.\n\nYour wife is acting like a cultist/evangelical.  If this continues, you'll have to draw a  line somewhere.  This behavior may cause you to split as a couple or induce you to move away.  \n\nAsk her if she'd be happier if you left so she could find another man who was hyper-religious. Be prepared to pack your bags.", "NTA, no means no.  \n\nBut, I can tell you, I bet it's not her that's *really* doing the asking.  When I used to go to church as a kid/teenager, I'd always get asked every week by church elders or leaders where my Mom and Dad were (Grandma took us to church, parents didn't go).  Why aren't my friends coming to church with me?  What about all your cousins?  What about your neighbors?  Your classmates? Don't you want them to be saved? Do you want your family to join you heaven, or do you want them to be lost? Don't ever give up on them, the fifth or seventy fifth time you ask might be the one that opens their heart to Jeeeeesus! \n\nIt was incessant, even when I DID bring someone.  There was always the question, and it never did stop.  It's not right, but it is what they do.", "Haha after you snapped I would have been like “see! You need church!” \n\nbut for real NTA", "INFO What denomination is this? Sounds pretty culty, especially if she’s this into it after only a couple months.", "You can’t force someone to believe in God. It doesn’t work like that. If anything she’s pushing you away and making you resent her. Tell her that you respect her and her relationship with God and she needs to show you the same respect for your choices. That’s something that should have been settled before you got married", "ESH. You could have handled this better. You know, as someone who was in church growing up, the kind of pressure she’s facing from her church community to get you in a pew. You know her asking is coming from a mostly good place. You handled this with the emotional complexity of a nine year old.", "ESH\n\nWife shouldn't keep asking, you shouldn't have snapped.", "This is a loaded question. I'll just say this. NTA you can't make grown ups do anything. The God I have gotten to know since my mom passed in 2018 is loving kind and forgiving. People make it harder than it should be and therefore drive others away.", "We’re all praying 🙏🏻 for you!", "YTA. \n\nApart from not being there for your wife, you rudely snapped at her because she asked you four times over four weeks? Are you an adult?", "ESH\n\nYou're not wrong for having your poor experience with Christianity when you were younger and wanting to stay away from it. But YTA for snapping at her like that. You're meant to be a team and I hope you two talk and work that out.\n\nYour wife is TA because she should respect your answer and not make you feel pressured to attend church services with her. But as a Christian it's important for non-Christians/religious to understand that religion and faith are something that effect your entire being. It's part of the Christian faith to share it with others and she feels like she found something so great and amazing that she wants to share it with the person she loves most; you. \n\nSo know that her inviting you is coming from a place of love and not malice, but also you are allowed to not believe and not feel pressured either. Maybe you can agree to go on specific dates (Xmas, Easter) or if something else important is happening there. It's your relationship so you two make the rules on that but be a team together even when your beliefs don't line up.", "Info:\nIf she has had a genuine conversion experience, perhaps listen to her? If it’s just she is bored and trying something, I get your annoyance but do you know if it’s genuine or not? Because all that matters for a judgement.", "You are the asshole because you snapped at her. Communicate clearly but always kindly.", "INFO: Do you like your wife or care about her, at all?", "YTA", "YTA\n\nIt is not OK to treat your spouse that way.\n\nI understand your frustrations on both being asked multiple times, and the bad taste the experiences from your childhood gave you.\n\nWhat I can say, as someone that used despise the business of organized religion for similar reasons that you pointed out, is that not all Christian communities are the same. I'm not going to say your wife and sister's church community is a good one (because I don't know), but please don't lump all of them together.", "ESH yes she should stop asking but at the same time there is no need to snap at someone when you could just as easily politely decline.", "ESH... Shes evidently found something at church and wants to share it with you. Maybe it's a feeling of camaraderie. Who knows? Blowing up... not the best answer... it may solidify the idea you need church in her mind.", "ESH. Your wife is disrespecting your boundaries and is a huge asshole for that. But I looked at your comments and this one in particular struck me:\n\n> As far as the heart to heart if she wanted to have a heart to heart she would of let me know. We have been married for 10 years and openly discuss on subjects. She wanted to go to church I said okay go ahead I don’t pry into her life because honestly who would want a relationship where their significant other just hovers over them and questions their every move.\n\nI read this and I see that you don't have conversations about what is happening in your life. I think there is a big leap between \"hovers over them\" and being a spouse and just talking about what's happening in each other's lives. At a minimum, it would seem reasonable to say \"hey, you're really interested in church all of a sudden. Has something happened to bring this on?\" But it sounds like you're not even doing that minimum level of effort. You sound like you lead two separate lives that occasionally intersect and have now drifted to where your values are shifting and not on the same page. \n\nYou need to put some thought into your role in why your relationship is drifting, instead of thinking of yourself as anchored while she's the only one moving away.", "[deleted]", "ESH, and I know I'll get downvoted for this. \nYes, she should've accepted your statement that you don't want to step foot in a church again. I agree with that. But if you haven't bothered to have a conversation about it with the person you allegedly wanted to spend your life with, then you're not accepting her journey either. And you don't have to, but my guess based on the nasty way you described your church, she was either hoping to show you something she thought was different,  or heck, maybe she's afraid you're eventually going to hate her the way you hate \"typical Christian people.\" Or maybe she's just being a bitch, and trying to convert you, who knows? But I can tell you right now your marriage is ending, because that \"stupid ass church\" is important to her and you just shat all over it.\n\nGet a marriage counselor if she means anything to you. You don't have to tolerate her asking, but you don't have to be mean about saying no either.  Try asking her why she thinks asking you again is a good idea when you told her not to.", "Question: when you say that you previously politely refused, what do you mean? Was it just a 'no thanks' or did you actually take the time to explain that this isn't something you align with? I do get that everyone has the right to say no without offering an explanation, but given that this is your wife we're talking about, setting your boundaries clearly would be the better way to go. If you did that, NTA. If you didn't, YTA because it would look like your irritation would pile up each time and the explosion was somewhat passive aggressive.", "T", "Your married wife is showing up at a church alone… yeah she won’t get looks by any of the Christian’s there that you are not joining. She asked if she could be seen with you at church so she can do her thing.", "YTA. People who love you obviously don’t want you to go to hell. I hope your wife keeps it up.", "Agreed, NTA at ALL.", "It would not amuse me feel my spouse was harassing me about attending church. (I attend worship services regularly and its not like you hear the homilies better if you are seated side by side. That's absurd IMO. All that negativity and pressure are why lots of people can't be bothered with the faithful.)", "This seems like a naive question, she evidently believes that one needs to have faith for their soul to be saved so of course she is desperate for her husband whom she presumably loves to be saved also. I would be more worried if she wasn't pestering him to go to church with her.", "Which is pretty funny, because if these \"believers\" actually read the bible, they'll soon discover that once you're divorced, you're essentially tainted meat. Can't get married again.\n\nI'm of the opinion that it's all bullshit anyway, but I grew up in the church and saw many a member shunned because they wanted to date someone but one of them was divorced.", "And she would be failing the word, as it is written.\n\nMatthew 5:31 “It has been said, ‘Anyone who divorces his wife must give her a certificate of divorce.’\\[f\\] 32 But I tell you that anyone who divorces his wife, **except for sexual immorality**, makes her the victim of adultery, and anyone who marries a divorced woman commits adultery.", "Fandom is the perfect way to describe religion, and I am totally stealing this from now on. It's literally what religion is. You consumed a media form (the printed Bible), decided you liked the plot, characters, universe, whatever, and now you want to make it part of your daily living experience. Cool. You do you, Anakin, walk on the Dark Side. I'll be over here enjoying lembas bread with Frodo and the Fellowship.", "More I think about this more that you could be right.", "Yeah, I really hope OP gets out before they have kids, which honestly whether he wants kids or not her church will absolutely pressure her to do so. I can only see this going poorly. In my experience mixed faith (or lack thereof) in general rarely works out.", "685 now", "😂😂 I would of stared into an imaginary camera like Jim from the office.", "Your telling me u wouldn't snap after someone keeps asking you something when you already gave them answer if u say no your lying.he said no she needs to respect that", "It had been settled before they got married. The wife has made a sudden dramatic change.", "The church teaches marriage is not conditional upon anything but death. If you are truly a follower of Christ, you would know God hates divorce. If you divorce for this reason, you are living in sin", "Thank you for the prayers.", "They had communicated clearly, the wife ignored the clear communication and pressed on with asking him repeatedly.", "Nah bro. Not at all. Only been with her for 10 years. Might as well get the divorce settled right now.", "Even if your politely declined in the past?", "81 downvotes as of this comment.  You are all insane.  A woman wants her husband to go to church with her.  Somehow, you've all turned that into her being the brainwashed member of a zombie cult trying to suck him in and the marriage being doomed doomed doomed.  If she asked him to go to play bridge every week and he said no, what would that say?  They were going to lose everything they owned due to her rabid gambling addiction and she was probably inviting him along just to drug him and pimp him out to pay off her markers?  No.  Because that would be stupid. And no, I am not Christian.  My born-again mother made sure I'd never have any interest in being one.  I don't think it would have bothered me much if she asked me once a week to go to church.  Maybe she did.  Maybe it just wasn't important enough for me to remember.", "> A non religious person marrying a religious person is a recipe for disaster. \n\nThey were both non-religious when they married.", "So we talked when we first got together about church and religion in general and how I won’t follow religion or ever step back into a church and she was on board because she felt the same but here these last few months she’s been going to church and the post explains the rest. But to answer the question yes we have had pre talks about this", "Seems like a church like that isn't very accepting and is not a healthy place for anyone.", "It is a stupid ass church", "Does this work the other way? Do people who love you obviously not want you to believe false and harmful things? Should the husband be pushing the wife to abandon her new found beliefs with equal zeal?", "Sounds like she's well on her way to being fully indoctrinated by the church she is going to. You may need to have a serious conversation about whether or not your beliefs are still compatible. Be gentle but firm about the fact that she will not ask you again to join her at church", "Then your question needs to be \"why is my wife not respecting a very simple and basic request asked politely\"", ">.on the other hand when it comes to religion and faith it's way more complex and difficult than a lot of people here seem to love to make it.\n\nNo, it's really not complex. It's simple. Don't force your religious beliefs onto other people.", "Ah, yes.  The old church-as-pyramid-scheme... Perhaps you can ask your wife if anything about that strategy strikes her as predatory?  In other words, don't challenge her belief, but do challenge the institution and its business model, and have her examine how she allowed them to get their claws into her.", "You could always go and then point out all the flaws of what the pastor has been preaching on the way home, doing it every single time until she stops. I get that this is kind of nuclear, but honestly, you're probably about to lose your wife to what is essentially a cult. I'm sure you know this, but religion is one hell of a drug.", "Do it do it!\n\nAlso just the other day I saw a recipe for lembas bread and was thinking about making it. I hope it’s as good as the one you’re sharing with Frodo. Cheers!", "Not a Stan joke I’m cryin 😭 if your wife starts lookin like the kid from Final Destination RUN", "I agree she needs to, and I might snap too but that doesn’t make it right. Like I said the snapping wasn’t a giant deal, but it was still wrong", "It’s not okay to snap. Wives will press, they normally have to in order to get communication out of their partner. It’s still not okay to snap at her. That makes you an asshole.", "You seem to be taking zero interest in this frankly bizarre change of heart of hers.", "Yes, she is your wife, someone you supposedly love, no need to be harsh/snappy.\n\nEdit: saw you were OP", "\"If I could take it back yeah but the damage is done and I can’t.\"  \n\n\nIt is part of the human experience that sometimes we yell at our loved ones. You don't need to be so defeatist about it. I forget exactly where I read it, but healthy marriages include relationship repair behaviors. Some couples go through their marriages almost never end up fighting but end up divorcing because the things they do fight about, they're unable to repair. It's a necessary and valuable skill that people can build.   \n\n\nYou apologize for yelling and anything more specific than you can (without the buts, without telling her \"you made me do this\") and open up a conversation about what has changed for her. What is she worried about? Be curious.\n\nI loved the post I saw yesterday with the Pakistani guy whose fiances racist parents tried to give her a house and get him to sign a prenup. His update after talking to his fiance seemed really mature with good problem solving. \n\nA lot of redditors are young. They've never been married. They're more likely to be atheists and identify with you not wanting to go to church. It's fun and easy to take a black and white view of things and they don't know your wife so it's easy for them to demonize her. Outrage triggers dopamine release in the brain. Take your time, go slow, talk to friends who care about you guys as a couple or a therapist if that's easier. \n\n10 years is a long time to be married. Congrats on that! You've been together even longer than that and it can be easy to lose curiosity about each other and feel like you already know everything. But both of you are always changing and growing and if you've had poor or nonexistent role models of how to disagree with each other it something you guys can work on. Make it 50+ year <3  \n\n\nIt is okay for our spouses to ask us to do things with them, even repeatedly. It's okay to say no, even repeatedly. Those are neutral behaviors. Negative behaviors are yelling and being rude. Positive behaviors are taking the time to have deeper conversations and apologizing when we mess up. Conflict can bring us to better understanding and closer connection when we have the right skills to handle it. I think I read that in one of John Gottman's marriage books.   \n\n\nYou got this! You can figure this out.", "The problem with this is it sounds like neither of them expressed what they needed from one another the same question and responses were uttered.", "Yep this will be it - a relative of mine was in a dark place and turned to religion, they helped her feel better about things but then she took her life in the end because her religion made her feel like such a failure for not converting her family.", "And maybe she truly believes that you need to be “saved” and is willing to “martyr” (be the “bad guy” here) herself to do so. If she can just get you to go, she’ll have all the reinforcement in their home base to “convert” you. \n\nMakes me wonder how she got tied up in this if she was initially ok with you not going. This was one of the first things my wife and I discussed while dating. We’re really not fond of religion, despite our respective families feeling differently. We choose to live close by but not too close to get dragged into it.\n\nNTA. I wish you the best of luck, religion is a sticky situation.", "Completely feel this one. When I stepped from the faith I was still forced to go to church by my guardians but told not to take communion. I think they hoped peer pressure would kick in but while most of the church was too nosey the pastor and his wife loved me and respected my decision. Honestly I think my guardians also just relied too heavily on their perceived standing in the church. Social politics in churches is insane", "I don't think it's that. If she's this intent I reckon she thinks the man she loves will burn in hell if she doesn't get him to go with her.\n\nNevertheless, ignoring his boundaries and trying to steamroll him is still TA thing to do.", "I really suspect this is what is happening. She’s probably being pushed to convert her husband. Or she wants him to go so they look like the happy Christian family. I know a married woman going to church alone gets some side eyes", "Absolutely she is. And she just needs to say - this isn’t his thing and move on.", "If you think about it from a religious person's point of view it makes sense why she won't take a simple no for an answer. If you genuinely believe that church is the path to salivation and otherwise you'll go to hell, of course you are going to try hard to make sure the person you care most about in the world goes.", "It certainly is the most lucrative one.\n\n\"You don't get rich writing science fiction. If you want to get rich, you start a religion.\" \n\nL. Ron Hubbard", "Honestly a lot of people have the same values as it's based on morals. It's not that people have the same values that Christ embodied, it's that Christ's values was literally based on basic morals. \n\nIronically alot of religious people don't have these morals... Judging others being one of the worst traits extremists have.", ">You might be turned off by church, but you seem to have at least some of the values that Christ embodied.\n\nJesus doesn't have a monopoly on \"selflessness\" lol.", "She hasn’t changed much other than going to church?  She just started going and we haven’t had a conversation of why because she hasn’t wanted too. I’m just waiting for her to want to have one and I will\nListen", "You argue that he loves her because eos has a double meaning, if she loves OP she should stop bothering him to join his sect", "The last and final time I will ever set foot in a Christian church, the preacher mocked gays by flamboyantly walking across the stage. It took every ounce of my highly offended ass to not get up and leave at that very moment. \n\nNever again.", "Wait, is that how they interpret that parable? Do they ignore Jesus saying he came to tear brother from sister and husband from wife?", "The tithing plate, the voting booth, and the personal power of the pastor.\n\nDon't think this proselytization shit is happening in a vacuum. It's intended to create a cadre of extremist voters to replace the ones who have already jumped ship. It's all about money and power.", "The great thing is that hell isn't real.", "Ya that’s why the Utah is the home to many MLMs.", ">Get out of town with this mega church nonsense\n\nMega churches sure seem to be interested in building new amenities.", "I love this analogy.  😀", "Yes. The church people see the husband as the moral head of the family, and her family is in trouble if her husband is home and not at church with her.", "That's how abusive authoritarian death cults work.\n\nThey use fear and manipulation to control as many people as they can. \n\nOP knows this.\n\nOP is being very considerate and patient with his wife who is basically in the grasps of a socially acceptable cult.", ">church is the path to salivation\n\nmmm terrible coffee and sometimes donuts.", "Yeah this marriage is done.", "If you don’t have kids yet and plan to have them maybe wait a moment and see how this develops… NTA but this might be a game changer", "They instill fear in their members. If you don't do this, you're going to burn in hell for eternity. Then she worries for you because she doesn't want you to burn in hell for eternity. \n\nThis is why religion can be such a deal breaker. She's not willing to compromise because she truly believes she's trying to save you from an eternity of torment.", "Fully support raccoon utopia over religion", "ESH Means everyone sucks here right? She is an asshole because she keeps asking, he is an asshole because he snapped when he didn't need to. If I'm wrong tell me why.", "Yup. I was raised Jehovah's Witness. The religious trauma is real.", "Oh I had a full on breakdown when I “wasn’t strong enough” to bring my Jain friend to Christ. I had talked to her and asked questions about her religion and just could not bring myself to tell her how she was going to hell. So of course, I blamed myself for *sending* her to hell with my weakness. Evangelical Christianity is fucked.", "Ahhh yes. See my parents, who harassed me right into permanently severing our relationship.", "A \"get out of hell free\" card? Who knew! \n\nAlas, in my family we don't have one of those. Guess we're all bound for the warm place, unless lives lived to a high standard of ethics, integrity and social and humanitarian values counts for something.", "In this parable, brother and sister are as all children of God; not the PHYSICAL brother and sister. It says that if the unbelieving spouse chooses to leave the union the believer is not bound (enslaved) by the vows.", "It’d fr be easier for me to get over infidelity.", "he’s told her multiple times how he feels about church and religion. did you read the post?", "I had the same questions, so thanks for being nosy.", "It's not a cheap shot if it's just accurate.", "story time.\n\nI was invited to a \"friend's\" house in high school, over the summer.  Said she was having a party.  It turned out to be a literal come to Jesus meeting.  The pastor told a story about how this young couple bought a house and there was a smell coming from the chimney and how they couldn't figure out what it was.  They called an exterminator and the guy found a dead, rotting squirrel in their chimney.  The pastor proceeded to say, \"those who do not accept Christ as their personal savior are like that rotting squirrel in the eyes of god\"\n\nI was shocked.  That was 20+ years ago and I still remember it like it was yesterday.", "From what I remember being told in high school RE lessons, Sikhism also doesn't encourage recruiting people.", "It’s generally true evangelical Christianity but not all religions involve proselytizing, many are pluralist, and plenty have healthy and open dialogue with other faiths and the non-religious", "I had a friend in junior high who died in a car accident, K. She was a good person. Rights after, some in our friends group were saying how sad they were that K was burning in hell now… because she wasn’t Christian. I had been I guess agnostic until that point. Those “friends” solidified my disdain for Christianity and how offensive it is that they believe those who believe in their magical sky being are in heaven no matter how poorly they treat people their whole life as long as they just ask for forgiveness. While good non-Christian’s burn in hell for eternity. The promise of heaven and threat of hell is the WORST reason to try to be a good person IMO.  NTA.", "Holy carp, that is just vile.  I had more than one pastor with similar attitudes growing up", "Heck half of hell is gonna be fangirls and boys  of any show/book/fanbase for selling their souls for “that one pairing I like” \n\nI’d be probably with them.😆", "Greatest statement ever.  I’m going to have to remember this one.", "Well, except you are wrong.\n\nI'm an atheist, and even I know that.", "No, I mean does your wife’s church also behave in the way he describes his sisters church as behaving? I assume no.", "It would have been simpler and less painful to just pay up front.  The didn't even try to hide the fact that all they want is money.  Crazy.  And yet somehow churches are still confused about why less people go....lol", "Listen. I had to unfollow the ACOTAR reddit page just today cause I couldn't handle these girls anymore. I would still hang out with them over my hometown Baptists.", "You're never alone in the raccoon utopia", "Pffftt….yeah I’m gonna guess they are the crazy fans of ACOTAR. At least you’ll have better conversations in hell then.", "Never alone. Frank and the gang", "My first wife and I both came from religious families. Before we married we discussed our outlook toward religion, church attendance, etc. and agreed that we would go to church for weddings, funerals at Christmas and Easter (to appease our mothers) but that we would not lead a church-going life. Unfortunately, a few years in, she re-found the light and started pressing me to attend church with her. My response was that we had an agreement and that I would not be going. She continued to press (much like op’s wife) to the point where it became the defining issue in our marriage. We went to several counsellors, all of whom told her to lay off for the sake of her marriage but she could not. I eventually had to divorce her, there was no reconciliation.", "Nta,  heck I ended blowing up on an 81 yo (my ex gmil) who was a witness for continously forcing her religion on me and saying I was a bad parent for not getting my kids into the kingdom hall. My thought it is if she couldn't respect me the first 100 times I kindly declines and told her why, then I'm going to slowly over time get less and less kind and then once the insults about my parenting start simply because I'm not accepting her church that's when I got nasty back. Unfortunately that's what it took to work and to have her never ask me again. \nReady for the down votes for snapping on an elderly woman but age doesn't mean you're exempt from disrespecting peoples wishes about religion and then saying they're a bad parent due to it.", "Not all religious people are the same.\n\nWhat has happened in your wife's life that has made her turn to religion?", "Let me start by telling you I am Christian.  Now that is out of the way, I understand how you feel. Nobody should be harassed.  You can’t be harassed into a life you don’t want.\n\nThere is a passage in the Bible where if you’re saved while being married to a non believer, you should stay in the state in which you first believed, because you may win over your spouse WITHOUT A WORD.  Your wife is ignoring the wisdom of those words.  \n\nLong story, but I was a committed agnostic when I married but changed the rules of the game about 15 years later.  It happens.  That was 15 years ago and after a few adjustments, we navigated remaining together.  But if my husband said no to church, I would leave him alone.  I know that because he still doesn’t go.  I don’t discuss it with him.\n\nEdit to add judgment.  NTA", "NTA. No is a complete sentence.", "NTA.\n\nThis is one thing I'd probably leave for, if my spouse started to dive into it. *Especially* if it was the church i went to growing up. I have a lot of trauma attached to that place, and I might physically punch somebody if they even mildly suggested I return to the place I was abused.", "I hate to say it, but it sounds like your wife has gone down the religious cult rabbit hole and you may never get her back.  It's time you sat her down and had a long conversation with her about why she is turning to religion and trying to force you to turn too.", "NTA. But you need to have the deeper less fun conversation about whether or not her newfound religiousness (and religious refusal to respect other's boundaries) is going to become a deal breaker in your marriage. For my personality, her behavior is extremely problematic. Both in and of itself and what the rapid shift implies about her state of mind.", "NTA\n\nI told my husband before I married him, if he finds jesus, the dude better have a couch to sleep on because that crap is not welcome in my home and is license for divorce.", "Christians are not historically good with consent. The fact you are saying no, and the fact you have every right to expect your boundary is respected, means nothing to a Christian. \n\nYour wife is probably being fed all sorts of BS about needing to convert you to save you.\n\nI hope for the sake of your wife and your marriage that she doesn't fall in with them.\n\nI, too, was raised in an extreme Christian environment and have zero time or tolerance for xtians and their bullshit.", "NTA, in general, but YTA for snapping!!!", " Neither are AH but ya’ll need to do some talking about this if your marriage is going to survive.  For religious folks, faith goes to the very core of who they are.  Same for you; whatever happened that makes you despise church goes to the core of who you are.  If the two of you cannot share those parts of you w each other in a loving and understanding way then it’s going to be rough going.  I think ultimately agreeing on church is less important than acknowledging each other as humans and finding a way to be good to each other. \n\nWhy does she want you to go? Obviously she’s not going to convert you.  But you should find out why that’s important to her. Maybe she just wants to share some important thing in her life with you; is there something else you can do together? And she should know why you don’t want to go (trauma with churches in the past? Just don’t believe that stuff? What do you believe?) \n\nFor the record, I am someone who would burst into flames upon entry into a church.", "You didn't tell. You yelled at her. So, do you yell at her when she asks you to do things around the house or go to the store? Your response to her asking a question is to be verbally abusive. I don't care that you answered the question in previous times. She is trying to include you in her life. If you don't want to be in her life, then divorce her but don't abuse her. \n\nAnd you will never get a true answer when reddit users are bigots when it comes to religion. \n\nYTA", "This is the kind of thing I'd to think to do but never actually be able to. Lol", "\"Socially acceptable Cult\" is the best way to describe Church culture and Christianity in America", "Dang I’m sorry bro", "I’m very heavy on the you earn my respect I’m\nNot giving you my respect for surviving 2 world wars, the Spanish flu and titanic. Lol but I’m all seriousness I’m not gonna change my mind.", "Nothing that she’s talked to me about. One day she said she wanted to go to church and I just said okay and she went", "No he shouldn’t be glad she wants to include him in something he clearly hates. Let’s have better standards", "She clearly wants to convert him. They aren’t going to watch theatre", "He had extensive conversations about religion already. She can make the choices she wants for herself but she needs to leave him alone", "But isnt not taking no as an answer and ignorimg set boundaries also a firm of abuse? Isnt trying to impose your spirituality or religion or lack of a from of abuse to? If she was an atheist forcing him to read dawkins with her as a bonding activity, for example, im not sure youd like it. Freedom of religion, implying freedom of lack of, is literally a human right listed in UDHR 1948 and enshrined in many liberal democratic  constitutions. So its a bit abusive for her to be consistently at him. She should give an open invite and leave it at that.  So isnt ot an esh situation? \nAnd isnt it a bit harsh to say reddit is bigotted? A few comments yes, but most support her right to go to church just not her right to not take no for an answer.", "I can't tell if this is God-tier (LOL) satire and whooooshed me, or if this is a genuine response. If the latter then eww.", "Is she an adult? Does she understand the word NO?", "> People don’t just up and decide to get active in a church\n\nThey usually get recruited.  Kind of like how OP's wife is trying to recruit him.", "I know someone who's Buddhist, that nails every hypocrite Christian with,\n\n\"Don't preach Jesus, be Jesus\" \n\nMost \"Christians\" wanna talk that talk but don't truly walk the walk. \n\nEveryone's spiritual journey is personal, and if your wife can't understand or respect that, or tell the people pressuring her at church (which is probably what's happening) to kindly fuck off, then the subject is taboo and not to be discussed unless she's ready for a real down to the ground conversation about it. \n\nSigned, a filthy fuckin pagan. \n\nHappy Ostara y'all. \n\nNTA", "Knowing those kinds of churches, I’m sorry and I wish you luck. It sounds like she’s getting dragged back in to the fire and brimstone, live in constant terror, continuously pester everyone around you to convert or you are a bad Christian type of church. If she continues on that trajectory it’s going to be a big struggle for your marriage. I hope she sees sense.", "What denomination does she follow? Just curious as some are much more fanatical about recruiting non-believers than others. \n\nAlso, newly converted Christians are often way over the top. \n\nIt’s like when you first try Japanese mayonnaise and you just can’t stop telling everyone how wonderful it is and how it will change their lives.", "It's actually a retention issue. These churches indoctrinate their members with methods designed to annoy other people so as to isolate them. \"See, we told you they wouldn't accept you. Only we understand . Everyone else rejects you, but not us.\" The people who run these places know that what your wife is doing will alienate you, while driving her further into their community.", "That sounds like a cult and all that, I hope she dosn't end like toes psychos that scream at people for being sinners.", "Ugh. Are they charismatic? Charismatics are crazy. Double ugh.", "We pray to Darth Maul in this household, get out!", "I've also seen religion described as a book club lol", "That's what it is", "Don’t be sorry, I re-married a few years later and have been happily married to my second wife for 20+ years.", "Your comments are fuckin cracking me up lolol", "You should consider talking to her about it sooner rather than later. Religious differences are not an issue that is going to solve itself.", "I’m not sure if this comment is directed at me or OP since my relationship isn’t in question. I don’t know which Christian church you’re referring to as there are many, and while my church teaches that divorce isn’t ideal it happens to be a “necessary evil.” Not so much that God hates divorce but doesn’t approve of anything that makes a mockery of marriage. And I would argue continuing a marriage that isn’t good for either spouse isn’t the point of marriage, and therefore would be a mockery.", ">I have a feeling that, when at this church, she is getting constant questions like “Where is your husband? Why isn’t he here?” and if the parishioners are fanatical enough, they may be borderline harassing her with questions and comments like “Doesn’t he know he will be going to hell? Why aren’t you doing something about this? Don’t you love him?”\n\nThis. There are Christian sects that don't mandate proselytizing, but the ones that do are basically a pyramid scheme--you have to \"save souls\" constantly, and if you don't, you're actually a bad person and won't go to Heaven.", ">I have a feeling that, when at this church, she is getting constant questions like “Where is your husband?   Why isn’t he here?”\n\nThis. My father in law stopped going to church when the Catholic child abuse scandal broke and everyone assumed he died or was sick. My MIL got questioned constantly, it was so upsetting for her.", "Those kinds of questions when I was just a kid about where my parents were are why I stopped going to church and haven't gone in 25 years.", "Add to this they could be telling her demons have access to the home because you are \"unsaved\".\n\nNTA", "She's probably getting those comments from church members, but I bet her real goal is to \"save you\". New Christian's think they've discovered something incredible and want you to have it, too. And, she doesn't want you to go to \"hell\".", "Colanders for everyone!", "I agree with you, but asking someone if they want to go to church with you isn't \"forcing\" them to do anything, anymore than asking if someone wants pizza even though they've told you before they don't generally like pizza. I'm not saying she should continue doing it...I'm saying if her beliefs are that if she doesn't ask she's doing something wrong and her husband is doing to go to hell it makes **perfect sense** why she'd be encouraged to ask him, even if she knows the answer is probably no.", "Live and let live just doesn't exist in Christianity. We were literally taught as children to \"save our friends from the fires of hell.\" We would badger them and beg them to come to church so that they would see the way and get saved. It is DRILLED into you that you MUST save your friends and family, or else you have failed as a Christian.\n\nI haven't been to church in 10 years and I don't miss a day of it.", "We pray to the Mexican Jedi- obi juan kenobi. Father of the high ground. Slayer of legs. Saint of “Hello there”", "I think I saw the same recipe!", "Got to find the comedy in somethings. Sometimes I can’t be serious at all because of all the trauma, I mean spicy memories I have.", "Speaking from experience: They will also try to break your marriage, and replace you with a Righteous Godly Man. As a matter of fact, they're doing it right now.", "You won't go to hell if you don't go to church or if you do go to church. Because there is no hell.", "Thy noodle come, Thy sauce be yum, on top some grated Parmesan. Amen", "A step of AA is admitting and believing in a higher power than oneself often if its hosted in a church by said pastor/priest its that religion pushed. It's one reason a lot of people who are non religious or of other religions have issues with aa.", "It is when you start harassing said person about eating pizza when they told you they are vegan", "Agreed, and in some sects it is the spouse’s responsibility to save their spouse - Catholicism, for example, teaches that marriage is a sacrament that can be used to bring a partner to heaven. On the other side of the spectrum, Baptists and other fundamentalists believe that marriage between “unequally yoked” people (aka one is “saved” and one isn’t) is almost verboten, so it’s possible OP’s wife could be receiving some nasty comments about why she chose to marry someone who clearly wants to go to hell.", "I'm stealing \"spicy memories\"", ">To be honest I don’t even know if she knows why she wants to go to church.\n\nAren't you curious to help her find out?", ">“I don’t know what spiritual battle thing you have going on but it’s something you have to deal on your own because I’m not going to that stupid ass church.”\n\nLike, oof. \n\n>I’m just waiting for her to want to have one and I will Listen\n\nShe clearly has something going on. Yes, she should be talking about it with you, but given your reaction to these things, I wouldn't be surprised if she feels like she can't.\n\nYou're the man. Take charge and talk with her", "OMG... this is bringing me back. My dad's best friend was Jewish and I was so worried that he was going to hell. I literally lost sleep and had nightmares about it. So traumatizing. Glad I got out.", "I can't stand that hate the sin not the vsinner bullshit.", "It is completely how certain Christians justified the subjugation and even enslavement of entire groups of people. If they are doing it even partially to \"bring the word of Jesus Christ,\" anything they do is ok because they are saving the people's eternal souls.", "Yes, nothing makes you want to come to Jesus more than wanting to gouge your own eardrums out.", "The Crusades has entered the chat", "I was sitting in a pew with a guy I had recently started seeing (it was his church, I have never been a churchgoer) when the pastor explained that \"bearing false witness\" meant telling people it was okay to be gay, since by accepting their \"choices\" we consign them and ourselves to perdition.\n\nI looked at the guy I was with with a startled \"are you fucking hearing this?\" kind of expression and he was just staring up contentedly at the pastor, nodding along... Lord spare me from religion.", "Yes but I find that hard to rely on doctrinally while at the same time ignoring the sentence directly after what's been highlighted.  It seems if we've accepted this verse, for arguments sake or not, then there is no need for urgent witnessing.  Im also not convinced that the plain text of the bible is an accurate depiction of what is taught in churches.  Although it's admittedly fringe as a pentecostal thing, this is usually one of those things that is used as a general thing within certain guidelines, and not usually practiced or taught as an overarching command. I've personally seen people receive guidance to leave their spouse as final measure meant to protect their spiritual welfare when the spouse just didn't want to be part of the church.  The easiest explanation is something along the lines of the multiple umbrellas analogy.  The wife's umbrella is the husband, who is himself shielded by god.  If god is missing and the husband becomes corrupted as an umbrella, that leaves the wife vulnerable and so at some point she needs to step back under God's umbrella with or without the husband because it is her duty to be an umbrella for those under her.  But to be clear, I don't hold any of these views, I'm only speaking to what I experienced.  I'm not arguing for the view or its validity(im sure its all bs), only that it exists.", "This exactly. My daughter s FIL has been an abusive drunk years ago now he’s an abusive “Christian” and she will have absolutely nothing to do with him. He doesn’t get to see any grandchildren", "While I understand the point, I disagree with it. Someone eating meat is not worried about their soul burning in hell for not doing what they're supposed to do, while in some faiths that is the case for people that aren't trying to bring their loved-ones into the faith.\n\nWe can talk about the unhealthy atmosphere that creates, for sure, but there's a big difference between the two things.", "I wouldn't necessarily say their marriage is doomed, lots of people with different religious backgrounds manage to make it work. But OP and his wife are definitely on diverging paths at the moment.", "Not really. Anything that has to do with religion instantly loses my interest", "Lol \n\n>You're the man. Take charge and talk with her\n\nHilarious, yes, force her to talk that will work out well.", "The idea of eternity in hell is pretty much from the devine comedy. \n\nThe bible doesn't really define it as a place as much as you just not existing while those who go to heaven live on. \n\nThere are very very very big liberties taken in the modern translation of the bible.", "I thought it was The Inquisition (What a show . . .)", "If the church is guilting her over this he's never going to be happy again. Hard to beat damnation as a motivator if the hooks are in. Couples counseling at a minimum. And that is always a strain on resources. Works as often as it doesn't.", "Are your hangups about religion more important to you than your wife's welfare?", "God: you're trash! Scum! Rot! Now thank me for caring about you when you don't deserve it.\n\nUh, no? That's literal abuse?", "That was unexpected", "Is her religion more important than my peace? I don’t get your questions. They seem one sided and for some reason you want to paint it as I’m leaving my wife because she’s going to church.", "That’s a ridiculously loaded question. She can practice her religion without OP’s involvement", "That's almost as bad as the pastor at my step dad service. They died in a car crash and it was a well known incident, and their sermon during the service, how life is a car ride and that Jesus is a passenger and that when they stop loving and keeping Jesus in their life, they're going to get into a car crash..", "Hey, if their ceremonies are as good as their oats, I'm in.", "I have been to an evangelical quaker megachurch and sweet Jesus you don't want them to do that.", "I think your wife should be discussing it with you, but I'm talking with you, not her. \n\nI just can't fathom my wife getting into such a huge life change and not taking the slightest interest in it. \n\nWhat if she's had a traumatic experience she's struggling to deal with and the church is one way she found? Wouldn't you want to know and help her?", "I think live and let live is also a crutch. You are trying to feel good for as many hours as you can before you eventually die and rot away…", "If it was that traumatic she would talk to me about it and I would of known. But again idk. we will have to talk about it soon"]}