{"id": 12911, "submission_id": "11yh9f1", "title": "AITA for forcing my daughter to remove the “do not disturb” feature from her phone?", "selftext": "My daughter (16F) has her phone on do not disturb all the time. At first, it wasn’t an issue since she would still answer my texts and calls whenever she is out at practice. For the past few weeks, she has stopped answering my texts and calls and she wouldn’t receive them since I’d ask her why she wasn’t answering and she’d claim she didn’t get them. I am not stupid. Her phone is on do not disturb and none of my texts and calls are going through. I’d ask my other daughters to see if they can reach out to her whenever she is out just to ask her what time she might be home. No answers. My oldest (22F) would try to call, text, FaceTime, you name it in order to ask her when she might be home. \n\nOver the weekend, my daughter had to attend an event at school and when I came to go pick her up, she went MIA and wasn’t answering any of my texts and calls since again, the do not disturb feature was on. I started to get frustrated over it so when my daughter finally entered the car, I told her that she needs to start answering my calls and texts and she had no reason to ignore me when she knew I was going to pick her up. My daughter gave me the excuse of “oh I didn’t see it” again. My frustration turned into anger so I start yelling at her and said, “NONE OF US ARE ABLE TO EASILY GET AHOLD OF YOU! SOMETHING THAT NORMALLY TAKES TWO MINUTES TAKES TWENTY OR MORE SINCE WE CAN’T SEEM TO GET YOU TO ANSWER THE PHONE! YOUR FATHER AND I HAVE BEEN WORRIED SICK WHENEVER YOU DON’T ANSWER THE PHONE!” I then told her she has two choices: either she removes the do not disturb or her phone gets taken away for a week. \n\nMy daughter rolls her eyes and said it isn’t fair for her to not be allowed to have the do not disturb feature. I said she needs to start answering her phone or at the very least, call us back right away. I said that if she doesn’t comply, her phone will be taken away. She begged me not to take her phone so I said she needs to remove the do not disturb feature. She refused once again. \n\nWhen we got home, I told her if she doesn’t want her phone taken away, she needs to remove the do not disturb feature. After some back and forth, my daughter removes the feature right in front of me before running to her room in tears. \n\nNow, before anyone thinks otherwise, I did allow her to have the phone on do not disturb as long as she answers our calls and texts. We’d have to call her more than once to get a hold of her but she is completely unreachable. I think I was too harsh but I was at my wits end. \n\nAm I the asshole?\n\n\nEdit: some of you are thinking I am spamming my daughter with phone calls and texts while she’s at school. I do not message her during school hours. The issue is taking place after school or on the weekends. My daughter most of the time does not tell anyone where she’s going, doesn’t ask for permission when she wants to go out with friends and would sneak out of the house every time her father and I are out of the house. None of my other children would have no knowledge of where she is and even they’d ask her but she won’t answer her phone (sometimes my son will ask her if she could buy him something from McDonald’s or if they can go to target together). We did speak to her before and said she can keep her phone on do not disturb and we would never call her or text while she is in class.\n\nEdit 2: my daughter has also been lying to us about where she’d go. She’d ask to borrow the car to go get food, but would come home two hours later. I’d call her after 45 minutes but the phone would go straight to voicemail. She normally does tell us if she’s going to class or practice but whenever she goes out outside of those times and doesn’t tell us, she will not answer the phone. It’s like she’s hiding.\n\nEdit 3: some are suggesting I take car keys away. The problem with that is, if there’s a car available, she will leave. She’s taken my oldest daughters car a few times and when she’d ask where she’s going, she would say “none of your business.” My oldest hid the car keys from her and it would be met with manipulation and my daughter crying and screaming.", "created_utc": 1679487375, "permalink": "/r/AmItheAsshole/comments/11yh9f1/aita_for_forcing_my_daughter_to_remove_the_do_not/", "score": 194, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I am the asshole since my daughter has a right to boundaries and I feel like I am disrespecting her boundaries by forcing her to remove her phone off of do not disturb. Nobody can get a hold of her when we need her and that causes me and her father to worry since my daughter can be unreachable most of the time when she isn’t home and it was starting to become problematic.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nA teenager has the phone to be contacted.  If she can't use it for its intended function, she doesn't need it.  The Do Not Disturb function can be set up such that priority contacts go right through it.  She is choosing not to.", "NTA.  As a parent, this is infuriating.  My kids used to do it.  There are situations where the DND function is perfectly acceptable and it has its place.  But, you are paying the bill for that phone.  She has a phone out of your kindness as a parent and she has no right to have a phone.  You have EVERY right to insist she take it off of DND.\n\nEdit:  Wow, so many YTA.  Parents get phones for their child to have some independence and connect to the world.  This parent was not overbearing and hitting the kid with calls all the time.  When a parent needs to reach their child they should be able to reach their child.  If they miss a text or a call it is understandable, it happens.  This kid was NEVER answering.  Repeat, NEVER.  The price the kids pays to have the phone is simply be accessible.  They get all the benefits of being connected to the entire world, their friends, their entire family, the internet, social media, apps, games all for the low low price of $0 and responding to mom and dad when they call or text.  Totally fair.", "NTA, and thank you for the edit, that was very relevant information.\n\nShe doesn't have any inherent right to a phone. Further, if she will not use it to communicate about important things, then there is no practical reason for her to have it. \n\nHer habits of sneaking out/sneaking around are more concerning - I'm not sure what the solution to that is, but she absolutely needs to be grounded since she is so ridiculously irresponsible.", "NTA She's deliberately choosing to make sure she's not seeing your texts. Between that and the sneaking out you have a problem here. At the very least some family therapy to see what the problem really is? But if she's not going to answer reasonable calls and texts from you then the phone needs to go and she needs to be grounded.", "NTA, but given the behaviors, I would certainly consider other, more harsh consequences for her actions.  Clearly she's being sneaky and manipulative.", "The Y T A votes are coming from teenagers. Lol\n\nNTA", "So my phone makes zero noise. Its on both dnd and silent. That means that i only get some notifs when i actually open the app theyre from and others just collect at the top of my phone in the notification bar. None of them interrupt anything im doing on my phone and again my phone makes absolutely no sounds whatsoever. So even if she doesnt get the notif immediately they are going thru and are in her notification bar, shes clearly just not looking at them \n\nThat said, you can make exceptions in your dnd settings so that certain notifs or numbers can get thru when they call/text. Assuming your kid doesnt also have her phone on silent she very much can use this setting to allow yours and her dads numbers to bypass the dnd function and she will hear those notifs. Then she can keep her dnd and have zero excuses for missingyour calls/texts \n\nEither way youre NTA for requiring your minor child to keep a viable line of communication open and available at all times", "NTA\n\n\nConcerned on what she may be hiding. Your husband and you need to have a serious sit down with her. I hope she isn’t hiding something serious or mental health struggles. \n\nThough no DND unless family contacts are made priority notifications. One strike of her removing them. No DND at all or phone for a certain amount of time even.", "NTA but she didn’t remove DND, she just turned it off. It can be turned right back on again.  Either way, if she’s just doing whatever and not telling anyone where she is or when she’s coming home you have bigger problems than her phone.\n\nIf you were calling her constantly then maybe I could see it but you were there to pick her up and you were left waiting because she was unreachable. It’s rude.", "NTA. She IS hiding when she “grabs food”, also she is a teen! That phone is in front of her face 24/7. She saw every single text and missed call.", "Nta the phone is to be used to get a hold of her.  She either removes the feature or gets a not smart phone that doesn't have the feature.  \n\nDoes 16, she absolutely needs to be responding.  \n\nSince she is lying about where she is, I'd also put a location tracker on it.", "NTA. If she can’t follow simple rules she shouldn’t have a phone. End of story. Phones, like many things, are a privilege not a right", "NTA for the intent behind it; assuming you're contacting her for genuine reasons and at reasonable times (as opposed to during classes for example), but like other commenters said this isn't an effective way of doing it.\n\nInstead of threatening to take away her phone or demanding she removes the DND feature, just have her add your number to the exemption list. Pretty much all phones have this option, though going by the ages of your children I'm going to give you the benefit of the doubt in the sense that you might not be as tech-savvy.", "Nta\n\nDo not disturbo filter + a special ringtones Just for you = perfect timing for all the activities.", "NTA. She has been lying, sneaking out, and purposely ignoring you by setting the Do Not Disturb on. You and your husband should sit her down to try to get to the root of her behavior. Don't attack her, and talk to her like an adult, and let her know how worried you both are about her behavior. It might be a teen rebelling without cause, or it might be something else. Maybe she is seeing someone she shouldn't be seeing? Who knows, but family therapy might help.\n\nThe Do Not Disturb feature has filters. Add your numbers to it so she has no excuse not to answer your texts/calls.", "NTA. You've made more than one request. There's too much negotiation. Take away the phone already. I wouldn't even give her data. When you give it back, reduce her to a call and text plan. It costs about three bucks to call your wireless and lock her data usage.", "NTA, but based on your edits, this is a band-aid for a deeper problem. If your daughter won't tell you where she's going, she doesn't get to borrow the car. If she comes home much later than she said, she loses car privileges for X amount of time. If she manipulates and cries and screams for car keys and you give in, you are teaching her that she can get what she wants by manipulating, crying, and screaming. Take control of this situation and make it clear that driving is a privilege, and abusing it means she loses it.", "NTA. I'd be more concerned about the disappearing act. She's going missing for hours and taking cars without permission...you have a different sort of problem. Older boyfriend would be my guess. If you pay for the phone,  she should answer when you call but she's choosing to be rude and disrespectful. Add Life 360 to her phone and work on being more tech savvy.", "YNTA your daughter is not being responsible with having the do not disturb on. If theres an emergency then what?  If it was my kid either it stays off or there is no phone. My son is 16, he knows very well that a phone is a luxury so he knows the rules. His cell stays on silent because he doesn't want to be disturbed if his busy I get a text or whatsapp saying so then I know that he wont respond immediately. The only time he doesn't care to check his phone is when he is at home.", "NTA. Your child is still a minor and you make the rules. It is not unreasonable to say that she needs to respond to your texts so you know she is safe.", "NTA. You're the parent, you get to set the rules. But to be honest, I don't really see how taking away the phone would solve the underlying issues of her being late and unreachable. It kind of seems you need to start making ultimatums on car usage.", "NTA\n\nthe only reason a child should have a cell is to contact their parents. if she is setting it to DND and refusing to check/call back her parents she does not need a phone. let her cry it out. im not even sure why it is so important for her to have DND on? other than to avoid her parents.. she is defo sneaking around or doing something shady. \n\n&#x200B;\n\nstand your ground. you are parenting your child, good on you", "NTA, but you have more problems with your daughter than her using the do not disturb feature on her phone. You need to put a stop to her shenanigans and fast. She's heading down a bad road.", "NTA - this is called parenting. You bought your daughter a phone so you can contact her as required, she is deliberately ignoring you and lying to you about her whereabouts and where she is going with car for hours at a time (which seems like a bigger deal to me). Frankly, the actions that you have laid out need to be corrected for your daughters safety and everyone's peace of mind. Personally, I would be very tempted to take your daughters phone and add you and all your important family members to the do not disturb priority contact list so you can always get through to her, then turn on location tracking on her phone so you know her whereabouts at all times. This gets turned off when she is 18, buys her own phone and pays the monthly bill for it, or when she has actually acted in a manner suitable to regain your trust.", "Your edits make this seem way outside the scope of AITA. You need to find out what is up with your kid.", "NTA. I'm betting you pay the bill. She ought to get used to things she doesn't like, and if the do not disturb feature brings her to tears so won't her adult life.", "NTA. Was originally going YTA until I saw she doesn't answer at all and lies either outright or by omission on her whereabouts.\n\nThe thing is that if she wants to use that feature on a phone she pays for herself and then does these things, that would be a totally different issue. She'd also be living on her own, imo, in that case.\n\nI'm not a helicopter parent. But if it is an emergency, or favor or trying to coordinate transportation, I think it's extremely rude to make yourself unreachable to people that you are living with, being supported by and accommodating your schedule into theirs. Not answering a call or listening to a voicemail because you're busy or in class is one thing. Not even shooting a text when you get the chance is another. Like how hard it is, in reality, to say something like \"message received.  In class/practice/movies\"?\n\nAnd this isn't a one-off event, as you've said. It's a repeat problem you've addressed with her, and she continues to do the thing she's been asked not to do. You gave her ample opportunity to change her habit, and instead, she cried. \n\nI mean, even living with roommates, if my roommate made themselves completely unreachable unless I was face to face with them, I would get frustrated. Life and differing schedules can often make face to face meeting difficult even if you live with someone. For example, if one person works overnight and the other does mornings. If there was an emergency or there were issues with bills that needed immediate action then yeah idgaf what movie you're seeing. I don't want to be ghosted by someone I live with when their ghosting impacts me negatively.", "NTA.  You're paying for this service, at least in part, to allow her to reach you, and vice versa.  It seems like she needed to be reminded about the vice-versa part.", "I had the same problem in HS. The solution was to simply create emergency contacts for my parents so they will always show notifications on my phone regardless of DnD. Much easier than yelling or never being allowed to use the feature. NTA but you should still apologize for yelling at her. Explain that you were scared and overreacted. It happens but if you don’t apologize I guarantee she won’t forgive you anytime soon.", "There’s a feature where you can have it on DND but you allow certain contacts to still be able to reach you. Perhaps you can come to an agreement with that!", "NTA. the teenager is being an irresponsible AH.  and before anyone else says it yes that's true with many but not all teenagers.  If she can't prove she's responsible no car no phone no activities outside of school for a while.  what she's doing can also be dangerous.", "NTA. We have the discussion about prompt replies often. I pay my rules", "NTA but it sounds like there are bigger issues happening here.", "NTA.  You're the parent and, I am assuming, the one paying the phone bill.  Your rules should stand unless she wants to pay for the phone and phone bill.\n\nBTW, most phones have a category in the contacts that bypass the do not disturb function.  My daughter's school was very strict on phone usage and noise.  She would have the phone on do not disturb throughout the school day.  My wife and I would sometimes need to message her about picking up her brother if we had a work emergency.  To make sure she got these, we were put in the emergency contacts that bypasses the DND setting.", "NTA based on your edits. But I would be a lot more worried about her behaviour in general. This is a symptom of a much bigger issue and understand why you are genuinely worried for her. Don't remove her phone - if her behaviour gets her in to a risky situation, a phone will let her contact you or the police.\nI get the inconvenience - my O/H does same though he swears blind his phone does it - and it makes simple things very hard. But then you aren't the focus of her life, something else is and be good to find out what or who that is.", "NTA\nParenting at this age is different. \nYou've lost the ability to control her, and she isn't communicating. \nTry any one of these.\n1. Do nothing. If she calls to be picked up at an inconvenient time (after not responding) let her sit for a few hours till it works for you.\n\"I left a message and offered at 6, now you'll have to wait. Give me your location and I'll be along when I can) Don't give timeliness or details. Point out how frustrating it is to have crappy communication. Improvement will be a 2 way street. Show up early as well, and let her bus/walk pr beg someone for a ride if you can.\n2.  If she fails to reply to you, she loses the phone. Like permanently. If it isn't usefull for communication between the family, it's not an expense you will upkeep. She will quickly realize how frustrating it is to have spotty communication with friends and family.\n3. She installs (voluntarily) a tracking app so you know where she is, but she can still use do not disturb. You promise not to be overbearing about it, but it's a safety plan. \n4. If she doesn't present a plan, she doesn't leave the house.\n5. You request that she be brutally honest about where she is, and you won't react. (Hmmm self control on our end is HARD!)\nBut I'd rather give a little wisdom here and there, and keep hearing about thier life, than be cut out and find out later what they're up to. 🤷‍♀️\nAlso... everyone keep thier own car keys. If she take a vehicle without permission, tell her you'll report it stolen. Totally not cool.", "You have far more serious issues on your hands than you seem to realize.\n\nYou said if you try to take her keys, she will just steal any available car or have a meltdown.  She lies about where she's going, gets angrily defensive if asked, and is gone without any word for long spans of time.\n\nThis is the point where you need to be considering that something bad is going on.  Most of those behaviors have a tendency to go hand in hand with drug use.  The ones I knew would use those same methods like turning off the phone.  If they made the mistake of answering while drunk or high, you'd hear them acting strangely and know what was up, so it's easier for them to turn off phone notifications so they don't answer on impulse.  The freaking out to the point of screaming and crying if she doesn't get access to the car to go \"somewhere\" also sounds sus in the same vein.\n\nIt's hard to give a judgement because this is potentially much bigger than the initial problem.  This sounds much bigger than just a spoiled kid being willful.", "NTA to your daughter but Y.T.A. to the rest of the world if you don't get her to wake up and realize she's not some special princess who gets to do whatever she wants whenever she wants to, through lying, stealing, and manipulation if necessary, and with zero real consequences ever. Seriously it is time for actual rules with actual consequences and possibly therapy, quick before it's too late.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy daughter (16F) has her phone on do not disturb all the time. At first, it wasn’t an issue since she would still answer my texts and calls whenever she is out at practice. For the past few weeks, she has stopped answering my texts and calls and she wouldn’t receive them since I’d ask her why she wasn’t answering and she’d claim she didn’t get them. I am not stupid. Her phone is on do not disturb and none of my texts and calls are going through. I’d ask my other daughters to see if they can reach out to her whenever she is out just to ask her what time she might be home. No answers. My oldest (22F) would try to call, text, FaceTime, you name it in order to ask her when she might be home. \n\nOver the weekend, my daughter had to attend an event at school and when I came to go pick her up, she went MIA and wasn’t answering any of my texts and calls since again, the do not disturb feature was on. I started to get frustrated over it so when my daughter finally entered the car, I told her that she needs to start answering my calls and texts and she had no reason to ignore me when she knew I was going to pick her up. My daughter gave me the excuse of “oh I didn’t see it” again. My frustration turned into anger so I start yelling at her and said, “NONE OF US ARE ABLE TO EASILY GET AHOLD OF YOU! SOMETHING THAT NORMALLY TAKES TWO MINUTES TAKES TWENTY OR MORE SINCE WE CAN’T SEEM TO GET YOU TO ANSWER THE PHONE! YOUR FATHER AND I HAVE BEEN WORRIED SICK WHENEVER YOU DON’T ANSWER THE PHONE!” I then told her she has two choices: either she removes the do not disturb or her phone gets taken away for a week. \n\nMy daughter rolls her eyes and said it isn’t fair for her to not be allowed to have the do not disturb feature. I said she needs to start answering her phone or at the very least, call us back right away. I said that if she doesn’t comply, her phone will be taken away. She begged me not to take her phone so I said she needs to remove the do not disturb feature. She refused once again. \n\nWhen we got home, I told her if she doesn’t want her phone taken away, she needs to remove the do not disturb feature. After some back and forth, my daughter removes the feature right in front of me before running to her room in tears. \n\nNow, before anyone thinks otherwise, I did allow her to have the phone on do not disturb as long as she answers our calls and texts. We’d have to call her more than once to get a hold of her but she is completely unreachable. I think I was too harsh but I was at my wits end. \n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta completely.", "NTA\n\nDND has a thing where certain people can still contact u while it’s still on. I have my mum my sister and my two bestfriends on the priority part so your daughter is literally choosing to ignore you", "NTA\n\nIn this instance, I am all for taking away the phone, locking away all the car keys and registrations and her drivers license.", "NTA \n\nIf she doesn't want you checking up on her, then she needs to get her own car and phone plan. You gave her the phone so you could be in contact. If she doesn't want to comply with that, then you should deactivate the phone. \n\nYour other kid needs to stop enabling her, too.", "NTA just take the phone away.  it isnt essential, and if you cant contact her whats the point in her having it.", "Put a tracking app on her phone. You have a bigger issue than her not answering calls. She stealing cars.", "If she’s taking cars without permission, have her arrested! That’s theft. She is acting like an AH and as a parent you have every right to understand where she is and what she’s up to. \n\nIf she’s lying, sneaking out and taking vehicles without permission, you have good reason to insist on the DND being turned off and if she refuses, taking her phone away is a reasonable response. \n\nNTA", "Quit threatening and follow through. She needs some consequences, not just threats. NTA but if you continue to allow this, and the more disturbing taking cars and disappearing, to go unanswered you'll be TA. If she takes the vehicle without permission police can be called. But you need to tell her these are consequences to her actions and follow through. She is being shady and until you can trust that she isn't being a liar and thief it's time you called out that behavior", "In today's day of near constant school shootings parents need to be able to contact their kids. And based on your edits there is something else going on. I think you should take her phone and find out what she's been up to. She also doesn't get to just take peoples cars. I think she needs stricter rules. And if she cries oh well she cries. \n\nNTA", "> some are suggesting I take car keys away. The problem with that is, if there’s a car available, she will leave. She’s taken my oldest daughters car a few times and when she’d ask where she’s going, she would say “none of your business.” My oldest hid the car keys from her and it would be met with manipulation and my daughter crying and screaming.\n\nWell, here’s the real problem. This kid is an entitled, immature brat. Has she never been disciplined or told “No” before? Tell her next time she STEALS a car you’re calling the cops and reporting it stolen and she won’t be bailed out.", "She is 100% hiding something. A secret boyfriend, maybe older than you'd like so she hides it. Borrowing the car to visit him too. It's clearly a person she's texting and visiting. Do not disturb so no one sees the notifications. And the defensiveness over it is suspicious as hell. Only reason I think it's an older guy is because it sounds like she's being told to keep it a secret and it's a common tactic groomers use\n\n\"you're so mature for your age\" \"you don't want to get in trouble do you?\" \"i don't like being talked about, let's keep it a secret\"\n\nIt could even be a senior in her school, it was a big issue in mine and even the victims would defend him  so nothing was ever done about it\n\nNta, she's hiding stuff and you as her parents need to protect her", "NTA\n\nWhat if there was a emergency where you HAD to get ahold of her? Not even that, but you should have the avenue to get in contact with her. I also assume that you own and pay for her phone line, so she needs to at least stay in touch with you.\n\nBTW I also have a phone with the DnD feature. You're able to put in priority contacts that can bypass the DnD feature. So honestly she already have you as a priority contact so she still gets notifications while on DnD, especially if since this is an ongoing issue and you were clear that you need to stay in contact in the first place. She's being deceitful and deliberate imo.", "I mean I almost feel like you are the asshole because you let it get this bad. What are you even doing? Like it seems you just gave up preventing her from sneaking out or doing things she’s not supposed to. Your other child can’t even hide her own car keys without this one throwing a tantrum.", "NTA, speaking as that teen who would not tell my parents what I’m up to, I think you have bigger problems than just the phone. I didn’t understand it then, but I get it now why my parents would get frustrated at me when I don’t answer calls. You have to remember that she is 16, and at that age, you can either trust her to make good decisions or you have bigger problems. \n\nI get emotions are running high because of her repeated bad behavior and what looks like her lack of remorse but I think you need to take a deep breath, take a step back and ask to speak to your daughter regarding what had happened. Pls apologized to your daughter for yelling at her and explain that it was a moment of anger and panic over not being able to contact her repeatedly. Explain to her calmly why it is important for all of you, especially you to be able to get ahold of her asap and set boundaries on why and how. It could something as simple as she isn’t responding because she’s feeling pressured or feeling like she’s lacking space. I used to hate answering my mother’s text or calls because she usually text in caps or raises her voice, to me, it feels like she’s constantly shouting at me, turns out my mother has no idea how to turn off caps and she was shouting because she did not realized she has her phone volume down, she was under the impression that none of us could hear her because she couldn’t hear us. Simple fixes, and her kids requested that she text us first instead of calling so we don’t feel pressured on responding. \n\nAs for the unexplainable disappearance, I would recommend speaking to her about it calmly and move forward to a solution. Don’t pry into where she’s going or what she’s doing. Emphasize that you love her and trust her but that behavior is alarming and worrisome. That coupled with her not answering anybody’s calls or texts does not help ease anyone’s worries about her. Set firm boundaries, respect her privacy and work towards a solution that both of you are happy with.", "Regarding edit 3, I'm very tempted to say e s h.  DO NOT MAKE THE CARS AVAILABLE.  How is this so hard?  Keep the keys secure, don't give in to manipulation, if she pitches a fit start doling out consequences.  Tell her if she takes a car, you will report it stolen.  \n\nStop messing around OP, you're letting your teenage daughter push your whole family around.", "Assuming you are paying for the phone.  Explain again one of the purposes why she has a phone.\n\nShe can put phone on do not disturb once she pays for it as well as the expense of her monthly phone service.\n\nAlso there will be times when Do Not Disturb is essential.  As well as times when she forgot to remove the feature.  I know I do.", "I’m going against the grain but YTA. Not for forcing her to turn off the do not disturb feature on her phone, but for letting her think the way she is acting is okay. Your 16 year old daughter doesn’t think it’s necessary to let you guys know where she’s going, she sneaks out of the house any given chance, and she STEALS others cars. Shes not “borrowing” someone’s car, she’s stealing. And your teaching her that she can get away with it. Your threatening her with taking her phone away??? It should have been taken away a long, long, time ago. You say you can’t take the car keys away from her because she will just steal whoever else’s car is there, so you shouldn’t even bother coming up with a solution? You are raising a child that is going to be horrendous to deal with in the real world, someone who doesn’t respect boundaries and can’t follow rules. This is far, far beyond the scope of Reddit, she might need to see a therapist, but in reality it sounds like you guys aren’t enforcing boundaries and your daughter has realized she can step all over you. Some kids need a strict parent, and your daughter sounds like one of them. Children nowadays are becoming a horror to deal with, especially in schools, because parents like you allow them to run the household. Put your foot down. She is the child, you are the parent. Stop letting her put herself at risk, because one day she’s gonna make a mistake she can’t come back from.", "NTA. I’d turn the phone off and stop paying if she didn’t answer.", "ESH\n\nThis shouldn’t be an issue at all.\n\nYou can allow certain numbers to get through Do Not Disturb.\n\nAdd your numbers to that list.", "Gosh what a nightmare it is to raise kids these days! How the hell did I get through my younger years without a phone in my hand 24/7??", "Info:  It sounds like y’all are calling and texting a lot! Is it excessive?", "I get it, but I also feel like in some ways the punishment doesn’t fit the crime. You told her that if she doesn’t turn off do not disturb, you’ll take her phone away. But if you take it away, you still won’t be able to contact her. How it that any better?", "I feel so sorry for the kids today, having to grow up with smartphones in their pockets, expected to be tracked and reachable 24/7 by their parents and friends.\n\nI remember hanging out with my friends (who never cancelled on short notice bc there was no way to let the others know when they already left home), a card for public phones for emergencies in my pocket, not disturbed by helicopter parents who call their kids every 10 minutes. Just being teens hanging out. And then you went home on time for dinner (bc if you were late you had to do all the dishes as a punishment) or give your mom a call from your friends house to let her know you stay there for dinner. And all of us survived and our parents didn't freaked out all the time. \n\nThose were good times.... sigh.", "I don’t know to me it is honestly refreshing that your kid is actually enjoying life and not constantly connected to their phone. While frustrating I think you were to harsh and need to look on the bright side.", "I don’t think you are quite an asshole but the way you went to deal with it kinda makes you seem like one. Also there’s a small chance it might not be the “do not disturb” sometimes things don’t send through due to some areas just being a low data zone. Check if your daughter even has connection at the school, if she’s using data. If she’s using school wifi it might just be blocking her texts access.", "YTA, your punishment for not being able to reach her would be to take away her phone? How would that help? It sounds like you're abusing the fact that you can call her anytime, you need to let her exist on her own outside of your safety net", "You're controlling and dictating to her what she is allowed to do. As a parent of a child at the same age, I do understand the need to be able to reach them. I also understand that the DND feature, on iPhones at least, can be configured to still allow messages and calls from specific people to pass through while others can be optionally set to pass on a second call.\n\nIt SOUNDS like you are sending more texts during the day WHILE THEY ARE AT SCHOOL and expecting an immediate response when they should be IN CLASS.\n\nWhat you are doing right now is telling your daughter you have no faith nor trust in her.\n\nYTA.\n\nYea it sucks when they don't immediately respond. You claim she has no reason to ignore you but from your own message she has several, one of which being overbearing and probably a helicopter parent.", "YTA. She won't be reachable if you take her phone, how do you make that make sense? It sounds like you're making up ridiculous punishments that don't respond to the right problem. Also, why are you constantly texting and calling her when she is in practice? Do you understand how rude it is to expect an immediate response when you know she is engaged in an activity? Why are you \"worried sick\" when you know where she is? It sounds like you have no trust and want her to be under your thumb 24/7. She is 16, she doesn't want you calling and texting constantly and getting her in trouble with her instructors.", "Maybe you should ask your child why she feels like she wants that feature constantly. I’m my 20’s I used to use it because a guy from work would constantly spam me with unsolicited non work related calls and texts, couldn’t really report him because he was my superior but the dnd mode helped me gain some sanity. \n\nJust communicate with her NAH", "YTA\n\n\n\"I allowed her to have her phone on do not disturb, as long as she answers my calls, wich literally can't get through, because of that function.\"\n\n\nYou did not allow her to use that funktion.\n\n\nIt is not normal to expect to reach someone instantly. Yes, even if it is your child.\n\n\n\nYou child was literally at school and you expected her to have her phone ready. \n\n\n\nYou don't get how lucky you are and how unhealthy your behaviour is.\n\n\n\nImagin your mother would do this to you.", "Get her a phone workout that feature. Problem solved.", "As a former classroom teacher, I wish all students put their phones on Do Not Disturb during the school day and returned calls after school. Parents know their kids are in school and won’t stop calling. Good for her!", "\"It's like she's hiding\". \n\nOf course she is, she doesn't answer her phone for 20 minutes *while in school* and suddenly she isn't allowed DnD anymore. The tighter you try to control her and grip on, the harder she will fight to get away.", ">My frustration turned into anger so I start yelling at her and said, “NONE OF US ARE ABLE TO EASILY GET AHOLD OF YOU! SOMETHING THAT NORMALLY TAKES TWO MINUTES TAKES TWENTY OR MORE SINCE WE CAN’T SEEM TO GET YOU TO ANSWER THE PHONE! YOUR FATHER AND I HAVE BEEN WORRIED SICK WHENEVER YOU DON’T ANSWER THE PHONE!” I then told her she has two choices: either she removes the do not disturb or her phone gets taken away for a week.\n\n>my daughter has also been lying to us about where she’d go. She’d ask to borrow the car to go get food, but would come home two hours later. I’d call her after 45 minutes but the phone would go straight to voicemail. She normally does tell us if she’s going to class or practice but whenever she goes out outside of those times and doesn’t tell us, she will not answer the phone. It’s like she’s hiding.  \n\nYTA. If course she's hiding. She probably just needs space. You're controlling and have anger issues. Obviously turning do not disturb off is not going to force her to answer or respond.", "YTA, she isn't just communicating with you. She has friends, classmate whatsapp group, etc. Her phone would be buzzing without a stop if she didn't have it on do not disturb. Furthermore, she will see your calls when she is on the phone, so her not reacting means she is not that much on the phone, which is great. \nYour punishment idea would be to have even less possibilities to contact her? That is a dumb idea. Let her have her peace, if she wants to talk, she will talk with you. If she doesn't she won't even when her phone isn't on do not disturb and btw. how would you want to Check that? She can switch it to dnd when she leaves the house and switch it back on when at home.", "Imo YTA. Your kid is big enough to take care of herself. You know what kids in school do if one of them have to pick up the phone from their mom every few hours? They laugh at them. At least that's what I remember from my school. \"C'mon big baby, talk to your mommy\". Luckily i had normal mom but my best friend had to go through all those comments from classmates because her mom called her almost every day.\n\nWhat's so important that you need to tell her/ask her all the time? When she'll be back at home? Or do you feel the urge to check if she's not drinking with friends instead of being in school or what? Maybe instead of stupid punishments and yelling how worried you are just teach her how to be responsible person and show her that \"if you're going to be late please tell me\" wont have any bad consequences. Sometimes \"okay sweetheart, I was worried but I hope you had fun\" can do miracles when it comes to kid-parent relationship because in her head will start to show image of you truly being worried instead of your angry face.\n\nOr the above example, you couldn't reach to her when you were waiting, right? Why didn't you say something like \"please next time give me a little heads up so I could come in good time.\"\n\nI mean, yeah, you can take her phone for a week, maybe then you'll realize that making those calls aren't necessary.\nIf something really bad will happen and you'll try to call her, I wouldn't be surprised if she'd just ignore you, thinking it's another pointless call.", "YTA. She will be an adult in two short years. Time to start cutting that cord.\n\n\"It's like she's hiding.\" Gee, I wonder why? 🙄", "<<I did allow her to have the phone on do not disturb as long as she answers our calls and texts>>\n\n1. Do you understand what Do Not Disturb means? It means the phone doesn't ring, texts don't ping. In later iterations of the iphone, even notifications are turned off. So asking her to return your communications when her phone is on DND is silly. The point of DND is to temporarily silence/ignore communications. \n2. As I think others have noted below, there are ways around DND. There are capabilities enabling calls from people to get through regardless of whether your phone is on DND or not. Other capabilities enable callers to get through if they call you twice within, say, five minutes.", "YTA because your daughter OBVIOUSLY needs serious help and you are just threatening to take her phone?", "Stop yelling talk it over tell her to make it so family notifications can go thru and then bam it’s don’t. Also worried sick for twenty minutes of her not answering is a overreaction she won’t be answering your calls all the time and the older she gets the less she wants to call you or the others.", "NTA.\n\nYou're the parent, you house your rules. Also, sounds like she's being shady so definitely NTA.", "NTA - Phone is given for a reason and if it cant be used for that, no reason to have it. I usually have my phone on DND most of the evening, but I have specific contacts that will come through (spouse, kids, mom, manager).", "NTA she can easily make it go though in the settings that all your and her father calls and texts go through but she chooses to block you", "This clearly isn't about do not disturb and seems way above AITA pay grade.", "NTA. Teenagers don’t get phones so they can be cool and stay connected to everything. Parents by teenagers phones for the main purpose of being able to reach them. \n\nIf she can’t respond and not have DND on, she doesn’t need the phone.", "NTA as a parent to a teen they need to learn to prioritize. She is wasting everyone’s time with being inconsiderate.", "NTA. If she wants the DND feature on, then she can set it up so you and her father bypass it. My phone goes on DND at night with my daughter being the only one who bypasses it. \n\nYour parents being able to get ahold of you is a safety issue and it’s a respect thing.", "NTA. It sounds like you're only trying to contact her when you're picking her up, in which it is very frustrating to not be able to reach her. I don't have children but I nannied for two kids, one of which was high school age, and when I would text her that I was there to pick her up at the time she requested and she wouldn't come out for 20 minutes, I would start to get annoyed. \n\nYou clarified that you don't text her during school hours and you don't text or call her incessantly when she's busy, just to let her know you're there to pick her up or ask her a favor if she's out. She's 16 and still lives under your roof and her phone bill is paid by you, so the least she could do is make sure she answers your calls. Sometimes I miss texts when I'm busy, but if it's extremely important or needs an immediate answer, I would expect the person to call me after a few minutes of non-response. \n\nIf she insists on having DND on her phone, I would require that she add you to the emergency contact list. I have my phone on DND between 9pm and 7am, and once my mom called me during that time frame and the call rang through because she was listed as an emergency contact in my phone.", "NTA. It sounds like you're only trying to contact her when you're picking her up, in which it is very frustrating to not be able to reach her. I don't have children but I nannied for two kids, one of which was high school age, and when I would text her that I was there to pick her up at the time she requested and she wouldn't come out for 20 minutes, I would start to get annoyed. \n\nYou clarified that you don't text her during school hours and you don't text or call her incessantly when she's busy, just to let her know you're there to pick her up or ask her a favor if she's out. She's 16 and still lives under your roof and her phone bill is paid by you, so the least she could do is make sure she answers your calls. Sometimes I miss texts when I'm busy, but if it's extremely important or needs an immediate answer, I would expect the person to call me after a few minutes of non-response. \n\nIf she insists on having DND on her phone, I would require that she add you to the emergency contact list. I have my phone on DND between 9pm and 7am, and once my mom called me during that time frame and the call rang through because she was listed as an emergency contact in my phone.", "NTA\n\nMy parents would have roasted me alive", "NTA  If she has a tracking device on her phone use it next time she goes MIA. If not get one installed. She'll probably start answering you pretty quickly if you start showing up where she is.", "Easy NTA.  She doesn't need DND.  She can put her phone on silent like regular people.", "NTA.\nAnd ground her,actions have consequences.", "NTA. Her lying and downright ignorance of notifications can not go unpunished. Her actions should not be tolerated. It's rather rude to manipulate parents.", "modern parenting sounds awfull, I didn't even have a phone till I was 12 and even then it was for me to call or get emergen y servises, constantly being rachable sounds fucking exausting.", "NTA and if you think that was harsh you'd have called CPS on my Mum 😂 have you asked her 'why' she's so insistent on having DND on? There must be a reason she burst into tears over it", "NTA. Once she pays for her own phone, she can do what she wants. When you pay for it, no ‘do not disturb’.", "NTA but given your edits the phone is the least of your problems. You can’t continue to allow her to steal peoples cars just because she’s going to throw a tantrum. Take her phone, give her a flip phone for emergencies. Take her license. Start taking action about her behavior, you are under reacting.", "I leave my phone on DND all the time.  I hate spam callers and notifications annoy me (but I still want them visible when I pick up my phone)\n\nBUT there is an option in the settings to let calls go through if they call twice in a row back to back (essentially making it urgent) and there is a whitelist feature to let only certain people go through (like my husband and my mom).\n\nHelp her set it up so that your calls/texts go through.  There's also a way to set DND just for certain hours (while she's in school or from 10pm-7am, etc).\n\nNTA.  If I couldn't get a hold of someone in an emergency, I would panic.  She turns on those settings to make it easier for you to contact her, or she turns off DND.", "There’s a feature where she can keep her phone on DND and select certain contacts where she still receives notifications and calls for. Go to the setting and the DND to set it up", "NTA but it sounds like your daughter is up to all sorts of things that she doesn't want you to know about. If you pay her phone bill you should be able to dictate how that item is used. By the way she \"borrows\" cars etc without asking I think that she is pushing all sorts of limits with other people's possessions so if you decide to shut down her phone etc you would be in the right IMO.", "Nta. She's running rings around you. Firm boundaries.", "NTA. She's below 18. So your rules apply. And DND should not be turned on Everytime", "NTA for making your daughter remove the DND feature and threatening to take her phone away. However, YTA for allowing the situation to get this far. From your edits it does not seem you are doing a good job of enforcing boundaries/restrictions with her and instead you are letting her run all over you and your husband.", "sounds like you need to teach her some discipline.  ill bet you guys threaten punishment for her bad behavior and dont follow through.   buy a lock box for car keys and lock them up.  have the phone share location with you or use an app to do it.", "You know what my mom used to do if I didn’t answer her calls? She played the sound on find my phone. \n\nJust an idea…\n\nNTA", "NTA\n\nBut you have a bigger problem than you realize. She's doing something that she doesn't want you to be able to track or hear where she is.", "She has a “friend” or somewhat a boyfriend. Thats why", "NTA \n\nIf she won't answer, then she doesn't get a phone, and all car keys should be hidden from her.", "NTA but Jesus Christ lady, start being a parent. You’re letting your 16 daughter be out all night, leave without telling you where she’s going, take the car without asking. You’re mad she doesn’t answer her phone but are allowing her to do whatever she pleases the rest of the time.", "NTA. The phone is the least of your problems.  Stealing cars (family members), sneaking out, not telling you where she is going.… you have a teen out of control.", "NTA\n\nYou need to get her a phone that does not have this feature on it. Look up Bark phone. She is testing your boundaries. Show her that you are not f'ing around. You are the parents, she is the child. It doesn't matter if she screams and cries. She's acting like a toddler, so treat her like one. A toddler does not drive. Does not go ANYWHERE without their parents. Doesn't own a cellphone, but in your daughter's case, she probably needs one so you can touch base with her. No more afterschool activities. Straight home and if you and your husband need to go out, get her a babysitter. Right now you are letting her control the narrative. Time to take back that control.", "YTA you have a teenager who is hiding something from you, sneaking out. Stealing cars. And you're focused on her not answering the phone. I'm all for teenage independence but this is way too far. Sort out your kid.", "NTA\n\nI assume you pay for this phone and I assume the main reason you got it for her was so you has a way to stay in contact with her. If she is unable to be reached due to a setting on her phone you absolutely have the right to make her turn it off.", "Nta and you're a lot nicer than what my friends' parents did in a similar situation. We were 17 or so at the time and my friend had a habit of sneaking out and ignoring his parents calls and texts. (Like they would see the calls come in and press ignore)  his parents had a surprise Vacation planned and my friend had snuck out the night prior to go stay with their so at the time (if I remember correctly) his parents tried calling him and texting him and he just ignored them so they decided to leave without him. He didn't bother to check their messages until he got home later that day an Noone was around. \n\nNow before anyone goes in to hard on the parents first of all he was 17 and could easily take care of himself, the had left money in the house for him for food on top of a full fridge and pantry and they had asked a relative to swing by and check on the place and make sure he was all good. Also the vacation spot wasn't very far away just a couple hours drive.", "NTA - with do not disturb, your call still goes through the second time - this is so you’re reachable in the case of a real emergency. Your child needs to be contactable and you’ve done all you can IMO to be reasonable for escalating to this point", "NTA .\n\nEven as an adult the only time you’ll see me put my phone on DND is either when I’m with a client or winding down for bed ( I have scheduled hours from 22:00-09:00) .", "INFO: How often do your call and text your daughter? Do you want her to answer or respond immediately or within a certain period of time? When do you call and text her? During school?", "You have a much, much bigger problem. You don’t know where your child is going, who she’s meeting, if she’s safe. You need to find out what is actually going on. ESH", "NTA. She is doing that so she has plausible deniability. My daughter does too, it's annoying.\n\nHowever, my daughter has earned trust by being truthful about where she is and also calling back in a timely manner.", "NTA. Ya'll need to be on her priority contact list so even if she does \"do not disturb\" your messages get through. If she can't be bothered to text you back when she is meeting you for something, then she might not need that phone anymore. Stop keeping car keys where she can get at them. \n\nThe whole void of information she's doing doesn't work for you (her parents) and knowing where she is going/when to expect her back are reasonable boundaries. She is a minor child and you are responsible for her. If she lies, there needs to be consequences. She is learning that she can do whatever she wants and the rest of you can be put on a holding pattern to cater to her. So what if she cries or screams? Yes it's uncomfortable, but so is not knowing where your child is. Find natural consequences. If she doesn't tell you where she is going, no more going out. If she can't respond to texts in 15 min outside of school/practice hours, no more phone.", "NTA", "NTA\n\nI would have grounded her everytime she took a car without permission as well. \n\nWhy is she sneaking around so much? Is she dating someone you wouldn't approve of?", "Not sure if others have suggested this but you can customize the DND feature. I have mine on 100% of the time to minimize distractions, but I’ve set it up to allow my husband, sister, and daycare through as priorities.", "Easy NTA. But I’m pretty sure with the new focus features she can set certain contacts to have their notifications come through regardless. Could be an option if she really does like the do not disturb and isn’t just using it to BS you. Others may know more than me though, I don’t use do not disturb.", "NTA but you need to step up as a parent. She has learned that crying and screaming gets her way. You need to teach her that it doesn't which means you need to live through it for a while.", "My oldest daughter told me about that feature and even she had suggested my daughter to add me as a priority contact. Everyone else has their phones on do not disturb except that they put me and their dad and siblings as priority contacts.", "Before caller ID was a staple, my friend wasn't allowed to have it on her phone, because her sister always used it to ignore their moms calls.", "... doesn't a teenager have a phone to contac someone if needed and not the other way around?\n\n\nIt is also completly normal that teenagers don't answer calls/text while in school where I live.", "I am not a parent. I am the child in this case, but when I call my parents repeatedly and they don't answer their phone (my stepmother has a habit of misplacingher phone and nit answeing for hours on end), I get worried that something happened.. I can't imagine being a parent who can't reach your underage child. The scenarios that will go through my head and the worry is enough to make me mad for OPs behalf", "Agree with you 10000000000%!!!!\nNTA all the way", "This is what I’m thinking. The edit really changed my opinion on the matter, I was leaning towards N A H, because I grew up before cell phones became super common, and when I first saw my friends getting them, they just seemed like a way to take away freedom. One of my favorite things is a teenager was “getting lost“. But it was normal back in those days.\n\nThe lying, practically stealing her older siblings car, and the manipulation is super worrying. NTA.", "Phones exist for a reason. For example, if there is an emergency and she needs to call the police or an ambulance, not having a phone will make it more difficult to get help. It may be better to just give her a flip phone rather than her having no phone.", "I’m surprised no one else is pointing this out. This is a child who is sneaking out and purposely not answering her parents or letting them know where they are. Why have there been no consequences?", "I'm a teenager, and I agree with NTA. This is stupid dangerous. Her seeking out and not telling anyone her location and not texting back or answering calls is not only stressful for parents, but it varies dangerous. I live in a good area, but there are some bad areas nearby, and for safety reasons, my dad always has my location.", "And you know she’s looking at her phone constantly being 16.", "My oldest said I can add my number. My number is added on the expedition list for her phone, but not my 16 year old. She’s more tech savvy than I am.", "Exactly this. I have my parents as priority contacts when I have dnd on, and even when it’s not I have their contacts set as special ringtones/vibrations so I know who’s messaging/calling without needing to pick my phone ip", "... what do you think a 16 year old is able to do in an emergency? \n\n\nYou have really twisted view of an emergency situation. Normally the parents need to be reachable at all times while it is the norm that teenagers at schools are not reachable.", "Having a phone is also good for emergencies and taking it away could put her at risk. Giving her a flip phone would be a better solution.", "Excpet it sounds like the kid is lying about where she is and who she is with.  She is *purposfully* ignoring her parents calls.", "This, it’s really that simple.", "We call her one time. If she doesn’t call back within 20 minutes to an hour (which is often) we call her again. When she is out during a time where she isn’t at practice or school, she won’t tell us where she is and nobody knows where she went to. I told her she needs to let us know if she has plans and what time she’s coming home. We wouldn’t spam her during that time so she can enjoy with her friends. Most of the time, she doesn’t tell us where she is and she also started lying to me and her dad recently. She’d ask to borrow his car to go get food, only to return two hours later when it should normally take 20. We’d call her but there’s no answer so when she comes home, we’d tell her what’s taking so long but she won’t tell us.", "Evidently they were calling during a school event the 16 year old was at on a Saturday.   Depending on the event type I can see situations where she may not answer.  Kinda depends on the event type", "I just don’t know what to do anymore.", "Those were also safer days", "The comments are really crazy here. I grew up with a phone but my parents were so much more chill...", "I understand that. I don’t know if I was clear, I’d tell my daughter to come home after a certain time and when she isn’t home, we simply want to know when she’s returning since she’s running late.", "that’s an explanation/excuse ONCE, not when it is happening routinely across locations.", "My husband and I do not call her all the time. It’s only when she isn’t replying to my ONE message. After an hour or sometimes two hours, we still won’t get a response. We do not spam her with calls, we give her the space she needs to enjoy herself. It’s just that when she isn’t back yet at a certain time is when we start worrying.", "It would help by not wasting money on something that is not being used properly or with respect to the people paying for it.", "I don’t know about the rest of it but in this specific instance the parent had to wait around until the daughter sauntered over at her leisure because the parent couldn’t get ahold of her. That is completely unacceptable. I would have left her at school to make her own way home but that’s just me. Sure - use the Do not disturb function - and face the consequences.", "I discovered that option where my I can still call my daughter. My oldest has that feature. Her phone is on do not disturb except for me, her father and her siblings. \n\nI am not texting my daughter during the day or at school. The issue is when she is out with friends or she goes out to get food and isn’t back home on time yet. I’d tell her be home by 9. If it’s 9:20 and she isn’t back, we start calling and she doesn’t answer.", "Maybe they have no faith and trust in her because she keeps showing them they shouldn’t? That’s how it works.", "She was at a school event. Not in school. There’s a big difference.\nHonestly I don’t know anyone who would pay for a child to have a phone and not expect them to respond to repeated missed calls and texts. \nIf the daughter can never be reached on the phone when necessary, she doesn’t need a phone.", "Please link one of these phones that doesn't have DnD", "Actually I just read your edits and you seem to have a much bigger problem that you aren’t really dealing with, good luck", "Why are all these kids leaving DND on all the time?!? So they can’t get contacted? They just want it for internet?! I don’t get it…\n\nI hate how old I’m getting…", "We made our kids sign a “contact” when they got their phones and they know that as long as we are paying for the phone they have to follow the rules/guidelines we listed.", "You need to ground her, take her phone, hide all the keys, and maybe get her therapy. She's hiding something, and it may be drugs or alcohol or she may have a secret BF. \n\nI recommend, when you take her phone you could put a tracking app on it I you can't trust her enough or you can put a tracker in the car she uses the most or on the keys so you can see where she is going. Unfortunately, this is controlling, but she won't tell you anything, and it's for her safety. If she goes missing, having her location will be a big help.", "My phone has a setting where you can select specific people or set it too all people to get through DnD if they called twice within a certain timeframe (android) \n\nSeems a very easy solution", "[removed]", "From the sound of the edits, you have more issues than the do not disturb feature. NTA but I think the focus should be on her general behaviour including stealing her sisters car or manipulating people into getting what she wants. I'd be interested (coz I'm nosy!) in whether this indicative of a wider issue and how are you parenting her through it.", "So; funny thing. My iPhone goes though with the do not disturb is on. Like anyone can call/text me and I’ll get it. NTA, install Life360", "Sounds like she has lost the privilege to drive or to have a phone until she can learn to be responsible.   NTA", "In school, yes. But not after school when your mom is trying to find you for pick up.", "Are their consequences for the meltdowns over a sibling rightly not letting daughter take their car?", "This is a refreshing and intelligent response from someone who is the daughters age. Thank you for this and understanding that parents are allowed to worry. You sound like an amazing kid!", "I get that people do not enjoy tech but finding out how to do those things is a 5 minute read after a google search.  \nAnd there are many surveillance apps for parents. There are targeted for parents who give phones to younger persons but if she cant be trusted about her whereabout that's one solution.  \nI would also not let her borrow the car if she doesnt tell you where she is going with", "Many types of emergencies can happen at any time. If there is an emergency and she is ignoring her calls and messages then she is being irresponsible. I suggest you go back and read the edits. Family does not blow up her phone when she is at school its after school that is a problem. Also she is 16 are you saying that at that age a teenager should not know how to handle emergencies. Tell me if God forbid something happens and a family ends up in hospital is that not an emergency?  So to you emergencies which is a reality in life is having a twisted view, so please explain to me your views on emergencies being a bed of roses 🙄", "Based on your edit about her taking the other siblings car - your daughter needs therapy. In no way if I ever talked to my parents with a \"none of your business\" would I be allowed to still go out anywhere. Throwing a manipulative tantrum at her age is unacceptable. She is almost an adult. You are only setting the stage for her to act like a brat the rest of her life by not being serious about her problematic behavior.", "WHY are you still letting her take the car? One time with that nonsense, and she should be grounded. If she's not where she's supposed to be, then she doesn't get to go out again until she can be trustworthy.   \nSomething is going on here, and you owe it to her to figure it out.   \n\n\nYou realize you're the parent here, right? Why are you acting like you're afraid of her?  \n\n\nNTA, but sheesh, stop letting the tail wag the dog.", "Yikes. Sounds like she shouldn't get to borrow the car if she's going to lie about where she's going", "You focus on the wrong problem than.\n\n\nThe problem is her being late and her not getting in contact with you.\n\n\nThere should be consequences for being late/ not telling you and not for the phone being on do not disturb.", "You can set it up so certain contacts' calls and messages actually still come through even while on dnd fyi! But it sounds like there's a lot of conflict and it's not really about the do not disturb feature. I hope things get better", "i think if you can talk to her and maybe do a only one call to check with her when she'll be home and if shes late you can call her again then? also do try to change the settings so your number goes through even on dnd if she agrees but that might be worth a try if shes willing to listen to your idea to make it work otherwise goodluck with dealing with it 😅", "I get it, I’m a parent as well but sometimes you just need to let it go, relax and pick your battles.  You parent the way you feel necessary but we have all been there where time has gotten away from us.", "How often are you sending that \"One\" message, as you put it?", "Yes she was at a school event on a Saturday. My husband and I would never call or text her during school hours.", "... so what sort of event could a student just get up and take a call? Where I live we had sport events, where we didn't have our phones on us, or we had thearter plays, work shops, etc where we definitly werent allowed to just take a call. \n\n\nI seriously courious- do students just take calls at events at school where you live?\n\n\nIn my mind she was at the event. The event ended. She saw the calls and went to her moms car. A totally normal way of behaving.", "Could also just be because alert sounds are annoying and you don't want to listen to a billion of them over the course of the day, or you don't want to risk disturbing others with your audible alerts or vibrations. I think OP is probably NTA, I just think there's good reasons to have DND on :P", "I mean, I'm 30 but getting spam calls and texts to my pocket instead of on a landline where they don't disturb me during the day is the worst modern development we've made. I never thought of leaving DND on because I do have important calls coming, but I could see where you don't plan on getting \"important\" calls as a kid.", "That seems pretty extreme to say on its own, but based on OP's edit it actually sounds like the most likely possibility. The phone is probably the least of OP's worries at this point, there's almost certainly something going on with that kid.", "Stolen comment from u/many_hobbies_gal.", "Yeah my notifications all come through, I just don’t get a sound or a buzz, I use it after a certain time of night so I don’t get woken up by my games telling me that my lives have refilled or what have you.", "There seems to be a lot of “oh well what can we do?” going on, and no consequences at all.", "OP and the rest is the family, since she’s got them sending messages on her behalf - so this includes the requests to buy McDonald’s.", "At a sports event I was absolutely expected to respond if I was attending as a spectator. At no point does OP say their daughter was acting in a play or playing basketball. She also could have been at a school dance. \nAt the end of the day it’s extremely disrespectful for the child to ask to be picked up at a certain time, then not only miss that pick up time but also be unreachable while their parent is looking for them. I understand OP being concerned in this situation because weird shit happens all the time and something could have happened, even at the school", "Vibrate? I literally never have the sound on for my phone ever.", "But you can custom set alerts and vibrations (or lack thereof). I don’t leave my phone on DND but I do have one person I don’t want to block but who contacts me incessantly. So I have their ringtone set to silent with no vibrations.", "> At first, it wasn’t an issue since she would still answer my texts and calls whenever she is out at practice.\n\nExcept she does say practice. That indicates the daughter is participating. So it’s not likely she got tired of / got in trouble for always answer the phone when busy.", "The incident where OP blew up states she was “attending” an event at school. \nThis does not exclusively indicate she was playing or performing anything for this event. \nOdds are just as likely she was at a school dance or spectating. If OP adds info that the child was actively participating in a sporting activity or performing with the band it’s a different story.", "Thank you :) \n\n\n\nAnd her daughter being late (generally as it seems) is an entirely different problem as the phone.", "However, I still say OP is NTA. The child is incessantly unreachable at a phone line that the OP pays for. She sneaks out of the house and lies about where she is. If she’s not using the phone anyway she doesn’t need it", "It honestly sounds more like a teenager being a teenager, but based on the capitals OP is losing her mind over having to wait 20 MINUTES for\nher to respond.", "I do agree it’s very possible OP overreacted in the heat of the moment. However it sounds like this has been a long and difficult battle with the daughter and this was a breaking point. It seems to me OP has made multiple attempts in the past to reason with the daughter about this issue and it’s fallen on deaf ears. Yes that is a teenager thing. But that doesn’t excuse her to do whatever she feels whenever without consequences"]}