{"id": 12963, "submission_id": "11ywyza", "title": "AITA- Telling my mom my brother is a tumor and to leave me out of it", "selftext": "My mother was a single teenage mother to three and worked harder than any person I have ever seen to provide for her kids. I have an older brother 28 (we will call Alex) and an older sister 25, I’m f 22.Though my mom did all she could we had it really rough. \n\nI left at 17 since then I have been able to take a step back. My brother has always been really difficult. Alex wanted to stay home and become a professional gamer. \n\nAlex never graduated. He met a girl on Tinder (let’s say Emmie) and they got married. I don't know how, but he managed to find someone just as lazy and cruel as himself. Though they are both now almost 30 they have never had a job, never paid a bill, and never contribute to the house. My mother has a certified family care home where she cares for residents 24/7, they live in the house. Alex and Emmie do not help. \n\nOn top of that they, especially, Emmie are incredibly overweight. They eat my mother out of a house and home. Emmie will come downstairs and make themselves six sandwiches and whatever else she can fit in her arms. I promise you I am not exaggerating. When Alex and Emmie fight she will go into one of my mom's guest rooms and make a mess in there and leave.My mother does caring for 4 elderly and dying residents she has to go back and clean up after Emmie.\n\nEmmie and Alex got themselves a husky puppy. This dog is awful, it is not trained. My brother started putting it in a vest and now claims it is his service dog to stop him from picking at his nails. Don't get me wrong I have a service dog because of a real disability, my dog has been trained. His dog has attacked my dog.   \n\n\nOne day Emmie left her room went to a guest room and her dog pee on the bed. Instead of cleaning it up she just went into another room. My mom found it days later, the bed was ruined. They started door dashing, they always took my mom's car and left it trashed and on empty. She asked them why and they said because they didn't want to make a mess of their car (a car my mom gave them). One of my mom's resident even died and she asked them to watch the residents so she could go to the funeral and they said no, so I left college for a few days and drove 8 hours to watch the residents. While they were just upstairs.   \n\n\nMy mom calls me crying all the time about the way they treat her. I listen to what they do and give her advice. I know they will be happier if they leave and experience what it is like to have a real life. My mom never does anything. \n\n\nMy mom is now married. She is doing IVF and asked Emmie and Alex to watch the residents so her husband can be there for the implantation. They said no. My mom called me crying heartbroken. After her last story I told her that she was allowing abuse to happen. I said she was ruining their lives and letting them be a tumor on everyone. I asked her not to talk to me about the issues she had with them anymore if she wasn't going to do anything. AITA?", "created_utc": 1679519788, "permalink": "/r/AmItheAsshole/comments/11ywyza/aita_telling_my_mom_my_brother_is_a_tumor_and_to/", "score": 76, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My mom tells me about the hard parts of her life. After her never making changes I told her to stop telling me what’s going on. Some people think I’m the asshole because I should support and be there for her in her hardships.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour mom is allowing them to live in her home and act that way. You can't do anything for her, all she has to do is kick them out, and her life will improve.\n\nIt's OK, and recommended!, to set boundaries on people trauma dumping, especially when they refuse to do the simple things to stop or improve it.", "NTA. Your mother is actually risking her care license with their behavior and their untrained dog.", "NTA\n\nit’s your moms choice to kick them out. Which she absolutely should. I had an uncle like your brother and he is pushing 40 and still hasn’t moved out. My grandma is in her mid 60s. Your mom is enabling his behavior by allowing them to live with her and treat her like this. Your mom is an adult and needs to make the choice to kick them out or make them get jobs and help around the house.", "NTA, love without boundaries may sometimes do more harm than good. You already know your mother enabling your brothers behavior is wrong and hearing about it over and over without anything changing is just as bad. Putting your foot down and telling your mother enough is enough about having to listen to this record on repeat may even motivate her to do the same with your brother and his wife’s actions. If possible, ask your mother is she needs help doing this.. intervention style with you her and her new husband. To the curb!!", "NTA. You were harsh, but it's true. She's enabling their behavior completely.", "NTA\nYour mum should get the adult kid out of the house before she brings in a baby, especially with an untrained husky.", "NTA  \nunfortunately it is your mom that needs to make the tough choice and just kick them out. it sucks for her but she needs to put herself first and its not something you can do for her.", "NTA. Everyone else in this situation sucks. Emmie is terrible, Alex is terrible, your mother is allowing them and their untrained, destructive dog to roam the house and bother the people she's responsible for caring for, and now she wants to add a baby to this chaos? Good grief.", ">My mother has a certified family care home where she cares for residents 24/7, they live in the house.\n\nI'm assuming that there are state requirements, inspections etc. involved in the running of this care home? If my dying loved one was in a home where a dog was peeing everywhere, I'd be lodging official complaints with the regulatory agency!\n\nYou're NTA, but you should have some sympathy for the residents and make some anonymous phone calls to the state.", "Your mom needs to get those parasites out of her home and life before even thinking of bringing a baby into the mix. Your brother and his wife are also probably going to cost her her license to run a care home too. She's a doormat and it's just incredibly sad", "NTA\n\nSend you mother links on eviction processes and forms. She needs to have your brother and his wife officially evicted from the house asap. Your mother could potentially lose the right to use the home as a care home if an inspector came and saw the living conditions of your brother and his wife. \n\nIf after sending her the links she still refuses to do anything reiterate your original statement. \n\n“You can’t help those who won’t help themselves”", "nta. Your mom knows what she needs to do but won't do it. And she shouldn't be burdening you with this. She needs to kick them to the curb.", "IVF, isn't your mom in her late 40s, early 50s? What does her soon to be husband think about this nonsense", " NTA. You are fed up. She is enabling them and wants to cry about it, but not do anything. You are not a therapist, and you have more to do than listen to her cry about something she won't change.", "beans\n\n&#x200B;\n\nbtw nta", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mother was a single teenage mother to three and worked harder than any person I have ever seen to provide for her kids. I have an older brother 28 (we will call Alex) and an older sister 25, I’m f 22.Though my mom did all she could we had it really rough. \n\nI left at 17 since then I have been able to take a step back. My brother has always been really difficult. Alex wanted to stay home and become a professional gamer. \n\nAlex never graduated. He met a girl on Tinder (let’s say Emmie) and they got married. I don't know how, but he managed to find someone just as lazy and cruel as himself. Though they are both now almost 30 they have never had a job, never paid a bill, and never contribute to the house. My mother has a certified family care home where she cares for residents 24/7, they live in the house. Alex and Emmie do not help. \n\nOn top of that they, especially, Emmie are incredibly overweight. They eat my mother out of a house and home. Emmie will come downstairs and make themselves six sandwiches and whatever else she can fit in her arms. I promise you I am not exaggerating. When Alex and Emmie fight she will go into one of my mom's guest rooms and make a mess in there and leave.My mother does caring for 4 elderly and dying residents she has to go back and clean up after Emmie.\n\nEmmie and Alex got themselves a husky puppy. This dog is awful, it is not trained. My brother started putting it in a vest and now claims it is his service dog to stop him from picking at his nails. Don't get me wrong I have a service dog because of a real disability, my dog has been trained. His dog has attacked my dog.   \n\n\nOne day Emmie left her room went to a guest room and her dog pee on the bed. Instead of cleaning it up she just went into another room. My mom found it days later, the bed was ruined. They started door dashing, they always took my mom's car and left it trashed and on empty. She asked them why and they said because they didn't want to make a mess of their car (a car my mom gave them). One of my mom's resident even died and she asked them to watch the residents so she could go to the funeral and they said no, so I left college for a few days and drove 8 hours to watch the residents. While they were just upstairs.   \n\n\nMy mom calls me crying all the time about the way they treat her. I listen to what they do and give her advice. I know they will be happier if they leave and experience what it is like to have a real life. My mom never does anything. \n\n\nMy mom is now married. She is doing IVF and asked Emmie and Alex to watch the residents so her husband can be there for the implantation. They said no. My mom called me crying heartbroken. After her last story I told her that she was allowing abuse to happen. I said she was ruining their lives and letting them be a tumor on everyone. I asked her not to talk to me about the issues she had with them anymore if she wasn't going to do anything. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA \nYour mom is way too kind and is with all due respect a fool for letting them leech off of her like that. I understand well actually I don’t understand how the love of a mother makes them care for them that much to the point where they become essentially useless meme era of society. They probably don’t have any abilities they’d be able to contribute to society.\n\nMy GFs mom is somewhat similar as in she lets her grown ass son live in a trailer they own and the son will disrespect her and her husband and sometimes he’ll leave because he can finally afford to and a couple months later he’ll come back and be a bum again. He has two kids with different women and still doesn’t get off his ass to do anything. It just baffles me how merciful they can be. \n\nBest your mom can do is allow them to stay and attain some skill they can use for a job or to get a job and if that isn’t happening buh bye. Homeless or not. They’re grown ass lazy adults.", "Your mother needs to deal with these burdens on her and society. Whilst ever she allows them, they will freeload. It's no good whining to you if she doesn't give them notice to get out. NTA.", "INFO: When you say your mum was a teenage mum, how young? Because if Alex is ~30, she's either in her late 40s now or she was a literal child when she had you guys.", "I agree. Adult protective services needs to be called for an inspection. This doesn’t sound safe for the residents.", "She does have state inspections often. She keeps it very clean, though she exhausts herself from the added work of my brother and his wife. She’s frequently gets awards for the care and the state of her home because of how well she does. I have had to call CPS on my sister. If it was bad I would call without hesitation.", "She’s mid 40’s. They married late when I was in my mid teens. He’s never had a baby and really wants one. I don’t know it was weird at first, but I just want her to be happy ¯\\_(ツ)_/¯", "She’s 46- he’s 28", "There's nothing wrong with having a baby late in life - I'm 43 and have a preschooler and a toddler, so obviously I'm on board with the general concept. But there is something wrong with going to great lengths to have a baby when you can't cope with the responsibilities you already have. At the moment, that is your mum's position, by choice. When she has a newborn, something will have to give, and I fear it will be the wellbeing of her highly vulnerable residents.", "Well good luck with  her attempt to have a baby cause it won't be easy but something easy she can do is kick out her bum son and daughter-in-law."]}