{"id": 13078, "submission_id": "120maw8", "title": "AITA for being upset with my parents for changing my guest list?", "selftext": "Im (26F) engaged to my fiancé (26M) and our wedding is scheduled for this fall. \n\nI’ve always had a rocky relationship with my dad. He’s a high functioning alcoholic and was verbally and emotionally abusive my entire childhood and was unable to be there for me in any meaningful way. We aren’t close and I don’t talk to him much. But he still expects me to listen and obey everything he says. I’d go Nc if it weren’t for my mom. \n\nHowever, they generously offered to pay for the majority of the wedding on their own volition. We did not ask or expect money from them. Despite my complicated relationship with them, weddings are expensive and I appreciate the help. I have a decent paying job and while my fiancé makes significantly less, he gives me extra money he has every month for wedding expenses. So far I have been able to afford my photographer, officiant, DJ, stationary, and decorations. I was nervous my dad (also my mom but less so) would be a pain about decisions. \n\nThe venue my fiancé and I chose is very budget friendly and includes the most a venue can offer. We agreed to do the ceremony there as well and paid slightly more for it. After we signed the contract, my dad complained about us not getting married in a church. We aren’t religious in any way. I would never ask him to convert to Catholicism and I don’t want to be married in a church. He said he’s paying, and I said we already signed the contract so he dropped it.\n\nNow he has an issue with the guest list. Our venue capacity is 140, but we decided to just invite 120 for a few reasons. My grandparents invited a bunch of their friends to my parents wedding, resulting in a 350 person wedding and my parents knew hardly anyone. They hated it. \n\nI invited 60 people and my fiancé also had 60 slots, but his family isn’t very large so he had extra seats and gave them back to me, as my side is bigger. \n\nMy dad texted me last night to say he counted 117 people on our invite list. I said that didn’t seem right because my list was at 120 even when I sent it to them. I had to send it because I travel for work and so they offered to address envelopes for me. He admitted he cut some people to add his friends. \n\nHis friends are mean old alcoholics who hit on my 20 year old sister and make her uncomfortable, among other things. I don’t like them don’t want them there. He’s claiming I’m being a brat about this and I can’t invite the people I had because others will get offended that they weren’t invited. He’s also taking control of the seating chart because he says I won’t do it correctly and his family has to be in certain places. \n\nI don’t think I am being unreasonable, and there’s plenty of other things he’s made problems of that have lead to this.\n\nAITA here?", "created_utc": 1679668713, "permalink": "/r/AmItheAsshole/comments/120maw8/aita_for_being_upset_with_my_parents_for_changing/", "score": 442, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITS for getting upset and telling my dad I want the people I invited there and not his friends and that it was wrong to change my list?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "When parents contribute to a wedding, it is very typical for them to (pay for and) invite their friends, as well. But often, those \"friends\" are either sort of aunties/uncles types OR business associates that they are trying to remain in good graces with.  With 20 extra seats, \"perfect,\" or perhaps if people decline and they are on the \"B-list\" -\n\n>He admitted he cut some people to add his friends.\n\nAWFUL.\n\n>His friends are mean old alcoholics who hit on my 20 year old sister and make her uncomfortable, among other things.\n\nOk, those are people who shouldn't even be on the B-list. \n\nNTA\n\nYour dad has some audacity.", "You should give him back his money and univite him.  seriously.\n\nBut if you’re not willing to do that then contact all the vendors and give them a password that must be given to make changes and make sure they take orders only from you and your fiancé. Then uninvite your dads friends and Invite who you want and then tell your dad you are handling the seating chart. Take every opportunity to throw his own words back in his face: he’s being a brat, inviting those people will upset others, yada yada\n\nNta but you need to find your backbone asap", "NTA this is your wedding but you made a huge mistake accepting money from him. If I were you I would find a way to either take out a loan and give him his money back so you can make the guest list exactly how you want or talk to your mom and dad and see if you can get them to compromise and give them maybe 10 guests they can invite but the rest of the list is yours and no more than 130 invited period.\n\n  As for the seating chart, I would go the route of explaining that you would like to do it since you know both sides of the family better than he does and want to make sure that everyone blends together well or just don't do a seating chart at all and let people choose where they want to sit and eliminate that fight all together.", "NTA. Is 'dadzilla' a thing?\n\nYou have a few choices here. You can relent and let him run things, or you can fight him on it and risk him pulling funding (maybe worth it, maybe not).\n\nOne thing you can tell him is that if he sends invites to people you don't approve, you'll send them an un-invite explaining the situation.\n\nYou also shouldn't be the only person dealing with this. Fiance can step up too.", "NTA but are you surprised?", "Please find a way to give your parents back the money they have given you and remove your fathers control over your wedding.\n\n\nNTA", "NTA\n\nBefore I give reason I'll say this, don't take money from people you want to be NC with. That's just giving them more ways into your life (expectations). I understand weddings are expensive but you should have tried to budget and work out a wedding that didn't need their money. \n\nNow to my NTA scoring: You are not unreasonable for being upset. Your dad shouldn't take control over all of that. He can make suggestions but taking over completely? Just wrong. Id try and have a sit down Convo with your mom and dad and explain how YOU want things done. Maybe pull your mom aside and tell her how this will/is affecting you and see if she can talk some sense into him. \n\nDon't give up this fight OP. Your big day should go well not be a huge issue!!", "NTA and you may want to use some of your own money to hire security to ensure these mean alcoholic friends of your father’s are not allowed in (after uninviting them of course). And your father doesn’t get to control (i.e. sabotage) your wedding because he’s paying for it voluntarily.", "NTA, I understand he thinks he has some power because he is \"paying\" but sadly he doesn't see that's not how this works.  This seems like a control issue on his part, knowing your relationship is strained this seems spiteful on his part. I would delete his add ons and put your people back on.", "Sadly, when people offer money for weddings there are usually strings attached.  It isn't right, but especially when toxic folks are involved it is usually the norm.  Very few people are altruistic.  It's too bad you can't decline his offer, tell him his friends are not welcome and have who you want.  His friends do not belong.  This is YOUR wedding, not a beer night.  If he can't understand the difference, maybe another member of the family can explain it to him.  He doesn't have the right to uninvite any of your guests.  Please see if you can find a way to swing it without his help and I promise you will have a much happier wedding..... with YOUR guests.  NTA.", "NTA. Return his money fund your own wedding, and tell him he makes absolutely zero decisions. If he doesn't like that find a bar and stay put.", "NTA - it's your wedding and you should be able to say who you want there and who you don't.  Just because he is helping pay for it, doesn't give him the right to adjust your guest list.  I would sit down with your Mom and see if she can help.  Good luck.", "NTA, Its your wedding and you decide who attends and who doesnt. If your dad doesnt like it, tell him he can either agree with you, or you can refund him for what he paid and get uninvited to the wedding so he can go catch Cirrhosis along with his grooming buddies.", "NTA", "ESH, Everybody Sucks Here.\n\nThey offered to pay for the majority of the wedding, you accepted **even though** you were concerned about their interference in the decision-making. So you knew this would happen and thought the money was worth it.\n\nThen you went forward with allowing/inviting them to interfere (discussing the venue, handing over the guest list so they could address your envelopes, ceding control of the seating chart). That's on you.\n\nYour parents think their money gives them rights in the wedding planning. But you're not only letting them steamroll you, you are *letting* them do things because it benefits you.  Now you're lying in the bed they helped you make.", "No offense but you should have known better than to let them send out the invites.  You're nta but how in the world are you going to fix this mess.", "NTA. It's your wedding, and you have the right to decide who you want to invite. Your dad shouldn't have cut people from your guest list without your permission, especially to add his own friends who make your sister uncomfortable. You are not being a brat, and your dad is being controlling and disrespectful of your wishes. It's understandable to feel upset and frustrated in this situation. It's important to have a conversation with your parents and set boundaries about their involvement in your wedding planning. You can be grateful for their financial help while still maintaining control over the guest list and other important decisions.", "ESH. This is why you never accept money from people you don't like. You will either take back control and pay yourself, and cancel the invites to send it again, or you will have to put up with this.", "ESH - Why on earth would you accept money from your dad knowing what kind of a person he is? He is obviously being an AH, but what did you expect? You and your fiancé are now in a difficult spot - something you could have avoided by refusing to accept the money.", "ESH. You knew there would be strings attached when you accepted the money.  You can’t have it both ways. Pay the cancellation fees and elope. Use the money for the marriage and not the one day that is shaping up to be a shit show.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIm (26F) engaged to my fiancé (26M) and our wedding is scheduled for this fall. \n\nI’ve always had a rocky relationship with my dad. He’s a high functioning alcoholic and was verbally and emotionally abusive my entire childhood and was unable to be there for me in any meaningful way. We aren’t close and I don’t talk to him much. But he still expects me to listen and obey everything he says. I’d go Nc if it weren’t for my mom. \n\nHowever, they generously offered to pay for the majority of the wedding on their own volition. We did not ask or expect money from them. Despite my complicated relationship with them, weddings are expensive and I appreciate the help. I have a decent paying job and while my fiancé makes significantly less, he gives me extra money he has every month for wedding expenses. So far I have been able to afford my photographer, officiant, DJ, stationary, and decorations. I was nervous my dad (also my mom but less so) would be a pain about decisions. \n\nThe venue my fiancé and I chose is very budget friendly and includes the most a venue can offer. We agreed to do the ceremony there as well and paid slightly more for it. After we signed the contract, my dad complained about us not getting married in a church. We aren’t religious in any way. I would never ask him to convert to Catholicism and I don’t want to be married in a church. He said he’s paying, and I said we already signed the contract so he dropped it.\n\nNow he has an issue with the guest list. Our venue capacity is 140, but we decided to just invite 120 for a few reasons. My grandparents invited a bunch of their friends to my parents wedding, resulting in a 350 person wedding and my parents knew hardly anyone. They hated it. \n\nI invited 60 people and my fiancé also had 60 slots, but his family isn’t very large so he had extra seats and gave them back to me, as my side is bigger. \n\nMy dad texted me last night to say he counted 117 people on our invite list. I said that didn’t seem right because my list was at 120 even when I sent it to them. I had to send it because I travel for work and so they offered to address envelopes for me. He admitted he cut some people to add his friends. \n\nHis friends are mean old alcoholics who hit on my 20 year old sister and make her uncomfortable, among other things. I don’t like them don’t want them there. He’s claiming I’m being a brat about this and I can’t invite the people I had because others will get offended that they weren’t invited. He’s also taking control of the seating chart because he says I won’t do it correctly and his family has to be in certain places. \n\nI don’t think I am being unreasonable, and there’s plenty of other things he’s made problems of that have lead to this.\n\nAITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA at all, but you should have never taken the money....that wasn't a gift so much as it was about control. Stop, realize you're writing into an anonymous advice sub trying to get validation that it's wrong you have men who will harrass your sister invitedted to your wedding. Give the money back, have a smaller wedding that you can afford, answer to no one!", "NTA but why in the world would you turn over the guest list & invitations to someone you can't trust.  Terrible lapse on your part & now you're paying for it.", "OP....why do you accept money from him? I understand weddings can be expensive but they don't have to be. And you already said that you didn't expect money from them.\n\nYou seem to cross your own boundaries and go way outside of your comfort zone, for what? For the free money you are getting out of it? Is not having to pay for the wedding worth more than being comfortable and having the freedom to choose however you like? Clearly the offer of paying for the wedding comes with the entitlement of control. Is that what you want?\n\nESH, your dads behavior sucks and he sounds like an asshole who doesn't respect you. But you would also suck for accepting this, instead of taking control for yourself with your fiancée and just making your own decisions!", "Have you never read The Gift of the Magi in school? This is exactly what happened, you should have never accepted any money, unless he offered to pay for one simple thing like the cake. The minute you knew that he was going to have some kind of monetarily power over you, you screwed up. Sorry, but either give him back the money, or suck it up and deal with it", "ESH. You made a deal with the devil and now when it's time to pay that price you surely knew was going to come in some form or another you are playing the victim. Either pay and take control back in your hands or deal with the consequences of accepting a massive amount of money for your wedding.", "NTA. Normally, I would say if your parents are paying for the wedding, they could get away with inviting a few guests.\n\nHowever, trying to take control of the venue, whole seating chart and inviting guests that hit on younger girls is taking it to far! \n\nWith how he treated you in the past... an ultimatum is probably needed. If your dad doesn't back off with his demands, go NC with him. Since he wasn't there for you in the past, now is the chance to prove that he can actually be a caring father.", "ESH. This is a common issue regardless of your fathers alcoholism. Parents pay for the wedding and historically want to be in charge of who comes. (For example your own statement about your grandparents inviting 300+ people to your parents wedding) usually in this case the people getting married yield because the parents are paying. You have to decide what’s more important to you, seating/inviting who you want; Or paying. It’s fkd up but that’s literally a historic issue with weddings.", "NTA- but unforatetly because of the financial aspect I'm not sure there's much you can do. If you push back on changes he's making he will always have the upper hand because he's paying for your wedding. You're intuition was telling you this would be a problem and you were right but I don't think there's much you can do if you plan to continue to use his financial contributions", "INFO:  You indicated your Dad sent invites.  Since you are getting married in the fall, did he send actual invitations or Save the Date cards?", "NTA.... easy fix....\n\nHire a bouncer for the door and a police officer to sit.... give them the guest list and tell them to only allow those in that are on YOUR list; regardless of whether they show the invite or not. Tell the bouncer false invites went out without approval. Then send invites too those your dad \"cut\" from the list on your own. \n\nTell your dad \"thanks for sending out the invites; we decided to include those friends that didn't make your list anyways; were not changing our guest list on your accord its not up for discussion\"\n\nAnd drop it", "This is a familiar story on AITA: when the parents foot the bill for the wedding, they control it.\n\nYour father's guest list will make your magical day into a slum. Instead, cancel everything and hold your own very quiet and lovely wedding among the people you like and no one else. Hire security to keep out anyone you don't want. Make it a special party, with imaginative music and a really splendid cake decorated with favorite characters--from The Lord of the Rings or some Disney film? Something you love.\n\nAnd make sure dad is kept out.", "You have every right to be upset with your dad removing guests of yours. He sounds like quite an AH. If he’s paying for the wedding, and the venue has some wiggle room, why can’t you have your 3 guests and he have his 3 buddies? I understand you would rather the not be there, but he is paying and will hold that over your head as long as he is paying. Am I missing something about it being a firm limit at 120? He can pay extra to have his buddies attend. He was really out of line removing 3 of your guests.\n\nETA: NTA", "I can never understand when I hear about parents' friends not only being invited to weddings of practical strangers but also showing up. There's always a good chance a wedding will not be worth wasting an entire afternoon/evening, and then I need to buy an expensive gift too? I always hope people I don't know very well will NOT invite me!", "NTA Tell your dad that you are happy to give him a table worth of invites- it's probably worth saving the hassle. But that whoever he invites is who he and mom will be sitting with.\n\nHe doesn't get any say over the list as a whole or who sits where. Why this isn't his wedding.\n\nWhile you are thrilled that he and mom decided to gift you funds for your and fiance's wedding- it's your wedding not his.\n\nAnd next time don't do things like send your parents things like the invite list- just tell them stuff like, we finalized this decision and decided on X. (This doesn't mean you can't ask their opinion: we really like these 5 things. which are your top 3? but ultimately you make the decisions cuz it's your day- and you don't want your kids to grow up with the story of how your marriage started out with you guys getting railroaded by your parents inviting terrible guests to wedding or changing your wedding cake or whatever else it is that your dad will try to get you to do.)", "I dont even need to read the whole thing. \n\nNTA", "Get your money back and elope.  NTA", "NTA. You need to get back your invitations. You'd be better off taking out a loan for the amount your parents are contributing.", " Are you able to put the wedding on hold until you and your fiancée can pay for it yourselves? It doesn’t seem worth it to have your dad pay if this is how it’s going to be.", "NTA. You need to cut your dad off. Do the invitations yourself. Pay for the wedding if you have to. He will ruin your day and no amount of money is really worth that. Tell him he won’t be invited if he keeps acting like an ass. Let him know he had no power over you. You don’t need him or his money. Trust me you’ll be better off.", "NTA.  Your wedding, your guest list.  If your parents want to make changes, they have to AT LEAST discuss it with you.\n\nGiving them the invitations to send out/address was a mistake.  They're taking advantage of it to overrule decisions already made.", "NTA, that’s awful.\n\nHere’s the painful tedious part; if you have a copy of the list you and your husband agreed on inviting I’d recommend contacting them one by one to make sure they got their intended invitations.\n\nTell your Father he needs to personally un invite anyone he swapped for one of your guests. As an extra measure you may even want to hire for lack of a better word a bouncer with your list to check names as they arrive.\n\nYour father’s voluntary gift of funds for the wedding do not entitle him to decisions. He may approach you for things he wants you to consider and refuse to pay for something he doesn’t like but at the same token the final say for YOUR wedding is YOURS.", "NTA, but YTA by involving your dad in the invitation sending process. That calls for a desaster.", "Why isn't the mother ever drawing a line on these pseudopedophiles coming into her home and hitting on her barely legal daughter? That's disgusting", "ESH - Why on earth would you accept money from your dad knowing what kind of a person he is?", "Exactly. When will people understand that it’s so much better to have a small, simple wedding that you can afford, with the people you care about, than to accept mom/dad’s money and have them meddle in everything. \n\nESH", "Knowing how the father is I feel like OP should have seen this coming. No way an abuser gives all this money and doesn't expect something in return. He's not a good dad at all", "Yes you’re right.", "Couldn't agree more!  Stop using your parents for money when they are assholes.  You knew this would happen.", "Sorry, are you sure you're thinking of the right short story? The entire point of The Gift of the Magi was that the gifts Jim and Della gave each other couldn't be used, but they knew how far they went to show each other their love and how invaluable their love truly was.", "That is fair. Aside from WHO he added, im not upset they want to have some say in the guest list. I’m more upset that they purposely removed people i added to make room for these other people", "No they haven’t been sent yet. I am a contract worker and live out of state at the moment, so my mom offered to adddress our save the dates and send them, which is why I gave her our list", "He removed more, he just replaced some with his friends. I asked about upping to the full 140, but he refused. I offered to pay the difference even but he just stopped responding", "I guess there isn’t a *real* reason why we couldn’t. We have been engaged for three years because I wanted this date specifically. My great grandparents, grandparents, aunt, and mother were all married on the same day and I wanted to honor my grandparents because I was very very close with them and be married on that day too and this year it’s on a Saturday, so I’d have to give up that day or wait another six years, which is a very superficial thing to care about but it is very important to me", "It’s taken me a really long time in therapy to admit that my mother has fault in allowing his behavior and of those around her. I’ve called her on it but she just says she can’t make everyone happy n", "Well, actually one parent is an asshole, the other is their enabler", "No, you should have a problem with the guest list. Your father clearly wants to invite people who will be making your sister uncomfortable. Stop being a doormat for the sake of money.", "Oh ok. I can understand that. Have you considered a courthouse wedding on that specific day and then a larger wedding on another day?", "Well, tell her to realize she's doing more harm than good. Being an accomplice is never a good thing", "I am not okay with who they added.. I’m saying because they are paying I understand they want a say in the guest list, my issue is I don’t like this people and I don’t appreciate the people I picked being dumped from the list in favor of their friends, and their shitty friends at that", "We did, but we just both wanted a “real” wedding, in terms of doing it all with our friends and family and on the same day. I guess I should have figured in that it wouldn’t be the best option, it’s just what we wanted", "That’s not going to work. Spouses like that are enablers who shift blame, tolerate abusive behavior, and pretend everything’s fine or that it’s everyone else’s job to keep the peace because they don’t want or know how to deal with addressing it and standing up for others or themselves.", "He is not allowed to cut people you want.  Invite them anyways.  And get your guest list and save the dates back from them.  Ask a friend to help you.\n\nAnd hell no to him bring in charge of the seating arrangements.  That’s insane.\n\nHonestly though, I’d refuse the money and find a way to pay for it on your own.", "And that’s totally understandable. It’s definitely much easier to do it all at once but if it does become a problem, maybe consider this as plan b. It’s better to have the wedding of your dreams than to have a wedding that remind you of how selfish others were.", "Y T A for accepting your parents paying for the wedding when you know your dad is controlling and sucks. If you can, I would refuse to accept his money and downsize if needed so you can afford to pay for it yourself. What's more important, a wedding that is more lavish than you can afford, or a wedding you will remember positively? I'll have to vote ESH because your dad is obviously awful.", "NTA\n\nHire or get some friends to act as security. Then tell your dad, \"I will be providing MY guest list to security. Anyone not on the list that I wrote will not be allowed entrance. My guest list is complete, and there will be no alterations without my approval.\"", "If he’s paying for most of the wedding, letting him invite a few people seems fair.\nWhat is not OK is cutting your guest list to make room for his guests.\nHe should not be inviting inappropriate people though. NTA", "You are nta and he is not worth the money.  Tell him NO.  YOU set the guest list and YOU set the table assignments.", "You knew who your father was when you accepted his money. Either go forward without his money, or straight up yell him that he is not in charge of anything, and he need to stop. Better to elope than to hate your own wedding. \n\nNTA.", "Elope and have your wedding when you can afford it yourself if you don’t stop this now it never will let your feelings be know don’t hold back to save face or feelings either it’s not fair to have your day ruined plus put your sister in a uncomfortable situation when you know you can avoid it.", "This guy sound awful. He has no right to do this and is actively ruining your wedding. It is not his wedding and has no say in the decisions that go into it. NTA.", "Give his money back if you dont want him inviting people.", "ESH, just for the fact you are this old and with all that you've experienced, you really, really, should have seen this coming.\n\nThis is your fiancees wedding too, and you are letting your father highjack it.", "That's the problem when you involve someone else's money when paying for a wedding, at that point they've got you by the balls", "ESH. You shouldn't have accepted money OR help from your parents. Your parents are obviously assholes but stop giving them access to sending out your STDs. \n\n>I had to send it because I travel for work and so they offered to address envelopes for me. He admitted he cut some people to add his friends.\n\nYou brought this on yourself and your future spouse.", "Elope and let dad be mad about losing deposit money. Then tell him he forced this by trying to overrule you. \n\nNTA.", "Nta. Ininvite them. Tell your dad to stay our of it. His friends are dirty old men.", "NTA - & You need to do this wedding without parental money,  and uninvite appropriate parties.", "NTA\n\nget control of the guest list and scrap the mean old drunks. And get security to stop them entering", "NTA\n\nBut, honestly, I wouldn't have taken the money. You knew he would be like this. It's hard to hold your ground when you're taking so much money from someone you knew was such a problem. A small wedding that you paid for yourself would leave you just as married and not beholden to someone you don't like.", "NTA stop giving him access hire a bouncer and turn away anyone who isn't on your list", "NTA but I would seriously consider cancelling the venue and just eloping. I know you want a real wedding- I get that- but do you really want him to hold this over you forever? He’s already showing he doesn’t value your opinion. I personally wouldn’t accept anymore $ from him and just plan a nice vacation for you and your fiancé to go get married. Real weddings are great but the important thing is WHO you are marrying- not where it happens! You could even do like a cruise wedding or destination wedding and still invite close friends.", "Nta, you are not obligated to accept the strings they attached after giving you a gift. Figure out what your boundaries are and set them firm.", "If someone other than her parents is TA it’s you", "Paying for part of a wedding doesn’t entitle him to remove anybody from the guest list. And if he wants to invite anybody, it’s still her wedding and he should talk with her first. If these are people she actually does not like, she’s allowed to veto it, as again, it’s her wedding\n\nIf he doesn’t like it he can withdraw his money", "That is not Gift of The Magi. I don’t know what story you read but this ain’t it.", " Terrible lapse on your part & now you're paying for it.", "Ugh. What a jerk. I think I know the answer, but is it too late to just pay for the whole thing yourselves? I have a toxic father, and that's what we did. Paid for it ourselves. One of the best decisions ever. Also didn't ask him to walk me down the aisle. My husband did that. Still no regrets 19 years later.", "Any way your parents would be willing to call around and say that these guests are on your \"b-list\" and that they weren't supposed to be sent unless a certain number of regrets came in, but unfortunately all of your family and friends are able to attend so the venue doesn't have the space?\n\nOr is your dad that much of an AH.", "The enabler is also an asshole for letting this go on all these years and not protecting the kids.", "The wedding is in September, so I’d have to get enough money to pay for the venue, which is all they’ve paid for. It’s too much for me to save up and also pay for the rest of the stuff we will need. I really don’t care for him to walk me down the aisle or have a dance with him, but when I talked to my therapist she asked if I could tell him that. No, I can’t really, not if they’re paying and not if I want to keep myself sane. I’d get bombarded by the rest of my family, which has happened every time I’ve tried to cut him off. My therapist suggested I try and see it in a way where it isn’t going to mean to me what it means to him. And if I feel like I have to do those things, I don’t have to place importance in it. If that makes sense? Idk the longer I’m in therapy the more I realize how messed up I am from the way I was raised and how I would rather let everyone else have their way so I don’t have to face the backlash and that’s a hard thing to come out of.", "So they weren’t actually sent. I work out of state as a contract worker right now so my mom offered to address save the dates for me and I had sent them the address list which was clearly a mistake", "Oh, I do get the sentiment. I’m just saying the mother herself isn’t an asshole; her inaction just exemplifies the real assholiness twofold.", "I see. I hope it gets easier after September and that the wedding can be something of a \"reset\" for you and you can gain autonomy from him and feel you don't have to be beholden to him. It's the worst. I get it. <hug>", "That's good!  (at least)\n\nI was wondering - is it 117 + you and your husband-to-be annnnnd... (someone's child?)? \n\nAnyhoo, at least you have some time to switch things back.  And it's good they are save the dates, b/c you can probably just buy some new envelopes.  No one should be at your wedding who makes you uncomfortable.  While I do think (since there is the space), it is \"typical\" for the parents to invite some people, this is not in place of your guests and this is not anyone who will make anyone else feel unsafe.", "Thank you", "It is 117 total, I had some people that were like a b list, less close friends and such, but if we went off my list there were no openings for extra people unless some declined", "Uninvite your parents, send out new invitations, and send disinvitations to the nongratis.", "ESH.  \n\n\nHe's paying for your wedding so naturally he wants to invite his friends. His friends are people you don't want anywhere near you.  \n\n\nI'm afraid the solution is obvious; give him back the money and re-plan the wedding as something you and your fiance can afford together.  Feel free to invite your mother, by herself, and make clear to venue security that your dad isn't allowed in.", "NTA - tell your father he’s not invited to the wedding", "YTA for not taking the responsibility of the guest list & your own invitations. Handing these off to you family has created quite a mess that you need to fix.", "NTA Honey you really need to cut him out of your life or you will be forever dominated and controlled as an adult by your father. You will always be his possession. Your mother enables him and does nothing to protect you. She chose him. Now is the time to choose you.", "Give him back the money and uninvite him and all his terrible friends or relatives. Otherwise he's bought control over you for a fair price of a medium sized wedding.", "NTA, but not very smart.  \nAlcoholic father + abusive + he's paying for the wedding = major trouble. I hope you can stand firm and exclude his drinking buddies.", "NTA but you know how your parents are and yet you took their money. And you don't want to stand your ground because you want your dream wedding. \n\nYou have a couple of options. Call all your vendors and put a password and say no changes allowed by the parents. If they threaten to pull your funding them that's the end of your relationship with them and it sounds like you'll be better off\n\nOr let your dad have the wedding he wants. \n\nBut do you think you'll enjoy your wedding? Is it fair to the groom and his family? And will you even keep a good relationship with your parents after?\n\nI say reclaim your wedding and cut your losses now", "He's 100% the Asshole\n NTA", "Do yourself a favour. Sack your parents from any role in the planning and tell your father he is not having those people attend. If that means giving him back his money then it will be money well spent.\n\nNTA.", "NTA tell dad to back off. it's your wedding and you don't want his rude drunken louts there.", "Yuck.\nWhy are you still letting them control you at your age. If you can’t afford to get married off your own dime then don’t. \nNTA but you need to look at why you are continuing to do this.", "NTA, but free money is rarely cheap.  Take it back over, without his expensive financial help.", "NTA. I would call the venue owner (or whoever is in charge) to tell them that all wedding details and changes are to be done through you and your fiancé, no one else. Get the original guest list and seating arrangement changed back and make sure you also have an usher to turn away people that aren't on the list.", "NTA but you’re also wasting your money on therapy if you’re going to do the complete opposite of what it’s supposed to be helping you with. Unfortunately you’re an adult and it’s time to face hard decisions and make them as well. Your father has hurt you and both you and your mother enable him. She enables him by saying she can’t make everyone happy and you enable him by not standing up for yourself. You owe yourself that at least. \n\nStop letting your parents steamroll and have involvement in your wedding. Get your guest lists and wedding invitations from your mother and enlist your fiancé and friends to help you send them out. If you don’t do something now, you’re going to regret it in the long run and what’s supposed to be a sentimental day with meaning (your grandparents, aunt and uncle, and etc.) will forever be tarnished.", "Oooooooooh OP NTA and I would set the boundaries NOW that this is your wedding and not theirs to control. They are offering financial assistance, but do not let them use that as financial abuse and control. If they follow through with their wishes on your day, you will look back on your wedding with sadness instead of the happiness that it should be. \n\nFirst I would get his friends cut off that list ASAP and stop your parents from making any more decisions for you. They cannot be trusted and if they threaten to pull out of financing then you will make it work without their help and without their presence. Trust me! Your friends and other family will step in and help you make it. You CAN do this without your parents money if you need to. \n\nCongrats on the upcoming wedding and good luck with the parents.", "NTA  \nTake back the guest list. Order more invitations. Tell his friends they aren't invited. Take the seating chart back & don't allow him to see it. Invite your friends. Tell him you can handle this.", "Pull the  plugg on this wedding and only have a small one with  his parents, sibling, your sibling and that be it.  You dad is going destroy this like everything else he touches.", "NTA. Unfortunately, you can't have your cake and eat it too. \n\nBy helping financially with the wedding, your dad thinks he has a say. He shouldn't. It's your day and his demands are selfish and how he's going about it is extremely disrespectful. If you don't want his input, don't ask for financial or any help for that matter. \n\nAlso, if you don't want random people showing up at your wedding, you better put down some boundaries/possible consequences (\"You will be asked to leave the venue if you bring anyone not on the guest list\" etc.)", "NTA for standing your ground but YTA for taking their money and letting them \"help\" you. Parents and wedding planning should never exist in the same sentence unless you are happy having no opinions.", "NTA but he paid for the wedding so unfortunately he feels entitled to run the show. Cancel everthing. Give his money back. Have the wedding you can afford to pay for yourselves. It will be your and DF's wedding not your father's that way.", "Yep. \n\nYou took their money. You KNEW they are shitty people. They behaved EXACTLY as you would expect them to behave.\n\nIts not like they blind sided you. Or that this behaviour was new. Or you didnt know what would happen. You wrote all of this - \n\n>I’ve always had a rocky relationship with my dad. He’s a high functioning alcoholic and was verbally and emotionally abusive my entire childhood and was unable to be there for me in any meaningful way. We aren’t close and I don’t talk to him much. But he still expects me to listen and obey everything he says.\n\n....and yet you decided to take their money. Your parents are AH because they are truly awful people. You are an AH because you got greedy and decided to overlook a history of abuse for a free dream wedding.", "YEP this is it.  ESH.  You accepted their money KNOWING they were going to take over aspects of planning.  The only way to prevent this is to give them back their money and tell them their \"help\" was appreciated but you're going in a different direction and you are NOT inviting your father's friends to the event YOU are paying for.", "Is it that hard for parents to just leave the event that's about the child for THEMSELVES, even though they are paying? What the \"dad\" did is unacceptable and inexcusable.", "Ok good. Now you need to cancel everything & give back all the money you can recoup. Then take a time out with your other half, no wedding talk at all. Then after a month or longer, talk about what you actually want and remember it’s the marriage that counts not one stupid day.", "By her own admission, he has a history of being abusive, an alcoholic, absent parent who expects their child to obey everything they say. \n\nHe behaved exactly as you would expect him to behave. She on the other hand, should not have taken the money.", "She can't, but it is her duty to protect her children...", "She's right about that, so she has to think about who she would rather make happy. Her daughters or her alcoholic and abusive husband?", "Agreed. Best would have to have gotten it out of the way early. Ask ahead if there’s any stipulations. That way OP could have reflected the money at the start, or shut any expectations early", "A part of you will always believe/hope that they've changed if that makes someone an asshole then we all are.", "Well right, she can't make everyone happy so she needs to think about who should be making happy when helping with her daughter's wedding hint hint it's NOT creepy dudes.", "You can absolutely hope for the best. Without taking their money and betting your wedding on it."]}