{"id": 13184, "submission_id": "121w1vh", "title": "AITA being upset with how SO handled vet appointment?", "selftext": "I recently noticed something concerning going on with my pet, nothing crazy but enough to warrant a trip to the vet. The issue is that by the time I get off work and on my day off, the vet is closed. I asked my SO if they would take my pet to the vet for this specific thing I was concerned about and they said yes.\n\nThere have been instances in the past where my SO will be doing me a favor, and will deviate off the plan and make decisions for me that I didn’t ask for, that often lead to costing me more money than planned. Such as taking my car to the shop for me and then agreeing to additional work that it probably needs, but I did not want done. I know it comes from a good place, but I don’t appreciate decisions being made for me, especially when I am the one financially responsible for them.\n\nLeading to the vet visit we talked about what I was concerned about, what was being done, what I had arranged the appointment for. I reiterated these things in a text and said please call me if they say anything else needs done other than x, y, and z so I can make the decision myself. They said okay.\n\nA little while after the appointment they tell me what the bill was, and what all the vet did. The bill is almost double what I had been quoted over the phone and there were several tests and a shot given that I did not ask for or agree to.\n\nSO says they misunderstood my text about not allowing extra work without checking with me, and says my text message did not mention the specific testing I was okay with, so they agreed to all the extra testing and the extra shot that came with testing. I did not mention “xyz testing”, I did just say “testing” but we’d talked about it previously, and the specific testing I was okay with was literally in the text message one up on the thread.\n\nI’m upset they made a decision about my pet and my finances without calling me, they said it’s a simple misunderstanding. AITA?\n\nETA: at the end of the day it’s thankfully not an amount that’s going to break my bank so I’m just letting it go, it was just really frustrating in the moment to feel like I went through all the work to explain what I was and wasn’t okay with and for it to feel like I was ignored. But ultimately I’m just thankful for the help getting my pet to the vet.\n\nAlso, if it’s relevant: the pet is solely mine. This is not her normal vet, just one that had availability to see her the soonest. She will be going to her normal vet for her routine work and vaccines when I’m able to schedule some time off, which is why I only wanted certain things addressed at this appointment.", "created_utc": 1679771779, "permalink": "/r/AmItheAsshole/comments/121w1vh/aita_being_upset_with_how_so_handled_vet/", "score": 187, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I was upset with my SO for not following up with calling me before signing off on extra work, I feel like I might be the AH for getting upset with them and arguing that they did not listen to what I asked because they were doing me a favor, but at the same time it costs me not them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. To everyone saying that OP is the AH, it's pretty common sense that unless it's an emergency you don't make major decisions on behalf of someone else's loved ones or finances. And OP should have a partner that does understands that. It's not that hard to understand. Now, if SO had tried to reach OP to ask what was ok and OP couldn't be reached, that's a different story.", "NTA. I had my sister take my cat to the vet for her vaccinations because I could not get off work at the time. Peak season for my work, basically no one gets time off. She called me and asked about anything extra, so I could approve it. I also bring my brother's cat to the vet because of his work. I always call and ask before I approve any testing and only authorize cheaper things myself. It is not that hard.", "NTA, I don't get what the SO is thinking, but it might be about control. But clearly they can't be trusted with anything involving money so it's not looking great future-wise. I'd expect them to pay back every extra cent.", "Oh people calling this person out, NOPE, Vets have become voracious with expensive testing and other money makers.  I have noticed this especially with the corporate owned ones.  \n\nYou can't let them take advantage of you, and its tough. \n\nBut, I would recommend a new vet, good luck with that one, and going to appointment too.  SO should have asked how much.", "NTA. SO had no right to agree to all of the extra tests, etc at OP's expense, especially since it was made clear to them that OP would make that decision after being informed.  \n\n\nOP I would ask SO to pay the additional expenses. I would also put a note on your file with the vet that no one but you is authorized to approve charges.", "NTA. You gave an adult specific verbal AND written instructions (that they could refer back to) with possibly the option of calling you. They had every tool any competent and thoughtful person would need to complete the task. I would be concerned about trusting them with future tasks that could someday be even more important or recurring.", "So your aware your SO  does this. Has a history of doing it YET you keep allowing giving them tasks and expecting the result to change. Then when it doesn't, you get the bill, get upset and do it all over again. YTA for not learning the 1st,2nd or 3rd time", "NTA, she can pay for it.", "NTA. No one wants to pay double what they were expecting for something they didn’t ask for, more than likely even completely unnecessary", "This is **your** pet. YOU are the only one responsible for your pet's treatment. YOU are the one who should have taken your pet to the vet. Stop relying on someone else to pick up your slack. For that, I'd say YTA.\n\nOn the other hand, SO had no right to agree to extra charges without contacting you first. So NTA for that.", "It’s giving me willful ignorance and weaponized incompetence. I would say NTA and then tell SO why I won’t be able to trust them with certain things moving forward and the ways in which they can earn back that trust.", "NTA\n\n&#x200B;\n\nMake a new rule: When they spend more money on your behalf without asking, you will not reimbourse them.", "NTA\n\nIf it's a \"simple misunderstanding\" like he says, then he should be willing to pay for the tests and shot that you didn't okay. In the future, I would have the vet's office note in the file that no procedures are to be performed without authorization from the person with financial responsibility.", "NTA I often take my moms pets to the vet for her because my schedule is more flexible. If the vet ever says something needs to be done, I always tell the vet I need to take a second to call my mom since she is paying for the visit. Its slightly awkward, but it's not my money to spend.", "I'd be annoyed too but YTA even so. If you want it done the way you want it, don't send your partner to do it. They can't read your mind.", "YTA\n\nHe did you a favor and yes, he misunderstood some of the instructions but none of it was malicious. And frankly, misunderstandings are not uncommon when people send their SO or child to the vet with the pet. \n\nAlso... were you even reachable to ask about additional testing? And if so, then why didn't you just make time to \"attend\" the visit by phone so you could speak with the vet directly?", "Soft YTA- it probably was just a misunderstanding. You sent somebody to the vet in your place, to a certain extent they are going to be put on the spot and be asked to make decisions. You shouldn’t send somebody to represent yourself in such an important situation if you aren’t willing to let them make decisions in the moment. If you cared that much, you should have just taken a day off work to take your pet to the vet like most people do. \n\nEdit to add: Your pet probably needed the shots if the vet gave them, it sounds like what needed to be done", "YTA\n\nIf you want to be in control you need to do your own chores.  End of story.", "YTA. You ask someone to do favors for you and then routinely complain about how they do them. Figure out a way to do them yourself. It's a pattern, change it instead of berating her for doing it \"wrong\"", "Slight YTA.\n\nIf you wanted to make all the decisions, then you should have gone to the appointment.", "Sounds like a communication problem.  I have been in this position before, it sucks.  You trusted him to do what's right for the pet and your car. When it's someone elses money, its a bottomless pit. When it comes to your car he should have told you what else you needed done so you could have taken it in at a later time to finish it up.   \n\nIf it's truly a miscommunication problem that should end right there.  If it happens again he disregards your wishes. Tell him next time if there is any additional cost he will have to pay for it, I'm sure that will stop it.  I understand you have to work  but if you dont trust him to take care of what he thinks you need, you will have to the time off and do it yourself. There was no malicious intent here unless you truely believe he was disrgarding your financial situation (as he says he misread the text) only you know if he is an excuse maker, if he takes responsibility for his wrong doings or blames other people. \n\nYou are not the asshole for not wanting to pay the extras, chalk it up as a learning lesson he sounds like had your best interest at heart as you trusted him to be. See if he is willing to pay for the extras himself, you might get lucky. \n\nPeople who provide service always want more then what you go in for.  It's safest to take on this reponsibility yourself if you don't trust someone else to fill in the extras you may very well need.  What if your pet did need that test, if you had to take it back you would have to pay yet another office visit.  You were not there to hear what the vet said so he really may have thought you needed it. \n\nAssholes come with malicious intent, or disregarding your reality and wishes.  Only you know him to know which one it was.  You had no malicious intent by sending him in.  So this situation just sucks.", "NTA. My wife had to taker our dogter to the vet a few weeks ago. Unbeknownst to her, her phone was acting up and she couldn’t receive phone calls (drop off/ pick her up later). So the vet reached out to me in regards to extra tests etc. Once it got to financial things I asked him if I could have her call him because that’s her area, not mine. He had no problem with that and she greatly appreciated it", "NTA You gave clear instruction. Your partner could have contacted you if they were unsure. When i do something for my SO, i always get out my handy and tell the people what my partner wish for if i myself am unsure what this means since i have no idea of this stuff. \n\nIhave the feeling since your partner spends your money they have less problem to say \"yes\" to extra stuff because it doesn't hurt their finances. But what a shitty way of thinking...  It is so easy to spend the money of other people.", "NTA. Your SO knew what you wanted and didn’t want. They simply disregarded what you said and is playing the innocent card now. Gaslighting you, specifically. You mention SO has done this more than once. Why are you still with SO? It’s going to continue until you stop the relaxing SO. They obviously don’t care about your wellbeing.", "nbta. y’all just need to work on communication. to me it seems like you didn’t explain what you wanted done in enough detail to someone who has a track record of need the specific details. just sit down and tell him exactly what you just posted", "YTA. SO did you a favor. You could've specified with the vet if there were specific things SO doesn't understand.\n\n If I was them I wouldn't be doing you anymore favors.", "YTA- do your own chores.", "YTA. Taking your pet to the vet or your car to the garage are pretty huge favors to ask.", "YTA. Don't ask your SO to do things for you. You've clearly been unhappy with this so many other times, so learn from your mistakes. It sounds like it would have cost less to take some time off work", "YTA. If you want to be totally in control at vet appointments, take time off work for them. He’s already doing you a big favor and trying to make these decisions in the moment can be stressful even without having to call someone else to check in.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI recently noticed something concerning going on with my pet, nothing crazy but enough to warrant a trip to the vet. The issue is that by the time I get off work and on my day off, the vet is closed. I asked my SO if they would take my pet to the vet for this specific thing I was concerned about and they said yes.\n\nThere have been instances in the past where my SO will be doing me a favor, and will deviate off the plan and make decisions for me that I didn’t ask for, that often lead to costing me more money than planned. Such as taking my car to the shop for me and then agreeing to additional work that it probably needs, but I did not want done. I know it comes from a good place, but I don’t appreciate decisions being made for me, especially when I am the one financially responsible for them.\n\nLeading to the vet visit we talked about what I was concerned about, what was being done, what I had arranged the appointment for. I reiterated these things in a text and said please call me if they say anything else needs done other than x, y, and z so I can make the decision myself. They said okay.\n\nA little while after the appointment they tell me what the bill was, and what all the vet did. The bill is almost double what I had been quoted over the phone and there were several tests and a shot given that I did not ask for or agree to.\n\nSO says they misunderstood my text about not allowing extra work without checking with me, and says my text message did not mention the specific testing I was okay with, so they agreed to all the extra testing and the extra shot that came with testing. I did not mention “xyz testing”, I did just say “testing” but we’d talked about it previously, and the specific testing I was okay with was literally in the text message one up on the thread.\n\nI’m upset they made a decision about my pet and my finances without calling me, they said it’s a simple misunderstanding. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO - You said twice “they” said yes.  Besides SO who else is there?", "Not only that but, why is he making arbitrary decisions for what is essentially her CHILD?? Like WTF? To me this is no different than taking a child to the doctor and getting extra tests done without the parent’s input!\n\nNTA - This is such a huge breach of trust that I’m not sure I’d stay with the person. It was not their place to make medical decisions for your pet, even above and beyond what it cost you financially. If he can’t understand what he did wrong, you might need to rethink the relationship. Do you really want to get married and, potentially, have kids with someone who just makes decisions without any input from you?", "If you don't feel like doing something your SO/partner/whatever asks you, you say no. \"Hey I get that this is important and I'd like to help you with things, but this is too big and I'm not comfortable with doing it.\" \n\nYou don't say yes and then do whatever you want with another person's money. If you say no to them, then they take time off from work/just deal with it somehow. And if they don't respect your limits, then maybe you two aren't meant to be.", "Vets are not voracious. They offer testing for work up and owners can say no. But an exam only goes so far.", "Ugh why do I feel like I always have to fight the finances when I go to the vet? Def seems salesy with tests and shots.", "Absolutely. Fortunately, my son called me after a visit. His new vet was pushing for a teeth cleaning when the cat was way too young and didn't have any dental issues. \n\nI also saw this at a clinic that built a new facility and the prices soared. A new vet even wanted me to put my 15 year old dog into chemo for an extra 6 months. It would have been crazy expensive and cruel.", "You would expect an adult to be able to follow simple instructions, especially after OP specifically told them not to make any choices for them if something happens.\n\nOP’s specifically communicated to contact them if anything happens. In what world are they the asshole rather than the SO who can’t seem to follow even the most basic request?", "Interesting assumption.  Genders are not mentioned in this post at all.", "Yea but it's pretty common sense that unless it's an emergency, you don't make major decisions about health or Financials without consulting the person about it first. And OP literally said that.", "It's not hard to understand \"don't do anything extra\". It's also just common sense.\n\nThere's also a big difference between stepping away to take a five minute phone call with the vet and taking multiple hours or even a whole day off. (some places don't let you take half days)", "Still not their place. OP is paying so OP will make the decision, even if that’s coming from a good place. Ontop of that vets add on bullshit tests and things that “should” be done", "Well said.", "I routinely take my brother's cat to the vet because the nature of his work means he can't get to the vet when they are open. I never approve anything that would be expensive (most testing) without his approval. The only thing I approve is cheap stuff, like vaccines or meds", "Spending someone else's money without permission is a bit different than 'doing it wrong'.", "That totally depends on the vet. I've known great ones and predatory ones.", "Seriously, are you a vet??? And some dang vets demand the extras.", "I clearly mentioned the ones that have been bought out by corporations, such as VCA have gone predatory.\n\nAlso, some private ones, faced with rising rents and malpractice insurance are getting expensive.  I fear for the poor who just can't, thank God for the low income clinics that cater to them and their furry buds.", "Since our vet went VCA, prices are sky high.\n\nTried a private one, still expensive. Feel so sorry for poor people.", "Yes, and teeth leaning is lucrative, especially adding bloodwork.  My boy dog doesn't need it, he loves his chewies.", "Yes, that is interesting.  I assumed the OP was a woman, not a man, FWIW.", "Fair enough", ">There's also a big difference between stepping away to take a five minute phone call with the vet and taking multiple hours or even a whole day off. (some places don't let you take half days)\n\nOkay? But what I suggested that if she was reachable to ask about additional testing/treatment then she should have just made herself available for a 5-10 minute phone call to speak to the vet directly and make the decisions.\n\nThe problem here is that she did authorize *some* testing. And that can become confusing to the person who brought the pet depending on how the appointment goes as to what is okay and what isn't. It's actually much simpler to say \"run everything by me\" than to say \"you can do this and that and the other but for anything *else* you need to call me\". Especially when you're saying that before even knowing what the vet is going to recommend.", "Sure but the original comment was a blanket statement for veterinarians.", "Went to a vet to get 2 teeth pulled because they were absorbing or something. They gave me a quote for $800 and I asked for a breakdown. $500 was just for the anesthesia. I asked why it cost more anesthesia to put down a 7lb cat than it would to put my ass to sleep. Got a blank stare.\n\nI looked online and the average price was $200 for two teeth and about 1k to remove the entire mouth. Went to two other vets and the price was about $250, cat lived to 13 years.\n\nAlways shop around. If anyone tries to pressure you that's a sure sign you are getting screwed.", ">.  I assumed the OP was a woman, not a man, FWIW.\n\nAgreed, but that doesn't tell us the SO's gender.", "I mean, we don't know the specifics of the problem. We also don't know if OP was unavailable for phone calls. If SO tried to contact OP for discussion and OP wasn't available, that's a different story.", "Nope it wasn't.  I mostly talked about VCA for example Vets. Vets who have their practices purchased by a corporation. Corporations want their profits. I saw it clearly in my previous vet, one that was expensive, but now out of reach.", "That's why I *asked* if OP was reachable for phone calls.  \n\nAnd then I said that **IF** OP was reachable for phone calls, then I *asked* why they couldn't just make themselves available to talk to the vet.\n\nAt the end of the day, I am a vet and I'm really just speaking from the experience of seeing people send their pet to the vet with an SO or a child. More often than not, there is confusion.", "NAH\n\nYour SO did a kind thing taking your dog to the vet, and they tried to make the best decisions for their pet (having less understanding of what you wanted than you do -- it's hard to go to the vet and keep track of everything they are telling you, even when it's your pet!). You also didn't agree to all of these expenses. \n\nNext time, it's for the best for you to handle vet care if additional expenses would be upsetting to you.", "Partner is a dumbass, but you should have had the vet call you directly.", "If you are financially responsible for decisions. Make them for yourself and not by proxy.Let the vet or the mechanic know you want to be consulted and make time to be available or call into the appointment. Was your SO able to contact you; was their decisions made in good faith based on the information received ? Was the pet helped by the “extra” testing and the “shot”? Do you have enough expertise to decide what type of work is needed?", "This is how I picture it playing out.\n\nYou send SO to the vet. SO is at the vet. The vet says “we recommend this testing to figure out what’s going on as it could be a few things.” SO says okay because they’re testing to figure out what’s causing the concerning issue you sent your SO to the vet for. Now you’re mad it cost more than expected…are you a vet? Do you know exactly what tests need to be completed? Im assuming no. So YTA.", "YTA - if you send a SO with your pet to the vet, you are authorizing them to make decisions on your behalf. If you do not trust them to make those decisions you need to be available for the appointment- either on the phone or in person.", "YTA. If YOU are concerned about your pet YOU take the pet in to the vet.  Your SO likely had no idea what was going on and just said yes to everything.", "NTA, but this person has apparently shown you time and time again that they can’t be trusted. If you care about your pet enough to get them checked out, I don’t know why you left them up to this person’s decisions.", "NTA but why was it so difficult for the partner to understand not to do anything else that OP said they didn’t want done? How much details one need? …", "NTA and you need to make perfectly clear that if partner agrees to extra, partner *pays* for extra. Period.", "NTA It's not a simple understanding when they are agreeing to expensive tests for your pet. You mentioned also decisions with your car. If your SO always like this and you just notice when it's costly? Why does it not occur to them to call and check to get your ok?", "Set up your appointments when you are available. She’s messing up because she doesn’t want to do your chores", "Nta the fact that you know he does this shit, went over *in detail* and he still deviated from the plan tells me he either 1- doesn't care, 2- thinks he is smarter than you or 3- doesn't have the common sense to call you to confirm.\n\nIf you trust him with something similar in the future tell him, 'if you do things I didn't agree to during this conversation YOU will be paying for it'. Maybe once it starts impacting his wallet he will change his act.", "NTA. It sounds a bit like a cousin to weaponized incompetence, which is obtusely adhering to the LITERAL meaning of what you said instead of following the intent. It’s like asking him for shampoo and he brings home dog shampoo because “you just said shampoo.” It’s a bullshit way of getting back at you for DARING to ask him to do something.", "NTA. \n\nEven if your SO meant well, it's not ok for him to spend your money. In the future, can you call the place he'll be dealing with and request that someone call you to discuss estimates and what work you are willing to pay for?", "Yta in the sense that they’re trying, truly, but they probably dont know enough about the topic as you do. And if it’s that important, next time, find a way to do the appointment yourself, because your so cannot guess and isn’t you, and usually just wants the best for you.", "OP’s ~~bf~~ gf owes them for the extras ***he*** authorized for sure, bc ~~he~~ she didn’t have their permission to authorize anything other than what ~~she~~ wanted.\n\nI had to take my dog to the vet months ago but it was in that not so sweet spot in the month where I had $50 to my name and savings was gone bc of another emergency. My mom was willing to pay, but even I called her to make sure she’d be ok with the amount bc I’m not the one paying.\n\nNTA OP. ~~he~~ she owes you the difference. maybe being held responsible for once will stop ~~him~~ her from agreeing to things that you end up being responsible for without your permission.\n\nEdit: changed genders bc the OP specified genders in edit, not original post", "This is thankfully not her normal vet. Her primary vet was booked full and this was the only one that had an opening soon. Her normal vet would have charged half the price but this one was more partially because it was the weekend.", "No we haven't. Most of us are really good people who don't give a shit how much money you spend. Our priority is your pet. So bugger off with your insults.", "So veterinarians should work for free?", "Second opinions are always important and no vet should have a problem with that - incidentally, no DOCTOR should have a problem with that for expensive procedures. Speaking as the daughter of a surgeon and someone who has had many furbabies and vet visits.  But I do think for the most part, vets are honestly trying their best. You don't tend to become a vet unless you love animals and then you constantly deal with people who either rabidly love their animals and see them as family members and you have to tell them their loved one cat be saved... or you have to deal with people who want to put down a dog or cat for a minor inconvenience. It doesn't seem to be a very easy job at all. Are some vets in it for the money? Yes, everyone field has people who don't actually have any empathy and only want the money. But I think for the most parts, vets are trying to work within what is available to them and the costs that they're required to charge by various people over them or as you said, corporate. \n\nAlso, another real difficulty with animals is that...let's face it, tests costs A LOT for humans too, but we can clarify exactly what we feel is wrong and refuse tests we consider off the mark. But how do we determine that for a pet? We might have NOTICED some aspects are off, but that can sometimes have the root in something totally unexpected and it's not like the pet can tell us. So the tests need to be done and they need to be a wide range. And look, I just had the honor of paying 1000 in vet bills only to find out that my cat has a rare as hell cancer that every study has failed to even find out it responds to any sort of treatment, so the surgery we had done isn't even LIKELY to help him, because we thought it'd just be a normal skin cancer and we'd find out afterwards if it had been all safely removed... but that's not the results the vet got back. It's not his fault and he hated giving us the results because there's nothing we can do except wait and see and if my cat starts demonstrating being sick, then it may be a sign that it's moved inwards and...even then, it can't be stopped, we can only make his life comfortable at that point. Tests suck. Ironically, our vet said he wished he could have just... not told us the results because there is nothing to do. He's not going \"Let's do radiation\" or \"Let's try this medicine\" or even \"Let's run more tests\", though he gave us the option to being referred to the giant vet school an hour away that has a huge oncology department....but that's up to us and he warned us it'd be far more expensive there and that all the studies indicated they wouldn't be able to do anything either.  He could have sold us some snail oil and we'd have probably TRIED it, but he didn't. So not all vets are out to just take money from vulnerable pet lovers. It's important to remember most of them love animals and are just in the bad situation of, for some reason, not having a psychic connection with animals and being able to tell EXACTLY what tests are needed so they can keep costs down.", "I just ate the cost because at the end of the day it is my pet and I’m just thankful she was able to be seen. I wouldn’t have even cared about the price had I been given the chance to think it over and make the decision myself.\n\nBut the extra testing and shots were something I had planned to handle with her primary vet as this was a last minute vet to get her seen, and had nothing to do with what she was being seen for, so given the chance I would have said no to them.\n\nI’m not sure if it’s about control, it feels more like wanting to be helpful or just going with whatever the person at the vet told them because they don’t like to push back.", "This is only the second time something like this has happened. First time I didn’t set any ground rules or expectations, which is on me. This time I did and felt like I was very clear in them, but they were still gone around. I acknowledge I could have been even clearer about my expectations, but I truly felt like I was clear enough. I don’t feel like twice is enough to establish a pattern to avoid. I probably won’t be asking for help again though, even though I appreciated the help in general.", "We don't have time for that in a ten or fifteen minute appointment as half the time, the owner doesn't answer. Stop sending pets to the vet without clear written instructions or someone who doesn't have the authority over their care.", "The issue pet went to the vet for has a visual symptom which is an almost dead give away for what it was. I spoke to the vet tech when making the appointment and based on the info I gave them, they confirmed it sounded like what I was thinking. And it was. The extra tests and shot were part of a general annual exam that I had planned to take care of at my pets primary vet when I was able to schedule time off, this was something I wanted addressed sooner than I was able to get off which is why she went to a vet she doesn’t normally go to.", "It's not a fucking CHILD. Jesus. I love my frigging cat, but she's not equal to my son. Just stop with pretending pets are children and trying to make other people think of them as children.", "I wonder why you have decided the OP is female and the SO is male, given genders are not once mentioned in the post.", ">My mom was willing to pay, but even I called her to make sure she’d be ok with the amount bc I’m not the one paying.\n\nThis is a very different situation. And I think OP's SO genuinely thought they had agreed to testing that OP wanted. Vets are confusing and it's hard to make these kinds of decisions even when it's your own pet. If OP cared this much, OP should have taken their own pet to the vet. It's hard  to ask for a favor and then say \"you did this wrong\". If you want something done only one exact way, do it yourself.", "[deleted]", "I never feel taken advantage of by my vet. He’s very good about not recommending expensive things unless they’re truly necessary. I’m sure there’s some bad vets out there, but I agree that most are good and want what’s best for the pets they’re treating.", "Amazing. No-one said that.", "This is just an area that you can't trust your SO. If there are no other big issues, of them spending your money without checking, of course.  \n\nI know that if I ask my husband to run the dishwasher or a load of laundry, while I'm out, there's a 50-50 chance he will utterly forget. I get home, ask if he got it done and he'll rush off to do it.  \n\nSo, just know in this sort of situation, he will take care of it and then some!", "But you also sent them to a different vet the 2nd time. So, you may have been somewhat clearer in your expectations, but they were in a whole new place figuring things out FOR YOU again. You got to give people some leeway when they're doing you a favor.", "I’m a mom of 3 and I stand by what I said. We don’t get to dictate how someone else regards their pets. And my analogy suited the situation in question.", "I don’t know. I wasn’t honestly paying attention. I was just trying to get my thoughts out.", "Because sexism is a two way street, but we only look one way.", ">Leading up to the vet vist we talked about what I was concerned about, what was being done, what I had arranged the appointment for. *I reiterated these in a text* and *said please call me if they say anything else needs to be done other than x, y, and z so I can make the decision myself.*\n\nThey had a conversation **and** OP also put it in writing via text. OP says in a text to contact if anything else needs to be done.\n\nEither SO folds under pressure and thus cannot be counted on to take care of a vet visit, a car repair issue, etc., or SO just doesn’t care bc it’s not their money.", "In my edit I am referring to my cat as she.", "I wrote this before OP edited.", "Mine will advise against tests if feels not in best interests of pet or if it will not affect treatment. It is always the key question to remember if paying for medical treatment - will this affect the treatment plan? If not, the added knowledge is a nice to have.\n\nBut the added information can be absolutely necessary. People are saying she should have been phoned or made another appointment. Was she available to be phoned? Was she happy to wait until another appointment - if so, why not in first place? If you authorise someone to take your pet to vet, you are putting them in a difficult position if you want them to refuse treatment when animal is in distress. Can argue same with car if needed like brakes but postponing. Though solution would be to ask him to pay difference but then don't expect favours later.", "Sure. Just, if you regard your pet as equal to a child, that's on you. Don't expect everyone else to join you in that. \n\nThat being said, wouldn't you get the extras the Dr was recommending if it literally was your child? Or you thought your partner regarded the pet as a child? Right. So the partner's heart was probably in the right place, even if they're such an awful person for not following OP's instructions to the T when going to a new vet.", "Just seems a little suspect to me that you apparently default to one gender being right and one gender being wrong.", "Full mouth extraction generally run far higher than $1000 but that will vary by median income and location for a given clinic. When there is huge discrepancy in pricing between vets in a similar area, I would bet there is a true difference in the service being offered: pre-anesthetic bloodwork, anesthetic monitoring, dental radiography, etc. You have to decide if that is important to you for your own pet. \nAnesthesia for humans may seem cheap to you, but that’s because the bill is picked up by insurance. Without insurance, general anesthesia is thousands of dollars.", "Of course I would get the extras. However, I would never get the extras on someone else’s pet without asking the actual owner. It wasn’t the partner’s place to make those decisions. It was their place to call OP and ask if she wanted the extras done, especially since she was the one footing the bill.", "Geezum crow - stop over analyzing everything. It’s not that big of a deal. Let it go and, I don’t know, maybe respond to the original poster.", "You dint mention VCA at all. You literally just said VETS. As in all of us.", "You seem to be the one getting bent out of shape, I merely pointed out your apparent internal bias."]}