{"id": 13209, "submission_id": "122b9tz", "title": "AITA for telling my girlfriend that her mom's gift for me was weird?", "selftext": "My girlfriend had a dog for about 6 months before she met me.  I did not realize how poorly trained that was really was.  Long story short, her family obsesses and practically worships the ground this dog walks on. Christmas presents, daily FaceTime calls, and her brother has specifically asked multiple times to be the dogs \"God father\".\n\nHer mom started giving my GF framed photos of the dog that she has screenshotted while on FaceTime.  I didn't say anything at the time. But I did think it was weird.\n\nLast summer I ended up getting a cat, I'm more of a cat person than I am dog.  But for my birthday her mom ended up giving me half a dozen framed pictures of my cat.  I thanked her out a courtesy, and we left.\n\nLater that night my GF took all of the framed photos and hung them up on the wall and asked me what I thought. I was upfront telling her that it weirded me out, and why she even bothered.\n\nShe's now calling me an asshole and telling me I'm ungrateful for the gift her mom gave me.  AITA?", "created_utc": 1679805817, "permalink": "/r/AmItheAsshole/comments/122b9tz/aita_for_telling_my_girlfriend_that_her_moms_gift/", "score": 106, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Saying that the present she gave me was weirded me out, and being 2 faced about it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I’m going with NAH but you are a little bit of a jerk.  Your GF’s family are treating you as one of their own!  You may not get why they love their doggo so much but they think you love your cat they same way they love their dog.  It’s weird to you but they are doing their best to show you they care by turning those screenshots into pics.", "Kinda, but I'd go with NAH.  \n\n\nDifferent generations do different shit that looks weird to others. Just accept it and move on.", "I think it was an adorable gift and she's putting you at the same level as her daughter. She's calling you her son.", "A true cat person would never even question a gift like that and would be thrilled. My husband and I have framed pictures of our cats all over the house. 😹😻\n\nThat said,  YTA, who would it hurt to be grateful for the effort she put in? She obviously is the kind of person who treats animals like the family they are, she wanted to show she cared about you and yours.", "YTA. I’m not gonna lie, I agree that’s a super weird gift. But if you treat people like crap when they’re trying to be nice to you, they will either stop being nice or stop being in your life.", "YTA based on the rudeness and judgmental tone of OP's post. It's not weird for people to have photos of their pets even if it's not OP's taste. TBH entire post comes across as girlfriend and family are the type to dote on pets and view them as beloved family members and assume others do too and OP's the type who more or less just let's an animal hang around and occasionally acknowledges it.", "NTA. Its your cat and your place, if you dont want pictures of your cat on the wall why should you have to have it there? Although I don’t really see a problem having a picture or two framed of your pets, I think it’s just a bit unreasonable of her to assume you wanted it in the first place. Then again, I’m sure with how she treats her dog (how you put it at least), her hearing your stance on putting up pictures of your cat probably got to her a little bit.", "i’m gonna go with nta.\n\npersonally i dont get why it’s weird, i have so many pictures of my dogs and have considered framing some. but you weren’t an ah about it in the slightest and it’s just ur opinion anyway", "ESH \nYou could have used a nicer tone with your gf, sounds like. Maybe explaining that it wasn't your style. \nThe gift is hella weird tho so I would have also had a negative reaction.", "NTA, it’s okay to not be crazy about a gift even if it’s given with the best of intentions. Maybe get some kind of photo album to put the pics in instead of having them framed? that way you still have the gift, but you don’t have a wall shrine to your cat.", "NTA you don't say you were ungrateful you said you thought it was kinda weird. she also asked you what you thought & you just told her the truth.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy girlfriend had a dog for about 6 months before she met me.  I did not realize how poorly trained that was really was.  Long story short, he family obsesses and practically worships the ground this dog walks on. Christmas presents, daily FaceTime calls, and her brother has specifically asked multiple times to be the dogs \"God father\".\n\nHer mom started giving my GF framed photos of the dog that she has screenshotted while on FaceTime.  I didn't say anything at the time. But I did think it was weird.\n\nLast summer I ended up getting a cat, I'm more of a cat person than I am dog.  But for my birthday her mom ended up giving me half a dozen framed pictures of my cat.  I thanked her out a courtesy, and we left.\n\nLater that night my GF took all of the framed photos and hung them up on the wall and asked me what I thought. I was upfront telling her that it weirded me out, and why she even bothered.\n\nShe's now calling me an asshole and telling me I'm ungrateful for the gift her mom gave me.  AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA!\nWalls filled with animal photos are weird to me too. I am also very minimalist. I don’t put much on my walls. I have one framed picture of my family and that is it.", "ESH - I have a oil canvas of my dog dressed as a Frenchman lmao", "NAH \n\nits weird. Nobody is an asshole though.", "Nta I mean 12 frames photos is weird.. if it was one that be normal but 12 is kinda obsessive", "YTA. They love their dog a lot, so naturally they’re going to assume you love your cat the same. They genuinely thought you would really love some pictures of your pet, just as they would. They gave you a gift that clearly had a lot of thought put into it and they thought you would like it. You don’t have to love your pet at the same level as them or even like the gift, but not appreciating the thought put into it and calling it weird is extremely rude.", "Yeah I agree with all these points. You might not like the decor option of having loads of pet pictures up on the wall but the point is these gifts are a way of bonding with family", "But does he really have to put them up in his house? And stare at every day? It makes him a jerk to want to decorate his house how he wants too?", "Guess I should have clarified a bit more. I'm talking a wall. With over a dozen framed photos of only the cat and dog.  There are more pictures of the animals on that one wall than there are of us in the whole house", "What's the opposite of ESH? I think everybody had good intentions; they just didn't execute it well\n\n• The mom, was trying to be nice, giving a gift that maybe she didn't think so much about what the other person would like as much as she thought about what SHE would like\n\n• The girlfriend, who apparently DID like the gifts, was honoring her mother by putting the pictures in a place of honor in the home\n\n• The boyfriend, was weirded out by it all and spoke his mind. We don't know that he was using a harsh tone about it. You could say that you're weirded out in a nice way. Probably better words could have been used, but still\n\nI just don't think anybody here sucks, because they all had good intentions", "He can always take the pics down tomorrow :)", "No, the way he said it and that he called it weird made him a jerk. What would it have hurt for him to say that he appreciates the thought from both of them (gf and gf mom) but he's not a fan of all the photos on the wall? There are ways to say you don't like something without being rude and/or calling a person's thoughtful gift weird.", "Ehh that's personal preference. I don't have any pictures of myself in my house, but I do have some of my pets.", "The opposite is NAH = no assholes here!", "Except he asked why she even bothered, which is harsh and the answer is obvious and nice. So because of that, YTA", "I’m stuck with this one. You didn’t offend the family, just the girlfriend. I want to say NTA because everyone is entitled to their opinion on gifts. But also this family CLEARLY has a culture around pets and treating pets with high regard. \n\nIm going to say this is a learning experience on your part. You can be entitled to not enjoy the gifts you ge; however, these gifts mean more to this family. To this family these gifts could almost be the equivalent of a grandmother giving her son in law photos of their grandchildren. You’re allowed to not understand their point of view, but you would be the AH if you actively disrespect it.", "Nta. They gave you a gift based on their preferences,not yours. Your gf then made a choice about decorating your house without your consent. \n\nI mean people feel differently about pets and it's strange to assume that if you have a pet and someone else has a pet then they want what you want. \n\nPeople will call you A H here because they don't like that you find behaviour they also engage in weird.", "i love my cats more than anything. my house has a zillion photos of them. i think what the mom did was sweet.\n\nthe problem i have is with your GF. i would never take it upon myself to hang a bunch of pictures on someone's wall (especially since i assume this meant she was hammering nails into your wall) without asking them first. that's rude.\n\nNTA.", "NTA. You were talking candidly with your partner, you didn’t tell her mom it was weird.", "I think its a weird gift. But that doesnt matter. OP wasnt rude and didnt even tell MIL. Ops SO asked for an opinion and OP gave it. This is some kind of gift I just would \"accept\" but not encourage any further.", "I love my cats but I don't care for cat decor. I agree this lady was trying to do something nice but it's a slippery slope to let someone think you love a gift you actually hate, because you'll get more of the same for the rest of your life.", "100%. If OP is uncomfortable with it there's nothing wrong with saying it. Where's the \"communication\" otherwise? it's crazy", "Like, if I wanna look at myself, we have mirrors. But this cat and/or dog whom I love and adore? Love to see him, even if he doesn’t want to be seen!", "It's weird af. Humans are so cringe. Framed images of animals is just another aspect of people's obsession with their pets, treating them like humans. It would be funny if it wasn't so pathetic and embarrassing.\n\nNTA. Your GF knows how weird it is, too. That's why she's put her anger on you. Doesn't want to face the cringe.", "NTA... I'm not gonna say anything else they seem like nice people", "YTA. You may think it’s weird now, but trust me, one day when that cat is gone, THEN you’ll appreciate this gift.", "*PHOTOS* sure.\n\n*Facetime screenshots* nooooo.  Sounds terrible. Just fuck everyone's birthday up this year with elaborate, low quality scrapbooks and rave about how many hours and how much love you put into it. Don't like it? Call the recipient ungrateful and hurtful and selfish! :D\n\nOP is NTA", "If you get someone a gift that you like but they don't, that sucks. \n\nIf you hang up pictures for someone else, without really involving them in the process, that also sucks.  \n\nThere are different cultures of gift giving but I find these two behaviors to be non communicative. The mother could have asked what kind of gifts op likes or observed things he likes. The girlfriend could have simply asked \"would you like these to be hung up in the house?\" \n\nDoing something for someone that they don't want is not a gift, it can be kind of controlling.\n\nI stand by ESH", "NTA.  But I’m with you, her family is weird.", "NAH you weren’t rude didn’t say anything rude and did nothing wrong you just find the obsession with pets a bit weird I mean I’m a huge pet person just chilling with them is a an amazing comfort but even I only take a picture or 2 and none of my family go out of there way to take pictures and frame my pets.", "People who see animals as equal to humans and worship them acting like they’re children need help.. like I’m sorry but can we go back to them being what they are, animals, pets. NTA sure I’d love to have a nice picture or two of my cat but someone obsessing and hanging up probably more pictures of a dog than they have of their family members and children is just .. tf?😵‍💫 a cat or a dog is not your child. You don’t see people owning other animals like rodents or reptiles acting like this, it’s just weird.", "NTA", "NTA, getting a gift like this puts an obligation on you to hang them up in case your GFS parents pop round and expect to see them. It's down to you to decorate as you see fit. \nLittle concerned you got a cat after admitting the dog is not properly looked after, maybe you should have spent the time on the dog first.", "Soft YTA\n\nI do agree it is a weird gift, but it was thoughtful of them and they are treating you as one of their own, you should appreciate that.", "YTA /:", "Yeah and tbh I'd love framed photos of my pet", "I'm a cat person and would question this. It's random and weird. Just because you like it doesn't mean everyone has to and it doesn't make him an asshole.", "The cat handles her own.  The dog isn't allowed to be unsupervised.  Found out the hardware when we tried letting her have free reign of an empty room in the basement and she tore the carpet up corner to corner", "My dog is fine with furniture and carpets, Pretty sure she would tear up a cat though. \nIt's worth getting help with the dogs behaviour, you would have a much better relationship with it if you fixed it's issues."]}