{"id": 13221, "submission_id": "122f0hi", "title": "AITA for being offended by my sister asking me to cover up my full body tattoos for her wedding ceremony?", "selftext": "So my youngest sister of us 3 sisters is getting married and asked our middle sister and I to stand up in her wedding.  Of course I said yes and I was actually excited when she asked me to help pick out bridesmaid dresses for my middle sister and I. \n\nThe wedding is in the summer in Texas so I know it's going to be HOT so when I was helping look for dresses I was looking for something that won't be too warm and that comes in both plus size for me and regular size for middle sis. I sent a few options and found one I really liked.\n\nEven bride sister agreed it was a really cute dress but then she brought up the fact that it would show off my tattoos. Up until this point I didn't even occur to me that my tattoos would be an issue, so for her to casually bring up the fact that she expects me to cover them all... I found it a bit insulting. Not to mention impractical as I would have to wear long sleeves and a high neckline to cover them all in 100 degree weather.\n\nAt first I pretended I wasn't hurt but then she said that she \"didn't want my tattoos to be the focal point of her wedding photos.\" I was extremely insulted at this point and blew up at her. I didn't mean to get so upset but I was very hurt by the way she brought it up and the way she worded it, like my tattoos would ruin her photos and that I didn't fit into the esthetic of her wedding. \n\nI feel she had no tact and could have approached the situation in several other ways that wouldn't have come off so rude. I don't want to use the word bridezilla but I think the way she brought up the topic in really poor taste. Now we are not speaking to each other and my mother is very upset that we are in a fight.", "created_utc": 1679817330, "permalink": "/r/AmItheAsshole/comments/122f0hi/aita_for_being_offended_by_my_sister_asking_me_to/", "score": 107, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got into an argument with my sister because she implied my tattoos would ruin her wedding photos\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA I can see why you took her expectation to cover up as a rejection of you. Because, on some level, it is. Her acceptance of you is conditional. Her mental picture of her ideal wedding includes a \"sanitized\" version of you.", "I would like to add that I apologized for getting upset with her and explained the way she brought it up was really a shock to me and I wasn't expecting to have to fully cover myself. She \"apologized\" by saying she was sorry that I got offended by and that she shouldn't have to \"sugar coat\" things when speaking to family.", "NTA. Because you apologized and I understand why you were upset. I know this sub is very big on “it’s the bride’s day” and that’s true, but a wedding day (which in hindsight is never as big a deal as it seems at the time) shouldn’t drive a wedge between family members over petty issues. I have precisely one photo of our wedding party on display. Many people I know only have photos of the bridal couple framed and displayed. The rest of the photos are in an album collecting dust or on social media (and nobody besides the bride looks at those more than once). Don’t most people who will be at the wedding know what you look like already? Has nobody who is familiar with your sister seen a tattooed person before? Who does she think will be so focused on your tattoos that they don’t notice the bride in the wedding pictures?", "I don't think she approached this badly, unless she used wording not mentioned here. How I see it, is that she casually mentioned how she would prefer the tats being covered up, which I do not think is completely unreasonable considering she didn't demand it. I also see why you may got hurt about it, since I guess they stand for who you are. \n\nNAH, have an honest conversation about this and find a middle ground.", "NTA. She asks you to be a main part in her wedding but wants you to be miserable the whole time? I get that it’s her wedding, but you can’t just expect people to experience discomfort to fit an “aesthetic.” Bridezilla is the right word.", "NTA. I’m from Louisiana and I know how ridiculously hot it gets down here. Pretty sure passing out from heatstroke would **really** make you the focal point. Why would she ask you to be a big part of her wedding if she wants you to hide who you are?", "NTA, but neither is your sister. You chose to get full body tattoos. You should have known when you made that decision that they would not be acceptable in certain situations. So you either forgo those activities or cover them with concealer or clothing. You know your tattoos attract attention, people probably stop on the street to look at them. Its not just about photoshopping them out of pictures. You are going to standing up in front of everyone next to your sister at her wedding. You will be distracting and taking attention from your sister on her wedding day, during the ceremony. It may not be deliberate but it will happen. Everyone will be looking at the tattooed lady instead of the bride.\n\nYou be you, if tattoos make you happy, have at it. But everything you do has consequences. One of the consequences of covering you body with ink is that not everyone will want them on display all the time. Its your sister's day, find a way to not steal the limelight.", "I live in south Texas so I feel ya on the weather. The thing is she needs to decide if she wants you there or not. Your tattoos are part of you and if she doesn't want them as a focal point in photos she needs to accept you can't be in them. It's unfair to want a censored version of you in her photos. All or nothing, NTA . As for your mom if yall work it out she'll be OK.", "So let me get this straight. Your sister, the bride, wants to be the center of attention on her own wedding, correct?\n\nI wouldn't even think of calling her a bridezilla for that!\n\nTattoos are cool in my opinion but if you are more or less a walking and talking piece of art (even if it's a masterwork) you will attract attention and be honest, you know that already. I am quite sure you are already getting attention for the tattoos on regular days. Therefore you would grab the attention from the bride on her own wedding, even by accident.\n\nYou aren't the ahole for feeling hurt but please see how this impacts this special day of your sister.\n\n&#x200B;\n\nI go with NAH", "Nope not the a$$.... your sister knows who and what you are and how you looked before she asked you.. she should have taken that into though before hand, if it didn't fit her picture... tats are not the scarlet letter they used to be in times gone by. She either needs to get over it or risk harming her relationship with you... stand your ground because you have done nonthing wrong", "NTA. \n\nShe should have privately addressed this when she asked you to be a bridesmaid in the first place. It shouldn’t have been an after the fact “casual” mention. Asking someone to cover parts of themselves for aesthetic is gross and rude.\n\nETA: if you back out now, now she has all the power to make you the villain and that’s shitty. What she did was manipulative.", "Does the bride-to-be know that in these modern times, technology allows the removal of tattoos, zits, bugs, even whole people from photographs? Her wedding album will be fine. NTA.", "You blew up at her, and she’s the AH? No. Being completely honest, I wouldn’t care if anyone in my wedding was heavily tattooed. I wouldn’t think it detracted from my wedding at all. That said, your sister does. Could you not cover your tattoos with makeup? I’m going to say ESH.", "Hi. Born and raised in Texas so I can appreciate the heat issue. You can both “win” this argument. But first, YTA. It’s her wedding. Her voice. Her day. None of this is or should be about you. You’re making this about you. \n\nI’ve had to use makeup to cover things. Dermablend is an amazing product that can be used and it will hold all day and night if applied correctly. Get the dress and cover up the tats. None of this is difficult. Apologize to your sister.", "NTA.\n\nWhen she asked you to be a bridesmaid she knew you had visible tattoos.\n\nShe knew they would be shown. If she was going to have an issue with your tattoo showing she never should have asked you to be a bridesmaid.\n\nPersonally I don't think it's right asking any person to change their hair color or cover up their tattoos for a wedding.", "YTA - it’s her wedding. You don’t have to go. You seem overly sensitive to the topic, she didn’t say anything insulting. \n\nTo “blow up at someone” is inappropriate. You also have no tact and could have approached the situation on other ways.", "She brought it up casually, and you blew up, and she's the one with no tact?\n\nI suspect a general rule of thumb is the person who is blowing up at people, who are bringing up things in a casual way is usually YTA.", ">I feel she had no tact and could have approached the situation in several other ways that wouldn't have come off so rude.\n\nUnless you can provide \"several other ways\" that sound reasonable, YTA. Her wedding isn't about you, and blowing up over her not feeling the same way about your tats as you do sounds pretty uncalled for.", "NTA but neither is she. I have very prominent tattoos and I wouldn’t expect to let them be visible in an occasion like that. When we do things like colored hair, piercings, tattoos etc, it’s always going to draw a lot of attention. It’s not appropriate for a formal setting like a wedding.", "NTA. Tattoos aren’t going to take away from her day. Nothing is. \n\nI understand it’s not done. But can I ask- can you cover up with make up for the day? I’m sorry I know it’s wrong to even suggest it. I’m just looking to see if this has been considered", "NTA Tell your sister you're not covering up your tattoos. Tell her you don't have to be in the photos if she's so worried about it. If that's not enough for this bridezilla tell you're not being in the wedding but coming as just a guest as you are.", "Tell her to get a more noticeable face if tattoos can obliterate in in a picture, lol.\n\nSorry, I'm just being petty. I fully do not comprehend being told what to wear beyond a dress code. NTA", "[removed]", "ESH. Bride never should have asked for your help in picking out bridesmaid dresses.  She should have just chosen long sleeve high neckline dresses and said \"this is the uniform.\"  She shouldn't say \"Uniform specifically chosen so that my wedding pictures don't feature your trashy tattoos.\"  She should have just tactfully said \"these are the bridesmaid dresses, please wear it.\"\n\nHowever, it's her wedding, you should defer to her wishes on what bridesmaids wear and not demand to wear a bridesmaid dress that shows off your tattoos.   Or, alternatively, if you can't stomach wearing the bridesmaid dress she chooses, just bow out of being a bridesmaid.", "Nope, it's bridezilla allright. NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my youngest sister of us 3 sisters is getting married and asked our middle sister and I to stand up in her wedding.  Of course I said yes and I was actually excited when she asked me to help pick out bridesmaid dresses for my middle sister and I. \n\nThe wedding is in the summer in Texas so I know it's going to be HOT so when I was helping look for dresses I was looking for something that won't be too warm and that comes in both plus size for me and regular size for middle sis. I sent a few options and found one I really liked.\n\nEven bride sister agreed it was a really cute dress but then she brought up the fact that it would show off my tattoos. Up until this point I didn't even occur to me that my tattoos would be an issue, so for her to casually bring up the fact that she expects me to cover them all... I found it a bit insulting. Not to mention impractical as I would have to wear long sleeves and a high neckline to cover them all in 100 degree weather.\n\nAt first I pretended I wasn't hurt but then she said that she \"didn't want my tattoos to be the focal point of her wedding photos.\" I was extremely insulted at this point and blew up at her. I didn't mean to get so upset but I was very hurt by the way she brought it up and the way she worded it, like my tattoos would ruin her photos and that I didn't fit into the esthetic of her wedding. \n\nI feel she had no tact and could have approached the situation in several other ways that wouldn't have come off so rude. I don't want to use the word bridezilla but I think the way she brought up the topic in really poor taste. Now we are not speaking to each other and my mother is very upset that we are in a fight.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "It's absurd to say you didn't know tattoos would be an issue. Ink is always an issue, no matter how many people bear art on their skin.\n\nOn the other hand, you cannot take a chance with heat stroke; it is more serious than you might think. Even a very light shawl might be dangerous in the weather you're dealing with.\n\nIt sounds as though the situation has now been resolved, but no one's really happy. Perhaps the bride should have thought about all this before asking you to pick out the dress. But I don't see an AH in this. It was just one of those things.", "NTA\nAs long as your tattoos are not vulgar or sexual, there is no good reason to demand you cover them.", "YTA", "Sister is TAH. If she felt this way, she should have never asked you to be in the wedding party in the first place. She can't have it both ways.", "NTA  get your self a Chador, this way your tattoos wont be a problem and they will  not stand out  and you can hide fan underneath so you dont boil!  See if she likes that.", "I'm really starting to hate when engaged people act like getting married gives you a pass to pretend the humans they're surrounded by are just dolls to dress and manipulate.\n\nYou are NTA. You're a living human who doesn't want to cook in an inappropriate dress to soothe her need for the \"esthetic\" she has in mind. If you're tattoos are such a big deal to her, you can either step down as bridesmaid or ask her for a better suggestion than risking heat exhaustion for a few pictures.", "She sounds like a Bridezilla. \"Wedding aesthetic\" as connected to the personal appearance of the bridal party is BS. Does she also expect people to dye their hair certain colors or maintain lengths approved by her? Your tattoos are part of you so either she wants you in her wedding or a doll with a similar appearance.", "The person she replaced me with has tattoos and she said that \"SHE didn't have a problem coving them.\" I explained I wasn't taking issue with coving them but how she brought the topic up. Why ask me to help pick out the dress and then be like no, wear this one, it will cover your tattoos?", "I would have had no problem if she had just told me what dress to wear but she asked me to be a part of dress picking process and didn't bring up the fact that I was expected to be fully covered until after I started sending suggestions.", "Sorry but I really do not think that someone having tattoos will take away that much attention from the *bride*. She's the bride so ofc the attention will be on her!", "I send this. I fell like nowadays every time a bride asks for smth, there appears someone to call her bridezilla. Like, this is not the case dud, you really are very attention grabby with a full body tattoo and she just wants it to be about her, not you.\n\nYTA for blowing up during a casual convo", "She already kicked me out of the wedding party and picked a replacement.", "Can even faceswap some of the guest for celebs!", "Covering one or two tattoos with makeup is already challenging, but can be done. But full body tattoos? Not so much. Unless she wants the dress to be more makeup than fabric by the end of the ceremony.", "Removing someone else’s bodily autonomy for aesthetic is inappropriate.", "She could have asked politely in the first place. Or told me what dress she wanted me to wear instead of asking me to be a part of the decision making process. Or just not asked me to be in her party if I didn't fit her esthetic.", "I didn't demand to wear anything. I just tried to explain to her why what she said and the way she said it upset me.", "She just replaced you? Didn’t even try to talk it through? I’m sorry. That sucks. She’ll probably look back on this in a few years and realize how silly it was. I hope you can mend whatever damage may have been done to your relationship.", "What about a very lightweight shawl? I have a very large piece on my forearm AND my shoulder, so I tend to wear a lightweight scarf to cover it in formal settings. I live in Miami and it’s always tank top weather lol", "You can cover tattoos with [makeup](https://www.amazon.com/Dermablend-Makeup-Foundation-Light-Beige/dp/B06XNQQNLF/ref=sr_1_2_sspa?crid=340MV2BREWKSW&keywords=body+makeup+waterproof+no+transfer&qid=1679821193&sprefix=body+makeup%2Caps%2C152&sr=8-2-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyQjY2T1c4WDBUVzNYJmVuY3J5cHRlZElkPUEwODAzMzU2UU5MMTQ3WVVWR05VJmVuY3J5cHRlZEFkSWQ9QTA5MTk1NTBCWlYyMVQ1WlhVTTUmd2lkZ2V0TmFtZT1zcF9hdGYmYWN0aW9uPWNsaWNrUmVkaXJlY3QmZG9Ob3RMb2dDbGljaz10cnVl).  They make body makeup for that purpose.  I've never used it so I don't know how well it works.", "It's her wedding. She's one half of the entire reason people will be attending. The only way it could possibly be any more about her than it already is, is if she was also the groom.\n\nShe may have the right to decide if she's okay with visible tattoos in the wedding photos or not, but the only thing that means is that she gets to pick her wedding party accordingly. Asking someone to participate and then telling them you don't like THEIR SKIN is not a casual convo. It's rude and a little insane. Expecting others to make themselves smaller so that you can feel bigger is some toxic bullshit. Even if it's \"your day\".\n\nOP, NTA.", "I’m really sorry that’s happened to you. Truly. Those were unkind and unsisterly actions.", "Umm… there’s missing reasons here. \n\nYou blew up at her. You overreacted. What did you actually say to your sister?", "Never said that. Reach further next time.", "And what would be a polite way to ask that wouldn't have offended you?", "But she did. It's you who blowing it out of proportion. \nLike what was the way to ask you? You mention it in several comments but never give an example", "OK fair enough. I shouldn't have said you demanded it. \n\nBrides have preferences for things. She doesn't want your tattoos upstaging her photos. You might disagree with her, you might be offended she doesn't want your tattoos in her photos, but I think you should defer to her wishes here.\n\nThis isn't the same as, for example, a bride telling a burn victim \"I want you to wear a bag on your head to cover up your ugly face.\"\n\nYou chose to get tattoos, you have to accept that not everyone likes them.", "I have tattoos as well, and I’m aware that sometimes they don’t fit the occasion so I would also cover them up. It’s a risk we take when we cover our bodies in tats.", "Not very well, especially in hot weather. It would not maintain coverage, so there’d be definite show-through, especially around where anything rubs agains skin, like jewelry or shoulder straps or the edges of armholes.And it would ruin the dress—kiss any resale value goodbye.", "I told her if it was such a huge issue that maybe she should pick someone more aesthetically pleasing. By the time I apologized the next day she had already picked a replacement.", "She literally could have just said \"do you mind covering your tattoos? Instead she was like \"but that dress will show off your tattoos lol\" and I was like \"you don't like my tattoos?\" And she was like \"I don't want them to be the main attraction in my wedding photos.\"  That was it. That was the extent of her \"asking\" me to cover them.", "I just did.", "No but it's pretty similar to saying I have to change my hair color for the wedding. She also has a tattoo of her own.", "So you told her to pick someone else and she did? And you’re mad she did?\n\nYTA again. You sound manipulative. Congrats on getting Reddit sympathy points.", "It’s a moot point now. You’re not part of the bridal party now", "I don't see it, where's the exact text?\n\n>She could have asked politely in the first place.\n\nWhat is your definition of politeness? Coz I've seen people ask you about it several times in the comment section, but no definite answer.\n\nHonestly, I bet if she chose a long sleeve dress you'd get mad coz it's scorching hot and if she got your sis in the bridal party and not you this post would be about you being excluded for (fill any reason). Stop acting petty and be happy for your sis... Wedding is a big day!", ">No but it's pretty similar to saying I have to change my hair color for the wedding.\n\nNot similar, because changing hair color costs money and then generally you'd have to wear that new hair color for months or pay to change it back.\n\nHer asking you and the other bridesmaids to wear long sleeves or a high collar for a few hours isn't the same.", "I never said I was mad she picked someone else. I said I apologized and her apology wasn't really an apology.", "Thanks sherlock", "She didn't ask at all, that's the point.", "If I have to get heat stroke to stand in the wedding or pay for tons of makeup to cover up. Yes it is similar. Good makeup is expensive.", "At the end of the day, it’s her wedding. You’re no longer in the bridal party. \n\nYou blew up at your sister over this issue when YOU could have handled it differently. YTA.", "You still evade the answer, I see \nMy judgement stays, YTA", "Forget the makeup idea. \n\nYou're a bridesmaid. Ask the bride what she wants you to wear, and wear it.  Or don't be a bridesmaid. This isn't that complicated.", "I never evaded your answer, you clearly just missed it.", "NTA unless your tattoos are graphic or offensive. You aren't a prop for wedding photos.", "NTA.  The tattoos are part of who you are.  If she is more worried about how her photos look than her relationship with her sister, she is, by far, the AH.", "ESH\n\nWhat we have here is a failure to communicate.  When she asked you to be a bridesmaid, she should have asked you *at that moment* if you'd mind covering up your tattoos.  If you said no, then she'd know to pick someone else if that kind of thing was important to her (and it clearly is).  \n\nHowever, you wildly over-reacted.  You said yourself that you wouldn't have minded wearing a different dress or otherwise covering up your tattoos had she just been more tactful.  So because she was a bit... indiscreet, you blow up and get yourself kicked out of the wedding?", "NTA.\n\nYour sister isn't necessarily a bridezilla for not wanting visible tattoos in her wedding photos, but she should have made that clear when she asked you, **a heavily tattooed person**, to be in the bridal party. That way, you could have made an informed decision and planned accordingly if you agreed to it. \n\nIt's weird that she seemed to just *assume* you'd know to cover up your tattoos, unless she's been vocally anti-tattoo in the past. It'd be like if I asked my friend who's been dyeing her hair unnatural colours for her entire adult life to be my bridesmaid, only to tell her months later that \"by the way, I'll need you to wear a wig or go back to your brown hair.\" \n\nMaybe your reaction was a bit extreme, but you're in the right to be upset about the situation.", "INFO:  Is this to be an outdoor wedding?  In the middle of summer in TEXAS?  Or is this to be an indoor wedding?  In a nice venue?", "NTA\n\nShe asked you to be part of her special day. That should come without conditions.", "NTA. \n\nIf she expected you to cover your tattoos that should have been discussed when she asked you to be a bridesmaid. \n\nBtw, depending on your tattoos, unless they are doves with wedding bands, they won’t match MOST wedding esthetics. That part of your post is just….. ignorant lol", "NAH - it's not uncommon for brides to want to the wedding party to hide avoid tattoos. They obviously mean a lot to you and your aesthetic and you are insulted. Consider this: they don't mean the same to her- they represent a rejection of her aesthetic. It seems from your lack of arguing this aspect of the story that you either have striking tattoos or many of them. Additionally, you seem to agree you would not fit the aesthetic of her wedding. \n\nIf she used the words you quoted, I don't think that quote above was unreasonable. Obviously she wouldn't want your tattoos to be the focal point of her wedding day? They don't have special meaning to her - they are simply jarring and a distractor. \n\nNow, you may well feel that she should respect you enough as family, as a friend to not ask you to cover up. And YWNBTA if you chose not to go in response. I guess what you should reflect on is - it's neither uncommon nor totally unreasonable to be asked to cover tattoos politely, especially if they're striking and they're going to end up front and centre in someone else's photos for a very long time. You've acknowledged clearly that you and your sister have very different aesthetics. She's not going to choose the same as you for herself or for an event she's styling. \n\nSo is the issue that you see your tattoos as an extension of yourself and you feel she's rejecting you? Is that worth further thought? And what matters more - you needing to show your tattoos? Or you trying to find a way to honour her planning?", "NTA I cannot understand asking someone with tattoos, or piercings, or bright pink hair, or scars, or psoriasis, or whatever it is, to be a bridesmaid then ask them to change everything about themselves for the photographs. Surely they can see what the person looks like in real life. To ask them not to be themselves and pretend to be someone else, to me, is just rude. If they don't like it, they should not offer the position.", "I’m sorry you got offended is a bullshit apology that’s meant to appease someone without actually apologising. \nShe knows you have tattoos and still okayed a dress that shows them. Is she really so insecure that she thinks your tats will overshadow her as the bride?\nNTA", "She apologized that you got offended. She didn’t apologize for being offensive. Big difference. She’s putting the blame on you in her apology. NTA.", "That’s not an apology.\nNTA.", "But it's okay if OP thinks her tattoos are more important than her relationship with her sister?  More important than standing up with her sister on her wedding day?  It goes both ways.", "Sounds like you want to vote N A H, for No Assholes Here.", "I realized I had over reacted and I apologized for my reaction the very next day and explained what had upset me. She has already picked a replacement and I will be attending the wedding as a guest. She did not communicate to me that my tattoos would be an issue until I started sending her dress suggestions per her request and she was the one who insisted on me helping pick out a \"comfortable\" dress.", "She already picked someone else to stand up for her and no longer wants me to be in the wedding party I am still attending as a guest though.", "Then it wouldn't have been an issue. Thanks for proving my point.", "The ceremony and photos are to be outside. Reception will be inside with AC.", "All she had to do was ask. If she had made it clear that she didn't want my tattoos to be a distraction when she asked me I would have not gotten upset. The way she brought it up is what I was upset about. Did I overreact? Yes and I admitted that and apologized to her. She still chose to replace me instead of talking it out.", "Exactly. I've said it before on other posts, but if her \"aesthetic\" is so important, she should hire models with the desired appearance.", "Man, she moved on quick.  I wonder if she didn't actually want you as a bridesmaid and this was just a pretext so she could easily get rid of you.  Do you get along normally?", "*asked me to stand up in her wedding", "It takes forever to look good.  It’s like 3 hours in the chair and constant touch ups.  I’m always impressed with what HMU can do with this, but I imagine it would take a non-pro even longer to get the coverage and color match.", "We are both hard headed and she tends to be callous.", "Wow that was fast. When my sister and I had a disagreement I gave her a week to cool down then contacted her. She double downed on not being a bridesmaid so I waited another week before checking in again and then I asked someone else.", "So it's an outdoor wedding?  In Texas?  Why?", "I was insulted and reacted badly, I admitted my fault and apologized the very next day. How should I have handled it better? Not reacted? Yes, in a perfect world. I am only human. We both said very hurtful things to each other. At least I apologized.", "She asked me to help pick out the dresses and I was insulted by her comments. I never had an issue with just wearing what she wanted me to wear. Had she just asked me to cover them or had just picked out the dress we would not have gotten into the argument.", "Out of interest, I see in comments you’re saying it’s the way she bought it up that upset you. How could she have bought it up without upsetting you? Not saying she’s in the right here, although I can see her point, but just wondering how else she could have approached it", "YTA it's her wedding and I saw a tattooed bridesmaid on photos with the bride, it is definitely distracting. It also plays into role, what your tattoos are? Flowers and butterfly's might me okay, but if you have monsters or Robots or celebrities? I wouldn't want that either.", "NTA just tell her you don’t ‘have’ to be in any of her photos if it offends her that much.", "YTA. Massively. Those of us covered in tattoos understand that not every situation or occasion is going to be appropriate to expose our tattoos. You overreactive massively. The way she brought it up I don't see being offensive at all between sisters? Not only that but you threw a goddamn tantrum and told her that since she didn't like your tattoos and maybe she she just find someone else more aesthetically pleasing. Which you conveniently left out of your post and out of all of your responses telling people that she removed you from the wedding party lol. Yep. You threw tantrum during what should have been a sweet sort of bonding thing with her bridesmaids and told her to pick someone else. And when she did the next day you did the internet equivalent of a shocked Pikachu face that she immediately found someone who could be more reliable and then came on Reddit and left out various details so that you get some sympathy points. Come on man. Tattoo covering makeup or a light shawl or choosing a different dress wouldn't have been a big ass deal. She was worried that the photos would focus on your tattoos and then you made the dress shopping experience all about your tattoos it cost a huge situation over what could have been nothing. And now you're on here pretending like she just kicked you out and she's being a bridezilla when you're the one who caused a huge fight by having a tantrum and telling her that she should find someone else?", "So she didn't apologize then", "lmao I would not be attending the wedding. People who are rude write kindness off as sugary when it's literally just basic decency and I couldn't vibe with it. Have fun sweating your balls off I'll be air conditioned and tattoos out!", "I mean it sounds like she’s still reeling from your abrupt reaction to what isn’t an outlandish request or assumption for her to make…..", "See that’s just it. I don’t think sister actually wants to cover who OP is. \n\nI have a friend who is covered in tattoos with a really beautiful and large piece on her chest. When she goes to fancier events (formal weddings, galas) I noticed she often wears a boatneck neckline. I never asked but once when we were shopping she said that she wanted something with more coverage there because it was formal. \n\nI asked, have people ever said anything to you? She said no, it’s her preference; in her eyes sometimes the ink takes away from the formal look she’s going for when she wants something more simple. \n\nI really have a feeling that’s where sister is coming from but here’s Reddit with the “bridezilla” and “tattoos are part of you”. Yeah my hair is part of me I wear a messy bun every day. I do it differently for formal occasions.", "I have cats and flowers.", "Sorry for being human ig", "…..it sounds like you’re most mad about not getting your choice of dress??\n\nand it sounds more like she just assumed you’d feel the same way about covering them for a wedding?", "Oh, for heaven's sake! Why doesn't she just have them photo shopped out in her final pictures?", "Cool meaning she assumed you were probably on the same page \n\nI don’t mean to be rude but that statement, coupled with “l was actually excited to look at dresses” suggests to me that you may not be the easiest person to do these activities with anyway. \n\nShe didn’t say cover up fully. She doesn’t want tattoos to be the focal point. There’s a middle ground here. Find it.", "Oh geez. Honestly, I wouldn’t even attend without a real apology.", "The tattoos are a permanent part of the OP's body.  She can stand up with her sister on her wedding day, but sister needs to accept the OP for who she is.", "I mean to be fair it’s possible she assumed that explosive behavior will be a trend. You mention you are both hard-headed. I get why she chose to avoid further incident", "Again you’re making it clear your actual issue is being upset your choice wasn’t *the* choice lol", "Jesus, that’s a stretch. The bride didn’t remove anyone’s bodily autonomy. She said she’d prefer that sister wear something that covers her tattoos, sister freaked out and said no, and the bride said “okay, you don’t have to be in the wedding”. The bride very much respected her bodily autonomy. \n\nAlso, we’ve got to chill with this “removing someone else’s bodily autonomy” bullshit. It’s customary for a bridesmaid to wear the dress a bride picks out, that’s not abusive nor is it removing their bodily autonomy. You sound dramatic, but you end up taking away from real abusive situations when you accuse everyone of being abusive.", "I swear the posts on this sub make it seem like people getting married want everyone else to wear potato sacks and meditate on the couple the whole wedding.", "I'm not mad about the dress. I would wear whatever she told me to. It was the pretentious way she assumed I knew I would have to cover them. Why ask me to help pick out the dress and insist that she wants me to be comfortable in what I'm wearing but then suddenly pull this? She should have just picked the dress herself instead of asking for my input. I didn't think I would have to cover my skin. It's an outside wedding in summer in Texas and I don't tolerate heat well due to health conditions. It seemed impractical. My tattoos have never been an issue before. I stood up in my best friend's wedding a few months prior to my sister asking me and my friend took no issue with them. I stood up in middle sister's wedding with tattoos and no issue. Bride sister has never said anything about me covering them for any other occasion. She should have been up front about it when she asked me to be a bridesmaid or just picked someone else who fits her aesthetic. Instead, she brought it up in a callous way and that is why I got upset.", "My tattoos are all over my body including my chest, shoulders, forearms, legs...etc.", "I considered not attending but then my mom called me crying, saying we are sisters and shouldn't be fighting and now I feel obligated to go to appease my mom.", "How so?", "Jfc asking someone to wear your preferred bridesmaid dress for a bit additional tattoo coverage is not asking someone to make themselves smaller", "Has she tried making the same argument with your sister?\nParents will always want the kids to get along. But you should start assessing if your sister is a positive presence in your life and how you will feel if she continues to treat you this way. If you don’t take stand, she will keep thinking she can get away with half-baked apologies and acting callous.", "I’m missing the part where what she said was rude. It sounds like she casually and nicely brought it up…", "Yeah, sorry to say, but it definitely sounds like you overreacted.", "Bingo. \n\nWe see from OPs comments too that what really got her angry was looking at dresses, giving her opinion, and the bride simply having a different opinion. \n\n“I was actually excited to look at dresses” ok weird choice of words sure not everyone loves shopping but hm\n\nThen she specifies that she’s mad she was asked for her opinion and then the bride was like oh I want more coverage \n\nLike obviously the bride assumed OP would assume the same as her and then communicated that. \n\nBut no no it’s gotta be “bridezilla!” And “tattoos are part of you!” I have multiple friends who choose to wear more coverage for formal events for their tattoos. Not to not offend anyone or censor themselves but because they want a simpler look that to them is formal and doesn’t include as much tattoo showing.", "This is why I tried sticking up for myself bcuz I am always the doormat in relationships and I need to stand my ground. I guess I picked the wrong battle to start doing so.", "Again: are you really mad about being asked to cover your tattoos \n\nOr were you reactive to your choice being declined\n\nYou’re hung up on her not telling you proactively. You have multiple comments here saying that assumption is pretty common, that formal wear will offer more coverage of tattoos for a formal event. Why can’t you consider that she assumed you knew this and when it was clear you didn’t, she set the expectation then?\n\nYou’re acting like she tried to catch you out. “Ah-HAH but *what about your tattoos huh*? Cuz I hate them!! And that dress won’t work, neither! Mwahahah!” \n\nLike that’s not what was said lol", "That's why I apologized the very next day. I realized I may have overreacted and apologized with a cool head. She already replaced me with another bridesmaid."]}