{"id": 13238, "submission_id": "122mkz4", "title": "AITA for not refusing my children's wish outright?", "selftext": "Throwaway for anonymity, because some people in my life know my main.\n\nSo, a bit of background:\nI (38M) am divorced from my ex (41F) and we have two kids together (14M and 12F) we live in Germany, if that's important for you to know.\nMy wife an I separated over 4 years ago and got our dovorce finalized just shy of three years ago. We really tried to work together for the kids and keep the effects on them to a minimum, which has been really hard at times. We also agreed to always respect the children's wishes and not to bad mouth the other parent to them. I think we have been successfull with that.\nWe tried different things after the divorce concerning custody, first we let the children stay at our house and we got an apartment nearby, with a bedroom for each of us, so one week one of us would be at the house with the children. But this situation wasn't really working for either of us. Then my wife stayed at the house permanently, I got a bigger apartment with bedrooms for each of my children and they would alternate weekly between us. This was really stressful on the children, so we have now arrived at the more traditional model of them living with their mom (we asked them and that's what they opted for) and me seeing them every other weekend and for some holidays and I go on vacations with them.\n\nMy wife met a new guy and moved in with him a while ago and we just sold the house for an insane amount of money (even considering the current situation with a crazy housing market and high inflation, two parties really wanted the house and there was a bidding war), so I'm quite comfortable now.\n\nIn addition to my divorce, my social life has kind of dissolved, I lost contact with a couple of mutual friends with my wife over the divorce, a really close friend of mine died, another friend moved to the other side of the country and my best friend emigrated to Canada. There was also some drama at my local sports club and I left. Furthermore I have become a bit disillusioned with my home country.\n\nI recently got offered an amazing job opportunity in Norway and for all the reasons above, I wanted to accept. The only thing keeping me here are my children so I came up with a plan and if my children were going to be okay with it, I would move.\n\nI talked to my ex wife first to get her approval.\n\nMy plan is to fly back once a months to Germany for a long weekend to see my children. In addition they would have the chance to visit me in Norway during their school holidays, if they wanted to. My ex-wife gave her approval and I talked to my kids about it and they asked to think about it.\n \nWhen it was my weekend again two weeks later, they really shocked me. They said they were okay with my plan, but asked me to consider letting them move to Norway with me. I asked them for theie reasons and they explained, among other things they weren't happy after they had to move with my wife, they don't like their new schools and haven't found any new friends. They also don't like their new living situation. I explained to them, that this was a really big life decision to make at their age and it was not easily reversible. I told them to think about it again, while I did some more research, if was feasible concerning schools, but if they really wanted to, I would be very happy to move to Norway with them. I also promised them to talk to her mom about it.\n\nI did my research and I think it would be totally possible for them to come with me, school wise.\nAlso my brother already lives in Norway, he married a Norwegian and they have two children (15M, 11F).\nMy children have already been there on visits and they really like their aunt, uncle and cousins, so we would have family there.\n\nI did already live in Norway for a year during my time in university, so I know the country a bit, speak the language and I'll have my brother for advice.\nSo in my head it all came together quite nicely.\n\nWell my ex is furious, she thinks I'm an asshole for presenting my children with this option and should have refused them outright. She hasn't told the kids, she won't allow it, but wants me to rescind the offer instead. She can prevent them from leaving with me legally, but I think she knows that would destroy her relationship with the kids.\n\nI have talked to some people about this and most didn't think I was 100% in the wrong, but my mother said it was horrible, that I wanted to take the kids away from their mother, which made me unsure.\n\nSo AITA for saying my children can come with me and not taking back the offer?", "created_utc": 1679838457, "permalink": "/r/AmItheAsshole/comments/122mkz4/aita_for_not_refusing_my_childrens_wish_outright/", "score": 25, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole, because I'm refusing to rescind my offer to my children and in consequence would be either forcing my ex-wife to forbid them to move with me or her letting me take away the children from their mother.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "#READ THIS CAREFULLY BECAUSE WE WILL PERMANENTLY BAN YOU FOR VIOLATIONS\n\n\nYour post was removed because it exceeds the 3,000 character limit.\n\nPlease consider resubmitting a briefer post. You are **not allowed** to continue your post in the comments or another thread. **You will need to post it again**, we cannot approve the removed post if you edit it. \n\nLimit 3,000 characters (including the title). https://www.lettercount.com/\n\nDo not attempt to circumvent this requirement, you will be banned. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*"]}