{"id": 13242, "submission_id": "122qfji", "title": "AITA for telling my father’s wife how I really feel?", "selftext": "When I, 19f, was 3 years old, my father cheated on my mother with one of his old high school girlfriends. My mom found out and pulled out divorce papers. My father payed child support but he was never around growing up. I asked my mom as a little girl who my father was but she didn’t like talking about it but she told me the story when I was 14. My response to her was that I would never reach out to my father and I was perfectly happy having her as my only parent.\n\nNow I’m 19. I still don’t have the desire to have any relationship with my father. However, my father’s brother reached out to me on Instagram after finding my account. He didn’t say much. Just that he knew how much of a piece of crap his brother is and that he wishes me luck in life. I ended up chatting back and forth with him until we finally met in person. I won’t talk about the meeting but he convinced me that perhaps it’s a good idea to meet my younger half siblings. This would mean meeting my father and his wife. But I decided to do it anyway. My uncle arranges for me to spend spring break over with my father and his family. I arrive at their house. I’m greeted at the door by one of my half-brothers who takes me inside and guides me to the dining room where my father and his wife are seated. My father stands up. Opening his arms preparing for a hug. I offer a handshake instead. I sit down and I have a conversation with both of them. Before having a serious conversation, they want to wait till the evening when the kids are supposed to go to their friend’s house so we could be alone. I agree. Evening rolls around. Father drops the kids off at their friends house. He comes back and I have dinner with his wife. Lots of things were discussed. They didn’t try to white wash or deny the fact that my dad cheated on my mom with his wife. They admitted it openly. I expected the opposite to happen but I was proven wrong. Then I talk about myself. Then they about themselves and their kids. Dinner ends. I go up to the guest room they prepped for me. Minutes later my father’s wife comes up and knocks on the door. I tell her to come in. She asks me what I think of everything. Her, their house,  her kids. I say that everything is cool. To which she responds with “be honest.” I said “ok. I’m very hurt at the fact my father treated my mother the way he did because of you. The fact he gave you everything but barely anything to me or her. I can’t really have a negative opinion of her kids. She leaves the room. Later my father comes up. Asks angrily I told his wife. Apparently I made her cry I said “what she wanted to hear. My honest thoughts.” Somehow I’m the bad person for it.\n\nForgive any possible spelling mistakes. English isn’t my first language. I also left out some details because otherwise I would be typing for hours. It wasn’t as simple as my uncle convincing me.\n\nAnyway AITA?", "created_utc": 1679845767, "permalink": "/r/AmItheAsshole/comments/122qfji/aita_for_telling_my_fathers_wife_how_i_really_feel/", "score": 179, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be TA because things happened a long time ago and I could just let them go and I didn’t hold back at using insults and the like.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. The truth hurts, but that doesn't mean you should've lied.", "NTA\n\nYou seem confident and mature enough to cope with all of this, hopefully it gets better and if not at least you know you tried.\n\nGood for you.", "People who don't want honest answers shouldn't ask the questions.\n\nYou said nothing wrong.\n\nEmotions were running high all the way around. Give your Dad time to cool down - he likely was fearful the entire time that you would mistreat his wife. You didn't.\n\nNTA", "NTA Your English is fine BTW. What did she want you to say? You had a very open mind. I, for one, a random stranger on the internet, am proud you handled this with such poise and honesty. You weren’t hurtful to her. You were honest. I guess cheats don’t like honesty.", "NTA \nWhat did she expect when she was the other woman.", "NTA\n\nYou said the truth. How entitled does she have to be to expect anything else or that you feel any different about her.", "NTA, OP. I'm sorry you were placed in a situation where you are being blamed for hurting the adults who, in fact, deeply hurt you. I'm appalled that your father is angry at you for expressing your upset. I don't know how they think any reunification can happen without having to hear some hard truths. You are not obligated to spend your entire spring break with them, OP. Your dad seems to want to gloss over your feelings without deeply apologizing for the hurt he caused you and your mom; your stepmom, to her credit, actually put herself out there and is doing some of the emotional processing regarding their decision to abandon you and your mom, and if she's crying for how she treated you, that's okay. It is healthy for us to experience shame when we have done things to be ashamed of. It's not to be avoided, because that only causes more shame and guilt, and these things may have been building up inside of her these past years as she became a mother herself; her perspective of what she and your father did has likely become more upsetting to her.  \n\n\n For any future visits, maybe make them day visits only, so you have some space to process this. And give your mom a lot of hugs-- sounds like she did a good job with you.", "NTA. Dad has to do much more to make things right. That’s more than just a nice dinner. (Asking for forgiveness might be nice.)\nI’d give him some points for trying though. Just not as much as he hoped for.", "NTA. She asked, you answered. People need to stop asking for the honest truth when they know they won't be able to handle what they might hear. And your father is a jerk. Back then and now.", "NTA. I am so sorry about how your father treated your mother and you because of the woman he cheated with. I’m sure you appreciated your father’s brother for reaching out to you. Maybe it was not a good idea to plan on spending a whole week with your father and his wife. The first contact probably should have been a dinner with them and then go your separate ways. \nYou did nothing wrong. Your father’s wife asked you to be honest and you were. That is probably the first time she heard your side of the story and she feels guilty, that is why she cried. She never heard how her actions affected you. She deserved to know. Your dad is TAH because he is wrong to be angry at you for telling the truth. It is up to you if you want to continue to get to know your father or not. Is it worth it to get to know him? Good luck. This is so sad.", "NTA. Sounds like you handled the situation with maturity, honesty, and dignity. Well done", "I grew up as a spectator to a similar situation.\n\nMy very best friend when we were 12-14 had had this happen to her mom. Afterward, her mom worked hard as a nurse to bring up her three girls on her own. The father lived in the same town with his lover / later wife, but never saw his children.\n\nYears later, my brother married a daughter of the adulterous 2nd wife -- offspring of a previous marriage. So the adulterous pair were at my family gatherings. It was interesting to see the \"other side.\" But I could never warm to either one. \n\n(I'm judgmental by nature. And also, my own father died when I was nine. I came to think losing a father like I had was not as hard as how my friend -- and you -- lost yours.)\n\nYour former father and his 2nd wife want forgiveness and redemption. Repellent that they then tried to guilt you into giving it. Shame on them. \n\nThey are the TAs.", "NTA. She asked, you told her.  They have no right to make you feel bad about resenting the father who de-prioritized his child after cheating in his marriage, or the woman he cheated with.  If they didn't expect that to be the case, they have their head up their asses.", " NTA. She pushed to find out what you really felt and you told her. Not your fault that she didn’t like the truth.", "NTA. When you gave a polite answer, she asked for the truth. From what you said here, you didn’t even trash talk, just told her how you honestly felt. It’s not your fault she feels badly for how your father treated you and your mom.", "NTA. They reached out to you to come over, and asked you what how you felt, and you told them. They might feel bad about the situation, but that doesn’t make you TA.", "NTA\n\nWe all know who the assholes are here and it's wild how they seem upset to hear it", "Nta", "NTA for being honest. But don't blame it all on her. He probably would have found someone else to cheat with either way.", "NTA", "NTA. Your father and his wife thought he could have some magical come together moment. They’re delusional. Go back to no contact. You were duped. I have members of my family who don’t have anything to with the parents or half siblings that got away in the abandonment. The only successful ones I know of happened as adults away from the terrible parents. Don’t fall for it. Just walk away", "NTA She asked a very serious and dangerous question and got the honest truth, I mean seriously what was she expecting for you to say? Because she and your dad couple keep their pants on you lost out on a father for 16 years. Yes he paid child support but that’s the very bare minimum he could have done.\n\nThey should both count themselves lucky you even interacted with them, never mind didn’t scream shout and curse them for being major AH and ruining two peoples lives.\n\nI notice they waited to talk about their past only once their children are out of the picture. Don’t want to admit their shame in front of their kids but are quiet happy to pridefully answer it in front of you.\n\nGo home and don’t bother contacting them again, you can tick off the curiosity question now.\n\nEdit: Spelling", "NTA. If the Dad's wife couldn't handle honesty then she shouldn't ask for it.", "NTA he was out of your life for a really long time and you told the truth", "NTA did she honestly think you'd be happy that your father abandoned you for her? What did she want to hear? It certainly wasn't the truth. Why is he expecting you to spare her feelings when he refused to be a father to you after he abandoned you? It's not like you were malicious & yelled & screamed at her like a tyrant, you articulated how you felt about the entire situation as she had asked.", "NTA. She wanted to hear.", " You gave your father more of a chance than he even deserved and I don’t even think he has any right to complain about your honesty. NTA", "what insults did you use that you mention in the judgement not response?\n\nESH given the answer was auto-removed for repeating some of the insults. Telling someone they ruined your life can happen without insults; you weren't just honest, you were rude. That being said, it doesn't absolve your father and his affair partner from their guilt. They should have known the first meeting would be a delicate thing and not push things. Instead, she wanted a teenager's \"honest opinion\" and got brutally hurt by it. Then your father blames you for not being mature enough to be honest without being insulting. On the first visit. Does he think you some sort of saint or a reincarnation of Buddha? The man needs to get in touch with reality.\n\nEdited for judgement.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWhen I, 19f, was 3 years old, my father cheated on my mother with one of his old high school girlfriends. My mom found out and pulled out divorce papers. My father payed child support but he was never around growing up. I asked my mom as a little girl who my father was but she didn’t like talking about it but she told me the story when I was 14. My response to her was that I would never reach out to my father and I was perfectly happy having her as my only parent.\n\nNow I’m 19. I still don’t have the desire to have any relationship with my father. However, my father’s brother reached out to me on Instagram after finding my account. He didn’t say much. Just that he knew how much of a piece of crap his brother is and that he wishes me luck in life. I ended up chatting back and forth with him until we finally met in person. I won’t talk about the meeting but he convinced me that perhaps it’s a good idea to meet my younger half siblings. This would mean meeting my father and his wife. But I decided to do it anyway. My uncle arranges for me to spend spring break over with my father and his family. I arrive at their house. I’m greeted at the door by one of my half-brothers who takes me inside and guides me to the dining room where my father and his wife are seated. My father stands up. Opening his arms preparing for a hug. I offer a handshake instead. I sit down and I have a conversation with both of them. Before having a serious conversation, they want to wait till the evening when the kids are supposed to go to their friend’s house so we could be alone. I agree. Evening rolls around. Father drops the kids off at their friends house. He comes back and I have dinner with his wife. Lots of things were discussed. They didn’t try to white wash or deny the fact that my dad cheated on my mom with his wife. They admitted it openly. I expected the opposite to happen but I was proven wrong. Then I talk about myself. Then they about themselves and their kids. Dinner ends. I go up to the guest room they prepped for me. Minutes later my father’s wife comes up and knocks on the door. I tell her to come in. She asks me what I think of everything. Her, their house,  her kids. I say that everything is cool. To which she responds with “be honest.” I said “ok. I’m very hurt at the fact my father treated my mother the way he did because of you. The fact he gave you everything but barely anything to me or her. I can’t really have a negative opinion of her kids. She leaves the room. Later my father comes up. Asks angrily I told his wife. Apparently I made her cry I said “what she wanted to hear. My honest thoughts.” Somehow I’m the bad person for it.\n\nForgive any possible spelling mistakes. English isn’t my first language. I also left out some details because otherwise I would be typing for hours. It wasn’t as simple as my uncle convincing me.\n\nAnyway AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA, now you said he paid your mother support for your care. She chose to divorce him, from what I read. I have a feeling you weren't told the entire story of support, and yes you were justified to lay it out, yet you didn't have to do it. You should have said that to your father not his wife.\nYou should apologize to her, and just tell your dad off for your living conditions growing up.", "NTA - She asked and you answered", "NTA \n\nShe asked, you answered. \n\nLots of good advice in the comment section here of your post. But I will reiterate this one: I would not spend any more nights there and limit to day trips. \n\nGood luck op!", "NTA, did she really not expect a response like that? She shouldn't have asked for honesty if she didn't want to hear it. Also, your father needs to accept that you could be (and are) still hurt about the situation. If he really wants to have a relationship with you, then he needs to know that things aren't just going to be smooth sailing all the time and you may never forgive him for what he did to you and your mom.", "NTA\n\nShe asked you told.\n\nThough there doesn't seem to be much impetus for you to be there in the first place.    \nIt sounds like his other kids aren't your 1/2 sibs other than biologically.", "NTA either she wasn’t expecting to hear how the consequences of actions affected innocent children or she manipulated the situation to be able to cry to your dad that ‘she’s mean to me’ in order to put a stop to this reconciliation. She probably doesn’t want her kids to have to share with you in any of your dad’s inheritance", "Technically you were rude because you were a guest. But father's wife told you to be honest so this \"rule\" was lifted. And your \"progenitor\" (he don't raise you so he can't be called your father) has no right to be upset about something he is obviously at fault. NTA.", "You're NTA.\n\nShe asked for your honest opinion. And you gave it. Your father chose not to be a part of your life and is dealing with the consequences of those choices.", "NTA \n\nI don’t know how your dad and his wife were really expecting this to go. Not only does the cheater hurt their family, but also the AP. His wife hurt you too. She asked how you felt. You gave her a nice answer at first. Then she pushed. So you told her the truth. She isn’t a women your dad met later after your mom and him divorced. She was the AP. Of course you are going to feel a certain way. It can’t help you to see them and their little family. Knowing what they did to yours.", "NTA.  I wish I had that much level-headed maturity when I was 19.\n\nYou were deceived here, by the uncle and also by the father.  They were trying to fix themselves by getting you to say everything is okay, but you stuck to honesty.", "N T A you only answered honestly when she asked for it. And by the looks of it you were respectful about it. The truth hurts, but hiding it away doesn't help anyone.\n\nEdit to add: it appears you weren't quite as respectful about it as you made out in the post. YTA for that. You can be honest without calling someone names.", "Especially when they directly ask for it", "NTA. She pushed to find out what you really felt and you told her.", " People need to stop asking for the honest truth when they know they won't be able to handle what they might hear.", "OP said she didn't hold back with insults.", "I’m guessing she wanted OP to say that seeing how happy and healthy their father’s family turned out made up for his betrayal of their mother and lack of involvement in raising OP. Which is freaking insane.", "She called her father's wife a whore ( see comments.)  No judgement, I would have done the same.", "I may have used the whore word", "Comment [stolen](https://www.reddit.com/r/AmItheAsshole/comments/122qfji/aita_for_telling_my_fathers_wife_how_i_really_feel/jdrb2qi/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) \n\nReport > Spam > Harmful bots", "where?", "Sounds like that is what his wife wanted to hear. I’m sure the wife is getting heat from somewhere, because she was the AP. OP’s brother isn’t on his side. So who knows how the wife’s relationship is with OP’s dad’s family.", "Rather insulting to the world's oldest profession, don't you think? 😉", "This is one of those situations where that's a valid insult to use. She knowingly slept with a married man and blew up your lives, during your visit you took the high road where it mattered (in front of the kids). Both of them deserve a lot worse than harsh words.", "In the judgement bot response."]}