{"id": 13252, "submission_id": "122mfa9", "title": "AITA for Refusing to Allow My Husband's Coworker into Our House Party?", "selftext": "  \n\nMyself (22F) and my husband (30M) threw a house party for the entire neighborhood, friends, family, and any coworkers we could reach out to. I begged my husband not to invite one male from his friend's group, a coworker who we'll name Freddie (28M) for one specific reason of which you'll find below. He nods in agreement. I, on the other hand, invited as many people as I could and only adults were allowed--especially because there was alcohol present. This event occurred yesterday from 3:30 - 7:15 P.M. Short and sweet. \n\nThe rules were simple and strictly enforced, they were also communicated via email to all invited guests beforehand. It was a potluck, so each guest or group had to bring one food item that could be shared with everyone. These dishes were placed on the kitchen counter next to the food myself and my husband had already prepared. I asked that those who attended did NOT bring their kids. I also asked for people to be on their best behavior and avoid entering areas of the house (master bedroom, attic...) that were off limits, either because they were unfinished and dangerous or very personal. \n\nTypical house party rules. \n\nBesides the above, the party was in no way formal and was meant to be enjoyed through communication, games, and/or watching TV. I turned away only a few guests that refused to bring food to our house party or 'claimed they did not know.' I also turned away one woman who brought along her child, and even she did not seem to understand that I did not want children present for the adult conversations transpiring (drugs, other) and music playing as well as the alcoholic beverages. \n\nFlash forward to the coworker I asked my husband not to invite. When Freddie showed up I downright denied him entry. I could smell him from the doorway the same as any other time he barges in on the weekends. He is an avid conspiracy theorist and collector. He and my husband hit it off instantly for their love of Star Wars and DnD. Freddie, for reasons unknown, also always smells unhygienic to the point where it is concerning. When I finally mustered the courage to ask him about the smell days ago, he tells me that it's some paint from inside his car--despite this being a month now of smelling off.\n\nMy husband drifted beside me while I continued to voice my concerns. Freddie tells my husband about what I've said to him, and my husband shoots me the most disapproving look I've seen all marriage. Eventually, I am forced to let Freddie in because Freddie brought food, a couple of games, some gifts (unnecessary, but oh well) and he's my husband's close friend. Husband pokes that Freddie has abided by \"my\" rules and has done nothing wrong--while I uphold that the need to have demonstrated basic, personal hygiene shouldn't have to be required in writing on the email I sent out. AITA for refusing to deny Freddie entry?", "created_utc": 1679838072, "permalink": "/r/AmItheAsshole/comments/122mfa9/aita_for_refusing_to_allow_my_husbands_coworker/", "score": 276, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I denied a guest who conformed to the rules entry to my house party because he was unhygienic. People may think I was the asshole because the friend was my husband's best friend.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You turned people away at the DOOR? YTA just for that. This is your husband’s good friend and you have really listed no good reason to turn him away. YTA.", "You just know OP is going to add “must demonstrate basic personal hygiene” to the email invite for her next 3:30 - 7:15 rager. OP YTA.", "Your parties sound awful.", "Yta. In my culture, which honestly is Mexican American in socal, it is UNHEARD of to turn away guest especially if they have no food.  This is a discussion between you and your husband and your husband not listening or respecting your wishes. This poor man!", "YTA. I was going to say you sound fun at parties but I don't think you do.", "YTA- you get the YTA rating immediately for all of your actions before you even got to the Freddie bit. Turning people away at the door because they didn’t bring food? That’s the height of rudeness. Freddie is your husbands friend and he wanted him there. Though I do agree that the hygiene issue is a little unacceptable.", "You turned people away from your door because they forgot to bring you food. I would honestly be soo embarrassed if I was your husband 🙄", "NTA for allowing Freddie in, YTA for denying people entry after inviting them. Who does that?", "It's obvious OP isn't going for the hospitality award. If ya wanted to win yta award, why not just say so?", "YTA and I am dying to know what happened to the people who were not out of the house by 7:15.  Did you open the door and yell FIRE! or just spray them with mace so they'd leave?\n\nEdit because auto correct tried to 'help'.", "YTA for so much more than what you asked about 🤦🏽‍♀️ seek help", "You sound like Umbridge. YTA I get that he smells but thats just mean", "INFO:\n\nSo Freddy got in to the party. Was the “smell to the point of it being concerning” mentioned by, well, anyone other than you? Was it a distraction for anyone other than you?", "INFO why do you have parties when you don't seem to like anyone?", "Okay, no kids at an adult party is common sense. Asking people to please bring food is normal. Literally turning people away from the door because they didn't bring food is pretty frigging rude and gross. So you were an AH before Freddie showed up. \n\nYTA, although I can not wait for all the AITA posts when you get married since you've managed to be a bridezilla on a normal weekend.", "esh\nyou are a shit hostess and your husband lied to your face", "The party being “meant to be enjoyed through communication” is what really tickled me here.", "Its considered incredibly rude to turn someone out your doorstep especially when you yourself invited them.", "Yta", " YTA, you can’t control your husband’s friends.", "YTA", "NTA. Your husband is the asshole. He clearly invited Freddie despite seemingly agreeing he wouldn’t. This put you in a situation where you thought you were denying entry to someone who wasn’t invited, which is perfectly fine, whether he brought food or not. The people saying Y T A are being ridiculous; you don’t have to accept uninvited guests (or guests you believe weren’t invited).", "INFO:You had a prior discussion with your husband (before the party) to not invite this co-worker. Your husband was in agreement, correct? \n\nSo, who invited Freddie then? Did your husband go behind your back and invite him? Does he live close by or did someone forward the email?", "NTA and who ate Freddie’s food?!", "NTA. I wouldnt want him in my house either unless he showered. No car smells homeless, not sorry.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n  \n\nMyself (22F) and my husband (30M) threw a house party for the entire neighborhood, friends, family, and any coworkers we could reach out to. I begged my husband not to invite one male from his friend's group, a coworker who we'll name Freddie (28M) for one specific reason of which you'll find below. He nods in agreement. I, on the other hand, invited as many people as I could and only adults were allowed--especially because there was alcohol present. This event occurred yesterday from 3:30 - 7:15 P.M. Short and sweet. \n\nThe rules were simple and strictly enforced, they were also communicated via email to all invited guests beforehand. It was a potluck, so each guest or group had to bring one food item that could be shared with everyone. These dishes were placed on the kitchen counter next to the food myself and my husband had already prepared. I asked that those who attended did NOT bring their kids. I also asked for people to be on their best behavior and avoid entering areas of the house (master bedroom, attic...) that were off limits, either because they were unfinished and dangerous or very personal. \n\nTypical house party rules. \n\nBesides the above, the party was in no way formal and was meant to be enjoyed through communication, games, and/or watching TV. I turned away only a few guests that refused to bring food to our house party or 'claimed they did not know.' I also turned away one woman who brought along her child, and even she did not seem to understand that I did not want children present for the adult conversations transpiring (drugs, other) and music playing as well as the alcoholic beverages. \n\nFlash forward to the coworker I asked my husband not to invite. When Freddie showed up I downright denied him entry. I could smell him from the doorway the same as any other time he barges in on the weekends. He is an avid conspiracy theorist and collector. He and my husband hit it off instantly for their love of Star Wars and DnD. Freddie, for reasons unknown, also always smells unhygienic to the point where it is concerning. When I finally mustered the courage to ask him about the smell days ago, he tells me that it's some paint from inside his car--despite this being a month now of smelling off.\n\nMy husband drifted beside me while I continued to voice my concerns. Freddie tells my husband about what I've said to him, and my husband shoots me the most disapproving look I've seen all marriage. Eventually, I am forced to let Freddie in because Freddie brought food, a couple of games, some gifts (unnecessary, but oh well) and he's my husband's close friend. Husband pokes that Freddie has abided by \"my\" rules and has done nothing wrong--while I uphold that the need to have demonstrated basic, personal hygiene shouldn't have to be required in writing on the email I sent out. AITA for refusing to deny Freddie entry?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA for turning people away at the door because they didn’t have food. But honestly I don’t think you should be expected to let in someone who isn’t hygienic. It ruins the party for EVERYONE.", "She doesn't need a reason to deny entry to her home and she told her husband up front she didn't want Freddie there.  Her husband agreed.  I certainly wouldn't turn away someone because they forgot or didn't have food, but I do understand turning away the child.  Still op YTA because you just are one.", "I can’t imagine going to a party with enough drinking to keep kids out but it finishing at 7:15. Wtf?", "OP: “Just a rollicking good time to be had between 3:30-7:15. Be sure not to go into the attic. Smell tests will administered at the door. Thank you, signed ”The Enforcer” “.   \n\n\nJesus. I’d be mortified to be married to someone who treated my guests like this. OP, YTA", "It's rude for them to show up without food when that's the expectation of attendance.", "> I turned away only a few guests that refused to bring food to our house party or 'claimed they did not know.'\n\nYeah that was pretty cringeworthy.", "Sorry I was not able to reply earlier, the lull in work spiked once again. \n\nBut, no. My husband invited Freddie into our bedroom where they both stayed for the duration of the party. If someone did happen to smell him they were nice and did not mention it. I did not sleep in our bedroom afterwards. Freddie really does smell bad, almost like dog poop.", "I am unsure whether Freddie is the 'anyone' in this ask after information or whether you are flexing sarcasm that I do not find to be impressive. I will answer; however, as--within the post--I included that I invited as many people as I could.", "My husband invited him. He told me this morning before work. He told me that he didn't see Freddie being invited would be a problem and that his 'keeping Freddie and himself in our master bedroom' allowed the guests to enjoy the party uninterrupted. \n\nThat statement proved to me that he knows about Freddie's general uncleanliness but instead chooses to disregard the other male's health for friendship. It is somewhat concerning.", "She TURNED PEOPLE AWAY at the door! We've all had those people who don't bring a dish - we let them in and remember not to invite them next time. We don't actually refuse entry. How controlling.", "Yes but it also sounds like not everyone was aware that it was a potluck.", "I would’ve turned the lady with the kid away. No kids means no kids", "I don’t understand how when Op sent the message to EVERYONE invited", "Oh definitely that.", "Are you Sheldon Cooper's female alter ego? YTA.", "You’re hardcore, OP! Know how some people planning their weddings anticipate problem guests and contemplate hiring security to turn them away? You’d be perfect for that job! But as a host, YTA.", "I have never heard of turning away guests at the door. Sounds like a terrible party. YTA", "YTA. Didn’t even have to finish reading. She turned away guests at the door. OP is a cheap, classless AH.", "FFS, how can anyone have fun at a house party with so many strictly enforced rules and requirements. \n\nShocked anyone showed up at all. \n\nESH", "The hostess with the leastess.\n\nYTA", "ESH. You all suck, you're all terrible. The fact you were turning people away like you were hosting a freaking formal Oscar's party or something, and your husband for going around you to let that rank guy in. \n\nY'all need to have a real conversation with each other instead of coming here to find out that you're all assholes.", "NTA.  Your husband lied and manipulated you in order to bring his disgusting smelling friend into your party.", "NTA. You told your husband upright you didn’t want Freddie there and he agreed! You only turned away a few measly people. I understand wanting people to bring food so they don’t seem like they’re a freeloader. I also understand not wanting children there.", "YTA Freddie had a lucky escape. You sound exhausting and a complete bore. Some of those rules are ridiculous and unnecessary.", "You're so rude! YTA", "YTA for multiple reasons…", "Do you seriously not know if YTA?? You sound awful and insufferable. You turned people away at the door and tried controlling who your husband invited. He’s one of his close friends, that should mean something to you. Also, there could be many reasons for his ‘bad smell’. Uuuugh you suck.", "Because they didnt bring food? 😅😅😅 YTA", "Can we add a bot that does a check for AI generated content? This certainly feels like it.", "I mean, I don’t think this is so much about anybody being an asshole. You are the kind of person that turns away people from a party because they didn’t bring anything to the potluck. Your husband is the kind of person that hangs out with unclean people. You guys simply DO NOT BELONG TOGETHER and this is probably one of many many examples of why you should just get away from each other and start over.", "\"party was meant for people to jave fun\" also herr is a bunch of rules and restrictions.\n\nN T A for limiting your house.\n\nBut YTA for turning geusts away at the door. Also YTA for turning someone away who might have a hygiene problem. You seem to be the only one taking issue with the \"smell\". And feel like you were more judgemental and rude then yku let on towards freddie.", "YTA all around. I would never turn someone away at my door. You are going to be the talk of the neighborhood and not for good reasons.", "YTA - user name checks out. Friendships are not transactional relationships, an invite and entry to a party should not be prerequisite on them giving you something in return, in this case a food item. You may say “my house, my party, my rules” by which you are correct. However human social interactions have their own nuanced rules which you are stomping all over. Your list of people to invite to parties will dwindle and maybe one day all you will have left is Freddie.", "Info: the people you turned away seems like they were people you didn’t even invite yourself is that correct? If so NTA. If you invited them soft YTA for that but NTA for not wanting Freddie there if he stinks. This may be a case of ESH. I certainly wouldn’t want people I don’t know coming to a party that I threw.", "You say that he smells awful, and he blames it on some paint inside his car? I have to admit my first thought was a bit of shake and bake in his trunk. If that's the case your husband is in for a shock, unless he's partaking in it as well.\n\nNow to the issue you did not ask about. If you plan to host any other get togethers, I suggest you read a few books about hostess etiquette. Be welcoming and always make your guests feel comfortable in your home. Use tact, if necessary, to ensure your guests do not feel embarrassment or slighted. Even the most blatant faux pas can be overlooked with clever distractions and a warm smile. Be prepared for anything, because whatever can go wrong, will go wrong, it's how you handle it that counts. In other words, don't turn invited guests away at the door!", "This has got to be a joke, she is actually unbelievable. Please, please just set your husband free", "I don't get this either, if I invite someone to my house it is because I enjoy their company. I've done plenty of potlucks and know that not everyone will bring something. Maybe they forget, maybe they were out running around before the party and couldn't manage, maybe they just can't afford to bring something. Who cares, come and have a nice time. There's no policing a middle of the afternoon party, come on.", "OP sounds like an android who has attempted to activate her  newly-programmed social interactions subroutines, with catastrophic results.", "I do not often receive complaints.", "This party sounds fucking terrible.", "I do and have done that. \n\nI invited them to an email chain where the conditions were that they please read in order to attend and conform to the rules of the party. I only managed to turn away four people, three without food (possibly invited through other means or forwards--I did not recognize them) and the one woman with her child.", "I am already married.", "Right? Like, does OP think if this wasn’t specified, people would just stare at the wall like the end of The Blair Witch Project?", "How so?", "I was gonna say this sounds like that episode of Friends where Monica throws Rachel a birthday party", "7:15 dismissal allowed for everyone to be out before 9 P.M. My bedtime is around 9-10. I plan early endings so that our parties do not drag on for much longer. When 7:15 hit I announced that the party would be wrapping up soon and any food with dishes brought along should be taken.", "Who is Sheldon Cooper?", "That may be a nice job to have if only I were fit enough to ascertain the position.", "From what I have gathered over the past month, Freddie is not homeless but either in complete disregard for his general health & hygiene or has a mental or physical disorder that forces him to smell unwell. I doubt the smell is deeply rooted to his car. It does smell like feces.", "It was not added to the kitchen pile. The food was in bags (cookies, sweet treats) and one dish was in a crockpot, possibly roast. My husband took it into our master bedroom and when Freddie left, the food he brought was taken as well. I did not bring myself close to it to smell if the food seemed okay or not. After the two disappeared into our bedroom I stayed downstairs and attended to the guests.", "I do not think any of his reasons for a 'bad smell' constitute such lasting over a month and more as well as not being able to be extinguished\\* utilizing a bar of soap.\n\nedit: autocorrect", "Exactly, it is possible that someone just forget or simply couldn't afford to bring anything. If I have a bbq and ask people bring something I would never not let them in because they didn't bring anything, I can't imagine how embarrassed them guests would of been standing at her front door being denied entry over food. Her 4 hour party sounded shit I wouldn't be surprised if anyone goes to one of her afternoon short and sweet party's again.", "LOL. Her parties are “in no way formal” and “meant to be enjoyed through communication” Sounds like a blast.", "I like the ambiguity behind the thoughts concerning such an event.", "Because people are afraid they’d get thrown out", "But you have received some complaints?", "Is it because the procedure you have put in place for receiving complaints inevitably results in their rejection?", "You are inviting guests and then turning them away at the door. That's not something I would do with people I liked.", "There were not any drinks for kids besides water and the TV show chosen was not very child friendly, sex was shown. I would not have allowed my youngest nephew (8) to attend a party like this under any circumstances. It ending at 7:15 is simply so that I and my husband may go to bed on time. Most of the members involved were working adults and/or churchgoers.", "Yeah OP sounds insufferable, 22 and 30 as well, I bet his friends love her and her 'fun' parties. YTA", "At least it was done by 7.15pm so you could get to the after party… I’m guessing closing time was strictly enforced along with Id on the door!", "Your username suites you nicely.", "Lol \"conform to the rules of the party\"", "I’m just impressed anyone would choose to attend that “party.” You sound like a stuck up asshole hard core. YTA. No question about it.", "I'm confused. A chain email? Like one that you can forward to others? Or do you mean a group email?\n\nHow did you not know some of the people who turned up?", "You're quite young still, I think you were a bit rude on this occasion. Perhaps you need to mature which may come with experience", "Hopefully not for long. Your poor husband. Your username really suits you.", "The socially oblivious nerd from The Big Bang Theory.", "Your husband and Freddie spent the duration of the party in the bedroom?  Can you please repeat the question you are asking?  And Freddie smells like shit...", "This is even more confusing. \n\nYour husband and Freddie went into the MAsTER bedroom and spent the whole party there? So as not to disturb the guests? \n\nI thought you all were hosting the party together… Sequestering himself and Freddie is antisocial behaviour and very odd. \n\nUnless, does everyone think that Freddie smells bad also? \n\n👉🏽I think you are YTA for turning people away at the door, but this whole Freddie business is not okay and I think you are NTA for that part. \n\nIf you previously agreed to not invite someone and then your husband does AND takes him to your private and intimate space… this is no good and you and your husband have a communication problem.", "And that’s not going to get you into house parties. He needs therapy not to force guilt on people who have clean homes. People can disagree with me all they want via downvotes but if i showed up smelling like my own genitals and armpits they would come up with an excuse to get me out of there faster than i could ever get in a shower.", "Regarding Freddie, you and your husband need to learn how to communicate like adults.\n\nAlso, you dont seem like a gracious hostess. It may be the inexperience, but you really need to learn good manners: it is all about making the other person feel welcome, not to have an \"instagram\" party. You may be right about not letting the mother and the kid, but for the people without food, as other mentioned: you should have take note and not invite them the next time.", "Does the smell bother your husband?", "I doubt it. If they are against my rules or my party inconveniences them in some way they are free to create their own and not invite me. I will not show up.", "Yes, from people less fortunate to be in my knowing circle and Freddie, I suppose.", "But Freddie isn't 'people.' None of my guests were turned away, especially the ones I went through the trouble of inviting. The three I turned around who did not bring food were possibly referenced by another guest. And the woman was also another person I remain unfamiliar with.", "How do you not understand something that is written down and directly sent to you?  This is no different than being turned away to a party that says formal only and you show up in jeans and a t-shirt.", "Everyone was aware. If they were not aware they did not read the terms of the invitation. Everyone invited received an email that they were notified about in a timely manner. I made sure that I got that email out to everyone. I only turned away three guests without food and one with a child.", "A day drinking party with sex on the tv…for churchgoers lol.", "Must bear in mind the hosts 7.48 bedtime.", "Yes.", "Well, we did have a sizeable amount of guests who found no issues in their attendance.", "Maturity does come with experience. But I doubt I will loosen the rules on my parties. I do not find it rude that I refuse people who lack the reading for the general terms to my party. If you have a problem bringing food or abiding by the rules of the house; do not show up.", "I think her husband and Freddy have something going on, tbh. She said they both spent the whole party in her bedroom with the door closed.", "My mentioning about Freddie's uncleanliness managed to send the party into concern. A few spectators moved from place to place, never crossing paths. My husband does not have very many friends, Freddie being one of them, and him spending time alone with Freddie so that Freddie is not 'bullied' or 'outed' by any of our guests is entirely him. \n\nMaybe it is his way of protecting Freddie. I am unsure. They have only been around each other closely for a month or so. \n\nHis going behind my back on something like this is the first time and I wonder if there is more reason as to why he did so besides the two of them being friends.", "I do not know what 'Instagram' party means, but if it is a party with rules to be followed, then I understand. Although I may have this term incorrectly defined.", "I doubt it. I find this strange as well considering I would no longer continue to be near my husband if he smelled as Freddie does. It could be that Freddie brings him collectibles to stash on the shelves of our bedroom.", "I’m very happy to not know you in real life.", "Your 'knowing circle' wtf is that??!!", "YTA. You have an odd concept of hospitality.", "None of YOUR guests? Of course. Yta. \n\nAnd I’m surprised you have friends to invite", "Honestly, it’s super rude to have REFUSED but given how anal retentive OP sounds, i really question whether some people thought beverages could replace food or they missed that part of the email. If it was an evite a lot of times things are easy to miss. I missed a request to bring desserts to an event because I didn’t see it on the evite. I asked about bringing something a few days before and found out in time but I definitely didn’t see it on there.", "Well, they do make the best sinners.", "I did not choose the TV show. I do not watch TV. I noticed that there were sex scenes on an episode that the members enjoyed. I found it odd. But I mentioned 'and/or churchgoers' as a general rule. I know that some people enjoy their religious activities on Sundays. I would not know personally.", "You don't sound mature, just pretentious.", "Oh no.", "If you are the type of person not to read and follow rules. I am of the same mind.", "Close acquaintances and family members, of course.", "Why the woman with the kid and not the one SHE asked not to be there?", "I suppose so. But rules remain rules.", "I don't mean to be offensive, but are you on the autism spectrum?", "You know what always makes for a super fun party? Lots of rules.", "lmao you say \"of course\" as if \"knowing circle\" is a term people use. YTA, by the way.", "Then stop having parties. You’re no fun at all.", "Lots of rules make for a safer, more manageable party. Bring food, do not bring children, and do not enter the personal or unfinished areas of the house. Three specific rules do not seem befitting of the word 'lots.'", "If I am deemed not fun but my party seemed fun, what does that mean? I think I will continue to have parties.", "You forgot the rule about being clean enough for the queens approval.", "An unspoken one, I might add, that 99% of invited guests seem to have passed. It must not be very enforced.", "YTA, for many things already mentioned (inviting people and then turning MULTIPLE people away at the door, really?!)\n\nAlso, why were your husband and Freddie alone together in your bedroom for the entire duration of the “party”?", "Reading your comments, are you a robot?", "So let me get this straight: you hosted a party from 3:30 to 7:15 (oddly specific times), turned guests away at the door that didn’t bring an item to share, and then turned two other people away? Look, it’s annoying when people show up that don’t bring something to share. And it’s annoying when people bring kids when you didn’t invite them, but I can’t imagine as someone who hosts gatherings regularly telling those people to leave. Depending on the situation, I generally just don’t invite those folks again. Your husband’s friend sounds like someone I wouldn’t enjoy either, but it’s likely your husband invited him, and it’s incredibly rude to turn people away. YTA, OP.", "YTA for a few reasons\n\n1.  Your husband likes freddie, despite his flaws.  It's his party too, let him bring his friend.  You can just avoid freddie.  He probably dislikes some of your friends too, but he keeps his mouth shut.\n2. You're turning away people at the door for not bringing a dish? That's just weird.  I get that the invitation specified \"bring food\" and that these people didn't follow the rules, but turning away people at the door for not having a dish is just... not how normal people act.  Maybe the people who didn't bring food weren't planning to eat at all.  Your friends and neighbors are currently talking shit about you for this, I guarantee it.", "YTA, just generally. What was even the point of this no-fun, too many rules, weirdly timed event?", "Info: how long have Freddie and your husband been snuggle buddies?", "YTA for sure. Your only \"reason\" for not liking Freddie is his smell. Greet him, pretend you're glad to see him, thank him for the food and gift and mingle. Go elsewhere. You have more guests you can talk to. But preventing him to enter the door? wtf. If I was Freddie, I would leave and stop being friends with your husband. Because of your behaviour.", "Very Captain Holt of you to throw this kind of party and using email as the way to invite people, lol.\n\nYTA", "Wow. \n\nI mean… wow.\n\nYTA", "Yta.", "YTA! I get turning someone away that brought their child, but the people who didn’t bring a dish? Seriously?? And, it sounds like Freddie behaved himself. And, his personal hygiene…ever think that he may have a medical issue? Still, you’re a b**tch for even thinking that you’re entitled to “muster the courage to ask him about the smell”. You sound insufferable!", "YTA got turning anyone away from your party (possible exception for woman with child if there were “adult” things going on). If someone showed up without a dish- hey it happens and it’s sometimes because they couldn’t provide one. It puts your husband in a very sticky situation to invite all his coworkers with the exception of one he’s actually friends with. There are plenty of people I’m not fond of and would rather not spend time with but I have enough class to be able to deal with them for a 3 hour period with lots of other people around", "YTA \n\nAsks if she's TA and then can't take any criticism. Yikes. Look at what everyone is saying and get it thru that thick ass head of yours.", "YTA you turned away people for not bringing food? It sounds like there should be plenty of food if enough other people brought some and you provided some as well, at that point people are basically paying an entrance fee for your party. Also if Freddie didn't come but found out, how much would that have hurt his friendship with your husband? Doesn't sound very fair that he'd have to deal with that. You say he smells 'off' but paint smell and BO smell are definitely different, if he smells like paint, well some people just smell 'off'.", "\nI’m glad you invited your husband to your party. He must not have had a plus one on his invitation. \n\nYTA", "YTA. I’ve never ever had to post “rules” with an invitation. You seem to be TA all the way around.", "ESH a little imo (unpopular opinion)\n\nYou - for turning away people at the door. That is rude and disrespectful. Maybe they couldn't bring things or something like that. The mom you should have said what was going on and said it was not an environment for kids.\n\nYour husband- for agreeing and then blindsiding you. If he wanted his friend there that bad he should have said something. Also, he should talk to his friend if he smells that bad.", "Oh YTA for sure except for kicking out the kid. No kids means no kids but the same can't be said about food. I often get invited to house parties and rarely go if there are follow up emails with the rules listed therein. You are 22 so I'll acquit you of ill intent but you need to brush up on informal party planning.  Relax a !little on the rules and regulations. This isn't the military.", "YTA, God.", "YTA.  And rude and an ungracious host.  You turned other people away too?  WTH.  How embarrassing.  Especially if they're coworkers of yours or your husband.  WTF is wrong with you?", "EHS. The husband for inviting a guy she specifically didn't want. Fred for being unhygienic. She for turning away people who didn't bring food, the kid I can understand. Thing is, nobody ever brings just enough for themselves, there will always be some excess to be shared. Some may not want to eat at that time, for whatever reason, so didn't bring any.", "You have to list rules in an email to keep people from going through your bedroom and attic? Not sure if this says more about you or the company you keep.\n\nAlso, turning people away at the door? Seriously?\n\nYTA.", "You sound like a blast.  YTA", "INFO: What happens to all the leftover food?", "I absolutely detest people that do not understand the importance of personal hygiene. I work with a few people who refuse to wear deodorant, one guy smokes clove cigarettes like a chimney and doesn't wash his clothes or shower. We work in a warehouse in Florida... It's just gross!!!", "Thank you for not inviting me. YTA", "YTA. You sound insufferable. I’ve never in my 40 years on this planet been to a house party with so many rules and restrictions", "YTA you're a real literal rule follower aren't you. Quite the quirky individual. Unfortunately society has certain unspoken rules like not turning people away who don't bring food over etc.", "YTA - 1. not for having rules but for having arbitrary rules. It seems like most of these comments understand you turning away the woman with the child because there's a reason behind it. But showing up without food just seems like a control issue, info: was there not enough food?\n2. It would be one thing to turn away Freddie if he hadn't been invited, but he was, just not by you. In his mind he didn't do anything wrong. Your issue was with your husband not with Freddie but he was the one who you made feel uncomfortable.", "So you turned ppl at the door because they didn’t have food? What a host you are!\n\nYTA", "YTA. You are trying so hard to seem likea mature adult, but your immaturity is screaming loudly through this post.\n\nAlcohol at an adult party does not mean kids can’t be there when the adults respect their limits. Was this expected to be a wild frat party?\n\n A potluck ends up with so much food that you do not need to turn away guests at the door who didn’t know. A mature adult welcomes them graciously and tells them to make themselves comfortable.\n\nIt’s odd to explicitly tell grown adults to stay out of your bedroom unless this was a frat party with people sneaking off to hook up.\n\nWhat is the maturity level of the people you know?\n\nAt 30, if I received a party invitation telling me to be on my best behavior—like mom telling me when I was six going to a birthday party—I would definitely pass because I just…am?\n\nIf your friends are still a bunch of hard partying college students that don’t know the expectations of an adult party, this whole thing sounds like bad play pretend\n\nYTA", "YTA", "You made it sound like this was you and your husband throwing a party.  But then you list out several rules that you, not your husband, want enforced.  Did your husband agree that these rules were reasonable and should be enforced?  Or did he agree in the sense that they were good guidelines to ask guests to consider, but he didn't expect you to strictly enforce them?  It might be a good idea for you two to have a discussion about how literally you are speaking, to make sure you are communicating better going forward.\n\nBased on the information provided, YTA.  \nI would say that it was unfair of you to ask your husband to not invite his friend.  He could have medical issues, or financial issues that make him smell unpleasant, or he may just be unclean, but denying him entry is not the appropriate way to handle it.  \n\nYour husband sucks because he agreed to not invite his friend but did anyway. He should have pushed the issue with you when it came up originally instead of sneaking around you and causing his friend embarrassment as a result.\n\nYour way of handling the party rules sounds very strange to me, but if it's working for you and your friends that's what matters. Just know that most people don't expect to be denied entry into a party for something as minor is not bringing a dish of food to pass. Sometimes they're broke, sometimes they're busy, sometimes they're just lazy but when it's a party of the size you're talking, one missing dish is not going to leave anyone starving. \n\nI think someone else said it in the comments, just don't invite that person next time.", "NTA, you told your husband not to invite him. I wouldn’t want someone at my house party that you can smell before you see.\nAll the people saying you’re the ah because how you run your party are missing the specific question asked.", "YTA for virtually every part of everything you said, from turning people away to trying to keep your husband’s friend out who followed your shitty rules, to the exact time of your party. Did you kick everyone out at 7:15 and insist on keeping their Tupperware too?", "Am I alone in finding this the most bizarre thing I’ve heard lol. What even is this? Every detail is weirder than the last. I hesitate to give a judgment because I feel like you might be from an alternate universe where all the rules are different. \n\nWhy is a simple house party so bizarrely structured and have so many specific “rules”? Why are you having a party in the first place? What is this???", "YTA.   The way you set those absolute rules for a party is evidence that you’re a narcissist with a controlling personality.   Honestly, that behavior is repugnant. You need help.", "OP, could you provide a bit of context about turning people away? I know you wrote that they were sent off for refusing to bring food etc, however I'm confused - was bringing food the entry requirement? I mean if I'm doing a drive-by to a party, even a potluck, I'll pop in, do the rounds, then head off. \n\nRight now, given the way you've related it, there's a small bit of a YTA vibe going on. \n\nFrom the sounds of it, it was a big party, I'm not sure barring people entry was the best course of action. However at the same time I'm going to go out on a limb and assume this might have been your first big party as a married partner and you wanted everything to be perfect. \n\nPerhaps you and your husband might want to sit down and talk, and really understand why certain decisions and actions were taken, and what went right, and what went wrong. \n\nThere's room for improvement, but throwing a big party can do anyone's head in. \n\nGood luck going forward, I think there's some learning to do, and some serious communication between yourself and your husband.", "My goodness lady you’re very pretentious … get over yourself … your poor husband by the time you’re done he’s not going to have any friends .", "YTA I'm surprise there's still people wanting to still go to your parties after you turn away so many people.", "Those are not typical house party rules and that was way too many rules to be considered informal. Is your name Sheldon Cooper?", "Wow, I would’ve thought I was reading something from a crotchety old lady- not a 22 yr old! What a judgemetal stiff", "Eww grow up YTA", "YTA for how you handled the whole situation. And your party sounds insanely boring", "YTA. Well, this is my own fault. I've seen inside OP's mind, and now I have to recover. This was advertised as a neighborhood party. \"The rules were simple and strictly enforced\". You sound cold, petty, and cruel. This is enough internet for me for today.", "This sounds like the worst party in the history of parties.  The Donner Party was more fun than this.  YTA just for this terrible party.", "give her a few years and she'll be posting \"AITA for thinking I should be an exception to bringing my angel spirited (i.e devil spawn) to an adult only party?\"", "This is a robot, right?", "YTA. Turning away the person with the child is fine, but denying someone cause they didn’t bring food seems insane to me 🤷🏻‍♀️", "This is appalling…", "ESH", "YTA and not just for this specific scenario but in general. Every word dripped with AH-ness.", "Did Jan Levinson write this because it sounds awfully familiar…", "Your husband is AH for telling you he wouldn’t invite Freddie and then secretly doing it anyway. But also, YTA for turning away guests *at your door* for not bringing food. That is possibly the most inhospitable thing I’ve ever heard of. If it bothers you, just don’t invite them next time. By rudely turning them away at the door, you have badly embarrassed those people and likely alienated them for life. Is it worth it?\n\nAnd it’s not Freddie’s fault that your husband invited him without your knowledge or approval. Embarrassing and punishing him for your husband’s poor behavior would be cruel.\n\nAlso, average people have enough manners not to go exploring in a party host’s attic or bedroom without being told. Telling them that was off limits in your invitation is strange and condescending.\n\nIt sounds as if you’re not ready to host parties at this time.", "Wow. Surprised anyone would want to come to your party. YTA.", "ESH. You, for turning people away just because they didn't bring food. \n\nYour husband, for inviting the one single person you asked him not to invite.\n\nFreddie, for not taking a shower before coming to a party.", "YTA. \n\nYou sound like a child desperately wanting to be seen as an adult. P.S. no on wants to go to the parties for you.", "YTA, you don’t have a party in the afternoon-early evening and not allow kids, that is just inconsiderate, that is family times.  \n\nNot welcoming a guest who did not being food?  Bad hostess you are!", "‘Myself’ threw a house party? And the food ‘myself’ prepared? Learn pronoun usage please.", "YTA. Why is this man still married to you? You sound unbearable.", " YTA and a really uptight, insufferable one. BTW, I get not wanting Freddy around, but turning people away for not bringing food…you couldn’t be lenient?   Your poor husband", "YTA for throwing a shitty party.", "Drugs are ok but BO isn't? I bet you're just so much fun at every party. \"You didn't bring a dish? No food for you asshole!\" \"I can smell you, go away!\"\n\nI get the no kids thing but you just sound exhausting \"typical house party rules\", huh? Never have I had someone send out rules for a glorified pot luck, much less a 4 hour one \n\nYTA", "ESH - You for LITERALLY everything in your post and your husband for marrying a 22 y/o. That gives me the massive icks.", "Not only are YTA, but you're also the world's worst hostess ever.", "My ukrainian ancestors would be haunting me after something like that. We usually don't let our guests bring anything other than drinks. We make sure everyone eats and also make sure that guests take some food home with them", "My grandma used to say if more people than invited showed up you just le echas más agua a los frijoles we add more water to the beans and obviously no such thing as ending time and no kids because of alcohol, lol.", "Ditto here in New England. The old timers drilled it into us all to make sure there is plenty of food, even at a pot luck. That way every one can eat and there's left overs for people to bring home", "I’d rather spend an evening at Guantanamo than at one of her “parties”", "OP is definitely the AH here but having worked with a dude who never bathed and absolutely stank as a result of it I am sympathetic to the issue. \n\nProblem is that it was handled ridiculously poorly.", "I suspect people turn up to see the husband not OP. She sounds awful", "What does 'the leastess' mean?", "And watching TV? How is that a party?", "Your party has more rules than prison. No thank you.", "“Typical house party rules,” border security protocols…. \n\nPeople bringing kids, I’ll allow - potential liability issues there especially if the parent assumes that in a house full of adults “someone” will have an eye on them.  But not bringing a dish?  There are people who might not want or be able to eat what others have provided, but when everyone is expected to bring something, there is always way more food than gets eaten.  Just so needlessly extreme.\n\nOP, YTA for thinking this situation you created can be called “typical.”  I suspect a lot of people will be discussing how nutters that whole thing was for some time.", "Another exhausting person on Reddit. How do these people keep up with all this silliness?", "Yes, YTA OP. Turning away people at the door because they didn’t bring food????? What???? And turning away your husbands friend? No", "I'll agree that turning people away at the door is Ashish, though at the same time it's not fair for everyone else to have to bring something for the potluck and have those people come without doing so, and from what I've read the invitations did state that bringing something to the potluck was required. I probably would have just let it slide that time but made a note of who they were and to insist on them actually doing so the next time and turning them away if they tried the same stunt again. Once can be a mistake but twice is a pattern after all. \n\nTurning away the lady with her kid is totally justified I think though. It's an explicitly stated adult only party, even if they were allowed to stay what was that kid going to even do? Most of the adults aren't going to want to chat with some random kid they don't know, and no one should have to tone down what they say or do just because one person decided to drag their kid along to an adult party.\n\nLastly we have the friend which is more tricky, but basic hygiene shouldn't have to be requested. I guess it just depends on how bad/intense the supposed smell actually is. If it's just a weird smell or you only notice it if you are in each other's personal space then whatever, but if it's a really strong smell or BO and you can smell it from a few feet away then that's just gross. I for one would hate to have to be in an enclosed space (or be forced to leave the room) just because some dude refuses to shower. If it were my party and someone showed up smelling of strong BO then I would either tell them to go take a shower and come back, or if I knew/trusted them well enough allow them to use my shower.", "I doubt it. OP is trying so hard to sound like a nose in the air bigwig,using her big girl words that it has to be real. AI wouldn’t sound so horrible and would use the right words and correct sentence structure.", "Non married men and women must stand 3 feet apart /s", "Her username is fitting", "That would be Amy Farah Fowler, and she's a hoot.", "Yes, four people were turned away at the door. Three did not bring food to share. One woman brought along her child. I believe that my husband and Freddie were exchanging gifts and engaging in another session of DnD. I am unfamiliar with the concept but I believe it involves roleplay, wizards, dragons, and fable tales.", "A hygiene problem can be solved easily with soap. This has been more than a month now of him smelling as if he does not know what cleanliness is. I believe he is only lazy or possess a mental/physical disability that disallows him to care.", "What is shake and bake? I am unfamiliar with this term and it is the first time I have heard of it. I hope you are not meaning drugs. Ah, but your advice is largely appreciated. Although, I did not invite the four I turned away. I did not know their names or faces. Some users have told me that they were possibly forwarded the email, of which I believe I have no control over. My invited guests understood well the rules.", "I do not believe my husband is tethered to me. That is a good thing, I desire my individuality.", "Yes, it was probably not so good an idea to let him move into my mother's house last year. I inherited the home and we moved fast. While I do not believe that we must divorce, I will uphold that perhaps keeping to separate residentials may have been nicer.", "The food is not to be given to me explicitly. A potluck involves the sharing of a dish brought with all guests. I also maintained that everyone take what may have been left over of their dish home with them so that they did not misplace their dishes in our home.", "No, I did not directly invite them. I did not know the names of either of the four that showed up to be turned away. I will also add that I did not enforce rules highlighting that people other than those I directly invited could not come. If an email was forwarded to another unknown member, as there may have been, I do not mind. I only ask that they read the terms for attending. Most of them did save for those four.", "I did not find the event to weirdly timed. And I do not find three rules to be 'too many.' But I will add that the party was very fun for the guests that attended, at least, they did not leave.", "Snuggle buddies? Ahaha, that sounds very funny to me. They have known each other for about a month now.", "Yes. They, being three people, did not bring food. I refused them at the door.", "I believe many enjoyed the party. So far, I have received four thank you emails, but such practices are not customary.", "Not often? So you *have* received complaints?", "Bet you don't have many returning guests though.  I feel like your parties are full of \"acquaintances\".", "Yasssss. In my Hispanic culture, we feed everyone.  Bring the drinks.", "My country is now full of ukrainian people and they are a great example of people giving everything while having nothing.\nI can’t imagine turning away a guest like this, it sounds so transactional. Like, ok, it’s nice when guests bring something, but it shouldn’t be expected.", "INFO do people actually want to come to parties with all of these not standard party rules?", "I was thinking about that too.", "'Only' managing to turn 4 people away from your party is not the brag you think it is.", "Bro its a party, not a business meeting, chill out. I can't imagine turning people away for not bringing food like holy cow, I'm sure there was still plenty no need to have a stick up your ass about 3 people not bringing food.\n\nAlso, you ever think that maybe Freddie is struggling and can't shower? I would be more concerned about his health and seeing if he needs some help, all you care about is how it's gonna stink up your house? Like wtf, that's cold.\n\nYTA.", "It's the opposite of mostess, duh.", "It’s a play on words, twisting the meaning of the well-known expression “the hostess with the mostess” (most+ess), meaning best, outstanding, superb, etc.  You can probably figure out what leastess means by contrast.", "They're annoyed with your comment b/c by definition that's what parties are about--enjoying communication (sometimes called talking). Also, you came to ask AITA and you're being told you are one for multiple reasons. Why ask if you don't want to hear the responses?", "I can't help but wonder how the people that stayed past 7:15 were treated.", "Sounds exactly like how I would expect a party thrown by a 22yo married to a 30yo would go....  I certainly would have declined the rsvp had I been invited and stayed at home with my own snacks and watch the drama unfold over sm lol", "I quite enjoy communication", "Right?! Is this a party or detention?!", "It doesn’t even sound like a “party” it sounds like a ritual Lmao", "I would have read the email and laughed and had my own side party same date and time", "amen to that", "Wait until the next time, she’ll be charging an entry fee. YTA", "All of my parties follow much of the same guidelines, only this is the only party Freddie was invited to. It is very typical for me.", "Lol, definitely this. OP is just that asshole for their general behavior/attitude. OP husband is definitely an asshole because he didn’t respect, listen to his wife, and lied to her about not inviting smelly friend Freddie. The two assholes deserve each other.", "..Is this a party or a school assembly?", "Ouch, what a burn!", "I am not AI generated, I promise. The party was very real and so is Freddie, who's real name I cannot disclose. If I am hard to understand at all, I do not happen to notice. It is my general speech.", "See, I’m getting 60 year old bunker escapee.  The fixation with a sort of etiquette, while untethered from reality", "Amy at least had some self awareness.", "I’m sorry.\n\nYou expect us to believe the co-host of the three hour and forty five minute gala disappeared to the bedroom for the entirety of the event? Cmon now.\n\nEDIT to add: You do understand that the omission of this in the opening post is inconceivable, right? That you’d post about a funny smelling guy showing up, but not your SO disappearing from the entire event he’s co-hosting as a result?", "Wow it's tough to find out your husband cheated on you at your way supper fun rules party with the stinky guy.", "Lol your party was so shit he invited him to have an excuse to hide away 😂", "I think you meant “obtain” the position. Ascertain mean to figure something out.", "Did you swallow a thesaurus?", "\"exchanging gifts\" - i can imagine what kind of gifts they exchanged", "Why does OP write like an alien?\n\nI think this is AI generated.", "Shake and bake is a term for portable meth lab, usually in the trunk of the car, \"cooking\" as you go down the road.", "Why you even married is beyond me…", "Not even 4 hours.  3 hours 45 minutes.  WTF.", "WTF does this even MEAN?", "Don't forget watching tv! So much fun at a party!", "This is an insane thing to say", "I do not believe so. If there are complaints, I am by no means going to deny you from voicing them, just as I am prone to retaliate should I feel the need to--much similar to Freddie v. Myself in our doorway. On the other hand, neither guest is forced to attend. They are free to leave at any time.", "Funny, I was thinking in Mexico if this happened one of the neighbours would start another party for ‘the rejects’.", "Yeah, it's the same for big Italian families. \"Oh you didn't bring food... Thank God because we need more people to eat this mountain of food fit to feed an army. Also do don't eat enough, you are skin and bones\".", "She invited as many as she could because people have attended these shit parties in the past and no  longer actually attend. She throws a wide net but only catches the random few who aren’t aware of what her idea of fun is. \nPretty soon no one will attend…..\n\nI also have to wonder if she has to host the parties because no one else invites her to any.", "Im mortified that she turned away people who didn’t bring food.", "There's always soooo much food at a potluck... it's never a big deal when some people forget. Repeatedly might mean they aren't invited next time, but never turned away at the time.", "Who the fuck, can shut down an active group at promptly 7:15!?", "Fuck a sex party? Now the \"no food items, no entry\" rule makes sense. No whip cream, no boom boom, you leave now.", "For real, most people rarely - if ever - turn away invited guests at the door, especially for petty reasons like showing up empty-handed. Emily Post is rolling in her grave.", "Yes, 'only.' I do not consider it a brag more an accomplishment. Four out of quite the many people I had invited that were welcome to enjoy the festivities were refused at the door. The ratio of attendees' vs the unwelcome leaned largely in my favor. I had a wonderful time.", "It is an email link that can be forwarded, yes. I did not mind forwarding as long as the forwards went to people who possessed eyes that could read and minds that could comprehend. I do not know what else it might be called. Some of the guests were not directly invited, i.e. I did not know them by name nor recognize their faces. Only four of those people were refused at the door.", "I love how the party lasted exactly 3 hours 45 minutes. How did she lick everyone out exactly on time? Maybe she had a timer or something", "Insufferable yes, but I will say I'm 30 and fiancee is 22 but my friends likes her more than me", "They were shoved out the door of course", "They continued to communicate and ate until their heart's content. After a while, they dwindled down to a minimum and the party officially came to an end around 8:40 - 8:55 P.M.", "Ah, yes, we do have quite the age gap. I have never found it weird though.", "I do as well.", "Your detention sounds different from mine. I do not believe any children of today would enjoy detention. My old schoolhouse's detention involved sitting in the corner for a time and being alone.", "A ritual for what?", "Esp with the two dudes upstairs in the bedroom, a no go zone (assuming, I don’t have a copy of the party map).", "I doubt you would have expected less. You would be used to my parties by now. I have held three and my mother has held two in the same regard within the past.", "I will not. My wedding had an entry fee. I do not see a reason to further incite a charge.", "I would NEVER go to your parties.  I can't believe anyone wants to go to them.  They must not know you very well.", "Yeah, read your user name and read it again then read it again and realize you’re the asshole", "How long have you been married and old were you when you met your husband?\n\nYTA for turning people away for not bringing a dish and for your general attitude", "It’s detention….", "Oh, I do not watch TV. I am unfamiliar with most TV tropes. He sounds funny.", "Just connecting the dots here…", "Yes, that sounds more correct to me. Thank you for appointing the appropriate word. Often do I use ascertain in its stead.", "Did I swallow a thesaurus? I believe this is a joke you are making, and I would love to hear the next part. I am assuming it works similar to 'knock knock'", "So you're not just an AH, you're a pretentious AH at that.", "You retaliate? What? Wow, you think very highly of yourself.", "“The rejects” party always ends up being way better anyways.  Especially if OP is hosting the original party…", "So you’re saying the people you turned away, other than Freddie, were people you never invited to begin with, but random people who the people you *did* invite told to come over? So they’re strangers you didn’t okay to be invited to your house? If so, I think you need to clarify in the post that these were not invited guests that you turned away, but rather random people invited by others.\n\nAs far as Freddie goes, your husband clearly ignored your request and invited him anyway. At that point, if it really was an issue to you, you should have taken it up with your husband later rather than making an issue if it when Freddie was there.", "And how she casually mentioned it as an aside. As if that is just standard normal human behaviour.", "Remember the story of how Jesus turned away those without food.....lol", "Probably Catholic", "Not prompt. I always plan my parties to end earlier than when I must divert my attention to another cause. If I were to set a time for 9 P.M., I would expect the attendees to have deserted before 11 P.M.", "9 P.M. is better for me. The time is only so that the partygoers will certainly have deserted before my 9 P.M. bedtime.", "A party that obscene would not mesh well with the furniture. I do love my couch.", "The fact that there is a ratio at all is the problem. Sounds like HS bs.", "Ok. I see. You know, I find this very strange. I would never invite randoms to my house. Maybe it's a thing in your area. In my city that would be a very bad idea. And, like, how do you control who gets your email address and home address? \n\nSeems kinda risky to me. \n\n..but now I understand the turning people away policy. Makes sense.", "So you didn't have a party with \"friends\" you basically sent out open invitations over email to strangers, and the one person your husband knew wasn't allowed in.", "I can only assume that you’ve been victim to a typo, but oh what a typo it was!", "Is English your first language?", "You sound defensive, snobby, and mean cloaked in frilly language, all at once", "They do. I only invited close friends, family members, and my favorite coworkers. It is okay if you do not attend, you are entitled to your activities.", "I was married officially last year. We were fiancé's for a while though. I believe I was 19.", "He doesn't intend to be. He takes himself too seriously.", "They mean you're using weird words for no apparent reason. Why utilizing rather than using? It's like you're trying to sound smart but sound like a robot/recently arrived alien instead. Is it something you do because you think it makes you sound mature and smart to your husband who's had almost an extra decade to learn words?", "No. They are having sex.\n\nSilly goose", "Might want to prepare yourself for your husband leaving you and your boring school assemblies (sorry, sorry ....parties) for Freddie. If he start decorating a room in the house for him, you may as well just move out. You've been replaced.", "This thing you’re doing where you pretend to not understand any of the poo culture references is not doing you any favors. I really don’t watch a lot of tv (<1 hr a week) but I still know who Sheldon cooper is and what an insta party is. \n\nAnd stop trying to sound pretentious. Your sentence structure is… unusual… to the point it makes no sense and half of the time it reads as if you used a thesaurus incorrectly. \n\nAs one “fast forwards”. Not “flash forwards”", "I doubt she has more than 4 or 5 people who routinely come to her events, and I'm sure they are all as much fun as she is.", "I do have friends to invite, and they were here for the party same as they have been for my other such plans. They are very supportive and kind. I would not have it any other way.", "So she's basically turning away her husband's guest.", "Absolutely false. They lie to themselves that they do, but they're so new to justified guilt that a pg13 movie is inappropriate for kids", "You said members?!? Are you running a sex club from your home?", "You are 22, partner older.\n\nLikely, it’s a family party & weren’t having your petulant behavior … be mess & so it is", "Good point. Maybe a tarp to cover the furniture? I know, I know it looks tacky but you can cover the tarp with a stylish blanket or a quilt. Just spitballing here.", "She sounds like a kid trying to fit in with the grownups.\n\nYTA OP, and a terrible host.", "Knowing the word 'pretentious,' I do not find it necessary to impress my guests with such offhand reflections of higher standards; however, I do believe in upholding rules as a general consensus of a safe and manageable party within a personal environment. According to another user, I am also not mature at 22. I would assume you are of the same mind as well.", "Sweetie, they spent the entire “party” alone in your bedroom.", "I assure you that I am not pretending. I do not know what any of those references mean. I only found out today who Sheldon Cooper is supposed to be but I do not watch TV. I have never watched TV, and I do not find the concept hard at all to understand. I also do not own Instagram. I know it as an app and media platform. I do not know what an 'Instagram party' may be. As an aside, a flashforward is from a narrator's standpoint as a flash toward the future or timeskip ahead, if you would, it is similar to a flashback only forward. It is a word. I know it to be.", "Flash forward is a thing", "> rules remain rules\n\nOP, this is the mindset that a lot of posters have. Rules, being honest, and being right are separate from being an AH. You can follow all the rules and still be an AH. So, while turning people away at the door for not following rules is fair and just, it is still an AH thing to do. \n\nYou wanted to know if you were an AH, which you were. Were you “justified” in some of your behaviors like turning people away from the door and not inviting a “smelly” person? Also yes. Still and AH.", "You 100% meant to be offensive idk why you're lying. It's reddit, no ones going to get you.", "I do not believe my mental health would need to be discussed over the choice of a house party. If I am on this spectrum, I remain unsure.", "This sub is for casting righteous condemnation, if you post, people will respond. You sound like you are filtering your sentences through a thesaurus, so the wording comes off pretentious. You are correct as well, my explanation could be seen as pretentious.", "The event comes as no surprise to me. My husband likes spending time with Freddie; but I doubt he would be interested in such uncleanliness. He does keep himself very well managed. If he did not, we would never have married.", "I was chalking this up to English not being her first language.", "I suppose you might be bothered to understand what I mean or possibly draw strings to understand. Both work, of course.", "I really didn't, youre reading into it.", "I'd suggest going to a therapist/psychiatrist if you have the option to. It could greatly increase your quality of life if you are on the spectrum.", "Autism isn't a mental illness", "Agreed. Seems like we’re chatting with a robot. Who speaks like this?!", "Girl.... you are so young and naive. You would be aghast at what some people are into. 😩", "Letting people consume alcohol and drugs at a party on your property and then them driving after does not seem safe.", "Same. That's the only way a lot of this makes sense to me.", "You think your party seemed fun lmao. I think you'll see a drastic drop in your RSVP future", "I guess your party was fun DESPITE you and your behaviour then, hopefully everyone else mingled well enough to look over your appalling actions (turning people away at the door!!?)", "A 22 year old dating someone a decade older operating under delusions that she's hosting a gala", "I doubt so, considering I had very many returnees this time around in both family and friends. Most of the coworkers were new considering the move, but I am happy that many of them enjoyed my hosting. I have hosted three parties in my lifetime. My mother hosted our wedding party and a wonderful gala sometime after that a year ago."]}