{"id": 13263, "submission_id": "122ye39", "title": "AITA for cancelling my GF’s tattoo appointment.", "selftext": "My GF has OCD- one symptom she experiences is her doing everything in 5s. \n\nHer Mother passed away in March of 2018. \n\nMy GF goes to Therapy, and in January of this year when she bought up getting a tattoo for the 5th anniversary of her Mother’s death, I suggested she talked about it with her therapist. After doing so, she said that her therapist also didn’t think it was a good idea, as she believed that the drive behind her wanting to get the tattoo was her OCD, rather than the actual WANT of getting it. \n\nHowever, my GF still went ahead and booked the appointment. After talking with a couple friends about it, they all agreed that it wasn’t a good idea to make such a permanent decision which has purely been fuelled by her OCD. \n\nIf she had somewhat recovered from her OCD, I wouldn’t be so hesitant. However, she hasn’t made any progress. \n\nI emailed the tattooist (we have each other’s passwords) and cancelled her appointment. I told her an hour before her appointment that it had been cancelled, and as she had booked the last slot for the day, she was unable to get it done. \n\nI knew she was going to be upset, but I didn’t really realise HOW upset she was going to be. It’s been a couple of weeks, and it’s honestly crazy how she’s reacted to it, but I am more than certain (and so are our friends) that in the future once she recovers from her OCD, she will be really grateful. It’s clear that it was OCD influenced, as it has flared up a bit because of it- and she’s aware of that too- and has described it as making her physically sick when she thinks about the fact she’ll never be able to get a tattoo on the 5th year anniversary. \n\nSo AITA?", "created_utc": 1679862325, "permalink": "/r/AmItheAsshole/comments/122ye39/aita_for_cancelling_my_gfs_tattoo_appointment/", "score": 59, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I cancelled my GF’s tattoo appointment without her permission. She hasn’t forgiven since doing it, and although her tattoo decision was influenced by her OCD, maybe I should’ve just left it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">I emailed the tattooist (we have each other’s passwords) and cancelled her appointment. I told her an hour before her appointment that it had been cancelled, and as she had booked the last slot for the day, she was unable to get it done.\n\nAnd that's where you crossed the line. You're allowed to be concerned for her. You're allowed to discourage her from doing something you think she might regret. You're OK for even flat-out telling her it would be a mistake.\n\nYou are ***NOT*** ok making decisions for her. She is a grown adult, and no matter the reason can get a tattoo. You are her partner, not her father. Cancelling her appointment without her consent was beyond inappropriate. But you didn't even do that. You broke into her email and pretended to be her.\n\nYou are not helping her, no matter what your intentions are, by controlling her life. YTA.", "YTA \n\nYou’re infantilising your girlfriend. She’s capable of making decisions about what she does with her own body and it was 100% out of line for you to cancel her appointment", "YTA. You don’t “recover” from OCD. You learn to manage it. It’s not chlamydia or tonsillitis. You don’t just pop a pill and it goes away. \n\nSo she can never get a tattoo on a significant date then? Because if you’re waiting for her to recover, you’re going to be waiting a long time. She’s her own person. She’s an adult. It’s her body. If it’s a mistake, it’s hers to make.", "YTA\n\nJesus Christ, it's a tattoo to commemorate her mother. Even if the timing was more for her OCD than her mother, so what? \n\nYou don't even sound like you understood how much this would impact her, much less have a plan in place to help her cope. \n\nAt least she'll have no trouble getting a 5 year anniversary tattoo of your breakup.", "YTA for 5 reasons. It’s her body. It’s her body. It’s her body. It’s her body. It’s her body.", "YTA it's not your body and your brain and honestly none of your business, this was for her mother, and tattoos can be covered or removed if needed this was a serious breach of her privacy and you'll be lucky if you even have a girlfriend here soon, because most people would break up with you for this.", "YTA \nSince you mentioned you have each other’s passwords I’m taking that to mean you signed into your gf’s email account and pretended to be her to contact the tattoo artist and cancel. You have no right to pretend to be someone else and cancel their appointments just because you don’t like their choices. She can make her own decisions.", "YTA because you, her therapist, and her friends already voiced your worries to her. It’s still her decision to make.", "YTA. \n\nYour girlfriend is an adult. That means she can get a tattoo for any reason at any time. She doesn't need your permission. She doesn't need protection from getting a tattoo. Even if she regrets the tattoo later. The fact that you call her reaction to you controlling her \"crazy\" says a lot about her need to end her relationship with you.", "YTA. How dare you make that decision for your girlfriend and cancel her appointment. It was controlling af and she should break up with you.", "Yes, YTA, and what you did is potentially dangerous. I’m a retired therapist. OCD as a disorder can involve severe amounts of anxiety, and one’s compulsions help to manage that anxiety. Preventing someone from engaging in compulsions is not at all recommended as an evidence based treatment, without having done the work to replace those compulsions in how a client manages their emotions, stresses, and anxieties. You’re not a doctor, a therapist, or a mental health professional. You should never interfere in someone’s treatment, which is what you did.\n\nEdited to add: there are unskilled therapists out there, and there are skilled therapists who are wrong. You took one therapist’s opinion, and the opinions of a handful of untrained, uneducated peers to make this decision to take away your GF’s power over her own life. Additionally, a central tenet of therapy assist clients in making their own decisions in as healthy a manner as possible, except in the case where there is a specific and genuine risk of significant harm to the client or someone else. This situation absolutely did not meet that criteria. If your Gf’s therapist had done what you did, a formal complaint could be made against her to the board, and action might be taken against her. Please *do not* interfere with someone’s treatment for medical conditions.", "YTA. That's an incredible abuse of having her password. It wasn't your decision to make for her. Maybe the tattoo was more driven by her OCD, yet it was still something that meant something to her and you have robbed her of that. I'm surprised you're not an ex by now.", "YTA she should dump your ass at 5:55 and be done with you", "YTA\n\nSo you think telling her she's not allowed to do anything that you, her therapist, and your friends aren't enthusiastic about is going to help her mental health?\n\nYour response to her OCD is just to manage her life and decisions for her?\n\nAstonishingly disrespectful.", "YTA. I get what you are trying to do but you are unqualified to actually help her management of OCD. The therapist is qualified. The therapist told her she didn’t agree with it but allowed your GF to have her autonomy. It’s like telling someone with depression you told them the wrong time for a friend’s funeral because you didn’t want them to be sad. Your actions didn’t alter the mental illness, you just spiked her anger and sadness", "I don’t really see how getting a tattoo for her passed mother could ever be a “mistake”", "INFO: among other lines you crossed, why are you having in-depth conversations about her mental health with your friends? Is she aware that you’re all discussing her OCD and making group decisions for her behind her back?", "YTA. You need to learn about OCD. You don’t recover, you manage it and nobody else can manage it for you. Her response is in line with her OCD. You can’t expect her to respond the same way you would. You’re not helping.", "\n\nHuge AH\n\nI don't think waiting 5 years could be considered impulsive.", "YTA\n\nDon’t infantilize your significant other. That’s gross and weird.", "YTA. Your girlfriend is an adult. OCD may impact her decisions, but they are still HER decisions to make. You had no right to do this.", "YTA\n\nIt’s her choice (and possibly mistake) to make, not yours.", "YTA. It’s not your job to police her OCD. It’s hers and her therapist’s. You were out of line.", "YTA - is this even a real question? You impersonated your GF online to cancel an appointment she really wanted because you think you know how to live her life better than she does. That’s not caring, that’s controlling. I hope she gets free of you soon.", "YTA, if she had OCD or not, she’s not your child and she’s still allowed to make decisions regardless of her mental illness. It’s not a big deal either, it’s just a tattoo… it’s not like she was going to do something really drastic. Even if so, still her decision to make", "YTA you removed her autonomy.  Whether it was fueled by her OCD or not it wasn't your decision to make and from the sounds of it you've made her OCD spiral more with your actions.  I get you were coming from caring place but you fucked up.  OCD is a complicated condition to treat and manage.  Unless she's putting herself or others at immediate risk of death or serious harm then you shouldn't stop her from acting on her wants and needs.", "If you're adult and aren't permitted to make basic decision for yourself, then technically you're not free. \n\nWho appointed you to be your girlfriend's keeper? Has she been declared incompetent? I', guessing not. You had no right to interfere with her life or her getting a memorial tattoo. I really don't know who you think you are but it's clear you are only making things worse for her. \n\nIf she ever thought of you as a safe person, ally or boyfriend who had her back and truly cared about her feelings, she now knows better. You've lost her trust and please don't kid yourself that she's going to wake up one day and be grateful. OCD or not, she has rights and you violated them. YTA.", "As a woman with OCD YTA.", "\"When she recovers from OCD\"\n\nHAHAHAHAHAHAHAHAHAHA\n\nYTA", "\"has described it as making her physically sick when she thinks about the fact she’ll never be able to get a tattoo on the 5th year anniversary.\"\n\nThat is some serious mental illness right there. I mean, what if the anniversary was a national tattoo artist holiday? \n\nBut you are not her therapist. Her friends are not her therapists. She discussed it with her actual therapist, who said don't do it. She wanted to do it anyway - which could be the basis of fruitful discussions with her therapist. But you effed that up for her, convinced her that you consider her a child which cannot be helpful for her mental health, and you come in here wondering if you did the right thing? Dude, she wasn't sawing off her arm, she wanted a tattoo. \n\nHere's the thing. Zillions of people have tattoos they regret. Zillions of people have funny ice-breaker stories about a bad tattoo and now kind of like that \"bad\" tattoo even than their better and more carefully planned tattoos because ol' baddy reminds them of a place they were, and where they are now and how they got there. People save up and have regrettable tattoos removed. A tattoo is not the end of the world. It's just some ink. \n\nYou can support your gf and her therapy, or you can recognize that you want to infantilize her and let her go before you do more harm.", "YTA.\n\nYou realise your girlfriend is an adult, right?\n\nRegardless of whether or not this is tied to her OCD, it’s something she wanted to do and you had absolutely no right to cancel her appointment. It’s an incredibly controlling thing to do. \n\nYou didn’t realise that controlling your girlfriend would result in her being upset? There’s also a chance you taking away her decisions *could cause a flare up* around this whole process.\n\nEdit: Also, if you want to help her in the future, go and talk to a therapist about *how* you should help someone with OCD. A few of my relatives have OCD and you’re supposed to offer a patient and understanding environment. \n\nIf the person is at a point where they’re ready to tackle their compulsions, that has to be agreed upon together. That isn’t a situation where you get to force them not to act on them as that can backfire astronomically. You can actively refuse to participate in any of their compulsions, but you don’t get to force them not to act on them.", "I’m not gonna lie, 5 is objectively the best number there is.", "YTA--it's her body, why would you try and police it?", "I think YTA", "YTA. I have OCD and would be livid as well if someone did this to me. Are some of my decisions influenced by my OCD? Absolutely! But like your GF I am seeing a therapist to help me understand why I make certain choices and to give me the tools to help. If I discuss something I want to do which may seem ill advised with my therapist we will explore why they and others may disagree but it’s still ultimately my decision and no one else’s. She clearly feels she wants to do something to remember her mother and on a date she felt was right and you have stopped that. Who cares if in the future she may regret a tattoo it’s not the end of the world but you’ve took away her choice and on a day that was really significant to her.", "YTA \n\nShe is allowed to get a tattoo on the 5th anniversary of her mothers death. \n\nYou have completely taken that away!\n\nYou have zero respect for your GFs autonomy! \n\nAnd how do you know what the Therapist said?", "As a 23 year old who’s had SEVERE OCD since the age of 11, YTSUPERA. Oh my god, if my boyfriend did something like this to me I would be FUMING. While the tattoo may be driven by her OCD, it is still a tattoo for her DECEASED MOTHER and you took it upon yourself to cancel it! Who exactly do you think you are?! Even if she is struggling right now and gets that tattoo because of her OCD, it will still serve as a remembrance of her mother AND her battle with OCD. You fucking apologize to her RIGHT NOW, and hope to GOD that she doesn’t end it with you!", "What the absolute F?? YTA. A huge one. You need therapy. Your girlfriend needs to run. Get a puppy.", "Yta you should’ve spoken to her about it before not gone behind her back. What she does is her choice, you taking away her autonomy is absolutely so not helpful", "YTA. You are treating your girlfriend like a child and making decisions for her that she is perfectly capable of making for herself. You are using her OCD as an excuse for being overly controlling of her and you are totally overstepping. You are not her guardian, you are her *partner.*", "It’s none of your business and its none of your friends business on what she does with her body. YTA, why did you think you had any say in this??", "YTA. She's an adult, and this was controlling af", "yta- i understand your concern but at the end of the day she is an adult and it is her body. Also the fact that she is doing through a difficult time with her loss this is the absolute worst way you could handle it- not only cancelling it but deciding this was an appropriate thing to discuss with friends instead of her directly. just reads as very immature and controlling.", "YTA. The fact that you impersonated her is already a jerk thing to do. But as someone who has been in recovery, one of the worst things people did was make decisions for me thinking they were helping, but in the long run it either made it worse or damaged my relationship with those people. I suggest you all make effort to research what a real support system looks like before you try and \"help\" this woman again.", "YTA\n\nWay to steal her autonomy! You could have just voiced your opinion but chose to impersonate her instead. I’m surprised she’s still with you.", "YTA. Either you’re her partner, which means you have to not treat her like a child, or you’re her guardian, in which case it’s unethical and illegal to be in a relationship with her.", "YTA Who the fuck are you to decide this for her?? She made a decision about her body. HER body, not yours. How dare you go into her email without her permission (i have my partners passwords, doesn't give me the right to go through his shit without permission) and cancel it close enough that she couldn't rearrange. I'd have dumped you on the spot. Also, you don't get 'cured' from OCD and calling her 'crazy' shows you have 0 respect for her. I hope she finds a more supportive, respectful partner.", "YTA. She's an adult, not a kid. You're treating her like she were your minor daughter. That's controlling and icky.\n\nShe may very well regret getting a tattoo, but that's still her choice to make. Just because someone has a mental illness doesn't mean people have the right to step in and make decisions for them. The only way this would be okay would be if she were incapable of operating on her own. People with that level of mental illness are usually in institutions or require 24/7 care. Nothing you've said indicates this.", "YTA. She will always have OCD. There’s no cure. You had no right to just cancel the appointment. I can get the concern that she was wanting to do this on the 5th anniversary, but it is a memorial piece. It sounds like something she wanted to get done and the OCD was playing into the timing. Because she has OCD it isn’t possible that she could want to get a memorial piece? It’s not an unusual thing to want to do. (I plan to get one for my grandparents.)", "YTA wtf", "YTA. Frankly, I hope she dumps you. You had no right at all to control her decisions, even though you justified it as something that was good for her. Going behind her back was an unbelievable level of control that shows you lack the ability to understand your role in other peoples lives. It doesn’t matter if every single person thought it was a bad idea, she didn’t and that is her right. If you want to control someone, get a dog.", "I have some mental health issues myself. Someone important in my life also fucked up an important-to-me event recently, and I can never get it back. It's been months, and it still makes me incredibly upset when I so much as think about it. It really hurts like no other, because I realized how little he respects me. It just revealed a pattern, and by the sounds of it, that's what happened with your girlfriend. I also haven't spoken to the person in question since then.   \nI also lost my mother when I was fairly young. If someone messed up an important anniversary surrounding her death, I would absolutely *lose my shit.* And that's not coming from a place of mental illness, that's coming from a place of being a mourning child. You're lucky all she's doing is ghosting you. I'd mess you RIGHT up.   \nAlso, she will never \"recover\" from OCD. This is a part of her life and herself that won't ever go away, just like my mental health issues will probably never leave me, either. YOU are the one who will have to live with it and get over it if you want a future with this girl. But honestly? I hope she leaves your inconsiderate, controlling ass. YTA, big time.   \n\n\nAnd I don't know if you need to hear this, but....No, do NOT reach out to her or try to apologize. She doesn't wanna hear it. Best you can do is leave her the hell alone.", "YTA - it’s her body, it’s her decision, it would have harmed no one, many people get memorial tattoos to help with grief, and you have no right to decide what is and is not good for her. Oh look, that’s 5", "YTA \n\nOh and this will be hard to read, cause I think you mean well, but you’ve become a toxic bf. Crossing boundaries like that, controlling her like a child - this is classic co dependency. If you don’t recognize it and change, you’re on the path to being controlling and possibly abusive. \n\nYou could stand to visit the therapist couple times yourself. \n\nWishing you all the best.", "YTA this is not your decision to make AT ALL, and you should be ashamed of yourself", "Super awesome taking away her body autonomy like that. YTA you took away her opportunity to do something to remember her mom on  a specific anniversary- she can never get that back", "But, but, his FRIENDS who are in no way qualified, agreed, so he must be right! /s", "Wait, did I misread this? Are we talking about your underage child?\n\nNo, no, I read it right. We're talking a grown woman whom you would like us to think you love. Jury's out there. But you clearly don't respect her.\n\nI wonder what you, her therapist and her friends all thought would happen if she got that tattoo? Did you think she would instantly go mad? Join the Society of the Hand? What?\n\nSurely none of you thought that NOT getting it would make her BETTER, did you? Frankly, if her therapist thought so, then they are a pretty bad therapist.\n\nYTA, in an obnoxious,  ableist way that is pretty repellent to read. I hope your girlfriend finds someone who respects, honors and lifts her up instead of snatching away from her something that will never come again.", "YTA\n\nIf you want to parent someone, have a kid.", "YTA you’re her boyfriend not her owner", "YTA clearly", "YTA \n\nEven if you're correct and she would have one day regretted the tattoo, you still had no right to interfere. You're treating your girlfriend like her OCD is her only defining feature. You also prevented her from making her own choice about her body. \n\nAll you did was let your girlfriend know that you have no respect for her autonomy.", "YTA - you were way out of line emailing the tattooist, pretending to be your gf to cancel the appointment. You voiced your concern, her therapist voiced their concern but bottom line it’s your gf’s decision on how she wants to commemorate her mother. Your gf will always have OCD are you going to override her body autonomy every time she chooses to do something you don’t like and blame it on her mental health?", "YTA jesus christ\n\nYou purposefully exacerbated her OCD because you thought you knew better than her about what she wants.\n\nShe deserves a better partner.", "How big was the tatoo? If it was a small one then YTA, who cares if she regrets it later.\n\nYTA", "YTA. While this may have been driven by her ocd and not her actual desire to get a tattoo it’s still her decision. You should have tried getting to talk to her therapist more and let her make the decision to cancel the appointment. Also you could have explained the situation to the artist and let him make the decision to cancel based on what he was comfortable with", "YTA.\n\nAlong with everyone around her apparently", "YTA Although your actions were with the best of intentions, she is an adult and can make her own choices. Having talked it out with you and her therapist, and she's still choosing to ignore the advice, that's on her. You two voiced your concerns, now her body her choice. Also, it may be something she actually does want and not related to her OCD like you and her therapist think.  I suggest really thinking about how you treat her. Are you supporting her like a partner or parenting her? You've stepped into the parenting role on this occasion. Maybe process before for you do something....alAm I being supportive or parenting/controlling her?", "Yes, YTA. You think you're helping, while you and your friends make decisions about her life and her body.\n\nYou're terrible, and I hope she dumps your ass for this.", "YTA. That is controlling!\nYou are allowed to say you are completely against something - and that is it. You are NOT ALLOWED to make decisions for her.", "YTA. You don’t get to control what another adult does with/to their body, as long as it’s legal. You don’t have to like it, but it’s not your decision.", "YTA. She can make her own choices, even if everyone thinks it’s not a good idea, she gets the final say. She’s not getting surgery, it’s just a tattoo. It isn’t going to ruin her life. You’re trying to control her; you’re abusing her trust and infantilizing her. She isn’t yours to control.", "YTA. You DO NOT get to decide things for her like that. Whether it's ocd or not, it's ultimately her choice. You did NOT handle in her best interest but in what you THOUGHT would be her interest. But you get to have an opinion not take over.\n\nAs someone who has a mild variant of ocd I guarantee you, you have harmed and you have fucked up so bad. OCD is a disorder that comes with intrusive thoughts and a fear of losing control you desperately wanted to maintain. What you did is literally make her lose control over a situation by taking it from her. \n\nThere is a reason why OCD therapy even exposure happens in a controlled way and a controlled environment. It's about building up trust in yourself with help of people who know what they are doing.\n\nWhat you basically did is tell your girlfriend she isn't to be trusted and shouldn't trust herself. Well. Fucking. Done. *slow clap*", "YTA\n\nIt's none of your business, and you unilaterally made a decision for her without her consent. You are also asking her friends to weigh in with an opinion on something that is not their business, either. Who made you god? Why should she ever trust you again when you treated her like a child and took all power out of her hands?", "YTA. she is not a child and you are not a licensed psychologist. you took away her autonomy on something important to her. on top of that, you are defending it by being incredibly ableist and implying that she is helpless to her mental illness so you’re entitled to decide what she’s allowed to choose for herself.", "YTA. I have OCD, and I understand what you were thinking but you definitely crossed a line here. I don’t know if this is at all helpful or if you’ll be receptive to this suggestion, but if you want to help her with her OCD, your only role in that is by not accommodating it. For example, my OCD is morality/religious focused (what if I’m a bad person, what if God hates me, etc.) My bf’s job is not to reassure me if I ask him those questions. But say I made an appointment with a priest or something to find out if I’m a bad person. He could not and should not cancel that for me. He could advise against it. But the decision - and the commitment to recovery - has to be mine. I recommend researching OCD and exposure response prevention if you haven’t yet because there are definitely ways you can help her but this was not one.", "YTA, this isn't your call to make.\n\nIf she gets a regrettable tattoo, then that's her problem.\n\nYou're not qualified to deal with this, she has very severe OCD, she needs real help, not you just making decisions for her based on no experience whatsoever.", "YTA, you were way out of line to use her email to cancel the appointment. It’s none of your business what she does with her body and even if she ended up regretting it later on (which we don’t know for a fact despite you thinking you know better than her), that’s on her. Nothing wrong with voicing your opinion but it should have stopped there", "YTA.\n\nYou should have talked her out of it instead of going behind her back to manipulate the situation. If you couldn’t have talked her out of it then you should have let her go through with it and maybe learned her lesson or maybe gotten a tattoo she would cherish forever.\n\nWho knows, maybe it would have been a mistake so big that it would made her rethink her OCD tendencies and help her get over them. Guess we’ll never know…", "YTA\n\nYou're her partner, not her parent. Learn the difference. If she's adult enough to date you, she's adult enough to make her own decisions without your interference.", "YTA. FFS stop saying you’re waiting for her to “recover” from OCD bc you don’t, you manage your OCD. As someone with OCD, there is nothing you could possibly do to help. That’s what the therapist (and meds if they’re on them) are for. The way you look down on your girlfriend and treat her like a child is gross. This is extremely controlling and if I were her I’d dump you so quick. \n\nEven if 5 is her compulsion there’s nothing wrong with tattoos so I’m confused as to why you and your friend group think her getting a tattoo to memorialize her DECEASED mother would be a bad decision. (Aside from the fact none of your opinions matter) People without OCD get the same type of tattoos every day.", "Info: has she rescheduled the appointment for the tattoo?", "YTA. She’s your ADULT gf, not your child. I’d have dumped you on the spot.", "YTA. She is a compentent adult and you took away her agency. First, there is no getting over OCD. Yes, people can find ways to manage it, but it's always there. Some days are better than others. Second, you took her choice away by posing as her to cancel the appointment, and then not tell her about it until an hour before the appointment (presumably when she was getting ready to go to the parlor). Third, how can the desire to get a tattoo to honor her mother be fueled by the OCD if she MADE. AN. APPOINTMENT! If it was a spur of the moment thing, which you allude to with the comment for her wanting things done in 5s, she would have swung by one of the less busy parlors and had it done on the spot. Not talk to her therapist, not talk to her friends, not talk to you about it. Fourth, you are treating her like a child and now wonder why she isn't opening up to you, except to tell you that she is in deep despair over not being able to do a specific thing to commemorate her mother's passing. If one day she woke up and wondered what the heck she was thinking in getting the tattoo, that is still her decision...not yours. Please do her a favor, advise her to find a new therapist, new friends, and while she's at it she'll probably be better off finding someone who sees her as a whole person, not a broken one.", "YTA\n\nI need you to give me one sound argument as to WHY WHEN HOW WHERE AND WHAT way she would ever regret getting that tattoo. Cause that’s the real issue here. I understand what you are saying and her therapist, but that was her mom and tons of people get in memory tattoos.\n\nI will legit change my vote if you can give me a reason.", "What is it we’ve been chanting for years now? Oh yeah, HER BODY HER CHOICE. Would it have been a bad idea? Maybe, but that is not for you to decide. Your girlfriend is an adult, making decisions for her is not supporting her healing journey in any way. YTA.", "Sounds like this is above the pay grade of /r/AITA. Were you protecting her from her own mental illness or being overly paternalistic? Are you even accurate in your assessment of your GF’s recovery?\n\nEdit:\n\nIt was an asshole move to make her miss the anniversary without warning. Barring some extraordinary new info, YTA.", "This is tricky. OCD is a bonafide mental illness and I would think a tattoo artist would absolutely question doing a tattoo under these circumstances. They usually won’t tattoo someone who is drunk either - it’s an ethics question in general. \n\nYou were trying to protect your gf from herself as she admitted she was acting under the influence of her OCD. Even her therapist said it wasn’t a good idea, she chose to ignore that advice.\n\nGonna say YTA. In the end, you can’t control what someone does…even if you know they’ll regret it later. People are allowed to make mistakes. You were trying to help but did it in not the best way.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy GF has OCD- one symptom she experiences is her doing everything in 5s. \n\nHer Mother passed away in March of 2018. \n\nMy GF goes to Therapy, and in January of this year when she bought up getting a tattoo for the 5th anniversary of her Mother’s death, I suggested she talked about it with her therapist. After doing so, she said that her therapist also didn’t think it was a good idea, as she believed that the drive behind her wanting to get the tattoo was her OCD, rather than the actual WANT of getting it. \n\nHowever, my GF still went ahead and booked the appointment. After talking with a couple friends about it, they all agreed that it wasn’t a good idea to make such a permanent decision which has purely been fuelled by her OCD. \n\nIf she had somewhat recovered from her OCD, I wouldn’t be so hesitant. However, she hasn’t made any progress. \n\nI emailed the tattooist (we have each other’s passwords) and cancelled her appointment. I told her an hour before her appointment that it had been cancelled, and as she had booked the last slot for the day, she was unable to get it done. \n\nI knew she was going to be upset, but I didn’t really realise HOW upset she was going to be. It’s been a couple of weeks, and it’s honestly crazy how she’s reacted to it, but I am more than certain (and so are our friends) that in the future once she recovers from her OCD, she will be really grateful. It’s clear that it was OCD influenced, as it has flared up a bit because of it- and she’s aware of that too- and has described it as making her physically sick when she thinks about the fact she’ll never be able to get a tattoo on the 5th year anniversary. \n\nSo AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "What kind of tattoo did she want? I think if she wanted a teeny tiny one, then wtf man, let her do it. If it was a full sleeve or a bigger tattoo… that’s a different story. You shouldn’t have cancelled the appointment though, you don’t control her. You could’ve gone with her and continued to express your feelings.", "NTA. Sometimes we do things for the people we love because its right for them. Even when they hate you for it. Ignore these hyper individualists.", "YTA. Don't cancel appointments that don't belong to you. And FYI, you don't \"recover\" from OCD. It's permanent. You manage it. You live with it. \n\nBe less of a jerk.", "Exactly why I am super against sharing passwords with partners. Assholes like this always think they know best for u and don't care how they do it. Family,  husband idc, as an adult I ain ever giving someone that power over me. Unfortunate people have such entitlement.", "Came here to say this. OCD is a mental health disorder like anxiety or depression; it can’t be cured. Like prairieislander said, you learn to manage through medication, therapy, and coping strategies. It will always be with her and she will always have symptoms, the pills only alleviate symptoms.", "Seriously. I have OCD and I would not want to be stopped over this. Giving in to a compulsion is not always a bad thing, especially if it isn't harmful. If you're standing at the front door for 25 minutes unlocking and relocking it then we have a problem. But checking to be sure the door is locked before going to bed at night (checking just once) is actually a healthy and safe habit to have, even if it started with OCD. \n\nAnd also, wanting something and feeling compelled by OCD are not mutually exclusive. I can want to buy something because I think it's cute but also because I touched it and suddenly feel a compulsion to buy it. It doesn't mean the item is \"tainted\" because I had a compulsion. It's still a cute object that I can enjoy later on. Usually a compulsion only lasts a moment - so even if getting the tattoo was a compulsion, having it can be a thing of joy.", "Not only that but he's calling her response to his manipulation and control \"crazy,\" like someone should just shrug off their boyfriend telling them they should lose agency because they're dealing with OCD. \n\nI get the feeling any time she does anything he doesn't like he attributes it to mental illness.", "My guess her OCD has nothing to really do with it. He doesn't like tattoos and couldn't have that. All about his control and preferences for his gf.", "YTA. YTA. YTA. It’s her body. I hope she dumps you bc what else will you try and decide for her", "This is the way", "Make sure it’s 05:55 AM on May 5th. Give her something to look forward to.", "The issue wasn’t that she was being impulsive it was that she was doing it out of an obsessive behavior. If it just had to do with being impulsive she could reschedule for a different day but because it was based on her OCD she won’t get it because it’s not the 5th anniversary anymore", "And that seems an odd response from the therapist", "Yes!  I like numbers that end in 5.", "I have ocd as well, it flared up after my brothers passing. I got a tattoo of him with specific number of words and specific number of lines due to my ocd. I also got a second tatto same day that I picked out last second due to my ocd ( not wanting to only have one tattoo) \n\nIf someone would’ve prevented me from going to that tattoo appointment I would’ve cut them out of my life.", "What did the puppy do to deserve OP? \n\nYTA", "Even if it's \"driven by her OCD\", who tf is going to regret a MEMORIAL tattoo? Was she trying to get it on her face, or something? Maybe OCD was part of her drive to get it done on that date, but unless she was trying to get 5 tattoos then it wasn't what was driving her to get a tattoo. I hope she gets the tattoo regardless. If OP doesn't recognize how controlling it is to cancel someone's tattoo appointment or how invalidating it is to say that she can't make decisions about her own body because of OCD then the girlfriend needs to seriously consider whether OP is the guy for her.", "Even if he was \"protecting\" her, he went about it in a shit way. There's nothing in there that shows OP considered how this would affect her mental health in any way, just \"well she'll regret it when she \"recovers\" from OCD.\"", "Yes, OCD is a mental illness, but it's not like it's shockingly obvious like we see with somebody who is an unmedicated schizophrenic talking to themselves and maybe looking disheveled. I didn't know a couple people had OCD until they did something to display their symptoms. It's perfectly believable she would've gotten the tattoo and seemed perfectly normal in terms of behavior.", "You explained this SO WELL. It took me a while to learn that making my round around the apartment to make sure everything is turned off is OKAY (and a good habit for safety and energy)… it’s the turning around half an hour into my journey to drive home and double check that’s not okay, lol.", "Completely agree with you. I also really dislike the fact that OP enlists their friends in all of this and gets them to side with him against her. I feel sorry for this girl and I have my doubts that being undermined about things that are important to her by those who are closest to her will be conducive to her growth or her ability to manage her condition.", "Maybe he's just trying to bring back the \"good old days\" where women would be institutionalized for hysterics/women troubles.", "And? What does that matter? She hasn't been deemed incompetent or unable to act on her own behalf, and OP is not her appointed guardian, he's her *partner.* If she wants to get a tattoo, she can absolutely get a tattoo, regardless of the reason behind it. OP is completely out of line for taking it upon himself to make decisions for his fully grown adult girlfriend when it's not his place to do so. That's unhealthy and controlling.", "I find it suspect, honestly. I would not be surprised if OP is interpreting a more innocent bit of advice to better suit his argument.", "Op is probably worried gf will get 5 tattoos.", "He's also decided she'll regret it. First off, you don't \"recover\" from OCD, you learn to manage it. Even once she's learned to manage it, she may still like that she got the tattoo.", "[deleted]", "I 100% agree. I just wanted to clarify that OP didn’t do it bc he was worried about her making an impulsive decision but a decision based on her ocd. Either way it’s her choice", "If that’s something she feels she needs to do then she should. I went there thinking I was okay with one but left with two bc of ocd. I don’t regret my decision. Sure I don’t really care for the second tattoo I got since it has to personal meaning but I’m glad I got the tattoo of my brother. OP should not have stripped away his GFs choice to honor her mother regardless of her OCD. If she was to get 5 tattoos she could get rid of them in the future after her OCD settles down.", "I'm not sure about your assessment on bipolar disorder. It's one thing to let the person know what they're doing may be harmful, but when you start impersonating someone to make decisions for them, you have crossed the line. If somebody has bipolar, unless they are actively trying to hurt themselves or in their lives, the best way to go about it is to speak your mind and be open to helping them pick up the pieces when they fail. Let's just say the people who thought they were helping me in my recovery by making decisions for me are not in my life now that I have been stabilize for the better part of a decade.", "She mentioned wanting to get a tattoo in January and was meant to get it in March. She was probably considering it before then. Not really impulsive.\n\nIf his concern was that it would have a big impact on her mental health later on, a better move would have been 1) expressing that and 2) discussing the design with her to help her make sure it's something that will be meaningful for her for a long time. (Given the lack of detail about size/placement, I doubt it was something like a facial tattoo. I also noticed that he didn't mention anything about it being her first tattoo, which I would have expected as part of his concerns, so I assume she's gotten at least one. Could be wrong, though.)\n\nFeeling like your partner has taken your choice out of your hands and considers you incapable of making decisions also has a big impact on your mental health.", "I totally agree bf had no right,  I'm thinking he doesn't like tattoos and since gf does things in 5, she might get 5 tattoos.  I really like tattoos I have 12 and still want more.", "Totally right, I spoke much too concretely. Not always, and this impersonation circumstance is a little different. There have been times where I’ve needed to be pretty paternalistic about protecting someone from a decision though, like having a drink.", "That’s a good point about the timeline. I wasn’t thinking about the time-sensitivity of the tattoo.\n\nI agree, I doubt it’s going to be a face or neck tattoo and I doubt it is a particularly objectionable tattoo from how OP described it. \n\nBut I’m also hearing that a lot of people who know OP’s GF: her friends, her therapist, and OP, all objected. I worry that there’s something about the situation — the tattoo itself, OP’s GF’s OCD, or her personality, or something else — that is missing from the post.\n\nHaving said that, I’ve edited my initial verdict to Y T A."]}