{"id": 13347, "submission_id": "123v088", "title": "AITA for moving out after my boyfriend said a man was staring at me in public?", "selftext": "My boyfriend (32M) and I (28F) were walking into a hotel breakfast to get some coffee. He said \"that guy is staring at you\" and nodded his head in a general direction. It was about 7am plus I was groggy and thought it was a joke. I looked around the room expecting a poster or cardboard cutout of a guy. Hardy har har. I saw nothing so I just looked at him confused and said \"what?\". So he said it even louder, \"that guy in the blue hat is staring at you\". So I looked around again for a cutout of a guy in a blue hat. That's when I realized he was actually talking about the guy in the chair I was standing 2 feet from who was sitting with his wife/girlfriend. I turned back to get coffee and said \"you need to chill out\" under my breath. I was so shocked and embarrassed. He then followed up with loudly again \"Why? I think it's funny to call him out in front of his wife\". I grabbed my coffee and we left. Once I woke up more I realized the guy was probably just looking at the lanyard I had on for a seminar. I put it on so that I wouldn't forget it for my early morning check in. The poor man was probably just wondering why this person was wearing a lanyard and tried to read it out of curiosity.\n\nAITA for wanting to move out because of this? Hear me out please. To me this was horribly embarrassing. I felt so bad for the guy and his partner. Nobody needs that kind of overt hostility at the beginning of their day, possibly on a vacation, while just trying to eat breakfast. It also seems like my boyfriend has absolutely no self control and is jealous. Who does that?! And what if the guy stood up for himself? My boyfriend clearly wanted escalation and not deescalation. I'm not interested in bailing someone out of jail because they got in a fight in a hotel breakfast room.", "created_utc": 1679940169, "permalink": "/r/AmItheAsshole/comments/123v088/aita_for_moving_out_after_my_boyfriend_said_a_man/", "score": 247, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want to move out. My boyfriend said I'm overreacting because he thought it was funny to call the guy out. He thinks if was just an off hand statement. To me this feels like a huge deal and sign of something worse but idk what exactly. Would I be the asshole if I move out and end our relationship.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. More women should dump men at these early red flags.", "NTA\nIf you’re not feeling the relationship then stay true to your instincts. It doesn’t really matter what the specific reason is. \n\nI’m willing to bet you’ve already had concerns - this is just a final straw type of moment", "NTA. This is weird. Like, even if the guy was checking you out in front of his wife, is that really something you want your partner getting all aggressive about?\n\nPersonally, this would make me really uncomfortable. If I'm in danger or I'm uncomfortable and I tell my husband that,  I have no issue with him defending / protecting me, but this is beyond that. This is like some super possessive, 'I own you because we sleep together and other men need to respect that' BS.\n\nTHAT'S IT, THAT'S WHAT BUGS ME! He wasn't upset for *you*, he was upset for *himself*. That's what makes it creepy.", "NTA this seems like a pretty big red flag and I felt the cringeyness of the situation all the way over here.", "NTA  \nYou are never the asshole for removing yourself from a situation you don't feel comfortable in.", "NTA because of the part where you thought he was talking about a cardboard cutout. I found that endearing, especially when you doubled-down on it.\n\nAlso, NTA for wanting to leave your BF. He sounds like a tool. \n\nI think you should move in with a cardboard cutout man, then  post lots of pictures of the two of you together, just to trigger your BF.", "NTA. \n\nYour boyfriend embarrassed you, and the guy that was supposedly staring, in public, because he’s jealous. \n\nI notice when people are staring at me, (or worse, following) and subtly tell my partner sometimes. But it’s more of a “this dude is acting really weird and won’t stop staring at me, even though he knows I know he’s staring at me,” or, “this person is following us/me and we need to leave now,” type deal. \n\nI never say it loud enough for anyone else to hear, and NEVER to call the person out. Why in the world would I want to potentially provoke someone that’s doing weird shit? And if they’re not doing weird shit, then what’s the point of saying anything in the first place?", "NTA.  He sounds like a belligerent jerk with a severe case of testosterone poisoning.  I’d be out too.", "NTA. I had to double check the age. Does he intend to pick a fight with everyone he thinks might be staring at you, forever? \n\nJust out of curiosity, how long have you been together and does he do this often?", "NTA. \n\nIf you're looking for permission, here it is: you have permission to leave and never look back. \n\nChances are, this wasn't the first incident. It was just the last one you want to deal with.", "NTA. Run from red flags. So many bad relationships could have been prevented doing this.\n\nEdit: Typo", "\"My boyfriend clearly wanted escalation and not deescalation. I'm not interested in bailing someone out of jail because they got in a fight in a hotel breakfast room.\"\n\nIf you stay with him and you have this conversation with him to no effect, that might happen.\n\nNTA\n\nHe was causing a scene so you left.  Perfectly valid response.", "Nta. He’s going to be an insecure, childish, baby boy his whole life. If you want the for the rest of you life stay. If you don’t leave.", "LEAVE THIS JEALOUS PERSON IMMEDIATELY", "I guess if this is a one-time thing and you went for the nuclear option, then yeah, YTA. If this is something he does all the time, then NTA. Why did he feel it was necessary to draw your attention to some random guy staring at you? Is he often jealous of other guys looking at you? Who wants to with a guy who is that insecure.", "NTA. Trust your instincts", "NTA.   \nYour bf is an AH. It will only get worse.", "This is one huge flag 🚩, you deserve so much better than what you have now.", "NTA.\n\n&#x200B;\n\nI really do not care if people stare at my wife. I do not even care if they hit on/ flirt with her. I care about how she handles it. If she returns the flirts or begs for attention from other men I'm mad at her not the guy, unless it was a \"friend\" of mine or hers. \n\nI would joke with her after we left the earshot \"Hey baby, that guy on the couch in the lobby? he was totally checking out your butt haha he was probably thinking 'dang girl you shit out that ass!?'\" and try to make her laugh with my horrible humor.", "NTA your boyfriend definitely wanted a confrontation. Who needs that. I always say if you can't deal with having a beautiful woman by your side then don't. Men are gonna look. What is gonna do fight at every corner. He needs some help.", "NTA you do not need a reason to finish with a guy. I do not know when it first started that a young woman has to have a whole list of justifications as to why she needs to get out. You only need to know it isnt working, that is it. But jealousy at the breakfast table when I am only half awake would do it for me. I once dated a guy for two weeks, before he punched a guy in the face for 'looking in my general direction.' I was mortified and that was our last ever date.", "NTA OP.  Why constantly put yourself through experiencing his jealousy?  Cause pretty soon, it will become your fault that some guy is staring at you.  BTW, how does he know the guy was actually staring at YOU; he could have been staring at your BF?!", "I dated a guy like this, he was chronically insecure and often embarrassed me. I dumped him and you may want to consider the same.", "NTA, it's only a matter of time with a guy like that. If someone is always looking for confrontation, sooner or later, someone will oblige him. Get out while you can, or start saving up for bail money and hospital bills.", "NTA - when a man obviously, I mean very obviously, hits on me in front of my husband we laugh it off together. No one needs someone angry, hostile and jealous in their life.", "INFO: Does your bf act like a total jackass on the regular?  Failing to see how you would be TA here...", "NTA. Your boyfriend sounds like a disaster waiting to happen.", "NTA and YES! This is a red flag. How does he know for CERTAIN he was actually looking AT you. He could have been lost in thought with his eyes facing you but was in his head the whole time. For example: One time I was visiting my mom in the ICU, she was in an induced coma, so after I left her room I wanted to ask a nurse a question, so I looked around and didn't see one right away, so stood at the nurses station waiting. The ICU has a central station and glass enclosed rooms all around the perimeter, if curtains are open you can see into patient's rooms. I was lost in thought, thinking about getting with my sister and making the decision to pull the plug if necessary, and just all over the place IN MY HEAD. I heard someone say something but didn't pay any mind, then a person began walking my direction in a threatening manner and started whisper yelling to stop being rude... I literally saw NOTHING but vague outlines because I was lost in thought and HIGHLY distressed,  at that moment they were being verbally aggressive, the nurse came and I asked my question. It wasn't until fully FIVE minutes LATER (or longer,I was IN the elevator by then)  that it sunk into my consciousness WHAT EXACTLY had happened, and the person was ACTUALLY speaking to ME!!!, I felt so bad and totally would have apologized and explained if I had been \"there\"...so just because someone is looking your way, unless you make eye contact you have no way of knowing they are looking AT you or just in the direction you happen to be. \n\nPeople notice a LOT less than we give them credit for, 95% of the time we feel self-conscious about something, other people in the general public don't notice it because they are in their own head being self-conscious about their own thing!!! \n\nSo if bf didn't make eye contact then he doesn't know either, AND it is super controlling for him to get all weird about it...ask him if he's gonna pee on your leg next before you ditch him.", "NTA, get out and stay out", "NTA\n\nWhat a horribly awkward and embarrassing situation BF put you in. Clear he was looking for some sort of confrontation.\n\nYou can go for whatever reason you please. If you feel uncomfortable living with BF, that's all on you.", "NTA", "NTA! He’s on top of the red flag factory and he’s waving the biggest reddest red flag of all time! Heck, they oughtta name the red flag factory after him! RUN! It will only get worse!", "NTA, trust your gut instincts.", "NTA You don’t have to justify moving out to anyone but yourself, and besides the fact I think you’re completely correct about your bfs behavior, even if I didn’t, don’t stay with someone you’re not 100% about.", "NTA \n\nIt's understandable reaction when you feel  threatened", "NTA You get to leave for any reason whatsoever, but your reasons are valid. Get yourself out of this situation.", "INFO what else is going on here? Seems like this isn’t the first time you’ve thought about moving out. \n\nwhy does your boyfriend pointing out that someone was looking at you get you to the conclusion of moving out?\n\nWhat is wrong with a SO pointing out that someone was staring at you? If someone was staring at me, I’d want to know. Maybe i know that person, maybe there’s a giant stain in my shirt, or maybe they’re a creep and i should avoid them.", "I wanna say YTA. How did this even get to a \"I'm moving out now\" situation?   I feel like either we are missing a TON of background info, or you are just absolutely nuts.", "I don't really get how this escalates to the point of \"I want to move out\"\n\nIf a dude is staring at you (and continues to stare at you) from across the room, that's a bit weird. I also think its unlikely someone \"keeps staring at you\" because of a \"lanyard\"\n\nBut idk if there's more problems with your BF or if this is the only reason you'd want to moveout? If you're considering moving out I'd assume there's more to this? \n\nI think its a pretty normal response if someone keeps staring at your partner to kinda wanna call them out for it. \n\nNAH I guess?", "It sounds like you’re either already unhappy, or immature and looking to escalate petty drama \n\nIf you don’t see yourself together with him long term, just take the plunge already.", "That escalated quickly.", "Im not even gonna judge this. I don’t get it, in some posts they get angry because their SO didn’t stand up for them or called someone out and in the next they get angry because their SO did exactly that. :/", "You just want to leave him, don’t make this an excuse. You didn’t see how long or in what way he was staring at you. Your bf did. Believe him or not (you don’t seem to) and leave since that’s what you want to do. Yta for the way you’re trying to do it", "This post and these comments are seriously the most ass backwards things I've ever read on here. How many times are there posts about women getting upset because their friends/family/partner didn't speak up for them when getting hit on or creeped out by some rando? That they hate when people make excuses for catcallers because \"boys will be boys\" or \"she was asking for it\" etc? Why would you be upset that your boyfriend is literally standing up for you? The man SHOULD be embarrassed in front of his wife if he was checking out other girls. That's exactly how i would hope someone reacts. And why would he be staring at your lanyard? Literally never in the history of history have I done that, even if casually glancing I wouldn't be turned around staring long enough for someone to take notice of it. Grade A excuse making right there, and it makes no sense why you would do that. If you wanted your bf to not start a fight, OK, but... he didn't? You went from telling him to chill out for doing literally nothing, to moving out? Like did I miss something here? Did he take you to the room and beat you for disagreeing? So fkin weird. YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend (32M) and I (28F) were walking into a hotel breakfast to get some coffee. He said \"that guy is staring at you\" and nodded his head in a general direction. It was about 7am plus I was groggy and thought it was a joke. I looked around the room expecting a poster or cardboard cutout of a guy. Hardy har har. I saw nothing so I just looked at him confused and said \"what?\". So he said it even louder, \"that guy in the blue hat is staring at you\". So I looked around again for a cutout of a guy in a blue hat. That's when I realized he was actually talking about the guy in the chair I was standing 2 feet from who was sitting with his wife/girlfriend. I turned back to get coffee and said \"you need to chill out\" under my breath. I was so shocked and embarrassed. He then followed up with loudly again \"Why? I think it's funny to call him out in front of his wife\". I grabbed my coffee and we left. Once I woke up more I realized the guy was probably just looking at the lanyard I had on for a seminar. I put it on so that I wouldn't forget it for my early morning check in. The poor man was probably just wondering why this person was wearing a lanyard and tried to read it out of curiosity.\n\nAITA for wanting to move out because of this? Hear me out please. To me this was horribly embarrassing. I felt so bad for the guy and his partner. Nobody needs that kind of overt hostility at the beginning of their day, possibly on a vacation, while just trying to eat breakfast. It also seems like my boyfriend has absolutely no self control and is jealous. Who does that?! And what if the guy stood up for himself? My boyfriend clearly wanted escalation and not deescalation. I'm not interested in bailing someone out of jail because they got in a fight in a hotel breakfast room.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Honey, don't walk. RUN!", "And remove a major source of drama for this sub??", "Soooooo true", "So true. This is wild behavior.", "Yeah there seems to be a lot more going on here, because this incident alone seems like a bit of an overreaction for something that didn’t really end up being anything outside of OPs head.", "I think you just put the pieces together for me too. Obviously escalating something benign was an issue for me. But I didn't even see, wasn't fazed, and didn't think anything of the random man. My bf was upset for himself not for me. It's like it was a possessive move?", "Yes the cringe and embarrassment. My face definitely turned red. I've never had a partner be so aggressive and escalate something. Like what do you even say in that kind of situation? I just left the room as fast as I could", "lmao I really thought he was pulling a dad joke on me. I expected a hotel promo cutout or something of a man smiling giving a thumbs up. That's how my brain works 😂", "We've been together about 9 months now. He has mentioned before when we left a situation or room that someone was looking at me. This was the first time he has said it while still in the room and done it loudly to \"call someone out\"", "He was trying to start a fight.", "We had just walked into the room. To me that's not long enough to constitute \"staring\". And like I said, lanyard around my neck with writing on it. It was a small room not a long runway. He did it loudly and on purpose to \"call out\" that man in front of his wife. He did it loudly so they would hear not just to let me know. It was very hostile especially for a nice Saturday morning grabbing coffee", "This sub confuses me. Jumped into the comments expecting to see this person get told they're overreacting but it's full of NTA. \n\nThe guys behaviour isn't great but jeez you've got bigger problems if you care this damn much about others opinions of you.", "That’s where I’m at on this. \n\nAt all times, someone 100% should move out if they’re not comfortable in the relationship. But I’m struggling to come up with a scenario where this would be the tipping point. Does OPs BF have a history of hotel breakfast bar fights? Seems like such an odd thing to get caught up on unless there’s significantly more to the story", "There’s no proof the guy was actually staring, and even if he was there was no reason for the BF to immediately get belligerent and blast everyone across the room. He was clearly looking to start something.", "Exactly", "But how do you know that the man was ACTUALLY STARING at OP?  Maybe he was staring at OP's BF.  Or maybe he was in a daydream state where he was thinking about something else but not realizing he is staring at someone?  And please don't tell me that you've never had one of those daydream episode cause this I wouldn't believe.  Besides, OP stated in her comments that this have happened before with BF telling her some guy was staring at her but this time BF took it to a new level.", "Well that and parents violating boundaries.", "It sounds like the kind of thing where your friends ask how your vacation was and you tell them about the crazy dude at the hotel who got loud at the breakfast buffet because some other guy *looked at* his gf and his poor gf was so embarassed she had to leave. Then you talk about how you're glad your husband isn't like that.\n\nIt sounds like a weird, passive-aggressive flex because he didn't even say it to the guy (which would NOT be better) he said it to you loud enough for the guy to hear him. What was the point of that if not to mark his territory? What would he have done if the guy got aggressive back?", "thats the behavior you expect from a teen like 18 yr old not a grown man of his age.", "If I told a woman I was with that someone was starting at her, it would be a cardboard cutout, or painting or statue, or the like, so I am right with you.", "NTA. Dump him. Be prepared for him to react BADLY.", "Well then, I guess it depends on how much you like him. Is it worth having a conversation about it? If you let him know you think it’s childish and you want it to stop and he ignores you, then I guess you’ll know.", "There is a wide range of outcomes from calling someone out for staring at your significant other before it reaches physical violence. The way this scenario is presented makes it seem like OP is leaving out a ton of relevant details and/or backstory", "I think the key part is they **just** walked into the room. There was no time for anybody to be actually eye-fucking OP. Her boyfriend just wanted to instigate conflict. That's easy to miss if you don't realize they literally **just** walked in.", "I agree. Red Flag brigade out in full force.", "100%.", ">The guys behaviour isn't great\n\nI honestly don't see what's wrong with it? I mean, wouldn't a woman want to know if there's some creepy guy in the area ogling her?", "Agreed.\n\nIn most situations, I would want to know if I am being stared at. This is also sounds like a strange hill to die on unless this is apparently a regular occurence, but atm it’s not presented that way.", "I may have misread but this sounds like the conversation took place over a few minutes, during which the guy was *still staring*\n\nIf this is the case, I don't see the issue.\n\nIf the guy \"stared\" but wasn't actually staring then I agree with you. Maybe I misread.", "I mean, considering this is just a textual recounting of the situation, I'm not sure what kind of proof there could possibly be, other than someone saying that he was (which is the case here), that he was actually staring?", "Not to mention step-parents trying to force a relationship, wedding drama, incomprehensible high school drama, … what else am I missing?", "The part about calling the guy out in front of his wife makes it clear to me. OP has given more details in comments and I'm confident this dude is just belligerent.", "Redpill brigade is on this post, too!", "There’s a difference between letting someone know they’re being stared and and announcing it to the room in an aggressive way.", "Sure but by the sounds of things it may have been questionable whether they actually were. Also, whilst I have no issue with offending others when it's justified, this reaction seems a little unnecessary.", "Say he was staring, then. Is what the boyfriend did there any kind of proportional response?", "Pregnancy announcements and vacation drama.", "I’m not saying the BF isn’t an AH but jumping from the described scenario to moving out is a big leap given the details that we’re provided by OP. Plenty of other commenters have the same opinion. \n\nYou clearly have some insight into OPs BFs behavior that we don’t.\n\nOP should 100% move out if they aren’t comfortable in the relationship, this just seems like an odd tipping point.", "Okay, fair enough. I personally aren't really reading any aggression from how OP described it, but to each their own.", "Im not really sure what you're referring to when you say what the BF did.\n\nBut my sole point was that there's no further way to prove that that guy was staring than what was already stated here.", "I have her comments and her posts, same as you. It's not a leap to me that this would make her want to move out. She said he's mentioned guys staring at her before. He's insecure and jealous.", "The whole post is about what the boyfriend did. When OP didn’t immediately know who he was talking about when he said someone was staring, he loudly called out the person, and when OP told him to chill he loudly said he thought it would be funny to embarrass the guy in front of his wife. Whether or not anyone was actually staring, that’s not a proportional response.", "I don't disagree with you.", "NTA\n\nThe first step is he says guys are noticing you\n\nThen he takes offense that guys noticed you\n\nThen he tells you that you are doing something to attract this attention\n\nThen he’s angry at you when guys notice you\n\nThen he demands you wear certain clothes or don’t go certain places\n\nWhen a guy still notices you and he gets angry, he has to teach you a lesson.\n\nDo you see where this is going?  A twisted, sick version of  “if you give a mouse a cookie”", "NTA it sounds like he was trying to shame you for being attractive and call the other man out at the same time. Move out, break up and cut off all contact as it's only going to get worse.", "NTA. Doesn't really matter what it's over, you don't want to live with someone, you don't need to.  \n\n\nWhat kind of person enjoys embarrassing themselves, their partner, and a random stranger because of some imagined slight? Like, does he expect all other men to avert their eyes in case they accidentally look in your general direction?", "Can... Someone explain the problem here to me? I'm genuinely curious. To me it just sounded like bf was pointing out creepy behaviour so OP was aware of it, but also found it amusing. How off am I?", "He was staring because he was looking at the back of your head? Is that what happened? Cause if then maybe he just likes your hair", "You can move out for any reason you want.  He's making you feel uncomfortable and it's good you are paying attention to that.", "You can end a relationship at any time. Not wanting to be in a relationship with that person is enough of a reason. If he starts weird stuff like this and you get nervous in public not knowing what he'll do then...yeah, leave him. Why chain yourself to that just because you moved in with him? You can leave. It's your life.", "And the lesson here is don't be too embarrassing for your GF to stand.  (And don't mate guard like a child).", "LOL", "We will all go to the r/amithecloaca sub, because cats will  never stop judging us", "\"But how do you know that the man was ACTUALLY STARING at OP?\"\n\nI don't 🤷‍♂️ cuz I wasn't looking. Much like OP wasn't. For all she knows, the man was having a looney-tunes-tongue-on-the-floor-heart-eyes-pounding moment staring at her, yet she immediately chooses to disagree with her by about it. That's telling. I've had plenty of those daydream moments, and when I either am called out or \"zone back in\" so to speak, I always laugh and apologize if it looked creepy. And yes, the bf has said people were looking at her before. So? Maybe she is breathtaking and it happens all the time? Why does that invalidate this time? If he has said it before and expects her to defend herself, and she doesn't, maybe he feels he has to? If it happened all the time, it's pretty understandable for them.to feel frustrated by it. OP also says in her comments that she's never very had a partner that would step up and say something like that, and she also got red and embarrassed and beelined out of the room asap. Sounds like she has issues with confrontation, which is exactly what pervs and creeps thrive on to keep being pervy and creepy. They WANT their victims to be too uncomfortable to.say anything. And that just lends credence to the idea that maybe the bf thought he had to step up", "oh no keep the wedding drama for some unknown reason, that's my jam!", "You all are enjoying this way too much! :D\n\nBut seriously, NTA.\n\nJust curious, is this the first time he has behaved obnoxiously?", "NTA. Good for you.\n\nHe sounds like a bully who likes to flex and intimidate other people for fun. You can do better than that, for sure.", "NTA. If you want out, get out. Relationships are a two yes situation.", "Get out now", "NTA. That's a giant red flag. Go with your gut.", "NTA. Red flags be flying all around you. Run.", "NTA- major red flag.", "It sounds like a misunderstanding. Is it a reason to move out? I'm not sure. Anything else that would be a red flag here?", "See…. I’m sure other things lkke this have happened. That’s why I’m saying NTA.", "ESH", "NTA Even if the man was checking you out, which it seems he wasn’t, but how is that your fault? Why was your BF angry at you? What did he expect you to do about it? You are now uncomfortable with your BF and this is a good reason to break up. It will only get worse.", "NTA. You are being smart. I’d run too", "NTA\n\nJessssus. Controlling much? Girl run.", "NTA. Especially not if you anticipate his jealousy/desire to escalate things to become a recurring habit.\n\nBut also, you have the right to move out/break up for any reason. Relationships are two people (or sometimes more, but I digress) making the choice be together. This was a dealbreaker for you, it seems like. You’re allowed to have those and personally, I think it’s a good call. Small things like this can and very often do become way bigger.", "If you want to move out, move out. There would be no scenario in which you'd be an asshole for moving out if you didn't want to be there. It's that simple.", "I agree, it doesn’t sound like insecurity as much as him just acting a little immature but still nothing crazy 🤷‍♂️", "Her bf made an embarrassing scene in public. No one wants to be with someone like that.", "NTA. I’m glad you’re getting insights from here. Your current bf is not relationship material if he’s going to continue with his aggressiveness over benign issues. Suggest you talk to your bf about his shortcomings. If he shuts you down, doesn’t listen, or if it looks like he won’t follow through to improve, then definitely not relationship material.", "I think it speaks well of you as a partner that you assume the best interpretations & intentions from your partner's behavior, but also don't justify or ignore it when it becomes unambiguously shitty! I have ruined good relationships by assuming the worst from my partner, and I have stayed in bad ones by excusing genuine shitty treatment, and it sounds to me like you don't have to worry about either of those 😊", "Hmm. Yeah I can understand that. I mean if he said he was 'saying it loud enough for his wife to hear' then he was probably being pretty loud..", "Or a baby! I think that could be funny too", "Or dog", "And the best part of all, relationship based posts are technically not allowed in this sub. :)  Rule #11."]}