{"id": 13362, "submission_id": "124adei", "title": "AITA for donating my wife's late daughter's teddy bear?", "selftext": "My wife(35F) and I(39M) have been married for about 9 years. Before we were married, my wife had a daughter Izzy, who unfortunately died when she was really young. We have one son together, Richie(9M).\n\nLosing Izzy hit my wife really hard, and even today, she's still not completely recovered from it. To honor her, she volunteers at our local children's hospital. She already works a busy job, but still finds the time to volunteer, as she is very dedicated. She also donates to the hospital as well.\n\nThe problem is that she is very holier than thou, and keeps shaming me for not wanting to volunteer. I mean, I feel like she should be able to choose to volunteer with this organization if it's meaningful to her, but I just find it weird and annoying how incessantly she constantly bugs me to volunteer, and shames me, making me out to be an unkind person. She doesn't do it outright, but it's very passive aggressive.\n\nAs richie's gotten older, she's been telling him about why it is important for us to volunteer, and how he can honor his older sister. She's talking a lot about giving back to your community, and how good people always find time. It is nice, but I just feel like she's pressuring our son, and kind of like forcing him to do it in a guilt-trippy way, and I also don't think he's old enough to hear about Izzy. It's just a really sad and awful thing that he's not emotionally ready for.\n\nThe hospital is holding a toy drive, so my wife, without telling Richie, gave his old hot wheels he had when he was a toddler to the hospital. When he found out, he was understandably distraught, but my wife told him that he was too old for those silly toys, and that younger kids needed them more.\n\nWhen I found out I was absolutely fuming. I tried to talk some sense into her, but she wouldn't listen, so the next day I took Izzy's old teddy bear and donated it. When my wife found out, she was absolutely ballistic, but I remained calm and told her I did it because I feel like you need to let go, and that you are holding your deceased daughter over our son, and you're not there for us. I explained that you need to properly deal with this grief, and that you're acting very unhealthy, but she just went really quiet and stopped listening to me, and now it's like I'm not even there. She's been ignoring me since, and I tried to explain or reconcile, but she's not listening to me, and I don't know what to do\n\n&#x200B;", "created_utc": 1679972137, "permalink": "/r/AmItheAsshole/comments/124adei/aita_for_donating_my_wifes_late_daughters_teddy/", "score": 871, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) donating my wife's daughter's teddy bear (2) I might have been the Ah for this because she really cherished it as it was one of the possesions of her daughter whom she loved very much\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You donated your wife's dead daughter's doll to get back at her for throwing away your son's hot wheels? You know you can buy more hot wheels, right? You know what your wife can't buy? More mementos of her dead daughter. YTA.", "YTA\n\nI would divorce your cruel, spiteful ass. How DARE you donate a toy that she kept from her dead daughter??", "I’m pretty sure the reason why she’s not talking to you is because she’s getting her bearings together to file for a divorce.  \n\nOh and btw, YTA", "GO GET THAT BEAR.", "Dude. \n\nHer daughter is fucking dead. She'll never be able to buy her child any more toys. You got rid of an important tangible object that was helping your wife feel connected to her deceased daughter over some hotwheels you could easily replace for your LIVING son. \n\nHow sickening. YTA", "YTA.\n\nYour wife's donating of your son's toy was an asshole move. However, what you did is a goddamn atrocity, making your wife not an asshole since you have pretty much re-defined scale of assholery with your act.\n\nIf you wanted to teach your wife a lesson, appropriate action would be to give away one of your wife's thing such as earphones, etc.", "YTA. Your wife should not have donated the hot wheels without talking to your son first. It sounds like he was no longer playing with those hot wheels by the way you worded it, but she still should have asked. That is a night and day difference from a teddy bear belonging to her dead child. Grief is a complicated and messy thing, even more so when dealing with the loss of a young child. I hope you never have to experience it.\n\nLosing that teddy bear was probably like losing one of the last links to her daughter and may have felt like Izzy dying all over again. You need to contact the toy drive and tell them that the bear got mixed up with the toys, see if they can find it and she can get it back. \n\nTo the rest of your post: she should not be pressuring you to volunteer, but it sounds like she wants to make sure that her daughter is remembered. Hopefully she is getting some therapy, but her grief will never just go away, she will never just get over it. instead, she will learn how to live her life around it.\n\nI have worked with a lot of families who have lost young children. Their subsequent children know about the sibling who died, this is common. Your son is capable of learning that he has an older sister who is no longer here. There are age appropriate ways to present that. I hope your wife, and you as well, are gettin needed therapy. Most of all, your wife needs of know that Izzy is still alive in her memory, and in yours. Izzy being dead does not mean that she is no longer part of the family, and it sounds like maybe ya ur wife feels like Izzy is being intentionally forgotten. Hopefully you can all find a path forward that honors Izzy’s memory without making you feel like your wife is guilting you.", "YTA x 100\n\nAs someone who has lost a child, if I was your wife, I’d be filing divorce paperwork ASAP. That was horrendously cruel. If you want any chance of reconciling, go retrieve that Bear immediately and get straight to therapy.", "> I did it because I feel like you need to let go\n\nNo, you did it because you wanted to hurt her. YTA.", "YTA this is the saddest thing I’ve read in a very long time. You are horrible.", "YTMFA. I can’t even believe this. She should divorce you immediately. \n\nShe shouldn’t have donated the hot wheels. But what you did is unconscionable.", "YTA. You are the biggest asshole in the world. Number one this whole post sounds like you dislike your wife !  I mean you sound like you can’t stand her for donating time and energy to a cause dear to her heart. You sound jealous of her child she lost and say she loves her dead child over the child you two have together.  You gave away her deceased child’s teddy bear just to be mean. You are so awful and you really need to get counseling.  I can not believe a husband could be so mean to his wife.  She needs to divorce you because you lack feelings and a heart. In case i need to say it again. YTA.. a huge AH", "YTA and a soulless spiteful creature. I would divorce your sorry ass over something like this. You don’t GET OVER losing a child you dimwit! Your son is old enough to understand death and loss and she SHOULD talk to him about his sister and about volunteering so he doesn’t become an inhuman flop like you! \n\nYou just ended your marriage and if a judge has any functioning brain cells you should have visitations of the kid at best!", "Wow dude... You're right.... You're N T A... You're the FUCKING MONSTER in this woman's life. NARCISSIST. YTA", "Bro, this wasn't just some old toy, this was a reminder of her daughter and one of the last things she had of her. If you're really comparing donating old toys your son will not care about later to something to remember her dead daughter by, you're going to get divorced\n\nI can't believe we have to explain the difference to a grown man. And I can't believe you're expecting her to just forget about her daughter and not acknowledge her existence anymore\n\nGet it together before you become a single father", "Holy fucking shit YTA.  If I were your wife, I would be meeting with a divorce attorney.", "YTA Yeah I’d divorce you. And frankly I don’t believe she’s as holier than thou as you describe. Based on everything you say I get  vibes you are embellishing. I know how kids are with toys. I donate old toys that don’t get played with but if the kid seems you or hears you donated it suddenly it’s the FAVORITE toy. Then they get over it. But even if he’s as distraught as you say it’s easily remedied. You replace it or take them to toy store to buy something new. Kids are easily distracted. What you did? CAN NOT BE REMEDIED.", "Your son will stop giving a shit about those hot wheels cars in like 5 years. \n\nYou got rid of a precious reminder of her dead daughter. \n\nYeah, you’re definitely the asshole in this one, man. You’ve got to be able to see that.", "YTA. There is no way for you to recover from this. Your marriage is over and you're a fucking monster. You are an evil vile creature. I hope this haunts you for the rest of your life.", "YTA - If you have even one ounce of a soul, which you don’t, you’d be trying to do everything in your power to a) get the teddy back b) getting down on your knees to beg forgiveness c) not fucking posting this on Reddit but trying to actually positively influence the situation.", "YTA. \n\nPretty sure the dead daughter's heart isn't as cold as yours. Jfc.", "I hope your wife files for divorce. You knew exactly what you did. YTA.", "YTA In fact you might actually be the worst person to be an A H on this thread.  I don’t care how you spin it you got ride of her deceased child’s toy- probably one of the only ones she has- to get even for her getting rid of one of y’all’s sons toys. Guess what you can go but your son a new toy if it was that big of a deal.  She will never get to give or have another toy for her daughter.  Hell is too nice of a place for you.", "YTA. This has to be one of the worst things I’ve ever read on AITA. How do you not understand this as a parent?", "Buddy your wife doesn’t need to make you out to be an unkind person. You just came right out and told us yourself. YTA obviously.", "YTA. Your nine year old is too young to know about his dead sister ? What \nWhen is he old enough 18, 21 ? He is never to young to know he had a sibling die. \n\nLord. You gave away the stuffed animal of your wife deceased child .if your son got killed tomorrow and someone came in to donate all his things you'd be pissed. \n\nYou don't get to tell her how to handle her grief. You don't get to get rid of Momentos of deceased loved ones especially a freaking child..\n\n\nI hope she serves your butt divorce papers. You can't come back from this.", "Stop posting on Reddit and go find that bear, asshole. \n\nYTA.", "You’re not TA, you’re a full on DEVIL. \nYTA too though.", "YTA You didn’t do it for her. You did it to her.", "How long do you think she would need to forget her DEAD CHILD? She has moved on, with an A H husband and had another child but there will always be a hole that Izzy left. \n\nDo you even like your wife ? Your description of her doing a good thing for sick kids and scared parents is holier than thou. \n\nCheck your ego and respect your wife. \n\n\nSo much more I want to say but I don’t want to get banned. \n\nYTA", "YTA. A mega gaping a hole. I really hope this isn’t real because if it it I will lose so much faith in humanity. If someone did anything like that that with anything of my deceased child’s belonging ballistic would be the nicest way to describe my actions. Good job dude. You lost your wife in one single, stupid, heartless action. I hope that proving your point was worth it. God, you’re a heartless monster!", "I want to say YTA but I don't think that will do justice to the magnitude of your cruelty. This is how you get a divorce with extreme prejudice", "YTA.  You should go to the hospital and try to get that teddy bear back.  I’d go ballistic too.", "dude go get the bear", "YTA This is...Unforgivably cruel. I don't know how to say what I want to say without earning the wrath of the mods.\n\nI hope karma comes for you in the form of a divorce lawyer.", "She will NEVER “get over” her dead child. A parent should never have to go through that, she survived the worst loss a person can suffer. \n\nYour son is not too young to know that he has a sister and that she passed. Your wife is not wrong for wanting to keep her daughter’s memory alive. \n\nYTA. The lowest type of AH there is. I hope she leaves you, truly. I don’t see how you can come back from this one. This is probably the worst thing you could do to her. \n\n\nIf you want any chance of redemption, go find that fucking bear.", "What the fuck.", "Guaranteed you get divorced.", "YTA. You still have a son. Her daughter is gone. Think about it. Would you still feel the same if your son was gone and she got rid of his hot wheels.", "YTA this was a really deranged thing for you to do. I hope you’re doing a lot of soul searching right now.", "YTA, her daughter died. You took away something she can never get back. You can buy a new hot wheels toy for your son. It’s not the same thing. To try and make it about her acting “unhealthy” on top of it is so wrong. If you felt she needed help, causing her emotional distress and throwing away memories of her daughter was certainly not the way to go. You shouldn’t expect her to forget or stop talking about her daughter that’s not something anyone just gets over.  \n\nFrom what you write, I don’t think she is shaming or pressuring you to volunteer. It sounds like volunteering and giving back is important to her so she wants to instill that in your son. Modeling behavior is important for kids maybe she’d appreciate not being the only one. That you would do something so cruel over a perceived slight is horrifying.\n\nAn apology is the least you can do, but there’s no recovering from this.", "YTA\n\nif you were my spouse you would be getting divorce papers before the week was over you absolute f***ing monster", "YTA. What you did was petty, cruel and completely devoid of empathy. It’s no wonder your wife tries to encourage you to volunteer, you definitely seem to be lacking in kindness and selflessness. Also 9 years old is not too young to hear about death or his late sister. It’s good that your wife is trying to teach your son to give back to the community while he’s young, especially when his dad acts this way.", "YTA. You can’t compare Hot Wheels that probably haven’t been touched in years, to an item that belongs to a dead child and had deep meaning to the child’s mother. This was soul crushingly, devastatingly cruel. She’s justified in her anger, and you should be ashamed. \n\nThe son you share absolutely matters, but you can’t expect her to just forget her deceased child to make you comfortable.", "YTA and if you even have to ask the question there is something wrong with you.", "YTA. Holy shit, you gave away your wife’s deceased daughter’s stuffed animal? That she was keeping? YTA", "YTA. My heart sank when I read this. How horrible.", "INFO:  What would you do if you had to bury your son?  If instead of him being in his room down the hall from you he was in a coffin, in the dirt, in the dark, alone?  How would you feel knowing you would never hold him again, never hear his voice, his laugh?  Her daughter is dead.  She's never going to be here again.  You took the last physical link she had to her dead child and gave it away.  Picture your son, dead and gone.  Now picture someone who claims to love you giving away the last thing you had from him.  How does it feel?", "There's no reconciling from this. You have already ended this relationship.\n\nWhat she did was an asshole move, yes. What you did was **absolutely vile**, and deep down you know it, that's why you wrote paragraphs upon paragraphs justifying your actions and painting her in the worst light possible.\n\nAnd guess what? Despite her being an ass, I'd still vote YTA because you tipped the scale way too much in this scenario.\n\nThere's a vast difference between some child's old toy and a memento from a dead child.", "YTA and those would be the last words I would say to you before I booted you out of my life.", "I’ve never commented on a post before, but I’m so disgusted by your actions that I had to post.\n**YTA**\nI hope your wife divorces you, you are cruel and what you did is unforgivable. \n**YTA**", "YTA, if it’s even possible you should try and get the bear back", "You vile vindictive motherfuxker. I hope for the greater good she dumps your disgusting ass with no remorse.", "INFO: Op I can understand that you got angry on your son’s behalf. But honestly can you explain your thought process? What did you think would happen? How did you see this situation working out? \nIs it possible to contact the organisation to get both toys back? Explain the situation.", "You said you donated your wife's deceased daughter's teddy bear  because she donated your son's hot wheels. I say your wife's deceased daughter because no good father would have done that. Why are you lying and saying you didn't do it out of spite when your own words said that you did? YTA", "It doesn't matter that she wasn't your biological daughter. You're still a terrible father and husband", "YTA \nI dont know if i trust your telling of your wife's holier than thouness, but carting off the hotwheels was a jerk move. Ok. She might be an AH\n\nHowever, that petty move you tried?  JUST WHAT? You thought that was an equal move? A good idea? Your level of AH eclipses hers by so many degrees i had to switch from e s h", "ESH\n\nDo yourself a favor. Go to the toy drive and buy back the items for a good price (if you still can). And if you can't find the hot wheels, ask your son what kind of hot wheels he would prefer and buy him some new ones (as a replacement for the hot wheels that were given away).\n\nThen, apologize for the teddy bear to your wife. And yes, I know. She needs to apologize to you too. But this is such a clusterf\\_\\_\\_k, we need to tackle one problem at a time.\n\nThen, you guys need to get some couple's counseling. If you don't get some counseling, this relationship is not going to survive, or even if it survives until your son turns 18, it's going to be a living hell for everyone involved until then.\n\nGet some counseling. Seriously. Be a broken record if you have to. All this guilt is not helping her. And all this resentment you have against her is not helping your relationship.\n\nI understand the point of the teddy bear, but you could just have hidden the teddy bear and pretended to have donated it, you didn't have to donate it.\n\nAnd your wife is an AH too, but since she's not here, I'm going to skip lecturing her. The only thing I'll say is that you both need to go to therapy.", "YTA \nHow about showing some interest in this meaningful activity your wife wants to share with you? How about supporting her in giving your son a connection to his sister and a really good lesson in compassion? How about you also take that lesson cuz you clearly fucking need it", "😢", "This post like your marriage is not going to last. She’s so quiet because she’s spending her available time finding the right divorce lawyer. I don’t see any way you can come back from this… but hey in 12 years or less it will mean nothing to you or your son, you can totally move on and have no lingering effects according to your rationale.  Her child died… died… put your son in that situation and see how you’d feel… you’re a whole new narcissistic level of YTA", "YTA", "YTA she will never be able to get back up bear. But you know what you can do by your son more hot wheels.", "Wow! Sorry to tell you buddy, but you are a HUGE AH. \n\nMy cousin lost her daughter too. The girl was only 60 days age, and believe me, she still keeps a teddy bear and a few clothes of her baby, even when she had another son two years after. Those things are valuable for her like the teddy bear of your wife's late daughter.", "YTA\nI cannot for the life of me fathom how you can rationalize your behavior. What you did is absolutely unforgivable. I don’t know how you can claim to love your wife after doing something so horrible. The ONLY way to even remotely right this wrong is to get that bear back ASAP. It won’t fully right it, the damage is deep, but nothing else you might do will ever matter. Get the bear back, encourage your wife to go to counseling, and find yourself a good therapist to work on some much-needed self improvement. Yikes. This may be the worst thing I’ve read on this sub.", "ESH. But you especially OP. Your wife seems like a great person generally, but guilt tripping people is really mean, and she handled the donating of the hot wheels really badly. But you... You decided to get revenge, and really nasty revenge at that.", "Wow YTA. Heartless.", "YTA. Move out and prepare for a divorce.", "YTA, YtA, YTA. Go beg for that bear back!", "YTA. YTA. YTA. Oh and YTA.", "Yta & I would expect divorce papers are being drawn up.  At least that’s what I would be doing", "YTA and trying to justify it with a weak excuse about helping her. Which you absolutely were not helping, you were getting back at her.", "YTA YTA YTA and definitely YTA\n\nyour wife should divorce you & take everything from you", "You are a sick fucking person", "ESH except your son, how about actually trying to listen to each other instead of trying to say why the other person is wrong? News flash both of you are", "YTA, who gives someone's dead child's toy away to prove a point! Esp a teddy bear!! Oh wow....", "YTA. The teddy is a memorial item and while your wife maybe shouldn’t have given away some toy cars, they can be replaced if your son really misses them. The teddy on the other hand cannot. Grief does not have a timeline. You spoke about the fact you feel your wife is shaming you into volunteering and how that upset you. How about you take a little time to think about how much sense it makes to shame your wife into “getting over” a very traumatic experience of losing a child by giving away something that is obviously special to her.", "YTA. This is something you can never make up for. You probably just ended your marriage.", "YTA. What you did is cruel and unforgivable.", "YTA\n\nYou used her trauma to \"teach her a lesson\" and now you don't understand why she has disassociate? \n\nYou do not deserve her or anyone", "This is so bad I hope it’s fake. YTA.", "She’s grieving and you just… bro I’m seeing red I can’t type.", "YTA!!! Look I don’t think it’s nice of your wife to donate your son’s toys without his consent. That’s not a good parenting move. But you know what? Your son is ALIVE. He can have new toys or gadgets in the future. \nYour wife’s daughter is DEAD. As in, NEVER COMING BACK. She will never have another teddy bear, because she’s DEAD. You got rid of an irreplaceable item connecting your wife (who I assume you claim to love) to her *dead child.* you don’t just “let go” of a grief like that for Christ’s sake.", "YTA\n\nThere is a very, very big difference between toys that your son no longer plays with, and the teddy bear that belonged to your wife's dead daughter.\n\nThat you see the two as equivalent is, honestly, scary and more than a little narcissistic.", "ESH. She had no right to take his cars. But the teddy bear thing is like launching a nuclear strike at a farmers market to stop shoplifting.\nProportionality matters.", "TL;DR You and your wife have a toxic relationship, and neither of you cares about the impact on a 9 year old from your passive-aggressive attacks on each other.  ESH, but the level of cruelty of what you did is just off the charts.  The reason she's quiet is because she's filing for divorce.  And honestly, it will probably be better for both of you.  But I feel for the kid caught in the middle.", "Get a lawyer. YTA.", "YTA big time. The fact that you have to even ask shows that you think about no one but yourself. Don’t be surprised when you’re handed divorce papers.", "Yta wife not great either but what you did is unforgivable", "YTA. That wasnt a toy you donated, it was a precious memory of her CHILD. Shes never going to get over it..losing a child isnt something you get over. Shes doing everything she can to honor her daughter and live as a good person. Maybe she crossed a line donating her sons old cars..but did he even play with them or is he just mad they are gone? Cuz I donate my kids old shit twice a year and she throws a fit about toys she forgot were even there till she saw them in the donation box. \n\nSeriously. Grow a heart and think how your wife is feeling. You just basically told her that her grief dosent matter over toys.", "Usually, when I read the title I try to reserve judgment until I read the details. In this case, none of these details justify the fact that her child died, and you gave away an extremely important keepsake that your wife remembered her by, ON PURPOSE, because you were upset. If I was her, I would never forgive you, EVER. Maybe try having a conversation next time, if it's not already too late. \nYTA a million times and forever!", "Yes,  and massive one at that, there is not enough negative things that can be said about you", "You're both assholes in your own ways. I agree with other posters, your donation of the teddy bear was WAY out of proportion to hers with the cars.\n\nI sense a divorce is coming fast, and honestly, I think it'd be a good thing for you and her, but your poor son.... You make decent points about her mental and emotional states, and she's definitely going to negatively affect your son in that state, but you really fucked up with the teddy bear donation.", "Pretty sure you’re relationship is done.  Both of you sounds like d*cks", "Do you even have to ask? YTA. Jesus Christ", "YTA and I am pretty sure that there is no coming back from this for you. You should get into some type of self awareness therapy so you don't make mistakes like this in your future relationships.", "YTA. HUUUUGE asshole!! If you love your wife (it seems like you don’t but ok) you need to go to the hospital and BEG for that bear back. This is such a horrible horrible thing to do dude I’m shocked. Ignoring you is a tame punishment…", "YTA. I would divorce your ass because you are petty and childish and cruel. If she forgives you then she’s a much better person than I and definitely not holier than thou cause thou art an asshole.", "Yta", "Wow. Just wow!!! You're the AH. \nYou never, NEVER, throw away something of sentimental value the belong to anyone who passed away. Especially if it's not directly related to you by blood, friendship, mentor, or whoever it might be. \nHow utterly heartless.", "You very clearly did that so you could hurt your wife emotionally. You give a long spiel about your grievances, which may or may not be valid, but then your solution was to spitefully give away something, with the goal of hurting your wife. Huge YTA", "No parent ever \"recovers\" from the death of a child. You can't juar let it go, What kind of cold hearted crap is that? The way you talk about her is a big red flag. And what you did is unforgivable and cruel, YTA of all the AH's.", "What you did was vindictive. You meant it to be mean and vindictive. \n\nEither you are an abuser or you had a moment of a *massive* fuckup in judgement. But either way, what you did was motivated by nastiness and nothing else. \n\nYes, your wife needs therapy. But you are such a gaping AH that honestly I hope that healing leads her to realizing she deserves better than you. \n\n\nYTA", "Wow. YTA.\n\nDude, losing a child is not something she'll ever \"get over\".  She's going to be mourning that loss one way or another for the rest of her life. If I had to guess, trying to get y'all involved in her volunteer work is a way of sharing the way she deals with her pain.\n\nShe made a misstep in her parenting. Probably should've gotten your son's consent before giving away his toys. But you go nuclear and give away her dead daughter's teddy bear? Jesus Christ.", "YTA. My brother died. He always used to wear a jacket which I will now guard with my life, if someone had to just give it away under my feet without telling me I would be devasted.", "YTA!!\n\nMy daughter died before she even got the chance to have a teddy bear, all I have left of her is her blanket she was wrapped up in. If my husband ever threw away her blanket my marriage would be over. There’s no coming back from this!", "This is genuinely one of the most upsetting posts I’ve seen in this sub. I really hope you can find that teddy and get it back. This action adds to her trauma - it doesn’t help her move past it. YTA", "This hurts my heart so bad. I haven’t lost a child but I’ve lost my only sibling. I don’t know that she’ll ever be able to forgive you for that. I can’t understand how anyone could do something so heartless. She may have been pushing too hard but she’s been in survival mode. YTA", "INFO: have you told her you feel like she’s guilting you and being passive aggressive? Maybe she doesn’t realize it. \n\nOtherwise ESH until further notice. Guilting and shaming your spouse is a shitty thing to do, regardless of the reason so she shouldn’t do that. It was out of pocket for her to donate Richie’s toys that he’s had since toddler-hood, and then dismiss his emotions when he got upset. You did the same thing to her that she did to Richie. And if she’s so staunch about volunteering for the hospital, and was okay with giving her 9 year old kid’s toys away without asking him, why not?\n\nAt the same time, I do think you were out of line for giving away the bear. While trauma is an excuse to be a dick to other people, it’s a difficult thing to navigate and can make people act in strange ways. Loosing a child is probably one of the worse fates in the world, and you severed one of the last ties she had to her dead daughter.", "This is straight r/amithedevil shit right here...yta", "You're not an asshole, you're an insensitive monster. Dude, why are you married to someone you can't stand? If everything she does is so bad that even charity bothers you, break up, let her find someone worthy. YTA.", "Your wife is not talking to you because sh is talking to a lawyer. This can not be fixed. You do not like your wife let alone love her. You obviously resent the fact she had a child before you. You won’t allow her to talk about that child.  You begrudge the time spent doing work In remembrance of the child, You became angry at a perceived insult to YOUR son;  then decided to give a way a 10+ year old teddy bear that was important to her but not you. You made the choice to go the most hurtful thing you could in retaliation.  At the same time you removed a physical reminder she had a life and child before you. IF you EVER cared for this grieving mother LEAVE HER THE HELL ALONE!!!  You have done more then enough damage.", "YTA man, face it. That teddy bear wasn't merely a toy like the hot wheels were - it held sentimental value.", "You are 110% TA.  You really need to get back the bear if you can.  That was very spiteful and horrible of you.  :( I would freak.", "You’re beyond just an ah… wtf\nYta", "YTA Holy shit. You aren't just an AH, you're a vile vindictive AH. I could never fathom doing that to someone I claim to love. I hope you enjoy being single.", "This was a lot of words for “I hate my wife and want to punish her”.  YTA.", "ESH but you're a real fucking monster", "YTA you need to talk to her and you can buy more hot wheels but a dead daughter's teddy.... no dude thats just cruel. \nGet your wife into therapy and explain you are not volunteering and to never bring it up again. But you have to get that bear back now!", "YTA big time. You took something that was a reminder of her lost child and gave it away. I hope she divorces your butt.", "I legit need to post for a third time in a row to tel you now Fucking disgusted I am by you", "ESH\n\nTwo wrongs don’t make a right.\n\nYour wife has a lot to process, and she was clearly in the wrong about giving away the car.\n\nHowever, you are also the AH because \n- giving away the bear was clearly borne from retribution and\n- will only bring up painful memories for your wife\n\nIf you truly cared for her well-being, you would not have done that.\n\nI really feel bad for Richie in all of this", "YTA", "YTA.\n\nYou were mad your wife donated Richie’s hot wheels without discussion. \n\nImagine how mad you’d be if Richie was dead and those were one of a few mementos you had left to remember him by.\n\nIn case I wasn’t clear - YTA", "YTA.  \n\nAn eye for an eye makes the whole world blind. \n\nWhile your intention was to cause her to see how her actions were hurting your son, you actually caused trauma to your wife. \n\nPerhaps she needs therapy to deal with her loss but taking a cherished item that belonged to her dead daughter was definitely not the way. Your behavior is cruel.", "So let me get this straight. Your wife thoughtlessly donated something belonging to your son. You then looked at the pain of that situation and decided you needed to hurt her BACK. You weaponized your wife's grief and attachment to her deceased child in order to take revenge on her. Do I have that right? Is that what you wanted? Do you feel good about yourself? \n\nOh my god YTA.", "YTA. Your wife needs therapy and some space from you. She acted coldly, but you were punitive and contemptible. You need more than therapy, you need a swift kick in the a**.", "Yta. Her behavior was bad, you just did something unforgivable.", "Omg YTA.  My heart breaks for your poor wife", "yikes. Riche is still here, Izzy isn't. YTA - she doesn't need to let go. She lost her daughter and that will weigh on her for the rest of her life. grief never really goes away, it just changes. You took away something very important to her. If I was her I would never forgive you for that. \n\nThere were far better ways to have this conversation with her, you fucked up big time.", "ESH Except the 9 year old.\n\nBut your wife at least has an excuse - a parent should never have to bury a child and it's incredibly hard to deal with. This buys her a lot of slack. \n\nWhat's your excuse for being a blazing AH, op?", "ESH. She shouldn’t get over it, but you’re right about how she’s acting being unhealthy for her and your son. Your actions were an abusive way to try to teach her a lesson. Your marriage is probably over but I think all of you need therapy together and individually.", "Yta not your precious bear", "YTA - a really twisted one", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife(35F) and I(39M) have been married for about 9 years. Before we were married, my wife had a daughter Izzy, who unfortunately died when she was really young. We have one son together, Richie(9M).\n\nLosing Izzy hit my wife really hard, and even today, she's still not completely recovered from it. To honor her, she volunteers at our local children's hospital. She already works a busy job, but still finds the time to volunteer, as she is very dedicated. She also donates to the hospital as well.\n\nThe problem is that she is very holier than thou, and keeps shaming me for not wanting to volunteer. I mean, I feel like she should be able to choose to volunteer with this organization if it's meaningful to her, but I just find it weird and annoying how incessantly she constantly bugs me to volunteer, and shames me, making me out to be an unkind person. She doesn't do it outright, but it's very passive aggressive.\n\nAs richie's gotten older, she's been telling him about why it is important for us to volunteer, and how he can honor his older sister. She's talking a lot about giving back to your community, and how good people always find time. It is nice, but I just feel like she's pressuring our son, and kind of like forcing him to do it in a guilt-trippy way, and I also don't think he's old enough to hear about Izzy. It's just a really sad and awful thing that he's not emotionally ready for.\n\nThe hospital is holding a stuffed toy drive, so my wife, without telling Richie, gave his old hot wheels he had when he was a toddler to the hospital. When he found out, he was understandably distraught, but my wife told him that he was too old for those silly toys, and that younger kids needed them more.\n\nWhen I found out I was absolutely fuming. I tried to talk some sense into her, but she wouldn't listen, so the next day I took Izzy's old teddy bear and donated it. When my wife found out, she was absolutely ballistic, but I remained calm and told her I did it because I feel like you need to let go, and that you are holding your deceased daughter over our son, and you're not there for us. I explained that you need to properly deal with this grief, and that you're acting very unhealthy, but she just went really quiet and stopped listening to me, and now it's like I'm not even there. She's been ignoring me since, and I tried to explain or reconcile, but she's not listening to me, and I don't know what to do\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Coming from someone who has had to explain to my younger sister what my older brother was like and not have anything that reminds us of him to hold dear, I sincerely hope that you stub your toe and crack your toenail in half everytime your wife remembers you got rid of her last material to her daughter.\n\nIt would be a mere fraction on the pain.\n\nFuck yourself, YTA.", "Congratulations on ending your marriage", "This may be the post that completely ruins me for Reddit. OP you are disgusting and cruel and so obtuse that you can’t fathom what this “wake up” could mean for the rest of three people’s lives. YTA. Jeebus help you", "YTA. She will mourn her dead child until she herself is dead. She will not mourn this marriage when the judge signs the divorce decree.", "Been on this sub for a while and this is up there with some of the worst fucking things I’ve ever read. This is a woman you supposedly love? How could you be so insanely cruel to a woman you care about? \n\nAsshole does not even begin to describe it, I hope this is incredibly out of character because this is egregious. \n\nYTA", "My infant son died two decades ago and I still haven’t “recovered.” And the day someone packed up the only thing I had left that was ever touch by him, I lost it.\n\nYour wife will never touch Izzy’s face again, never hug her, never buy her birthday or Christmas presents, and never sit down and talk with her. She’ll never see her go on her first date, act in a school play, or graduate. All she has, and all she ever will have, are *things* to remind her of times with Izzy that now live only in her memories. Well, unless you donated the only thing left. If that’s all she had, I’m willing to bet it felt like another death, because the only physical thing she had that her daughter had interacted with is now gone. \n\nPlease try to get that stuffed animal back. It could mean so much more than you realize.\n\nYTA\n\nEdit: a sentence missing a comma", "YTA. No matter how you try and dress it up, this was nothing more than petty revenge taken waaaaay too far. It’s likely to cost you your marriage, and quite frankly, it should. What’s even more disturbing is your attempt to paint this as altruistic. Even if you’re right, and she isn’t processing her grief in healthy way (by the way, you haven’t made that case; from your own description she’s just honoring her daughter’s memory as best she can), how on earth could you come to the conclusion that getting rid of a cherished memento of her dead daughter would be helpful? You can’t jar someone loose from their trauma with more trauma; you can only compound it that way. Either you had an “oh, shit” moment after you’d irrevocably given away the bear and tried to cobble together some bullshit story painting you as the good guy; or you actually believe that a parent who lost a young child would benefit from having her daughter’s keepsakes tossed away. Frankly, I don’t know which would be worse. You’re definitely the asshole on the parlance of this sub, but in reality, asshole isn’t a big enough word for your monstrosity.", "You are a wicked, selfish and pathetic human being.", "ESH, based on your description she is out of line constantly pressuring you and your 9 year old to \"volunteer\" and guilting & shaming you to whatever extent you don't spend your spare time doing so, and likewise giving away your son's treasured toys as a donation.  (My son would react the same.)  But giving away her bear is something you knew would be hurtful - it's clear you did it intentionally because you felt her repeated condescension to you about her own volunteering is disrespectful but that doesn't make it ok.  \n\nI would say you both need to communicate like adults but if she's treating you like an ass hole for not following her into spending her time volunteering to honor her daughter on a daily basis, then it may be she just isn't really as emotionally invested in the relationship anymore.  You cannot really force her to stop, but it obviously may have a destructive effect on the relationships (or may just be revealing the degradation of those relationships), and maybe all you can do is tell her you love her but treating you as \"less than\" because you're not invested in this is seriously damaging the relationship, and if she wants to stay together she cannot adopt this attitude towards you or speak to you in this way.  Sorry for you both and good luck.", "you are kind of the ass hole, you can buy your son a toy but her dead daughter won't come back.", "ESH.\n\nWhat your wife has been doing is wrong, but that doesn’t absolve you either.", "You complete AH. Wtf.", "YTA. I can't imagine how she could stay married to you.", "YTA. Encouraging kids to get involved in community service and talking about values is called “parenting.” You should do some research on the topic, as you’re about to become a single parent.", ">making me out to be an unkind person\n\n...you gave away an irreplaceable keepsake to spite your wife because of her *audacity* to encourage your son to help others\n\n&#x200B;\n\n>I don't know what to do\n\nIdk, apologize? Try to recover the bear? At least stop trying to \"explain.\" Stop trying to justify what you did. YTA\n\n&#x200B;\n\nEDIT: a word", "YTA. How dare you throw away a piece of her daughter like that. \nIt sounds like she really wants to honor her DEAD CHILD by volunteering and wants to encourage your guys son to do the same for his DEAD SISTER. It doesn’t matter if they ever met or not, it’s still his sister and your wife likely wants him to know about her & her life spent here. It’s really weird of you to be exhausted by your wife’s grief that will likely never go away because she lost a CHILD. \nI can’t believe you threw away her dead babys bear in spite. Pure evil.", "This is hands down the most vile, pathetic, abusive thing I have read on this subreddit to date.", "YTA\n\nYour only hope is going to find that bear. What did you think would happen at the end of it? She’d stop badgering you about volunteering and kiss your feet?! Yes what she did was wrong, but what YOU did was vile. \n\nGo find the bear and hope she hasn’t considered speaking to a divorce lawyer.", "YTA. sure what she did was out of line but i think you're a genuinely evil person. she would be smart to leave your absolutely horrible, miserable shell of a man. i would do much worse than leave you if i was her though.", "Clearly, your wife has issues with her daughter’s death and hasn’t moved on, though she seems to be doing her best. It was insensitive of her to donate your son’s toy. Your move, however, was spiteful and deliberately cruel- and you’re worried about *her* passive-aggressiveness?  YTA.", "Weaponized sharing truly sucks.", "A parent doesn’t get over the death of child. Ever. They learn to cope with the grief and try their best to live life. It’s a terrible pain and by the sounds of it she needs to seek grief counselling. There is no shame in that at all. Her doing her charity work may very well be her way of coping but that said pushing your son into without explaining why, he’s certainly old enough to understand about his big sister, is a very gentle AH move especially with his toys. Parents, even years, after the loss of a child sometimes do things that make no sense. You learn to deal with it. \n\nBut that said…taking her daughters bear and giving it away? I would loose my mind if someone did that to my very precious things from my family members that aren’t with me any longer. \n\nYou NEED to retrieve Izzy’s bear pronto! Apologise to your wife profusely and help her seek some much needed therapy. In fact therapy all around wouldn’t be a bad idea. \n\nYTA here but gently. \n\nNow get off Reddit and retrieve Izzy’s bear!", "You and your wife are both YTA...I feel sorry for your son. He is the one who is paying for his mother's pain.", "Yta", "YTA and I think your marriage is over.\n\nTrue your wife shouldn't have taken away your son's hotwheels. He deserves to be upset about that. But he is alive and will get to have many more joyful experiences in the future that you'll get to see and be part of. Your wife's daughter is dead and the teddy bear is one of the only tangible links your wife now has to the *far too limited* number of joyful experiences she and izzy got to share together. And you took that away.", "Esh, although your wife has serious issues that need to be addressed in therapy, you clearly went too far. There’s no way you feel good about what you did.", "YTA", "YTA YTA YTA", "ESH - your wife absolutely needs professional help to deal with her tragic loss. Your son needs to be safe from those without his best interests in mind. \n\nYou went straight for the jugular giving away that stuffed animal- and you know it. I hope that you were at the end of your rope and acted irrationally, rather than be irritated that she was acknowledging an existence before you showed up. Hiding it might have been forgivable, losing it forever opens the path to divorce\n\nYou were understandably frustrated, but that was cruel. How do you do that to the woman you love?", "YTA. \"Just cut the crap and get back the damn bear.\" -- Rose Nylund", "Whoa. YTA", "You have NO IDEA what this is like for her. Yet you decided that she has had enough time to grieve and took away something she can’t get back. Something that connects her to her DEAD daughter. Someone she will never get back or ever see again. This is just wow. I know people can be horrible but this is just… not enough words to describe it.\n\nYTA and I hope she leaves you because she should.\nNo excuse you use justifies this in any way", "Wife sounds like an ahole too. But yeah you took it too far. Go get the bear back and try to have an adult conversation with wife about how it makes you feel when she mentions you should volunteer. People grieve in different ways but no need to punish each other.", "YTA. And, congratulations on destroying your marriage", "YTA\n\nA lot of passive aggressive business is going on here and you are in the wrong.\n\nHowever, it is different for both of you. You gave away a teddy bear (the last memory that she physically has of her child) that can never be replaced while she gave away a Hot Wheels that she thought your son didn't need any more. You can just as easily purchase a new Hot Wheels set for your son while she cannot purchase a new teddy bear that will hold the same memories.\n\nA parent should never have to bury a child. The grief that goes with that… I can't even explain it.  And you had the audacity to sell your wife's daughter's teddy bear. Despicable.", "YTA\n\nWhat you did was cruel, spiteful and on purpose. That was a teddy that held significant meaning to your wife, it wasn’t just some Hot Wheels sitting in the bottom of the toy box not being used. \n\nI implore you to do everything you can to get the teddy bear back. Do you not see how callous that was?", "YTA, 1000x over. For donating the teddy bear that belonged to your wife's deceased daughter, for what you said to your wife about her grief over the loss of her daughter, for how you speak about your wife's grief to strangers online, for refusing to volunteer even occasionally to support your wife, and for trying to sensor the fact that your son has a sister who passed away.\n\nHer keeping the memory of her daughter alive isn't taking away from your son. It sounds like you just expect her to forget the child she lost because you two have a son together. I'm sorry, but that's just not how life works. \n\nYou could have handled the hot wheels situation a lot differently. Donating that bear was unacceptable and, quite frankly, unforgivable. This is something you can never take back. She will resent you for this.", "YTA\n\nShe should divorce you! I can bet she’s contemplating it. You want her to forget her daughter. She wants to teach your son about charity work, donations and remembrance of his sibling.\n\nYou can buy your son more hot wheels she cannot buy her daughter another teddy bear AH", "YTA and I could say so much more about this and why, but most people have already said why and I just don’t have the energy to go into it, because the assholes have been so strong on this sub today that I can’t deal with one more. I just can’t. Wow. What the fuck is up with the universe today?", "YTA. You can easily replace the hot wheels, you can't replace that bear. What you did was vengeful and so, so cruel. The loss of a child is not something someone just gets over, and her grief is fueling her desire to volunteer. \n\nHave a serious talk with her about how you don't really have the desire to volunteer, but you could do something else to give back. Maybe there is a charity event that might lines up with your interests as a way to raise money instead? \n\nTry to retrieve the bear.", "YTA.\n\nI’d be devastated if something happened to my children’s teddy bears, and they are teenagers and ALIVE\nThey are the one item that I’ve kept from their childhood, and they are incredibly special to me.\n\nI know it sounds like Reddit dramatics, but honestly if my husband did something so cruel and heartless I’d divorce him in a heartbeat, what you have done was cruel and done with malicious intent.\n\nYes it was shitty of your wife to donate your sons hotwheels without asking, but that can be fixed and she could make it up to him.\nWhat you have done cannot.", "The bright side is you won’t have to deal with your wife’s emotions for much longer!\nY. T. F. A.", "YTA, I *genuinely* hope she leaves you.", "YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA! DID I SAY IT ENOUGH? NOT EVEN CLOSE TO ENOUGH TIME TO ADD AS MANY AS THERE SHOULD BE!", "You are the AH.  You gave away a memory of your wife's child.  I  have tears for her.  What is wrong with you??? Get the bear back.   She thought she could trust you with the most vulnerable parts of her heart  and now she feels like she can't.", "YTA\n\nWhy don't you donate your head? You obviously are not using it.\n\nYou never ever ever ever give up a memento of a deceased loved one. My mom died 14 years ago. I still treasure special mementos.\n\n Congratulations. You just caused your son to live through the trauma of a divorce. She has given up on the marriage.", "It’s shocking that you even need to ask. YTA", "My God.  YTA.  Get ready to be single.", "YTA - no further explanation needed. wtf", "Get the goddamn bear back, asshole.\n\nYTA", "YTA dude using a person's dead child in some petty move is evil. Fuck you.....", "Massive YTA and I sincerely hope she divorces you.", "This reads like a horror story…I knew the horrible ending before i started, but I kept reading, in disbelief that you would actually do it…", "YTA wow. She doesn’t need to EVER let go or move on. This was a memory item that cannot be replaced like a $1 Hot Wheels car.", "YTA I would divorce you over that. If my boyfriend donated my last gift from my mom to prove a point he would be gone. My mother will never give me another gift. I can’t imagine that her child that was supposed to die after her and she can no longer buy or do things for last gift is gone. \n\nYou could have suggested grief counseling", "What’s wrong with you? YTA.", "YTA.  You’re not just an asshole; you’re selfish, controlling and utterly manipulative.  What you did was so far beyond cruel there really are not words for it.", "INFO: What in the actual hell is wrong with you?", "YTA I can't even say what I want to or I will get banned. I suggest you dedicate your  life to getting that bear back, and don't be surprised if she hands you divorce papers.", "YTA\n\nSuch a heartless thing to do. \nYou acted so selfishly. My heart breaks for her.\nI truly pray you never lose a child and have to experience the constant heartache that comes with it. It feels like you can barely breathe.\n\nIt never goes away. You just learn how to live knowing that a part of your heart will forever be missing.\n\nShe found a way to use her pain to help others and is teaching it to your son. Teaching him to be kind to others and to pay it forward.\n\nShould she have selected the toys to give away with him? Yeah, maybe.\nBut children stop playing with their toys ALL TIME and only remember them if a spotlight is put on them.\n\nWhat you did wasn’t to teach her a lesson.\nYou did it as a tit for tat. You knew what you were doing! And now, you’re playing the victim, trying to explain your pathetic self under the cover of her \"needing to properly deal with her grief.\"\n\nDon’t pretend that you don’t understand that volunteering to help other children and encouraging others IS a healthy way to deal with her loss.\n\nThis would be such a dealbreaker for me. Don’t be surprised if it also is/becomes one for your wife.", "I rarely say this but I hope she divorces you... massive YTA", "YTA. It is not YOUR job to teach your wife a lesson. You are not her parent. You can speak to her about what she did in a calm and adult way. She’s already been raised. What you did was very very cruel and not the same as giving away Hot Wheels your kid hasn’t played with in years. Sounds like you are jealous of a dead 9 year old.", "YTA and when your visiting your child on your weekend I have a feeling you may realize that.", "The title was enough to know YTA…\nBut holy shit you did it as revenge? Pretty horrific.", "YTA. Sounds like you’re jealous of a dead child. What you did was unspeakably cruel.", "JFC, dude.  Her child DIED and you decided to use that to try to teach her a lesson?\n\nNext time, use your big boy words and have a conversation instead of trying to manufacture a teachable moment.\n\nYTA", "YTA - I don't need to repeat the reasons as everyone else has said it. But wow, on the AH scale, this is one of the worst I've seen", "YTA.\n\nMy kids all were voluntold to get involved in community events and projects.\n\nWhen my daughter got her first paying job at 15, she had almost 200 volunteer hours.\n\nMy ex and most his family do not donate their time at all.\n\nMy kids are all well rounded adults who have donate toys, time and money to community groups.  They still are generous in donating their time.", "You did WHAT?! Yes YTA. I hope you never have to bury a child. Even an ADULT child. My grandmother never got over my mother dying and thought it was unfair that she, my grandmother, was still alive while her daughter, my mother, was dead. It took her 7 years, but my grandmother started to die the minute her daughter did. My best friend never got over her 39 year old daughter dying and died of a broken heart 13 months later. You don't get to tell someone how to grieve, especially if it is something you can't relate to. GO GET THAT BEAR BACK!", "Why on earth would you donate your wife’s dead daughter’s teddy bear if you knew how much it meant to your wife?! The wife should divorce you because what happened if your wife did that to you when your son died?! You wouldn’t like that right?! How are you gonna get the piece of her daughter back?! \n\nYTA!!!! 100%!!!", "YTA this is grounds for divorce.", "YTA. No, actually you’re worse, you’re a monster. Izzy is gone, your wife will NEVER get her back and you donated her stuffed animal, which I’m sure was a precious momento. Also, your wife is doing the right thing by teaching your son the importance of volunteering, volunteering is a great way to give back to the community and it can be very humbling. I spent my childhood volunteering at hospitals, old age homes, and homeless shelters and it taught me a lot important life lessons, the most important ones being how to be a compassionate and generally kind person and how not to be a judgmental AH (most of the time, I make some exceptions). Clearly someone here missed those lessons.", "YTA and I smell a divorce coming so don't be surprised OP.", "JFC. You have invented a whole new level of asshole-ism. \n\nYTA.", "YTA. What you did goes so far beyond asshole that it will take a thousand years for the light from asshole to reach it.", "This might be the most YTA I've ever seen. If you gave away my deceased daughter's precious toy, I would rain a fury down upon you so hard, you'd have to be reassembled by air crash investigators. \n\nYour wife sounds like a AH too. But she's your standard, garden variety AH. Seems like you two shouldn't even be married. And you seen unhappy\n\nBut regardless of what she did or who she is, you crossed a line, then kept going until you crossed another line, on and on until you crossed the furthest line there is. Actually, they had to draw a NEW line behind you for what you did. \n\nYou are already irredeemably lost. No amount of action can ever undo this. But still, if you don't/can't get that bear back, then you are somehow even worse than irredeemably vile. This is NOTHING like your son's toy. N O T H I N G\n\nImagine it the other way around. If you had to endure the worst pain in the world. If you had to bury your sweet child and you held on to his favorite toy just for some self absorbed AH to give it away out of spite. \n\nI want to say so much more but I don't want to break the rules here. I hope you never sleep a restful night again. I hope you wake up in cold sweats every hour with the realization that you destroyed a precious connection between a mother and her dead child. \n\nFrom the bottom of my heart, F you", "I hope I’m wrong about being an atheist. Just so I can know there is a special place in hell for you after what you did. \n\nIn case I wasn’t clear enough YTA", "I’d leave you in a second if you did that to me.", "JFC YTA. This is the cruelest thing I have read on this subreddit. \n\nI hope you understand your marriage is over. Even if you get that bear back there is no coming back from something like this.", "I’m so devastated for her right now I don’t even what to tell you.", "YTA there is no time limit on grief.  I lost my best friend in 2014, my dad in 2019.  I miss them terribly, some days more than others but I still miss and care about them.  \n\nDonating that teddy bear out of spite has to be the worst thing I’ve read this week.  You are jealous of a dead child.", "YTA five million times over, you gave away a momento of her dead daughter as an act of revenge over a hot wheels toy. Your son is alive, you will have a whole with him. She buried her child and that teddy bear is one of her toys, a life cut short. And you had no right to judge or tell her how to grieve or remember or honor her daughter. Its sickening that you did this to her. You’re not just an AH, you’re a monster.", "YTA. DUDE. WTF.  \nYou don’t get over losing a child. That toy wasn’t just a toy she can go get another of. Those are memories and the only things she has to show her daughter ever existed. Unforgivable.", "WTAF OP that was one of the lasting things she had of her DEAD daughter. They were old hot wheels and can easily be replaced. The memories,love,and sentimental value of that doll cannot. HUGEEE YTA", "ESH but you more.", "YTA.  Yes, your wife is unhinged and heartless.  She gave away your son's precious memories, so you did the same to her.  Wanting to do the same to her is completely understandable.  Giving in to it, though, is wrong.\n\nThe thing is, you did have other options.  Get her into therapy, divorce her, get or buy those hotwheels back from the hospital.\n\nYou need to work at solving the long-term problem of your wife.  Getting rid of the bear doesn't actually advance this goal.\n\nThis has gone on too long.  Plan and take some steps to do something about it.\n\nETA second thoughts...\n\nUnless you get the bear back, you've already destroyed your relationship with your wife.  Try hard to retrieve it.  Even if you succeed, the damage is deep.\n\nRegardless, your son should be your priority.  You must not let her damage your living son in the name of her dead daughter.", "YTA. And gross.", "YTA. I think she needs to move on too, but there's better ways of helping her move on, and giving away Izzy's teddy bear is not it.", "YTA. Your wife is also an AH for giving away the hotwheels but you took it wayyyyy too far", "It’s clear you’re not listening to those explain why YTA so why even ask if not to gladiator your own ego? I hope she leaves you, it would be the best thing for her. \n\nHopefully you reflect on this and take yourself to therapy to be a better person for yourself and your son.", "ESH.  Your wife was wrong to do that up your son.  What you did was a whole different level.  Your son is here.  You can replace those toys and tell your wife if she touches them again, she will get divorce papers.  What you can’t do is give away sentimental items from someone that passed away.  I’m pretty sure you will be getting divorce papers.  You both need therapy.  Your behavior was inhumane.", "... You seriously compared a meaningless hot wheels set that a child simply outgrew, to a teddy bear that holds significant emotional meaning to your wife because it belonged her *deceased* child. The fact that you even have the gall to ask if you're an AH is despicable. \n\nIn case it isn't clear, YTA. Fucking *wow* dude.", "ESH. Your wife has not dealt with it and is taking it out on your son. Giving away HIS things and guilting him is emotional abuse. Not seeing that she has different rules for herself as far as donations is messed up. That being said if that was the only thing she kept of her daughters ….. you are the a hole. If she has other things left then I would say you are not the a hole.", "Both of y'all are aholes. She's an ahole for giving away something her son loved and didn't care about how he felt. And you're an ahole for donating probably the only thing she had left of her late daughter.", "ESH. I mean your wife sucks for donating your (both of yours) son's toys, but boy didn't you go for the juggle.\n\nYou could have said \"how would you feel if I donated the teddy bear? Would you feel the same way?\" Or shit like that if your wife was not listening to your reasons why your son was mad/bummed about his toys being donated.\n\nAlso, you could have donated your wife's make-up, favourite clothes, shoes or something that doesn't hold so much emotional value if you wanted to act out of spite and wanted to hurt your wife. But you HAD to stab her in the back AND her heart at the same time.", "I was gonna say N T A up until the bear... oh my fucking god YTA. Her daughter is dead and that bear was one of the only things she had left of her, and you think that's equivalent to some 1.50$ hot wheels from Walmart your kid hasn't played with in ages??? I don't agree with her pushing you into volunteering (if that is true), but that's nothing in comparison to you saying to a mother, to your WIFE, that she should just \"move on\" from her deceased child.", "ESH but especially YOU", "YTA\n\nMaybe if you had put just a tiny little bit more thought into this, you could have realised that you didn't need to ACTUALLY donate the teddy bear to prove your point, you just had to *say* you did. Let her freak out over it, then show the bear is safe, then follow up with \"Do you see how not okay stuff like this is?\"\n\nBut instead you fully committed, probably out of spite, and now the lesson you risked so much for is lost in the wake of you donating a symbolic and treasured possession of your wife's late daughter. You should have realised that this petty betrayal would completely overshadow any lesson that you wanted her to learn", "ESH. My guy, go get the bear back. Like now. Your wife isn’t over the death of her daughter, and that’s ok. Everyone grieves differently, and imo, I think she needs to start grief counseling/therapy asap. It wouldn’t hurt you either. Your son is the one that’s going to get the ass end of this and that’s not fair.", "ESH\n\nYour wife is the type of person i hate. Making her business everybody else’s business. And making decisions for other people.\n\nLike throwing out your sons toys, for example.\n\nYou suck for throwing out one of the only things your wife has of her dead daughter… its a priceless item.", "ESH except the kid(s). What your wife is doing (the pushing to volunteer, donating toys your son still plays with) is a HUGE asshole move, but you getting rid of her daughters’ bear. That sir, is beyond the pale. That’s something a vindictive narcissist would do. Are you one? Or are you simply the Grand Canyon of assholes?", "YTA. Absolutely monster behavior. \n\nIf you feel like she’s guilting you into volunteering, maybe try having a conversation about it. Tell her you support her desire but that it’s not your thing. Respectfully set that boundary. \n\nIt’s good to teach young kids about empathy & generosity. The younger, the better. It’s also healthy to talk to them about their late sibling or family member. Sadness is an unavoidable emotion. Protecting someone from it doesn’t help, it only delays it or represses it until it bubbles over & causes psychological issues. \n\nPetty revenge is the most immature way to handle things. And to give away something that probably means more to her than any other material or immaterial thing is pure evil. \n\nYou don’t respect her. You may think you do, but you obviously don’t. If I were her I would never forgive you… I’d be contacting a lawyer & finding a new place to live.", "Question: did your son still play with the hot wheels? You said he's 9, and the cars were from when he was a toddler. Did he still actively play with them?\n\nParents donate toys their kids stop playing with all the time, but if he was still playing with them, she was wrong for that. HOWEVER, what you did was callous and vile. It's nowhere near the same level. YTA.", "OP, read your title again and try to convince yourself you’re not the AH. \n\nEven if your wife was in the wrong, doing something out of spite is never right. Not to mention your wife lost her child, and instead of helping her through it and trying to support her, you’re just complaining that she’s annoying, Not to mention you gave away the one thing she held onto to remember that child just to “give her a taste of her own medicine,” like a child would. YTA, the biggest.", "YTA you fuck.\n\nBuy your kid some new hot wheels while you’re figuring out why you have so little empathy for others.\n\nSorry that volunteering at a hospital for sick kids and helping your community are too much to ask /s\n\nYou can’t find one time every so often to share something like this with her? It’s not watching a favorite tv show that you don’t like…It’s what she does to honor her child.  \n\nWhat exactly is wrong with teaching a kid that we’re (except for you I guess?) part of a community  that takes care of each other.  He’s nine. That’s far old enough to have an age appropriate conversation about his sister.  \n\nDo better dude, otherwise she’s going to get tired of your shit and leave.", "YTA for the bear but another thing that struck me as horrible is your attitude that a 9 year old is “too young” to know his dead half sister. She should have been a part of the discussion of his family from day one. How utterly alone your wife must feel not feeling comfortable enough to even talk about her daughter. I’m horrified for her.", "NTA. Holding one another to their word is important. If you believe your cause is righteous enough to trample over others then you are tyrannical. Your reminder of how she needs to be held accountable for her words is probably unwelcome. While devolving into an eye for an eye is a bad idea and generally frowned upon, it should serve as an eye-opener for her.", "ETA:\n\nA metric TON of ignorant people who have never been married or had children before making terrible comments.\n\nIt's horrible you did that to her, however she absolutely has no right pressuring you or your child, never mind FORCING him to contribute to charity.  Especially one he's not mature enough or has the knowledge to support.   More than 90% of \"charities\" are corrupt greedy corporations who give fractions of a % of their money to the actual causes.   Everyone has the right to decide what they want to give, and who they want to give it to.   Your wife is a monster taking away a childs toy and just making it disappear from his world.\n\nI don't understand how you could continue to be married to such a narrow minded selfish person with no respect for other people.   HOWEVER,  what you did was \"an eye for an eye\"  if not worse,  and even more cruel.\n\nAfter 9 years, you're correct.  She puts her personal separate life ahead of you and your son, she has no respect for either of you.  She refuses to let the past go and grief in a healthy way, instead she uses charity as a crutch to fill the empty void.\n\nIf you're married to someone who can't love or respect you, can't love or respect your child, let them go.   I can't imagine anything more cruel than letting a child be raised with a mother who doesn't love them.   That's a very different feeling than an absent mother due to separation.", "ESH I honestly don't have the words. Just wow.", "ESH except for the younger kid.", "[deleted]", "ESH. She needs grief therapy before she completely damages the child she has now, your marriage and her sanity. You, YTA! You don't ever do something like that. That was beyond cruel!", "Wow.  You are both assholes.\n\nWhat to do from here?  Therapy\n\nPlus, you donated a dead kid's toys?  YT massive flaming dead roach of an A.  Flaming.  Then, lectured her how it's her fault that YTMFDRA?   DUDE, this is not a positive legendary A move.  You went above and beyond and shat the entire bed on your relationship.", "I’m going with a very unpopular ESH … \nBut is think you are the biggest flying elephant there is for thinking this is something you can ever change or undo nothing is going to replace that bear. I do get you reasoning she is comparing everything your 9yo does to whatever her daughter can’t do and she needs to quit that. That is a very unhealthy relationship to build with your living kid.", "NTA. You’re way worse than just an asshole. You’re a hateful, disgusting, and pathetic excuse for a human being. I feel so so so sorry for your poor wife.\n\nWas your brain off when this happened? How could you have done this? How could you have even typed this and thought you’d get any support? \n\nObviously YTA.", "ESH. You are way more YTA than she is for giving away an irreplaceable toy of her deceased daughter, but she still should have asked Richie before donating his hot wheels.", "NTA Play stupid games with other peoples stuff and you win stupid prizes with your own stuff.", "NTA, your wife needs to learn to grieve and move on, losing a child is terrible, but she needs to focus on your son now. If your son still plays with that toy and likes it, that toy could've always been donated later when he's older and forgets about it. Donating the teddy bear without asking/telling your wife beforehand was probably not the best idea, but again, donating someone's toy vs donating something that doesn't get used and getting upset over it is hypocritical. Give her space to think things out and let her know your there to support her and keep an open mind, because it's seems there's an underlying issue when it comes to your daughter.", "Man I gotta say. Good on you for having the balls to make a stand against your wife that she can't ignore.\nIt's great that she wants to honor he dead daughter but it's not ok to force it on others.\n\nI wouldn't have done what you did, I don't think it's right, but then I wouldn't have donated the hotwheels without the approval of young Master anyway. \n\nBut it has caused her to stop and think.\nIf I were you, I'd be trying to get that teddy back and hope she stops fucking with you in the future.", "You said this perfectly. When I lost my sister, I had to clean out her apartment. I kept *gum wrappers* and other detritus because she was never going to make more. Eventually I left some of that stuff go, but I kept the things that she loved, like her giraffe stuffy. OP, you better bust your ass to get that bear back. Then look closely at yourself and examine your heart and get your mind right.", "excuse me while I cry in a corner. I lost my mom at a young age and the only thing i have to remind me of her are pictures and her silk robe she would always wear. I would be livid if someone threw it away. absolutely livid.", "When my daughter's people bunny had to be tossed because of black mold I cried, and it hurt for months because all I have is an urn, some papers, and a couple toys. Thankfully a kind Redditor helped me find another bunny (which also made me cry) but if someone purposely got rid of her things it would end the relationship!", "Bruh!  He’s more than just the AH.", "She didn’t even throw the hot wheels away. She donated them.", "Pretty soon OP will understand because his marriage is about to be dead too.", "It wasn't about the hot wheels specifically, it was more of a point that my wife is devaluing and being detatched from our son because she hasn't found a proper way to deal with the grief. She's giving away Richie's stuff and kind of pressuring him that's why", "My oldest son’s lovey is one of the few items I will NEVER get rid of, and he’s alive and well. My youngest never had a cherished stuffy or anything, but he has these three stuffies from his very deep sea animal phase that I will probably keep one of them forever once he gets passed it. I will, of course, give those back to them if they want them when they have kids.\n\nThere are certain things that are irreplaceable. And when they belonged to a dead child, those items are finite and precious. OP has just ended his relationship.", "I feel like people throw the d-word around way too often in this group for the most part; but this is a rare case where I think it’s truly OP’s wife’s best option. He talks about her deceased child like she’s favorite dress with a ripped seam that can’t be fixed and will inevitably be replaced when a new favorite is found. That’s her child, dude, and there will ALWAYS be grief for the hole in life where that daughter belonged. OP has had a decade to realize that, but instead of supporting his wife and showing compassion for her grief by joining her in activities that make her feel connected to her daughter (and would teach his son the valuable lessons in compassion he himself hasn’t seemed to learn) he thinks she should get over it and be all better by now.\n\nYTA, OP. I hope you can get that bear back; and even if you can you’ll be lucky to still have a marriage this time next week.", "And how DARE she do the same to her own son. Telling him he's too old for the toys. Guiltily him about volunteering. Yes, it's heartbreaking that she lost her girl... but does the give her the right to treat son like that? She will end up losing him too because of her actions", "This was my comment. I would never forgive this.", "I really, really hope so. What a sorry excuse for a human this guy is, jfc.", "He better be breaking into the hospital's donation center and combing through every toy after reading these comments.", "If you don’t drop everything and go get that bear you will regret it for the rest of your life.", "This is the answer", "THANK YOU. \n\nOP there is absolutely no question that YTA. What you need to do now is go get that bear. The hot wheels can be replaced. Your wife's dead child cannot. See OP, your son will have time to create new memories and grow out of toys and interests. Izzy doesn't get that.", "If he even donated it at all, the hospital will certainly throw out an old stuffed animal for sanitary reasons so it was a thoughtless donation on both ends.", "I don't have or want kids, but if I did and my kid died and my SO got rid of her stuffed animal without my knowledge or consent, that's instadivorce, never talk to you again, grounds.\n\nyou don't ever fully recover from losing a child.", "Yup. I hope she becomes his ex wife cuz this is worse than a dealbreaker in terms of behaviour", "He’s not an AH - he’s a fcking monster.", "I’d be more outraged if this post wasn’t fake.", "What did I just read?  You are a horrible,  cruel, despicable person.   I have so many other adjectives, none of them positive. \n\nHer daughter is dead.  She may need to process her grief, but how is discarding her daughter's toy and disrespecting her daughter's memory,  not to mention disrespecting your wife and her grief, going to make anything better?\n\nI don't generally go towards divorce,  but I hope she divorces you, you callous ahole.\n\nEdit: yta.  Massive, gaping,  infected ahole", "Okay, I don’t agree with her donating the hot wheels, either. BUT, I was thinking he would hide the teddy bear to teach her a lesson in respecting people’s things, but not donating it. Her child died & that’s the only thing she has to remember her. Also, why are you telling her to get over her cud to focus on you & your son? That’s selfish as hell!!! She can mourn her child for as long as she wishes. Don’t be evil.", "I never intended to disrespect Izzy. I just feel like it's been 12 years, it's been long enough that she can recover. The problem is that I just feel like Richie might feel uncomfortable because Izzy is sort of held as this ideal, and it's hard for a kid to be compared to, and to have his life dictated by a memory, and I feel like my wife is acting really unhealthily, and that she needs counseling and help beyond what I can provide, and I just wanted her to let go, and focus on the family she now has instead of keeping us below the pedestal", "May the church say amen. OP went far and above normal assholery to legendary levels. You don't give away possessions of deceased people as payback for hot wheels. The son could probably be bribed with a new video game. Izzy isn't coming back. YTA.", "Guy went full Hiroshima", "OR, hear me out. He could have an adult conversation with his wife about their son making his own decisions on what he is willing to donate. He could talk to his wife about how he sees her actions and feelings as she moves through life, still grieving her daughter, and how they are affecting their family, and how he can support her as she finds help. \n\n\"Teaching his wife a lesson\" is still an AH move. They are adults and partners. They can operate around this disagreement while still respecting each other.", "checking if its illegal…\n\nresult:YES. GO TO JAIL OP U MF", "Agree about growing up in a family with a dead sibling. My brother died very young and we always knew about him growing up. Knowing made us well-adjusted humans who understood our parents' grief and that life is limited, and to be valued. Also, people process grief however they process it. OP implying his wife needs to basically get over it & \"grieve properly\"? How messed up. As an elderly woman my mother still cried sometimes about losing her baby when he was a toddler. Anyway there were lots of mementos around the house. I still have a few, like a screwdriver from his toy tool set, that will always be cherished keepsakes. I'd be furious if they were donated, especially to make a petty point. When all you have left is memories and trinkets, you place a lot of value on those trinkets. I feel for the wife, and for how painful the loss of the teddy bear must have been awful for her.  \n\nedit: my phone ate the word \"awful\" so I put it back in", "See, Izzy wasn't his child, so this AH doesn't care.", "This is so incredibly well said. Especially the bit about that person is still part of the family. Because that’s so true. My older brother died when I was 9 and he 19; I am now 32. He is still my brother and still part of my family and the person I’ve become. My parents (especially my mom) will never stop grieving him. If someone got rid of the mementos I have of him in a fit of spite, I would excommunicate that person from my life.", "this is the best comment on this whole post", "I agree with you on everything but the donation of the hot wheels.  Those things are for little children.  Ideally she would have spoken to him first, but it was not unreasonable to think that a 9 year old had outgrown something meant for someone up to age 5.", "Fully agree, just wanted to say I'm sorry for your loss. Reading this AHs story made me feel horrible. It's truly heartbreaking and I know I'm just some random person and it doesn't matter what I think, but I wanted to say that I'm really sorry for your loss.", "Just FYI , if you don’t want it as your judgment you need to put spaces between the letters (N T A)", "I wish there was a higher level of YTA for this. I feel so sick for his poor wife. What he did is unforgivable.", "He already understood the difference between the old toys and this particular teddy. He’s not an idiot; he’s cruel. He knew the significance and did it to punish her", "True. He really messed up things. So he has to get ready for the consequences.", "They all need therapy. So much resentment going on.", "Yeah I'd be interested in some examples of her being passive-aggressive. Because it could definitely be that he's just letting his insecurities project onto interactions about volunteering.", "Yeah she 'makes him out to be an unkind person'. Ummm no shit, he's a despicable person clearly.", "I really think that her discussions of volunteering might have been attempts to connect with her family while doing something important to her and something which makes her feel connected to her daughter. This dudes just so insecure that it’s not all about him he sees it as passive aggressive. What a self-centered prick.", "If he even still played with the cars. He said he got them when he was a toddler. There's a chance that the son hasn't touched those cars in years and that's why mom donated them.", "\nSpeak for yourself, I still have my entire collection of cars.  Even if I am far too old to actually play with them.\n\nOnce your done with obvious baby toys, parents should not be getting rid of kids toys without including said child in the decision making process.\n\nThat said, getting rid of a dead child's toy is light-years over the line and OP is indeed the larger YTA here.", "I dare say less than 5 years", "The way my eyebrows went up at your comment. But you’re not wrong.", "Holy shit. This comment is fucking ice cold.\n\nBut it's a tropical day at the beach compared to OP's heart.", "Wow. That comment was harsh. But perfectly said and couldn’t have said it better. Just wow.", "Oof. Take my upvote and go.", "He can become best friends with the guy that destroyed his wife’s late husbands wedding ring because she didn’t celebrate Valentine’s Day with him due to too many memories of said first husband.", "Ok I disagree with that. I think like three or younger might be too young, maybe even like 5 and younger. However OP YTA and I literally can’t even comprehend how big of an asshole you have to be to do something like that. That’s literally unforgivable.", "As a punishment no less. He needs to be divorced immediately.", "Yep... sooooo many things I could say to OP that might get me in a LOT of trouble.\n\nBut we're all thinking them, here.\n\nOP: use your damn imagination.", "Same, if anyone did that to anything that belonged to my dead child I would probably choose violence and I’m not a violent person at all… I’d probably set 🔥 to their most prized possessions in front of them…", "I’d give away my wedding ring if I was married to him…", "OP isn’t Izzy’s dad. OP’s wife had Izzy before they met. Which of course is part of it. \n\nShe wasn’t his kid so why should he care if his wife is still grieving? HIS kid is still alive (and was sad that his hot wheels were donated)", "Agree with almost everything except that if they can’t get the bear back buying a replacement is useless.", "IKR? Maybe OP is an unreliable narrator, but the way he portrayed his wife is like she's not donating, but she's stealing and giving it away (the toys), guilt tripping the kid to donate, and using her dead kid as a way of \"make her proud\" when talking to their son, etc. \n\nMaybe she's just doing her best but how OP described his wife is kinda weird and kinda feels like he demonised her so his fuckup doesn't seem too bad in comparison (spoiler alert, it does).\n\nI agree with ESH. But man, what he did was monumentally worse.", "That mama can’t hear anything right now. She hears the rushing sound of wind, the animal panic before loss of consciousness. The marriage is over. I would seriously make sure mama isn’t suicidal over this.", "Same I hope he gets what he deserves in life", "Totally agree. ESH.\n\nShe seemed like a huge AH but then he came and managed to beat her by far in this AH competition.", "Yeah, I agree with this.", "Honestly shocked I had to scroll so far down to find a comment acknowledging how the wife is also at fault. That poor kid", ">The reason she’s quiet is because she’s filing for divorce.\n\nCorrect.", "Sorry for your loss mama. You’re right this is instant divorce.", "Why don’t the hotwheels hold sentimental value?  I mean, definitely yta and could have gotten your point across without doing this but he definitely sees the situation clearly and his wife isn’t prioritizing them at all.", ">But your wife at least has an excuse \n\nHow the fuck is this an \"excuse\"??? How about a real fucking reason", "Technically, this is the right answer. But OP’s actions are so deeply cruel, I can’t bring myself to upvote you.", "Agree with this!!! ESH!!!", "While I would normally agree with ESH, OP was so far beyond the bounds of sanity that it makes his wife's behaviour into nothing in comparison. It's YTA.", "Agree with ESH. She’s trying to force him into her volunteer world and he yeeted the bear as revenge for her yeeting the cars. This is childish drama. All around.", "Yeah I don't believe his characterization of his wife at all, she's not making him out to be unkind he just is.\n\nI would also bet all my money that she doesn't \"pressure\" him into volunteering either, probably just talks about it in his presence since it's a part of her life(and his ego can't stand knowing that she actually is a better person than him) or perhaps has asked him to go with her so they can use it as family bonding time.", "The daughter died long before the son was born.  While technically she was his sister, she was never a part of his life and guilt tripping him over it is really shit parenting.", "This needs to be higher. OP is absolutely crazy, but his wife is not doing things the healthy way atleast with her son.\n\nI can't imagine the pain and grief of losing your child, but she has a nine-year-old kid who's probably feeling that things are unfair to him. I get it, her coping mechanisms are her own business, but if her need to do good for people is at a cost to her son, then that's not right.\n\nAnd before anyone comes at me saying, 'it's just a hot wheels', I know. But the kid is nine, and honestly, nobody knows what might stick in his head. Right now he's just thinking that mommy gave away his precious toys, he lost a little bit of trust in her. I still have toys from my childhood, that I won't let anyone touch. I know they are just things, but things hold a lot of sentimental value. The kid genuinely deserves better from both parents.", "Just a bit of (honestly) friendly advice: never, ever tell a grieving parent to move on.", "There is no “moving on” from losing your child.", "How tf do you move on from burying your children? You don’t.", "My sister lost her first child. If anyone tried to take her keepsakes of him away she would (rightly) lose her shit. \n\nThere is no way her giving away some old toys her son doesn’t use any longer is the same as spitefully giving away one of her dead daughter’s stuffed toys. He did it to punish her. He’s the biggest AH I’ve seen on her in a while", "No, this was going nuclear. He got her attention alright, but it may be the last attention he sees from her. It is NEVER necessary to go to this level of AH.", "Needed to get her attention ? Because she is volunteering her time ?  Donating a toy her son doesn’t play with anymore to sick children ?? What is she doing wrong ?  Dealing with her grief by giving time and attention to sick children ?? Teaching her child to give to less fortunate children?  All of those sound like good things to do .  Husband is absolutely awful for giving away her deceased child’s bear to punish her .  He also doesn’t want her to talk to their son about his deceased sister - WTF !  The deceased sister isn’t a secret - it is healthy for the son to learn about his sister and to learn about death. The husband is awful for all the ways he describes his wife - he doesn’t name one redeeming quality about her and he sounds jealous of her deceased child .  he is the one that needs to see a therapist. He is awful.", "She won't ever move on but hopefully move forward. She will never not miss her daughter and she shouldn't be expected to.", "That is not how grief works. You don’t move on and replace them. You learn to live with the pain but it is forever a part of you. \n\nOP please get yourself counseling. Your wife made a mistake that can easily be remedied. What you did was just mean. There is no replacement or remedy for your choice.", "Dear God, what a horrible take.\n\nShe lost her young daughter. No parent can magically move on from something so devastating. And that teddy bear was obviously very important to the daughter, so of course she'd want to hold onto it. WHO CARES IF ANYONE IS PLAYING WITH IT. ..And grieve and move on?! Over a lost child?! SERIOUSLY?!\n\nAnd you are jumping to conclusions about the son using the old toy cars. Because from how OP worded it I was under the impression he no longer played with those two cars.\n\nFor the life of me though, I can't comprehend you saying SHE is the asshole in this situation. Not even ESH, but SHE is the only asshole?! Just WOW.\n\nAlso, that's not hypocritical. These two situations are in any way similar.", "You don’t have the first fucking clue about what losing a child is like. There is no “grieve and move on”. \n\nIt wasn’t a toy. It was a tangible tie to her dead daughter. Something her daughter held. Played with. Her little hands went HERE and she laughed LIKE THIS when you rubbed the bear’s nose into her tummy. It might have even (if only in her imagination) have still smelled like Izzy. \n\nAnd OP donated it to punish her for loving and missing her dead child. \n\nI have no words for how wrong that is.", "You have no idea. None.", "We have a box of my late dad’s clothes that my partner has labeled ‘emotional support sweat’ because I’m not ready to wash them yet because they smell like my dad. I’ve still got my late partner’s (different person) deodorant on my bathroom shelf. That one I’m at the point where if it disappeared I would be totally fine, I just…can’t quite bring myself to actively pitch it out yet. It’s the act more than the thing atm. \n\nGym wrappers make total sense.", "When my great-grandma passed away, I kept her kitchen egg timer. The sand in it is purple, which has always been my favorite color, and I loved playing with it as a kid (it was like a tiny “hourglass” but it counted to three minutes.) \n\nMy cousins thought it was the stupidest fucking thing. But when the people we love die, we cling to what we do have left of them. \n\nOP is *the* sadistic asshole. I can’t imagine what his wife is feeling.\n\nAnd he may think his son is “too young” to know about his sister, he’s wrong. Maybe *sharing* her memory with his mother and learning about her would help mom heal, too! \n\nYTA 1,000% OP.", "I have a tote with my late husband's favorite clothes in it. He's been gone almost 8 years and that tote isn't going anywhere.", "The 10yr anniversary of my mom's passing was last week and I still have her purse exactly as it was the day she died. Even the stale ass nasty cigarettes. I don't ever really look at it or even think about it much, but for some reason it's a comfort to just have. OP, wtf is wrong with you?! Of COURSE YTA!!!! Her kid DIED in an obviously tragic way and since she's volunteering at a children's hospital my guess is some horrible disease took her baby from her. You suck so bad I hope she divorces your heartless ass.", "She shouldn't take her son's things and get rid of them without his permission. My mother did this all the time with things I treasured. She got tired of seeing them. This was a part of her personality, to be constantly shifting and changing things. Whenever I protested or tried to rescue things, my dad would threaten me with violence, telling me that I owned nothing, it was all theirs to do with as they pleased, and they would decide what I got to keep. And no, it wasn't just spanking.\n\nRespect your child and let him have control over his own belongings. It's not the toys, it's the helpless feeling a child has when they feel they have no choices in life.", "You just ended your relationship. You know that, right?\n\nIf you have any decency, you will contact the organization you donated the teddy bear to and explain your error and get it back immediately. Even then, don’t expect her to ever forgive you.", "There is no excuse for doing something this cruel. Its fucking psychopathic. If I were your wife I'd pack a bag and leave tonight.", "god forbid she “pressures” him into volunteering and raising an empathic individual who gives back to the community, i hope she divorces u YTA", "You know you could have just divorced her if you wanted to end your relationship. \n\nNo, you wanted to do the thing that would hurt her the most so that she would have no other choice but to leave you. \n\nDon't expect her mental state to get better from this. It really seems like you are deliberately trying to cause her to have an emotional breakdown. \n\nTruly disgusting behavior Op", "How was this going to fix that? You wanted to torture her into “getting over” her daughter? If I were in her situation and someone did this to me, 1) I would never get over that loss. 2) I would never forgive the person who did this to me. YTA and cruel. If you had concerns about your son, you should have had an honest, gentle conversation with her. Not shatter her trust in you. YTA.\n\nETA, before the pandemic, my kids and I volunteered together on a regular basis, and it was very good for all of us. There’s nothing wrong with donating your time to causes that need help—it teaches empathy. Something you could clearly use.", "Reread what you just said. You just devalued your wife’s first child. You may have permanently detached her from yourself. You went nuclear rather than acting like an adult and having a conversation. You are pressuring your wife to leave you at this point.", "Giving away hot wheels and kind of pressuring him? This is normal parenting territory, bud. I go through my kid's things regularly to donate toys he doesn't play with. I encourage him to participate in this and to help the less fortunate when we can. You should reflect on why you're so offended by this. \n\nYou giving away your wife's dead child's keepsake to make such a stupid f*cking point though, I'm trying to find the words but I can't. There are no words for what you've done. Satan himself wouldn't know what to say to you. \n\nYou want to talk about devaluing something? YOU are devaluing the immense trauma and loss that your wife experienced when she lost her daughter. That doesn't just go away. You might try supporting her? \n\nBut no. Instead, wouldn't you just love it if she forgot all about her deceased child and forgot all about her charity work and gave all of her energy to you. As if you deserve a single ounce of it. You deserve the divorce papers that you have coming and a lifetime of sh*tty karma afterwards. Have a nice life.", "This! I treasure my 19 year old kid's teddy bear that he adored from birth until about ten years. Like to the point if he ever tried to donate it, I would be taking it out of the bag and keeping it. After all those years, he is a sort of \"Hobbes\" to me from Calvin and Hobbes. This bear has a name and personality to me after listening to my son's stories and conversations about him.\n\nIf my husband purposefully gave it away just to hurt me, especially if our son had died? Whoa. \n\nOP didn't just end his relationship, he picked the nuclear option.", "I keep the ratty old smelly collars that my late dogs wore when they died. I don't even know what I'd do if someone threw them out. And even I can acknowledge losing a dog is nothing compared to a child. I can't even fathom.", "I’m devastated for her. This is heartbreaking", "I HOPE it’s fake!", "I had an ex smash my dead best friends items to “punish me”\nYou’d be shocked at how cruel people can be.", "Let me tell you right now: she will NEVER “recover” from Izzy’s death. Izzy was her beloved daughter. Would you fully “recover” if it was your son? She *has* moved on, but you are such an unbelievable AH for donating the teddy bear in retaliation. Doesn’t matter if you intended to disrespect Izzy because you did. \n\nYTA. But you knew that already.", "So you sit her down and say to her, gently, because you love her and care about her wellbeing as well as that of your son's, that you're worried about how her behaviour is affecting your son and that some form of grief/family counseling would be a good idea...\n\nAnd I cannot believe this bit needs stating\n\n...WITHOUT DONATING HER DEAD CHILD'S TOY!!", "I genuinely don't understand how people in this day and age can be so ignorant to how grief works. \n\nShe will ALWAYS miss her daughter. That's totally normal. The 6th task of mourning (from Alan wolfelt) is creating a lasting relationship with the deceased. This is often times used through objects such as the teddy bear. \n\n&#x200B;\n\nGetting rid of her daughter's toy without talking to her first was frankly fucking stupid and rude. You don't get to do that. You should have talked to her if that's how you felt rather than acting on impulse", "There’s no such thing as “recover” when it comes to losing a child. Time heals wounds but leaves a scar. And what you did just tore that scar open.", "It was truly evil for you to give away one of the last possessions of her dead daughter. Her daughter has been dead for 12 years...and now her beloved teddy bear is gone, too. You just gave away a precious memory. That's the nuclear option, and you may have completely destroyed your relationship. Yes, you wife may indeed need help beyond what you can provide, but you sure as hell aren't helping when you are actively making it worse.\n\nI suppose you could get rid of all the pictures of Izzy, too...I mean if you think erasing her from your wife's life is the way to do it...*but you would be wrong*.", "Your son is alive, her daughter is dead. She’s trying to keep her memory alive and you’re making it about yourself. This has nothing to do with you defending your son and everything to do with you feeling like your wife should have moved on by now. Her grief is not yours to manage and/or control.", "You NEVER RECOVER from the loss of a child!! What is wrong with you??? \n\nYou can say all you want that you weren’t trying to be spiteful, but you were clearly trying to teach her a lesson- and she’ll never forget how hateful your heart it. \n\nYou are a hateful person. \n\nGO GET THE BEAR BACK!!!!! \n\nYTA", "Is she in this marriage alone? I read a lot of she/her in your comments, but marriage is a team effort. Counseling could work for Both of you....her to process her grief, you to understand that losing a child is a never ending abyss of grief that only ends with your last breath. And both of you to learn how to communicate with one another without being accusatory.\n\nYou've gotten blasted hard in this thread, so I won't add to it other than yeah, YTA. But I think probably because you truly don't understand that kind of grief. And I hope you NEVER do.", "INFO: How long would it take you to recover if Richie died?", "YTA and you're full of it.  You did it to get back at your wife.  You were being petty.  You were being spiteful.  You sought out something that would hurt her.  \n\nYou did not do this for your son.  You did not do this to help your wife in accepting her loss.  \n\nYour wife donated you son's old hot wheels, which are for children aged 3-5.  Your son is 9.  Your wife did not do that to be petty or spiteful.  She did it because he'd outgrown it.  \n\nI don't think your marriage will recover from this, but if you want to have any chance of it doing so, you need to try to get that teddy bear back.", "I would hate for you to go through what your wife did. You do not ever truly get over losing a child. \n\nSounds like you need counseling because you’re being cruel.", "Newsflash: a parent NEVER gets over the loss of a child. Never. Ever. This is a heartache she will have until the day she dies.", "If, God forbid, Richie died, would you be fully recovered in 12 years? Losing a child is something most parents never fully recovers from. Yes, she was wrong for donating your son's toy. But you could easily buy another hot wheels. This bear is something you could never even hope to replace\n\nYou're only hope is to get it back from the hospital. Your wife didn't donate the car out of spite but you donated the bear out of spite, to teach your wife a lesson. I dont think she learned the lesson you set out to \"teach\" her. You need to realize the difference between a replaceable toy car and an irreplaceable stuffed animal that belonged to her deceased daughter", ">I just feel like it's been 12 years\n\n>I just feel like Richie\n\n>I feel like my wife\n\n>I just wanted her to let go\n\nI see a whole lot about what YOU feel and what YOU want and what YOU think other people should or do feel. Did you ever stop to think that you should, oh I dunno, *communicate* with them instead of jumping right to being a self-absorbed presumptuous ass?", "So you admit that you think she needs help beyond what you can provide, but instead of helping her find a counselor or therapist you decide to “help” by throwing away something priceless that belonged to her deceased daughter? MAKE IT MAKE SENSE. The headassery here is astounding.", "You never intended to disrespect Izzy?  Yes, you did piss all over her memory very respectfully.", "You never recover from having your child die. Literally never.", "You need to move heaven and earth to find that toy, so that she can even entertain the idea of having the long overdue conversation you should have had instead of disregarding her grief.", "You don’t get to tell her how to grieve. You feel threatened by the love she still bears for her dead daughter. Get over it. \n\nSome things you never fully recover from. You just keep living anyway.", "You don't get to decide when someone else is healed. You don't get to decide when someone else should let go.\n\nYTA, and it's hilarious that you complain about how self-righteous your wife is, when you're demonstrating exactly the same behavior.", "You need to seek help after the divorce coming your way. There is no timeframe on the grief of a child. Full stop. My god this is deranged. Zero emotional intelligence.", "How did you possibly think donating the bear would help any of this?  You were being spiteful and wanted revenge. You “feel it’s been long enough”. Ffs. Your feelings about this don’t change anything. Your wife is actually asking for help with grieving - she’s asking her current family to join her in honouring Izzy’s memory. But you can’t see that, you just decide it’s been “long enough” and then punish her. \n\nYTA YTA YTA.", "She had one toy she held on to of her daughters and you gave the toy away out of spite. That’s the part I can’t get over. YTA", "Dude, just… you really think what you did is going to help your wife? Ask any mother that has lost a child if they’d “let go”. Maybe she needs therapy but so do you. you’ve certainly made things so much worse.", "dude... you are a grade A piece of work... just because Izzy wasnt your daughter you assume to decide 12 years is long enough.\n\nJesus H on a spike, you are either dense or a massive asshole.", "> I just feel like it's been 12 years, it's been long enough that she can recover.   \n>  \n>I just wanted her to let go.\n\nSo if your son died tomorrow you'd just be able to just \"let it go\"? If honoring her daughter's life is such a threat to you, you don't deserve her. You don't just \"let it go\" when you lose a child, you learn to cope. Her way of coping is volunteering in a meaningful way that honors her daughter. \n\nHonestly, what you did is unforgivable in my opinion. I'd be looking for a divorce attorney.\n\nYou completely suck! YTA!!!", "You’re deranged.", "Spoken like someone who has never had to experience loss. \n\nOne day you will lose someone and you will look back and realize how unforgettable your actions are.\n\nThe only kind thing you can do for your wife now is leave her. You have demonstrated beyond a doubt that you do not love her or respect her lost child. She will never forget how you made her feel.", "You did, though. You INTENTIONALLY donated the teddy bear to get back at your wife. That was an act of profound disrespect. How absolutely callous. I cannot believe you had to ask if you are in the wrong here and trying to defend yourself. \n\nYTA.", "You're a monster. Who needs enemies with a husband like you. I hope she does the right thing and leaves you", "I am so sorry for who I hope will soon be your ex wife.\n\nWhat you did is unforgivable.\n\nAlso let’s take a look at the root, you have a problem with your wife volunteering because it doesn’t serve you or your son and therefore not important.  Also clearly a lack of any empathy.\n\nI hope your wife gets an absolute shark to get full custody of your son so he’s not raised by someone so staggeringly lacking empathy", "And you get to decide when it’s been long enough so you go and donate the only part she still had with her of her deceased daughter?", "You never recover from losing a child. You may learn to cope but you never recover. If you’re truly worried about her you get her therapy and help her. You don’t get rid of evidence of the child she lost and expect her to never bring her up again.", "I'm ignoring the part about Richie, because I cannot speak for that perspective.\n\nMy father died close to 20 years ago, I still have a few of his shirts that I'll wear when I miss him. I have our family picture as my FB profile pic and in my house. I've had the poem with his photo from the funeral hung up in every place I've lived. My family goes out to eat at a restaurant we think he'd like on the anniversary of his death and share memories. I smoke one cigarette a year on the anniversary. \n\nI still have intense feelings of loss. I'll never have the option for him to walk me down the aisle. I haven't had any graduation/promotion with him except for kindergarten. I wasn't able to share the excitement of my first job, college acceptance, performances, buying my first car, or see him be a grandfather.\n\nI'm not over it. If someone came into my life and wanted to erase his memory, they'd be out in a minute. Especially, if they went so far as to get rid of one of his shirts. \n\nYou need to grovel for forgiveness. \n\nGet family therapy, you all need to talk through this and probably other things. And don't diminish your wife's pain.", "You never get over losing a child .  You never recover. You just learn to accept the child’s death - which she has by giving her free time at the hospital.  You want her to do and act like you want her to. You may not have wanted to disrespect Izzy but you did and you also wanted to punish your wife. And you are the one who needs a lot of counseling!! Like inpatient - because any husband that would give their wife’s deceased child teddy bear away is seriously mentally ill.", "she'd be right to never focus on you now. i hope she does the right thing and files for divorce immediately.", "What a load of crap. You donated Izzy’s teddy bear to GET BACK AT HER for donating your sons toy. Your wife may need therapy to continue to deal with the death of her daughter. But YOU need therapy to figure out why you would intentionally try to hurt your wife out of spite. What you did… cannot be undone. Ever. You can spend the rest of your days trying to make it right… but that kind of meanness… she may never see you the same way again. \n\nYou are a huge AH. You don’t “get over” losing a child. Ever. Get yourself to a therapist to figure out your own shit.", "You don’t ever get over the death of your child. You get use to it. You accept it. But the loss will always be there. Like a small weight on your heart.", "You’ll move on if Richie passes because it’s been long enough?", "I betcha part of the issue to start is her hiding her daughter’s existence from your son. For 9 years?!?That’s terrible, what a hard thing to carry day to day! No wonder she needs therapy, this on top of losing her daughter.", "If your son died tomorrow, and you never got to see him grow up, never got to experience so much of his life… when would you recover, exactly? When would you be “over” the death of your beautiful unique boy? A month? A year? A decade? How long is long enough for you to not have at least one moment every day when the realization that your child is fucking gone forever hits you?", "Well it's probably hard for her to grieve when she has a grown ass fucking man having a tantrum and getting rid of her reminders of her dead child..... you really are sick.", ">She's been ignoring me since, and I tried to explain or reconcile, but she's not listening to me, and I don't know what to do\n\nWhat you *should have* done is insist your wife get grief counselling, and that you all get family counselling. \n\nWhat you *did* do is inflict unbelievable trauma on someone who has lost their child and is clearly still reeling from the loss. You weaponized her bereavement.\n\nHere's what you do now: prepare for your inevitable divorce.\n\nYou are well beyond YTA. You're an actual monster. And I guarantee that she will not ever be able to forgive you, even if she wants to. I sincerely hope she can contact someone at the toy drive and recover what you stole.", "What you did is unspeakable. I would divorce you.\n\nYTA.", "There is nothing you can say or do that will EVER justify   your act of cruelty.  You are beyond an A H, you are a fucking monster.  I hope when your son grows up he remebers what you did  to his Mommy and he never speaks to you again and  never allows you in his or his future family's life.  I hope you end up homeless and unloved because that is what you deserve.  You better go get that teddy bear back", "Drink bleach.", "Your lack of compassion for the woman you ostensibly love is **fucking staggering.**\n\n***YTA***", ">I just feel like it's been 12 years, it's been long enough that she can recover.\n\nMy mom lost a daughter in the early 80s. To this day, the entire month of November is incredibly hard on her. She gets deeply depressed and is sometimes barely able to function. She cries easily and often, rarely leaves her room, sometimes doesn't eat for days at a time, and finds it nearly impossible to interact with people. Any mention of her daughter the other 11 months of the year brings tears and (shorter and less severe) bouts of depression.\n\nEven after all these years, it's still incredibly hard on her and it is so difficult to watch but you know what I would never dream of doing? I would never, ever fucking tell my mother that it's been long enough and that she needs to move on. You know why? Because that's fucking cruel and selfish and is absolutely not my place.\n\nYour wife has found what sounds like healthy ways of coping with the loss of her daughter. She is trying to instill what seems like good qualities in the son that you share. You should be glad that she's the wonderful person that she sounds like she is but instead... It bothers you. That's insane to me.\n\nThe only critisism that I will give your wife is this: She should have talked to Richie before touching his toys. She should have explained what she wanted to do, why she wanted to do it, and let him make the decision. If you were more supportive, maybe you also could've been part of that conversation, because your wife would've been more comfortable involving you... She went about it wrong, and you definitely did nothing to help the situation.\n\n&#x200B;\n\nYou are absolutely TA. Honestly, the more that I think about what you did, the more angry I become. I have so much more to say that would get me banned and I really hope that you realize just how badly you fucked up.\n\n&#x200B;\n\n&#x200B;\n\nEdit to add: If she isn't already getting it, your wife could benefit from therapy. So would you. Couple's therapy, at this point, definitely wouldn't be a bad idea either, especially after you fucking threw away her dead daughter's teddy bear.", "you never stop mourning the loss of a child. ffs.", "Grief is almost never a process with a beginning, a middle and an end. Your wife will *always* be grieving her dead daughter, she’ll always miss her, that’s the deal you took when you married a woman with a dead kid. It’s mind-blowing how you’ve been with this woman for so long and you’re still so clueless on the subject.\n\nI truly have no idea how you can go back from this. This was *really* bad, dude.\n\nYTA.", "So instead you have decided to end your marriage and have an antagonistic coparenting relationship where she is properly going to be opposed to ever trusting you with anything. What a terrible thing to do to your son.", "This is absolutely inappropriate. Your behaviour is unforgivable. You can always get your son another toy. He will get more toys as he grows older that will acquire meaning for him. Your wife does not have that. \n\nIf you seriously think anyone can ‘get over’ the grief of losing their child, then you are seriously mistaken. No one ever gets over it. It’s not something your wife is ever going to be able to ‘put aside’ or forget about. It’s scandalous that you don’t seem to be able to empathise with her, and that you begrudge her any connections she has to her child. \n\nYTA. I doubt she will ever forgive you for getting rid of one of her few connections to her child, and you deserve whatever silence she has retreated into. My heart goes out to her.", "SERIOUSLY?! It’s been long enough?! So if your son dies you’ll get over it and just recover? 12 years is long enough you think? You obviously don’t understand grief and you need to thank God for that. As I said in a previous comment I haven’t lost a child but my only sibling. It’s been 18 years and it still hurts like hell. My parents haven’t “recovered”. They learned to live without a piece of their heart but they also had supportive people around them helping them through the grieving process. I feel sorry for your wife.", "The majority of people can never ever fully recover from a death of a loved one. What does this even mean? To never acknowledge the fact the person was ever alive and meant a lot to you? Who decides what is normal?\n\nAnd obviously giving away an irreplaceable item of a person who passed away just to be petty (and because “it’s time to let go!”) is the next level of delusional.", "YTA - you disrespected Izzy and hurt your wife at such a level she will never recover from this. You don’t seem to understand but you giving away that Bear is the equivalent of taking her daughter away from her again. It was a physical link to her child and you destroyed that and just expect her to get over it like it was no big deal. Your relationship will never recover from this.", "You are so cruel and mean spirited, that it’s hard to believe you’re telling the truth, yet it does seem that you are. \n\nWhy did you marry your wife? You don’t seem to understand nor love her. \n\nYTA", "> I just feel like it's been 12 years, it's been long enough that she can recover.\n\n\nHoly shit dude. YTA", "How do *you* get to decide what the appropriate length of time to grieve is? Heaven forbid you lost your son, would you want anyone telling you how quickly to deal with it? You’re so far out of line I wouldn’t blame her one bit for divorcing you. YTA.", "No one who has lost a child “recovers” from it. \n\nAnd giving away Izzy’s teddy bear is NOT “letting go.” In fact, YOU MADE HER GRIEF WORSE.  \n\nI’d be *very* surprised if she doesn’t divorce you now.", "I hope you never have a nice day again.", "She does need counseling. Eventually. Right now she needs a trusted person to check in with her to make sure she isn’t suicidal over this. I’m not kidding or exaggerating. Don’t try to do it yourself. You’re not capable. Maybe her mom (Izzy’s grandma) or a sister? Close friend who knew the baby?\n\nThis is one of the most horrific things I’ve ever read here.", "YTA\nTell me you've never lost a child without telling me you've never lost a child.\n\nI get that the guilt-tripping you about volunteering is getting on your nerves. But maybe she just wants to share quality time with you where you will feel closer to her daughter? People process loss very differently and she is so aggressively attached to her that she is desperately trying to not let go of her memory. That is probably where the \"holier than thou\" attitude comes from, because you are trying to get her to *forget* about her dead child. Do you know how she died? Have you offered to do *anything* in her memory? Death anniversary special tradition?\n\nNo, OP. You do not get over a *DEAD CHILD* by getting rid of the most precious item a grieving mother has left of them.\n\nAlso, there is absolutely nothing wrong with telling Richie about his dead older sister. Your wife only wants to involve him in her life so *he* knows about her.\n\nIf this marriage survives, it would be by the skin of your teeth, but I think there is no coming back from this.\n\nI really, *really* hope you don't go through what she did.", "If You’ve never lost a child (neither have I, thankfully) you can’t understand what that’s like. You shouldn’t have messed with that connection. Under any circumstances. You’ll never understand what that meant to her.", "You don't recover from grief, you just learn to live with it but it is ALWAYS there... This app consistently reminds of how selfishly cruel people are", "Then get family therapy. You just went to the nuclear option. Your wife isn't going to see whatever valid points you may have had. You have away all credibility.", "So what, you just expect her to forget her daughter? I think you need some counseling.", "So how long would it take you before you were “over it” if Richie died?    \n\nAnd you knew your wife had lost a child when you married her, you were aware of the depth of her grief.    \nYTA because you just expected her to “get over it” instead of accepting that this is a pain that never leaves, when you’re a loving parent.", "You’re a monster. Your note drips with contempt and spite. She deserves better than this. What a cruel way to punish her for throwing out your boy’s cars. Over the top and unwarranted. Honestly, you should be ashamed.", "You should really think about what you mean when you say “recover”. Because when a parent loses a child, that isn’t something you can just get over. And getting rid of something so special is insensitive and cruel of you. I don’t understand how you couldn’t see how hurtful that would be to her. YTA", "Yta, your intentions are irrelevant, it's the impact that matters.  While you can't sympathize with your wife, you could learn to empathize with her.  Everyone grieves differently.  You never get over losing a child.  Toys your living son out grew does not compare to something that belonged to her child that is gone forever.  The only person who is acting unhealthy is you.", "You think she should be recovered? From her child *dying?* You are completely heartless and ignorant, and you should be *ashamed* of yourself.", "Two things can be true: she does need to get help processing her grief and you were a completely insensitive AH for giving away Izzy’s bear. Hard YTA.", "I think you are an AH, you wanted revenge on your wife who donated the hot wheels. Your wife needs more time to process and she may never get over her daughter's death.\nYou are disgusting and an AH... She shouldn't be forcing anyone to do things that she enjoys doing but you should tell her firmly that your son is too young and that you don't want to and that's the last time you want to hear about it...", "So she may need counseling and you think the best thing to do is to trigger her grief?", "“It’s been long enough that she can recover.” I hope Richie lives a long, healthy, happy life so you never have to understand how your wife feels losing a child.", "You dont fucking get to decide that. This wasn't about helping her. This was petty revenge. YTA.", "She does need counseling so she can be told to leave you.", "Nah some people survived Hiroshima this guy's marriage just ended up as Atlantis lost and never again to be seen", "He could have done all of that before this unforgivable unspeakable act, but it’s too late now.", "Even if unprovoked, its illegal", "I have friends - a couple - who had a stillborn son 24 years ago. He had a name. They have pictures. They wish him happy birthday every year. They wonder what their life would have been like if he had lived. And they still struggle every year around his birthday. Especially because mom is a nurse and sometimes her rounds include the newborn ward. You never completely “get over” something as devastating as losing your child.", "Ding ding ding, he’s over it, to him it’s just an annoying bug in his wife’s personality programming.", "Weird gatekeeping of hot wheels. You’re never too old to play with beloved toys.", "Same here. I’ve never felt so mad at one of these before. Does this man even love his son? Bc if he did, how can he have zero empathy toward his wife who lost a child? He should know he wouldn’t get over losing their son. \n\nI’m sickened by this. I want to go find the teddy bear.\n\nParents who lose children have every ounce of my respect and I cannot begin to pretend I understand their pain.", "Thank you", "Where does it say that? Never heard this before.", "Absolutely this - he knows what he did was cruel. His wife had lost her daughter before they got married, and presumably before OP had met her, so he would have known about her loss before they got married and had a child, but he thought she would just... get over it. She's not and he's punishing her for it.", "There are definitely age appropriate ways to explain it. I was three when I first learned about death.\n\nUnfortunately sometimes you have to explain but there's certainly a right way and a wrong way to do it.", "It's not too young per say. Depends on the child and thier emotional intelligence.  My husband works at a children's hospital and you would be amazed at thier understanding. My child when asked if she has siblings says yes, but they are in heaven.  (Which I did not push on her being that I am an athiest). She understood that her momma had three pregnancy losses before her,  (she was a shockingly healthy pregnancy and also unplanned) and did not want to chance more losses. Mentally I do not think I could handle anymore losses. I think I would flip my shit if my husband went into my closet and got rid of the few momentos I have. I imagine the grief would be much harder with a child you saw growing up held. I know families that kids died and they volunteered at the hospital often for the sense of kinship with people who have gone through it too, and to help those actively going through terminal illnesses with children.", "I'm surprised he didn't rip up all the pictures and everything she had of her child like all other terrible steps do when they're jealous of a deceased person.", "Yeah definitely he's trying to make her sound worse to justify his nasty revenge. IMO no matter how much of an AH someone is, if you actively go out to get revenge, you are at least a little bit an AH too. \n\nAlso it's really sad because I'm sure the kid probably would have been OK with donating his old toys if she asked first, and even if he wasn't initially, generally kids come around quickly enough when they realise a week later they haven't actually played with that toy since.", "\"Clearly\"? because she volunteers and preaches the value of volunteering? Who made this guy the center of her universe and why should everything revolve around him? He's a grown up and they have a big boy together. Kid should be taught moral bearing at his age anyway, and it seems to me like she's doing a good job.\n\nEverything holds \\*some\\* sentimental value. But something belonging to someone who's not with us any longer gets bonus points; damn, I'm 41 and can't bring myself to repurpose or throw the food bowl of my late cat but in the meanwhile I laugh if I break 10 plates received at my wedding. I empathize with his lady.", "How about the 9 yo has to live for her daughter too… how about the extra weight she has been putting on this kid, he is 9 , for how long has she been doing this.  Not excusing dad here… but maybe this behavior of Mom is worse then described and dad went nuts and did the most unspeakable thing. May be in it he is saving his son. Their son!", "I feel bad for the 9 year old- neither parent is being reasonable here.", "I’m so sorry for your loss. My Dad has been gone for 15 years and my mom passed away last Christmas. I have my grandma’s rolling pin, I have my mom’s cookbook. I didn’t want jewelery and the stuff that sits in someone’s drawer. I wanted things that I knew & remembered the ones I love used. It never goes away.. but we find a ways to go forward.", "Never said what she did was right lol. But what OP did is MUCH worse.", ">You just ended your relationship. You know that, right?\n\nI hope so, for her sake.", "Exactly. YTA OP", "It really is heartbreaking. And he did it because he was \"fuming\". And now he's here wondering if he's an AH or not for getting rid of what was probably one of his wife's last tangible reminders of her deceased daughter because he was angry? I have no words for this guy that wouldn't get me banned.", "Yeah this made me close to tears.", "And that’s the thing. OP donated it out of spite.  Despicable.  OP, YTA.", "You sure don't understand the process of grief. It's like a rollercoaster, and different people handle it differently. But, no, a person will never let it go; it will always be a memory harbored in their heart.\n\nYour wife *has* moved on, but you just grieved her and disrespected Izzy by donating the teddy bear in retaliation.\n\nThat is unacceptable in my book. It calls for immediate divorce though I wouldn't think I would be so naive to marry a person like you.\n\nYTA. A very insensitive AH at that.", "YTA (happy cake day)", "Yeah, OP would fully \"recover\" from his son's death, seems like grief is a vague and irrelevant concept to him. Like love.", "OP wants to pretend her daughter never existed. That's what's dangerously unhealthy here. She died before her time, but will always be a part of her mom's life, and having a reminder of her is normal. Volunteering is actually an excellent response to such a catastrophic loss, yet OP wants to distance her from that.", "I lost two boys. I get that there are stages of grief we go through, but it never truly ends. \n\nI still wake up, I go about my day, and inside my heart forever aches. \n\nI have a small chest in my closet with keepsakes I hold dear from my boys. I could not imagine someone taking an item, giving it away, and telling me to move on. They are always MY babies.", "I've heard a story about my great-grandmother...\n\nIn the 1910s, they lived in a house with a wood stove. One winter morning, she was boiling water on the stove to start the day.  What she didn't realize was that one of her sons crawled behind the stove to get warm.   Something startled her as she was taking the water off the stove.  It fell on her son and scalded him.  He ended up dying.\n\nMy mother would tell a story about her grandmother from probably the 1950s or 60s.  The cows Mom's father had would come to the barn to be milked.  But her grandmother's cow had a bell.  When it was time to milk the cow, her grandmother would take a stool and a pail and go look for the cow.  Sometimes, it would take a while for her to come back.\n\nLater, Mom always wondered if her grandmother would go to her son's grave when she was \"looking for the cow.\"\n\nThat was the only child my great grandmother lost before adulthood.  I'm not sure anyone alive today knows where he was buried.  We didn't even know his name until my great aunt died and listed the brothers who predeceased her.\n\nThis all happened in the first half of the Twentieth Century, in rural Virginia.  Momentos and sentimentality wasn't really a 'thing.'  But I don't think my great grandmother ever forgot him.  She went on because there was no other choice. \n\nThere are words for children who lose parents (orphans) and someone who loses a spouse (widow/widower), but there's no word for a parent who loses a child.  That's a pain that can't be conveyed in one word.", "Exactly! If you're lucky, a sharp pain eventually becomes a dull ache.\n\nBut he just reset her grieving process.", "Can you believe that he has a child and cannot fathom her grief?  Thats alarming.", "Obviously just 24 hours because he clearly only loves himself.", "Wife should have discussed the hot wheels toy donation with the son beforehand, but that typical parental \"I'm getting rid of your old toys you don't use anymore\" mild AH bit absolutely pales in comparison to OP.", "100% this.", "Exactly 💯! And it's worse because it is her CHILD. It's not the fact that it's been 12 years, it's the fact that it has ONLY been 12 years.\n\nMy brother died at 21. He quarreled with my dad before he died. I truly believe the guilt destroyed him, and he died 4 years later.\n\nMy mom is still alive, but she's never been the same. Her health has also declined since that day.  It's been 30 years and it still plays in my head like a movie.\n\nYTA", "Yes, one of my best friend’s older brother died when he was a baby, not even a year old. My best friend wasn’t born yet. There are still pictures of him in the home. He had a name and they celebrate his birthday still too. For OP to think this is something you just “recover” from is so sickening.", "Nm just saw the \"don't\" part", "Agreed", "That’s totally fair, and you’re prob right actually. I think I just think it’s unfortunate that some people have to learn about stuff like that at that age.", "Man I’m not religious either but when kids talk about people being in heaven, and when my little niece said she would pray for me after she heard I was in the hospital in ICU, my heart burst. \n\nI am so sorry for your losses, it sounds like your daughter is very caring and sweet.", "Yes. Its starting to look like no one in the family talks to one another, and always works on \"ask forgiveness instead of permission\" basis", "Actually they did hold sentimental value to the kid because they were from when the kid was in the hospital, we don’t know why he was there, may be it was the to take his tonsils out, maybe this kid did beat cancer… maybe dad is fed up with mom because their son lived and daughter didn’t. I think most of all the internet is not a place for this question. As the judgement here is cruel and harsh on too little information.", "No", "Oh 100%. He’s living in his dead half sisters shadow.", "Totally. She didn't do good by donating her sons hot wheels because of the son's attachment. However, Op is the AH because he donated her dead daughters stuffed animal out of malice. That's just cruel as fuck and idk if I could ever stay with a man who does that.", "Oh yes! I can't even imagine that! Plus, we do have only OP's side of this whole story about how much she is obsessed with this.", "And I don’t believe a word he says about her being “passive aggressive “ about volunteering.", "I’m biased as an almost 40 year old who cherishes their childhood teddy bear. My mom passed away whatever the opposite of “peacefully” is a few years ago (cancer, terminal dementia) and I find so much comfort in a quick squeeze of my bear. I’m raw over what this poor mom is going through, robbed of that small respite.", "Exactly. Imagine how little you’d have to care to not realize what it would mean to your wife to volunteer alongside her every once in a while. Even if not for Izzy’s or the patients’ sakes, you’d do it to show your wife that you see her grief and want to support her.\n\nAnd his wife, even if it was “passive aggressive,” seeking that support and time from him was irritating enough that something as small as the hot wheels was all the push he needed to completely ruin one of the only things his wife has left of her late daughter. It’s so horrible, that poor woman.", "Vilomah 🧍🏻‍♀️", "The lack of empathy is shocking", "Hopefully when she divorces him she will get custody.", "Because he is really all that matters in his life. Her daughters memory is an inconvenience for him.", "Nah. It won't take him that long. He'd just say, oh well, that's THAT. Then he'd throw all his stuff away without telling his wife.", "I agree about the Hot Wheels.  But giving away her dead daughter's teddy bear...  Dude, YTA", "Thank you. She really is an amazing daughter.  :)", "Care to elaborate?", "Same! The whole thing reeked of resentment towards his wife and Izzy. Deity forbid she try to connect with her deceased child in some way and suggest he and their child participate because it's that important to her", "100% this is just awful", "I learned something new today.  Thank you!", "And try for a new baby to replace him.", "I think it would be the opposite. He would be constantly keeping score and accusing his wife of grieving more for Izzy. YTA and just straight up evil, OP.", "Exactly and there is nothing really that makes him look good here. Either she died before they got together in which he knew he was marrying a grieving mother, or she died after they got together which makes him heartless for his grieving wife and the child he was helping raise.", "The SAME day."]}