{"id": 13391, "submission_id": "124of1v", "title": "AITA for not wanting anything to do with my Father's wake/funeral.", "selftext": "My (38m) father passed away recently and I am being pressured by my brother (36) and several of my fathers friends to help organize a wake/funeral for him. I have refused to participate in any capacity of either financially, planning, or even showing up. \n\nThere are two main reasons for this. One, I did not have the best relationship with him because he was an addict which caused me to go low contact years ago. Two, he didn't want a wake/funeral in the first place as dictated by his will.\n\nMy brother thinks I am being an asshole by not helping out an says that it is needed to help people grieve. I have told them that they can do what they want, but it isn't my problem.", "created_utc": 1680009341, "permalink": "/r/AmItheAsshole/comments/124of1v/aita_for_not_wanting_anything_to_do_with_my/", "score": 34, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I may be an asshole for not helping my brother during an emotional time.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou are not obligated to fake a relationship you didn't have, and if it was against his wishes, that's on your brother", "NTA, the way you manage your expression over the death of a relative is your business and no one Elses.", "NTA\n\nYou didnt have a good relationship and are actually following his will.\n\nThey are the AH for being selfish", "NTA.  If it's in his will, why is anyone organizing a funeral/wake?  Who is the executor of the will?", "NTA. Screen your calls and send the right people to voicemail if you must.", "NTA AT ALL! they trying to have a funeral for someone who doesn’t want it!", "NTA\nIf that's what they n need for grieving, they're free to do so. They are not free to conscript you.", "NTA. \nWhy would they ignore his wishes? That’s awful", "Anyone who insists on having a wake and funeral services when this is directly contrary to the deceased's wishes is TA.", "NTA, you aren’t obligated to do anything you aren’t comfortable or willing to do. I won’t be helping when my father dies either for many reasons.", "NTA. You set your boundaries. It’s not anyone else’s business.", "NTA\n\nYou aren't obligated to help heal these people. Especially at the cost of your own mental health.\nAlso sorry about your loss", "The will trumps everyone's feelings. Your father didn't want it- they did it anyway. That's their fault. **NTA**.", "NTA. Funerals are for the living, not the dead. If going to the funeral won’t help you grieve adequately, then don’t go. If you’re not going, you shouldn’t have to pay for it. It’s kind of a dick move on your family’s part to straight up ignore your father’s wishes on this front, but again, the funeral isn’t for him.\n\nETA: third sentence", "NTA If your father didn't want a wake or funeral then there shouldn't be one. And if you don't want anything to do with it that's your right. If your brother and your father's friends want to go against your father's wishes then they can organize it themselves.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (38m) father passed away recently and I am being pressured by my brother (36) and several of my fathers friends to help organize a wake/funeral for him. I have refused to participate in any capacity of either financially, planning, or even showing up. \n\nThere are two main reasons for this. One, I did not have the best relationship with him because he was an addict which caused me to go low contact years ago. Two, he didn't want a wake/funeral in the first place as dictated by his will.\n\nMy brother thinks I am being an asshole by not helping out an says that it is needed to help people grieve. I have told them that they can do what they want, but it isn't my problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. What they said", "NTA good for you for standing your ground!", "NTA \n\nYour father stipulated in his will that there was to be no funeral and no wake. If the people pressuring you are planning both, they are ignoring his last wishes. That's not very respectful of them. They're doing this for themselves, not him, and you don't need to be a part of it.", "NTA if that was his wish. If your relatives want one, organise it themselves. It would be about them anyway.", "NTA.  His wishes should be followed, and your feelings regarding your relationship are valid.", "NTA", "NTA. Everyone is entitled to grieve (or not) in their own way. Your brother can have a wake for your dad if he wants, but you have no obligation to participate if you don't want to. He needs to back off.", "Nta", "My uncle is. My uncle and I agreed that even though we believe it to be in bad taste that they can have whatever ceremony they want because as another commentor said it is for the living. There will be no burial or anything like that since we followed my fathers wishes in regards to his body, but they want to do a wake/ceremony as well."]}