{"id": 1342, "submission_id": "ym7ozd", "title": "AITA for telling me boyfriend to clean constantly?", "selftext": "(i would not like any “break up with him” type comments. i love him and this isn’t something i’m willing to break up over)\n\nme (18m) and my boyfriend (18m) have been dating for two years. we did long distance for a year and a half and we moved into a dorm together for college this semester. because we did long distance, i never really saw the way he cleaned. his room was tiny and he had nowhere to put anything, so it was always messy. but i assumed it was simply because of a lack of space. \n\nsince coming to college, he has picked up a lot more things than i have. i go to class and come home, and work around ten hours a week. he’s in a much more demanding course (music), is in a frat, and goes to work. at the beginning, it was obvious he was stressed so i was willing to do most the cleaning, because i was at home more and had pretty much nothing else to do. but as time has gone on he seems to accumulate these huge messes that i have to pester him to clean. \n\n(another point: we are in a double efficiency. one big open room with both beds and a kitchen, with a closed off bathroom. this wouldn’t be an issue if he had his own room)\n\nsome examples: we both have wardrobes with hangers and two drawers. despite this, he constantly has a huge pile of clothes on the floor, insisting it’s too much work to put them all away. or he just constantly leaves his stuff all over our space, never picking it up. the big thing that has caused most arguments is the dishes. i like to be clean, but i’m not crazy about it or anything. so when it’s my turn to do dishes i wait for about one sink (they’re pretty shallow) to accumulate and then i wash them. him, on the other hand, will put dishes off for up to two weeks. always finding excuses to not do them.  \n\nlast week we ran out of dishes. i told him he needed to do them. he said he would tomorrow because he has stuff to do. this continued up until now. he says he has “no time” but i constantly see him on his games. it’s two sink fills of dishes, it will take no longer than twenty minutes. \n\nhe says it’s rude and pushy that i keep reminding him to clean, but it’s very obvious to me that he will not do it if i don’t push him to. this wouldn’t even be a thing if it wasn’t one big shared space.\n\nedit: we are both dudes. gay men. he is not sexist because i’m not a woman", "created_utc": 1667589440, "permalink": "/r/AmItheAsshole/comments/ym7ozd/aita_for_telling_me_boyfriend_to_clean_constantly/", "score": 5, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) telling him to clean up 2) because he’s an adult and i should leave him alone\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but since you don’t want to break up you really don’t have any choice but to accept his uncleanliness.", "NTA. Moving in together after being long-distance is a big transition, especially at 18, I \\*highly\\* recommend seeing a couple's counselor, depending where you go to college you may be able to see one through the college for free or at least a reduced price. Hopefully he can recognize that the reason you keep nagging is because he keeps putting off basic responsibilities and that it sucks for you as much as it does for him, but he's the only one who can fix it by changing his behavior.", "If he has time to be on games then he has time to do the dishes, I’d bet anything that he’s just waiting until you cave and do the dishes and/or waiting for you to give up and stop asking him to do chores all together. It’s not quite weaponized incompetence, but it’s adjacent to it. Since you don’t want to break up with him you’ve got 2 options the way I see it:\n\n1•cave and do the dishes\n\n2•leave the dishes there and get *yourself* 1 bowl, 1 plate, 1 knife, 1 fork, 1 spoon that are yours; you clean them right after you use them and then put them somewhere he can’t use them (get a camping dish set that’s compact and keep it in your school bag if you have to). Then the lack of clean dishes only affects him. The kitchen’s gonna start to smell and the quality of meals you have to eat will probably go down, but then those dishes stay there until he does them like he said he would. \n\nEither way NTA", "Seriously you are NTA. He's treating his work and his leisure as more important than yours. If he has time to game, then he has time to wash the dishes. I'd be tempted to keep a clean set of dishes for myself (wash them in the bathroom if you have to) and look all innocent when he doesn't have anything clean to eat from. Good Lord, is the hard work of feminists since the 1970s truly for nothing when 18 year old men still expect women to clean up after them?", "I know you're both 18, but he's not taking your time seriously. You need to sit down and talk with him about this and try to find a compromise. If he refuses then that is another personality difference you need to consider. Good luck. NTA", "NAH he is just more comfortable living like this than you are. You don't want breakup advice so you really only have 2 options. Get used to living like this, or take over cleaning so that the house is always at level of cleanliness that you're comfortable with, since the level he is fine with bothers you so much.", "NAH - You and your BF are just too far apart in terms of the level of filth/clutter you can tolerate.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n(i would not like any “break up with him” type comments. i love him and this isn’t something i’m willing to break up over)\n\nme (18m) and my boyfriend (18m) have been dating for two years. we did long distance for a year and a half and we moved into a dorm together for college this semester. because we did long distance, i never really saw the way he cleaned. his room was tiny and he had nowhere to put anything, so it was always messy. but i assumed it was simply because of a lack of space. \n\nsince coming to college, he has picked up a lot more things than i have. i go to class and come home, and work around ten hours a week. he’s in a much more demanding course (music), is in a frat, and goes to work. at the beginning, it was obvious he was stressed so i was willing to do most the cleaning, because i was at home more and had pretty much nothing else to do. but as time has gone on he seems to accumulate these huge messes that i have to pester him to clean. \n\n(another point: we are in a double efficiency. one big open room with both beds and a kitchen, with a closed off bathroom. this wouldn’t be an issue if he had his own room)\n\nsome examples: we both have wardrobes with hangers and two drawers. despite this, he constantly has a huge pile of clothes on the floor, insisting it’s too much work to put them all away. or he just constantly leaves his stuff all over our space, never picking it up. the big thing that has caused most arguments is the dishes. i like to be clean, but i’m not crazy about it or anything. so when it’s my turn to do dishes i wait for about one sink (they’re pretty shallow) to accumulate and then i wash them. him, on the other hand, will put dishes off for up to two weeks. always finding excuses to not do them.  \n\nlast week we ran out of dishes. i told him he needed to do them. he said he would tomorrow because he has stuff to do. this continued up until now. he says he has “no time” but i constantly see him on his games. it’s two sink fills of dishes, it will take no longer than twenty minutes. \n\nhe says it’s rude and pushy that i keep reminding him to clean, but it’s very obvious to me that he will not do it if i don’t push him to. this wouldn’t even be a thing if it wasn’t one big shared space.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH - Welcome to what it feels like to be married. Find a common ground where you can both be happy. \n\nfor example, I HATE doing dishes, it's the one chore I will put off indefinitely. My wife knows this, so, She does the dishes about 95% of the time, and I will do the floors, something she hates to do. It's all about compromise.", "NTA but damn you really seem way too eager to be this guy’s mom. Things aren’t going to get better here so be prepared to deal with his weaponized incompetence for the duration of your relationship. You’re young so I’ll give you a slight pass. Good luck out there.", "NTA, but considering you've brought this up constantly without any results and you've specified this:\n\n>(i would not like any “break up with him” type comments. i love him and this isn’t something i’m willing to break up over)\n\nthe only advice to give is that you either have to live with his level of filth or clean up after him.", "Time to separate. Incompatible", "i usually just go down to the cafeteria to eat anyway. and i already made up my mind i’m done doing them for him. so i guess it’s just a waiting game", "i’m not a woman 😭", "Oh no not the 'different standards' bullshit! He's treating OP like a maid, or his mother. How romantic. He needs to be an adult and share the workload. He is actually a sexist arsehole and OP is NTA", "why does everyone keep calling me his mom", "again, not breaking up with him", "OP is a guy, both are guys. There's nothing sexist going on here.", "once again, both of us are men", "Because obviously his mom failed to teach him how to take care of himself! So guess its your turn to try and make him a responsible man who is not a slob!", "Because you’re acting like it :( you deserve to be with someone who respects you and does their fair share.", "Then accept this as your metaphorical cross to bear and don't look for whether you're the AH or not if you're willing to tolerate such behavior."]}