{"id": 13432, "submission_id": "12561ph", "title": "AITA for not letting my wife have some of my cake after failing her weekly weigh in?", "selftext": "It was my (M29) birthday yesterday, and a close friend of mine made me a small cake. My wife (F24) has been prescribed a weight loss plan by the dietitian she goes to. She has to weigh herself every week and lose her target 3 pounds.\n\nThis week, for the third time in a row she gained weight after snacking on a bunch of junk food and therefore failed her weigh in. She asked to have some of my birthday cake, and I told her to eat the dinner I made first so she can have some nutritious food before eating sugary cake.\n\nShe got upset at me for telling her to eat dinner first and is still mad. AITA?", "created_utc": 1680045801, "permalink": "/r/AmItheAsshole/comments/12561ph/aita_for_not_letting_my_wife_have_some_of_my_cake/", "score": 119, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for telling her to eat dinner before having cake because she clearly was craving the cake.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "If she has asked for your assistance in reaching her goal, you're NTA. I've been in your situation and had to help my husband lose weight to the same reasons you stated in a comment. While it sounds like an A-H move to tell your partner what to do (sounds a little parental, and that rarely ends well), if she has asked you to help her thwart temptation, you were just doing what you were asked.", "NTA\n\n I read through some of the comments you answered and this is a legitimate health concern. Plus by the look of it you didn't say she can't have cake but more to eat something health before she could have any (if I read it correct.\n\nIf I wasn't doing something that I was both spending money on and concerned my health I would be happy someone cares enough to make sure I'm sticking to ir (I'd be a little annoyed I couldn't have cake at that exact moment but I would understand why)", "INFO.  How did she end up under the care of a dietitian?  Was weight loss her idea, her doctor’s idea, or your idea? I’m inclined to think she reluctantly agreed to the dietician and is not actually ready to commit to a weight loss plan or dietary changes, hence the weight gain week after week. Now if she really does want to lose weight and just finds herself struggling right now perhaps she needs a support group or counseling.", "1. A doctor has specifically prescribed her to lose weight because she is pre diabetic and has hypertension.\n\n2. She has gained weight 3 weeks in a row instead of maintaining or losing.\n\n3. You said \"let's have dinner first\" before eating a bunch of sugar that can spike her insulin levels which is very bad for a pre diabetic person.\n\n4. It's your cake, you could of been a greedy pig and said \"nope I'm having it all to myself\" and no one can tell you otherwise.\n\nNTA\n\nWhen you love someone, you can not just sit back and let them harm themselves or atleast not enable it, food addiction is just as serious and harmful as drugs and alcohol, excessive eating is a form of self harm, especially if it causes diabetes which can lead to heart disease, vision loss, hearing loss, loss of limbs, high risk pregnancies and so much more, you married her to live a long, happy but also healthy life with her.\n\nEncourage her to go to therapy about her unhealthy relationship with food.\n\nI have a severe binge eating disorder, it's my issue, but loved ones not letting me eat until I'm sick when having a relapse saves me from myself more than they could ever know, just be gentle with her, you can't go cold turkey with food like you can with beer so it will be an uphill struggle.", "You guys are being ridiculous. As a married couple, it's your responsibility to hold each other accountable. You didn't yell in her face and call her fat, you just suggested she eat dinner before eating YOUR cake. You've obviously got her best interest in mind.", "NTA family support is important on a diet, and family sabotage is a common reason people fail diets. From your wording it sounds like you didn’t deny her cake, so much as suggest a more responsible choice.", "info : was the weight loss plan prescribed for cosmetic reasons or health reasons ?", ">I told her to eat the dinner I made first so she can have some nutritious food before eating sugary cake.\n\nSo she was skipping dinner and going straight to cake? To quote Pink Floyd: How can you have any pudding if you don't eat your meat?\n\nNTA it's a healthier option, it's a habit she's trying to get better at, it's YOUR birthday cake, and you made dinner she could eat.\n\nIn the end she's an adult, but I don't think this is an extreme example of controlling or out of nowhere, I see the logic behind it all.\n\nIt could easily tip in favor of her being upset depending on the way you had said it though.", "NTA. \n\nWeight loss is hard and requires discipline. The easiest way to fail is having the people around you not hold you accountable.\n\nSomeone overweight cutting out junk food is no different than an alcoholic cutting out booze. Our brain craves it and I would never give a recovering alcoholic even the tiniest sip. We all know it’s a big no-no to use the stuff you’re trying to cut out.", "NTA", "NAH. I was in your wife's shoes a few years ago. I was put in a very strict diet plan where I was weighed in every week and if I didn't lose about 2 pounds, it means I cheated on my diet. I will say that I was successful in losing weight and I felt great physically during that time BUT my mood was absolutely horrendous. I kept thinking about food and having nightmares about cheating. I'm not big on pizza but I would find myself craving it hard. I even got to a point where I was JEALOUS of fat people because in my head they get to eat whatever they want. Anyways...\n\nYou're not the asshole because it's your birthday, your gift, your cake. Your wife is also not the asshole because I know how hard it is and how it affects your moods and cravings. My husband also tried to help me stay on my diet and I remember snapping at him once kinda like your wife.", "NTA personally. I think \"controlling your wife\" is a bit extreme, I wouldn't share my treat with someone who's failing after committing to losing weight. She's clearly made the choice to keep snacking and not make progress, she can go make the choice to buy her own cake if she wants it that bad. Giving it to her is enabling her, let her make her own choices even if they're bad and she'll see where it gets her and how she feels about it.", "[deleted]", "NTA. I think she’s just taking out her frustration on you.", "3rd week in a row she’s failed the weight in WITH THE DIETITIAN and wants you to share your cake with her? NTA. I don’t agree with telling people what to eat but I wouldn’t give them any of my cake either.", "NTA I don’t care about the first part, you asked her to eat dinner and THEN have some cake, you didn’t tell her she couldn’t have some.", "I'm going NTA here. Since this is her idea and she's involved you in her journey,  you'd actually be negligent if you'd have let her eat cake first. (You might actually have been blamed).  None of us is perfect all the time, but since this a health, not an appearance, issue, you get a pass. Keep supporting her. You'll all benefit in the end.", "INFO: did your wife ask you to help her with her diet plan in any way? Not if the dietician suggested it--did your wife ask you to help? If so, what help did she specifically request?", "Alot go people are saying YTA, I disagree somewhat. You could have used some more tact in how you handled this, but this is your wife, your partner in everything, and presumably you are helping her with her weight loss. She seems unable to discipline herself when it comes to food intake, and if she has asked for your help previously then you have done the right thing. If she has asked for you to not be involved in her weight loss that’s a whole different issue. Marriage is a partnership and you should trust and support each other. Others are saying that you should let her eat cake and if she wasn’t actively trying to lose weight I would agree, but she is fighting a losing battle to get her weight under control, and you are doing your best to help her with that, you just need to use a more delicate touch I think. Good luck to you and your wife.", "NTA\n\nYou need to help her in her journey and supporting her addiction with junk food *will not help*", "NTA\n\nIt was your cake, it sounds like it were a gift, so you're entitled to share it or not.", "ITT: obese redditors who can’t fathom the idea of a healthy relationship where partners help and hold one another accountable. \n\ninb4 “being fat is actually perfectly healthy! And empowering!”", "INFO: were you actively eating cake when she asked?", "Reddit being reddit. I don't know you, so I'm not gonna assume you were being abusive and controlling. People are getting pissed because you didn't word your post exactly the way you think you did. If you were speaking from a place of concern, and you suggested she eat actual dinner before eating cake, then you're most definitely NTA.", "NTA  because you didn't  tell her no you just asked that she eat healthy before she eat cake. Her problem is with her trainer and the goal and not having adequate ways to make her feel  full. NTA she wants to use the cake so she can blame you for not being supportive and then if you tell her no she can blame you for not being supportive. This like the weight loss program she's in is a trap for you so she can blame you about her body image issues the way some in the comments are saying.", "Nta...she has pre diabetes and spiking your blood sugar by eating sugar before a balanced meal just makes that worse. These other comments are absolutely ridiculous...they must be children or ignorant.", "NTA. Post title looks awful, but it seems like this is a legit health concern and you’re approaching it in that spirit. And you didn’t actually tell her she couldn’t have cake, you just encouraged her to eat something healthier first.", "NTA- She asked for your help with her dieting and you enabling her to eat unhealthy will help nothing. If she wanted you to stay out of it, she should have specified that but she asked for help. Have a talk with her and let her know that you will not help her if she makes you feel bad and will turn herself into the victim when you try to help.", "NTA. You clearly have her best interests at heart. You didn’t say it in a mean way at all. Plus, it’s *your* cake.", "I mean unless you said it with a super condescending or judgmental tone, I say NTA. Sounds like you just wanted her to eat dinner first so she doesn’t end up only eating sugar for the evening.", "NTA", "NTA - reading the comments this is for health reasons, not appearance.  As a married couple if one person has an illness of any kind it affects both of you in every single way.\n\nThere’s nothing wrong with saying eat a little bit of healthy food first.  It’s not like you insulted her or said she can’t have even one bite.\n\nThis is a really tough road.  Please remind her that the reason you said what you did is because you love her so much and want her around and healthy long term.  I wish you both luck.", "NTA", "To be honest, this conflict isn’t about who is accountable at being TA, it is about reading between the lines and hearing what is being communicated when the words are not clearly spoken. Losing weight can be really difficult for many and takes serious self control. Getting on those scales and seeing the numbers go up reflect failure, lack of self control and a serious ding in self worth. It would seem if one stuck to the diet plan, success would be seen and self worth would go up. However, if you are one who uses food as a comfort, you are set up to fail until you can learn how to view food in a healthy way. That education is hard to naturally come by. I’m guessing when OP suggested eating dinner first, she internalized he was judging the failures and struggles she has been going through and it stung. I have a feeling she is way angrier with herself than anything OP said.", "ESH\n\nI fully understand why is your wife angry but on the other hand, she’s trying to lose weight to the point she involved the dietitian. Based on your post and other comments it seems she’s trying to lose weight due to medical issues and currently is failing to do so, so to me it seems actually nice that you’re trying to help her to get healthy again.\n\nThat being said, even tho you’re trying to be supportive it came out wrong. Really feels like you worded it poorly. And for the future, try to keep your house junk food free so it is easier for your wife not to get distracted by it.\n\nAlso… I’ve always wondered who are those people that support morbidly obese family member and keep bringing them junk food even when the person is bedridden and kinda feels like some of those people are in this comment section…", "NTA if she is on a weight list plan, the is made by a dietitian ( that I thinking she looked for) she is failing herself. All you’re trying to do is hold her accountable for a goal that it seems like she set for herself", "He says his wife was prescribed the plan after finding out she has pre-diabetes and hypotension. Off of that, I was leaning not A H. But isn't it funny that those things weren't mentioned at all in his original post? Also the way this dude is reacting in his other replies (the hyper-defensiveness, the feigned ignorance, the \"well actually\" vibe) makes me super believe there's way more to this story than he's revealing. YTA.", "She's asking you to give it to her so she's asking you to be complicit. I think it's a bit different than her going to take some and you telling her she's not \"allowed\". \n\nRegardless, this diet plan is absolutely not working for her.", "How much does your wife weigh?", "Are you her father now?  I get wanting her to stay on track, but that's an excessive way of bringing it up", "YTA. She’s going to meet her goals or not — and 3 lbs / week is extremely aggressive for a woman. Not to mention weight loss often isn’t a constant, etc. She could gain from hormones, water retention, etc. Lots of reasons not necessarily directly CICO. \n\nHowever, the big problem is your treating her like a child. And your behaving like a brat. \n\nFood will always be around her. It’s something she needs to learn to regulate herself. Your playing food cop won’t help and, as you’re seeing, is more likely going to be a negative.", "YTA. This whole situation is so dysfunctional. Losing 3 pounds per week is objectively unhealthy, so IDK what her doctor is telling her. You obviously don't give a shit about your wife's health.", "YTA - DO NOT police other people. Full stop. This is how people get pushed into (possibly furyher/recurring) disordered eating problems and how relationships fall apart from resentment.", "YTA.  This is abusive and controlling..gross.\n\n\"Not letting her have cake\" and telling her to eat her dinner like she is a child? NOPE.\n\nShe is an adult and medical decisions are between her and her doctor. Her body her choice\n\n\nEdit: just realized. Dietitians aren't even real doctors. \nFuck that even more. I knew 3lbs a week sounded nutty.", "NTA, you're the not one disregarding hypertension and prediabetes (which btw you may want to edit in; it's important that this isn't a vanity diet) or the instructions of her dietician because cake is yummy! It's on her if she wants to kick off early to diabetes and hypertension, and apparently she'd like you to shut up while she does so.", "YTA How long have you been married, because saying stuff like that isn't the best way to stay married. My father, married 50 years, is laughing at you.", "YTA\n\nIt’s her job to decide what she will and won’t eat \n\nNot yours", "if she needs to loss weight because of health reasons NTA, it is ok that u dont want to be part of this kind of actions, otherwise  YTA", "Your wife’s diet plan is between her and her dietician, it’s not your concern. YTA", "Eww no.\n\nYTA", "Gross, YTA", "YTA. Give her a piece of damn cake & stop treating your wife like she's a child. Not cool to body shame, either.", "YTA.  You may as well have said, \"No, go eat the nutritious meal you fat hog.\"  Tell me you're an AH (possibly a narcissistic one at that) without telling me you're an AH.\n\nEdit:  Just read your comments.  It it confirmed.  You are a narcissistic and gaslighting AH.  Case closed.", "I’m not your wife’s care provider, but 3 lbs a week is an ambitious goal and ambitious goals are hard to consistently succeed at.  [Plateaus are a normal part of weight loss](https://health.clevelandclinic.org/weight-loss-plateau/) and your wife may be feeling extra frustrated if her lack of recent progress is being framed as her failing, as you say.\n\nBirthday cake is the kind of special treat that is supposed to be okay (unless it’s the kind that’s always in the break room for somebody’s birthday) and this just wasn’t the time to remind her that you think she’s a failure.\n\nWe only have your perspective, but I hope her dietitian is not characterizing a week when 3lbs aren’t lost as a failure by your wife.  It may be that the current plan isn’t working for her and an adjustment is needed.  Better slow progress than for her to give up, right?\n\nYTA but I do think you can turn it around here.  Good luck to you both", "Is your wife in therapy? Or a support group? Or something like Weight Watchers? She needs somewhere to vent and work through her issues with food and I based on your post, I don’t think you’re the best person for the job. \n\nTreating your wife like a toddler won’t help anything. It’s not about the cake, she needs a complete lifestyle overhaul and I know it’s your birthday cake but if she has a real problem, it shouldn’t be in the house. Would you tempt a recovering alcoholic by keeping a wine cellar? \n\nSugar is ADDICTIVE and we have to eat food no matter what or we die. Your wife has issues with food and it’s not like she can just not eat. She will die. She needs a better support system than you. Sorry you may think you’re doing a good job but your not if you’re treating her like a child. \n\nSoft YTA because you seem to want to be supportive but have no idea how to. Get your wife into therapy or a support group.", "NTA-she’s throwing a tantrum because she wants to binge on dessert and avoid dinner and you’re doing to compromise.  I’d say you’re fine OP.", "You really need a life. Imagine being someone who constantly trolls on reddit. Grow up.", "YTA", "this type of situation.. ESH. don’t bring cake at all, it’s obviously tempting. best way to lsoe weight for her is for u both to ditch all the unhealthy (sweets, fastfood, white bread etc) food so nothing is even in the house. also 3lbs a week is indeed too much unless she’s morbidly obese. u want her to lose weight so u try to help but u messed up by having cake in the first place", "YTA.  She is an adult who needs to make her own choices.  You're not her parent.", "YTA you’re not yet dietitian. Not her parent. You’re her husband.", "YTA if this was purely \"I got a birthday cake and told her she couldn't eat it until after dinner when I was ready\" that would be totally fine! But you're not. You're talking about weight and changing the story around. The literal TITLE is about saying no because she failed a weigh in. \n\nHonestly based on the horrible comments you keep adding it sounds like your wife has an eating disorder and the stress from it being handled incorrectly is causing her to eat worse. If her problem is worsening pre diabetes numbers then she needs lifestyle changes, not simply \"weight loss\". Your comments are clearly about fat shaming and control which is *gasp* a great way to make eating disorders worse.", "Lol", "YTA, it’s a cheat meal. Be kind it’s a special occasion.", "I think your wife should go to a doctor and a nutritionist. She is being set up for failure & your comments will add fuel to the fire. She has a problem with her relationship to food and restricting it/cutting out foods completely, treating birthday cake like a “reward or treat” after dinner is a psychological cycle/trigger.", "INFO: Has your wife actually asked you to food police her?  Not has she asked you to be supportive or has she asked you to help her cook healthy meals, has she actually asked you to act as gatekeeper and dictate what she can and cannot eat?", "3 pounds a week? OP is your wife mentally challenged? Or are you? You can't seriously believe or let her do that. \n\n\n1-2 pounds MAX per week. Unless she wants to be in a permanent pissed off mood and on edge 24/7.\n\nI'm sure that'll make her make you post more questions on reddit though .\n\nAnd this is coming from someone who works out 6 days a week and is on a cut from 235 to 200. 6'2. \n\n3 pounds a week is INSANE. Working on top of that? Hahaha ya OK buddy", "OMG.  You are such an AH.  Three pounds?  Holy Jesus.  I hope she divorces you ASAP.  You are a huge jerk and need to shut up and leave your wife alone.", "YTA.  Your wife is 24, not 4.  Stop treating her like a child.", "Also, having the “sugary cake” before or after dinner doesn’t matter at all. That’s not how calories work. Seems like you just wanted to guilt her. YTA.", "Her body her choice. It applies to everything not just the usual arguments. You can't make her eat right. She also can't make you give any of your cake, although why would you need one to yourself if you're trying to make healthy lifestyle choices as you say? \nESH.", "Is the weight loss idea yours or hers? Maybe she considers herself to be OK as she is.", "YTA You are not her parent and you can't tell her \"eat her vegetables before dessert\". If she wants cake, she can make the choice to have cake.\n\nYour wife is struggling. she obviously wants to lose weight, considering she went to a dietician, but she's unable to stick to the diet.\n\nIt's easy to see this as a moral failing on her part.... BUT MAYBE there's an actual reason ***why*** she can't stick to it? maybe she doesn't know how to cook healthy things? maybe she's nervous about the lifestyle change? getting to the underlying issue will help her more than trying to restrict her like this.\n\nEdit- also, I don't think yta because you want to help your wife and see her succeed. it's because you said no to her making her own choice like she is a child. try to work WITH her instead of telling her what to do. i'm sure she also wants to succeed!", "Weight loss can be a very touchy subject.  If she wants your help, then perhaps… “let’s wait and have dessert together after dinner” would be a great approach.  If she wants to do it on her own, than perhaps a small piece will satisfy that afternoon craving.", "YTA Your wife is an adult NOT a child. She doesn't need your permission for anything.", "YTA\n\nNobody has a target weight loss of only 3 lbs. WTF dude. I don't believe this for a nanosecond.\n\nYou're treating her like a child. She can make her own choices and do work with her dietician (again, wtf does she have one for only 3 lbs???). \n\nI also don't understand why you want her to eat the extra calories of dinner plus cake. \n\nThis story makes no sense to me.", "YTA - Stay on your own plate.", "Is she morbidly obese? Because it’s not doable for most women to lose three pounds per week.  Is she having health problems? I need more information.", "Just a general comment, for those looking to lose weight, check out weight loss by Gina. (Gina Livy, the blonde, there’s a fake one on Google). I’ve been on the plan since January and my relationship with food has changed significantly. And yes, if I chose to have some cake I will for my real cake day, and just get back to it.", "YTA. She knows what she’s should be going. She doesn’t need to be made to feel like a child.", "As a dietitian, Weight loss is not linear and I would be concerned by ANY diet plan that does not allow for enjoying food surrounding holidays and celebrations. She is not a child and does not need to be told to eat her dinner first like one. Policing her food is just going to cause more issues. If she’s had a hard week with staying on track, find out why. Is she anxious? Has she been stressed? Is her current plan too restrictive to be realistic for her and is setting her up for failure? THAT is how you help her. And in the mean time, let her have the damn piece of cake. YTA.", "Mate I have to say if my husband was pre-diabetic, I wouldn’t be bringing cake into the house at all. Or I’d be making a sugar-free, low-carb cake instead. \n\nNAH. But keep the sugary food out of your house altogether. You wouldn’t be buying bottles of nice wine if she was an alcoholic. Let her cement in her new eating behaviours for a decent amount of time, or keep the sugary food out altogether.", "YTA. Don't eat junk food in front of your wife. You should have kept the cake at work to eat there. \n\nApologize to your wife and buy her a non-food gift.", "Esh. Don't eat food you know is going to tempt her around her.", "ESH. If you had said no because you wanted to wait until after dinner before you cut your birthday cake, that would be beyond understandable. The fact that your wife asked you to let her cut into your birthday cake while you were serving dinner (which you were presumably just about to eat), makes her inconsiderate. It’s rude af to start eating someone else’s birthday cake before they do, and frankly it’s also rude to ask.\n\nBut you really really need to keep it to how the situation affects you. You really don’t need to appoint yourself Nutrition Deputy. Her diet, her body, she can cheat or follow the diet as she sees fit. She absolutely does not need her romantic partner telling what to eat and when.", "NAH", "YTA for bringing the cake into the house. If you were want to support her don't bring home foods her dietician wants her to avoid.", "YTA - treating her like a child is not the way to go", "YTA \n\nif you didn't want to give your cake, that's fine. now control what she eats is not correct. the more you tell her not to eat the more she will", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIt was my (M29) birthday yesterday, and a close friend of mine made me a small cake. My wife (F24) has been prescribed a weight loss plan by the holistic dietitian she goes to. She has to weigh herself every week and lose her target 3 pounds.\n\nThis week, for the third time in a row she gained weight after snacking on a bunch of junk food and therefore failed her weigh in. She asked to have some of my birthday cake, and I told her to eat the dinner I made first so she can have some nutritious food before eating sugary cake.\n\nShe got upset at me for telling her to eat dinner first and is still mad. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don’t see the logic in eating the cake before or after the food. That doesn’t make any changes in her diet unless she is measuring her blood sugar right away.", "YTA. It’s not your job to hold her accountable, it’s hers", "She has specifically invited me to sessions with her dietitian so we can make healthy lifestyle changes as a couple.", "NTA.  And OP would be getting mostly that judgement if  the genders were reversed.", "It was her idea to see a dietitian. She was recommended to see one after her doctor informed her that her pre diabetes and hypertension were getting worse.", "As a husband I know that I should never tell my wife what she should and shouldn’t eat even if I am just doing it in a caring way. \n\nIt doesn’t matter how you say it you will say it wrong", "Three pounds is a miniscule amount of weight.  The husband is being controlling and trying to shame his wife.  WTF?  Bad behavior.", "Do you often eat entire cakes yourself?", "Health reasons. She has prediabetes and hypertension", "I said that in the post for context. I didn’t say that to her face. God, some of you really lack reading comprehension.", "My wife invited me to some sessions with her dietitian to discuss healthy lifestyle habits to incorporate. Also recipe planning to cook healthier foods.", "\"She seems unable to discipline herself when it comes to food intake\"\n\nI personally don't think discipline is definitely the issue here. Junk food addiction / reliance is real and needs more than just willpower to get out of it. The wife may just need some nutritional and recipe education to help her make better choices. And a more supportive ecosystem. Not just \"hey, don't eat that!\".", "I agree that he’s entitled not to share it if he doesn’t want to, but in this case it wasn’t about not wanting to share. He was fine with sharing he just wanted her to eat dinner first. His reasoning was about controlling her food choices. That’s what makes him the AH.", "Holy crap yes! I'm fat...I'm 5'4 230 lbs. These ppl are kinda pathetic", "No. I was serving dinner.", "Totally agreed! I’ve only watched a few my 600 pound life shows because it’s so depressing but it always struck me how dysfunctional all the relationships were. Sometimes the obese person was super mean and controlling but I the care takers sometimes the caretakers seemed to almost enjoy over- feeding.  People on here won’t give this guy a break.", "Can you explain how I was being excessive? I’m pretty sure eating a nutrient dense dinner before eating dessert on an empty stomach is generally a healthy habit to make.", "What if she was a recovering alcoholic and craving booze? Is it an AH thing to say no?", "3lbs/week is not aggressive if she's morbidly obese. \n\n12lbs a month is nowhere near aggressive.", "Nahhh you wrong as a bariatric patient, he needs to hold her to account. My wife holds me to account when I mess up. \n\nThis ain't cosmetic this is health if she is being an aggressive goal there is a reason for it. It would be different if she met goals all 3 weeks or at least two week but she hasn't met goals at any point which means she isn't taking it seriously \n\nIt is her decision and he shouldn't have cake around as the support system. The house needs to be cleaned up\n\nAs an obsese person and someone who had babroatric surgery and down 114 lbs and still losing there needs to be accountability\n\nYour right she is responsible and needs to regulate herself but his job as husband is to support and hold to account", "She's morbidly obese, is pre diabetic with severe hypertension. I lost 6 pounds of water weight in 3 days after being on blood pressure medicine. Took 6 lbs of water from my body that wasn't needed.....shhhhssshhhh", "Uhhh its not objectively unhealthy if she's morbidly obese. \n\nBeing morbidly obese or super morbidly obese is *far more* unhealthy than that weight loss. \n\n12lbs a month is NOTHING if one is obese.", "“Losing 3 pounds per week is objectively unhealthy, so IDK what her doctor is telling her.”\n\nWhat qualifications do you have to make that statement?", "It’s not objectively unhealthy if we don’t know what her current weight is. If she’s seriously overweight that’s not ridiculous at all.", "Nah my dude, 3 pounds per week is actually pretty common if you are on a diet that is both nutricious and low in calories. (For exemple, eating more vegetables like broccoli that are low in calories and lots of animal protein that fill you up good)", "3 pounds a week can be done, if someone is obese. It's not fair to say OP doesn't care at all, he is just not doing the best job at showing that he cares.", "Only the ones looking for someone else to blame for their excuses do this.  Those with agency and control take the encouragement.", "How is encouraging someone to eat dinner before dessert disordered eating?", "I do agree with you that it's not op's responsibility to police his wife's food choices and that it comes across as controlling, op's wife is an adult and has agency to decide if she wants to follow her meal plan or not.\n\nThat being said, OP himself said that his wife's doctor send her to see a dietitian bc there's a real concern about her health since she has pre-diabetes and hypertension.\n\nWhile I agree that at face value, losing 3lbs a week sounds nutty, we don't know if op's wife is severely overweight or not, since generally severely overweight people can lose as much weight as this without any problem.\n\nLast but not least, dietitians are real health professionals, not quacks. It requires at the very least a bachelor's and in some countries also a masters, as well as an internship that takes place in a clinical setting. Like you said, what happens between op's wife and her dietitian should stay between them.", "Yeah doctor tells you to stop smoking, husband takes away her cigarettes.... like a monster!!!! /s", "Actually it’s the doctor telling her what to do. Too bad she can’t stop eating junk food and gaining weight. Bet she complains after every weigh in.", "My cake my choice too lol! It was a gift to me.", "I'm not sure this is the right way to look at it. Partners are involved in each other's health choices.", "Okay so with an alcoholic their recovery is between them and their counselor. \n\nFamily, friends, loved ones don’t make a difference in helping them?", "hmm I wonder why my wife invited me to come to her sessions with the dietitian with her then to discuss lifestyle changes", "Really? Have you ever seen My 600lb Life? Not saying OP’s wife is that size, but the patients family members are *always* encouraged by the DOCTOR to stop enabling their bad eating habits. As her husband, it absolutely is his concern.", "Where did I body shame her?", "\"Give the woman some cake so she can keep eating herself to death\"\n\nNo.", "What the hell is wrong with you? He’s trying to help his wife lose weight. Nothing in his statement implied he said that, you’re putting words in his mouth. Would it have been better for him to say “ Fuck it! Fuck the diet you’re trying to be on, eat all the cake you want! “", "“ a narcissistic and gaslighting AH”\n\nDing ding ding! New achievement unlocked: psychiatric diagnosis from a redditor!", "I was gifted homemade birthday cake from a close friend. Was I supposed to throw it out? Also sweets are okay in moderation, completely cutting out tasty food is unsustainable in the long run.", "Well obviously she can’t make healthy choices so he’s concerned for his *wife* and her health. This could be life or death.", "Did you miss the part where she has gained weight despite having a dietitian, hypertension and is pre diabetic?", "Ok so then why are the items that she has been binging or snacking even in the house. A healthy lifestyle change means just that. \n\nIs this stuff that’s in the house or is she buying it and binging outside the home. If it’s in the house, you are not aligning with the lifestyle change. If it’s outside the home then she needs help for an eating disorder. \n\nI defended you in my original reply but each comment is making me change my mind about the judgement. \n\nEdit: typo", "So those healthy lifestyle changes include bringing home cake and eating it in front of  her?", "You really need to put this in the original post.", "Bro please edit before the unanimous vote goes to yta", "I would edit your post and put this information in. I don’t think you were being controlling, but I can also see how and why the post might come across that way, especially in light of how many partners/spouses are concerned about what their loved one weighs. If this is truly a health concern, and you are just as committed to her health as she is - she still calls the shots, but she has asked for help in both a medical and a “support from you at home” sense. I see you as trying to help, but again, can read this as controlling without the information here. NTA, but please edit to add that this is legit for health, and not to control her/make her look sickly/wish she looked “better” for you (again, I know that’s not the intent, so, yeah - edit)!", "you can’t make a healthy suggestion in a caring way without your spouse taking offense to it?", "Shouldn't be that way. You should be the only person in the world besides her doctor that can tell he she needs to watch her eating and for it to come out right.", "Didnt he say she has gained weight for three weeks in a row?  NTA", "Unless the goal is to lose 3 lbs per week which is the reduction of 1,500 cals per day (compared to what she normally eats; think about that for a moment.) \n\nI’m personally aiming to drop 1.5-2 lbs per week and I’m already at a healthy BMI. \n\nIf OP is believed about the manner in which it was conveyed, it was a bit controlling but I could easily see forgoing a full healthful meal for some veg and a slice of cake if it was within my calorie-workout budget for the day.", "NTA imo, as an overweight person if it came down to losing weight or losing my life. I genuinely hope someone would care about me enough to help me do what i have to do to survive. Dieting is hard and most people don’t stick to them. It’s not going to be a fun and pleasant journey in the beginning. But having a full life with no limitations is much more important than a piece of cake.", "So she did not ask you to police her eating or give her reminders about what or how to eat. YTA.", "You are absolutely correct, I didn’t mean it as in, “just don’t eat that”, I meant it more as, she has real problems she can’t overcome on her own and needs help to achieve her goals. I can see how my statement would come across as that though.", "His reasoning was to support her eating plan that she agreed to with her doctor but lacks the willpower and self reflection to recognize when she's making poor choices.\n\nThis is how you actually help someone.", "Yeah well when you directly ask for someone else's food you're literally putting your choices in someone else's hands. \n\nAnd if I had just made a dinner, I'd have told them the same thing.", "So, by this logic, I am controlling my husband's eating habits by not buying him sugary foods that could cause a diabetic coma? Even when he tells me NOT to buy certain food or bring it in the house so he doesn't eat it?\n\nThe man is trying to be as supportive as possible by changing his diet as well. And he's not shaming his wife by bringing up a valid reason as to why he suggested eating dinner first. This diet may be very important to her health. Her weight could be causing major health risks, and her gaining weight instead could be life-threatening.", "Was she refusing to eat dinner and/or demanding to eat the cake first?", "Your whole approach. It sounds like when I'm telling my daughter no more sweets until after she eats her dinner. I totally get your \"why\" but saying it like that, I would probably be irritated if my husband said that to me, like I'm a child, lol", "Adults have the right to make their own choices. We may not agree with those choices, especially when the choices are self destructive. \n\nBy taking away her ability to make a choice, you removed her rights to live as an adult with free will. You’re now essentially controlling her like a child", "You were excessive by telling her what to eat. You can suggest something more healthy but dont dictate what she can eat to her", "You weren't as a bariatric patient (I know your wife isn't) we need this accountability.\n\nYou can't force her to not eat the bad stuff her choice but you should remove it from the equation. The cake should have never been brought in the house or hidden somewhere and eaten out of sight to help\n\nFood is an addiction just like drugs and alcohol. I would say the best way to help is to remove the junk and ensure you are eating right in front of her \n\nIf she decides to bring it in and eat it nothing you can do but remind her of the goals", "I agree with that, the larger you are, the more pounds you can lose in a short period of time", "3 pounds per week is a large amount of weight most ive heard is 1-2 pounds a week", "Y'all are so dumb. Good luck, get well soon.", "There's a difference between encouraging and policing.", "As someone who's had an eating disorder: your husband griping about how much you eat will live in your head rent free and fuck with yourself esteem for a long time. \n\nYour partner is supposed to be your support system. Not the voice in your head telling you you're gonna get fat if you eat xyz.", "You could simply say, \"I'm saving it for after dinner\" if you wanted her to wait without bringing a nutrition lecture into it. You aren't her dietician. Back off.", "It's not.", "Not a monster. Definitely an asshole. All doctors will say stop smoking, even without an active health issue. Agency and autonomy are still things. Adults can make their own choices.", "What her doctor says to her is her business. Husband needs to butt the hell out. He is not her doctor. He's the one deciding he's in charge of whether she follows medical advice. \n\nMaking comments about your wife gaining weight when she wants food is shitty no matter what.", "You can decline to share without treating your wife like a child.", "are you serious? lets hop she divorces your asshole self too. lol! that would be a gift to her. you suck", "🙄 \n\nPetty and controlling still.", "You're despicable.", "Yes, it was a gift to you. But that's not why you didn't want her to have it.", ">This week, for the third time in a row she gained weight after snacking on a bunch of junk food and therefore failed her weigh in.\n\nWhy did you feel the need to bring this up? Do you have a problem with her weight or how she looks? A loving, supportive spouse would not say this because they would know it's hurtful. Stop treating her like a child and stop talking about her weight. If she is overweight, she is most likely painfully aware. (Not least of all because her husband clearly has no problem reminding her.)\n\nI stand by my original answer.", "friend has to know about ur lifestyle changes. moderation is great, but ur wife doesn’t seem to keep up with the goals set by a professional, i would naturally assume she’s overeating. as someone who actively loses weight my advice is to keep snacks and other junk out of the house and choose fruits or protein bars instead. it’s really easy to reach for snacks when they lying around, and since cakes, chips, oily foods have insane amounts of calories, if u don’t track what u eat overeating is inevitable. no judgment here just sincere advice", "The cake was not the issue , the junk food was. OP is treating her like a child. Only she can change herself, and only if she wants to. Perhaps she is acting like a child, but to change herself she has to want to change. It cannot be imposed from without.", "It was birthday cake ffs. He didn’t just go out and randomly buy cake to rub it in her face, someone who cares about him made him something to feel special on his day. Is he not allowed to have a special treat because she lacks impulse control?", "It includes \"eat a nutritious meal first, so you don't regress to bad habits and fill up on junk food and that's the bulk of what you ate tonight\"\n\nIt was never about preventing her from having cake. Just doing it responsibly and showing restraint. Which someone going to a dietitian needs help practicing.", "u/obsidiannight2010 you might edit *your* comment to y t a before the bot counts your post against OP.", "She wasn’t asking for permission to have cake, she was asking for permission to have a slice of your cake. She had already made the decision whether she was going to eat cake. Yes, you will lose no matter how you approach this. Her food choices are not your decision.", "If she’s fully depriving herself of sugar and foods she enjoys, that would explain the binging. Most dieticians I know would consider a slice of birthday cake to be a “you still have to live and enjoy your life” food, unless there’s something else going on, like your blood sugars are being stubborn about staying in control.", "If there is cake sitting there and she wants a slices anything said is going to sound like judgement any way I say it. \n\nI don’t think y t a because I believe it was from a caring place but I can also see how she would feel judged", "Apparently you can not.", "Three pounds???  Over a piece of birthday cake?  The OP is ridiculous and punitive and I hope his wife divorces him.", "Well, can you?", "NO", "No. Jesus Christ, no. What are you thinking?", "Nah, you definitely can if your significant other is generally secure, confident, and willing to have honest dialogues. I’ve always been on the slim/average side but got a bit chubbychonks during COVID thanks to a combination of wine, takeaways, and sitting in front of my computer all day while WFH and my weight gain annoyed me. My partner is naturally (and irritatingly) thin but he would make healthy suggestions about what we ate, sometimes going as far as to say things like, “Oh, you’ve been so focused on your diet. Are you sure?” And I’d grumble because I wanted pizza instead of fish but I knew he wasn’t saying it to make me feel bad but because he knew I cared and he wanted to show that he cared, too.", "People are so emotionally attached towards food. There are few that aren’t, it’s a soft YTA, but it’s not your fault.", "Exactly. So many people seem to think I’m some shallow asshole husband who is trying to make his poor wife a 90lb skinny supermodel.\n\nWhen in reality, this has nothing to do with her appearance. We both are concerned for her health.", "Her dietitian told me strategies to help remind her of her goals which my wife agreed to. These included encouraging healthy habits like eating a main course before dessert. Not sure what you’re talking about.", "Maybe the husband wants his wife not to keel over and fucking die of morbid obesity\n\nSuch a terrible thing, wanting your wife to not die.\n\n*Reddit is such a fucking joke about the issue of obesity*", "If she has asked him specifically to do that then sure, but if she hasn’t, it’s not a good idea to treat her like a child by telling her she has to eat her nutritious food before “sugary cake”. I’m not saying OP is a giant AH or anything. Just a mild one since even if he was motivated by wanting to help her, there are ways to say/do helpful things that aren’t quite so infantalizing.", "If it was just about not wanting to share his cake yet, why is 80% of his post about her weight/diet? OP certainly has gone out of his way to make it look like he was motivated by wanting to control her food choices.", "No I don’t think you’re being controlling because your husband asked you to do that. As I said in another comment, if she asked him to do this type of thing do then I think what he said to her is fine.", "Yes", "I see. How do you think I should phrase it then?", "oh Jesus, now I’ve violated human rights because I said “babe how about we have the dessert after eating the dinner I made.” \n\nWhat’s next? I’m actually the cause of the Holocaust?", "All I told her was to have dinner before having cake. I didn’t say she couldn’t have any at all. The post is clear about that.", "It would really depend on the person loosing the weight. I’m a smaller girl, so loosing 3 lbs per week would probably kill me by the end of the year. But there are really heavy people whose food intake is so much, that just by cutting sugars out of they diet can make them loose a lot of weight. It really depends on the OPs wife weight.", "Well, her dietitian is registered and certified and that’s what she recommended.", "Not for heavily obese women.", "I've heard as high as 15 a week, depends how overweight you are.", "Sorry but you’re the dumb one here. Losing 3lb a week for someone who weighs say 280lb is not in the slightest bit “unhealthy”.", "Policing would involve handcuffs, unless it's the bedroom and then handcuffs would just be restraining.", "I just wanna know how \"I made a healthy dinner for us, because you are trying to lose weight and have a dietician and I am trying to help you stick with that, eating cake first is irresponsible\" is in any way controlling. Sounds like trying to form good habits, which you need in order to make progress. Wife has bad habits, she snacks, she needs someone to help her learn to say no by saying it for her since she clearly lacks the self control to do it herself", "“your husband griping about how much you eat”\n\nWhere did I “gripe” about how much she eats?", "Okay, so me saying one sentence (let’s eat the cake after dinner) is somehow a “nutrition lecture.” \n\nI’m not her dietitian but this is literally a strategy her dietitian proposed.", "Anything to avoid accountability.", "im sorry but if my special one is under some medical advice and doesnt follows it i wouldnt be happy to see them skiping, let alone me being some kind of accomplice", "“Making comments about your wife gaining weight”\n\nWhen did I make comments about her weight to her?", "Then the wife shouldn't ask  her husband come to every apt and say it's lifestyle changes for both of them.  That's on her.", "So he can’t hold her accountable for a goal she set for herself by a dietitian that she looked for and goes to?", "She didn’t want food, she wanted junk food, big, huge fucking difference.", "You are someone who hasn't struggled with weight and talked to a doctor I suppose. Your suppsoed to hold that person to account even the doctors advise this when it comes to health", "All I said is “babe, how about we eat the dinner I made first before having the cake for dessert.” \n\nHow is that treating her like a child?", "I did not say that to her face, I said that in the post as context for commenters. Do you not have basic reading comprehension?", "But if she feels judged… that is her issue, not his - especially if OP has a history of being caring and handling situations like this delicately. At some point, she’s got to take responsibility for how she takes things, especially if they aren’t judgemental.", "yeah! and it’s okay to snack. and you let her. but you didn’t want her to make it habit again and i think you’re doing great.", "Don't worry man, it's just classic silly reddit comments. Don't get dragged into the \"not letting someone have cake is abuse\" silliness, over time there will be enough sane comments to balance things out.\n\nI suggest you go chill out, and come back to the post when the dust has settled.", "Don't worry. Reddit is capable of calling you an enabeler if you give your wife the cake knowing she has all these health issues. \nNTA she can do better and should see that you actually care.", "How much weight does she need to lose and what does the recommended diet look like?", "OP, I suggest having a heart to heart with her about this. You want what’s best for her, by what you are saying. But maybe your method of communication is not helping.\n\nAsk her directly what she needs from you and in what way would she be more receptive to the sensitive subject. When she backs down and doesn’t like your interventions, then bring back that discussion and ask again if she’s still aligned. \n\nIt’s not going to help her if she feels shamed or treated like a child. She needs to hold herself accountable more than you at this point for her continued success.", "She can't ask you to participate in this and then get mad because you're telling her to have dinner before the cake. \nIn your post, you're not saying that she's mad at how you said it. So I can't say if your phrasing was correct or incorrect.", "Again, unless she specifically asked you to do those things, then it's on her to follow them, not you. You sitting in the room and hearing the strategies isn't the same as your wife asking you to implement a specific strategy for her or with her.", "Nah, I understand OP's concern. But if he's just telling her what to do when she hasn't asked for him to help her in that way, then his \"help\" is going to frustrate her and likely backfire.", "The thing is until you are in that situation you have no idea what it’s like. \n\nDo I think OP loves his wife and wants the best for her? Yes, I chose to be positive in my view. Is his way to approach the subject the best? Maybe not, and it’s a hard subject to breach.\n\nIf he shamed her, even without the intention of doing that, he might make it worse for her in the long run. There is a mental impact of obesity and the disordered eating patterns of those who are obese. Someone can’t get thinner because you bully them, well not in a healthy manner or for the long run.", "Jesus, she has a weight problem and wants to eat a cake before dinner.  Is there never an instance when a woman is wrong?  Just zero accountability.  Always treat her as a victim who tries really hard?\n\nDo you not notice that women need to be coddled and supported and carried through just so that they can feel strong and independent?", "That was an important detail you left out of your original post. I’m getting the feeling in your writing you might be coming across harsher than you realize or mean to", "It’s entirely possible her body (not her discipline) is screaming at her it needs the high impact carbohydrates sugar provides due to the restrictive diet pushing a 3lb/week weight loss. Maybe it’s time to revisit with the dietician and adjust the diet somehow, because the diet may be too restrictive and causing a completely natural and understandable pushback on a lizard brain level. It’s also about finding what works for the patient to set them up for success.", "You’re adding to the rhetoric of ‘good’ and ‘bad’ food - which can lead to disordered eating and worse still eating disorders. When food is neither good nor bad, it’s hold on you goes away, you can simply eat and the restrict/binge cycle dissipates. She is doing the right thing by getting guidance of a dietician, therefore she does not need your guidance or judgement. For what it’s worth, adding 3lbs one week may be completely unrelated to her weight loss efforts. Personally I gain up to a kilo (2+ lbs) twice a month during ovulation and menstruation. Once that’s over, my weight goes back down to normal. When losing weight, focusing on the big picture is much more helpful. That means aiming for nutrient dense foods MOST of the time, eating something that’s just joyful like a BIRTHDAY CAKE is not and should not be considered a failure, nor should a 3lb gain. If you zoom out and the trend is downward, and you’re feeling better in yourself and your relationship with food is improving, that is success.", "\"that's fine, but can we eat dinner first before dessert?\". Just something along those lines. I don't know how hard this is for her, but as someone that also struggles(I don't eat bad food, just too much due to childhood habits from my parents that have me a bad relationship with food) it can be really overwhelming. While you may be right on your reasoning since she's working with medical professionals on this, it's really hard for some people to mentally break from habit.", "No, you're the cause of the French Revolution. \"Let them eat cake.\"  At some point, someone needs to be put to the guillotine (historic sarcasm)", "This is Reddit...you'll be called a misogynist first", "You’re changing your story. Your original post says “I told her to eat the dinner I made first”. That sounds like ordering her like a child. \n\nNow you’re softening it. So which one is correct? What did you actually say?", "Maybe your cooking sucks and she doesn't want to hurt your feelings by not telling you. Unlike you don't give a f about her feelings. \nI have to spell it for you \n\nY o u   a r e   t h e   a s s h o l e", "And all i said was dont tell her what to eat. Its not that hard, just try let go some of that overwhelming urge to control", "Next time, don’t have any cake either. Eat dinner with her, then eat cake together. This encourages her healthy habits while not making her feel isolated, as she likely feels some degree of shame about being the only one in the relationship who has to watch her diet.", "That's true, we don't have OPs wife's weight or the specifics of the diet plan.  In general 3 pounds a week is a big ask and the doctor would probably have them make slower changes to their diet as to make the weight loss more sustainable.", "Ah, even at a large size a goal of three pounds a week makes me uncomfortable. It promotes weight loss that has a history of being unsustainable and even though people who are very large can safely lose that amount a week, I've never seen a doctor recommend it as a *goal*.", "And my certified, licensed psychiatrist caused me to OD because she gave me way too high of a dosage on my sleeping medication. Licensed professionals can be wrong, and they can be outright negligent. That’s why it’s typically important to get a 2nd opinion", "So she's a bad dietician. Shocker!", "And.....", "OP didn't mention their wife's weight in the post.", "Lol \"how is saying no FOR HER since she lacks self control, controlling\" hmmm?", "\"this week for the third time in a row\" \"eating a bunch of junk food\" \n\nJudgmental. Griping.", "You thinking that you get to make that choice for her is the problem. You aren’t her parent or her dietitian, so you trying to make her eat what you think she should eat is inappropriate (unless she has specifically asked you tell her each time you think she is making a poor food choice).", "So let her talk about it with her dietitian and stop acting like her dad. This is how I interact with my children. I can't imagine talking to my spouse like that, probably because I understand that my spouse is an adult and I'm not responsible for his care and feeding. He is. \nYTA.", "Anything to excuse fat shaming and controlling male behavior.", "3 lbs a week for a woman is a lot of weight to lose. I'd be looking for a second opinion, personally.", "Actually. Just realized. It's not medical advice. Dietitians aren't even doctors.", "You literally did it in the OP. You judged her in front of a bunch of strangers on Reddit. So maybe not to her face but I kinda doubt your attitude doesn't come across IRL. (Especially given that she's mad at you)", "+ criticizing her food choices is just as bad.", "Where does it say any of that?", "Clearly, no. Since she didn't seem to ask him to and is upset about it.", "As someone who was relentlessly bullied because of childhood obesity, your comment is total BS.", "Dietician isn't even a doctor.. I just realized. \n\nI have definitely struggled with weight. I had an eating disorder. I have never seen a dietician tho.", "OP this prob won’t mean much to you but my husband has 85/90 lbs to lose. He's the largest he's ever been.\nI frequently tell him to eat before he has sweets. it helps to not spike the blood sugar and over eat on sweets. I say this to him as someone who had lost 85 lbs herself. \nSo for trying to keep your spouse on their track I'll say nta but kinda ta for bringing up failing her weigh ins.", "The way you wrote in the original post reads more like you said \"no, no until you eat nutritious stuff first.\" Like a parent that told their kid they had to eat their veggies or they wouldn't get pudding.", ">I told her to eat the dinner I made first\n\nThat is completely different than what you put in your post.", "Uh-huh. You sound like a real prince who would *never* be so disrespectful. 🙄", "hm, kinda agree. Never been morbidly obese, nor actually obese but always was on the chubbier side, causing me to be on a diet a lot. Developing early signs of anorexia then yoyoing back and then ortorexia. Can't say my relationship with food is ever going to be super healthy but I think like with anything there are things we are all missing. Here is my perspective. \n\nPeople being fat shamed are three times more keen to eat because, well, we comfort eat when we are upset and any 'fat shaming' is pretty upsetting. Do you see the circle? Also something rarely talked about killing off items 'permanently' usually leads to obsession and then frustration, regarding those items rather than healthy attitude of 'Do I want to eat it? Will it make me happy?'. It would cause binge eating. Because they have been told 'they can't have it' and then --- basically a whole load of potatoes. \n\nThat being said the husband should not police her. This is because of issues noted above but also potential resentment that this can start. Plus it can be quite abusive. I think husband's role should be there more supportive than that. As in maybe he should join her on her journey (eating habits wise). Rather than punishing behaviours (taking out food) we should talk about rewarding (as in maybe getting a dress  two sizes smaller than she is currently wearing that she would fit in when she looses x amount of weight and put it in a visible spot so she doesn't loose focus). But then praise and don't bring in the cake to the house, cupcake. Maybe something lighter she could eat and share. Or eat that cake outside house. Having her watch you eating something she wants is pretty tough and I get why she would ask.  \n\nI just don't think OP approached this correctly. It is his wife's thing to abide by the 'diet plan' and if it is not working or it is too stringent her dietitian should revisit and rework it so the feeling of being forced to give up her favourite food is less. Because it is the feeling of giving up leads to obsessive behaviour and that ultimately leads to bingeing. Just saying.", "I don't think this post is bullying though.", "Not just a cake. His uncut birthday cake. She wanted to cut and start eating his birthday cake while he was still eating dinner.\n\nWeight aside, this is greedy behavior. He was nicer than he had to be.", "I wouldnt think it was appropriate for a woman to do this to her husband either. I don’t think it’s a good idea to try to monitor you spouses weight/food choices unless they asked you to.", "And did I say she shouldn’t have cake?\n\nI simply wanted to cut the cake after we ate the dinner I made for us.", "The original post has a description of what I said, while this comment is a direct quote.", "I hadn’t had any cake either. I wanted us to eat it together after dinner.", "She's pre-diabetic, so she most likely has substantial weight to lose, making 3 pounds possible with a high protein, high fiber (veggie) diet that cuts snack carbs.", "My wife has been working with her PCP and cardiologist who also support this plan…is a second and a third opinion enough?", "Again, what are your medical qualifications?", "Look fam I'm just trying to understand. If she can't say no, and she's not changing her snacking habits, what do you do if not intervene? The dietitian doesn't live with her and can only tell her what to try doing for as long as she decides to keep going to appointments. Do you just let her make the bad choices? Is it your obligation to enable it because you're controlling if you try to stop it?\n\nI'm legitimately not trying to be an asshole, but everyone here seems to have a vastly different stance on this which doesn't normally happen for me. It seems like the answer is \"if you try to influence her behavior any way, YTA\" and it's not making sense because her choices are bad and she doesn't seem to care\n\nEat dinner first is a rule children learn, she NEEDS to work on her eating habits because grazing on junk food ruins appetite and she's not gonna get enough good nutrients to get energy to work out and start losing", "Yeah, and that was in the post for context. Not something I said to my wife.", "The only reason I saw it as my choice in this case is because it was a gift given to me. I wanted to cut the cake and eat it after dinner.\n\nIf it was just random snacks sitting around I know I have no authority to tell my wife whether to eat it or not.", "*Look at me I make my own choices... I'm an adult!*\n\nAwesome, here's a cookie.", "They actually are qualified health professionals, so...", "Of course she was upset, she is trying to change old habits. Change isn’t comfortable. So when she gets doing what she is doing ( eating junk) and gaining more weight does he have the right to say “ I don’t want to hear it”?", "Maybe you are the asshole after all in this situation and the other posters are correct to think I've been defending you in here \n\nChildhood obesity and being an obese adult two different things any bariatric doctor will tell you accountability is needed when it comes to weight loss and the patient has to want it\n\nThe truth is your wife doesn't want it currently and the truth is you are also enabling her. You both need some help", "Registered dieticians are medical specialists. Maybe you’re think of nutritionists?", "Those are virtually the same sentence. I’m telling her to eat dinner first.", "I don’t think he’s bullying her either. I do think that he might be using a method that’s not beneficial for her for the long haul. \n\nJust his view on her failing to lose the weight is also very telling. She can fail because the change might be a lot for her to handle. It’s a marathon, not a sprint. He needs to support and uplift, not view her falls as being catastrophic. \n\nThey need to have a serious talk together to discuss what she needs to feel supported. It’s a long road for OP and his wife.", "Actually yes you did. The title of your post says “AITA for not letting my wife have some of my cake” \n\nThen your pair says “I told her to eat her dinner first”\n\nNow in comments it’s “ahh babe I can’t wait to let you eat some cake. Let’s just eat it after dinner first m’kay”\n\nYou’re changing the story the more people get mad at you. At this point I’m inclined to believe the title is closest to the truth", "It’s the cake after dinner though. One is good (the dinner), the other is bad (the cake). It’s not always about what you explicitly say by the way.", "Just saying here, I only replied through my email notifications and didn't see other comments from other people, but my original content was based off how you described what you said to her", "I didn't see she was pre-diabetic in the post.  That diet would be good but making slower changes week by week towards the goal diet would be more sustainable.  If you go from constant junk and sugar to only fruit, veg, good protein, low carb can be a big shock and hard to maintain.  I'm not her doctor and I'm sure she is working with them for her weight-loss and health.", "You cannot be serious. Use google, my dude.", "Pretty sure your wife is fully aware of your attitude and feelings on the subject.", "If it was truly just about not wanting to cut the cake until after you all had dinner, then at least you didn’t have AH intentions. But if that’s the case, I find it confusing that you gave us all that detailed info about her weight/diet. 80% of your post is about her weight. And you described yourself as telling her to have some “nutritious food before eating sugary cake” which absolutely gives the impression that you were at least partly motivated by wanting her not to eat food that you don’t think is healthy for her. \n\nIt would be smart to be really carefully how you word any opinions related to her eating choices/habits in the future so that you make it completely clear that you are not trying to change her food choices.", "Rude.", "Not a doctor.", "He has the right. But it's not a good idea for a healthy relationship.", "“Babe, how about we eat the dinner I made first before having the cake”\n\n“I TOLD HER TO EAT DINNER I MADE FIRST!!!”\n\nSimilar words; very different messages", "It's the tone used.", "No, it’s about how cake is okay in moderation. Which is why you eat dinner first so you don’t have too much cake. I don’t call the foods “good” or “bad” so I’m not sure where you’re getting that from.", "TIL Google>registered medical professionals.\n\n/s\n\nDo you believe WebMd when it tells you that you have stage three liver cancer after you googled “stomach ache causes?”", "Do you hear yourself? Are you an antivaxxer too?\n\n\"Vaccines don't cause autism\"\n\n\"You cannot be serious. Use Google my dude\".", "You cannot seriously be suggesting that anyone should rely on a generalized online statement made for vague wide applicability over a personalized plan from a medical personal who has examined that patient.", "Own your choices.", "Drs send patients to dietitians.  My SIL is a hospital dietitians and every Dr sends patients to her   knows more about nutrition than the Drs and they know it.", "they are qualified for their jobs, its like telling a psychologist not to work because they are in fact not doctors, yet they are qualified health professionals, the doctor title its the highest rank a degree title can have, u can be a Theologiae doctor", "But enabling someone who has health issues to continue unhealthy habits makes a good relationship.", "You added capitalization and exclamation marks to dramatize it because you know you’re making a big stretch.", "TIL you have no way to judge what a reputable source is, apparently. Try googling and reading what places like the Mayo Clinic and the CDC say.\n\n1-2 pounds per week is considered a safe rate of weight loss. Faster than that and you’re risking other health issues. (I used to work at the center for weight loss and diabetes, as it happens.) Your wife’s dietitian’s advice goes against the standard advice from reputable sources. Very obese people can initially lose a bit more, but then they are dropping water and more muscle and a responsible weight loss plan aims to reduce the amount of muscle loss because losing muscle makes further weight loss harder.\n\nAs my brother the nurse likes to say “What do they call the person who graduated last in their class from medical school? Doctor.”", "Gonna own my choice to block you, sir.", "Not micromanaging your wife's food intake/treating her like a child when she's upset about you doing so isn't enabling.", "Yep I did. To emphasize how similar words can be taken in radically different ways.", "She is upset about a cake that’s isn’t hers. So if he is treating her like a child, she is acting like one..  I would hope my partner holds me accountable for any goal I set for myself."]}