{"id": 13469, "submission_id": "125kv5d", "title": "AITA for defending our server?", "selftext": "I (m35) have been with my gf (f44) for four years and last night was her birthday celebration.\n\nFor context, I am a 6 months sober recovering alcoholic. I have struggled with severe alcohol abuse for years and have finally found some peace from my addiction. I don’t mind being around people drinking, but I hate being around drunks.\n\nSo the birthday party starts at her favorite bar at 4pm. All her girlfriends are there and soon enough they’re all pretty intoxicated. I do my best to be cheerful and hold conversation with the group. My gf in particular has a tendency to yell when she’s drunk. It annoys me, but hey, it’s her day.\n\nAfter 4 hours of this, I see that everyone makes it to their respective Ubers and that the tab is completely paid with the bar (covering several drinks) and I tip them heavily to thank them for tolerating the large group of shrieking drunks.\n\nAt this point my gf’s coworker suggests we go to another bar. Naturally I hate the idea, but it’s her day. I drive us to second location where the celebration continues. Once this bar closes I’m ready to go home but the ladies have now decided to go to a third bar. This time, I express that I am exhausted and would rather not. This is quickly dismissed, cus it’s her day, and we drive to the third location.\n\nAt this point my gf is slurring badly, wobbly, and shouldn’t be drinking more. I encourage her to have some water and food, meanwhile her friends buy her more shots. Eventually, our server asks the table if we could keep the volume down a bit. I must stress, the guy couldn’t have been more polite about it. My gf on the other hand, took issue with this. She starts yelling “wtf did he just say!?” and her friend and coworker joined in on the indignation. At this point another server, a sweet older woman, drops off our check. The girls immediately start harassing her about being asked to quiet down.\n\nSome more context: every person in this group, including myself, works in service in some capacity. So with that in mind, I am personally ashamed to be part of the harassment the employees are receiving while politely doing their jobs. I asked my gf “could you just let it go, for me?” But there was no dissuading her. As she laid into the server, I left the table and went outside. Eventually they made their way outside, where they saw the initial server working the door and laid into him again. I plead with her to let him be and that he was just doing his job. Eventually we drove home in silence. When we got home I expressed my frustration with her actions. She called me a pussy for not siding with her and said she deserved someone who would support her.\n\nNow I’m writing this from the couch I’m sleeping on. AITA?", "created_utc": 1680088759, "permalink": "/r/AmItheAsshole/comments/125kv5d/aita_for_defending_our_server/", "score": 1791, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the asshole for siding with our server and not my girlfriend.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "My guy, i say this with love and empathy. Run. get out of the relationship. She's not good for your mental health or your sobriety. \n\nCongratulations on being sober 6 months, but your gf seems like a big threat to that achievement.", "NTA - will she even remember when she wakes up? Probably not. Hanging around with drunk people never ends well. Next time they go drinking wave then goodbye and that's it!", "NTA you're dating a lush whose never at fault. Birthdays are no excuse to act like an ass.", "NTA for defending the server.\nAre your gf amd her friends often abusive to people when drunk?\n\nMoving away from that, I'd seriously consider taking a good look at your relationship.\n\nYou're 6 months into confronting an issue you have with alcohol and your gf is more than happy to get wasted at one bar and then multiple more? Ignoring your reluctance too.", "NTA but she is not healthy for you. You’re only 6 months sober and she’s dragging you to 3 bars. She’s an abusive drunk, both to you and your server. Does she often berate people and name call when drunk? She sounds very toxic", "Definitely NTA. That kind of behavior is well beyond annoying and honestly your gf shouldn't have dragged you along for it. I actually double checked how old you said she was because this kinda sounds like a spoiled college girl on spring break.\n\nCongrats on 6 months sober!", "Imagine if she wakes up, you tell her the story and she laughs and say you know how I get when I am drunk, I am not really like that, and then she will laugh and dismiss this. \n\nShe probably needs to sober up herself.  NTA", "nta. I'm worried that she might pull you back in. When someone gets sober relationship dynamics change as well as your perceptions of others. It's time to make a list with pro/con columns and i'd bet much of her contributions fall in the con column.", "NTA\n\nI suggest finding someone you are more compatible with, and someone who is more understanding and supportive of your recovery.\n\nJust because its her birthday, doesn't give her an automatic pass to be rude to servers or you.Or anyone at all for that matter.", "Of course you are NTA, you know that. Being drunk is no excuse for being abusive to anyone.", "NTA. \nRecovering alcoholic with almost five years sober, I’m proud of you!!!! I had to get that out first. \nWith how they all acted I’m surprised that they didn’t get kicked out of the bar. You chauffeured them around to three bars knowing full well you’re in the process of recovery. You are a better human than I am. \nAgain NTA \nCongrats on 6 months that’s amazing!", "NTA, 100% \n\nIt may be time to have a serious look at your relationship.\n\nYou've realized you had a problem and are actively working to improve and recover. Which is amazing, and requires so much effort and self-disipline, something you can be really proud of! Meanwhile, your gf drags you to several bars where you have to watch her and her friends get drunk. That's about the least supportive thing she can do, besides maybe shoving drinks directly down your throat. \n\nHonestly, anyone with a shred of empathy would have at the very least not dragged you along on their drunken bender. \n\nIt really worries me that she put you in that position. And that's not even mentioning that she's apparently a nasty drunk. \n\nNow I'm not trying to jump immediatly to \"break up and run\", but do sit her down and have a serious conversation about this.", "NTA. I cannot stand when ppl make a scene over trivial shit because they’re inebriated.", "NTA, being drunk is no excuse to be abusive.", "I must be gaming to much, i thought it was a completely different kind of server XD", "The one good thing about that night, is it’ll make you think 2x or 10x before drinking again. She’s 44 acting like a 21yo on her first bar crawl. \n\nLeave her. \nNTA", "Your 44 yo girlfriend is a messy drunk. Congrats on your sobriety achievement! NTA", "No effing way. NTA. At all. And congratulations on your sobriety! Xx", "NTA. There is so much wrong here and none of it is anything to do with you.", "NTA - Sounds like your GF should consider joining you in getting sober. Her behavior was atrocious.", "NTA. If there's a next time pull you phone out and record her. If she sees her drunk self when she's sober. Might make her think about what kind of drunk she is.", "Definitely NTA , also congratulations on being sober for 6 months.", "First. Good on the 6 months. Also an alcoholic. Not recovering. I just drink consistently though the day to keep the shakes away.i don't get \"loser drunk\" anymore. Anyways. Your party was\" loser drunk\", you knew that and you should have just went to the server and told them to be cut off. So kinda ta for not. And at the same time the bar should have cut them off anyways without being told to do so. My gf doesn't drink so a drinker and a non drinker can work. But you have to have a line. Anyways good luck! I wish you the best.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (m35) have been with my gf (f44) for four years and last night was her birthday celebration.\n\nFor context, I am a 6 months sober recovering alcoholic. I have struggled with severe alcohol abuse for years and have finally found some peace from my addiction. I don’t mind being around people drinking, but I hate being around drunks.\n\nSo the birthday party starts at her favorite bar at 4pm. All her girlfriends are there and soon enough they’re all pretty intoxicated. I do my best to be cheerful and hold conversation with the group. My gf in particular has a tendency to yell when she’s drunk. It annoys me, but hey, it’s her day.\n\nAfter 4 hours of this, I see that everyone makes it to there respective Ubers and that the tab is completely paid with the bar (covering several drinks) and I tip them heavily to thank them for tolerating the large group of shrieking drunks.\n\nAt this point my gf’s coworker suggests we go to another bar. Naturally I hate the idea, but it’s her day. I drive us to second location where the celebration continues. Once this bar closes I’m ready to go home but the ladies have now decided to go to a third bar. This time, I express that I am exhausted and would rather not. This is quickly dismissed, cus it’s her day, and we drive to the third location.\n\nAt this point my gf is slurring badly, wobbly, and shouldn’t be drinking more. I encourage her to have some water and food, meanwhile her friends buy her more shots. Eventually, our server asks the table if we could keep the volume down a bit. I must stress, the guy couldn’t have been more polite about it. My gf on the other hand, took issue with this. She starts yelling “wtf did he just say!?” and her friend and coworker joined in on the indignation. At this point another server, a sweet older woman, drops off our check. The girls immediately start harassing her about being asked to quiet down.\n\nSome more context: every person in this group, including myself, works in service in some capacity. So with that in mind, I am personally ashamed to be part of the harassment the employees are receiving while politely doing their jobs. I asked my gf “could you just let it go, for me?” But there was no dissuading her. As she laid into the server, I left the table and went outside. Eventually they made their way outside, where they saw the initial server working the door and laid into him again. I plead with her to let him be and that he was just doing his job. Eventually we drove home in silence. When we got home I expressed my frustration with her actions. She called me a pussy for not siding with her and said she deserved someone who would support her.\n\nNow I’m writing this from the couch I’m sleeping on. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA don't date people who treat servers like crap.", "I think when a couple internet stranger have more compassion for your sobriety journey than your gf, that’s grounds for some introspection and relationship assessment. Solid NTA OP, and congrats on 6 months! That’s huge, keep it up!", "Fair point. That said, she is not (by my understanding) an alcoholic and tolerated my drinking for years.", "That’s how I’d normally handle it. The birthday part made my presence feel obligatory.", "The ironic part is that her and the primary friend involved in the altercation are F&B managers. This is the type of behavior they would detest. But I seriously doubt either one will admit fault.", "My fear is that there is no apology, and she stands by her actions.", "Hey thank you. I haven’t really stopped to feel proud yet, mostly still feel ashamed. The outpouring of support from everyone on my sobriety is moving. Thank you all.", "Lmao I’d never defend those servers, especially COD’s.", "That certainly would have taken the heat off the server lol.", "Thank you.", "AITA loves to tell everyone to break up over a bad day. You're definitely NTA and she definitely embarrassed herself last night.  Whether it's a deal-breaker should be based on whether it's a *pattern* of behavior. \n\nIs she generally supportive of your sobriety, or does she complain about how \"you're different now \"\n\nDoes she only go out drinking once a year on her birthday? Probably no big deal. She just had one too many and got a little out of hand. She'll wake up with a headache and a bit of embarrassment and y'all can get to work planning a non-bar outing for next birthday. \n\nDid she tolerate your drinking for all those years because she was too drunk to notice the problem?... That does not bode well for the future.", "An understandable fear.  And you are absolutely NTA here.\n\nThere is no excuse for being rude to servers and staff, ever. If someone can't stay polite when drunk then they shouldn't be out in public after that many drinks.\n\nShe's right that as your girlfriend you should support her.  But 'support' doesn't mean backing her up no matter how much of an ass she is.  Sometimes the correct way to support a friend - or a girlfriend - is to tell them they're wrong, and when they're hurting innocent bystanders is exactly the time for that.\n\nYou did everything right.  The only apology owed is from her and her friends, to the staff they insulted.\n\nCongratulations on your six months.  Recovery is hard; well done!", "There are still times when I feel very ashamed with how I acted while in full blown alcoholism. You got this! Don’t let your gf and her friends/coworkers drag you down. If you feel like you’re sinking go to a meeting, meet with a sober friend and of course when the time is right find yourself a trusted mentor. Those have helped me a lot.", "I was thinking while reading, ok when they get home to play and fuck up the server! And will the battle be epic?", "I take my hat off to you for being able to be close to booze and not imbibe. You are an extremely strong person.\n\n😎", "This. \n\nAlso people *do* seem to love trying to send relationships to the guillotine in this subreddit. Easy when we only see the arguments.", "NTA.  You know what drink can do to you, and you know that ame drinking is not an excuse.\n\nYou also know there is no resolution for any of this until Drunky McMuffin gets up tomorrow.\n\nI hope she wakes up with a huge apology for you.  Thanks for playing DD and trying to save that guy's night.", "NTA - When my boyfriend got sober, I stopped drinking for a couple of years, too. Not because I had to or because he asked me to. Because it was the right thing to do to support him. Although he eventually got to the point where he was comfortable being at a bar with me, it sure as hell wasn't only 6 months in. Your girlfriend is selfish, thoughtless, and ungrateful.", "NTA at all but your girlfriend absolutely is! \n\nI wouldn’t never make someone who is a recovering alcoholic come and watch me get drunk with my friends, birthday or not, that just sounds selfish. I also can’t stand people who are rude to service staff, it makes my blood boil! The fact she has the nerve to have a go at you for not ‘supporting her’ in her horrible behaviour is wild.", "Alcohol doesn’t make you different. It gives you the inhibition to let your real self out. Her real self is a gaping AH. Especially since she knows you’re trying to stay sober and she expected you to take her to bars with her loser friends. RUN.", "YTA \n\nthis story is made up", "You misspelled ex girlfriend", "You need to grow a backbone and learn how to say no.\n\nThey're your gf's friends, not yours. I can't imagine a world where I'm pressured to stay out because my gf's friends want to party.\n\nAlso, acting like that in her mid 40s? Is that what you really want in life?", "NTA\n\nYou can certainly judge someone's character by how they treat servers and other service staff. I would strongly reconsider my relationship with this woman, OP.", "NTA your g/f and her friends were way out of line.\n\n&#x200B;\n\nGood for you for not enabling her shitty behaviour.\n\n&#x200B;\n\nAnd... run. Fast. At 44 she has zero excuse to be behaving like this towards servers.", "NTA Congratulations on your sobriety. Question: why would you want to be around someone who gets so drunk? You said yourself you hate being around drunks. Yes it's your gfs birthday but you should have taken care of you and just left.", "NTA.  I was a bartender for 13 years.  Your gf and her friends should have been cut off.  An obnoxious unruly drunk is repulsive.  For your sobriety's sake this relationship doesn't seem healthy for you.", "NTA.  And you might want to step back and take a hard look at your relationship.  In vino veritas.", "NTA,\n\nunless there is some contrition in the morning from the gf I would strongly consider if the relationship is healthy for you.\n\nGood luck", "NTA. I wish you would have recorded her behavior, and played it for her the next day.", "NTA.\n\nMy dude, this is dealbreaker territory.  This is 'one come to Jesus talk, and if there isn't honest, positive growth and change, she's not the woman for you' territory.", "NTA. What could be more obnoxious than a loud bunch of drunks confronting a server? Who is only asking for other patrons to enjoy themselves too. \n\nCongratulations on your sobriety. Hitting three bars is not helpful. Please value your recovery as a measure of health. If she goes not support your health, what is the value of the relationship?", "NTA. Also, she has not right to kick you out of bed. If she's so angry, she can sleep on the couch.", "Maybe try having this conversation when she's sober.  NTA.  Your girlfriend & her friends do not sound like a group I would want to hang with even if I was drinking.  They sound obnoxious & embarrassing.  Which clearly they embarrassed you.  You may want to rethink this relationship bc it sounds like she's going to do what she wants regardless of your feelings.", "Definitely NTA! As someone who has battled alcoholism for years myself, I must first congratulate  you on your sobriety.  You are awesome!  Secondly, I have to commend you on your restraint, diplomacy, and courage in handling that situation.  It takes a lot to stand up for someone you don't know against someone you do.  That is true integrity !! It is sad that your girlfriend is 44 and acts like that.  She should be embarrassed and ashamed of herself.  I'm sorry that you have to put up with that , even if it is her birthday.  That does not excuse her behavior.  I might suggest you evaluate your relationship and have a serious discussion with her when she is sober . Dependent upon her reaction to the conversation, you should then decide on which way to go from there.  In the mean time, Keep up the great work on your sobriety and stay strong! You're doing great", "NTA\n\nYour girlfriend and her friends however? Yeah that's where the assholes lie. I have ZERO TOLERANCE for belligerant drunks treating waitstaff abusively. ZERO. You were more of a rug than you needed to be though. You should have said no to the last bar. Her birthday or not. You didn't have to go through that when you were done.", "Dude. You deserve better. She has a problem. NTA.", "NTA\n\n\n\nCongratulations on sobriety. As someone who watched her father get on and off the wagon for years before finding real sobriety (and mental peace), I know how fragile that sobriety can be. I also know my dad felt suddenly very alone because ALL his friends were drinkers, and wouldn't not drink around him. So he was trying to kick a life long habit with no one to talk to besides his wife and AA people (and my dad is a private guy, opening up to strangers was extremely difficult).\n\n\n\nI include all this to say that I recognize new sobriety might be isolating and staying with your gf could be the easier choice that naturally comes with companionship. But like many others have said, she's a danger to your sobriety. Three bars in one night with a focus on partying, her getting so drunk she can't stand or speak properly, and all of her friends being just as sloshed is a LOT to ask you to deal with. My father can be around people who are drinking too, but again we keep it light and sober. That is, one two drinks per person over a few hours, and no one is even getting close to tipsy.\n\n\nYour gf and her friends were being wholly inappropriate. I mean, sure, when we were young and learning how to handle our booze, most of us have been way too drunk for our own good or the public's good. But she's 44, her friends/co-workers are probably somewhere in her age range, none of this \"too drunk to speak properly\" shit is cute. And yelling at the wait staff for making the reasonable request to quiet down is shitty behavior no matter how old anyone is.\n\n\n\nYou did nothing wrong, but your gf was an AH all night. Yes it was her birthday, but she should have had some consideration for you, as her bf, as someone maintaining their sobriety, and even as her designated driver. Her insults to you at the end of the night were the rotten cherry on a nasty cake. I'd seriously reconsider staying with this woman, even if you aren't sober, she treated you and the people serving her drinks like crap.", "Also, congrats on being 6 months sober 🎉 it's a huge milestone and you should be proud of it. Your girl does seem a bit narcissistic and toxic...remember, the antidote may taste bitter but it's better than poison. Best of luck to you.", "You get the best out of the evening,", "I'm not going to advocate ending the relationship, but an important thing for all people in recovery when considering the SO that put up with their addiction all those years is: what are the SOs issues? Why would they put up with you in your addiction?\nBecause if you were already active in your addiction when you met, well, healthy people aren't attracted to addicts. If your addiction developed after you were already together, what unhealthy patterns have they developed to cope with your addiction?", "Nta - also just because she \"tolerated\" your driving for years didn't mean you need to. It's not a contest and getting belligerently drunk because it's \"her day\" isn't an excuse.", "If there's a next time go along. Don't promise to give anyone a ride home and make it clear you're leaving really early. A good excuse is that she deserves her time with her friends. You get the best out of the evening, nice photos, good conversation & avoid the drunken behaviour. Just be confident about it, nobody will mind especially if you've already said you're leaving at 9 or something like that.", "Your presence was not obligatory hon. You should have been able to call it done when you were done. Hugs. I'm so proud of your sobriety. Keep it up!", "Pattern of lack of accountability is problematic.", "Then ask yourself if that is the person you want to be with if she feels that way?   \n\nAlso ask yourself if you want to be with someone who doesn't want to better themselves for you as you are doing for her.  This is not advice to break up with her but advice to work out the issues before it becomes more serious.", "If that's the reality you already know it's not acceptable.", "For me, it's really easy to see both sides of this one, because I've seen both IRL.  If I was the long-suffering girlfriend, who never *really* got to let my hair down and relax because I was constantly having to babysit an adult toddler, I can totally see the impulse to really cut loose on my b-day.  Like, it's finally my turn to be irresponsible. \n\nI've also seen relationships with a functional alcoholic and a (dysfunctional? Non-functional?) alcoholic where the more stable partner's very serious issues get hand- waved away because it's not THAT bad, but it's definitely bad enough to worry about.", "NTA - I'd be single after that. She's 44 years old. That's ridiculous to act that way at all.", "NTA - FIrst off, major congrats on your sobriety!! Truly.\n\nThat said... your gf seems like a mean belligerent drunk with zero self-awareness and you being forced into the sober driver role so that she can go out and terrorize people feels like you flogging yourself. Why are you tolerating this? Birthday or not, people don't act that way while drunk unless something inside of them already has that in it. After 4 yrs, is this what you want to put *yourself* through?\n\nIf she doesn't wake up profusely apologizing to you and reaching out to those bars to apologize, I'd be wanting to take a close hard look at who she is inside. There's simply no excuse.", "NTA\n\nShe should be your ex. She is toxic as fuck. \n\nMy father was Alcoholic and I grew up with everything this addiction throws at you.\n\nThere is no excuse for her actions. \n\nWhen people use \"I was drunk\" as an excuse, those people are gone from my orbit. I do not associate with the likes of that.", "I would have left them to it after the second bar - I’m the driver and I’m ready to go so you either come with me and get a lift or you get yourself an Uber. \n\nI feel like this lady isn’t the one for you my friend…..also congratulations on your 6 months sober!", "NTA and that’s way too old to be acting like that", "NTA - I would have issues if, when she woke, she still insisted being an obnoxious drunk to a server was a hill she really wanted to die on and that you were wrong not to support her drunken foolishness.", "NTA. Why are you with this woman?", "One million times NTA..\n\nA birthday is a time of celebration yes but what your GF and her AH friends did is beyond contemptible, absolutely disgusting behavior…You are incredibly tolerant and patient but one’s patience can only be stretched just so far. I say get off the couch, leave and don’t look back.\n\nWhen someone shows you who they are, believe them. She’s older than you, yet she’s the one acting utterly infantile..\n\nYes you’ve been together for a long time and yes alcohol was involved, but she’s toxic and destructive and I say you need to just GTFO...\n\nYou deserve better OP, way better…", "NTA!\n\nI can relate so hard with this. Being in recovery and tolerating such a situation is wow. I give you props, because I would have went home after the first bar. I also would say if when she wakes up sober and can't see your side, get out of there.\n\nThere is no excusable reason to be rude to service workers; if you're an adult in their 40's and being belligerent and disrespectful while intoxicated, you're a massive AH. And it sounds like you're better than that.", "NTA - Get a new girlfriend. She just revealed who she really is. It's up to you to determine if that's acceptable for you.", "This relationship will end your sobriety...", "NTA….should have videotaped her and her friends.  I bet she would not find it so funny when she sees how she acted in the am.   No one should have gone to the third bar.  They all acted like irresponsible children and should apologize to you.", "Drunks are not nice people to be about with. Is your gf going to be like this if you get married? What will happen when the kids come along?", "NTA and it sounds like your GF is not able to handle her drinks and binging like this is not healthy at all. The fact that you are able to withstand this with your sobriety is a huge testament to your recovery journey. \n\nI would have a serious talk with her about how she acted last night, how she was not in control, and how she and her friends abused people in the service industry. \n\nI think that this should be a real indicator of whether this relationship will survive or not. IF she is able to see herself in that light and work to make it right - hell, she doesn't need to stop drinking, she just needs to ease off (but stopping would be better in all honesty) - then you have a good chance. If she fails to see her actions in their true light, then good luck OP... you know what you need to do for your sanity and your sobriety. \n\nLastly, great job on your sobriety OP. That is no small feat and should be celebrated.", "This woman is not good for your long term sobriety my friend. You need to get yourself out of this relationship for your own sake. Congrats on six months. \n\nEdit: forgot verdict, NTA even a bit.", "First congratulations on your sobriety. NTA, you need to get away from her and her drinking.  A big part of staying sober is to establish boundaries.  She guilted you into a situation that could have tempted you to drink. This would include not babysitting people while they got drunk.  Look for support in a group like AA.  Have a long talk with he about what happened and that you will no longer babysit her and her friends while they are getting drunk not matter what day it is.  IF she still goes off on you then you know it is time to move on without her.", "NTA I don't see how staying with a mean and sloppy drunk is conducive to your recovery, wish you the best", "NTA.  She doesn't sound....great.", "Go! Run for your life!", "NTA. My ex was like that. She would get stumbling/falling down drunk, do/say stupid shit, try to pick fights with me. It took me a couple of years to realize that it was a very toxic relationship. Leave now and save yourself a lot of heart ache.", "NTA.\n\nTime to leave the gf tbh.\n\nShe's 44, but doesn't know her limits when it comes to alcohol, which results in her acting like she's some 21 year old drunken asshole.", "NTA. She’s drunk. You should have videoed it so she can see what a nasty drunk she can be. She’s 44! \n\nGood luck making her feel responsible. I would guess she will conveniently forget it all tomorrow, or brush it off when you point out you were sober and know what happened.", "RUN, do not walk away from this relationship. NTA.", "In answer to your question, you are not an asshole for defending your server. As for any future instances of drinking, audio record the behavior and play it back for her the next day. If she doesn't see a problem with it, or thinks it's funny, then you'll need to decide what to do from there. Congrats on your sobriety!", "Congratulations on 6 months, first of all. You're doing amazing. \n\nSecondly, NTA. I'm former service industry. This all sounds very alcohol filled, but the absolute disrespect for other industry members is just unheard of. Industry people party (hard) all the time, and if we make a mess or are loud we apologize and tip HUGE. We're NEVER rude to a server or other workers because we've been there, no matter how drunk. \n\nA birthday is a birthday, and you were more than accommodating for her, but that doesn't mean everyone else gets to get steamrolled.", "Dump her\n\nSounds like you're not compatible, NTA for defending the server who was just trying to do their job", "6 months makes you a newbie. I know many many people who couldn't even be in such an environment that soon after getting sober.\n\nCongratulations on your achievement but do whatever you can to protect yourself.\n\nNTA - but your girlfriend is a disaster if she thought this was a good idea.", "NTA. Congratulations on your sobriety OP. Your gf… let’s just say you can do better. This is who she is. 🚩🚩🚩🚩🚩", "Second this. As a recovering addict: People, places, and things.\n\nYou're in a phase in your life where hitting three bars in one night and dealing with sloppy drunks is finally at an end. To have to beg a 44-year old woman to treat people like humans while she is drunk would be bad if you weren't an alcoholic. When you're in recovery, I imagine it is interminable.\n\nNTA dude. Get out of this relationship.\n\nETA: Congratulations on 6 months! You've got this.", "You're in a phase in your life where hitting three bars in one night and dealing with sloppy drunks is finally at an end.", "[deleted]", "If your addiction developed after you were already together, what unhealthy patterns have they developed to cope with your addiction?", "This. OP, I haven't drank liquor in years just because it isn't my thing. Before that, I was nursing babies for a while, so I only drank a couple of times a year, when I didn't need to nurse (the kids were old enough). If my partner was an alcoholic who got sober, that would be the last time I was around alcohol except for *maybe* toasts at weddings. This woman is not the support system you need and deserve.\n\nThis woman has watched you fight to get sober and then exposes you to all of this without thought. I worry you won't stay sober with her, and I worry that you're going to regret your time wasted with her. Maybe take a closer look at your relationship.", "💯 what this person said! OP your gf is 44 and acting this way?! Not only is she disrespectful to the waitstaff, and other patrons she is disrespectful to YOU. I think it’s gross when anyone gets belligerent and sloppy like that. Time to reevaluate your relationship to this person. This isn’t good for your mental or emotional health. This isn’t good for your sobriety. Take care of yourself.", "They are things that will hurt you in the long run if left unaddressed.", "Great point. I hate this “but it’s my daaaayyyy” thing that people pull whenever it’s their birthday (or wedding or any other event they’ve deemed is all about them). Sure, if it’s you’re birthday it’s nice to do something you find enjoyable. That doesn’t give you a ticket to act like an irresponsible AH to everybody and with no consequence because you’ve deemed it’s “your day”. OP’s girlfriend sounds awful.", "This. NTA and listen to these two they are wise. /not sarcasm.", "First, good for you for being six months sober. That's hard.\n\nIf you are tolerating behavior because you believe you owe her, behavior that you otherwise see as unacceptable, that's not healthy.\n\nSomeone who stays in a relationship with an addict is often unhealthy themselves. This is why words like \"co-dependant\" exist. \n\nSomeone who is 44 years old and seeks to get shit faced drunk - and brings their recovering addict partner with them - that's messed up. Even if it's never happened before in her life, which I seriously doubt, given history.\n\nYou're admitting to feelings of guilt, feelings of obligation, leading you to do things you don't want to, etc. These are things I hope you are working out, perhaps at AA, perhaps with a therapist.\n\nThey are things that will hurt you in the long run if left unaddressed. They are already leading you to do unhealthy things, like spending all night with people getting aggressively drunk in front of you.", "In my experience, many addicts have partners with their own substance abuse problems.  It helps them deny their own addiction when they can point to their partner and say, “My partner is the one with the substance abuse problem because they are worse than me.”  My point is, the fact your drinking was worse doesn’t mean your gf doesn’t have a problem.  It may have been one of the reasons she tolerated your drinking.  Not saying your gf has a substance abuse issue, but you should look at that issue with fresh, sober eyes after you have been sober for longer.  No need to make dramatic changes to your life now.  \n\nAlso, don’t argue or lecture people who are drunk.  It’s a fool’s errand.  You are not an ah, but you aren’t going to win an argument with someone who is drunk.  Just try to get them home and safely in bed.  If you want to discuss the prior evening’s behavior, do it when they are sober the next day.  \n\nHowever, it seems your gf is not usually like this, so perhaps you should let this one go.  What are you trying to accomplish by telling her that her behavior while she was intoxicated on her birthday was inappropriate?  Shame her?  Make you feel better?  Get an apology for what what someone did while drunk?  Having given out many of those myself, they are fairly meaningless.  I’m sure you know that too.\n\nCongratulations on your 6-months.  One day at a time.  Today is a new day.  NTA.", "She's not an alcoholic but she's a HUGE bully and expects you to be a bully too. I really hope her sober self is nothing like that.", "Nah, if the second closed at 10 there would definitely be plenty of bars open after.", "Play the recovery card, bruh. \"This event will trigger me and make me want to drink, so I'm afraid I've got to sit it out. Have a good time.\" If she gets mad about that, take Reddit's advice and dump her.", "INFO: was this in the UK?", "I have zero experience with addiction issues of my own, and only tangential experience with others. What I do have is years of experience in coping/therapy/recovery for mental health stuff. 6 months on the right path is a HUGE milestone and you should absolutely be proud of that. Believe me I understand shame based on one's past, but the act of sheer willpower it takes to actively change that is worthy of pride. Other circumstances notwithstanding, you are doing AMAZINGLY AWESOME THINGS for yourself. This internet stranger is proud of you. Blessings on your continued efforts.", "Bro - you have nothing to feel ashamed about. At. All. You bent over backwards for your GF including putting yourself in a position that may not be beneficial to your recovery.\n\nI'm a security supervisor at a large resort and I agree with the person you replied to, we would have politely cut her off based on visible over-intoxication and kicked her out for rude behavior to staff. If she refused to leave immediately we would call the police for a tresspas citation. She's lucky things didn't go worse.\n\nBased on some of your other responses, it seems there are few possibilities coming up:\n\n1. This has never happened before and she wakes up and realizes she was TA. You have a discussion about how she treated the staff and how she treated you. She accepts she was wrong and it's onward and upward.\n\n2. This level of intoxication has happened before (regardless of what your level of intoxication may have been at the time) but she also recognizes she was TA. Then you still need to recognize there is some pattern of behavior that could be detrimental to your sobriety and you need to evaluate what is best for you and your sobriety moving forward.\n\n3. This level of intoxication has happened before and she thinks her behavior was fine. I'm not one of the typical \"dump them\" people here but you need to really, seriously think about how you will maintain sobriety with a partner who not only drinks to excess but also doesn't share some of the same values of human decency.\n\nBig congrats on your first 6 months, that's huge - keep it up and live a happy life!", "You chauffeured them around to three bars knowing full well you’re in the process of recovery. You are a better human than I am.", "Haha yup...and voice of reason gets cruicified...im wondering where all the age shamers are...usually a 9 year age gap is grounds for calling the older person a creep..but i guess if genders get reversed there is no comments...just a predictable observation on reddit in general...NTA op...glad someoen stood up for the servers!", "Absolutely right.  Many people with substance abuse issues partner up with people having worse substance abuse issues to take the focus off themselves.  “Don’t talk to me about my drinking.  My [significant other] is much worse” is a common deflection, especially when it’s true.", "Tbf age gaps of someone 30+ and someone 10ish years older are very different from the typical 20+ year old with the 40+ year old we often see here. A 30+ year old could be in the same mental and life age versus a 20+ year old with a 10 year age gap. It's like how an 18 year old with a 28 year old is extremely different from a 38 year old and a 48 year old", "NTA. I've also struggled with drinking, sober eight years now. \n\nPlease break up with your girlfriend. Truly. When I quit drinking, my partner did, too, in solidarity. I stopped smoking when he wanted to quit. Anyone with a basic understanding of addiction (or general empathy) knows you should do your best to support someone's sobriety.\n\nBeing mean to servers is a red flag so big, so red, that whenever a person is a jerk to a server a bull should rightly pop up and gore the asshole with its horns. She's not worth it. Run!", "I HATE belligerent drunks. NTA.", "Eww, she sounds so gross! NTA, but run!", "As my father used to say, “Someone who’s nice to you, but not to the waiter is not a nice person.”  \n\nOP, your gf is not a nice person.  (And dragging you to 3 bars when you’re newly sober underscores that.)", "You deserve better. NTA.", "Dude, you're only being an AH to yourself by tolerating this relationship when you're so fresh in your sobriety. She is not good for you. Someone that age who gets that drunk has issues, and those issues are becoming your issues. Not everyone parties like this - this kind of party would not be fun for me or for my partner, and these people would not be fun to be around for either of us, either. \n\n&#x200B;\n\nI'm leaning between E-S-H because you need to get out of this relationship, stop doing this to yourself, or N-T-A because your gf and her friends were clearly assholes. But why aren't you standing up for yourself? Why aren't you leaving when you're tired? And I understand you don't like drunks. So why are you dating a drunk?", "Ew why are you with her?  NTA", "100% NTA. You definitely deserve better than this in a partner. My best wishes and congratulations on your journey to sobriety.", "Sounds like maybe you should give her a sweet birthday gift and leave her since she deserves someone who will support her.\n\nNTA", "NTA, and you mean ex-girlfriend, right?", "I've been programming too much. I read the title and thought this was gonna be about a sys admin.", "No, you are not TA. Your GF is and should absolutely be ashamed when she wakes up, hopefully with a ginormous hangover.", "NTA and this story perfectly illustrates why it sucks so much to be the only one sober around a bunch of drunks.", "NTA. You deserve better.", "Congratulations on your sobriety OP! It's a big accomplishment, and you should be very proud of yourself for making a commitment to a healthier, happier life. With that being said, I don't think the relationship with your girlfriend is a healthy one. It may be best to reevaluate the kind of partner you'd like to have (one that supports your commitment to sobriety).\n\nGood luck and continued success to you!!", "NTA\n\nAlso don't take relationship advice from people on the internet. A bad night doesn't have to mean a break up. I don't condone her actions but putting things into perspective is necessary.\n\nAs is well-known, drunk people are stupid. So a group of insanely drunk women, celebrating, egging each other on are definitely going to be stupid. This is coming from a chick who has gotten drunk and done stupid shit with her mates. It takes just one woman to misinterpret something and tell her friends who will escalate the scene.\n\nI think the bigger issue for you is surrounding your sobriety. Spousal influence in consumption behavior (drinking, smoking, binging etc.) is real and I think you need to take stock of how well you honestly think you can manage your sobriety if your partner will continue to drink around you. \n\nWarm regards.", "There’s absolutely no arguing with a loud obnoxious drunk. You’re always wrong. I was married to one for years. NTA hopefully she’s not abusive also.", "NTA and get out of that relationship; drunk or not there’s never an excuse to be rude and hostile to someone doing their job nor is it ok that she completely ignored you asking to go home. \nThe fact that you’re just sober and she ignored your issues with alcohol to go to three bars is a huge red flag. My dad was a receiving alcoholic and for over 20 years no one ever brought or kept alcohol into our house because he used to be an alcoholic. It’s an addiction and it’s hard to beat. My mother didn’t even cook with wine to help him stay away from temptation because that what you do when you love someone.", "Info: Why are you still with this person? It seems like you could do much better. NTA", "NTA - I don’t know who she deserves, but you deserve better than her. Run, my friend!", "NTA  If you stay with her start filming her when drunk so she can see it when sober.", "NTA at all. I won’t tell you to break up based on one incident, but I will say this: Your sobriety is more important than any relationship. Choose accordingly.", "NTA - and I really don't think being around someone like this is good for you, you of course are the only one to truly know but I couldn't have someone like that in my life if i was in your place.", "NTA\nGood job, I am sure the server was thankful.", "NTA. It sounds like your girlfriend needs to join you in sobriety. If she is acting that way while drunk, she has no business getting to that state. I'm concerned that she always acts that way while intoxicated and that you will be put in this situation repeatedly, endangering your sobriety and relationship. At some point she's probably going to get arrested and those same friends buying her shots better have the bail money ready. \n\nCongratulations on 6 months. My FIL has been sober for 20+ years and he works hard at it every day. I commend you and wish you all the best.", "*I (m35) have been with my gf (f44) for four years and last night was her birthday celebration.*\n\nPlease break up with her.\n\nShe is too old to be getting this drunk and loud and behaving like an idiot. She and her group of friends are lucky that they weren't thrown out of the bar or were arrested.\n\nGo on and pack and tell her that you deserve someone who is not rude to people trying to earn a living and trying to blame it on alcohol. She was rude to the 'little people' and would probably raise holy hell if someone treated her that way.\n\nAnd you are 6 months sober (Congrats, man!) You shouldn't be around this much alcohol or drunks.\n\nNTA", "NTA but uh you should dump her man this sounds like hell for you and she shouldn't have dragged your recently sober self around with her", "Ur partner sux.and I say this with sincerity, anyone who barhops, sux.", "Go outside. Do you see hills? If so, head for them. If not… drive to where you know you last saw some hills and then head for them. Don’t think. Don’t ponder. Don’t procrastinate. Head for the effing hills!\n\nNTA.", "Run! Don’t walk, run… she is toxic and not healthy for you nor your sobriety. It works if you work it, but it’s not worth putting yourself and those types of situations.", "NTA. it will be easier to stay sober without her. the servers don’t deserve to be treated like that. and 44 is too old to be acting like that.", "Nta. OP I sincerely hope you let your gf read this thread and that you both think long and hard about how her drinking and abusive behavior can and does impact you. \n\nI also applaud you on staying sober in this environment, that can not be easy.", "op=NTA\n\nyour GF and her friends ARE A-Hs.\n\nNext time they want an evening out, if you are willing to put up with that.  Give them a time limit(and if necessary a drink limit) after that they find their own way home.", "You need a better girlfriend. Also, she’s way too old to be acting that way, and this is coming from a fellow 40-something woman!", "NTA. Put this girl on the curb. That's where the trash goes.", "Man I came here hoping to see someone defending a minecraft server or something. Idk why I didn't expect this.", "NTA. I’d have dumped a 24 year old for behaving that way; let alone a 44 year old. \n\nThat’s beyond embarrassing and a danger to your newfound sobriety. Run.", "Hang on...she's 44 and acting like this? I'd expect this from a young adult new to drinking and partying. I think she might be suffering a mid-life crisis or something. I suggest talking to her about it when she sobers up or perhaps to seek couples therapy. This is not good for your mental health.", "[removed]", "Thank you.", "I wanted to be there for her on her birthday. I didn’t expect her to be so selfish. That said, I wasn’t particularly surprised. Reevaluation time.", "I agree with you. I knew what I was likely going to deal with and went a long with it. Something in the way of self sabotage or self pity/martyrdom. I’m trying to look into my own actions or lack there of as well.", "Yeah I definitely played the martyr and jeopardized myself unnecessarily. This was poorly handled on my part as well.", "This is true. I should have put my foot down after bar number one.", "Lmao I wish.", "OP, you are definitely NTA but I’m curious if this treatment of you is a one-time thing (she got drunker than usual since it was her bday), only when she’s drunk (if so how often), or all the time?", "Going to three bars in one night denotes an unhealthy relationship with alcohol.\n\nI drink moderately. I never get drunk and I don’t have servers asking me to curtail my drunken behavior.", "Isn't that what we do on Reddit? Rarely does the other person involved  in the conflict write their version of the story.", "Is it possible that your sense of shame is keeping you stuck in this relationship that is terrible for you?", "I really think you need to stop and just think about how amazing it is that you’re six months sober. That’s no easy feat. Take a minute and feel some pride for doing that. Alcoholism runs in my family and we always try to celebrate the milestones. Heck, we’ll celebrate with them on hard days when they want alcohol but know it’s bad for them and refuse. \n\nThese are all things to be proud of. You should be proud that you went to three different bars and weren’t tempted to drink. And if you were tempted, you didn’t give in. That’s amazing and it takes a lot of strength to do that.", "If there isn't an apology, there is a problem. When you were drinking, did you realize when you overdid it and embarrassed yourself? She does too.", "k bro 👍", "Congratulations on being 6 months sober!!! \n\nNTA, your GF who is old enough to know better, got sloppy AND abusive.  If she isn't forthcoming with an apology you should have a long hard think about if she is currently the best person to be around at this important time for you!", "I genuinely hope that if she remembers things when she wakes up she apologizes to you, you were put through the wringer right along with the servers at the third bar. I hope this isn’t common behavior for her, getting super drunk and decently aggressive. Even if it’s not common, but something you’ve seen occasionally over time, it’s an issue. You deserve to put yourself and your sobriety first, along with you mental and emotional well-being. She was obstinate and unkind, you deserve a major apology.", "Beyond the drunk behavior though, is it not a huge deal that she and her friends were awful to the servers? My reading of his post was not that she got a little out of hand. How loud do you have to be at a bar (other than a speakeasy) for it to become an issue? \n\nThough I agree that it's hard to pass judgment on a whole relationship based on a few paragraphs written by one party.", "Well said. A lot to think about.", "She's a 44 year old drunk and it's gross. Happy now?", "NTA\n\nyou deserve someone who can handle her alcohol. \n\nHope her hangover was epic.", "She was blackout drunk which never ends well. She may not even remember what happened the next day. I would let her know and see her reaction when she’s sober. She will probably be ashamed and then you should work with her to control her drinking.\n\nNTA.", "NTA at all, she put you in a horrible position and it's no excuse that it's her birthday. Just because you were born on a certain day doesn't mean you get to act like TA.", "I'd respond with \"well I deserve someone who respects other ppl and doesn't act like a garbage person in public\"\n\nNTA", "I could go on about people, places and things but what I hold onto most is that anything I put ahead of my sobriety (10 years) I’m going to lose any way. The GF may not be an alcoholic but certainly exhibits problematic behavior when drinking. NTA but please, look at the situation from the outside and talk to your sponsor.", "NTA the moment you told me your gf made you bar hop with being 6 months sober. She doesn’t care for you. I could never imagine asking my bf to do that, I’d plan a better birthday celebration. Also it’s pretty sloppy to be that age, our at bars, starting fights with the staff. Yikes.", "My guy your gf is almost 10 years older then you and acting 10 years younger then you. Find someone that actually respects you as a person and not keep you around to say she get get a guy 10 years younger then her. NTA.", "Congrats on your sobriety. You are NTA, but I’m not sure that this is a healthy relationship for you, or your continued recovery.", "NTA. Congrats on six months of sobriety! My best friend was of 21 years (were 31f) has been sober for several years. I didn’t used to drink simply because I didn’t like the taste alcohol/not feeling good in control. I drink a little now, but typically won’t drink around her, out of respect. If I do, it’s a single drink and I ask if she’s okay with it first. I can’t imagine getting shit faced around her (well anyone really, but especially her). It’d be incredibly disrespectful", "Ohhhh, buddy.\n\nShe's got an alcohol problem, an anger problem, or both. And here's the thing, she's 44, not 24. Healthy, well-adjusted 44 year olds don't typically go bar hopping until they're sloppy drunk and pick fights with serving staff.\n\nI'd take a good long look at how she responds to this whole thing when she sobers up. If there's an apology and a behavioural change forthcoming, great, there's a path forwards. If not, or she doubles down, I'd be questioning if this relationship is a healthy place for you to be, especially with your own sobriety to be mindful of.", "NTA, she and her friends were everyone's nightmare patrons- wildly drunk, loud, rude, and selfish. Not uncommon with drunk people, but they certainly cranked it to 11. Additionally, she's incredibly selfish and unsupportive to be dragging you on a bar crawl- that's awful.\n\nCongratulations on your sobriety, I'm rooting for you!\nAlso, I've never been in your shoes so it's up to you, but that doesn't sound like a very great relationship in my opinion.", "NTA. Anyone under the influence of anything is like talking to another person; I'd be surprised if they remember what they said or how they acted the next day. Henceforth, any argument that occurs during inebriation is null and void.", "NTA and leave your GF. Because that line she threw at you at home, is what she really thinks of you, even when she is sober. She just doesn't say it because she doesn't have her filter removed by alcohol.", "Very few constructive things happen in bars in the small hours. \n\nThis chick seems like a nightmare. NTA.", "NTA, you don't support people when they are wrong, no matter how much you love them. You don't support people who are acting like rude, obnoxious assholes. Being drunk is not an excuse for being an asshole.", "NTA. Your gf certainly is tho. I honestly think you can do better dude.", ">She called me a pussy for not siding with her and said she deserved someone who would support her.\n\nPussy=coward in this context. Standing up for the obviously right thing against a loved one isn't an act of cowardice. NTA maybe reevaluate the long term relationship, of which 75% of the time you spent plastered. Good luck friendo, great job on 6 months.", "NTA\n\n\"She called me a pussy for not siding with her and said she deserved someone who will support her\"\n\nDude. Run.", "NTA.\n\n\\> When we got home I expressed my frustration with her actions. She called me a pussy for not siding with her and said she deserved someone who would support her.\n\n&#x200B;\n\nYou should have had the talk to her 1 or 2 days later as reasoning with drunks is useless and just frustrating.\n\n&#x200B;\n\nAnd your gf has a drinking problem.", "NTA.\n\nHonestly, my biggest concern is with the friends here, not your GF.  (I mean the friends who stuck around after the other people got into their ubers.)  She's already drunk and making poor decisions.  She doesn't need to be surrounded by people who get her to double down on that.\n\nHopefully she was still drunk when she called you a pussy?  I'd be interested to know how she talked the next day.  (Or, you know, if she was *able* to yet.)", "NTA Your girlfriend showed no respect for you. It is cruel to bully a recovering alcoholic into going to a bar, much less three. She should have chosen a different activity to celebrate her birthday with you and left you behind for the bar hopping.\n\nCalling you a pussy because you wouldn’t join her in bullying a server is troubling behavior.", "NTA for defending the server.\n\nGoing farther, I think you should get out of this relationship. Her getting drunk is fine but it's not fair to you or a good idea for a recovering alcoholic to constantly be toted around to bars. This is not healthy and you would probably do yourself a favor by cutting that out of your life", "NTA - I can't think of a single way you would be the AH here. Your GF is acting completely unreasonable and I think it's rather disturbed to expect a recovering alcoholic to go bar hopping.", "Good for you on getting sober! It’s not an easy road. NTA but your girlfriend and her friend are ugly drunks. Not saying they have a drinking problem but they are ugly people when they get drunk. \n\nYou already know this but you can’t reason with a drunk person. When she is sober, you can talk to her about how she behaved and how it made you feel to be called names and to be embarrassed for how she treated the servers. The only acceptable response from her is a sincere apology. \n\nI don’t know how often she drinks like this but it doesn’t seem good for your sobriety if it’s even once a month.", "NTA You have my sympathies, before i met my wife i had a g/f who was absolutely stunning to look at but so rude to servers i was giving big tips and when I'd apologize  to them at the servers' area they'd express their sympathy for me.\n\nAs for your g/f. there's something wrong there. a woman in her 40's carrying on like some 18 year old on a bender? she's lucky she wasn't thrown out/refused service/handed to the police . I could understand if she didn't get it the day of, it's why it's called impaired judgement, but the next day? she should have been shame faced, not sh\\*\\* faced.", "I know Reddit is quick to say break up, but I really think you should consider this. My father always told me it’s okay to drink, but not to get drunk. I really think this applies in this case. Not only are you at a high risk of relapsing around her, her behavior is unacceptable. You need to have a serious conversation when she gets sober. If she refuses to listen, you should film her the next time she gets like this. It’s not okay and she needs to cut it out, or you need to leave for your own mental health. NTA", "NTA. She's gonna be pretty embarrassed when she sobers up. I hope.", "NTA. Why are you dating this woman? There’s about 10 reasons that you shouldn’t be. Protecting your sobriety means emotional sobriety too. Your girlfriend is endangering both. Leave her. Find a sober girlfriend. From personal experience, I’m telling you you’d be much better off.", "NTA I think she might be an alcoholic too. I may need to break up with her to keep your sobriety.", "NTA, why are you with someone like that?", "NTA but do you really want to be with someone who is this disrespectful? A drunk tongue is an honest one so you saw her true feelings last night. She is entitled.", "NTA.  Don’t go out with her on her birthday next year, if you decide to stick around.", "NTA. Dude, I don’t drink, I don’t go out with drunk people. You don’t have to do either of these things either. It sounds like you and your girl have incompatible lifestyles at the very least. You just don’t get along. I agree with others here, Run, don’t walk.", "NTA. And you know it. You’re never obligated to defend someone’s disrespectful behavior. I hope you have someone to discuss this with who’s supporting your recovery. I’m also concerned about the way she treated the servers and the fact that she demanded you support her poor behavior. How wasted was she? And how frequent is this? Is she good for your recovery? Lots of good posts on here urging you to examine the relationship for your own good. Only you know the real answers to those questions.", "Nta, this would be such a huge turn off/ red flag to me. She's 44 and still drinking far more than she can handle. Is that really someone you want to be with?", "NTA, but do you seriously what to be with someone that gets that drunk knowing you are only 6 months sober? If you were my boyfriend I would have had you stay home if I was going to go drinking. Not as a punishment but as respect to not bring that around you.", "Oh man, NTA. Hopefully when she sobers up you can have a proper conversation with her but I'm not so sure it will go well. You probably missed a tooooon of red flags before you got sober because you both in it for the ride. My service industry friend was in a really co-dependent drug and alcohol fueled toxic relationship for 13 years. They even got engaged! Her fiances behavior eventually cost him his job (he bounced at the bar she worked at) and he couldn't keep down another and started living on her dime saying he now wants to draw comics. I stopped going to the bar as frequently after I got off my own shift as because they'd bicker in sometimes scary ways while I was there because she'd been taking shots with customers and he I guess got a bunch of freebies too. She finally decided enough was enough and once she got sober she realized how much of a deadbeat her boyfriend was and how unsupportive he'd been all those years. She's not only kicked him to the curb, but she also quit smoking and got her masters degree.\n\nIf your gf is amenable to an actual conversation about not acting a fool at 44 and people trying to cut her off for her own safety and not getting so drunk you take everything as a slight, more power to you. My experience with fellow service industry people is this: they drink to get fall down drunk and treat other service people poorly or they drink to get fall down drunk and are really happy to be there.", "ETA. You always side with the SO.", "When people behave badly, they should be held accountable, even by the people that are \"supporting\" them.  \n\nSupporting someone doesn't mean you make excuses for their bad behavior.  That has another name:  enabling.  It's a bad thing, not a good one, to support and encourage someone who is behaving like a jerk.  \n\nSupporting isn't the same as compliance.  For your GF to insist that you comply with her desire to behave badly, that's her telling you to shut off all your humanity and just let her have her wants.  When such behavior becomes a pattern, it's emotional abuse.\n\nShe's wrong.  NTA.\n\nShe's wrong.  YOU are the one that deserves a better partner.", "I have a bias toward going out and getting drunk to celebrate your bday. I think its not special since you can do that literally every weekend, if you want. So, perhaps my judgement is already clouded. If my bf was a recovering alcoholic, i would most likely have either had a small celebration at home, or had gone out to a nice restaurant with him. I think she was already a bit inconsiderate to, within your first 6 months of sobriety, make you the chauffeur of the Drunk Chick Club. But again, this could be because of my bias. \nRegardless, they were loud, annoying and mean to servers. You had every right to call her out, imo. I hope that her response was out of drunkenness and she apologises in the morning, but even then, you'd have to ask yourself if you want to have to deal with her drunk self however often she goes out like that. You have to decide if she is worth it, if she apologises... NTA. And congrats on your sobriety!", "NTA.\n\nWhere I live (Ontario, Canada), regulations would have it so that they would NOT be allowed on the third bar if they were drunk already.  Also, being loud is disruptive and they would have been evicted and possibly have the police phoned on them.\n\nThe staff were just doing their job and your girlfriend was being abusive.", "I couldn't be with someone who acted like that, and being drunk is no excuse. Alcohol just amplifies what's already there. The fact that she would get drunk to the point of slurring while you're a recovering alcoholic is kind of gross to begin with. You deserve better than this.  \nYour GF sounds like a gross person, just saying.", "NTA.  Gather your things and move on.  You don't need this kind of abuse", "And you deserve somone who supports you by not going bar hopping after being sober for 6 months!!\n\nThis is such a big deal for you. You worked hard for this and she drags you all over town getting drunk. \n\nA good and supporting partner would choose a different way to celebrate (at least this birthday) . You don't need alcohol to have fun and celbrate  something!!", "Also bro grow a fucken pair lol your letting people walk all over you.", "Op, I know you’ve been together for a while and your girlfriend has been there is sober times and not so sober times… but I hope you know it’s well within your rights to reconfigure your boundaries in your relationship. \n\nI also hope you know that staying in it should never be based on quid pro quo. \n\nI know it was her birthday and it was obligatory, but it might be beneficial to sit down and discuss holidays/events in which alcohol is involved and what that looks like for the two of you, as well as the expectations involved (you leaving early, not going, etc) so that *both* of you can have fun and feel safe.  \n\nNTA.", "NTA. Congrats on your sobriety.", "Your girlfriend seems frankly awful, and especially selfish considering you're sober. You are NOT the asshole here.", "Nta. Oh dear gods, NTA. I’d honestly be reconsidering the relationship I was in, if I was you. That’s just me, though. She sounds like an insufferable person to be around, even if just when intoxicated. That’s enough for me to dipppp.", "If the ages weren’t included I would have thought that GF and her cackling friends were newly legal age teens (who will probably have problems with drinking down the track) for acting so cruel and obnoxious. \n\nNTA and bravo for sticking up for the servers.", "Time to join in the chorus; RUN! NTA but do you really wanna stay with someone who acts the way your GF does,", "My father made over 30 years sober before he passed away. I wouldn't even have been able to order a daytime margarita in front of him, much less bring myself to get blind stinking drunk and demand he chauffeur me around to get MORE booze. How the fuck does she LIVE with herself?!\n\nNTA, at all, and you deserve better.", "Yep, next he will be being called a pussy for his sobriety.", "This, OP deserves someone who is going to help keep him sober, not drag him round on a pub crawl.", "I think because I feel indebted. Or I’m afraid of being alone. She is not without her own qualities but I’m struggling to answer this", "All fair questions. I’ve got a lot of thinking to do. Don’t want to overreact and leave, but don’t want to stay in something that isn’t good for me.", "Lol", "My fault. Restaurant or bar server*", "No sponsor. Never went to a meeting. Maybe a good idea though.", "You sound like a good friend. Thanks for your support.", "You’re apparently not alone on that. Sorry for the ambiguity.", "She also sounds like she doesn’t give a shit about your sobriety. I wouldn’t be surprised if down the road, she ruins it. Please don’t let that happen. she, no one! Is worth that!", "I'm not saying you should break up or anything, all I know about your relationship is one night's events. But as someone who struggled with alcohol/drug abuse, one of the first things I realized when I got better was that I was making excuses for people in my life because they \"tolerated\" me. Because I saw myself as unworthy, I was letting people hurt me because in my mind that was all I deserved, to be \"tolerated\". Again, not saying thats your relationship, just a personal experience from me for you to consider. Congrats on six months and good luck with your journey.", "She doesn’t have to be an alcoholic to have problems with drinking. Did she tolerate your drinking or enable you? Did you drink together? How much of your relationship involved alcohol? A lot of time getting sober does involve taking a step back from people you drink with.", "An alcoholic by medical standards for a woman would be anyone who drinks more than 3 drinks on any day or more than 7 drinks per week.", "I have to wonder, OP, if you got with her because she fit your lifestyle at the time? This might be the fork in the relationship road where you go separate ways. Congratulations on your sobriety!!! It is so beautiful and hard to do. My mom is 9 years sober and I’m 38 so lots of wasted time there. \n\nNTA.", "I’m really sorry you’re in that position. The fact that you’ve managed to better yourself with your sobriety despite her excessive drinking is very impressive. I think you should try to take a step back and reevaluate your self worth. Your intimate partner should never call you belittling terms like a pussy, EVER. Being alone is better than being with someone who’s going to verbally and emotionally abuse you! And who knows… maybe you have someone waiting in the wings who has never said how they feel about you because you’re already in a relationship, or maybe you’d meet someone that’s going to support your sobriety instead of rub it in your face! You can do better!", "I think I came off as harsher than I intended because I didn't really mean to give you a dressing-down for being in this relationship. It just bums me out to see someone settling for something that seems so crappy from the outside. Especially when you're taking steps to improve yourself, and your life. It can be so fucking frustrating to do everything right (congratulations on six months sober btw, that's a huge accomplishment) and have someone who is supposed to be your partner dragging you down continuously.\n\n&#x200B;\n\nYou will figure it out. Just remember that your feelings matter too, and your comfort matters, and it's okay for you to choose the lifestyle you want to have and then take steps so that your life actually matches that. It's okay to outgrow relationships, even if it's sad.\n\n&#x200B;\n\nYou also don't have to do it on your own. I know the stigma of seeking counseling is a lot worse for men, but having someone to be an objective sounding board can be so helpful in figuring out how we feel and what we need and want in order to have the life we want. (I'm saying \"we\" because I am a therapy attender)\n\n&#x200B;\n\nSorry this is longer than I meant, too - I really feel for you.", "Please please please reevaluate your relationship and truly think about is this what you want? You dont gotta dump her but it would be a deal breaker for me. But how she treats people drunk is a good indicator of their true personality. I find drunk actions and behaviors are sober thoughts which other people might not agree with me on that point.\n\nCongrats on your sobreity we're all rooting for you", "Thank you.\n\nMy amazing, considerate, thoughtful husband who hardly lets me lift a finger and dotes on me constantly had too much to drink about 3 years into our 8 year relationship and got VERY cranky. He acted like a child and wouldn't let a simple annoyance go (I can't remember what it was honestly, but it was enough that I was thoroughly pissed off at the time). \n\nHe woke up the next day MORTIFIED. He was so embarrassed and the first words out of his mouth upon waking were how sorry he was and he wasn't going to drink that much ever again.\n\nIf this subreddit had read that one argument, they'd have probably doomed my entire relationship too. Alcohol can turn a saint into an asshole sometimes, and as long as it's not a habit and OP's girlfriend is embarrassed and apologizes, I don't think he should be running for the hills.", "This hits home. Thanks.", "Fortunately for me, I still vividly remember how awful being a slave to alcohol was and is. Drinking didn’t cross my mind. Was mostly in damage control mode.", "No we’re in the US.", "Kinda hard to compare. I was pretty high functioning. If you didn’t get close enough to smell me, most people couldn’t tell or wouldn’t say.", "Thanks but it honestly didn’t cross my mind. The whole situation kinda reinforced my sobriety and I was focused on damage control.", "I think if they were sober, yes it would be a huge deal. Excessive alcohol can make even the most patient person abrasive and cause crazy miscommunications though. Her \"wtf did he just say??\" tells me that she felt insulted, and the alcohol was definitely amplifying that feeling.\n\nI'm not condoning being a drunk asshole. And I definitely feel like OP's girlfriend was going extra hard and going down a bad path quickly by drinking as much as she was drinking, but like OP said, it was her birthday and she probably just got carried away. I do think she's a little too old to be this irresponsible with her drinking, though. These types of stories usually happen to younger adults who aren't used to their limits yet.", "Seriously, at 44, she's way too fucking old to be pulling shit like this. You said she's not an alcoholic, but binge drinking like this absolutely could be an alcohol use disorder.\n\nI'm glad you're reevaluating. You definitely should.", "Yeah, sometimes drunks can be all the more reason not to drink.\n\nI had been around drunks as a kid, and just seeing how they were and how they acted when drunk just made me never want to even get tipsy on alcohol. Watching adults turn into blabbering babies from alcohol was enough to make me never want to have more than a single drink in any 1 day.", "The silver lining to what sounds like an utterly mortifying ordeal.", "AITA (Am I the Alcoholic?) lol", "I know right. I had to go back to double check her age.", "Absolutely agree.", "Yes, especially when her partner is a recovering alcoholic. She dragged him to 3 separate bars as she got shitfaced because it was 'her special day,' and then mocked him for not supporting her drunken rude behaviour.\n\nI'm not someone to generally think that breaking up is the solution for all AITA issues, but that sort of behaviour/lack of support from a 44 year old does seems like a red flag, especially since he's in recovery.", "My mom did this with alcoholics and drug addicts her whole life to either have someone to manipulate that was conveniently already marinating in guilt or to distract from her own screwed up mental issues while conveniently being able to martyr herself about the difficulty of being with an alcoholic...that she got with *knowing* that they were alcoholics.\n\nLike literally, every single one of her exes in nearly 50 years of dating were addicted to drugs or alcohol or both. My mom, at her heaviest partying when I was <7 years old, maybe drank/\"partied\" 10 times a year, while I don't think I ever saw most of these dudes without alcohol in their hand, let alone sober. *And those are the dudes I MET*\n\nSo, I definitely don't have any trouble doubting that people with substance abuse problems that fly under the radar would deepen bonds with other users so they can mentally justify their own using.", "Oh yeah I totally get it..and I don't see anything wrong in this thread..defiantly alot of the age desrepancies are creepy and are indicitive of an abusive person..i have seen someone who is early forties dating someone 10 years younger and get creamed on here for their age difference...called a predator and everything else imaginable on a post that is talking about a small hiccup in someones long term relationship.. i knew I was going to get down voted..but I do like to point out the social difference similar post get...not that it really bothers me or anything but it is Interesting to see the double standards play out on this platform sometimes.", "NTA\n\nThat said, I hope you realize that this woman is going to get your ass kicked.", "NTA wait she's 44 and she was acting like this. OP please take care of yourself and your sobriety. If she's 44 and acting like this, that's just horrible and immature. I'm sorry you had to put up with this and who cares if it was her bday, she can still act like a freaking adult. It doesn't give her an excuse to belittle, yell, or treat anyone in that manner. I think you either need to have a talk with her about how she acted and if she is even remorseful. It sounds like you deserve someone who would treat not only you but others with respect. Congratulations on 6 months.", "People who treat service people badly can kick rocks. Especially if they themselves are in the service industry—WTF? NTA—completely the opposite in my book!", "NTA and you’ve very recently made a huge lifestyle change - you might need to change other parts of your life as well.", "Congrats on the 6 months, OP! \n\nLeave her. \n\nNTA.", "NTA. You should get out of that relationship immediately and never look back. Find someone who respects your sobriety and you.", "NTA - Personally, if my serious partner was a recovering alcoholic I would not expect him to go to bars even for my birthday. We can find somewhere else. I know this wasn’t the issue but heavily drink at bars around someone recovering, even when, like you, clearly handled yourself fine, it’s not great to be around drunk people especially aggressively drunk people.", "NTA  Please consider breaking ties with her.  She has no care about your sobriety or you would not be going bar to bar, her day or not.  She is toxic and sounds like she has her own drinking problem.", "NTA, I also hate being around people who are drunk when I am sober (being DD or just don't want to drink). They always want to do stupid stuff and then you can't reason with them. \n\nI would suggest maybe taking some time to reflect on the relationship. With the people I have worked with (I do social work), normally when someone struggles with alcohol or any drug and in a relationship, the other person normally has an issue with addiction too or struggles with boundaries. You wrote this on a Tuesday, meaning this probably happened on a Monday night. Birthdays happen on any day of the week and I know you said you all are in hospitality so you don't really have the M-F grind but with her being in her 40s, there being a 10 year difference, and her getting drunk drunk, I'd maybe think if she also has an issue with alcohol. She doesn't have to be sober just because you are but that doesn't mean she doesn't have to support you and maybe that means not getting stupid drunk.", "Leave now. Reg Flag Warning\n\nAs drunk as they were no one should have been serving them drink anyways.", "NTA  But seriously, is this a relationship you want to pursue?  *in vino veritas*", "Be careful. Drinking friends don’t like when people don’t drink with them. There will be times when they implore you to take “just one shot.” That one shot could ruin your life.", "Your girlfriend may not be vile when she is sober, but she most certainly is when drunk.\n\nNTA.", "She’s 100% right. She deserves someone who will support her. Someone as unaware as she is. Someone who has to make other’s time bad if it’s “their” day and they want what they want. \n\nIt’s just not you dear! I hope you find someone YOU deserve!", "YTA, but not for the reason you think.\n\nYou are setting yourself up for failure with your sobriety.\n\nYou will not be successful solely by removing alcohol. You also need to remove alcohol-adjacent toxicity from your life. This means anyone you spend time with that enjoys drinking or partying with any regularity. Honestly? You can’t date service industry workers anymore unless they are themselves sober.\n\nEither your relationship or your sobriety are going to end. You get to choose which one.", "Drunk is stupid most of the time.  Great job protecting the group.  NTA, I’m hopeful in the am she will regret the drunk version who treated you and others like shit.", "NTA - sounds like you and your GF are at an impasse as she has not identified her problem with alcohol and her treatment of people in hospitality makes me instantly hate her and her friends.\n\nGetting to 44 and still acting like she's in her 20s just doesn't sit with me.", "YTA. Defend your woman at all coats, even when she's wrong. Or another man will be happy to take your place. Bro, it was her birthday And she was drinking with friends. Who gives a shit about her being loud? Or even rude, to a stranger no less. That's supposed to be your girl. If you're going to be a wet blanket you should have stayed home.", "First, hearty congratulations on 6 month mark.  A large achievement by itself, a stratospheric one given you did this in a relationship with what sounds like a pretty heavy drinker.\n\nSecond, absolutely NTA.  And the whole \"calling you a pussy\" for not telling someone they were out of line thing is ridiculous too, since that's exactly what you did when you told her to stop and later when you said you didn't like the way she acted.\n\nGiven her inebriation level I don't think she was going to be receptive to your frustration at the time you voiced the night in question).  When the hangover wears off, though, have a serious talk with her about what exactly you owe her in the future, including on \"her day\", and how that doesn't include:- balancing your recovery against being surrounded by tempting alcohol and loud obnoxious drunks who would drive anyone to drink for 4+ hours on end- being awful to people because her drunk ass thinks you should.", "Honestly, I question her in a lot of ways. She's 44 years old! The scenario you described could be excused in your 20's. She's too old to be acting like that, and not knowing how to contain herself or her alcohol. It makes me question her abilities as a capable adult among other things. She was totally in the wrong for acting like that, and IMO getting that shit faced. Also, for context I'm 43. And I love having myself a good time, but she's too damn old to be getting plastered in public and making an ass of herself AND not recognizing her behavior is in appropriate and blaming you for it. That's just not ok, all the way around, your issues with sobriety don't even matter to me in the context of her behavior.", "NTA. Your girlfriend says she deserves someone that is going to support her? Okay then OP you break up with her and let her  find that person to support her. She doesn't even care about you or your feelings and boundaries. Oh if your gf says \"it was the alcohol\" your gf has no accountability and you should yeet her out of the relationship", "NTA", "Bro you're dating a 44yo teenager. Get out of there! NTA.", "NTA - Break up with that woman. Also why you sleep on the couch?? You did nothing wrong", "NTA but you need to seriously rethink your relationship with her. I would have left her at the first bar or drove home and told her that she was on her own for being a sloppy drunk.", "NTA.  You might wanna re think a few things, though.  What's the phrase?  Drunk words are sober thoughts?  She works in service, yet feels its acceptable to not just be an AH but to try to get YOU to act like an AH? She means that, in reality.  And, if my BF was only six months sober, I wouldn't be out bar hopping, making him my DD.  That's unnecessary temptation.  Jesus Christ, I thought for a second she was like 22, but.... She's my age, she should know better by now.", "Obviously NTA.", "As a recovering addict, I couldn't agree more. I honestly I hate to sound all AA/NA but maybe u need to take some time for yourself and be alone for a while. Ur newly sober, this is a particularly dangerous time for u. And being around someone like this and the ppl she obviously involves herself with, it is not good. U really shouldn't be in a relationship for at least a year. Take it from me, I didn't listen to this and every relapse I had was relationship related. I am a little over 8 years, I do not follow AA/NA as I hate the way the rooms are, esp as a female but I'll tell u this, if I was with someone like this at 6 mths recovery, I wouldn't make it to 7, regardless of how deeply I wanted to continue my recovery.\n\nAddiction is an insidious beast and will creep into the tiny cracks and crevasses in ur psyche, no matter how \"good\" u think ur doing. If u need a sober/recovery friend, plz don't hesitate to message me anytime. It's fucking hard my dude, hard af. But it's even harder when u have a partner who acts like this with reckless abandon regardless of the supposed love of her life and his very important, life saving journey. Plz plz take some time and think deeply about this. Please. ❤️\n\nNta even a little.", "These are my thoughts too, have that conversation. If I had a tendency to be loud when drunk (btw who doesn't) which irritates my partner, I would be pretty pissed off if he never talked to me about it. Because if we talked about this, I would ask him to help me limit my alcohol intake, because a) I don't want to be loud and annoying and b) I don't want to annoy him when we are meant to have fun and c) I don't want to do anything to make recovering from alcoholism more difficult than it already is for the person I love. So no, NTA for defending the server, but you would be an asshole if you never discussed this with her and for letting her friends drunkfeed her. And maybe for continuing to go with the party after you had enough (btw who doesn't have enough of drunk people especially when sober) and was tired instead of going home and leaving them party on, but I don't know your area and how safe the party would have been without you, so probably kudos for putting up with them.", "Lmao it’s been a thought. Fortunately I’m physically imposing and soft spoken.", "This has been said by several people. I thought about it, but I needed to get her home safely first and reevaluate after that.", "Not to sound crass, but who gives a damn about ops \"sobriety journey \"? It was his girlfriends birthday, not an AA meeting.  Of course no one cared, it wasn't his birthday. It wasn't his party. It wasn't his moment to let loose. I wouldn't have cared either. That soberity journey is his journey to walk. Not everyone else around him. It's not a group field trip.", "She’s 44 not 4. \n\nThe whole BUuuut ITs mY bIRtDaaaayyy! does not make it obligatory for you be in situations like this. \n\nShe sounds immature and low on empathy which honestly is not a great combo.", "I worked in that world for a lot of years, and Sadly some of the worst behaved drunks I've ever known worked in the industry, and most of them were managers.\n\nHaving gotten away from the business, and coming up on two years sober, congrats on your six months. You ever need to talk drop me a DM.", "I could say I’m addicted to overriding my own needs to the point I got severely burnt out early in my twenties. Sounds weird maybe but it’s very much self harming behavior as well. I think I understand some of the ‘the opposite of addiction is connection’. For the life of me I cannot go to bed early when I’m tired. \nIdk long ramble to say - here is another stranger who is so, so proud of you. The stuff that’s hidden under addiction is so hard to face and will come at double force once we stop suppressing it - to face that is brave. Every day and every second again.", "She’s in her fourties? Alcoholism is a disease. If I have to explain which of these holds more weight I think this conversation is probably not worth the effort. Also, we’re talking about OP not being ok with drunk girlfriends need to verbally berate waitstaff. No one is saying don’t have a birthday party, we’re saying don’t get so shithoused you can’t interact with the public without being an asshole.", "It definitely seems like he should have gone home when he wanted and let her continue the girls night", "She's in her 40's? So what? Its a damn birthday celebration. Op's disease is his disease. It's not contagious. Why on earth would he expect anyone else to care if he drinks or not? It wasn't his birthday. The night wasn't about him.  This is ridiculous.", "‘Utterly mortifying ordeal’ i love that wording it’s perfect. Are you British perhaps? (Non native English speaker just making a guess haha)", "NTA. Someone realizes they have a problematic relationship with alcohol. Makes changes. Then realizes how many people in their life enabled the alcoholism. This used to be a typical night out for you. How are you going to spend your time now and who are you going to spend it with? It’s not uncommon for recovering alcoholics to make significant changes in their relationships", "You are NTA for defending your server. If you value your sobriety you’ll leave this relationship.", "She’s *44* acting like this?! I had to go back up and see if I read that right. Being drunk is no excuse for treating people like trash. Anyone who treats food service workers badly are gross. You are absolutely NTA. But your gf and her friends are. Dragging you to bars when you’re 6 months sober (congrats by the way!). You deserve so much better than this.", "My man you need to leave", "NTA she's too old for all that - working in the service industry or not. There is a time to go home and drink, it's when the DD says they're exhausted and don't want to go to another location. Now you're fighting with staff and your DD/BF it feels like she needs a break for alcohol too. We can all get out of control when we drink too much, she lost it.", "NTA.  why are you with this woman?  You sound like you have very low self esteem.", "[removed]", "Why are you even with this person. \n\nNta", "NTA. i work in hospitality, if my husband starts verbally abusing our server he'll be the one sleeping on the couch, not me.", "NTA and congratulations on your sobriety and surviving that mess. Pretty shocked that your girlfriend is 44 and acting like a black out 20 year old from the meanest sorority house. Does she get like this often? Because…..I mean I don’t know anyone who could put up with someone still acting out of control like that in their 40s.", "NTA but your girlfriend sure has a problem. She’s in her 40s and she’s still acting like she’s 18. She’s rude, disrespectful, and incredibly immature. Maybe that’s just when she drinks, but if you’re that much of an asshole when you drink, you’re still an asshole.", "That’s insane behavior for anyone of legal drinking age and these people are middle aged. Leave my guy. Leave now.", "nta but you would be to yourself if you stay with her. she doesn't care about you and it being her bday doesn't give her an excuse to treat you badly, treat staff badly, and ignore you boundaries being around someone drunk.", "NTA.\nYou sound like a darn saint.\nYou put her happiness over yours even when she didn’t deserve it.\n\nAs a mental health worker who’s worked with a lot of recovering addicts, I’d say RUN. Your health is so important and I’ve seen how easy it is for people to fall off the wagon early on when they’re around their trigger (not implying that you will!)\n\nBut anyway, SO proud of you for being 6 months sober!! That’s huge, you should be proud of yourself!! I wish you many more happy years of sobriety!! ❤️", "NTA\n\nI am many years sober myself. \n\nCongrats to you. \n\nEarly sobriety there are a lot of changes, relationships, points of view, likes/dislikes, life, etc. \n\nHanging out with drunks when not drinking...generally not fun. And not a place for you to be.\n\nYou are not anyones DD by default or babysitter. Period.   \n\nA healthy convo would be to gf that you love her, and want her to have a good time, and you two can go to dinner/whatever...but her going out for drinks to party/get hammered will need to be another evening and is not your life anymore.", "NTA but also not sure why you thought you’d have a productive discourse with someone that drunk. \n\nIn the future, birthday or not, I don’t think you should feel obligated to tail along on your gfs drinking benders. Especially given your history. I wouldn’t ask a sober friend to do this, let alone my partner. They can Uber home.", "NTA\n\n&#x200B;\n\nYou'll be best served - RUNNING FAR, FAR AWAY.", "I think others have covered why you’re NTA. Just wanted to say, as someone coming up on 2 years (which I never imagined): congrats on 6 months. It is hard, and good for you! \n\nI’d keep an eye on yourself for cravings in the coming days though. Sometimes being around drinking is fine for me at the moment and hits later.", "NTA\n\nWay to go! Way to keep focus on the main thing.\n\nUnfortunately your gf is not on the same path. For your own good break this off.", "Came here to say this. I'm 5 years sober.", "No. You do not defend your woman when she’s acting like an entitled ass. Who cares that she was rude? Wow. Are you the gf?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA. You're 35. In a few more birthdays she will be 50, you will be struggling with sobriety because she does nothing to keep herself in check, and you will wonder why you stayed in a relationship so toxic and unappreciative of your thoughtfulness and kindness to her. You deserve better. Find something that catered to you and don't apologize to anyone for seeking what makes you happy. Do the things you were meant to do and drop anyone that doesn't suit your new sober life. You got this.", "Now, now! Those servers work hard to allow people to play. Any lagging or downtime is on management level. ;)\n\nNTA btw! I’m proud of your progress and impressed by how much you managed to endure that evening. I hope things work out and she admits fault in her actions and that the two of you can work it out. Just don’t get stuck in a toxic environment… I read that you haven’t stopped to feel proud and is still in a stage of guilt, but you need to be in a good place to progress further. You are worthy of feeling proud over your achievements.", "> \n> \n> \n> \n> However, it seems your gf is not usually like this, so perhaps you should let this one go.\n\nI wouldn't say this should be let go. It should be followed up on. If this is out of character for her, she shouldn't have an issue apologizing for her awful behavior. If she won't, that's a sign she's not so great for OP.", "> Going to three bars in one night denotes an unhealthy relationship with alcohol.\n\nGive over", "Lol my ex always said he did his best talking when he was drunk. I concur with your assessment of drunks, he is an asshole drunk. \n\nRun OP. I've worked with people in recovery and she will only make things more difficult. Congratulations,  those first steps are a doozy.", "Im glad hes an EX !! I hope op runs personally", "My ex is a recovering alcoholic, and if I'm being entirely honest, there was definitely that \"I finally get to have fun and not be responsible for him/the kids all by myself\" moment a few times after he hit the one year mark. Before he was sober, I couldn't drink at all because if I did, there wouldn't be a sober person to care for the kid(s), or to keep him from trying to drink and drive.\n\nSo I totally get it if that's where OPs girlfriend is coming from with drinking in excess. She's still t a in this, but I get it.", "Years of watching family members turn into drunk fucking morons turned me off drinking. I drink a glass of port here and there but nothing beyond that.", "Lol I'd buy OP the running shoes", "A woman who likes to drink to excess, and thinks the evening you describe is a fun evening, is not right for you at this point in your life.", "First of all, congratulations on 6 months! I am almost 10 months sober so I relate heavily to this. NTA. Being belligerently drunk and yelling at food service workers does not warrant support, and I’m glad you said something to her. Also, like many people have said, your Gf clearly does not support your sobriety, and you guys should maybe talk about boundaries.", "NTA, your girlfriend was drunkenly abusing a stranger, and she expects you to back her up?!", "NTA, 100%. The fact you're a recovering alcoholic and your partner and her friends acted like that honestly shows me how much they don't respect you. The way they treated the servers shows how much they don't respect them or others like them who do that work. If your partner hasn't already apologized to you for how she treated you the night prior and just tries to brush it off, that tells me she is someone who takes no accountability for her actions. \n\nCongrats on 6 months sobriety and hopefully things will continue to go well for your recovery. But it sounds like to me that she and her friends might be a detriment to that continued process in the future of something isn't done.", "NTA. My dad was a drunk and I also have zero tolerance for drunk belligerent people. I don’t understand people that let drinking make them raging assholes but the adage “a drunk man’s words are a sober man’s truth” comes to mind. I think your GF is just a vindictive belligerent person and drinking gives her a free pass to let loose on someone. It’s not right, or fair, or justifiable. Especially as she’s in the service industry. I would end a relationship over seeing someone verbally abuse a service worker or elderly person as one day their veneer will wear off and that’s how they’ll treat or speak to me. \n\nBeyond that, it horrendous that you GF seemingly has no care for your sobriety. At 44 she should have a fuck of a lot more interests than getting blotto drunk on her birthday, not to mention the wasted cost of drinking out on the town as a *hobby*. Maybe it’s time to review your relationship and if it’s beneficial to your long term goals because if you’re subjected to a lot more of these drunken outings that continue past the point when you want to leave you’re risking sliding into drinking again to dull the pain of attending them. It truly might be time to move on. You owe it to yourself to protect your investment in yourself and your sobriety. \n\nCongratulations on your sobriety. I hope for the best things for you OP.", "Run", "NTA and your gf sounds awful and like a complete and utter AH. Good luck with your sobriety and please, drop her and get someone who actually supports you.", "NTA. When people make the choice to get drunk, they are responsible for all of the actions they take when drunk. Your girlfriend is responsible for her shitty behavior to the servers and her total lack of consideration for you and your sobriety. Is she normally like this? Are you sure she is the best relationship for you to have when you're less than a year sober?", "Congrats on 6 months sober from a random person on the internet!", "NTA\n\nYou left the drink behind, maybe it's also time to leave the drunk behind. \n\nAnd that's from a person who likes a drink or five.", "RUUUUUNNNNNNN", "You have the patience of a saint for putting up with that bullshit I would be apologizing to the server in front of the girlfriend saying she is drunk and apologizing for her behavior and telling them to cut her off if you love together you might want to think about changing that if she doesn't apologize and promise to change that behavior", "Definitely NTA. Also I'm surprised a 41 yo would still have the idea of \"it's my day\" on their birthday for Christ sake. As a 24M I stopped celebrating my birthday  since years ago cuz it's really nothing special but a day my mother suffered from labor. So the suggestion is get out of the relationship ASAP if possible, sooner the better it is for you. Based on her friend's reaction it seems like she doesn't have a decent social circle, and most people in such groups ended up as screwed up either because they are who they are or they became that way under peer pressure. Either way it's not your responsibility to fix an adult's life.", "In recovery for 15 years.... why would you do this to yourself? There are so many other women who would never put you in that position.\n\nTake care of yourself, first, please.", "NTA\n\nIt's really hard to be sober with someone you related to drunk, who is still drunk.\n\nDon't talk about it while she's drunk. There's no point.\nTell her in the light of day exactly how she behaved and that it's time to get clean.\n\nAnd if she isn't interested... it's time to pack.", "Gee such a mystery why the 44 year old woman has to date a man nearly 10 years her junior.. and even then, he finds her immature at times\n\nNTA.", "This times 1000! \nGood on you. Bad on her", "Then that will tell you a great deal about who she is, and you'll need to decide whether this is the person you want to be with. That she stood by you before you became sober doesn't excuse this sort of abusive (to the servers AND to you) behavior now. NTA.", "I'd like to suggest sitting with these thoughts as well as the ones around why you're staying in this relationship that you've mentioned, with a professional if possible. I know stigma is extra bad for men, but as someone with an eating disorder (they're actually really similar to addictions, you just can't avoid the trigger unfortunately) therapy is very helpful to deal with emotions like this and help pick out behaviors you might have missed.\n\nETA: Congrats on your sobriety! I know it can be hard, but you seem like you've got it in hand. Hoping I can follow in your footsteps at some point.", "You don't have to stay in an unhealthy situation. Life is just too short to spend with someone who treats you and other people like this.", "I salute your six months, Sir!  I just celebrated a year myself.  Here are my thoughts (if you've got a penny)...\n\nMy partner and I have been together for over seven years, living together for six.  He's not even sort of an alcoholic, but is a social drinker.  We used to drink together on the weekends, but as soon as he realized how progressed my disease was, he stopped drinking around me ENTIRELY.  This means no alcohol in the house, ever (something he did without my asking.)  He had two beers at a wedding I couldn't go to six months ago, and that's the extent of his alcohol consumption now.  Even though I never asked or expected him to stop drinking, it's what he chose.  For me.  That's what a supportive partner does.\n\nI was drinking a liter of whisky a day and was so intoxicated I would often urinate on my couch.  I've been belligerent.  I've embarrassed myself in ways I will not type here.  I have NEVER verbally abused a server, as I've been a server.  Even if that person made a mistake, I'd always be kind and tip well.  As someone who's been drunk a time or two, ask yourself, could you imagine yourself treating a server that way?  If, on the off chance you said something snarky, could you imagine doubling down when your partner tried to correct your misstep?\n\nIs someone who treats servers this way someone you want to be with?", "You did a good job.", "NTA\n\nYou took care of your belligerent drunk girlfriend as well as her friends so they could all celebrate her birthday. \n\nInstead of being grateful for what you did for them they drug you around far longer than needed and then showed their ass the worst at the last place you went to. \n\nInstead of being thankful you got everyone home ok your gf is pissed that you didn’t stand with her while she and her friend made fools of themselves. \n\nAnd all of this stuff while you are a recovering alcoholic.  That gf of yours is certainly something. \n\nPerhaps in the morning assuming you aren’t on the lease perhaps you should consider looking for another place to call your own.  Then your (ex) gf can figure out how to get herself home or even out of jail from her next drunk excursion.\n\nWish you the best OP.", "There is a lot of nope in this situation. If she respected you to any degree, she would try to accommodate the night to where she’s either not getting drunk around you or not acting completely belligerent. \n\nI can tell just from how you worded this that you’re scared to speak up to her. You should be able to speak your mind. \n\nBy the way she responded “I deserve someone who…” she already has someone in mind. Run.", "NTA\n\nI also hate sloppy drunks who become angry & want to fight when they are drunk.", "Leave her", "One of my best friends is in recovery and I would never drink around him. Your gf is not supporting your sobriety, and you are less likely to be successful in that situation. I'm not saying you necessarily need to dump her, but you do need to have some serious conversations about setting boundaries and she needs to follow through. Good luck!", "NTA.  There is no excuse for anyone, ever, to harass servers.  Good on you for not tolerating it.\n\nAdditionally, you have the mental fortitude and patience of a saint.  I’m very impressed.\n\nLastly, I find it very appalling that someone would ask someone recovering from alcoholism to be their DD while going bar hopping.  If you’re cool with it that’s awesome, but unless you volunteered it’s just…insensitive? Not sure if that’s the right word but it’s close I think.\n\nI won’t tell you what you should do, but I will say no one will ever tell me to not sleep in my own bed. Period.  Whether I’m right or wrong, it’s my bed.  If they don’t want to be next to me, they can sleep on the sofa.\n\nCongratulations on six months sober!", "God your girlfriend is a Loser.\n\nObviously you're NTA ... but now that you're sober, you might want to keep better company.\n\nYou deserve it.", "I may have missed it, but what was her response when she woke up sober?\nNTA. Like many said, there is a lot to unpack, but I think perhaps my first thought is that if you are both committed to staying in a relationship, you cannot do so without some couples therapy and individual therapy. You need to know how to navigate in a sober world and address any guilt that might be driving your decisions, she needs to work out how to interact with you now that you are sober, because that’s a different frame of reference, and you both need to work out what your relationship looks like moving forward. \nPersonally, I wouldn’t have expected a newly-sober boyfriend to take me and my friends bar hopping. Even if he didn’t have a problem with me having a couple of cocktails, it’s unfair, uncaring, and unsupportive to demand that.\nYou both should have a very honest discussion about last night, and how your outings where alcohol is involved moving forward. Congratulations on your sobriety. I hope you and your GF can find a healthy way to talk about it.", "I'M SCREAMING. NTAH!!!   I drink but loathe sloppy drunks.   And may God have mercy on your soul. Good sir.", "NTA. Gtfo of this relationship asap.", "Why would you want to be with a filthy drunk? You deserve better.", "This is a good story to keep you sober. Now you know how much of an arse you were drunk. Why you lost friends and family. You don't realize it until you the only sober one in the room how bad you where", "NTA. Today she’s abusing servers while drunk. \n\nSoon she’ll be abusing you while drunk. \n\nShe’s an arsehole. You should do better", "NTA", "Stay on the couch. Or better yet, a bed somewhere she doesn’t live. NTA", "If she was 24, maybe. But 44? And in recovery? NTA More like the saint. I don’t drink and I can’t stand being around drunk people. That entitled bravado especially. In the morning, they will know they were the problem and if they don’t? Put your ph on record next time so thru can remember too ;)", "NTA. Run away from her as fast as you can!", "NTA. I am very wary of being in a relationship or a friendship with someone that becomes abusive towards other people when they are drunk. Run away OP, and congrats on your sobriety.", "I’d be careful doing that. I did that once with an ex during a bad time when he was drunk because I couldn’t believe the change in him, and suddenly had people messaging me berating me about it and shitting on me for recording him ‘while he was vulnerable.’ If OPs girlfriend doesn’t like what she sees and tells her friends about it, could just very well lead to more anger and backlash on OPs part for just trying to help.", "Life's too short to be with someone out of obligation. Truly. You can be grateful to a person, want what's best for them, and still accept that you shouldn't have them in your life. \n\nMy partner and I have been through my drinking problem, quitting smoking, toxic careers, and we're still together because we know that we make each other better and we want to take care of each other. Even when he was picking me up from jail (not my fault, there were no charges for me, but it's a long story), he held me accountable but never demeaned me. And even at my drunkest I never went out of my way to hurt him, physically or emotionally. He says the worst of it was him worrying about me. I still have organ damage from my drinking, and when he gets short with me about my health I know it's because he's worried. \n\nI'm eight years sober now, and I still remember what it was like in the early months. You need to protect yourself. She clearly has issues she needs to work on, too, but if it comes to it, choose yourself. You're worth it and you should not stay if she will only hurt you or make you worse. \n\nCongratulations on six months! Praying for you.", "I think you should have been recording her to show what an asshole she was, might not help her future behavior but it might help you find someone better.\n\nNTA", "I think you would have much better results getting into this sort of discussion with your SO if you wait until she's sober and it's not her bday.", "When I have too much to drink I want to snuggle someone and eat salty snacks.  I tell people how much they mean to me, how lucky I am to have them in my life, how they are beautiful luminous creatures that shine with beauty.  I compliment strange women on the sharpness of their eyeliner and their shoes.  \n\nIt would never occur to me that berating someone while doing their job would be a fun thing to do, but that’s apparently who your girl is.", "I slept on it and I'm trying not to be as judgy as my first impulse was. I guess I'm coming at this as someone who had a severe drinking problem until eight years ago. I was what they call a \"high-functioning alcoholic\" and no one but my partner and immediate family knew it was a serious problem. Even at my drunkest (like blackout, I don't remember all of what I was doing), the craziest thing I apparently did was give our server my earrings and tell her to go back to college. Then I went outside to negotiate with the police because my colleague (who was as drunk as I was) had physically assaulted a parking attendant who was trying to stop her from driving because she was crawling to her car. We had been celebrating her birthday, but by this point in the early morning all our other colleagues had left. The police still ended up taking us in, but for our own safety. I woke up the next day mortified, but without an assault charge. I was really lucky, too, because our server took care of all of my work files and personal items that I'd left at the restaurant and even gave me back my earrings. (Frustratingly, that was not the last time I was very drunk, but I was sober for months after that and it still counts as the moment when I first tried to stop drinking.)\n\nAlcohol lowers inhibitions, and in all my years of studying, observing, and experiencing a drinking problem, I've come away with the feeling that excessive drinking doesn't make you an asshole. It just makes you free to show what you have on the inside. I mean, when that same colleague who attacked the parking attendant later got sued separately by her housekeeper, an Uber driver, and her ex-boyfriend for physical abuse, I was not surprised. And her later assault charges stemmed from incidents when she was completely sober. \n\nI guess my take (sorry for the looong post, I have too many feelings on this) is that when you're mean to servers, drunk or sober, that's really who you are: the kind of person who's mean to people trying to take care of you and other customers. I'm sure a lot of it is projection and deflection (OP did mention they were all also in the service industry), and maybe OP's girlfriend has a lot of other issues she needs to deal with, but I just wanted to stick my oar in to insist that you shouldn't go soft on assholery because we're drunks or it's our birthday.", "fr, my brother got ridiculously drunk the other week (i mean he’s 15 years old and had a full bottle of vodka within an hour) he couldn’t talk and spent the whole night from 11pm-1am trying to fight my dad and puking and pissing all over himself. i’ve drank before and i enjoyed it up until now, never want to get drunk again😭😭", "My partner did the same when I got sober 6 years ago. Got rid of all the alcohol in the house, did not drink in front of me until enough time had passed that I thought I’d be okay, until /I/ brought it up that I’d be okay if he had a drink. \n\nThat’s what you deserve on a partner OP", "[removed]", " NTA, you should reconsider your relationship as her alcohol consumption and her actions are not good for you to be around and for you to continue your sobriety", "There’s a reason she’s still not married at 44.. theres not a reason for everyone, but by god is there a reason here", "NTA you have gotten sober and have realized the detrimental effects of getting drunk and she has not.", "NTA. This relationship is at a point where you need to ask yourself if this is what you want for yourself in the future. Your girlfriend was out of line with her comments and owes you an apology.", "No u deserve someone better", "NTA\n\nYou need a non-alcoholic GF.", "Congratulations on your sobriety. \n\nYou're NTA. She is. Big time.", "NTA. One of the things I love about alcohol is that you can use it to find out who people really are.", "NTA. This might be unpopular but my firm opinion is that only boring people need to get wasted to have fun. There’s so many better ways to spend your time.\n\nA 44 yo getting wasted with girlfriends like she’s in college… maybe not for others, but this would be a deal breaker for me.\n\nDude you can do better than this. Is this what you want your life to be? Having to deal with a grown ass woman getting wasted and yelling at waiters? It’s just… sad and a little pathetic.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yeah, I'm curious,  too, how the story ends after waking up", "you will only continue to soar. you have just begun. you don’t owe anyone anything. look how many people are truly proud of you and want the best for you. each day brings more clarity and that will continue. choose you. always choose you. wishing you all the best on your journey and as so many of us have said - mazel tov on six months of sobriety :)", "I'm an alcoholic in recovery and I agree from a different perspective. \n\nMy SO asked me once if I was triggered when we were at a bar where people were being drunkity drunk.  I told her that no, I'm much more triggered by people having a glass or two of wine with dinner-- after all, that's the dream!  I never wanted to be a big ol' mess, I just wanted get a teeny bit warm and tipsy like a normal person (but just couldn't).", "Thank you and congrats on one year!"]}