{"id": 13523, "submission_id": "125x4nh", "title": "AITA for not buying my nanny kid a birthday present for their 1st birthday?", "selftext": "So I just lost my job over this and I’m really trying to figure out if it’s my fault.\n\nI am the nanny for a family who has a daughter that just turned one this past Sunday. Let’s call her Aspen. I work for the family full time Monday-Friday and last week there really was no mention of her birthday coming up or any plans regarding it. On Friday her mom came home with a couple of balloons and said they were having small get together over the weekend for Aspen’s birthday. She didn’t invite me, which was totally fine because I didn’t really want to spend one of my days off over there socializing with them. Everything was cool was I left on Friday, we exchanged goodbyes, and that was that.\n\nMonday arrives and I come to work and all is fine and well. That evening when I’m getting off Aspen’s mom asks if she could talk to me for a sec. She then proceeds to tell me that she was disappointed that I didn’t have a gift for Aspen on Friday or Monday. I was a bit taken aback and said that I didn’t know that was an expectation. She then said while it wasn’t an expectation she thought that me not having a gift shows that I’m not really connected with her child. I then explained to her that I’m on a pretty tight budget because of my life circumstances and I’m starting grad school in May so saving every extra penny I have is important to me. After that she said that she pays me well enough that I could have gotten her daughter something….I apologize and explained that my priority was taking care of her daughter and fostering her growth while I’m there but I didn’t think that I had to spend money on her.\n\nShe got a bit red in the face and told me that I didn’t need to bother coming back. I asked her if this was based on my overall performance or the fact that I didn’t buy Aspen a gift and she said that she was happy with my performance but that clearly I wasn’t caring or thoughtful because I didn’t get a gift. I knew she was happy with my performance based on past texts and comments but I really just wanted her to clarify because I was so shocked that she just went straight to firing me.\n\nThat was Monday and I’m still a bit pissed off about it. Aspen and her family are wealthy and privileged and live in a million dollar home in one of the most desirable neighborhoods in my city. It seems a bit ridiculous to expect your nanny to come out of pocket when you can literally give your child everything and then some. It’s not like I make 6 figures or anything. I didn’t even buy myself anything for my birthday because of bills and preparing for school.  Maybe I’m wrong though, AITA?", "created_utc": 1680115862, "permalink": "/r/AmItheAsshole/comments/125x4nh/aita_for_not_buying_my_nanny_kid_a_birthday/", "score": 309, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn’t buy the kid a nanny for a birthday present for their 1st birthday and maybe I was in the wrong because I know how important 1st birthdays are to new parents but I thought as just the nanny it wasn’t a big deal. Like I’m not family or a friend. I’m just the nanny. Maybe I could have gotten Aspen a card or something cheap but I honestly didn’t think it was necessary or expected. Maybe that makes me an asshole but it wasn’t intentional.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Shitty people are shitty and unfortunately there’s nothing you can do about it. Bummer for Aspen that she’s gonna grow up with that as a role model", "NTA. Sounds like she's entitled, rich, and spoiled. I also like how you weren't invited to festivities to foster that \"connection\" she speaks of, but you should spend your small salary on an already wealthy child to prove you are vested.", "NTA - Wow - the entitlement of that lady is beyond insane.  I hope you land a much better gig quickly and can buy yourself a nice birthday present.", "NTA\n\n>she said that she was happy with my performance but that clearly I wasn’t caring or thoughtful because I didn’t get a gift. \n\nWas any of that in writing? It sounds to me like they were demanding a kickback; I wonder if your state Department of Labor would be interested.", "I can’t believe what I just read. NTA and screw that family. You fulfilled your obligations in caring for that child. Fkn nerve of these people", "NTA. Sorry that’s a really crap thing for them to do, nothing like entitled rich people.", "Nta, you aren't required to spend your money that you get paid by the family to buy their child gifts. \nThis sounds more like an entitlement issue from the mother.", "Nta. I suggest cross posting this to r/nanny for more specific support", "NTA. You dodged a bullet. What an idiotic and out of touch woman to expect a gift like that.", "NTA she can't dictate how you spend your check and I don't think this is a fair expectation.", "NTA. If you were hired through a service let them know for any future nanny’s. If there are local social media pages for nanny’s let other nanny’s know that way.", "NTA\nRich assholes gunna rich asshole", "Just here to say, definitely NTA.  We’re not wealthy or anything, basically do okay but try to make sure our kid has a few nice things and when we do birthday parties we ask for no gifts.  I would hate for a family that struggles to feel obligated to buy my kid something when he’s got plenty.  I can’t imagine being as entitled as your ex-boss 😬🤣.", "NTA according to any normal, sane person. Rich people are different from the rest of us, and they very weird about both gifts and nanny/au pair positions, so I'm not surprised she thinks YTA.", "NTA, I’ve never expected any of my Nannie’s to buy something for my kid, and if they did I pay them back. The money you get from taking care of Aspen should be taking care of you, while you provide care for Aspen. The mom is ridiculous", "NTA your employer has main character syndrome.", "NTA but spread the word to your Nanny community! Don't let some other undeserving person be subject to their entitlement.", "NTA. You aren't a friend or relative, you are a paid employee. It's not the norm to do gifts in the workplace.\n\nSo MAYBE if the child was say 5, and asked you what you were getting them, and was old enough to understand... MAYBE then you get something very small like a trinket you know they would like. But that is only because of your connection to the child. At 1 that baby has no idea who got them what or why.\n\nThis is new parent, world revolves around my baby vanity. Then the mom felt shamed hearing your financial situation and got defensive. \n\nGet it in writing and formally you have been terminated and why so you can collect unemployment (assuming it's possible) and to establish credibility as you look for a new job. May also let husband know, as he may step in on this one... Pretty crazy stupid reason to fire a good employee. They are too hard to come by to let someone go willy nilly.", "Nta\n\nIf you work for any kind of agency, or answer to anyone, report the family. \n\nYour job is to watch the child, the end. They pay you to watch the child, the end. If any job tried to fire you for not spending your paycheck on your boss for their birthday, they'd be on the losing side of a wrongful termination suit, if you have any of what she said in writing I suggest you show her that in court.", "NTA. I’m trying to figure out what the mother’s perspective could be here. I agree that she may be too rich to be in touch, and I agree you should treat it like any other job, but I think most parents do NOT think of the people who provide their children care as any other employee. While this may not be a realistic expectation on her part, it sounds like she was communicating that she interpreted you NOT getting her child a gift as a sign you did not care for/ love her child enough. \n\nAgain, not saying you need to love the child you are paid to care for OR that not buying a gift means you don’t love her…. Just that this seems to have been the mother’s assumption and concern. \n\nI agree with the many posters who say you are better off without this employer. I agree that NOT spending your hard earned money on your job is the right thing to do. You are not in the wrong here. \n\nYou did indicate that you wanted to understand what happened here, and I think what happened is mom interpreted you not getting her child a gift as you not loving the child. To her this is not any job, or any child, this is her precious child and if you aren’t so head over heels in love with the child that you don’t sacrifice your hard earned cash to get her a gift, then you must not love her enough. If you don’t love her enough to buy a gift, how can you love her enough to take proper care of her ? And be entrusted with her care?\nI think is the logic pattern mom is using, for what it’s worth.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I just lost my job over this and I’m really trying to figure out if it’s my fault.\n\nI am the nanny for a family who has a daughter that just turned one this past Sunday. Let’s call her Aspen. I work for the family full time Monday-Friday and last week there really was no mention of her birthday coming up or any plans regarding it. On Friday her mom came home with a couple of balloons and said they were having small get together over the weekend for Aspen’s birthday. She didn’t invite me, which was totally fine because I didn’t really want to spend one of my days off over there socializing with them. Everything was cool was I left on Friday, we exchanged goodbyes, and that was that.\n\nMonday arrives and I come to work and all is fine and well. That evening when I’m getting off Aspen’s mom asks if she could talk to me for a sec. She then proceeds to tell me that she was disappointed that I didn’t have a gift for Aspen on Friday or Monday. I was a bit taken aback and said that I didn’t know that was an expectation. She then said while it wasn’t an expectation she thought that me not having a gift shows that I’m not really connected with her child. I then explained to her that I’m on a pretty tight budget because of my life circumstances and I’m starting grad school in May so saving every extra penny I have is important to me. After that she said that she pays me well enough that I could have gotten her daughter something….I apologize and explained that my priority was taking care of her daughter and fostering her growth while I’m there but I didn’t think that I had to spend money on her.\n\nShe got a bit red in the face and told me that I didn’t need to bother coming back. I asked her if this was based on my overall performance or the fact that I didn’t buy Aspen a gift and she said that she was happy with my performance but that clearly I wasn’t caring or thoughtful because I didn’t get a gift. I knew she was happy with my performance based on past texts and comments but I really just wanted her to clarify because I was so shocked that she just went straight to firing me.\n\nThat was Monday and I’m still a bit pissed off about it. Aspen and her family are wealthy and privileged and live in a million dollar home in one of the most desirable neighborhoods in my city. It seems a bit ridiculous to expect your nanny to come out of pocket when you can literally give your child everything and then some. It’s not like I make 6 figures or anything. I didn’t even buy myself anything for my birthday because of bills and preparing for school.  Maybe I’m wrong though, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. This beyond out of bounds on Mom's behalf. Moms behavior towards you is toxic.  I would never expect anyone watching my kids to gift them items purchased on their birthday! Saying happy birthday, singing it, asking them about their birthday - you hope someone would say that to anyone who's around someone who had ab birthday and THAT would be it. I never wanted my kids to expect gifts from people either! WOW. I know this sucks, but you did nothing wrong at all. Good luck to you.", "NTA\n\nYou sound like you were a good worker. You also kept the lines of professionalism in check by not buying your employers daughter a gift. Blurring the lines between business and your personal life should always be avoided.", "NTA\n\nA 1 year old doesn't care about gifts anyway.\n\n  Even if it was an older child that would care, the parents frankly should have\n\n1. Given you a heads up of what their expectations were and \n2. Given you an extra spending allowance specifically to buy the child a gift.  That way the nanny isn't out of pocket any actual money and the child receives a gift that they believe fully came from their nanny.", "NTA\n\nYou are absolutely right that your obligation is not to buy her a gift but look after her well-being. That is all that should matter. This mother is a psycho, I am glad you're away from this family now.", "NTA \n\nYou're doing a JOB. Your boss admitted that getting a gift wasn't an expectation. Treat this like any other job and if performance expectations aren't communicated, guess whose fault it is?\n\nYou're better off, quite honestly.", "NTA. I’m actually a little shocked that the mom expected you to. And then said it wasn’t an expectation, but proceeded to fire you for not meeting a non-expectation?  That’s bullshit.", "NTA", "NTA but that mother is ridiculous!", "NTA   She sucks.  Go file for unemployment.", "NTA\n\nPeople like your former employer can suck it.", "Thats totally illegal, I'd get a lawyer and take her to court for unfair dismissal. Thats some psycho-level entitlement. NTA", "How dare you not spend your money on your job! NTA", "NTA, the kid is 1yo, it's not like she'd even understand or remember.", "NTA.... Did this family happen to buy you a present for your birthday??  I mean if they expect this super close relationship...", "Another NTA here.\n\nYou are providing care and supervision, which is important to a 1 year old baby.\n\nMaterial gifts are totally unimportant to anyone, besides obviously the materialistic mother.", "NTA. What are they going to do next? Have a go at Aspen’s kindergarten teacher for not getting their princess a gift on her birthday?", "Nta", "NTA. She is ridiculous and I would spread your experience around in the nanny circles so potential replacements know what they’re getting into. Post it on all the boards.", "NTA. I don’t have enough time in the day to list how utterly wrong she is and how effed up she sounds. You probably dodged a massive bullet to be honest. It would have only gotten worse.", "That shitty person is going to be regretting letting a good nanny go when she discovers she can't find a replacement that does as good a job, is as reliable, and takes their actual duties seriously. NTA", "This reminds me of* a barrage of emails I (along with everyone else who worked at the hospital) got pressuring me to buy something off the registry for one of the hospital's surgeon's baby shower. The man was old enough to be my grandfather and had the money to have the baby via surrogate because his wife was postmenopausal and couldn't carry. Most of the items cost more than I made in a month and the emails went on for *months* 🥴", "Great point!", "Thank you! I hope so too!", "It was all in person during our conversation. I will contact her and ask for my termination in writing…I don’t know if she will put that in writing but guess it’s worth a try!", "That’s a good thought! Op should text her and try and get it in writing.", "Exactly why I’m trying to better myself and get out of these types of situations all together! Hopefully once grad school is over I can move on to work where I’m respected and valued.", "The husband was in the same room and didn’t say or do anything. He looked a bit embarrassed but other than that I assume he was ok with it or wasn’t trying to get in the middle of it. I should be eligible for unemployment because I’m paid through a payroll service but I think the state I live in (at will state) might play a role in whether I get it or not. I’ll have to look into it!", "It sucks but I think a lot of parents have that attitude that a nanny isn’t an “employee” but a member of the family. It’s almost always one sided. I have to come at my schedule time or face consequences, I have to fulfill my duties or face consequences, I’m at the mercy of their schedule, have to ask for a day off if I need it, etc. All of that very well makes me an employee. The fact that she was able to fire me, just like that, makes me just an employee. I don't know if you can have it both ways. I appreciate your input!", "I could understand the mom's perspective *slightly* more if she'd invited OP to the birthday party... but she didn't even invite her and still expected her to bring a gift. Bizarre.", "Depending on where you live, you may be considered employees and entitled to compensation for termination (parts of Canada)", "Im in an at will state, that just means either party can terminate at any time unless for an illegal reason.\n\nYou might want to see if there's a legal clinic to consult with or talk to an employment attorney.\n\nYou have a limited time to apply for unemployment benefits, my state had a waiting week.", "I think you hit the nail on the head here. The employee/family member view point. The employer wants you to love and sacrifice like you are a family member, but that is not returned, and you are held to employee standards. They can’t have it both ways!\nAnd the economic impact of the sudden decision to severe is awful. \nAgain, I’m sorry.", "NTA you are not obligated to spend the money she pays you buying presents for your charge\n\nHowever I worked as a nanny and actively celebrated my charges birthdays. I still buy them gifts and they are adults 😂\n\nWhen you have a nanny you are leaving the most precious thing in your entire world in their care, if that person doesn't care enough to even celebrate your child's birthday in anyway it starts to make you think about how much they care about that child. I don't think mom was looking for a new play structure, but wanted confirmation you loved their child. A $5 book would have been thoughtful and sufficient.\n\nAgain you aren't required to, but I honestly can't understand spending all day every day with a child and not wanting to give them something to celebrate their birthday.", "NTA for not getting a gift, but everyone I know that watches children would at least give a birthday card writing some sentimental words in it. The mom overreacted and thinks you don’t care about her child.", "How could you be wrong? This piece of the self-righteous elite expects you to shell out money for her daughter? You not only have to serve as a surrogate mother as a nanny, but also have to give up some of the money you work for to appease the rage of this harpy?\n\nGood grief!\n\nNTA.", "NTA Her daughter doesn’t need a gift, you weren’t even invited to the party.", "NTA - I would suggest talking to your local labor law office and see if you have grounds for wrongful termination", "NTA. If the parents have so much money, they could have given you x amount to choose a gift with. That way, the thought comes from you, but you aren't spending money on your job.", "Wow. Sooooooo much NTA. Your boss is a piece of work, though!!!!\n\n\nI'd spread the word through the nanny community.", "NTA for not buying her a gift, but YTA for how you responded when she asked why you didn't. Tbh, it was kind of a wise ass response that was grounds for you getting fired.", "NTA. \n\nIf you read between the lines, though, you might be able to see that the mom is worried that you don't love or care about her daughter. Perhaps she is feeling insecure about relying too much on someone else to raise her kid, perhaps she is just entitled and crazy. Either way, she is TA to think that gift-giving is the only way to show affection, to expect someone who is living on a tight budget to give her daughter a gift when she can afford to give her whatever she needs (or wants), and to fire you over this.", "Nta, did Aspen's mom buy you a gift from Aspen on your birthday.", "Don’t birthday gifts fall under the same umbrella as wedding gifts?  If you aren’t close enough to be invited to attend the celebration, you’re under no obligation to send a gift?  And a gift is exactly that - a gift.  A birthday isn’t cause to send invoices to everyone you know, especially your staff.  \n\nNTA.", "NTA\n\nThis is your job. While you may grow attached to the children you nanny, you should NEVER be expected to actually treat them like they are your family. You should never be expected to spend your own free money on them. \n\nMy mom ran a small home daycare. She NEVER bought her daycare kids a birthday present that I can remember. She’d sing them happy birthday and I think make their favourite food and do some birthday crafts, maybe even a small cake if they were goin f to be at our house for supper, but never a present. That’s ridiculous.", "I would hope that she could see the love and care based on what I do every day and how her daughter lights up when I come in the morning but idk maybe a material thing is more of her language.", "No. I didn't receive a gift from any of them on my birthday. Didn’t even get the day off lol", "Parent is also remarkably unloving to excommunicate a good nanny that their child has undoubtedly bonded with", "Especially because the baby is ONE! so the baby wouldn't even know they got or didn't get a gift. Maybe the bonding would be relevant if the kid was like, 7.", "Very good point on no party invite…", "Sounds like she did you a favor. It's pretty ironic that she claims the person who spends the most time w her child wasn't \"connecting\" w her. Definitely save texts and communication regarding performance.", "NTA. A one year old doesn’t even know what a birthday present is. If you had bought her a gift, the mom probably would have found a way to criticize you for buying the wrong thing. You can’t win with entitled people.", "NTA. She wanted you to buy a present, she should have paid you more.", "Wow, hard NTA. As the mother of a two-year-old who is seriously grateful to have a wonderful babysitter for my son, I can't get over this woman's entitlement. Giving your hard-earned money back to your employer is not expected, and I can't believe she terminated you over something like that. Not to mention that she didn't even tell you it was Aspen's birthday until Friday, so how could you have possibly had a gift for her then? Maybe I am biased because we have the opposite problem - - my son's babysitter spends more money on gifts for him than I am honestly comfortable with.", "NTA - you're paid to take care of the kid, not to give your money back to your employer. If the parents wanted you to get one they should give you a budget for doing so. \n\nAlso a 1 year old, had no concept of what is going on. This is way more about the mother than you.", "So presents are more important than performance? Who cares how you treat my kid as long as you buy her a gift. Hope her next nanny sucks", "Just wow! I’d mail a bag of shit next year to the mom", "Sometimes I'm truly astounded by the ridiculous entitlement of people. Sorry that happened to you, and definitely NTA.", "What state are you in? If you want, DM me. I would not be surprised if your employer violated some wage and hour laws.", "Wow. My cleaning lady bought me a bouquet of flowers when my youngest was born and I felt so guilty that she wasted her money on me.\n\nNTA", "NTA and what an awful woman!", "NTA", "NTA this is so incredibly entitled of them im sorry you were put in this position", "NTA....\nIf she tries valling you back, make sure you ask for double salary.", "NTA. She sounds nuts.", "[removed]", "Yo that’s illegal. It’s literally extortion. NTA and if it was official work get a lawyer.", "NTA. I was a nanny to twin girls. But they treated me like family. They got me gifts for Christmas and my birthday and I got the girls gifts. But it's ridiculous and entitled of this lady. It shouldn't be an issue..it's crap.. hopefully you can get unemployment", "Lol let them enjoy searching for another nanny nta", "Nta. You met a helicopter mom in the making.", "Nta.  A boss should never demand an employee buy their kid a gift, especially when the employee isn’t invited to the party.", "millionaire beggars are just a different breed. wow", "NTA daycares teachers don’t give kids birthday gifts because it’s unprofessional. You were just keeping it professional.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "That is incredibly inappropriate, and I wish you had asked a question about it when it was going on, because someone would have directed you to the Ask a Manager site where she says, very clearly, that giftgiving goes down, not up, at the office.", "As the poster uses American English (neighborhood, not neighborhood), I believe they are in the US.\n\nUnfortunately, in every state but one, employees can be terminated for any reason except discrimination or whistleblowing.", "That is two neighborhoods my man"]}