{"id": 13534, "submission_id": "1262sg9", "title": "AITA for going off on my parents after they invited my brother's ex boyfriend to his birthday dinner?", "selftext": "My (24M) younger brother  \"Carver\"  has always had kind of an odd relationship with our parents.  We're from the country and growing up our parents were real big on traditional roles and all us boys being strong men. We of course all played sports and hunted etc.. Carver is gay and has been out since the 7th grade and we all accepted it even our parents though it was still expected of him to be traditionally masculine and our parents didn't really Ike the boys he dated unless they were the same.\n\nSo  that's who he mainly dated in highschool including one of his teammates \"Tyler\" (20M) who my parents love/d who turned out to be an abusive pos. They broke up after graduating highschool after I got  Tyler to \"leave him alone\". Carver met this new guy \"Carlos\" (19M) at school and my parents hate him because he's way more \"fancy\" to their liking with his painted nails and wearing girls clothes sometimes.  They pretty much openly dislike him.\n\nCarver was home  with Carlos over the weekend for his birthday and we decided to throw him a party. Our parents invited some of Carvers old teammates/friends over which for some reason included Tyler..  I could see Carver tensing up when he saw him and he just kinda played it off not wanting to make a scene infront of our younger brothers who like Tyler.( they dont know why he broke up with Tyler) My parents were all friendly with him too while openly disparaging Carlos. Carver and Carlos left as soon as the party was over.  Later I pulled my parents asided and asked them what the hell that was about.\n\nThey said they were just trying to shoe Carver a good guy he could date. I reminded them why they broke up and they just it was \"boys being boys\" and it wasn't that serious because Tyler's a good kid.  I yelled at them that tha was f'ing crazy and to not pull something like that again. They got pissed and said I had no right to talk to them like that and now I've been getting calls from extended family about how they couldn't believe I went off like that on them. AITA?", "created_utc": 1680128692, "permalink": "/r/AmItheAsshole/comments/1262sg9/aita_for_going_off_on_my_parents_after_they/", "score": 86, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Screaming at my parents. Not handling that conversation better.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou are never the AH for defending someone you love.  Particularly when it feels like they are being deliberately harmed.  Honestly, maybe you both should consider going low contact with your parents for a while.", "Absolutely NTA It is extremely sad for your brother that his parents care more about him being with a masculine man than being safe.", "NTA, also it’s really shitty to have “strings” attached so to speak for their acceptance. Like you either accept him or not saying they dislike him because he doesn’t conform to typical gender norms is not acceptance", "Of course NTA, your parents sure as hell are assholes though. You did the right thing by calling them out. Even without the details of your brother being gay, your family's views on it, and their \"reasoning\" they are still the assholes.\n\nI can't imagine any scenario where it would be okay to go behind your child's back and invite their ex over for dinner. The added details you provided make the situation even worse.", "\"Boys being boys\" is the rhetoric that's enables a system that sweeps domestic abuse under the rug. Just because the genders aren't MF doesn't mean it's any less problematic. Good for you for calling it out, your parents need a wake-up call, and I'm sure your brother is grateful that you've got good back. And, obviously NTA.", "NTA\n\nIt is unbelievable to me your parents would prefer someone who was physically abusive and invite him to your brother's party. You need to tell your younger brothers how Tyler treated your brother, he may end up trying to abuse one of them too.", "Nta- and great job standing up for your brother.  Your parents want to control over him and they place as his parents. Good on you to have your brothers back and saying something otherwise this will become an issue in the future if they continue this behavior.", "It sounds like your parents are abusive and transphobic/homophobic. You should go no contact immediately and take your brothers with you. Bigots don't deserve a family.", "NTA, I guess to your parents, domestic violence is just \"boys being boys\". Good to know for all their kids' future partners.", "“Dear extended family, if you think my brother Carver should have remained in an abusive relationship rather than be with someone who respects him and makes him happy, then I have nothing more to say to you, because I love my brother and want the best for him.”\n\nAaaaand NC.\n\nNTA. Well done for standing up for your bro. :)", "No, youre NTA. Carver is lucky to have you as a brother", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (24M) younger brother  \"Carver\"  has always had kind of an odd relationship with our parents.  We're from the country and growing up our parents were real big on traditional roles and all us boys being strong men. We of course all played sports and hunted etc.. Carver is gay and has been out since the 7th grade and we all accepted it even our parents though it was still expected of him to be traditionally masculine and our parents didn't really Ike the boys he dated unless they were the same.\n\nSo  that's who he mainly dated in highschool including one of his teammates \"Tyler\" (20M) who my parents love/d who turned out to be an abusive pos. They broke up after graduating highschool after I got  Tyler to \"leave him alone\". Carver met this new guy \"Carlos\" (19M) at school and my parents hate him because he's way more \"fancy\" to their liking with his painted nails and wearing girls clothes sometimes.  They pretty much openly dislike him.\n\nCarver was home  with Carlos over the weekend for his birthday and we decided to throw him a party. Our parents invited some of Carvers old teammates/friends over which for some reason included Tyler..  I could see Carver tensing up when he saw him and he just kinda played it off not wanting to make a scene infront of our younger brothers who like Tyler.( they dont know why he broke up with Tyler) My parents were all friendly with him too while openly disparaging Carlos. Carver and Carlos left as soon as the party was over.  Later I pulled my parents asided and asked them what the hell that was about.\n\nThey said they were just trying to shoe Carver a good guy he could date. I reminded them why they broke up and they just it was \"boys being boys\" and it wasn't that serious because Tyler's a good kid.  I yelled at them that tha was f'ing crazy and to not pull something like that again. They got pissed and said I had no right to talk to them like that and now I've been getting calls from extended family about how they couldn't believe I went off like that on them. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA at all!  I feel sorry for Carver and Carlos. Your parents should not expect to be seeing them again anytime soon. Or maybe you either.", "NTA. You absolutely did the right thing here OP. Bad enough they are still hung up on his ex but to invite your brother abusive ex because they dislike his current bf is beyond the pale. \n\nOdds are good they will do this again in the future so please let your brother know their bullshit reasoning if you haven't already and that you will have his back for whatever he chooses to do going forward. \n\nAlso if you wanna go full on protective older brother, by all means do so", "NTA and good on you for standing up for your brother, I'm sorry that he's had to experience that. \n\nI think this begs the question though, if Carver was a girl, would your parents still feel justified in inviting the abusive ex-boyfriend? If the answer to that would be no, then your parents are really doing your brother a disservice with their \"men can't be abused\" mentality. If the answer to that would be yes, then your parents have a whole other issue for prioritising the abuser over the safety of their own child.", "Why is this even on here. You obviously are not an asshole.", "NTA. What kind of parents try to get their kid to date an abuser? Jeez!", "NTA Continue standing up for your brother.", "NTA. You're a good brother.", "I mean for the most part he is just generally traditionally masculine other then the odd nail painting and feels comfortable that way from what he's told me ,but yeah I hear ya", "Guessing they are of the school of thought (aka vile sexism meets barely restrained homophobia) that men can’t be victims of domestic abuse. Strangely enough the same kind of people often brush off women victims as having done something to deserve it. \n\nNTA at all for standing up for your brother", "well Carver and another brother are both in school and pur younger brothers are 15 and 13 so I couldn't just take them", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "There are resources available for people who have lived through the trauma you've lived through, its not safe leaving kids with bigots like that"]}