{"id": 13559, "submission_id": "126e7gl", "title": "AITA for keeping my girlfriend up, because she locked me out of our shared bedroom?", "selftext": "I (m 30) perpetually have trouble sleeping and sometimes will need to or get up from the bed and try sleeping in a different bedroom or spend some time on the couch. My girlfriend (30 f) is a light sleeper so this can cause problems when I enter and exit the room. I try as best I can to be quiet when I enter and exit, but sometimes I can be clumsy or not light on my feet, causing her to wake up. Even when I do nothing other than enter, and go directly to my side of the bed. Usually I sleep in my office to avoid coming in and out of the bedroom, which wakes her up. We have two spare bedrooms, so sleeping arrangements generally aren’t the problem.\n\nLast night I felt like I was actually going to be able to sleep, and I decided I wanted to sleep with her. She had work the next morning. After about 10 minutes of laying beside her, I felt like I was too hungry to sleep, so I wen’t to kitchen to make some food. I accidentally banged a pot and cupboard, which caused her to yell at me, after which I heard her lock the door of our shared bedroom. We had designated one of each of the spare bedrooms to either of us and the master bedroom is ours both to share.\n\nI pay both our rent and I felt like her taking control of the shared bedroom was unfair and disrespectful. I demanded she let me in to our shared bedroom, and she responded that I should sleep somewhere else, because, I won’t be able to sleep, which will result in her not being able to sleep. I didn’t feel that locking me out of our shared bedroom was either respectful or ‘fair’ - because she could just as easily use a spare room if she has trouble sleeping. Eventually, after pounding the door, she let me in, where after I slept and she went to the other room.\n\nShe is extremely angry at me (it is now the following day) and insists that I’m wrong in asserting that locking me out of our shared bedroom is ‘no bueno’, and knocking on the door until she let me in. AITA?", "created_utc": 1680157783, "permalink": "/r/AmItheAsshole/comments/126e7gl/aita_for_keeping_my_girlfriend_up_because_she/", "score": 1173, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I kept her from sleeping and pounded loudly on our bedroom door until she let me in.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "How are you 30 years old and think it's fine to knowingly wake your partner up multiple times a night because you 'decided you want to sleep with her'?\n\nDude, she's not a pillow. She's a person who needs sleep and you are being malicious and a bad partner.\n\nYTA", "YTA. Also was this post written by my cat?", "YTA.\n\nYou have separate bedrooms because this has been a problem before.\n\nYOU thought you could make it through the night. YOU chose to sleep in her bed. YOU were wrong and didn't make it. YOU then woke her up.\n\nSHE tried to fix the problem and locked the door so you'd go back to your bed, cause she wants to sleep through the night like she expected.\n\nYOU then got mad... because???", "YTA. You wanted to sleep with her but within minutes you were back up again looking for a snack. I don't blame her for feeling like it's impossible to get a good night's sleep. You need to be the one who sleeps in the other room, or you need to practice actually going to bed when you go to the bedroom. Try a melatonin or thc or just don't be a nuisance.", "YTA. If I was her, I would move out just to get some rest. You sound like a nightmare.", "YTA\n\nYeah you’re the asshole OP.\n\nYour sleep problems result in causing HER sleep problems. \n\nWorse than that - you admit you’re loud when you get up and move around!!! And you know she’s a light sleeper. She can’t help being a light sleeper anymore than you can help having trouble falling asleep. But you absolutely can control how much noise you make.\n\nYou woke her up. Again. Abruptly and loudly.  It understandably upset her because you AGAIN interrupted her sleep… for a fucking snack. \n\nShe needed sleep for work and didn’t want to deal with you. So she locked the door. She should NOT have to relocate to get a quiet sleep when YOU are the one who caused an interruption. \n\nBut nope - you decided to throw a temper tantrum and make a power play…. By even MORE intentionally harassing her to prevent her from sleeping. Because you feel you have more of a right to sleep where you want than she does. \n\nOnce someone has gone to bed that is where they get to stay the night UNLESS they are the one who woke up and was interrupting sleep. That was not your girlfriend. That was YOU. She should have been left alone to try and recover from the interrupted sleep that YOU caused. \n\nBut no. You’re too much of an asshole who feels he pulls rank on bedroom access. \n\nYou’re an ass Op.", "You are a giant A-hole. How dare you assert your dominance just because you pay rent. You have sleep issues. So you should be inconvenienced not her. She deserves to be able to sleep in peace.", "YTA \nShe was angry you woke her, so locked you out. Which is fair. You said she's a light sleeper so knew her waking up was a huge possibility when you went into the bed she was sleeping in then got out of it ten minutes later. \nThat's enough to make anyone pissed. Especially when they have to get up for work in the morning. You're lucky she didn't lock you of the house for being so disrespectful.", "This post is a whole lot of I I I I I. I wanted, I felt, I demanded. YTA.", "YTA. It's not your fault that you accidentally banged a pot, but everything else is on you. Maybe it wasn't great that she locked you out, but it sounds like you were just going to keep coming and going, so I don't really blame her.", "YTA.\n\nShe has every right to be mad at you and lock you out as this is a REPEAT problem.\n\nEither suck it up, learn to be bored/uncomfortable and don't move from the bed, or sleep somewhere else from the beginning and never enter the room. You're an inconsiderate asshole and rapidly on your way to being an ex.", "What is your daily routine like, if you're going to bed and only then realising you are hungry? So hungry you can't sleep?\n\nYou are the one disrupting sleep for people, it doesn't matter if its a shared space, at night it's used for sleep and if you keep coming and going at a moments notice, you're at fault. YTA\n\nGet a better routine. Eat more, at set times. Turn off your phone before you start winding down for bed. If you get the urge to get up and start activites, it's totally possible to ignore those urges and stick to your goal of falling asleep instead.", "YTA..\n\nShe should not have locked you outside but I get her.. I hate my sleep being interrupted cuz I end up getting headache when not enough sleep..\n\nYou knew she was a light sleeper and took a chance to sleep by her side.. it didn't work.. normal human would have then just went and slept on the couch or since you have an alternative bed ..  go there.. you kept banging on the door cuz you need what company to stay awake??\n\nThat was being childish..", "YTA. Really, had to get food only 10 minutes after deciding to go to bed? Then you banged on the door to wake her while she was trying to sleep?", ">I pay both our rent and I felt like her taking control of the shared bedroom was unfair and disrespectful.\n\nKeeping your partner awake and causing her to lose sleep is unfair and disrespectful.\n\nYou thinking that she has to suffer your never-ending nonsense is unfair and disrespectful\n\n&#x200B;\n\n>she could just as easily use a spare room if she has trouble sleeping\n\n**SHE DOESN'T HAVE TROUBLE SLEEPING - YOU DO !!!!**\n\nYTA", "Yta \"I wake my gf up multiple times a night, multiple nights a week bc I treat her as a sleep aide, why is she mad???????\".\n\nAccept that you need seperate bedrooms and stop f-cking waking her up!", "Dude. YTA. Go to a doctor if you have so many sleep issues.", "YTA\n\nTry to be more considerate. Don‘t sleep in the shared room if you keep waking her. Many people use a shares room for sex only and one partner has to sleep somewhere else because of reasons like your bad sleeping habits or bad snoring. LET HER SLEEP. \n\nYou‘ll see that if you continue to tire her down like this she will first leave the shared room and move into her room completely and eventually move out. \n\nDon‘t be petty because „you pay the rent“. She needs to sleep to work.", "YTA I can just tell you don’t spend a lot of time thinking about how your actions affect other people. You sound insufferable.", "YTA\n\nEveryone else has said why, so I won’t bother to elaborate. \n\nBut I am curious, are you the brother of the woman who repeatedly barges in on her partner’s bath time to sit on the toilet next to his head and take a dump? Because it feels like your were both raised by the same people.", "YTA in every single paragraph of this. But mostly for your complete hypocrisy in using the word “disrespectful.”", "YTA\n\nYou have another space to sleep in case you have trouble sleeping, yet you decided to take offense to being locked out, so you demanded the shared space to yourself knowing it was going to make her leave despite her having done nothing wrong.\n\nCongrats on “winning the battle.” Calm your sense of ownership and use your spare space for what you set it up for.\n\nPS - how do you go to bed only to realize within 10 minutes you’re too hungry to sleep? You sound like you’re 4 years old.", "YTA. If you can sleep on the sofa or in another bedroom then you should. Let her sleep through the night without disturbing her.", "YTA. Sleep divorce (sleeping in different rooms) is a good thing and I think in this case might be good to utilize. You have the means (as you mention there is another bedroom you can use). \n\nAlso please look into why you're so unrest when you try to sleep, as this is disordered sleeping and avoid eating when you're trying to fall asleep. It makes you stay awake longer.\n\nBecause of your sleeping issues, she doesn't deserve to suffer from them, as this most likely will lead to the relationship otherwise ending. Get it checked out and sleep in a different room and don't disturb her anymore.", "YTA in every single paragraph of this. But mostly for your complete hypocrisy in using the word “disrespectful.”", "Too hungry to sleep in the night? Are you a child? YTA let the poor girl sleep and maybe grow up a bit", "YTA. And i'm glad you wrote your age, because otherwise i would have thought it must be a toddlers POV.", "YTA you need to find a way to sleep that doesn’t disturb her rest. If you want to switch between couch and the second bedroom, fine, but you don’t have a consistent enough pattern of sleep to justify going to the bedroom she sleeps in at this stage - it’s like you are almost sure that you’ll be getting up again and waking her up, but instead of protecting her are shrugging it off cuz it’s more convenient to you", "YTA - I feel like you need to take more responsibility here. You're the one with the sleeping problem, so YOU do something about it. Sleep elsewhere, or don't keep getting up in the night. Make sure you've had enough to eat during the day.\n\nYou sound like really hard work. I'm exhausted just reading the post.", "YTA, how immature can a person be? You are aware of how your issues effect her sleep and you still think it’s okay to ignore her well-being? Just because you have no interest in figuring out your own sleeping problems. On top of not finding help for it you’re making it her problem.", "YTA.   \nYou need to practise something called a routine. You wouldn't have got hungry if you just ate the right amount of food at appropriate times, i.e not in the middle of the night. When you go to bed you should go to bed not get in and out constantly throughout the night. Instead of just going to sleep in the spare bedroom and having an adult conversation about it the next day you decided to POUND on the door, that's just aggressive and childish. Your lack of routine is almost definitely a factor in your sleep issues and now you're causing your partner to have sleep issues.   \nMaybe her reaction to lock the door was a little childish too but it sounds like she's at the end of her tether and this happens regularly. As a light sleeper myself I understand her frustration.", "YTA\n\nYou're pretty much torturing her, you know that right. Sleep depravation is a thing you know, as that's what you're doing. You make it so she can't sleep. You're making you issue of not sleeping her problem.\n\nAre you happy now, now that you got your way and was got back into the room, are you now happy. You want to right, so it must make you happy to know you've pissed off and tortured your GF, right?\n\nYou wanted to stay up so it shouldn't have bothered you to go to another room.\n\nYou're an ass and need to get over the need to be \"right\" and grow up.", "Doesn’t seem from your phrasing regarding the rent that you view her as an equal person in the relationship.", "YTA. My partner is a big clumsy dude who often has trouble sleeping. He tries extremely hard not to wake me up and gets upset with himself when he does. He doesn’t feel entitled to come back to our shared room and would never try to force his way back in if I ever got annoyed with him to the point of locking him out (which hasn’t ever happened and probably never will). He’d probably apologize profusely and go sleep in the spare room or on the couch without a fight. \n\nYour actions are immature and selfish. The fact that you pay rent and she doesn’t is irrelevant. She needs sleep just as much as you do, and frankly I’d be surprised if she sticks around much longer with the way you treat her.", "YTA. Why should she have to go to another room when you're the one with the problem? Why can't you figure out how to be quiet after 30 YEARS? Why do you think that you're the only one who matters? I would have locked you out of the *house* if I kept pulling that shit on me.", "YTA - you already had a separate bedroom you could’ve gone to. Knowing she’s a light sleeper, it would’ve been the loving thing to do to go there. Also, I could imagine after eating you’d probably get up a few more times to…I dunno…pee, maybe you forget to brush your teeth so you get up again. Honestly it could be so many reasons to get up. And since she went to bed first, then it would have been the kinder thing to use your spare bed. Also, paying rent has nothing to do with this issue, especially since you have solutions to resolve it (like spare bedrooms).", "YTA if you have a problem sleeping the man go sleep  in another room don’t disturb her more.", "YTA - this is highly inconsiderate.", "YTA, I get woken up multiple times by my cat because she wants feeding at 3am and will not leave me alone until I feed her. It's a nightmare! I get broken sleep every day because she will only ever wake me up and not my husband. I can't shut her out because I live in a static and she can open the doors. The difference between you and my cat? She's a cat! She doesn't realise what she's doing or how it affects  me. You do. It's written all there in your post. You know what you're doing, but apparently you and your feelings are more important than hers.", "YTA. You should take some anger management courses. That’s ridiculous dude.", "YTA and also YTOWNTSAD (you the one who needs to see a doctor). Insomnia is real and it’s treatable. Please go see someone and figure out what is going on. This could be a health issue or a mental health issue.\n\nKeeping your gf up and ruining your relationship because you refuse to get help is not okay.", "YTA in every single paragraph of this. But mostly for your complete hypocrisy in using the word “disrespectful.”", "As a light sleeper myself, YTA. \n\nWho gets up 10 minutes after going to bed and starts making food? You then have an argument with her because she didn't want you to come back and disturb her again. \n\nPeople underestimate how difficult it is for a light sleeper to get a restful night. It's hard to get to sleep. It's hard to stay asleep. Just because you decide you want to sleep with her, doesn't give you license to disturb her multiple times.", "YTA\n\n\nYou sound restless and that may be part of your sleeping problem. You need a routine. Getting into bed and up after 10 min? Also, eating something that actually requires cooking when you wanted to sleep? \n\n\nI do not doubt you have sleeping problems. But I do doubt that you are handeling them very well. A sheduele is one of the nost important things", "YTA.", "YTA. You wanted to sleep with her so if she went to a different room you'd likely follow. I'd be looking at your diet as to why you have trouble sleeping.\nCut out all processed foods (and that means no sweets, cakes, bought sandwiches, booze, ready meals, jars of cooking sauce, anything else with a long list of ingredients etc) and avoid caffeine after 6pm.", "ESH. She shouldn’t have locked the door, although constantly being woken up by a noisy partner sucks. \n\nYou should have just went and slept in one of the other rooms instead of being petty and banging on the door. \n\nOverall you guys need to have a calm but serious conversation about how you can fix this sleeping issue going forward.", "ESH \nBecause you knew better than to make noise in the kitchen lol. But really, accidents happen. Still, you could’ve let it go instead of banging the door. Locking the door and carrying the anger is on her. She could’ve left it at “sleep in the other room” or gone to the spare room herself. That was mean.", "ESH\n\nIt’s not your fault you have trouble sleeping. But the two of you need to learn to communicate together like mature adults. The whole interaction was immature on both ends and there was no one actually trying to get control over a tense situation, you were both just trying to ‘win’. \n\nA functional relationship is BUILT on proper communication.", "ESH. That seems totally inappropriate that she locked the door. It’s mean and carelessly escalates the situation. So if she wants you to sleep in another room she should use her words to discuss that with you. \n\nAt the same time, regardless of who pays, I do think that if you live together you need to treat each other as equals. If you’re the one with sleeping issues, you need to opt into the alternate bed and take responsibility.", "INFO is she's working why do you pay all of the rent?", "ESH. You *both* have backup sleeping arrangements so it's not like you had nowhere to sleep. You could have brought it up the next day, after tempers had cooled. She didn't do the right thing in shutting you out, and if you're going to cohabit, with any couple it really falls on the lighter sleeper to learn that they aren't sleeping alone anymore, and to harden up. The most you can do is be as quiet as you can be, and it sounds like you're usually trying that. However, you didn't need to \"pound on the door\" and keep her up when she had work the following morning. It also doesn't help that you feel the need to bring up you pay all the rent, because it sounds like you're using your financial position to impose your rights. When you're sharing a life, it doesn't matter who's taking what financial burden, you're both supposed to do it for the love of each other, and money shouldn't be used as leverage in any argument.", "ESH - you shouldn't have pounded the door & forced yourself back in", "ESH. Your reaction was completely wrong and you should either go to a doctor, more carefully monitor your needs before bed, or just permanently sleep in another room so you can stop disturbing her. However it is also an AH move to get up and lock the door on someone's bedroom without saying anything to them, if she can yell at you for hitting a pan she can yell down for you not to come back in and sleep in another room. This is assuming if she had told you to sleep in another room that you would have without arguing and keeping her up anyway.", "You both sound like assholes.", "ESH. Be adults and accept that you are not good at co-sleeping, then sleep in separate rooms. Reason for judgment: you're making your problem her problem and that sucks (plus sleep deprivation is a form of torture); her locking you out instead of having a proper conversation / confronting your sleep incompatibility issue also sucks (although less than what you're doing).", "NTA It was an accident and she should’ve communicated her needs to you without locking you out. You need to both sit down and come up with a solution that works for both of you. Maybe she needs sleep medication?", "ESH - just sleep in separate rooms and be done with it. You can still spend evenings together and be intimate, but your relationship won’t survive with these sleep games.", "ESH.\n\nHear me out.   They have a shared bedroom, and then they EACH have a spare room for themselves.   The only time one or the other should be using rhe shared room is when they want to sleep together.  If the GF needed her sleep for work, she should not have gone to bed where she did.", "You need to reevaluate your relationship.\n\nThere's no world where I'm getting locked out of a bedroom in an apartment that I pay for.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (m 30) perpetually have trouble sleeping and sometimes will need to or get up from the bed and try sleeping in a different bedroom or spend some time on the couch. My girlfriend (30 f) is a light sleeper so this can cause problems when I enter and exit the room. I try as best I can to be quiet when I enter and exit, but sometimes I can be clumsy or not light on my feet, causing her to wake up. Even when I do nothing other than enter, and go directly to my side of the bed. Usually I sleep in my office to avoid coming in and out of the bedroom, which wakes her up. We have two spare bedrooms, so sleeping arrangements generally aren’t the problem.\n\nLast night I felt like I was actually going to be able to sleep, and I decided I wanted to sleep with her. She had work the next morning. After about 10 minutes of laying beside her, I felt like I was too hungry to sleep, so I wen’t to kitchen to make some food. I accidentally banged a pot and cupboard, which caused her to yell at me, after which I heard her lock the door of our shared bedroom. We had designated one of each of the spare bedrooms to either of us and the master bedroom is ours both to share.\n\nI pay both our rent and I felt like her taking control of the shared bedroom was unfair and disrespectful. I demanded she let me in to our shared bedroom, and she responded that I should sleep somewhere else, because, I won’t be able to sleep, which will result in her not being able to sleep. I didn’t feel that locking me out of our shared bedroom was either respectful or ‘fair’ - because she could just as easily use a spare room if she has trouble sleeping. Eventually, after pounding the door, she let me in, where after I slept and she went to the other room.\n\nShe is extremely angry at me (it is now the following day) and insists that I’m wrong in asserting that locking me out of our shared bedroom is ‘no bueno’, and knocking on the door until she let me in. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA", "YTA", "YTA. You’re being incredibly inconsiderate to your partner. I find it hard to believe you didn’t know you were hungry until you got into bed with your gf.", "YTA", "YTA\nIf you knew she was a light sleeper and had work, why did you decide to get out of bed ten minutes after climbing into bed with her? It’s not too hard to ignore hunger and just get to bed. And you should’ve taken care of any problems like that BEFORE you got into bed.", "What kind of adult goes to bed not realizing they’re hungry? 😂 YTA. Why take the chance when you KNOW you don’t sleep well. You have two other beds to choose from. Wait until your GF doesn’t have to work in the morning if you want to sleep next to her. These are all super obvious thoughts you should be having as a 30 year old…", "You are a control freak YTA", "YTA. Clearly you recognize that your sleep issues are negatively impacting her, and your respect of that should supersede your want to lay with her.  Of course it seems immature that she would lock the door but clearly you’re not respecting her boundaries, so I’m not surprised that she felt that was her only option.\n\nAlso, you should really consider looking into these sleep issues. Getting up because you feel too hungry to go to sleep sounds ridiculous, but there might actually be some medical diagnosis underneath that. If it is something treatable, you need to get that treated. If it’s not treatable, and it’s simply a weird behavioral thing you have, you’re definitely gonna need to get over that", "YTA! Just sleep in another bedroom, you have three! Most couples your age can only dream of that option. She’s clearly at her wit’s end being woken up every night.", "As a light sleeper myself I say major YTA. Once woken up it sometimes takes me hours to fall asleep again. Sometimes I don't get to fall asleep again at all. You should evaluate if you're in condition to go to sleep before you go to bedroom. You need to find solution that works for everyone. I currently sleep on couch (very comfortable one) because I wouldn't get any sleep sharing bed with both my husband and our toddler.", "Totally the TA, cause I being a light sleeper as well. Find it really annoying, and you're exhausted the next day. Why not just go to the spare room. Just cause you can't sleep at night doesn't mean you got to disturb someone else's.", "YTA but I doubt you'll have this problem much longer cuz she's gonna leave you. No one can survive long under these conditions.\n\nyou're making your sleeping dysfunction her dysfunction out of selfishness. Keeping another person awake is literally a form of torture. It sounds like you have other options for sleeping but instead you torture her all night because you just feel like it? You get in and out of bed knowing it wakes her up but that's fine? Infuriating. Get it together.", "YTA You thought you could sleep and lasted 10 minutes? My 5 year old can do better. She had to work the next day. Either get some melatonin gummies or just sleep in separate rooms.", "> I pay both our rent\n\nHi financial blackmail. That's coercive control. A classic hallmark of an abusive relationship. Don't be abusive, and you won't be an asshole. For now, YTA. Good luck!", "YTA for all the reason in other comments but also because you threw a tentrum to make your sleep depraved girlfriend even more miserable, instead of just waiting the day after to have a discussion with her. \n\nYou can not expect someone to be fair and respectfull (she was) when they are tired as hell (because of you).", "ES - you need 2 bedrooms - unless somebody changes how they sleep", "YTA. This whole post is giving \"me me me\". Quit being selfish for a sec and think about you gf.", "[removed]", "It sounds like torture from how he describes it. He needs to get help for his sleep issues & stop waking her up. I agree with the YTA vote.", "But He PaYs AlL tHe ReNt!", "Your cat knows it’s the asshole and does not care, so no.", "My cat would write her own post complaining that I lock her into the kitchen at night and don’t appreciate her wandering through the house singing at 2am - and also 5am. All the other cats would tell her to leave me right now because I am abusive", "LMAO", "[deleted]", "That's not even insomnia at that point. That's just dumb. Went to bed and 10 minutes later got up to eat. Wtf? You're not a child, OP. Did you forget to use the potty too? Damn.", "Not even a snack! OP said he banged a pot. He intended to COOK something!", "[removed]", "Right? It was a struggle to get thru the post lol", "Seriously, banging pots and slamming cupboards in the middle of the night? Stomping? I bet their neighbours love him too.\nYTA", "Right! She should move out and pay her own rent.", "Hah, literally.", "She ain’t going anywhere because he pays the rent.", "Exactly this! Once settled for the night, the person causing the ruckus, must take said ruckus out of the sleeping area. It is not on the innocent sleeping party to move beds bc you’re going to be up and down all night. \nGet your thyroid checked OP. \nCut back on stimulants. \nMelatonin. \nValerian root.\nLook up “sleep discipline.”\nFrom Ambien to Belsomra, there is a sleep aid among the dozens available, that will work and not make you dysfunctional the next day. I had to try almost a dozen to find one that helps me sleep and doesn’t make me a zombie the next day.", "Jesus even a normal sleeper would be woke up by a partner who is in and out of bed, banging pots around, probably walking about like it’s a normal time of day and making no attempts to moderate their behavior.", "Choosing to cook something that even requires a pot at that time of night, given the ongoing sleep trouble context, is an AH move. Granola bars, yogurt, chips, fruit, carrot sticks, pretzels, hell even toast would be quieter than that.", ">Keeping your partner awake and causing her to lose sleep is unfair and disrespectful.\n\nSleep deprivation is also an abuse tactic. OP wants to be able to do whatever he wants whenever he wants and doesn't care about who it affects in the process, as long as he gets his way. YTA.", "exactly this! he throws that in to gain sympathy but doesn't explain anything else of their split, whether she pays for bills or their groceries or does all the housework, etc... and also, if he *agreed* to pay all the rent, why is it an excuse for him to be an asshole?", "I feel like he's characterizing her as a light sleeper to place blame on her. She's probably just a normal sleeper who is getting tortured by this dude who can't stop roaming around at night.", "Edit; you're more the AH and the only issue I take with anything she did is locking you out without communication.", "Not an accident to forget that somehow you're hungry and get up again", "She should drug herself to sleep so that he can try three different sleeping locations each night instead of two?", "Isn’t OP the one who needs sleep meds? He is the one who has trouble sleeping. She sleeps fine if OP doesn’t disturb her.", "Why should she take any medication for sleeping? Afterall she can sleep just fine. OP is the one to come and go and keep waking her up. Honestly I'm surprised she puts up with it at all.", "Absolutely not. He's the one with the sleeping problems, he needs to sleep in a spare room and leave his working girlfriend alone.", "Yeah, he’s lucky to be YTA, he should have been the ex!", "To be fair they both seem to have sleep issues? Melatonin all round.", "The cat fundamentally rejects that it is the asshole. It has never done anything wrong in its life!", "YTA. It does when he keeps waking her up for his selfish needs.", "Pillow therapy, Lol 😂", "\"The pillow is just to help you sleep, hush\" lol", "Can the pillow be on fire first?", "Valerian root tea is the best. Works better than the capsules. I’m an anomaly, chamomile gives me nightmares. Lemon balm tea is also very good.", "I said this on another comment, I feel like he characterized her as a light sleeper to place blame on her. Dude's in the kitchen banging pots and pans and is like \"well if she wasn't such a light sleeper\" is an insane assessment. Why can't she sleep through me rearranging the house at 3am?", "indeed, sleep-deprivation is used as a torture tactic although I don't read that into this scenario. I think OP has a chaotic ADHD that is going unmanaged.", "I am unemployed, mrs cookies makes all the money, we are still equal in the relationship. I am not shamed for my lack of income.", "It sounds like she wakes up when a pin drops. He might need them too.", "She appears to have sleeping problems, too.", "[removed]", "Melatonin doesn't work for everyone.", "[deleted]", "OP said she wakes up when he is clumsy or not light on his feet, not when a pin drops. OP needs occupational therapy to get used to using his four limbs.", "Being a light sleeper isn't a sleeping problem. The problem is that OP thinks it's okay to walk in and out of the room she's sleeping in multiple times a night, and he thinks it's okay to make noise around the house at night. If her \"sleeping problems\" can be eliminated by dumping OP, then she really has boyfriend problems.", "that doesn't mean she doesn't have any income. they very well could have a split where she pays for groceries and bills and whatnot.", "I have insomnia myself. It's selfish to get into a bed, with your partner, who you know is a light sleeper, and decide no wait I'm hungry. My insomnia is my problem to handle, I don't force my partner to deal with it. Because that would be selfish, knowing they have to go to work tomorrow, and I keep waking them up, because I can't sleep. Get it?", "You thought you’d be able to sleep and then decided you were hungry? Do you have no scheduled rhythms at all? Start eating and sleeping on a schedule so that your body will understand when it’s time to rest and you won’t be an insomniac asshole to your girlfriend. YTA", "The best part about this is that he says he typically will sleep in another room and apparently has no problem with it. But when he heard that lock click is when he turned into a big baby. Dude, you should have taken your little midnight snack to another room and slept there. Not throw a hissy fit like a child.", "YTA for making your insomnia your girlfriend’s problem to deal with. Go get your sleeping issues checked out.", "PS Who pays the rent is irrelevant if you waking her up at night is a regular happening. Grow up and be a better partner!", "YTA. If she sees this post, I hope she moves out and gains some independence. This is such a selfish attitude on your part.", "YTA for making your insomnia your girlfriend’s problem to deal with. Go get your sleeping issues checked out.", "Done", "end the relationship", "YTA You got up because you were you were too hungry to sleep. You should have just slept in the spare room. End of the story. If you are having this much trouble with sleeping see a doctor.", "So you go to bed, get up, bang pots, try to go back to bed… ugh. Rude.\nAnd you two need to work out how to share finances since you clearly resent her not contributing to housing costs.", "YTA.\n\nIt sounds like you know full well how much you're disrupting her sleep and you do it anyway because you want to. And getting up to eat? That just sounds so strange to me.\n\nOn another note, have you seen a doctor? This could actually be a medical issue if sleep is that big a problem for you.\n\nAnd finally, the rent situation has absolutely zero bearing on this scenario. It's actually demeaning to think you are somehow buying superiority in your relationship. If you're not happy with the financial setup then talk about that like an adult. Don't use it as a bargaining chip.", "Yta, you sound so malicious.", "I’m going with ESH… simply because you’re both 30 years old and all of this seems childish. You should have had a conversation about this way before and figured out how the both of you can get some sleep. I guess it sounds like you started seeing as how you have separate bedrooms, but clearly that isn’t working. Sit down and figure it out instead of having pissing contests over it.", "NTA. If you lock someone out of a shared space, you're the AH. So, that would be your girlfriend. Honestly? This is how this situation should be handled. You bang on that door until it's open. One person doesn't get to unilaterally decide to kick someone out of bed. I see a lot of Y T A comments. Those are abusive partners who think it is okay to treat people badly. The onus of responsibility to move to another room is on the light sleeper. Nobody should have to tiptoe around their own house. NTA!!", "YTA", "YTA. You’re a selfish knob head. You went to bed because you were sure you would sleep, then after ten mins you got back up to get some food because you had a rumbly tumbly?! I’m a fat cunt and even I haven’t done that since I was about 4. You have designated rooms for this very reason, yet you decided that on this occasion you would just go on like a dick and keep her awake because YOU wanted to sleep in the joint room?! If my husband did that I’d start windmilling.", "YTA. No sleep is used for torture. So the question is how many nights this week have you made it hard for her to sleep? Sounds like you need a sleep study done to me before you lose your gf.", "YTA. It’s not your fault you can’t sleep, but it is your fault that *she* can’t sleep. Sleep deprivation is a form of torture. Do you want to torture your partner? Because that’s what you’re doing. But you wanna whine about disrespect when she’s *literally being tortured in her own home* Jfc. She’s not the disrespectful one here. She locked you out to protect herself and her sleep and you decided to be a massive AH about it instead of taking the hint and sleeping elsewhere. Hope you figure out how to be better or you’re gonna be single.", "Wow. How fucking selfish can you be?", "YTA.  She was already in the \"shared room\" trying to sleep when you woke her up.  You're the one that should have slept elsewhere.  Just because you pay the rent doesn't give you the right to keep her awake.  That's apparently the arrangement that was made, so you can't hold that over her head and use it as an excuse to do whatever you want.  Who tries sleeping for ten minutes and then gets up to cook?  You might want to see someone about your sleep troubles.", "YTA. Let her rest", "YTA. You remind me of when I shared my bedroom with my sister when we were ten", "YTA You cannot keep torturing her like this. You had two other rooms to go to, there was absolutely no need to disturb her again, 'because you have a right and you pay the rent.' What are you, a dog pissing on his territory?  You're lucky your gf hasn't suffocated you with a pillow by now. If you don't start showing some consideration, your relationship will go down the pan.", "YTA \n\nespecially considering you knew she had work in the morning in the middle of the night you decide to cook? R u fr?", "I do shift work. Meaning some days I open, some days I close, etc.\n\nFor some reason my partner's sleep patterns go like this:\n\nDays I close and need him to pick me up from work at 12am (or I'll just walk home, we have 1 car) he can easily fall asleep by 8pm.\n\n  \nDays I open and need to wake up at 3am to get ready for work? He will stay up playing video games and yelling over x-box until until like 2 am. I get zero sleep.   \n\n\nHe's absolutely the AH for this and YTA for how you're treating your girlfriend's need for sleep. If she paid part of the rent would your exhausting ass let her sleep?", "YTA you are inconsiderate making your sleep issues her problem. Stop acting like an oaf", "Holding the fact that you pay the rent over her head = YTA", "YTA - you not being able to sleep is NOT her problem besides you forcing it to be her problem. You’re the one causing issues, you sleep somewhere else.", "She should probably just get her own place at this point.", "YTA and so inconsiderate disrespectful tiny individual", "\nLast night I felt like I was actually going to be able to sleep, and I decided I wanted to sleep with her. She had work the next morning. After about 10 minutes of laying beside her, I felt like I was too hungry to sleep, so I wen’t to kitchen to make some food. I accidentally banged a pot and cupboard, which caused her to yell at me, after which I heard her lock the door of our shared bedroom. \n\n.....................\n\nThis made me laugh. Like dude's pretty clueless. \n\nYTA", "Why should she have to move rooms to sleep when she was the one already asleep and was woken up by whatever you were doing?", "YTA.  \nI think you've misinterpreted the act of locking to door. You've decided that it's \"unfair\" and \"disrespectful.\"  I think that to you, it has an emotional meaning, like \"You don't belong here, you're not welcome here, you don't have a place here.\"  \nWhat it probably meant was this: \"I've already been woken up twice. I can't stand the idea of being woken up a third time, and I want to make sure he sleeps in the other room.\"  \n\n\nShe's not controlling  \n\\-when you come to bed  \n\\-how often you get out of bed  \n\\-what you do when you are not in bed.  \n\n\nShe's just trying to get control of one small piece of this: she wants a place to sleep, undisturbed, and I think that's \"fair.\"", "YTA. I’d be mad too…\n\nHowever, get this woman some ear plugs to wear.", "YTA. Fix your sleep problems. Sleep is extremely important. Your habits are unhealthy.", "YTA, settle issue before going to bed.", "As someone who is a very light sleeper, YTA 100%. If you decide to sleep with her, idc you lay there next to her. Even if it means you’re up all night. Going in and out of the room knowing she’s a light sleeper is selfish. All I hear is “I I I I me me me me” in this post. What about her and her needs?", "Dude, you need need help. You need to help yourself. There is zero reason you should need to eat 10 minutes after going to bed! You sound really disregulated. The fact that you only realize you are hungry ten minutes after going to bed tells me: 1) you don’t have a good night time routine that takes care of your bodily needs and 2) you are out of touch with your physical needs- which is both physical and mental. Seek help.\nAlso, you are 100% YTA because you knowingly, willfully cause your gf to experience the sleep disturbances as you and yet you blame her for being cranky, sleep deprived, and not acting “reasonably”.", "Who goes to bed and then 10 mins later decides they’re hungry?! You need to respect your partner. She needs sleep too.", "YTA- you must be a real treasure to live with. She’s fed up with being woken up, so locked the door one night and you are freaking out? Grow up.", "YTA. As a light sleeper myself, how do you know she doesn’t struggle to get back to sleep after you wake her up, or suffer from sleep loss because you just wake her whenever and don’t seem to have any compassion for disruption in her sleep. You need to apologize to her, and you both need to compromise about sleep arrangements that aren’t just about what you are feeling like at the moment you want to do.", "So you expected her to get out of the bed she was sleeping in and go to a new room because you woke her up? You had already disturbed her sleep once that night, why would you try to go back in the bedroom risking waking her up AGAIN after your late night banging and clanging? YTA", "You aren’t being honest.  What you really want is for her to be awake when you are awake. If she moves out of the master bedroom to have her own room, you will complain about that.", ">I pay both our rent and I felt like her taking control of the shared bedroom was unfair and disrespectful.\n\nThe amount of respect you think you're entitled to is vastly over-inflated.\n\nAs a general rule for life: if you complain about being disrespected, you're an asshole.", "YTA. You freaking woke her up. Jesus. Eat a cheese stick.", "YTA - You are disrespectful to your girlfriend's need to sleep. You know that you are disruptive but don't care enough to make an effort to be less disruptive.  Why should she sleep elsewhere when you are the problem.", "YTA and if you have issues sleeping, I would recommend getting a referral to a sleep specialist because what you are describing is not healthy for you, and clearly not super awesome for your gf. \n\nIf you do nothing to address this behavior, then you would be doubly the AH in this and likely single too in the near future. Sleep on that for a while, and good luck", "Here’s an idea.  You pay the rent she should be as sleepless as you are.  Count on this being an idea she will understand with only one solution.  She will move out to her own place that she can afford.  No more overnights for you!  That will be okay with you though as long as you aren’t paying her rent, you will no longer expect her to pay for free rent being constantly sleep deprived. \n\nYou do recognize the hat constant sleep deprivation is a torture technique.", "YTA and self-centered af.", "YTA. Btw why can’t u two just invest in a split king? No one can be happy waken up by someone else at midnight… no one… and ”pay both our rent” does not matter here for this particular issue. If u feel u r being taken advantage of financially u two should talk abt that, in another conversation.", "YTA", "My husband is a moderate to heavy sleeper and I am still polite enough when I'm sick and coughing or super restless to get up and sleep on the couch because I don't want to disturb him.\n\nYTA dude. As a lifelong insomniac with chronic sleep disturbances I can safely say the problem is you! Get your sleep situation figured out. Go see a specialist and let your poor girlfriend sleep by herself if you can't get it together.", "For goodness' sake just be ok with separate bedrooms! Why is that such a taboo in our society? Sleep should be valued more than it currently is. I can't count the amount of times my colleagues whine about not getting any sleep because their spouse was ill/had to get up super early for work/stayed up super late/was snoring like crazy, etc. \nCouples get into massive fights and jeopardise their relationship for the sake of saying they still sleep in the same bed as if it's some kind of universal golden standard to aspire to.\n\nYou already said you've got plenty of rooms to sleep in, so space is the least of your problems. Rather than having a shared bedroom and two separate ones (why?), I would suggest just having two sepeate rooms and... Getting together every once in a while in either. Or, sure, keep a third one for sexy times, but don't try to push sleeping together if that doesn't work.\n\nLook I get that it's hard, having insomnia. I can only sleep well if I'm on my own, and my partner gets woken up if I so much wiggle around in bed awake, let alone if I start going in and out of the bed (he's fine with sharing a bedroom, just not a bed). Of course we tried many times to make it work, but you know what really worked wonders for our relationship? Giving up on trying to beat this. We each have our room and sleep like babies as a consequence. We never get into arguments about sleep anymore and are able to tackle life well-rested.\n\nSo, YTA. Stop deciding to \"give it a try\" as that will only piss your girlfriend off and will mean two people don't get any sleep rather than just one. Have one room each rather than 1.5 so you don't keep up the pretense, kiss each other goodnight when she goes to bed and you go on and make yourself a midnight sandwich at will.", "NTA - you need to make sure you take care of all your needs before bed and try to be as considerate as possible, but if my significant other locked me out, I’d break down the door.", "yta", "YTA, paying the rent doesn’t make you king. You are in a relationship and have a home together. that is just as much her room as it is yours, and she has every right to lock the door if she sees you’re back to your usual routine of disrespecting her sleep schedule. ESPECIALLY when you have another room you can go to, and it was you who decided to get out of bed in the first place. Waking her up to make her go to a spare room all because YOU got out of bed is absolutely selfish assholery. fix your sleep schedule or stay in another room let her sleep.", "**YTA**\n\nThe moment she locked the door you should’ve gone to the designated spare room since you already knew you weren’t going to sleep and she needed her sleep.", "I'm married, 35 years, to a woman that will wake up if a fly sneezes on the other side of the house. My advice? Let her get her freaking sleep!", "Yoooooo.... Uhhh wth? NTA!!!! Jesus.. she could just use her words and say \"please go sleep in the other room i need rest and you're waking me up\" instead of locking him out of their SHARED space.\n>after I slept and she went to the other room.\n\nShe ended up moving anyway like... She could have done that instead of locking the door. Why am i the only one saying he's NOT THE AH. He has problems sleeping. He thought he could do it this time and tried and couldn't because of hunger which i understand completely, i could be exhausted all day and take Benadryl and still not sleep if I'm hungry. Banging noises were a mistake that he could have apologized for but how could he if he was locked out. Y'all are so bad at sharing a space like dang they're both just trying to sleep so maybe you could say NAH but i think he's NTA.", ">AITA for keeping my girlfriend up, because she locked me out of our shared bedroom?\n\nYTA, disregarding all the blather, your title specifically states *that you kept her up* (after repeatedly waking her) because she locked you out of the bedroom.\n\nThat was a jerk move to retaliate for her locking you out...for a darned good reason. She and most of us want to sleep! The fact you can't/don't, and keep getting up, making noise, coming back, ad nauseum - knowing she's a light sleeper, makes you the problem. You have other rooms, and she should be able to sleep through in the one she started in. You, on the other hand, should sleep elsewhere until you get your insomnia or whatever under control. If she doesn't have plans the following day, perhaps she'll ask you to sleep with her.", "You should see a doctor for your sleeping problems, first.  Take care of yourself.\n\nNext, dump the girlfriend.\n\nYou, obviously, cannot cohabitate.\n\nYou have insomnia and she is easily awakened.  \n\nEnd it now before sometime bad happens.", "I espedially love the line \"she could just as easily use a spare room if she has trouble sleeping.\" No, OP, your girlfriend doesn't have trouble sleeping, you're the one who keeps her from sleeping. Great example of DARVOing, mate. YTA", "Look, I'm a tough person to sleep with. O have nightmares all the time, wake up shouting, kick and punch in my sleep, and sometimes sob until I wake up. I cannot control it. \n\nThat being said, YTA, your girlfriend needs her sleep. You knew one of the conditions of sleeping with her is being quiet and not moving so much. You broke that condition. She did what a logical person would do and locked you out so you would not continue to disrespect her and her sleep. \n\nYou should have gone to one of the separate rooms. You should have apologized in the morning.\n\nAlso your girlfriend is not a pillow or a stuffed animal you purchased, sleeping with her is a privilege not a right.", "What are you trying to say is that... she was disrespectful for trying to sleep for the next morning to go to work?\r  \n\r  \nAnd you, \"man who pays the rent\", were totally respectful to her, not only not letting her sleep, but knowing that she is a light sleeper, you enter the room, leave the room, go to bed, get up, go to the kitchen, make noise, and on top of that, you have the nerve to offend yourself and wake her up on purpose until she gets angry?\r  \n\r  \nMy God. 30 years.  just go to sleep to the next beedrom and shut up. \r  \nYTA.", "It he irony is that he expects her to sleep in the other room if she’s having trouble sleeping, but doesn’t see how he’s the reason why she’s having trouble and in such SLEEP IN THE OTHER ROOM himself 🤔", "Deliberately depriving a partner of sleep is abuse.  YTA", "YTA and honestly, this would be the end of a relationship for me. I'm sorry you can't sleep. But just because you can't sleep doesn't mean you fuck around with someone else's sleep.", "Who uses the spare room has nothing to do with who is paying the rent. The person who is awake and making noise sleeps in the spare bedroom. YTA for all of this but especially for trying to make the person who is already in bed trying to sleep move rooms. \n\nYou need to go see a doctor about your sleep issues or just always sleep in a different room. My dad has a chronic illness and has sleep problems that can’t be fixed so my parents stopped sleeping in the same room because it isn’t okay for him to wake her repeatedly during the night even though he can’t help it and doesn’t mean to. You don’t just make your partner miserable. You see a doctor and fix the problem or you sleep in a different room.", "Has your girlfriend ever tried to sleep with earplugs? \nHave you ever tried to take something that helps with sleeping?", "So far beyond YTA that just makes you a bad partner. You say multiple times You have another room to sleep in but Because You pay the rent (was your choice?) she has to continue to put up with it or sleep in her other room. Which You can't do? \n\nI empathize with your sleep issues since I sleep like 4hours a night on and off myself. But I've never let it alter my partners sleep. You want all the respect but don't want to give it. You feel wronged because she took care of herself for once, like you've been doing every night while keeping her awake. If you try and fail over and over again. YTA. Sleep in another room, your need to sleep with her, doesn't negate her need for sleep.", "There is nothing worse than being sleep deprived because you're partner wakes you up, and quite frankly you sound absolutely miserable to cohabit a bed with. Since you're the one that gets up and down you're the one that needs to be considerate of your girlfriend sleeping. If you want to sleep so badly in the shared room tell your girlfriend before she goes to bed so she can sleep in another room undisturbed. \n\nAnd dude, don't be a dick by throwing around the whole 'I pay most of the bills\" or whatever. Do you want a partner or a roommate, because if you go throwing money in her face because you feel pissy she's either going to move into the spare  room (you know the one she 'pays' for) or move and. Then what are you going to do, cry about how you didn't mean it?", "YTA. Get a hold of yourself, this is unbelievably selfish.", "I wonder how much of your sleep issues are simply because you aren’t forcing yourself to just lay still long enough to sleep. Have you really done all you can do to try and fix this issue - melatonin, magnesium citrate, see a doctor, no screens and dim light before bed, reading before bed, going to bed at the same time every night? Look up sleep hygiene and if you have truly tried all of those things for at least 2 weeks and still are having problems you need to talk to your doc about having a sleep study done. You shouldn’t just be throwing up your hands and going oh well I sleep like shit and I make my partner miserable with my sleep problems.", "So you are a clod, who runs around making noise, getting up and down, waking her up all the freaking time. You do this consistently, so while it's not on purpose it's basically always happening anyway. How do you not feel wildly selfish? If you have crazy sleeping issues leave her alone, just take one of the many other damn rooms you have.\n\nYTA", "YTA if you live someone, let them sleep", "YATA, without a doubt.  After my husband's surgery, he had difficulty sleeping and would get up and down several times a night.  He moved into the spare bedroom without my even having to ask because he said he knew that I had to get up early for work. \nI'm having a hard time believing that the OP doesn't realize that his behavior is inconsiderate at best and (intentional or not) tortuous to his girlfriend.", "Yta", "YTA. You know what I do when I've gone to bed, and I'm peckish? I go to sleep, and I eat breakfast in the morning like an adult. Don't wake your partner up in the middle of the night being Phil Collins with some pots and pans, ffs. Also, who bangs on a door in the middle of the night on principle?? Wait until the morning to talk.\n\nThis is also obviously an ongoing issue. You're making your sleep problems your girlfriend's problems, and should just default to sleeping in the other room.", "What does you paying the rent have anything to do with it. She isn't allowed to get aggravated at your extremely annoying habit. Not only do you get up, you bang into things or stomp and wake her up. Your inconsiderate. I hope she sees this", "YTA", "Seriously consider putting yourself through some sleep training.  Getting up 10 minutes after you lay down  to go cook a whole damn meal isn't insomnia, it's bad habits.  \n\nDo you love your girlfriend?  If so, actively develop better sleep habits\n\nIf it's more important to you to petty, disrespectful and self-centered, the do your girlfriend a favor and break up with her.   I'm guessing the locking of the door wasn't based on one night, it's based on her not getting good sleep night after night because can't be bothered to have ANY discipline about going to bed.", "NTA she over reacted and should appreciate that your the provider for the home.", "YTA You sound insufferable. Pick a spot to sleep and stay there. Or change rooms throughout the house except the one where she is trying to sleep. This sounds like a toddler tantrum. \n\n\"because she could just as easily use a spare room if she has trouble sleeping\"\n\nSeriously? She would have trouble sleeping because of YOUR issues. If she did go to another room then how would she know you still wouldn't disturb her there as well?", "Yta times a million", "If she’s not a fluent Spanish speaker and still uses phrases like “That’s no bueno” then she’s an ignorant AH. Also YTA for the sleep thing.\n\nUnrelated, but I’m kind of hungry after reading the part about the late night snack.", "Intentionally depriving your partner of sleep is a form of abuse. YIKES OP YTA", "YTA and u should probably consider getting a sleep test done if your sleeping issues are that bad", "OP your a grown ass man treating your GF like shit. YTA don’t be surprised when she breaks up with you", "YTA", "Info:  does your gf have to be up in the mornings for either school or work?", "YTA. You’re the one waking her up every 30 minutes, you have your own bed for this reason. Why should she move beds when she’s already sleeping not bothering anyone? Why are YOU entitled to the shared room and she isn’t? \nIf I was her I’d get a separate apartment or permanently move to my own room until we inevitably break up from how selfish,entitled,childish you sound.", "YTA. You are not respectful to your gf. She absolutely should have locked you out. There are two other bedrooms to sleep in, go to one of them. The comment regarding you paying the rent and thus she is disrespectful is gross and a huge red flag. She should move out and get away from such a selfish bf.", "Yta. I would have lost it at you the very first night you woke me up multiple times. Have you done anything about your inability to fall asleep? Can you pop an edible at least?", "He's acting like a pain in the ass toddler.  Maybe he could call his mom to get him a glass of water while he's at it.", "Literally, yes.", "YTA\n\nI'm a light sleeper, and I know sometimes when I'm woken up that if I'm forced to get up or woken up again shortly after I won't be able to fall back asleep.\n\nYou went to bed AFTER she was already asleep, probably woke her up without her opening her eyes. Woke her up again when 10 min later you got up... And then again when you made noise in the kitchen.\nBut you expected her to just keep trying to fall asleep while knowing you would wake her up again in 15/30 minutes.\n\nAnd then... You kept banging on the door to make sure she either didn't sleep anymore that night or at least not anymore for a few hours.\n\nMy advice? Grovel\n\nYTA YTA YTA.", "My favourite part is that it’s disrespectful for her to lock the door because she should have changed rooms, but it’s not disrespectful of him to go cook a whole meal *with pots and pans* in the middle of the night when she has work in the morning because he’s hungry. Has this dude never heard of a sandwich? Crackers and cheese? Left overs? WTF. \n\nAnd my dude, are you telling me if she moved to the spare room she wouldn’t be able to hear you banging around in the kitchen. \n\nAlso, it’s not lost on me that YOU deserve respect because YOU pay the rent. That’s not how partnerships work, and I’d love to hear who cleans the house, buys the gifts, makes the appointments, cooks the meals, buys the groceries, etc…\n\nListen, when it comes to sleep YOU are the problem. Why should she have to change beds because you can’t sleep? WTF. \n\nSo far as I can tell you have 0 respect for her and expect to be catered to at all hours no matter the cost to her. And when was the last time she was allowed to just get a solid nights sleep in her own bed? \n\nYTA. And honestly, I’d consider your behavior controlling and abusive (sleep deprivation is abuse and literally illegal to do to prisoners).", "'Accidently banging a cupboard door and pot'. The frick kind of midnight snack are you making? Lasagna from scratch?\n\nOP also has a second bedroom. A sane person would've gone to the second bedroom and went to sleep as quietly as possible. No, this guy decided to go the AH route to teach his GF a lesson.\n\nOP is such the TA. He can't be that oblivious.", "And also he apparently feels that him paying the entire rent entitles him to this kind of behavior. Even if she was a guest staying over, she would have every right to get angry.\n\nYTA.", "“Could just as easily use a spare bedroom” so could he, he knows it’s that easy. it’s a control thing. Not cute defs YTA", "FRT get a body pillow. Let this woman have her zzzzz's", "And eating that late right before going to sleep is not helpful to fully sleep that night without waking up again.", "Yeah, I’m like him but thankfully my partner is a heavy sleeper. But if I can tell I’m going to struggle with sleep or I start to toss and turn, I go to the couch and stay there because reentering will make the dogs restless and wake partner up even so. I wish we had the luxury of an extra bedroom each! He has nothing to complain about", "If I were her I would definitely sleep in one of the other bedrooms with headphones on. He can come and go out of the shared bedroom all night long if he wants, but there'd be hell to pay if he woke me up. The shared bed would still be for adult time.", "Oh but he thinks SHE is the disrespectful one! smh\n\nI am like OP. Up and down all night and I know this is my problem. I don't harass everyone else in the house just because I can't sleep and I pay rent. I get it, it sucks but OP is YTA", "If I ate and then immediately tried to sleep, I’d be tossing and turning for hours.", "And the sleep deprivation is abusive too! OP needs to do some self reflection…", "Oh man that sounds like a good read was that posted recently?", "Oh god, that AITA was awful.", "I feel you. In the end I bought an automatic feeder so the cats leave me sleep. 10/10 recomended!", "Also, knowingly depriving someone of sleep is an abuse tactic.", "Right? When he said problems sleeping I didn't think he meant problems he could easily manage. Like, eat a meal at a reasonable time so you're not hungry at bedtime. It's not hard to manage that one.", "My cat would write something like this: \"My human had the nerve to lock me out of OUR room after I played with my favorite toy all over the house, got the zoomies 3 times, and whined all night that she wasn't paying attention to me! So I started banging on the door until she let me in! I didn't even want in, it was just the principle of the thing.\"", "Do we have the same cat?", "Let’s not get started on the whole gender thing. Not having to pay the rent is always a bargain. With that being said, I do agree with what you said about partnerships.", "Yup. I remember reading a thing a few years back that domestic abusers frequently exhaust their partner (through sleep deprivation, manual labor, or both) to make them more compliant.", "I am a terrible sleeper and I have a box of snacks for if I get hungry at night. My partner never even notices I am out of bed. I even make a cup of tea before bed and put it in a thermos just to be sure I won't bug him", "I would love one! But they won't eat kibble anymore. It's only the baby that does it (she's nearly 10 months), and she will not take no for an answer! The older ones learned pretty quickly, she just gives 0 fucks. Lol", "My cat would meow her head off", "My human had the nerve to lock me out of MY room\n\nfixed it", "She is a tabby who knows she owns me! What’s your cat like?", "It seems like her only sleep issue is him....", "Doesn’t work for everyone. I use to go back and forth between days and nights. I tried melatonin to see if it would help and all it did for me is make me drowsy when I woke up. Heard the same from others that have used it. It’s not for everyone.", "So because she is awoken when he makes noise, gets in and out of bed, etc, and *she* has sleep issues? Yeah, no…\n\nOP is TA and needs to get help for HIS sleep issues.", "I agree if I was OP I would of packed her stuff since I can't sleep. I pay all the rent and you lock me out. But OP is an AH also because if you can't sleep stay out the bedroom.", "That would hurt her hands", "Would be to time consuming if you just want to f**g sleep…", "This, plus it's not like OPs gf *chose* to be a light sleeper, some people just are, just like some people are normal sleepers and some could sleep through a fucking earthquake.\n\nAlso did OP *really* need to cook at the time his Gf was sleeping? No, he could have easily grabbed a snack or made a fucking sandwich.\n\nAnd just because he pays the rent doesn't mean that he's entitled to disrupt his gf's sleep just because he can't sleep. He needs to either get medical help for his sleep issues or if he knows he can't sleep stay in a different room and read a book or watch TV or something instead of clattering around the house keeping his gf awake/waking her (and possibly his neighbours) up.", "Right. I only moved all the furniture vacuumed and then steam cleaned the carpet. She is totally over reacting. /s", "The thing is people can be abusive without knowing they are. If this is continual it is abusive even if OP doesn’t mean it to be. Now that it’s pointed out if they don’t change they’re knowingly abusive which would be worse than being just TA.", "Banging/dropping pots and pans is not equivalent to a pin drop.", "Yup. My cat has a very distinct meow, it either sounds like she's crying or chirping. When she plays it's a chirp when she wants something she isn't getting it's a cry.\n\nThey are both cute but not between the hours of 1am-5am", "Ah yes, how could I forget that all rooms are her's. \n\nBedrooms, bathrooms, pantry, I don't think the dishwasher counts as a room but it's hers.", "Yeah, I have a really bad rebound effect with melatonin. I get 4-5 hours sleep and then wake up from a deep sleep feeling like I'm going to die.", "Melatonin works for me for a single night... but if I take it more than one night in a row, I get a pounding headache that no painkiller can touch. \n\nBut I don't think being a \"light sleeper\" is a \"sleep issue.\" Most people are going to wake up if someone gets out of bed, bangs around in the kitchen, and gets back in bed, lol. \n\nAlso I'm not sure that melatonin would stop her from being woken up by noise. It doesn't for me. It helps me get sleepy and it might help me get to sleep faster if I'm woken up, but someone dropping a pot in the kitchen is going to wake me up, regardless of melatonin!", "Yeah it works for me. Not super well, but it makes me a little bit drowsy at night, which makes falling asleep slightly easier. \n\nBUT if I take it for more than one night, I get an absolutely pounding headache that painkillers don't get rid of.", "I’m also not convinced that she’s “a light sleeper.” I think it’s way more likely that OP makes more noise than he knows/is willing to admit.", "Yikes. Wake up headaches sound terrible.", "Yeah they're pretty awful! Wouldn't be so bad if I could take an ibuprofen to make it go away but it doesn't help.", "YTA. You sound like a nightmare", "Yea....you do realize forcing sleep deprivation onto someone is a form of torture right?\n\nYou're literally tour torturing your gf.\n\nYTA. You're knowingly waking her up multiple times and you don't care. You're a lousy partner, OP.\n\nGo to your doctor about your sleep issues and get help for it. In the meantime, sleep separately and allow your gf to sleep throughout the night.\n\nOtherwise, get ready to be single. You deserve it.", "YTA. If you're the one with the problems sleeping, it's up to you to find another arrangement that allows your partner to get the sleep she needs. It doesn't matter who's paying the rent. It's about doing the right thing by your partner.\n\nAlso, I'm not a doctor, but do you make a habit of getting up and cooking? Since you mention a pot, I'm guessing you were making actual food vs eating a protein bar or some crackers or something. That could contribute to your sleep issues, too. Maybe rethink that behavior.", "YTA. You didn’t want to sleep WITH HER. You wanted THAT BED. You carelessly made noise until she woke up and then, instead of  apologizing and explaining  you’d hoped to sleep together (after cooking a meal, of course), you snottily decided she could get her ass out of the bed and move to another room. Even though you were already out of that bed and could have easily slept elsewhere. This is a thinly disguised power play and YTA. \n\nAlso, if she ill -advisedly ever lets you back in, learn how to leave a room quietly. Stop clomping around. Ffs.", "why are you making YOUR problem into your gf's problem? YTA. You have a problem, deal with it without bothering other people.", "YTA for all of your actions last night. Your even more TA for brining’I pay the rent therefore it is disrespectful’ garbage into it. You sound like an awful person to be with even outside of how selfish you’re being about the bedroom and how quick to extreme anger and actions you were.", "YTA\n\n\nAnd she needs a new bf.", "OP you sound like a 4 year old having a tantrum. Shame on you.", "Major YTA", "YTA— \n\nObviously dude.", "The alternative rooms are generally for the person who snores and has a hard time going to sleep. \n\nI could understand both sides, but you definitely pulled a stunt that night so I can’t blame her for locking the door on you. Especially after waking someone up 2-3 times within a 20 minute span would make me go berserk.\n\nYeah it’s your house and you may pay rent but that’s financially abusive, you don’t play that type of ball in this ballpark.\n\nYTA.", "YTA\n\nAnd is anyone else beyond over seeing dudes on this sub offering to pay for things like rent and then thinking that gives them the right to be a total AH and still demand ‘respect’??? “I pay both our rent so she doesn’t get to be cranky about never getting a good night’s sleep because I’m a child incapable of coming to bed without sounding like a hurricane”", "YTA. \n\nJust lay down and close your eyes. Sleeping isn't hard, so sick of people \"needing\" the TV on, or \"needing\" a snack before bed or anything like that, just shut up and lay down like an adult.", "Hmmm, ESH I think. I tend to wake my husband up whenever I go to the bathroom (curse getting older and having a small bladder, bah) but he's never locked me outta the room for it. However, you did make noise - I get it was accidental - knowing your GF is a light sleeper. Next time, maybe eat a hot pocket instead of something that requires a pot.\n\nOn the flip side, your GF sucks because you're the one paying rent. She doesn't get to unilaterally decide that you don't get to use the master bedroom that, y'know, you pay for. You two need to have a discussion about expectations of one another.", "Okay so you pay all the rent and she shouldn’t feel entitled to lock the doors like that. But if this has been going on for so long, you need to just suck it up and sleep in a different bed. It is not fair to her, and it doesn’t invalidate your relationship. She needs sleep for work or she can’t help you pay for things.", "ESH. OP, you're the AH for keeping her up and banging on the door like a petulant child. She's the AH for locking the shared room when there is a clear and established set of rules regarding the spare rooms. If you were so insistent on sleeping in the shared room, so much so that petulant child attitude came into play... I'd have just silently grabbed my pillow and blanket, flipped you off, and gone and slept in the spare room. \nYou need a sleep study, she needs earplugs,  and you both need to sleep separately. Studies have been done that show a lot of couples actually benefit from sleeping separately and using the master bedroom for... erm...\"couples activities.\"", "ESH\n\nOP having sleep issues isn’t a surprise to either of them. So if GF has already gone to bed and is asleep it would be reasonable for OP to lay down to sleep with her.   Not sure how OP in the example provided didn’t realize he was hungry before laying down however once he decided to get up and start banging around in the kitchen to make himself a meal then IMO he should have gone to one of the other bedrooms.  And no matter how quiet one tries to be in the kitchen there is noise that seems louder because so much less noise. \n\nGF as she is somewhat responsible for helping herself sleep through most of OP’s ups and downs assuming he isn’t slamming into things.  A white noise machine might be helpful to ideally drown out the moving and shuffling.  Perhaps soft earplugs may also help. \n\nA suggestion for both OP and his GF to speak with their respective doctors as to their challenges with sleeping and perhaps work with someone who specializes in sleep challenges.", "INFO: You said you pay all the rent. Does she pay any of the other expenses?\n\nIf you're downvoting this because you think this implies she deserves less say, you're missing the point. This is whether he's willing to tell half truths to get people to side with him. He's the asshole for interrupting her sleep like that. He's and asshole if he thinks paying more rent entitles him to that. He's mega gaping asshole if he left out if she covers other expenses to try to win his point.", "NTA, if she didn't want to risk getting waked up, she should've gone to her personnal bedroom, simple as that.", "If you'd done nothing wrong, I'd say NTA.\n\nBut you're actively disturbing her sleep on the regular, you're being detrimental, to her physical and mental health and you think its unfair that she get some goddamn sleep?\n\nIf it was something petty or a 1 time thing, sure, Benefit of the Doubt, NTA. But it's not, and Why are you *Cooking* at night? (Because the idea of you unironically, just knocking a pot and a cupboard during the night when you're getting a snack is absurd)\n\n&#x200B;\n\nYTA right now and the excuse of \"But I pay all the Rent!\" doesn't hold much weight in this situation. If she was a lazy, do-nothing, using you as an Bank Account with legs, sure. But thats not the situation.\n\n&#x200B;\n\nYTA. Sleep in the other room and try to salvage your relationship with your SO.", "NTA - Myself and my partner had this issue when we first got together.  Our solution that has worked amazing for over 20 years, a noise machine.  Find a white noise that can cover up normal ambient sounds.  If you have hard woods, invest in some soft fur carpets, they feel amazing and dampen most footstep sound.  Even if you have carpet these work to dampen the sounds in the room.  Hopefully you can get through this.", "ESH. She shouldn’t have locked you out but you should’ve taken the high road and gone to a spare bedroom", "You both need to grow up.", "ESH\n\nYou need to grow up and she needs to invest in earplugs.", "NTA.\n\nKick her ass out and sleep wherever you want\n\nTo be fair you’re both assholes and should have discussed this issue before hand.\n\nYou’re both disrespectful and rude af", "NTA people are being way too harsh. I don't think there's anything wrong with you wanting to sleep next to your partner in a space you two share together. Unless she had something really important to attend early in the morning, I think she's really overreacting. Who sleeps throughout the entire night without waking up once or twice? Does she have trouble falling back asleep? From this context she just sounds mean", "INFO: do you do any treatments for the insomnia?", ">Last night I felt like I was actually going to be able to sleep.... After about 10 minutes of laying beside her, I felt like I was too hungry to sleep\n\nGet your shit together. It's obvious you put no more thought into this than registering your desire to sleep next to her, *even though you know this is a consistent problem for you*. \n\nYou didn't suddenly become starving in 10 minutes. You didn't bother to ensure you were actually prepared to go to sleep before you came to the bed, **knowing** that getting up and down would wake her. \n\nYou know why little kids have bedtime routines? To teach their little bodies when it's time to sleep and the habits they need to ensure they are well prepared for a full night's sleep. I can guarantee that your \"trouble sleeping\" ass doesn't bother filling a night time routine, doesn't stop screen time hours before bed, doesn't practice good sleep hygiene, or take any actual steps to solve your problem. You just selfishly make it your wife's problem too. YTA", ">...because she could just as easily use a spare room if she has trouble sleeping.\n\nSo can you? \n\nYTA", "Why are you the only one paying the rent? And why with both of your sleep issues do you all insist on sharing a bedroom? With both your sleep issues you have no business sharing a bedroom. ESH. Stop paying for everything and sharing a bedroom.", "Maybe you should sleep in the dog kennel!", "YTA\n\nI have trouble sleeping and often need to walk around during the night to relieve pains.  I wait though for my partner to be asleep asleep before I even think about moving. I could be starving and in pain but will wait for them and then be as quiet as I can. If I need to eat it’s quick foods that don’t require any cooking. I keep options in the fridge in quiet containers or ziplocks so I can get a bite or two.  If I know it’ll be a bad night I’ll stick to the couch to avoid the in and out that may wake my partner. Of course my partner still wakes once in a while but no where near the sounds of your girlfriend.  \n\nYou are being selfish thinking your needs are more important than hers.", "Ynta if you pay all the rent you deserve to sleep in the master bedroom. although, maybe if she has work in the morning, let her sleep there and take the spare bedroom.", "YTA. You regularly wake her up. You're banging pots and pans after she's in bed. You're going in and out while she's trying to sleep. You sound like an exhausting and really inconsiderate partner. And you have to go to bed to realize you're too hungry to sleep? Grow up. She needs her sleep, man. Tired people get angry quick. And you could avoid all this, but you don't. You are absolutely the A H in this situation.", "YTA, and I’m saying this as someone who has had chronic insomnia most of their life. Literally, from the age of like 5 to the age of 25, and then again on and off over the last few years. Your girlfriend is absolutely right, and you are absolutely an asshole.\n\nI have always tried my best to ensure I don’t disrupt anyone else’s sleep. There’s been one time I disrupted someone else’s sleep: I was 19 and hadn’t been able to sleep for almost a week, and I was pacing to try and wear myself out, which woke up my roommate. I was hugely embarassed, and apologised profusely, and made it a point not to disrupt their sleep again. I’m currently dealing with insomnia *right now*, and I am pointedly *not* making it the problem of anyone else in my house.\n\nYour insomnia is *your* problem to deal with. You should *not* be making it your girlfriend’s problem. *You* need to take responsibility. *You* need to seek treatment. In the meantime, *you* need to make sure that the only person whose sleep is disrupted by *your* insomnia is *you*. You’re 30 years old, ffs: adult up.", "INFO: How do you think will eating late at night help to fall asleep? This is a really really really bad idea.", "You wanted to sleep in the same bed but got up again after only ten minutes? You sound all over the place and very disruptive, I’d kick you out too. Sleep in a different room dude. YTA.\n\nAlso why even mention you pay the rent? The fuck does that have to do with her just needing a normal night sleep? You paying the rent doesn’t mean you can be an asshole and do whatever you want.", "And while I can understand the ignorance of how loud/disturbing you can be getting out of bed, or leaving/entering a room, OP admits that going into the room can wake her up… let alone BANGING POTS AND CUPBOARDS.\n\nOP’s argument is also so fucking one sided bullshit.\nShe can use the spare because SHE can’t sleep??? WHO’S THE ASSHOLE KEEPING HER UP?\n\nGoddamn, fuck OP", "Because she was ALREADY in bed, YTA. She didn’t initially occupy and then lock you out of the room. She was already asleep and you didn’t do as well as you hoped with sleeping together.", "Your behavior would be an instant relationship killer for me. If you're having trouble sleeping, deal with it yourself by seeing a doctor, using a sleep aid, or going to the other room and staying there. Don't make your partner suffer along with you. YTA", "YTA what u did was childish and immature. The only reason she was having a problem sleeping was because of u constantly making noise or moving. Ur lucky all she did was lock the door in her sleep deprived state and nothing worst. I’m also a light sleeper a very light sleeper actually I wake up to the smallest sound or movement. I can be lightly walking quietly pass my door and it will wake me up but after being woken up multiple time it can take me 2-3 hours to be able to fall back sleep. That’s if I haven’t got to the point of being too frustrated to sleep. What astounds me is how inconsiderate u r and ur lack of ability to stay in the bedroom and to lay still. Why should she have get up out of a bed that she comfortable in to move to another room she doesn’t have a sleeping problem u were disturbing her sleep. I find it sad that my niece 5 and my nephew 7 are way more considerate and have more discipline than a 30 yr old man when they want to have a movie slumber party with auntie they always ask me if they can bring drinks and snacks in my room. Then they tell me they’re going to bring juice or water drink and quiet snacks in a big ziplock bag  because they don’t wanna wake me up if I fall asleep but they also don’t want to wake each other up it they fall asleep because it’s not nice.", "I wake up at 1 to 4 every day. I try to keep my work clothes in the living room. So when I'm getting ready for work I'm not noisy. If im hungry I'll eat a pickle or some pepperoni or something I can nuke. And I'm on the couch Tull 5 when I'm getting up. It's not hard . And I gently close the door before I turn on lights. Also toast and bagels are easy. And one quick toaster pop noise isn't that bad", "YTA. Take some magnesium.", "I was actually going to defend OP. Being an insomniac is a disability. You simply can not function without sufficient sleep.  \n\n\nEveryone deserves sleep. and if your insomnia is keeping her awake, then you are unfair to her. You should consider separate beds or separate rooms.", "Jeez you all are insufferable in this thread… ETA. I think the gf is childish for locking the door since that was the issue that sparked this post. I’m not sure how long yall have been living together, but if this has been an ongoing issue and she’s THAT bothered by your sleep cycle, a conversation needs to be had about indefinite sleeping arrangements. I can’t see how anyone can go even weeks of disjointed sleep without looking for a permanent resolution. You should probably get checked out or something because it cannot be healthy for either one of you to have such low quality sleep.", "YTA. It’s not her fault that you have insomnia. Once you leave the bedroom, you should probably just stay in a spare room the rest of the night. She needs her sleep and so do you so you both can be healthy! See a doctor about the insomnia. There are medications that can really help and are worth trying for the sake of your relationship. Also, it’s not cool to point out that you pay her share of the rent during this type of issue, especially since you’re the problem….That’s just mean.", "I don’t function well without a lot of sleep (oh my god, having kids has been hard.) I really wish the idea of sleeping in separate rooms would normalize. You guys sound like wonderful candidates for just officially having separate rooms. It’s not a comment on your relationship, it just sees much more practical.\n\nIn this instance, definitely YTA. (Though locking you out is also not great, but no one can be expected to be their most loving and rational in the middle of the night.)", "YTA, and I hope she leaves you based on how you are starting to use finances against her as a means of control, and that you felt justified in depriving someone of sleep because you wanted something. Gross.", "YTA. Let the women sleep for fucks sake. Just because it's a shared room doesn't give you the right to continually wake her up. You act like you don't care about her", "YTA you know your inability to sleep causes her to suffer too and yet you continue to insist on making her miserable alongside you instead of being a decent person who actually tries not to disturb others and deals with their problems in a way that doesn't hurt others. She had every right to kick you out of the bedroom and honestly I don't think you should ever share where you sleep with her if you actually care about her well being. You suffer so you want her to suffer too.", "Comparing the consequences of each of y'all's side in this conflict, her need outweighs yours and thus she has a greater right to be upset.\n\nShe has a need for restful sleep, which is interrupted by your nighttime disruptions in the bedroom. Disrupted sleep has consequences to a person's health. It is a necessity, not a want.\n\nYou have a want to sleep in a specific bedroom and other beds are available. It is not a necessity, but a want. \n\nYou both have a right to be upset with each other: you for disrupting her sleep, and she for banning you from a shared room. However her needs outweigh your wants and thus she has more of a right to be upset and do a strong action than you do. IMO she had a right to bar you from the room that night to resolve the issue. \n\nThis isn't sustainable though. Y'all both have a reasonable expectation to be able to sleep together in the shared bedroom. She has limited options to accommodate your insomniac behaviors: she can put in earplugs or put on noise cancelling earmuffs or turn on a white noise machine. But this is limited in effectiveness because your jostling of the bed getting up and coming back in can't be solved by earplugs. An option to think about for the time being is to sleep in separate beds and she uses some noise-dampening solution.\n\nYou, OP, have to figure out what your problem with sleeping is. Judging by you going to bed hungry and wanting to eat at night, I suspect it is primarily behavioral more than it is medical. But it's your problem to solve, and your problem that is causing this conflict. \n\nYTA: she's not at fault for this conflict, her actions were warranted to attempt to ensure she got her need for sleep met, and you don't have a right to be angry at her when you're regularly disrupting her sleep. Sleep problems aren't easy to solve so I empathize with you. But you need to prioritize fixing it, for the sake of your relationship and your own health. Good luck", "You woke her up by being clumsy in the kitchen and then have the audacity to be pissy when she doesn't want you back in the shared bedroom?\n\nYou got out of the bed to feed yourself, so why should she be the one to go to another room?\n\nYTA and I feel sorry for your partner.", "Not only are YTA, but you’re a 30 year old child who pitched a fit when he didn’t get his way.\n\nApologize to her, sign up for a sleep study, and grow the fuck up.", "YTA.", "How do you not think that your own behavior is not disrespectful or “fair”? Why are you only focusing on hers? \n\nIf my husband constantly kept me up at night and even went as far to pound on the door like a child, I would be upset too. \n\nYTA", "YTA. Multiple bedrooms and the ability to discern hunger yet walking her up and getting out of bed minutes after you got in. That’s not insomnia and it sounds like you’re just one of those people who is also noisy because you can’t be bothered to remember to be careful and quiet for others.\n\n“Last night I felt like maybe I won’t wake her up this time so instead of let her sleeping on her own just in case I woke up I just went in there and woke her up ten minutes after I got in. I then banged cupboards and pots because I wasn’t considering that she is a light sleeper or that it’s, you know, nighttime. Because I pay the rent I felt the need to deprive her of sleep and start an unnecessary fight to exert power over her. Instead of being a caring partner and sleeping in one of the other bedrooms I kept her awake with more noise for a power trip because even though she wasn’t actually having trouble sleeping and it was just me making noise, she needed to be punished. AITA for waking her up and kicking her out of the bedroom so I could sleep in there and she got less sleep?”", "You can’t be this dense right? You’re making a ton of noise in the middle of the night waking up your partner and when she calls you out you double down and instead of moving to a different room you pound on the door till she lets you in. YTA for sure.", "Dude, you are such an YTA. This whole post screams how selfish you are. YOU are the one who has trouble sleeping, not her. So be a good partner and be better about accommodating. So if you don’t want to sleep together does that mean 1) you both choose to sleep in a spare bedroom so that someone isn’t getting the master, or 2) because you pay the bills you should automatically should get the master? \n\nThis is not a partnership. You pay the bills, so it’s your house, your master bedroom, and she just needs to deal with your sleep issues and childish behavior. \n\nI deal with a SO that snores. I don’t wake them up to go somewhere else… why should both of us be awake? I quietly remove myself so as not to disturb them so I can get better sleep.", "YTA- and you’re going to be single soon if you keep acting like this. Grow up.", "YTA. Set a reasonable boundary for yourself (10:30 pm?), and if you’re not asleep after that, do not enter the room where your girlfriend is sleeping. Stop waking her up and making her life a living hell.\n\n\nShe shouldn’t have locked the door… because she should be able to trust that you won’t screw with her sleep by coming back in and out all night.", "Geez - this can’t be a serious question.  They are both petty", "Lemme get this right - you laid down next to your gf because you felt you could SLEEP but then within 10 minutes you decided you needed a MEAL? \n\nThis sounds incredibly impulsive. \n\nYou could JUST as easily as her go sleep in a spare room since you were the one having trouble with hunger and sleeping! \n\nYou're going to get dumped for torturing her by keeping her awake. \n\nYTA", "YTA - it's absolutely apparent by making a point to point out you pay all the rent. That has zero to do with allowing your partner to sleep.", "Bro that’s literally psychological abuse, yta", "Bruh, I'm a heavy sleeper (ty klonapin) and I'd kick you from the bed.", "You decided you wanted to sleep with her, then continued to wake her up and torture her as soon as you got in bed, you didn’t even TRY to let her sleep\nor make it through the night. I doubt you needed to cook something that badly 10 minutes after laying down, knowing you were going to keep her up. \n\nThese don’t sound like sleep problems, they sound like you-being-selfish problems. Have you even tried anything to fix your sleep routine? It doesn’t sound like you have much care at all for when you’re keeping her up. You say that you know she has to work early, and you BANGED on the door in the middle of the night because she wanted to sleep alone and get away from you, knowing you were about to keep her up all night. just to have her leave and not even sleep in the same room as her anyway. the whole “i pay rent for that room i have a RIGHT to it” thing is bullshit. that was some malicious ego shit. YTA.", "YTA man. You're the one with the problem sleeping, dont force that on your gf. Doesn't matter if you pay the bills or not. You even have a solution you already use, which is sleep in the spare rooms.\n\nIt also doesn't sound like you're doing anything to fix this issue. Are you? Sleeping pills, therapy, doctors? You're going to destroy your own relationship. There's a good chance you already have.\n\nAnd who goes to bed and then gets up to eat? Weird. Have dinner later if you have to. Night snacking is bad for you.", "If there is a problem in a relationship, you find a way to deal with it.  That is pretty basic adulting.  You have chosen not to do that and your girlfriend is paying the price.    \n\n\nAll you have to do is Google \"insomnia\".  A reasonable person would probably start with 10mg of OTC melatonin followed by 50mg of diphenhydramine/Benadryl.  If those don't work, then schedule a doctor appointment.  \n\n\nYeah locking you out wasn't maybe wasn't the best option, but you've shown little consideration for her ... and eventually sleep deprived people will snap.  Rather than stepping back and looking at the situation from an adult perspective, you chose to react emotionally by pounding on the bedroom door until you got what you wanted.  Why would she have any reason to trust you to act like an adult male from here on out?", "YTA. I have insomnia and sleep issues too, which has disturbed my partner in the past. We worked together to figure out some solutions, including setting up a bed in the spare room for nights when my insomnia is bad but he needs to get up early for work the next morning.\n\nIt sounds like you have plenty of space and options, you just aren't utilizing them, and it's at your girlfriend's expense.\n\nJust because you pay the entire rent doesn't mean you have the right to be inconsiderate towards your girlfriend and her basic needs.", "You are genuinely asking?\n\nYTA for banging on the door after knowing you had already woken her up once banging around the kitchen \n\nYTA for deciding her needs didn't matter because YOU wanted to sleep with her\n\nYTA big time for the attitude that she should be subservient to you because you pay the rent. Is she your girlfriend or a thing you own? Not OK dude.", "How is this about an actual adult? So many people are acting absolutely childish and then wondering if they are AH? \nThe whole line about how you pay all the rent so you're entitled to the shared bedroom told me everything we needed to know. You sound like a selfish baby. YTA.", "YTA. Stop waking your gf up because you are being selfish.", "yta. go to a doctor if your insomnia this bad and you can't manage not to make it your girlfriend's problem", "My husband and I have been married for 20 years, and this has always been a problem for us. We have very different sleep schedules, and he's a light sleeper. I'm a night owl, while he goes to bed no later than 10 pm. When I would finally come to bed no matter how quiet I was, I would still end up waking him up! When we finally moved to a situation where we had a spare bedroom, I started sleeping there. Our relationship has never been better!! YTA!", "YTA, you proved within 10 minutes of trying to sleep in the same room that you weren't going to let her get any sleep. Also, what snack would involve needing pots and pans?!? She locked you out because she likely knew she'd fall asleep while you were cooking whatever the heck you were making, then would come in and wake her up, then likely toss and turn as you were now awake from eating and then leave again.\n\nYou need to accept that once you leave the bedroom, you don't come back.", "Sounds like op  needs a schedule.  A time to wake up and times to eat so he's not hungry at bed time. Eating will not help if you are already having trouble sleeping.  Try eating before you plan to sleep. Also if my partner did what you do on the regular I'd be going nuts.", "YTA man. It's not a one time thing. It's constant. She is building up that stress inside of her longer than anyone would be able to handle. Go get some treatment for your sleep, some medicine, CBD, hit a joint, whatever. But while you don't, just go straight to the spare bedroom when shes ready to sleep. And don't bring the \" I pay full rent\", it really doesn't help your case.", "YTA. I'm in a situation where I'm going to dump someone over them not letting me sleep. Your wants aren't above someone else's needs.", "Yikes big dog.  This ain't it", "You pay the rent so you get to disturb her sleep? Seriously? You feel that makes it justified? Yeah, no. I mean, you even said you have two spare bedrooms and usually sleep elsewhere, so this is all on you. \n\nAlso, you for some strange reason expected her to believe that you wouldn’t bother her anymore after you came back because you “felt” like you would be able to sleep, but this was after you had laid there for a grand total of 10 minutes and then needed to go make food. Why on earth would sue believe you after that? \n\nYTA. You sound difficult.", "Imagine being glad that you finally fell asleep only to be woken up by your partner reenact the kitchen scene from High School Musical 2, who then continues to BANG ON YOUR DOOR.\n\nAs the partner of a light-sleeper, YTA YTA YTA and bless your girlfriend for settling with you. Paying the rent does not give you extra rights, that´s not how relationships work.", "YTA and frankly this is abusive. She needs sleep, she’s not your stuffed comfort toy. Grow up and go sleep somewhere else. Get help for your sleep issues, noise is noise, and she is probably not a light sleeper, your shenanigans would wake anyone.  Good thing you pay the rent because I can see this relationship won’t last.", ">I pay both our rent \n\nAs a fellow man I have to tell you: Whatever the financial arrangement, THIS NEVER GIVES YOU ANY MORE RIGHT than your partner and you should NEVER BRING IT UP. For whatever reason.\n\nJust for bringing this up YTA. Also you have sleeping arrangements, respect them if you respect your partner. If you need time with her in the bed, then spend some with her before she needs to sleep.", "Yta", "JFC YTA\n\nGrow up and stop being so damn selfish. \n\nWhy did you need to get back into the master so badly you got physical with a *door* and started an argument. That would be awful on any night… but you *knew* she needed to be up early…", "Except the oaying the tent thing... wait! I read cats pay.with purrs!", "Yta\n\nShes going to break up with you soon enough if you keep up this shit", "Really weird that you brought up how you pay the rent when I'm sure she's also paying for things I assume you've agreed on. Care about someone other than yourself for two seconds if you want to keep your girlfriend. YTA.", "YTA. You are making your sleeping problems her problem. That’s not fair. You said yourself that their are other places you can sleep", "YTA. I would be shocked if she ever sleeps in the main room again.", "What are you, a cat? Up, down, in, out... Dude, respect your partner's need for sleep, pick a room, and stick to it. YTA.", "YTA. My husband and I have what we call opposite insomnia. I will stare at the ceiling for hours trying to fall asleep, but once I’m out I sleep pretty solid. He falls asleep within 5 minutes of turning out the light but wakes up at the slightest noise and will be up multiple times a night. We go to bed quite early, just so we can both piece together 7 or so hours a night. We also learned to be considerate of each other. If I know I’m having a hard time falling asleep, I’ll either read on Kindle night mode or move to the couch so I don’t wake him up every time I toss and turn trying to fall asleep. If he’s waking up multiple times a night, he will do the same to not wake me up(and the dog, and the cats,etc). \nWe don’t even have multiple spare rooms and we have figured it out. \n\nIf you think you’re entitled to more or better quality of sleep than your partner, that’s the problem.", "Question: have you seen a doctor or tried medication for your sleep issues? If not then YTA for making her deal with this when it can likely be remedied, take some melatonin or thc, don’t act like this is normal or acceptable behavior. If you have seen doctors and the problems persist then YTA for trying to sleep with her knowing you haven’t recovered from your issues. \n\nGrow up and start taking care of yourself.", "YTA.\n\nSleep deprivation is a form of torture. Congrats on torturing your GF, instead of a) sleeping somewhere else, b) getting some help with those sleep issues, c) apologizing and actually trying to do better instead of just handwaving away your \"clumsiness\" and \"accidental noisemaking\", or d) all of the above.\n\nGF, if you see this post - you can do better. A body pillow, for example, has none of the above issues. Body pillows aren't self-centered abusive assholes.", "My dude, my husband is a light sleeper and I am clumsy as fuck. I’m talking hot mess level of clumsy. AND I have a joint disorder that sometimes makes movement complicated for me. You know what I don’t do because I’m a considerate partner? I work extra super hard to control my clumsiness so I don’t wake him up. I don’t believe for a second you actually put a lot of effort into being quiet at night. YTA", "YTA\n\nYou sound insufferable, exhausting, selfish and i wouldn't want to live with you, not for free, not even if you would pay me to live with you. \n\nGoing to bed and 10 mins later you are \"too hungry to sleep\". Are you a toddler? Thats the dumbest thing ever. And btw, eating gives your body energy and the body has to work. how would this help getting a good nightsleep if you pump up your body before bed? You are doing everything wrong that is needed for a good night sleep - and then you are whining about your insomnia? Sure... smh\n\nI hope your gf finds a better place to live.", "YTA,\n\nI'm a light sleeper too and this wouldn't fly. Sleep in another room.", "ESH. Your insomnia is yours alone to deal with, but you are making it her problem. She sucks because she locked you out of a shared space. \n\nIt is SUCH a pet peeve when one person in a couple tries to stop the other from sleeping in their shared bed. You're mad? Fine, YOU leave and sleep elsewhere; you have no right to kick someone out of their bed. While OP has other places to sleep, she locked them out of a shared room. Didn't even tell them, they had to hear the lock.", "YTA, anyone who at anytime keeps someone from sleeping/ disturbs someone’s sleep is ALWAYS TA. Ngl, if I was her you’d be single as a Pringle buddy!", "YTA. You paying rent is irrelevant to the fact that you keep waking her up. Why should she go to a different room if you're the one that can't sleep normally? Instead of understanding that she needs sleep before waking up for work, you decided to flex your \"rent payer\" muscles by pounding on the door. Ridiculous. Go get a sleep study done so your poor GF can sleep in peace.", "A bedroom door lock is the easiest thing to pick", "YTA honestly this is grounds for breaking up. As someone who's a light sleeper, having to deal with someone getting up and in bed multiple times a night would drive me insane. It would effect my wellbeing for sure, it's torture honestly. You are extremely inconsiderate and selfish,  your poor girlfriend. Major YTA, how are you 30 years old and can't comprehend why this is not okay to do???", "YTA. You had somewhere else to sleep, you aren't being fair. I don't know about her locking the door BUT if this is an ongoing continuous problem then I can see why she did it. Maybe one of the spare rooms should be yours or her room and you can sleep seperate? Either way it needs to be talked about.", "YTA - you could of easily have gone to the spare bedroom and left her alone, but no! It’s all about what you wanted! So selfish! So controlling!", "OP it is awesone that you pay the rent by yourself!! Because very soon you wil be the only one in this apartnent. \nYTA.\nIf you do not have to work or you sleep or nap  daytine after keeping your GF awake when she is suupposed to put in a week of work .   \nYeah been there done that . You don't have to rise early to work two jobs? Good for you!\nYou don't have to rise early to work two jobs but spend your nights keeping me awake when I do? Despite me communicating my essential needs?\nCongratulations, you are now an ex \n\nNot only are you TA- you are astonishlingly cluless. \nNoone owes you to give up their sleep once you stopoed being a baby. I öiterslly cannot stop laughing atgm your behaviour. You REALLY need a full time job starting early every morning.", "YTA - and a big one at that.\nYou felt that she was disrespectful to lock the door?\nYou came into the room when she was asleep, tossed and turned, got up to leave, went to the kitchen to bang around and then banged on the door when she smartly locked it?? \nThe audacity and entitlement from you is through the roof.\nYou could have gone to the spare room, the couch or your office that you state you have used before.\nYou knew she had to work the next day and yet you continued to keep banging around waking her up. You are the disrespectful one, not her.\n\nYou need to see a Dr if you are waking up at all hours of the night, this is not normal. OP you sound like a nightmare to deal with, figure your stuff out, or you are going to be sleeping alone in all your rooms when your gf realizes that you aren’t worth her losing anymore sleep.", "The man is selfish", ">because she could just as easily use a spare room if she has trouble sleeping.\n\nYOU could just as easily use a spare room if YOU have trouble sleeping. YTA", "YTA. I've been married well over 30 years. My wife is a light sleeper. I'm a restless sleeper. I have to be up at 5:30 am for work, far earlier than she does. \n\nWe spend time together in the master bedroom. When it's time to go to sleep, I go to the guest room. I can keep it colder than she likes, I don't have to worry about waking her up, and everyone is far happier having gotten some good rest. \n\nAnyone that tells you that couples who sleep separate are in trouble are lying. However you get along the best with your partner, whatever you both agree on, that's the best for your relationship.", "Sleep deprivation is a major tactic of abusers.\n\nJust saying.\n\nYTA", "Not going to win bro", "\"I pay the rent so I can do whatever I want\" is all I read here, YTA YTA YTA YTA grow the hell up and respect someone's right to sleep no matter what your rent situation is.", "YTA. You have separate bedrooms. Use them.\n\nListen, I know people have a weird hang up about sharing a bed with their SO, but if either of you is keeping the other awake, sharing isn’t an option. Your relationship will be better when BOTH of you get a good night’s sleep. Being exhausted from being kept up all night will cause issues. Learn your respective sleep habits, and respect them.", "dude, do you really need an answer on this one?\n\nYes, YTA", "YTA- go to a doctor about your sleep issues and let your gf sleep. I’m surprised she even can sleep", "‘I can be clumsy or not light on my feet’ \n\nYTA stay out of the shared bedroom while you partner is asleep if you know you’re so clumsy. \n\nI also have a hard time believing you can be so clumsy repeatedly. There has so be some sort of passive aggressiveness or selfishness combined with this. It’s not hard to walk quietly into a room unless you have a disability that you haven’t mentioned. \n\nYou pay rent and rent for a shared bedroom means you don’t wake up the people sleeping in the bedroom. You don’t pay for the ability to deprive them of sleep.", "YTA. sleep is important, but even more than that, this post drips with disrespect and disregard for your GF. I wouldn't be surprised if she left you.", "YTA\n\nI would lock you out the house. Why do you think you are entitled to wake her up, not 1 but 2 times!?!?\nShe is not the problem, you are.", "If OP knows what it is like to note be able to sleep, he should really understand how important sleep is and do everything he can to let his girlfriend get a restful night of wonderful sleep. \nMajor AH.", "You clearly don't care for your girlfriend enough to care about her well-being and needs. You keep disturbing her with your sleep issues, and it sounds like you don't even care about how she feels. You need some serious help with your sleep issues so you can stop disturbing her. \n\nYTA", "YTA.\nI would pack my things and say bye bye.", "I’m a light sleeper and not a good sleeper at all. My partner generally sleeps like the dead, but he drives an 18-wheeler, so needs to be sharp. When I’m fidgety, I give myself about 15 minutes and if I can’t settle, I sleep on the sofa.\nBecause I’m a considerate partner and not a monster.", "I really don't understand how the fuck I'm still single yet absolute weapons like OP manage to find partners. I can't even.\n\nYTA", "Yeah YTA", "YTA", "Yta. For this post and for not answering any comments.", "NTA, I agree it was rude to lock you out of the master, she could have gone to either of the spare bedrooms as well if she wanted absolute quiet. However, the fact that you pay both your rent plays no part in this and imo it’s low to mention it.", "YTA. Obviously. I think you need to re-read what you just wrote and maybe you’ll figure it out.", "How the fuck do you not realize you’re hungry before going to bed. Are you 5? YTA", "YTA and I know how your girlfriend feels.  My husband frequently has trouble sleeping and often he will sleep in the family room.  But just as often he will come to bed and either toss and turn or make noises waking me up.  It is awful and I end up feeling exhausted the next day because I will have ended up with about 3 hours of real sleep if I am lucky.  I finally had a talk with him about it recently and he has made more of an effort to either stay in the family room or be quiet and more still when he comes to bed.\n\nYour girlfriend NEEDS to be able to sleep, it is actually bad for your health to not get enough sleep.  Be better OP.", "My husband cooks in the middle of the night. Make a damn sandwich. Drives me crazy. At least he finally realized coming to bed 3 hours after me and snoring was not okay and sleeps in a separate room. I love him but - just no.\nYTA", "YTA and a self centered jerk.  Happy?  You knew you were keeping her up, you knew she had to get up early for work and you didn’t give a f###.  You only care about yourself.  I hope she leaves you.", "NTA you cannot be that light sleeper and share a bedroom with someone.", "YTA. \n\nDon’t care if you pay all the bills or not, if you’re regularly waking her up and think that’s the ultimate defense you can go fornicate with an iron rod. \n\nMy partner is a pretty light sleeper and if I am having a hard time falling asleep (usually asthma or blood sugar related) I’ll end up sleeping on the couch that day because I know I’m likely going to toss and turn and hit the restroom multiple times during the night. \n\nIt’s my house (they’re not on the deed or any of the bills) and I still respect them enough to crash downstairs - no reason both of us should be miserable the next day.", "YTA. Why is she with you? You clearly think very little of her, her health, happiness or safety.\n\nI wonder how many times she's been drowsy driving... or yawning at work (which will stunt any promotions and make people think she's lazy, sickly or too irresponsible to go TF to bed)\n\nYou clearly care nothing for her. Let her go man. \n\nMy own dear hubs gets up to pee multiple times. He tosses and turns etc. so I have my own room now. I *need* my sleep or my mental health gets so bad I can't function.", "OP pays the rent. NTA", "YTA. Not to bright either by the sound of things. Try melatonin, HTP-5, lettuce water, exercise and get your sleep under control before you turn your poor partner into an insomniac", "I have issues sleeping like this sometimes, as does my husband. \nSorry to say though, YTA. \nNot for wanting to sleep with her, but after you realized that tonight wasn’t going to be the right night, you continually tried to force the situation. If you weren’t the first person to go to sleep, I’d say you should be the one to go to one of the other bedrooms. \nShe’s already asleep and you know going back in will wake her, yet you didn’t choose to go to another room yourself because you wanted to sleep with her. It’s not a matter of your preference when it interferes with your partner’s sleep schedule and subsequently their job performance. I don’t think it’s fair to say “she could go to one of the other rooms if she was having problems sleeping.” She wasn’t having trouble sleeping until created the situation that made her unable to do so. I don’t see the reason for bringing up the fact that you pay half of the rent when she locked you out of a shared space as well. You know why she did it, it wasn’t out of malicious intent to keep you out for no discernible reason.", "YTA.  You know you wake her up and have done nothing to resolve the issue.  Sleep in the spare bedroom and try thinking about someone other than yourself.  Sleep in necessary to your GF.  You are not.", "I got so angry reading that your reasoning to this behaviour is that you pay the rent. Ughh. YTA.", "YTA\n\nGet some damn help for your sleeping issues!  Your girlfriend is suffering because YOU can't be bothered to do anything other than relocate.  I doubt you're as quiet as you think you are, which adds to the problem.  There's a reason sleep deprivation is used as a torture technique.\n\nYou're 30 years old.  It's past time for you to be responsible for your health.\n\nGo to the doctor.", "Yta. Interrupted sleep is horrific. You sound selfish af", "YTA, you enormous infant. I really hope she sees this as the prompt she needs to find a grown up partner.", "ESH. If this is such an ordeal for, she should have gone to another room. On his part, he’s just clueless", "YTA\n\nYou need to have a sit down with your partner about what can be done other then the extra rooms because obviously that’s not working for you. \n\nI suggest taking sleep meds if you simply just can’t sleep. If you feel hungry I’m sure there are quiet snacks or leftovers you can eat that don’t involve messing with pots and pans. Staying clear of anything that could make a loud noise even. You have to respect your partner. She also lives there and have a right to sleep peacefully like you. \n\nBanging on the door was unnecessary. I get your were upset but you already upset your partner. You should’ve known this would make the situation worse. That was manipulative, even if you didn’t mean for it to be, because you knew she  wouldn’t be able to sleep. You most likely just lost respect for the way you acted because you could’ve easily went to the your other room after you left the shared bedroom. It seems like your damaging your own relationship bud.", "YTA, you sound annoying. You thought you could sleep through the night so you got in bed then after only 10 MINUTES you decided you were too hungry to sleep and had to full blown cook a meal bringing out pots and pans? This straight up sounds like everyone’s college roommate horror story, and like that bad roommate, your selfishness makes you think the sun revolves around you.", "YTA. My husband also has trouble sleeping. He doesn’t sleep in our shared bed if he thinks he’s gonna wake me up. It’s real simple. We don’t fight or argue about it. He respects me.", "This was a control issue on both sides. Y'all need to work on your sleeping arrangements, whether in the same or separate bedrooms. This is not functional whatsoever. ESH.", "NTA.  And I wouldn't live with someone who wasn't paying rent.  That's a little bit your own fault there.  Unless you're one of those controlling types who feels threatened by your partner pitching in financially, which I'm only assuming isn't the case.  She can very easily grab another room.  While thanking you for the free rent.", "God, what an a-hole. He's hungry after 10 minutes of lying in bed. 30 years old. I hope she leaves his ass.", "The OP being a cat is the only way this post makes sense.", "“Am I the cathole?” —OP", "Because he pays the rent.", "The best thing my parents ever did for their relationship was decide to have separate bedrooms.  \n\nMy mom is a crazy light sleeper, she goes to bed at 9 and wake up a 5. My dads always on call, goes to bed at midnight and his snores penetrate through flooring. \n\nSleep is so important and it’s okay to not co-sleep if it means your not rested.", "Not to mention, if 10 minutes after going to bed you're getting up because you're hungry, that's not insomnia, just poor sleep hygiene. OP, take 10 minutes to Google \"sleep hygiene\" and attempt to follow it. Your behaviors sound more like a young adult who just moved out of his parent's house and is enjoying being able to do what you want rather than a 30 yo.", "True, but she had no right locking him out of the room. he can't control his sleeping issue, and that shouldn't stop him from wanting to be close to his partner.", "I bet he also sets multiple alarms in the morning and hits snooze over and over while she desperately wants more sleep.", "TBF thats every post on here.", "It's totally his fault for banging a pot. Dude decided to cook a meal ffs. 😂", "I honestly can't think of a single time EVER where I've gone to bed and then realised I'm too hungry to sleep and had to get up to make food... I think it's normal that your digestion and appetite shuts down when you go to bed. I even remember when I was young we would go to bed early if we were hungry as the hunger would go away.", "Trying to find a good place in here to suggest OP and his partner invest in white noise machines (the Marpac/Dohm classic ones are my favorite).  I'm a super light sleeper (also an insomniac) and white noise machines have helped me be a more patient roommate.", "Except locking the door ensures she wakes up again. Does she think he's not going to try and open the door?", "Sounds like \"I do not have to rise early and I am bored. Why isn't she up entertaining me? I can fix that!\" to me.", "You sound... stable", "Why are you with this guy? If sleep is this unnecessary to him he can drive you. If it is not that is all you needcto know about him. Yuck. Repulsive.", "Could be a dog, although they’re not as into knocking pots off counters.", "😂😂😂", "He needs to do more than grovel. He needs to get help and work on seeing his gf as an actual person, not a commodity", "Her locking him out of their room is stupid and shortsighted. This is a clear ESH", "Yep who cares about the guy that can’t sleep and pays all the rent? Reddit at it’s finest.", "Right?! Midnight snacking calls for night cheese. \n\nOnce he realized he wasn't going to just settle in to sleep, he should have just gone to the spare room instead of punishing her for the temerity of locking him out to indicate he was waking her up over and over.", "Maybe he doesn't sleep well because he eats too much, too late and then has heartburn!", "Needles to say more.", "Me and my wife have slept separately for the last 10 years because we disturb each other's sleep. Sure we fall asleep together on occasion but whoever Wales up first just goes to another bedroom. It works for us", "My SIL says she and her husband don't sleep in the same room either. The snoring was unbearable. \n\nTwo beds, happy marriage.", "Im a huge believer in separate bedrooms if either person struggles to sleep with the other there. I’m very happy for your parents. Your dad might want to get tested for apnoea if his snoring is that loud. Mine’s horrendous and it turned out that’s what was happening.\n\nAlso YTA OP", "I hear you!  Been married 20+ years and husband now snores.  We don't have a spare bedroom and finally bought a pull out sofa.  A true marriage saver!  I love him but that doesn't mean I'm willing to go without a full night's sleep for weeks.", "This mentality always angers me. Like what, do you think because you pay rent you bought some rights to her, so much that you get complete control over her sleeping arrangement?", "Oh this made me laugh!!", "So just fuck her need to sleep then right?", "With his behavior...i would be amazed if she was EVER interested in adult bed time.\n\nEdit for an oops", "True, I guess I was thinking that he bumped into a pot, not that he was using a pot, but that could totally be the case. If OP is getting up to cook something in a pot, even more of an AH.", "Ultimate r/usernamechecksout . Although cats sometimes think they might be assholes, it's always proven that's not the case, as you can see in r/AmItheCloaca", ">Like, eat a meal at a reasonable time so you're not hungry at bedtime.\n\nThat or if he does need to eat then grab some fruit, or a granola bar, or hell just make a freaking sandwich. He doesn't need to be making a racket cooking in the middle of the night when he can quietly grab a fucking snack.", "I think you are clearly deranged. YTA", "She doesn’t have sleep issues. She goes to sleep and stays that way unless some asshole bangs pots and pans around or constantly moves around.", "Her sleep issue is just… him.", "He’s her sleep issue.", "Did waking up his partner multiple times help him sleep somehow?", "What does rent have to do with it? He said himself that they have two extra bedrooms that are used regularly for this reason.", "Since he’s paying rent it’s ok to keep her up all night?  WTF kind of logic is that?  He was intentionally waking her up.  In and out of the bed, banging pots and pans in the kitchen, pounding on the door?  This is one of the few times Reddit got it right!", "Its", "Working on my night cheese 🎵", "Mmmm...night cheese...", "Or a lightly fried fish fillet.", "Who said anything about gender?  What in the high hell are you trying to reach for in this statement?", " Not contributing to rent doesn’t mean OPs partner has to suffer sleep deprivation…", "Exactly. If she was a leech taking advantage of him, there could be something to be said here about him drawing boundaries, but she's not? They've mutually decided on this arrangement, it's like saying partners who stay at home should have no rights within their household because they're not providing financially.", "lol. I agree!", "> I try as best I can to be quiet when I enter and exit, but sometimes I can be clumsy or not light on my feet, causing her to wake up.\n\nSounds like the guy might be literally tripping on the bed she's trying to sleep in\n\nPeople use words like \"coma\" if you *don't* wake up when someone kicks your bed", "Weirdly enough I have nightmares/bad dreams when I take melatonin.  I don’t know why.  It works like a charm for my husband.", "That’s quite the dramatic response, Lol.  \n\nAnyway, the gender dynamic was implied in your comment because you tried to bring up all the things that gf supposedly does in lieu of paying rent. That’s basically a gender argument. But you already know this😊", "How are you getting that from anything I said?", "I especially hate this way of thinking because it’s an entitlement that extends to other things as well. It’s like a man paying for a woman’s dinner and then expecting her to have sex with him. I remember in one of my college classes a woman from Nigeria saying that the tradition of the dowry for a hand in marriage was fading away because too many men would feel that they should be able to do what they want with their wife because they essentially bought her. He should not be thinking that just because he pays rent he should be able to essentially dictate her sleeping arrangements. It’s a sexist take. You did not buy her autonomy when you paid rent\n\nEdit: if you have a “my house, my rules” mentality with your partner, you obviously do not view them as an equal in the relationship, which is a core issue.", "I pay the rent so I can torture someone by keeping them awake is really a mind-blowing take from op.\n\nI've seen that type of take on here before where the person who either makes more money or pays for more thinks it gives them carte blanche to do whatever the f they want to anyone or anything. Still catches me off guard every time. Money inequality seems to cause brain rot in the decency/fair department.", "The thing that kills me is that he has this insight into himself but is still like \"I'm gonna do it anyway.\" Truly chaotic.", "Very true", "Hijacking this comment to mention to all the people that melatonin doesn’t work for (myself included) a double dose of magnesium right before bed knocks me the f out.", "Nightmares are actually a common side effect of melatonin it doesn't work for everyone.", "The person you are arguing with isn’t me. \n\nAlso, no I didn’t mention or imply gender - I’d say the same thing to anyone of any gender who made that argument. But it’s interesting you assume gender is a factor… \n\nAll we know is that she doesn’t pay towards rent, but she also works, so my question is what else is she contributing to? Who pays groceries? Utilities? For vehicles? It’s unlikely she didn’t contribute at all because if he paid for literally everything this AH would have made sure we know that. \n\nAnd I’m sorry but household labour IS a valuable and fair contribution to the costs and should be taken into consideration but is often overlooked by partners with this kind of mindset. \n\nIn a conversation about whether he *deserves* to do whatever he wants at night and expect her to behave the way he wants her to while he does whatever he wants at night because *he pays the rent and deserves the respect * what she contributes to the household via labour and finances is absolutely relevant. The fact that this AH had things falling down a stereotypical gender binary is irrelevant.", "When one partner works full time and the other doesn’t, it’s fairly commonplace for the one who has more hours at home to take on more household tasks. That has nothing to do with the genders of the people involved.\n\nBut you’re right, we don’t know what the gf contributes. She could be in school or severely disabled or be responsible for all bills except rent or she could sit around all day and do nothing. We don’t know.", "You brought up it was a bargain how else are we suppose to take that?\n\nDon’t say something and act shocked when we reply to it.", "Exactly!", "Hey, thanks for that. I’m not sure how accurate it is (not saying it isn’t, but I like to look into t everything I hear/see), because I have a medical condition that causes severe vitamin deficiency (I’m wearing a wig right now, because I’ve lost the majority of my hair…for the third time in 15 years). Magnesium/most vit Bs, Vit C, etc are some I have the most issues with, and melatonin has never, *ever* worked for me. I plan on looking into it further! Hope you’re right, because I have horrible sleep disturbances (usually from muscle spasms and cramping, but other things as well)", "It’s interesting that you assume that she works when there’s no mention of that.\n\nThe dichotomy between a provider of income and a domestic worker is almost always a male-female dynamic.  So, that’s where my assumption comes from.", "And that dynamic is almost always with the male being the provider and the female being the one in the home. Agreed that we don’t know what she contributes besides sex. Maybe she spends her days shopping.", "Dude. \n\n“… I decided I wanted to sleep with her. She had to work the next morning…”\n\nMaybe let the actual words in the post get past your inbuilt biases.\n\nAnd you are correct about that. But it’s not my fault that that is correct AND that that’s how this situation lies. That doesn’t change the fact that a lot more goes into maintaining a household than just paying the rent and that ALL of it is a contribution with an innate value. Just because I mention the fact that other contributions matter didn’t mean I’M making a gendered argument and even if I was, it would be relevant because that’s how this is here.", "And? Someone mentioning the existence of stay at home partners doesn’t mean they’re making a “gender argument,” whatever that means.", "Or, as the OP said in the literal post, she had to work in the morning.\n\nThat has nothing to do with gender. No matter what her job is, she had to work. She is also allowed to sleep. And even if her job is \"maintaining the household,\" gender is still irrelevant. Cooking, cleaning, laundry, all of that? Physical and emotional labor. Work. Overlooked, unpaid work.\n\n\"We don't know what she contributes besides sex. Maybe she spends her days shopping.\" That's just gross, you know. YOU are making it a gendered thing with that remark - the classic \"women be shopping\" and all. What a stereotype. So OP's girlfriend is, what, \"giving\" him sex and taking his money to shop? Even if that happened to be the case, should she not sleep?\n\nThat's a huge leap. Think it over.", "Sleep deprivation is torture. You are literally torturing your partner. YTA", "Jesus, you suck", "Yes, YTA.  Insomnia IS awful, and you have my sympathy over that, but imagine if YOU finally got to sleep and she started jumping up, making random noises, etc.  You already know that sleep is hard sometimes and you have no respect for her’s.  She can’t be rational in the middle of the night after being woken up because you went back to bed, then got up and cooked something!  Sleep disruptions like that cause despair.  She should not have to experience your sleeplessness.", "So you went to sleep with her, but within 10 minutes you decided you were hungry?  You sound exactly the way my 5 year old was when I would try to get him to bed. YATA", "I know I’m about to get downvoted but I’m gonna say it anyway.\n\nThe comments in this are sickening OP stated he has trouble sleeping. I have trouble sleeping too and can understand where he’s coming from. \n\nEveryone is poor gf this, light sleeper, let her sleep… she locked him out she could’ve easily gone to her spare room to sleep too. this dude probably hasn’t slept well in who knows. He tried to sleep and couldn’t. do you know how shitty it is to just lay there and try to sleep when you can’t? He wanted to eat, what does it matter what he wanted? Let the man eat.\n\nI think they’re both cranky from bad sleep and lost their cool. He shouldn’t have banged in the door. She shouldn’t have locked him out of his own room and then yelled at him later. No one was in the right here.", "ESH. Going against the mob mentality, she should have asked you in a better way to sleep in another room. Her locking the door after yelling at you got to you and I’m sure you guys got in a big fight over it.\n\nYTA more here because you should have let it slide and gone to sleep in another room", "Oh suck it up princess!  I have been married 38 years to what sounds like a fog horn right in my ear.  I got professional ear plugs.  If you are already locking him out of your room… this relationship is not going anywhere!!\nNTA!", "ESH\n\nI don't think she should've locked  you out of your shared bedroom, I think she could have equally went into one of the spare bedrooms and locked herself in there, childish and immature. \n\nI think you need to understand that sleep is important, and if she doesn't get good rest it could turn into resentment towards you, which wouldn't be good for your relationship.", "ESH - You know she's a light sleeper but you get up in the night. She knows you got up so she locks you out. Both are AH moves. \n\nTrust me, this is not the relationship for you. You are not well suited to each other and the frustration is just going to get worse over time.", "ESH, you both are acting super immature\n\nYou are partners, not adversaries", "She is a big ol' AH! You don't lock people out. That's childish. It is HER fault you had to bang on it to get it. She set herself up to be woken.\n\nAnd if she is THAT light of a sleeper then she needs earplugs and a white noise machine. The combination WILL work. (I have used both for 40 years. The sound of the air-conditioner kicking on wakes me up! I have never met a lighter sleeper than myself!!)", "This is clearly an ESH.\n\nYou suck for being a restless sleeper but not understanding how that impacts other people.\n\nShe sucks because just locking you out of the shared bedroom is clearly a dick move. She can use words.\n\nYou both need to figure out a workable sleep arrangement and stick to it. Do not sometimes sleep her, sometimes sleep there, sometimes sleep with her and change your mind 50 times a night. Just sleep in different rooms. Maybe its atypical, but it isn't uncommon.", "This is clearly an ESH.\n\n  \nYou suck for being a restless sleeper but not understanding how that impacts other people.\n\n  \nShe sucks because just locking you out of the shared bedroom is clearly a dick move. She can use words.\n\n  \nYou both need to figure out a workable sleep arrangement and stick to it. Do not sometimes sleep her, sometimes sleep there, sometimes sleep with her and change your mind 50 times a night. Just sleep in different rooms. Maybe its atypical, but it isn't uncommon.", "NTA \nShe doesn’t get to kick you out of your own room.  Especially when you’re paying the rent.  Having said that,  the root issue isn’t being addressed.  You both need to figure out how to address your sleep issues.", "My vote is ESH. Sounds like your girlfriend and you had a previous discussion on sleeping arrangements and if either of you wanted to sleep alone you have an additional room for each of you to go to sleep in that is not the shared bedroom. So her locking the door of the shared bedroom is breaking that previous agreement. If she got up to lock the door she could have just kept walking to her bedroom. So she sucks for doing that. You suck for actually making something that involved a pot in the first place and then although you might be in the right based of the agreement the way you handled it wasn’t right so you suck too.", "NTA - I don’t get exactly what people think you did wrong here. It’s not your fault for wanting to share a bed with your girlfriend. It’s not your fault for thinking you could make it a night without waking her up but then getting hungry. Dude, I had an ex who had horrible insomnia. Constantly getting up. If anything I felt bad for her. Insomnia SUCKS. I would have NEVER locked her out of the bedroom just because she banged a pot. However, this did make me wonder if there is more to the story and you upset her in a different way before this happened. Your reaction to making her sleep in a different room seems justified after she locked you out. It’s passive aggressive and rude. She should have used her adult voice and told you she needs to sleep due to working early.", "NTA. Light sleeper or not she has no right to keep you out of your shared space. she can go sleep elsewhere if she feels the need to.", "NAH - sleeping is so complicated. It sounds as if you are as respectful as possible. She was annoyed and tired and stressed. \n\nIMHO stop trying to make sleeping in the same room work and sound proof her room.", "Didn't even have to read to know YTA. When my ex and I were together, I had bad insomnia, especially post-intercourse, whereas she could sleep like a log lol, but not always. So I would sleep on the couch when she stayed or if I stayed at hers. There's no use in my waking her up because of my tossing and turning, so why be the asshole? It's not like she stayed or I stayed every day, and I would fit in a nap the following day. My solution, had we married, would be to have a guest bedroom where I would sleep, and don't get me wrong, I'd still do it if I hadn't overcome my insomnia. The point I'm making is that there's compromise to be made in relationships, and our compromise was cuddle her to sleep. Then I'd go tire myself out, and sleep on the couch.\n\nAlso to anyone who might say that's an unreasonable compromise, I also thrash a bit in my sleep, and did once accidentally smack her awake by kicking my foot out and giving her a choly horse.\n\nNow that I've read it your still the asshole, not once did you consider just going to one of two guest bedrooms. Which is another thing, why do we have guest bedrooms, and not use them ourselves when we don't have company? Like your mad you pay for the bills, but there's two perfectly good rooms that go untouched for months on end. Use the spare bedroom, and get use out of those beds!\n\nIs gf a Saint? By no means, but like c'mon knocking loudly, late at night, is also ignorant to the neighbors. So not only are you being an asshole to your girlfriend, but now your neighbors too.", "\"I pay both our rent so I should be able to torture her and treat her as a sub-human!!\" Get absolutely wrekt. YTA.", "He sounds like a literal toddler", "If it was a one bedroom house, his actions would make sense. It's not. He needs to turn one of the spares into HIS room. Own bed/closet/other furnishings. Then he can do what he wishes.", "It honestly doesn't even sound like sleep issues", "Why is that OP’s fault? If they both have sleeping problems, and she’s the one annoyed by his actions, she should be the one to move to another room.", "The kind of adult who pays all the rent, and is therefore entitled to do whatever, whenever. That's who!", "How is he treating her like shit exactly? Do enlighten me.", "And she fucked with his sleep by needlessly locking him out of their bedroom. They’re both in the wrong.", "First of all, normal doors aren’t easy to breakdown so good luck with that. Second of all, your reaction is unhinged and you need anger management.", "She has work in the morning. This is not the first time OP has woken her up with his inability to fall asleep and I'm sure this affects her work in a negative way basically not being able to get her REM sleep with OP getting up and down and banging pots and pans at all hours of the night. He's the problem, he can go sleep in another room.", "She works. Just because he pays rent doesn't mean she's not paying all the other expenses. For all we know, the provisions she covers cost more than the rent. OP saying \"I pay the rent\" with no other context is a dick move to try to get sympathy when he is clearly TA.", "So that means he gets to do whatever he wants whenever he wants regardless of how it impacts his partner? That's not how that works.", "Big *upstairs neighbour* energy here. YTA.", "Fully agree! I’m not a light sleeper, but when I get woken up, I am fully up. Depending on when I get woken up, it might take me an hour to fall back asleep or it might be too late to even try. I get so mad when I get woken up because it automatically steals at least an hour from my sleep", "don’t funk with my sleep man!!", "If he can't sleep he needs to deal with his issues instead of tormenting his partner", "This poor woman has the patience of a saint to put up with this so long. However, when someone is as out of touch as OP is gotta wonder if this is the only area he’s an inconsiderate child over…YTA", "My parents also. My mother has different working hours every week. One week she has to get up at 4:30 AM and the next week she doesn't go to bed until 2:00 AM.\nMy stepfather also snores. They often sleep together on weekends and during holidays. My grandpa and grandma had the exact same thing.\n\nThis seems ideal to me, but until now I have never had a relationship with someone who understands that sleeping in the same bed is not necessary.", "My husband and I can't sleep together either. I wish it was different but we both snore and wake each other up. I'm happy just sleeping with my basset hound", "I'm an atrocious snorer, and also consistently the one who's falling asleep first due to nightly medications. I''m also the one who normally has to be up first for work.\n\nMy wife is a saint who comes up to cuddle until I'm falling asleep, then moves to the couch- which she finds better for her back anyway.\n\nBut if she tells me she needs a night in the bed, I will switch to the couch in a heartbeat.\n\nLong-winded way of saying that, yeah, sometimes NOT cosleeping is better for your relationship.", "Who among us hasn't made midnight lasagna?", "Yeah this just feels like a joke, even before the cupboard and pans nonsense it's I get up multiple times a night and wander looking for the perfect spot to sleep and my missus is a light sleeper and you just know this guy is TA!", "I was wondering how far down I’d have to scroll before someone mentioned OP’s need to point out that HE pays the rent. \n\n1. It’s irrelevant to the fact that OP woke his partner and then kept her up like an AH.\n\n2. Bringing $ into OP’s argument just ups the AH meter. She’s not allowed to sleep because he pays more $ in rent than her?! Dude’s on a power trip.", "Intentionally depriving your partner of sleep is actually one of the traits of an abuser. It's listed on many domestic abuse websites.", "Honestly you deserve top comment for pointing out the power struggle here", "Men like OP are exactly why I've never been interested in being a stay-at-home partner. Thankfully my husband is a reasonable man who would never lord it over me that he makes more, or that he works and I don't right now (working on getting a new job though) but there are so many men out there like OP who feel that paying the expenses means the home is theirs and they get to make all the rules.", "She needs sleep. He doesn’t need to be close to her.", "He can want it…but feeling entitled to it is another story.", "Couple of days ago, you’ll have to do a bit of scrolling to see it.", "https://www.reddit.com/r/AmITheDevil/comments/123zfv1/i_think_ive_never_hated_anyone_as_much_as_i_hate/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1 \nhere you go! original was deleted by user", "She probably thought that a full grown adult would understand that locking the door means \"do not disturb\".", "This is nearly perfect. You just need to replace “OUR room” with “MY room.” The cat owns the space.", "The issue is he's eating late at night before going to sleep.", "It sounds like she would be able to sleep fine if he stopped coming and going all night and actually let her sleep!", "So he should see a sleep specialist not keep everyone up because he can't sleep. It's called being a considerate partner", "Who gives a fuck if he pays all the rent? The fact he mentioned it makes him an even bigger AH! I’m personally not a great sleeper and my husband goes to bed earlier than me and he snores so I’m restless and after years of shift work and night duty when my kids were babies I struggle with sleep every single night of my life, we only have 3 bedrooms so I spend what sleep I can get on the couch because I don’t want to wake anyone up if I can help it which means not going in and out of the master bedroom and being clumsy and not being so selfish that I ‘felt like’ I might sleep but after 10 minutes realised I was fucking hungry and start banging around in the kitchen! I also certainly don’t bang on the door like a 5 year old when there are 2 other vacant rooms to sleep in but because the rent comes out of my account I can demand the master bedroom???? I’m getting you right? Maybe she pays for everything else or maybe she pays for nothing because it has nothing to do with him being a massive AH", "Difference is his problem sleeping isn’t caused by her. He’s the cause of her problem. He can sleep in the other room.", "And he has 2 other bedrooms he can sleep in?", "And she works. I bet he has no problem spending her money in other areas.", "The pervasiveness of this mentality - \"I benefit most from the gender pay gap so I should also be able to benefit most from the domestic gender power and chores gap too!\" - is the *main reason* I will always maintain absolute financial autonomy regardless of my relationship status, pay *at least* half the bills, and keep my financial information to myself.", "Not to mention the way he says I decided I wanted to sleep with her but then he couldn't sleep so now neither are getting any rest.", "Is it even a home with no midnight trombone?", "This is so crazy to me. OP should be able to cook whatever he wants, it’s his place. If a single pot banging sound from another room wakes you up then sleep with earplugs, that’s not on OP. \n\nIn my opinion both of them suck and should learn to communicate.", "This triggered me and made me think of the time my brother stayed with us. I asked him to keep the noise to a minimum as my partner has an early 4am start and I get up shortly after. \n\nFast forward to him cooking FISH at 2am making all kinds of racket. And sure hog our one bathroom at the time you know my man needs to shower and head out to work. \n\nAt least my brother had the excuse of the time change but still... inconsiderate af. But I could hold my tongue cause I see him 1x per year. Couldn't imagine if this was a constant daily struggle. I'd be featured on SNAPPED so fast jeez.", "People who have the money get to control everything in the house. Duh!  /s", "What kind of logic? Classic abuser logic.", "Also why do you need pots and pans for a midnight snack. Grab a piece of fruit or something easy from the pantry and be done.", "Sounds to me like she should probably be using the spare bedroom.  She would probably give a fuck if he didn’t pay all the rent seeing as how she wouldn’t be living there", "Tryna shake those awkward teenage bleus", "Say lightly fried fish fillets one more time.\n\nSweer potato instead.", "If she works, she probably pays for other things, just not rent. It's also likely she makes less than him so they've made an appropriate division of expenses according to income.\n\nThis is such bullshit and goes to prove that many people and especially men will agree to arrangements and then turn around and throw it in your face.", "And also, people attribute everything on this sub to abuse so there’s that too.", "How do you know she wouldn’t be living there? Do you know her finances? What difference would it make where she slept if this fuckin dude sits in bed for 10 mins and thinks, hey let me go make some food that requires half the tools in the fucking kitchen… ever heard of a fuckin PB&J?!!", "Yeah my ex husband did this. Made significantly more than me (worked fewer hours though!) and decided it made sense he cover the rent. I paid all of the bills, and food though. Which ended up being the same amount a month as rent. He always held “paying rent” over my head though and used it to shame and control me, despite spending the same as him every month.", "She also had work in the morning, so she makes money, she could pay rent. Does he pay rent so he can hold it over her head?", "I call it smell-atolin. If I take it I sweat it out and smell awful.", "I've found that a handful of almonds (which are very high in magnesium) 30 minutes before bed really helps me fall asleep.", "How do you know it required half the tools?  One pot or pan is not half the tools.   Do you even know their kitchen?!?", "Here here 👍", "I'm so glad he's an ex, good for you!", "Seriously? Was he blind to the fact that you were basically splitting the expenses with him, despite the fact that he made more? Nothing about that is fair. That guy would boil my blood", "Oh no! My understanding is that magnesium is also very good for muscle cramps and nerve health, but if you can’t tolerate it be careful! However there are lots of different forms of magnesium OTC. Magnesium glycinate is the kind I take and it is very easy to digest.", "Why tf are you reaching in cupboards for pots and pans for a midnight snack? If you use pots and pans you are using other tools. Not sure why you’re playing devils advocate. This dude is a dumbass to his partner, and you kinda sounds narcissistic for implying she should put up w his behavior. Weird", "And actually I prefer a fuckin pb & fluff thanks", "I’m actually getting irritated with people. It’s like the idea of speaking has completely left their brains while they type.", "ESH\n\nI very much dislike how everyone is dragging OP. I feel like we don’t have enough information to make a fully complete ruling on this, but it seems very toxic on both sides.\n\nYeah, you pay all of the bills, but that doesn’t mean you have sovereignty over her or her privacy. However, I do find it odd that she yelled at you for… being you essentially. She definitely shouldn’t have locked you out, and a better response would have been to just tell you that SHE won’t be able to sleep. \n\nI can understand why you were banging on the door, but a more mature response would have been to just drop it and go to another room. But like I said, it seems like there’s more going on here than was shared.\n\nThere is a lot of opportunity here for growth on both sides, but I think the best solution is for you two to separate and apply that growth with someone else.", "Both AH. Sharedbedroom means shared. If she wants a room to herself she can take the spare, same as she insults you do.\n\nBut...you need to sort out your sleeping. Because this is going to be a biiig issue in your lives.", "NTA. Dump her. Your woman should bring you peace.", "Problem with your reply is that it wasn't HER bed, it was THEIR bed. She was sleeping in the SHARED bedroom, not HER bedroom. She had another room she could go to and she eventually did. In fact, the only reason she even has a bedroom to begin with is because OP is paying for it and OP should honestly just kick her out and move on to find a partner that he can actually cohabitate with successfully rather than burning his resources on this one. Dude shouldn't have to be paying rent for what's, at LEAST, a 3 bedroom house when he really only needs a 2 bedroom or even a single bedroom starter with a pop-up office.", "YTA- I am a non-sleeper. I am challenged with sleeping all the time and you sound insufferable to be in bed with. Why does you not being able to sleep mean she has to suffer too? You have separate bedroom set up why couldn’t you go in there? And why are you holding the money ( I pay the rent) over her head? This has nothing to do with how you’re treating her when she sleeps and everything to do with how you perceive your worth more than she is.\n\nThis sounds like a communication thing. You guys need to sit down and set some ground rules. And you need to be aware of how what you’re doing is affecting her every day life.", "He pays the rent!! \n\nSheesh", "No. She’s his subordinate in his opinion. He can do whatever he wants and if he respects her at all it’s because he deigns to. He doesn’t think he owes her anything and thinks that him paying the rent means he’s the boss.", "There are just... so many solutions to this but at no point does he even indicate he's aware this doesn't have to be the case. He could start dozing off in one of the other beds or the couch to get rid of any \"wait I have to eat... wait also I have to use the bathroom... wait also-\" sessions. Do night exercises or stretches to work on winding down. Listen to a podcast, music, or white noise if there's too much mental stimulation. Go to a doctor and see about prescriptions for sleeping pills or even medical marijuana if that's legalized where he is. So... so many options. And if he refuses to take any of them, he should just permanently sleep separate from his gf because his gambling on HER sleep is absolutely unfair. Maybe sometimes he'll be right about the feeling that he can \"actually sleep through the night this time\", but again, he's literally betting her sleep on this and it's selfish af.", "But it's okay because he pays her rent! She should be ever grateful to her lord of the castle!\n\nYTA", "Passive aggressive. That’s exactly it.", "You’re the only one because it’s wrong", "Dude how is she the childish one ? He knew she was asleep but decided to go to bed, the got up 10 literal minutes after to go make a full on meal, doing enough noises to wake her up. She then decided to lock the door, knowing her bf didn't care enough for her to not do shit like that, not trusting him for letting her rest, knowing that he can just go to another room.\nWhat is op response to his partner knowing that he couldn't let her sleep and taking an harsh decisions? \nThrowing a tantrum. Banging on the door. In the middle of the night. Still knowing she have work next morning. \n\nWhy would ever op's girlfriend not trust him enough to let the door open the night when she needs to sleep ? 🧐🧐🧐", "Okay but he hasn’t said he has 3 bedrooms because of this sleeping arrangement… I think that’s just the size of their house? \n\nBut even if that was the case, it doesn’t sound like he the sleeping issues have anything to do with her. It’s entirely his own behaviour causing the issues, any person would struggle with having their sleep disrupted like this.\n\nYTA", "Just because he says he pays rent doesn’t mean he pays for :\n\n-Water\n\n-Trash\n\n-Electricity\n\n-Groceries\n\n-HOA fees\n\n-Internet\n\n-Cable/ Paid Apps\n\n-Dates\n\n-Furniture \n\n-Etc\n\nAlso, it doesn’t mention he cleans or does the chores. You’ve read the only detail he mentioned and decided she’s a leech.", "I'm being sarcastic here and not supporting his reasoning!", "Right?! Normalize sleeping in different rooms! You clearly have incompatible sleeping habits and it doesn’t mean you don’t love each other because you can’t sleep in the same bed.also you sound like a selfish prick. I’m hungry I can’t get a snack without waking up my gf. Geez… are you making a gourmet 7-course meal at midnight? No judgment but dude it’s not hard to grab an apple, make grilled cheese, or heat up something in the microwave with little to no noise… wow you’re inconsiderate.\n\nSleep is important!\n\nYou have multiple other options. \n\nYTA", "Yep. My husband and I have a bungalow, main bed is upstairs, I had a bunch of knee surgeries so the first floor spare became the main. It’s our first house, it’s darling, but one bath next to the spare room and office. So I sleep downstairs and he often sleeps upstairs. It’s not ideal, but if I have a feeling my leg will bother me or I’m going to have my head in bucket or the toilet (autoimmune disease and mrsa really bad combo) he sleeps upstairs. I feel awful he slept with me when I had a wound vac, I was so sick he couldn’t hear me from upstairs if I needed something-being septic with a broken femur and vac you need help. Moral of the story, neither of us are offended if we need to sleep alone (as long as I’m not about to croak)", "“I was too hungry to sleep” alone says everything", "i \"sleep\" like this guy - had a friend affectionately yet seriously tell me if they didn't know better they'd think i had a drug problem because of it, can often only sleep for 2-3 hours at a time and that does not always overlap with most other people's schedule.\n\ni can't imagine a scenario where i'm fully aware most people would want to be asleep at that moment and then being mad at a person *i care about* for insisting they're allowed to do so. \n\nthis isn't their problem to fix or cater to because i'm not a spoiled child. i am a spoiled adult, thank you very much, who enjoys reading their little stories cuddled on the couch at 3am when no one will bother me and have taken steps to make that an acceptable, non-intrusive habit.\n\nand if my partner locked the bedroom door on me in the middle of the night and i still wanted them to be my partner? i'd be mortified with myself and do everything i can to never push them to that point again, if they'd still have me. \n\nwhat i would absolutely not be doing is *kicking them out of their own bedroom after throwing an aggressive tantrum and calling THEM(!?) disrespectful.* YTA.\n\nETA: also, ew \"i pay the rent therefore you must respect my disrespect\" gtfo.", "You’ve said all the things! The “I pay both rent” comment. Ugh! Obviously thrown in for “sympathy”. Yeah no. That’s not how relationships work. Paying the rent it doesn’t give the right to more “power” in a relationship. Gross!\n\nThe fact that they both started in the same bed. He get up because he need to make a snack USING POTS! And then he’s pissed because she won’t move is mind boggling! Does she not matter to him at all? She’s in bed, sleeping, comfortable. He wakes her up and then expects her to MOVE if she wants to be alone? She deserves better, ah!", "My husband has the exact same issue as this guy and not in a million years would he a) wake me up just because he wanted to sleep next to me, b) start banging pots and pans in the middle of the night, or c) tell me to the be one to sleep in another room even though I'm not the one waking people up.\n\nYou know what he does? Goes to one of his other sleeping spots and doesn't bother me. YTA", "100%. My ex-husband kept me awake all night one night because I “inconvenienced him” by not passing along a message to a friend while I was out (bear in mind he had the friend’s number to contact them) by yelling in my ear, taking the blankets, spraying me with water, you name it, until I had a horrible panic attack which he then claimed I faked.", "Fine, take my upvote!", "I dunno, I also can't sleep if I'm hungry. But I wouldn't go prepare a meal if my partner is sleeping, I just eat a cheese block or some nuts, something easy to fill my stomach.", "She was already asleep when he went in there. She was asleep when he left. She was asleep when he made noise in the kitchen. She didn't fuck with his anything.", "for locking the door on your partner....she could have easily gone to a separate bedroom and locked the door there, not their common space door.\n\nMaybe this is my past trauma talking, but my dad would always do this to my mom, except there were no spare bedrooms (she worked swing shift, when she would come home the bedroom door would be locked, when we woke up from school, she'd be in the living room sleeping. \n\nI said they're all wrong here. He shouldn't be banging on the door, I understand common courtesy and they both lacked it in this scenario, in my opinion of course.", "Worried that the door will have its feelings hurt? You sound… sensitive.", "Agree to disagree. Normal inside doors are quite \neasy to open with a quick blow on the handle. Also, it’s quite normal for a person to feel frustrated when shut out of their own bedroom in their own apartment.  I’m not advocating violence against a person, just bold action against a door.  Anger management reference is a typical response from a misandrist.", "Excuse me... r/legalcatadvice would like a word with you.", "Rent will be more than all of that put together. Also, HOA fees are for homeowners, not renters. If the renter's paying them, then they've been added to the rent. Trash is also usually rolled into rent, as well.", "When my brother moved out, my parents decided to build him a room in the basement so that my mother could move into his bedroom as my dad snores like a gutted wild boar. She now sleeps much better, and they both have much more space for their things. Everyone is happy. Well, in terms of sleeping at least, I'm not gonna get into their marital issues, nobody has time for that.", "People blow my fucking mind on this sub. I'm a chronic insomniac. I've tried all sorts of treatment, therapies, routines, etc. I've been married over 21 years. My husband sleeps extremely deeply and swears I never wake him up. \n\nYou know what I do on bad nights anyway? STAY THE FUCK OUT OF OUR BEDROOM. His sleep is important and I am sure even if he doesn't wake up, I still distrupt him. \n\nGod, OP, you're the *massive* AH.", "As someone with chronic insomnia, I agree. It took awhile, but I found treatment that (mostly) works for me. \n\nAlso, OP is YTA. Waking his gf is bad. Turning it into a ‘you can’t lock me out because I pay rent and I won’t let you sleep now’ is horrible.", "He only said the rent - she could be paying the the utilities and groceries. Plus, him not sleeping isn’t her problem, it’s his - but he’s forcing his problem on her.", "worst yet he says he was only in bed for about 10 mins so he goes to bed late then starts dicking about", "I am illuminated by a mist-spilling portal. I stand in the otherwise-dark. My eyes are bloodshot, the pupils once adapted to the dark now made pinpricks by the uncomfortable rays of that feeble bulb before me. That’ll do. The drawer is right there, always right there. The refrigerator yawns open like some cryogenic tomb, but it is one whose layout I long ago prescribed.\n\nA sound pierces the darkness, ringing out like a gunshot:\n\n*“What are you doing?”*\n\nI turn and look, my eyes once again leveled into the inky darkness beyond the pool of light afforded me, that halo handicapping me while leaving me totally deficient. I freeze like a furtive grotesque hidden away in some eccentric’s statue garden, too hideous for open display, but too startling to look away from. My hand, stilled in mid-heresy, hangs in the light, bearing horrible proof of its shameful cargo. I have become Goya’s Saturn, caught hunched over what is at once a feast and a debauched mockery of one.\n\nEyes as wide as Count Orlok, I frantically seek the form of the speaker, and I utterly fail to do so. Its second query:\n\n*”Babe, are you eating shredded cheese again?”*", "I only did it once. I swear!", "Can confirm. My dad used to do that to my mom. She divorced him.", "That's awful, glad to see you typed \"Ex\" in front of husband, you don't need that kind of shit in your life, here's to a healing future!", "what do you do then?", "Oh man thats so crazy, he even gives her a heads up he's about to take a bath and she still comes in to drop dumps??? Thank you for the laugh!!", "Guess she was unable to predict that someone wouldn't magicly know the door was locked and try and enter anyways.", "I'm not worried about the door, I'm worried about your mental health", "I love that sub. It’s my happy place.", "Using money as an excuse to get control over your partner is considered abuse. Specially if it involves their health", "yeah same with my parents, they're in different roooms, going on 40 years (not all sleeping apart but since we've all grown up)... i hate sharing my bed. I don't care how much I love you. Like I'm a terrible sleeper and sleep is a priority of mine. \n\nI don't know why those two things got mixed up. Let's end that stigma.", "Sometimes, I have to hope that they're making things up because knowing I exist on the same planet as these ah's is too much.  I also have terrible insomnia, mostly due to my chronic pain and health conditions.  I know my husband requires a lot more sleep than me to function well and deserves to have good quality sleep. He goes to bed several hours before I do typically and I try to be as quiet as possible when I do get into bed.  It's not hard to be considerate of your partner- if it is leave them.", "If it happens a lot and you can afford it, it might be worth getting a second bed for another room for you to sleep on when for those nights you can't sleep. You could keep it as a guest bed the rest of the time.", "This!!! My husband would insist it helps him sleep - it doesn’t. It keeps you up.", "Meh depends on the person.", "This sound old wives' tale-ish.  When my insomnia kicks up, eating definitely helps.", "Don't you have a slanket somewhere you should be filling with your farts?", "I get weird questions on the internet that look like they're asking me to justify my current status as being unemployed.", "OP heard the door lock and proceeded to pound on it until she opened it because he was upset she locked it in the first place. He didn't just try to open it once, find out it was locked, and go sleep somewhere else...which is what a decent human being would do if they knew they were repeatedly preventing their partner from sleeping by going in and out of the room and getting in and out of bed.", "Thank you.  I appreciate your concern.  I’ll feel calmer once I get to Home Depot.", "I mean if it’s in the other room… idk maybe I would stir. I wouldn’t wake up to that. And even if I did it would be pretty easy to just fall back asleep.", "How dare you insult her voice during her golden hours", "Smelly fish stink at 2am. LMAO", "My reply wasn't about control, it was about cutting loose a bad relationship to find someone you can actually live with. Otherwise you're just wasting time and money on the wrong one.", "I agree that some of them *must* be karma hunting, because wtf. \n\nI'm sorry you deal with it, too. Mine is also due to several health issues and pain. I know it's absolutely infuriating sometimes. *hugs*\n\nEta - I also will go to bed way after him when I do sleep. For the same reason you said - I know my husband needs more sleep to function. I have adapted to living on less.", "Nah, some of us have super high metabolisms and need to eat an extra supper before bed or we’ll stay awake or wake up. Some people are the opposite. \n\nEither way OP is TA", "Tryin’ to make some front page drive-in news", "😂😂😂😂", "A particularly crappy thing to ask, even when the economy is good.", "Well guess what? You're not everybody, and since you don't have superpowers, you have no clue how sensitive the girlfriend is.", "Yes and I work from home and the smell was unbearable gag", "Fork is the only other thing required for ramen", "Quit while you’re behind."]}