{"id": 13606, "submission_id": "127603c", "title": "UPDATE: AITA for trashing the gift my girlfriend got me?", "selftext": "Original post: [https://www.reddit.com/r/AmItheAsshole/comments/11z101l/aita\\_for\\_trashing\\_the\\_gift\\_my\\_girlfriend\\_got\\_me/](https://www.reddit.com/r/AmItheAsshole/comments/11z101l/aita_for_trashing_the_gift_my_girlfriend_got_me/)\n\nI was not expecting this much attention. I want to thank everyone for commenting and giving advice, sorry I couldn't get to you all. I wasn't expecting to make an update but there's been a development. Before that, I want to address a few things.\n\nMany commentators said that my GF is a narcissist or has some personality disorder. Probably should have mentioned this before but she has ADHD (which she is medicated for) so she has always been pretty scatterbrained. However it did get noticeably worse when we moved in together such as blowing plans because she either forgot completely or forgot the part where we agreed on them, or completing forgetting to do any errands or chores because she is just so invested in something, usually an art project.\n\nThere was one comment that resonated with me that said that I must have been conditioned to accept this kind of behavior. That is accurate, my parents always instilled into me to be grateful and happy for getting anything at all because they got nothing when they were younger. If I got a sack of s\\*\\*\\* as a gift, I was expected to dance like happy prospector if this at all explains my tolerant/doormat behavior.\n\nThe Update: despite using a throwaway, my GF still found the post. She was very miffed by the responses and tried to vent to her friends but they weren't on her side. She then decided to show the post to her and my siblings. They wanted to know if it was true and when confirmed they all yelled at her and they got our respective parents calm down and stop talking about it.\n\nShe came to me over the weekend and after talking about it since then we kind of worked over several things. She recognized that she really did screw up and as an apology she gave me this cool dragon diffuser I've been wanting for a while and a box of all the stuff I was gifted telling me I may do whatever I please with them. She's also open to not receiving gifts for the next couple of special occasions which I will be doing.\n\nSo when it came down to her selfish gift giving, apparently what she meant by \"I tried\" was her forgetting about these occasions up until the last minute and not wanting to admit it. She hastily gets them off of Amazon from what ever shows up first on her homepage and just hopes I'll like them enough to not say anything negatively and uses them when I won't. She refused to look at my wishlist because gifts should be a surprise but when I brought up her list, she had no answer. She said she'll look at mine from now on.\n\nI don't think this is a deal breaker but it does need to end and well most of you were right, there were other issues. We have agreed to therapy, single and couples which she will pay for. This may not what you were expecting but I think its a good start.", "created_utc": 1680226519, "permalink": "/r/AmItheAsshole/comments/127603c/update_aita_for_trashing_the_gift_my_girlfriend/", "score": 1332, "replies": ["So she constantly forgets your bday, and rather than spending 10 mins to find something you might like, she just picks something from her amazon in hopes that you will like it? Wtf", "I’m glad you had a conversation about it. Her behavior is still really weird and abnormal though. I’d be wondering if she slides back into her shitty gift giving.", "I'm glad you are getting therapy, both as a couple and individually. However, your GF is full on cow manure....you have a wish list, yet she continues to buy from her Amazon hoping you will like it? She was angered that people aides with you on this post so she showed her friends and BOTH you families? Used her diagnosis as an excuse to be selfish? My dude, please take off the rose colored glasses and see flags that are waving on not just flags, they are marinara in colour.", "I am not 100% sure she really \"forget\" about it and buys the first thing she sees on Amazon, but I hope she changes. You definitely deserve an attentive partner.", "I'm glad you were able to talk it out and are going to therapy. I was worried when you said she showed the post to everyone she knew - this is typically a sign that someone is going to use outside pressure in an argument that should be just between two people - that they are going to try to in by peer pressure. It happened to blow up on her this time, but you might want to keep this in mind in therapy.\n\nStill - you have a good start. Good luck!", "This is a good start, but I hope it has helped to recognise other ways her selfishness displays itself in your relationship. Meal choices, Entertainment, restaurants, activities, vacations, house furnishing...... How is money and chores divided? Things don't have to be eactly even to be fair.  Keep evaluating,  and be realistic.", "Wow it took multiple people to disagree with her before she even agreed to fix her behaviour and apologise, first she went looking for people who would agree with her.   \n\nAre you sure she is sorry ?    \n\nI'm sure if there had been even been one person who agreed with her you would have not got that apology and she definitely would not have rectified her behaviour.", "This is actually an awesome update, thanks. She reminded me of Homer Simpson buying Marge a bowling ball for her birthday to use himself.", "Thanks for the update. I've been wondering how you guys have been doing. This is a good outcome. Hopefully, you will be able to work it out, but either way, the therapy will help both of you. She'll be able to work on her behavior patterns. ADHD, even if medicated, does weird things and can cause anxiety and procrastination, causing strange results like the gift-giving issue. You'll be able to work out some smaller issues from your own past; as you mentioned, you were raised to just appreciate anything and not put your foot down. You'll both benefit from it. Best of luck!", "Also her medication may not be as effective as it once was.", ">I don’t think this is a deal breaker \n\nDamn dude. It took your gf finding your Reddit post to admit to lying to you about her “forgetfulness” only after she tried to manipulate the situation, rally family members to take her side AND try to make you feel bad about her “forgetfulness.” She displayed no remorse until she was faced with enough backlash to finally self reflect!? \n\nAnd had you not resorted to outside advice (Reddit) she would have [likely] continued her shit givings every birthday and allowed you to accept her shitty behavior out of…guilt?!\n\nAND, still, none of this explains why she chose last minute gifts from HER Amazon wishlist? \n\nThat’s insane. Good luck, brother.", "Look I'm glad you were able to communicate and come to a solution. I am also glad to hear the therapy aspect, and hope when you say individual therapy that includes her receiving individual therapy... \n\nSomething I've heard and often say, ADHD (or mental health in general) is not my fault but it is my responsibility. \n\nEdit to add: the below story and comments are really here to hopefully highlight the behaviour of your partner is not because if ADHD. Pure and simple, her behaviour, attitude and actions are disgusting, lack accountability and respect for you and your relationship.  \n\n\nI have ADHD, it is pretty severe.  I do some weird shit and often forget things, however ADHD is not an excuse to treat others like shit. I get super overwhelmed at gift giving and often suck at it, but it is my responsibility and part of being in a healthy relationship to communicate this and ensure I put in the work to manage these feelings and actions. \n\nADHD may be a reason for some of my behaviour or actions but is not an excuse. It certainly isn't an excuse to treat anyone (let alone my partner) like shit. \n\nMy partner is amazing and does support me when my medication isn't working well or when I am off medication for managing tolerance or just flat out having a shitty ADHD day. It does not mean I don't have consequences for my shitty behaviour, it means he will remind me a few extra times when needed or support me when I crash and struggle on chores for example. It may mean giving me leeway in the moment when I struggle with my emotions. It does not mean I am free of consequences or allowed to treat him like crap. My part is also ensuring that if i do, I take full responsibility and acknowledge this fact. I make sure I do better as we both deserve loving and supportive partners...", "I commented on the original post and I still stand by what I said, the new information doesn't change that. I have ADHD too. I would never do this to someone I love, I would prefer to let them know that I got mixed up on dates, let them know that I'm sorry, and get them something late. This might not be her DELIBERATELY getting herself things via you, but it's still wildly disrespectful.  \n\n\nAlso very telling that she didn't believe the comments on the original post, didn't believe her friends, and it took BOTH your families telling her that she's wrong for her to accept it. That doesn't sound like someone who's been making mistakes and panicking. It sounds like someone who was 100% ok with what they were doing, to the point that they can't believe anything is wrong.", "I don't...quite care for the idea that she just kinda...randomly gets something based off her amazon preferences as an after thought, but I'll admit this was progress all the same.\n\nA little honesty in your failings goes a long way, and frankly the mystery in gift giving is overrated. It creates an unnecessary \"test\" in relationships. I'd personally rather receive something matching my wants.", "Uh, she needs medication because she’s only barely functional", "She is a 30 year old woman pulling this crap. WTF! And when she didn’t get the response she wanted, she ran to family to pick sides. She is as selfish as they come, and I don’t think it is going to get any better. She only decided to work on it because she was called out by everyone she knows. Of course she has to try to “change”…….for them. It’s for appearances only.  The telltale sign: you brought the issue up and she did nothing but plant her feet harder in the ground. She didn’t care to listen to what you were saying or be sympathetic towards your feelings. When others got involved, she decided to do better. So she has to be called out by the masses to get her act together? Get out now while you can. You deserve so much better. 🚩🚩🚩🚩", "YTA. How nice of you to have everyone gang up on her.", "Honestly...people stop blaming ADHD or some forms of autism for all evils! Being inconsiderate or rude or selfish has nothing to do with the above. She forgets and she is shopping at the last minute but she only see in front of her things she can only like and use? Does she cares at all about her bf? Does she listen to him? Lists are bad for others but good for her presents? She is just selfish and uncaring. Sorry for using \"heavy words\" but almost everyone justifies simple truths with something else. I also forget and my brain is working strange. I use Google calendar for events, I write things to paper calendars, to post it. If you actually care you always find a way.", "OP, I am glad you worked through this with your partner, and that you will be getting therapy together.\n\nIt is, however, unfortunate it took so many other people to get her to see that she messed up.  Especially when her later \"excuse\" basically says that she knew that she was not giving you anything you wanted.\n\n*She hastily gets them off of Amazon from what ever shows up first on her homepage and just hopes I'll like them enough to not say anything negatively and uses them when I won't.*\n\nThis doesn't really hold up.  Because when you DID say something negative, she got furious, because she wanted the gift for herself.  It had nothing to do with not admitting she messed up.  She was deliberately shopping for herself.\n\nThe ADHD really does not explain why she always managed to get gifts for herself and not for you.\n\nI hope the counseling brings you greater clarity as a couple.  Because, while I appreciate that she is planning not to continue this particular behavior, I don't think you've really solved the issue of why she was doing this to begin with.", "I know this sub has a habit of confidently condemning whole relationships based on tiny snapshots of people's behaviour...\n\nBut the cynic in me does wonder how much of this \"update\" was really pushed for / shaped by the GF trying to sanitise her reputation with friends and family who've been shown the original post.\n\nThe \"I forget then quickly order off my own amazon\" excuse feels crafted more for that audience's benefit than OP's.", "No OP, she’s manipulating you once again. Don’t let her treat you like that, you deserve a partner who values you, the least she can do is admit she is a selfish person.  If so sad you don’t realize she’s not making even the bare minimum", "[removed]", "no. how is she to tell u what to do with ur gift. the purpose of a gift is u deliver possession of an item to someone for their enjoyment. whether they want to frame it and hang it somewhere or evisorate it to pieces once the transaction has been completed it is not their business anymore", "She can't even care enough about you to set a reminder in her phones calender? Ouch", "\"She's also open to not receiving gifts for the next couple of special occasions which I will be doing.\"\n\nDunno if that is the best approach. you could show her that you still care despite all the above happening. doesnt need to be something big. a flower or something", "Would be believeable and almost forgivable if she didn't admit that she got you things she knew you wouldn't use and that she knew she'd want to \"borrow\" or primarily use later. \n\n\nIn addition to you not having to get her any gifts for the coming gift-gibing events, you should also have some agreement that the gifts she does get you from now on are not to be used by her the majority of the time, if at all. Or rather. If you don't use it, neither does she. \n\n\nI forget to get people gifts on time in occasion. It's not that i forget their special day but i procrastinate on when i get the gift. But i even if i know the gift won't get there in time i still look for something that it's a good gift for that person and occasion and just be truthful that hey your gift is on the way. And give them the option to see what it is (Amazon purchase history) or to let it be a surprise when it does arrive. I don't give them shit on the fly that would mean nothing to them and be useless\n\n\nBut truly i hope the best for you and your future in your relationship", ">The Update: despite using a throwaway, my GF still found the post\n\nI know it's not the aim of the post but, your story is very specific and contains some personal details. If your GF is reading this sub, or following social media community that links story from this sub, it's very easy for her to recognize the story and who posted it.\n\nThe throwaway account only protects you if she actively looks at your activity on Reddit.", "I understand you feel this is progress in the right direction, but what I'm taking away is that she didn't care enough about you to remember your birthday, refused use your wishlist over her own when she bought last minute gifts, did so knowing she would keep the shit, and only felt the need to apologize after shopping for sympathy support from both friends and family and failing, and even then only apologized half-assed with enough addendums added to salvage her ego.\n\nMaybe the sex is super great and that's enough to salvage the bonkers levels of disrespect for you as a human here, but this is likely not going to be salvaged by therapy. She doesn't respect you as a person, do you honestly see that changing?", "She's not sorry and your TA to yourself for staying with someone who thinks so little of you.", "This should actually be a dealbreaker", "Yep, that's right. It sounds like a random excuse she's made up. My bs detector is tingling....", "I think he meant she'd already ordered something off of Amazon for herself then when the day came and she realized she didn't have a gift to give would just use whatever Amazon package last got delivered", "OP feels very lucky to have such a great Girlfriend ! What a keeper !", "To be fair, I have Adhd and my best friend and I have a tradition of always forgetting each other's birthdays. I once forgot my own birthday until my mother texted me well wishes. \n\nSo that part is very much plausible.", "She is not sorry lmao. She knows he has put up with the behavior for multiple years, so she just stops a bit before restarting", "Especially since she always bought gifts she wanted/was happy to use iirc, if OP didnt want them. Just nope, smells of bs.", "Op is just making excuses\n\nADD doesn't make you an asshole. ADD also doesn't make people regress mentally and emotionally to toddlerhood.\n\nOP, what would have happened if the million other people in her life she involved and ask whether you are allowed to be upset said no? She'd have just told you to piss off", "> The \"I forget then quickly order off my own amazon\" excuse feels crafted more for that audience's benefit than OP's.\n\nIt’s weird that OP accepted that obvious lie as an acceptable excuse, because it’s arguably worse than just intentionally buying something for herself. \n\nThey’ve been dating 8 years, and she has no idea what he’d like as a gift?\n\nThis far into the relationship, she shouldn’t have to look at his wish list for ideas on what to get him. \n\n If I woke up and realized I had 24 hours to get my GF a gift, I would already know what stores full of things she likes I would be driving too, what websites I would be praying to provide a same day delivery option, and what restaurants to try and make a reservation at.", "I missed the age. I was thinking college student. That’s so much worse.\n\nAnd sad. How low is bar for OP?", "Op's bullshit detector has been as silent as ever", "That's because it is complete bs and I am not sure how OP isn't seeing it.", "The sad part is the lie doesn’t even make her look better than the truth. \n\nI’d be more hurt by my SO not remembering my birthday after 8 years of dating, and having no idea what I might like as a gift than I would be about them just buying themselves a gift for my birthday. \n\nBoth scenarios would suck, but at least in the second one they actually remembered the birthday.", "There is absolutely no chance she’s being for real with you dude 😂 went to EVERYBODY in her life looking for teammates and tried to save face when she realized she didn’t have any. With all due respect, she’s playing you for a fool.", "Well, forgive me OP, but I don't believe her excuses. First red flag is the fact that once she found the post, she was going around seeking validation from her friends and your siblings. What she wanted to do there was have a bunch of people on her side and make sure you're the bad guy. \n\nThat didn't work so her excuse was \"I forget until the last minute\". I think that's even worse than just being honest. Firstly, no one forgets a loved one's birthday unless they have Alzheimer's or something. ADHD makes people scatterbrained for sure, but not to the point where they forget the birthday of someone they've been with and loved for a while. Besides which, she doesn't live under a rock. She has a mobile phone and a phone has a calendar app. If she \"forgets\" important events, why not use that to send her reminders every now and again? So I think that's another bs excuse on her part. \n\nAlso, the fact that she's now giving you the gifts you've wanted all of a sudden and being open to not receiving gifts from you isn't because she's being caring. It's to get over her guilt and make you forget what happened. Google something called \"love bombing\" and you'll see what I mean. \n\nI noticed in the last post you said in a few comments that you don't see the need to break up because all this is a first world problem. The truth is that I (and I'm sure most people who read this post) feel that all this is just a small part of the bigger issue. You said that you don't think she's a narcissist, but she's definitely showing a lot of traits. I've grown up around a narcissist and a lot of what you're saying is similar to one of my parents. You want to start therapy and that's great, but what I will say is please look at the bigger picture. If you end up having kids with your gf, her behaviour will affect them too. Please think about that and take time to think about whether you want to be in a relationship like this.", "The excuses in the post are honestly depressing. She found the post and tried to smear OP and get public opinion on her side. That failed, so she issued a performative apology. She's acknowledged some of the issues but hadn't actually addressed how to handle them properly.\n\nThis sounds like \"I got the absolute bare minimum, and I'll lie to myself that it's all better now\".", "Bro she ain't forgetting about your gift. Shes just busy with her other man. Her art probs got him in it lmao. Duck and run", "Just something towards the last sentence.\n\nIt doesn’t matter at all what we expected, what matters is that yall both want this and can live with it, preferably happy at that.", "Bro....No man.\n\n8 years and she cannae be fucked getting you a gift???? My guy i say this with respect but please grow a pair. She doesn't give a flying fuck about your birthday **AFTER 8 YEARS?** My guys she doesn't give a fuck about YOU. Please open your eyes.\n\nShe should have been an EX GF....\n\nEdit - ADHD means fuck all when it takes a fucking minute to put in a yearly reminder regarding events.", "People should stop romanticising mental health problems but also they should stop using them as an excuse for treating other people poorly(and sometimes abusing them) ADHD is not an excuse for lacking basic decency and common sense.\n\nThe thing is (if I remember correctly) she admitted deliberately getting you the things you don't like so she will use them later, you talked to her didn't change her ways, you made a post she saw it, and she was looking for support from your freinds and family trying to show that you are the bad guy, but when she faild she took it back and changed her story and it became getting things on her order before or whatever list she has on Amazon instead of her initial answer, congrats on getting the cool dragon but I don' t know what in the rose tinted glasses, \n something tells me that we will hear from you again.", "She doesn't give a single f*ck about you, she wasn't even sorry.", "Your bar is so low, you can’t even trip on it. I hope one day you’ll realize you deserve better", "Not saying it's not shitty but if the girlfriend has ADHD it's often combined with time blindness and excecutive dysfunction. Combined they make it difficult to get started on things regardless if they're things you enjoy or necessary tasks, and often it means the person requires that last minute -anxiety to kickstart getting started.\n\nObviously still shitty behavior from the girlfriend to not even spend the effort to find something that OP would like, but not being prepared and not planning beforehand when you need to do something are pretty common ADHD characteristics. Of course that doesn't make it any less hurtful to receive that kind of behavior.", "I also have ADHD & birthdays sneak up on me, so I keep a running list in my phone or things I think someone will like, so I can grab something when I do remember\n\nETA it's also difficult to think of anything under pressure, for everyone but especially people with ADHD, so this is helpful. \n\nThe girlfriend sucks, it takes effort but you should want to do things for those you love", "She chose things off her gift lifts because she refused to look at his because she thinks gifts should be a surprise. What a load of bs. And yet she has a wishlist and expects OP to buy from it. I wouldn’t put up with this crap at all. I would never do this to my husband either", "Exactly!!", "My son has both autism and adhd and I hate it when people use these as a way to excuse their shitty behavior. I also have adhd and it doesn’t make me selfish. I also use my calendar for reminders. I can’t imagine doing this to someone I say I care about", "Comment straight out of r/RomanticAdvice", "She busy with her main piece. OP the door matt lol", "Also, she \"apologised\" only AFTER she realised no one was on her side after her \"tour with the post\"", "To be fair, that might be a creative way of saying that she just ends up giving him whatever thing she *already* ordered for herself. Less \"I hope he likes the first thing I see on Amazon because I don't have enough time to look at Amazon but can wait for shipping\" and more \"shit it's my boyfriend's birthday and this is the package I haven't opened for myself yet.\"", "It takes 5 seconds to open the calender on your phone and add an event that repeats every year with a reminder a day or week or both before hand. Forgetting once happens, Forgetting everything all the time is just not caring enough to remember", "I’ll be honest, I can’t remember the exact date of my girlfriend’s birthday. We’ve been together for five years and known each other for ten. (To be specific, I can never remember if it’s the 25th or the 26th. I just remember it’s exactly a week before mine. So if my birthday is on a Saturday, hers is also on a Saturday).", "I have plenty of possibilities besides physical gifts to make her happy and feel loved.\n\nBut honestly, if I would care so little that I don’t plan or prepare anything beforehand and only remember on her actual birthday, maybe I would communicate my inability to put any weight on special days, and instead focus on making her feel loved in general, so these single days don’t matter in the long run…if she agrees and feels comfortable with that solution of course. 🤷‍♂️\n\nWe often have a hard time finding specific gifts, as we gift us stuff all over the year already. But with so many possibilities for love language, there is always a way to show/receive love 🥰", "Haha 😂 well having been in relationships with ppl like the gf and growing up with a parent like that,, I think I've got pretty good at spotting the signs before it's too late😂", "As someone with ADHD, I do that. And then proceed to ignore the reminders because “oh, I’ll remember!” Legit don’t remember my brother’s birthday even though it’s exactly 3 months before mine. I have to say my dad’s whole birthday before I can remember it’s on fuckin’ Earth Day. I’m stupidly thankful that my fiancé’s birthday happened to stick in my head. (Three-ish weeks after mine, which helps.) I care enough to remember. I just don’t remember to remember.", "You solved my neurological disorder! I should just try harder & do better! You should go on tour with this groundbreaking advice! /s", "For me it's actually that I remember most birthdays very well (I have a thing with numbers), but I still need the calendar reminder because I don't have the awareness for what day it is. So I could tell you a person's birthday is X, but not realize that X is today", "That too! I have a large calendar in a prominent spot in our bedroom just so I have a visual of what day it is.", "Same, I'm great with dates just not how far away they are.", "Hope she sees that’s she’s getting flamed in the comments on this post too 😂", "So she \n1) didn’t believe she was doing anything wrong until everyone she ever met agreed that she’s an AH\n2) doesn’t believe in wish lists. Except for hers. \n3) would forget your bday but then buy you whatever random shit popped up. Because that’s better than a wish list. \n\nI’m sorry but this doesn’t bode well here.", "NTA - but seriously, what is going on?\n\nADHD can explain being scatterbrained. It doesn't explain not caring about the consequences.", "OP you are much more forgiving then I would ever be. And the excuse she gave as for why she won't look at your wish list is bullshit. \n\nMy fiance and I have wish lists for each other that we buy off of but we also buy each other something as a surprise that's off the list. We still know what the other likes not shit for ourselves. \n\nI personally don't think this situation is going to get better and I bet she's still going to be pissed when you don't buy her gifts. Good luck.", "🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "My brother has ADHD and he never once forgot my SIL birthday. In fact, he always plan beautiful surprises to her. My bf also have ADHD and he also never forgot any important date and always got me amazing gifts. If your gf is trying to use her condition as an excuse for being a selfish person who forgets her S.O. birthday, my dude, you are being fooled.\n\nGlad you talked, but you realized that you being sad wasn't enough for her to change, right? It took a Village to convince her she was wrong and do something about. Sorry, but red flags still on.", "Your gf doesn’t have ADHD, what she also doesn’t have is any respect for you. Relationship is pretty much dead.", "Just keep buying her what you like and use it after.", "I'm ADHD as well. Your gf's explanation was completely relatable up until the past where she just clicks the first thing. I know when people's birthdays are, but while I may know someone's birthday is March 31, and may even also know that today is March 31, those two thoughts do not always connect in my head to draw the obvious conclusion. That's executive dysfunction for you.\n\nI've done the last minute scrambling on Amazon too many times to count. But here's the thing: I do my best to get the other person something they will enjoy. Full stop. Their day is about them. And if she can't find a way to make your day about you, all I can say is that, for your sake, I hope therapy is successful for y'all. You deserve a partner that is attentive to you and your interests.", "To be honest this just shows as her being even worse than you described before. She tried to gather anyone and everyone to be on her side and when they ALL told her off NOW is when she’s “sorry” and “I just hoped you would like it and if not I would use it”. She’s awful, you deserve better. Good luck in therapy", "Having ADHD isn't an excuse for being selfish. I can understand forgetting to buy a gift until the last second, but that's what calendar reminders are for. Also, I've been in the emergency gift-giving situation before and I felt *awful*. I felt so bad, it never happened again because I started buying gifts throughout the year. I have a gift stash in my closet for all kinds of friends. \n\nFor my husband, I keep a running list of gift ideas in my phone and I have about 20 calendar alerts that ping me before his birthday. He thinks I'm nuts because I start bugging him 4 months out, but I need that lead time. Hurting his feelings by botching his gift is unacceptable to me, so I don't do it. Your girlfriend is just a jerk and I'm sure that manifests in other ways. \n\nI hope you start to care enough about yourself that you don't accept this kind of behavior anymore. You deserve better.", "Op's gf sounds like kind of a jerk. I have ADHD and  am really good at remembering important things but bad at remembering TIME* and def have time blindness and all that, so I just collect stuff and send it to my friends throughout the year, then when I know their birthday is close, I keep it all together and send it .. around then? ... \n\nBUT I (and everyone around me) knows I'm bad with time and my gifts are thoughtful even if they're not always timely. \n\nAlso, I have a series of reminders in my phone for my husband's birthday, we usually travel for his but now I have work events around then so it's harder, so I go out of my way to do other stuff for him \n\n*I may know your birthday is March 31st, but I may not be aware that TODAY is March 31st. \n\nI have an entire week marked in my calendar as \"Amanda's birthday\" because I remember going to her birthday party that week but I don't remember which day so I just aim for around then-ish.", "I think that you have taken some good steps forward. Best of luck, hope it works out.", ">Probably should have mentioned this before but she has ADHD (which she is medicated for) so she has always been pretty scatterbrained.\n\nYeah, man, that would explain completely forgetting birthdays (maybe but not really).\n\nThat definitely doesn't explain this.\n\n>She hastily gets them off of Amazon from what ever shows up first on her homepage and just hopes I'll like them enough to not say anything negatively and uses them when I won't.\n\nC'mon, buddy. That's not believable.\n\nIf she cared about you and this problem, she'd just make a list of potential gifts for you, and have that instead. Or given Amazon has delivery times, take even a small amount of time, ten minutes, to find you something you might like.\n\nIf I'm panicking for a last minute gift, especially if I'm prone to it, I'll have a hidden list somewhere. If not, I'll frantically get something I think my partner would like... something like a pencil lengthener would be crazy to get someone who doesn't draw.\n\nLike, seriously. Pop off your homepage, and onto \"Gift Ideas for Men.\" Then pick something randomly, with a much greater hope. She's just lying to you, dude.\n\nEveryone criticized her behaviour, so she made an excuse, which you have bought hook, line and sinker.\n\n>She refused to look at my wishlist because gifts should be a surprise but when I brought up her list, she had no answer.\n\nYeah, or THAT. Of course she had no answer. This is a lie. She's lying to you. I mean, jesus, \"Gifts should be a surprise, so the surprise is I got you something you don't want at all. Hey, can I borrow it?\"\n\nShe lied to you, tried to rally the family to her side to peer pressure you, realized her behaviour was universally disliked, and decided to lie about it. Please do not fall for this. Leave this woman. This IS a deal-breaker, it's just a question of when you recognize it to be.", "OP - she ain't sorry at all. She's annoyed everybody took your side.\n\nGood luck with therapy but I think she's faking.", "NTA\n\nBackground info: I'm severely ADHD. Diagnosed back in the early 80's. Back then when it was still 'new' they were throwing everything in the medical cabinet at us kids to see what would work. Because of those meds I was almost unable to join the military because some of them were heavy duty mental drugs, (because like I said they were just using us as guinea pigs).\n\nWith all of that being said, and with the understanding that everyone is different even with the same diagnosis, she needs to get her shit together. She needs to actually address it and take steps to deal with it instead of just blaming her issues on ADHD. It can be done, it just takes work. I am no longer on meds because I hate how they make me feel like a zombie, so I have had to devolp methods for myself to keep my life straight. I have a 4' tall dry erase board on the side of my fridge that I make daily, weekly, and monthly checklists on so that everytime I walk through the kitchen which is central in my house I see it. I keep notes with alarm reminders in my phone.\n\nIt can be done, but it requires effort on her part. And while she needs to do it, regardless of her relationship status just for her own life stability, you will need to play a part in it and help her with it, with understanding, and **communication** (the #1 killer of relationships when it isn't there). It will most likely be frustrating. But you guys can do it :)", "I don't know if she's a keeper", "Having this condition does not seem like an excuse to me, even so, from what I understand, people take measures like this, she could have done many things such as writing down your birthday in a visible place, setting an alarm, even asking you to remind her 2 days before like that the gift would continue to be a surprise, what worries me the most is that she had to consult with her friends and half the world to accept that she was the bad one, it is worrying because there will be times when she will not be able to consult with anyone and, as things look, she never will recognize", "She isn’t sorry at all. The only reading she’s doing any of this is now all her friends and family think she’s an asshole and she’s worried about her image. She doesn’t care she hurt OP\n\nHer excuse also doesn’t explain why she would get mad at OP for trashing the gift. Because her excuse is BS.", "Yeah, that doesn't hold up. She couldn't spend literally 5 seconds typing OP's most obvious interest into the search bar?", "That is the sanest explanation ever! /s", "I mean. I do tend to wait till the last minute to do things for birthdays. I’ll buy the birthday card the day off for family (though that’s because last time I bought it ahead of time it ended up lost because someone else moved it and didn’t tell me). But I wouldn’t go on Amazon and by the first thing that’s recommended for me. Because that’s stupid and that’s a recommendation for me based off of previous purchases so that’s what Amazon thinks I want. My dad just had a birthday. We’re going out to eat to celebrate this Saturday though. He got one gift on his birthday and I’m giving him the other on Saturday. But I wouldn’t go out and buy him a video game Amazon recommended. I’m the one who plays those. He doesn’t really play them.", "Totally! My ex was similar with gifts. I would always get stuff I didn't need or that were just cheap. Like the one time he got me a chocolate rose for valentines. It tasted horrible and I would have been content with some good chocolate from the store. \n\nWhen you show them they can push your limit, it never stops. Line will always slowly be moved.\n\n I really don't understand people like this. How can you say you love someone, but act so bad toward them... Op deserves better.", ">This might not be her DELIBERATELY getting herself things via you, but it's still wildly disrespectful.\n\nI mean, let's be honest, probably.\n\nGift recommendations are one click away from your homepage. Why on earth would you stick to what's recommended to you personally?\n\nLike, how do you see \"Pencil Lengethener\", something you'd like, and which OP definitely wouldn't and decide \"Yeah, this will do. No more rushing needed.\"", "This.", "Found the girlfriend. If everyone you talk to thinks you're wrong, maybe you're just wrong 🤷🏻‍♀️", "There's really no way to spin her behavior into a way that shows she puts any real effort into her gift giving.", "It is typical for the normal meter to be messed up in relationships with problematic people.", "I noticed this too.", "Love goggles...", "Physical stores exist. Even if she forgot, she could probably go to Walmart the day-of and find something he'd kind of like.", "Not true. I only have \"moderate\" ADHD, and the amount of times I can forget birthdays and important events with multiple calendar reminders and even texts from others is staggeringly frustrating for me because I DO care about those people and events. The few birthdays that have managed to permanently lodge themselves in my brain, I'll still \"forget\" about repeatedly. You notice the date, go \"oh, it's X's birthday soon\" and it IMMEDIATELY flees your brain a second later because your brain latches onto a new thought or thing that needs to be done. This repeats over, and over, and over including on the day of and sometimes days after. Heck, I've put in calendar reminders with 10m, 15m, 30m, 1hr, 2hr, day before, and week before reminders as both notifications and emails and STILL been late and forgot the important event between most of the reminders. \n\nAccurate time awareness and future planning is a core component of ADHD symptoms. Someone being important to you isn't always enough to overcome the dysfunction of the brain, it only makes you feel more horrible when you fail. \n\nAs for \"It takes 5 seconds to open the calender on your phone,\" you aren't wrong, but you may be unaware of the absurd amount of time and brainpower it takes to make yourself initiate the process of something so simple. Trust me, I think it is stupid as well, but despite all my years of self loathing about not being able to just do something so simple and easy, I'm still unable to \"just do it.\" I try, I try again, I try harder, and yet...I fail a significant amount of the time. \n\nPersonally, I would have just ordered something they loved late and apologized, and not ordered something random. The girlfriend was definitely still the AH for his they went about dealing with how their brain didn't work. But I don't think it was as malicious as it feels to others whose brain actually works the way it's supposed to.", "Yes this so much... the other day I told a friend that I hadnt seen another friend since her wedding bc I dont know her husband well and would rather meet one in one with my friend sometime but that would not be possible since she is married now. The look on my friends face. Who would have guess that people in non-controling relationships dont get into trouble with their spouses when they spend any time without them", "Neurotypicality is a reason but not an excuse. If she isn't trying to put in place solid coping techniques that will help her remember to celebrate her partners birthday in a way that doesn't come off as totally disrespectful, then maybe she's so disabled that she can't handle a partnership and should work on that. \n\nOr maybe she finds a partner who has lower interpersonal standards and doesn't mind receiving a bowling ball named Homer for their birthdays", "I still think you girlfriend sucks. I have ADHD and forget many things, but my significant other birthday never! I always buy the gift months in advance and even get more than one gift. I'm sorry but she's just selfish.", "This is all about a a gift you didn’t like?! Crying  like a fucking 12 years old and bashing your GF for not getting the gift you want! If i were her i would run away.  YTA", "If your actually going to go to couples therapy then you should be paying half the cost. It isn't fair that she should have to take up the burden of two therapy sessions because she's clearly been struggling with her adhd, and hasn't found coping mechanisms for herself. \n\nYou should pay for the couples session since it's for BOTH of you and not just for her. \n\nBut honestly this relationship won't last because she hasn't learned coping strategies for her adhd yet, and your too resentful and haven't even tried to compromise like giving a heads up that your birthday was in a week or something. Not that you have to. \n\nYou dont sound ready forncouples therapy or that it will change anything for you. So you would be better off ending the relationship.", "I think the part I dislike the most is just how many people she tried to get on her side, just completely refusing to accept that she was wrong.", "I'm sorry if this is harsh, and I know you've been together a long time so it's harder, but your GF does not seem emotionally mature enough to really build a life with, and couples counseling before you're even engaged isn't a great sign either... might be time to move on and find yourself a bit", "What a fool.", "I will admit....I think using \"Throwaways\" is a pretty silly thing.  How does one not think that the offender won't see the post and know its them?  \n\nWith that being said I also think that \"She's also open to not receiving gifts for the next couple of special occasions which I will be doing\" is being petty.  What she has been doing is wrong as well.  You both need to do some growing up.", "> She refused to look at my wishlist because gifts should be a surprise but when I brought up her list, she had no answer.\n\nYour girlfriend SUCKS and I think it's very funny everyone in her life is on your side. \n\nGuess what? Her behavior won't change.", "NTA, that's a relatively positive update. However, I am the same as your girlfriend in that I constantly forget things. I have never missed a loved ones birthday. She is making excuses.", "NTA Good luck on the therapy...", "You have invested quite a few years into this relationship. However, when you start couples therapy and if you don’t see any positive results you should consider cutting your losses and moving on.", "My boyfriend has ADD and isn’t great with getting people gifts, so he looks at MY Amazon wishlist, and orders stuff off of that. For this past Christmas, he got me all but one thing on my list, completely cleared out. Amazing and easy. She just doesn’t give a shit", "From my experience with ADHD people, they don't typically forget the event, they forget when. So they'll buy a gift and forget to give it on the right day. Or they'll forget your birthday is the tenth and get all excited for your birthday on the 12th. \n\nSounds like she's using that as an excuse to continue being an asshole about what she gifts you. Because honestly? The issue isn't forgetting your birthday or other events, it's that her priorities are on herself always", "I like this update except the part about skipping giving her gifts for occasions. Don't do that. That is just retaliation and isn't healthy. Even if it is her idea it was born of guilt.", ">Many commentators said that my GF is a narcissist or has some personality disorder. Probably should have mentioned this before but she has ADHD (which she is medicated for) so she has always been pretty scatterbrained.\n\n*Proceeds to go into detail about her narcissistic behavior, explaining how she refused to acknowledge her mistake until there was no one else to tell her she was wrong because everyone already had, and also how she couldn't bother to put even a sliver of effort in for you.*\n\nYeah, she still sounds like a narcissist.", "Dude she literally took several steps to try to gaslight you but good luck to you both. I know love can't just disappear. If it were that easy, abuse victims could just leave their partner in the blink of an eye.", "I get adhd. I’ve got it, along with other stuff. While her past behavior is inexcusable, I’m glad she recognizes it and I hope she truly changes here on out. You deserve the same respect and attention that you give.", "OP how is your relationship otherwise apart from the gift giving aspect? Are you happy? Does she do things to show she cares about you? Bc from her explanation even if she’s not purposely giving you bad gifts, it kinda sounds like your happiness is an afterthought/unimportant to her.", "You should regift your \"gifts\" from her one by one for special occasions until you run out.", "My daughter and I are both ADHD. We both still take the time to buy thoughtful gifts. However she might need reminders.. I regularly remind my daughter about important events. Goes like this.. “Yo Kid! Your dads birthday is next month!! Yo Kid! Birthday is in two weeks please plan accordingly “", "Honestly in this day and age, I think that 'forgetting' an important day such as a birthday of someone you give a damn about is a bullshit excuse.\n\nAlmost everyone these days carries a device with them that has the capability of saving these important dates, and also setting a reminder for that important date.  So setting a reminder for a week or 2 ahead of time to give yourself time to get a gift isn't hard if you actually want to put in the effort.\n\nJust my thought.  I'm scatter brained as all hell, most likely have ADHD.  I set reminders for everything these days.  I even have one to remind myself I need to start making lunch or dinner because time blindness is a thing and I will forget and then we're all hungry because I started making stuff too late!  But I'm ad you are working it out.", "As a bad gift-giver, I have some sympathy for other bad gift-givers, but it sounds like she's never even made an effort.\n\nMy husband is a *great* gift-giver, and I try to respond in kind, noting down things that he specifically mentions throughout the year.  I have ADHD and autism, and the mixed inattentive and rigorously practical side of me always wants to say, \"We have $X to spare, order yourself something you need/want.\"  Because, honestly, he has very, very specific ideas of what he wants and likes to read reviews and spec out everything before a moderate-to-large purchase.  But I still *attempt* to give him a special surprise, even if it's something small.\n\nThis year, I found a McDonalds toy from 1991 on Ebay that he wanted but never got (the Batmobile from the Batman Return toys--an aunt gave him a big RC Batmobile for his birthday the next year, but that wasn't what he wanted).\n\nApart from that, I'll ask him a few weeks in advance what incredibly specific high-end supplies he wants for [hobby] and get him that, as well as making or ordering the cake of his choice.", "Dude she apologized until absolutely no one in the world was on her side, then proceeds with more bs excuses? You do you but at least really take a look at her without your rose colored glasses.", "So we Derrick you all worked it out. I love to hear happy endings!!", "Well since she has found the Post. \nHey crappy GF you show Little to no respect for your BFs likes and existence. He deserves better and he could find better keep that in mind.", "I think it's a wonderful start! Hope everything works out for the both of you.", "To be honest I can understand her forgetting birthdays. I have difficulty remembering a lot of birthdays of close friends and relatives. \n\nI found it can help to set a reminder at least a week before so I can purchase an appropriate gift. Or, if I see a great gift even months in advance I buy it then.", "Leave her ass like yesterday", "Honestly I have adhd unmedicated and a few other disorders. if she knew she couldn’t remember important dates I don’t understand why she didn’t write them in her phone’s calendar, my phone is literally a walking reminder for me.", "OP, this may be a tough pill to swallow but I think it needs to be said. Your girlfriend is downright cruel to you and it's very sad that you've been conditioned by what most likely is past trauma into accepting the absolute bare minimum. It is alarming that time and time again she goes out of her way to rally people against you in an effort to make herself look better. This is more than a red flag. You deserve better OP. You really do.", "We r happy you are working at it. Every relationship deserves both people to work at it. Just remember, sometimes even with hard work things don't work out and that's ok", "You’re kind of a pushover… please seek help… the way your girlfriend is treating you is not ok. The way you’re reacting to you GF’s “adhd” (that is not acceptable) are just you blindly accepting miss-treatment", "ADHD is no excuse to be selfish and uncaring. If she’s really as bad as she claims about ‘oh! I just forgot!’ She needs a system.\n\nA reminder every day for the 2 weeks before an event on her phone with like 3 alerts. Post it notes on the doorway to the bedroom with reminders. A ‘reminders’ list on the fridge. A calendar by the door that’s just for things she needs to remember.   \n\nShe could do any of these or all of these. It’s understandable to behave like this when you’re younger and haven’t learned coping skills. She’s an adult, and it’s selfish of her to expect you to just roll with it because she has a diagnosis. There are ways to manage this and it doesn’t sound like she’s doing ANYTHING!!!!!\n\nNTA", "Exactly like I bought my ex a keyring with his football team logo on it 4 years ago and amazon still suggests merch from that team for me. Bought a mate a decorative cat trinket tray n half my suggestions are now cat related stuff. Fact she can't find a single thing for op really shows she has never ever looked for anything for him.", "In reality, it's just a gift for herself as she'll end up using it. Selfish, selfish, selfish. \n\nHappy belated birthday to op. Hope you find kind people and partners in the future who at least think about you before buying gifts.", "As someone with adhd and medicated, I can attest to the fact that depending on how busy I am, I can forget to buy things for my partner for special occasions. It’s not cause I don’t care, it because I don’t have a good sense of time (time blindness is a thing y’all) so it sneaks up on me while I’m focused on other things. As a result, the things I was planning on getting are no longer available or won’t ship in time so I have to compromise. Sound like she panics which is totally normal. So no, it’s not a BS excuse. Could she be more thoughtful? Probably. But if she panics (especially due to the fear of rejection) reason sort of goes out the window. I can attest to this as well.", "Not even hoping he’ll like it, she gets stuff she wants because she plans on using it herself.", "This! I'm so bad with birthdays, even with reminders, but if I forget, it's an automatic \"oh shit! Happy birthday! I forgot again so your present will be late but it's coming, I swear!\"", "yeah and saying she “doesn’t need” gifts for the next few celebrations? that’s so odd and definitely trying to level out what she did", "yeah she's not sorry at all, she's just annoyed at how irritating this is", "Well, she got ticked about his trashing the \"gift\" because she was planning to use it herself when he put it aside as he had in the past.  She even straight up said that was her plan.  She was ticked she was out money that she spent on something ultimately for *her.*", "yeah I have ADHD and I know the difference between MY gift list and YOUR gift list\n\nit's not rocket science", "Thank you! I don’t understand all the people trying to explain this away with adhd. Yes, there’s time blindness and forgetfulness, but that usually comes with an apology and a sweet gesture if that person cares about you, or you them. Not them going to everyone you know to try and prove they’re not a prick for buying you things meant for themselves. Let’s not further stigmatise neurodivergence by saying it’s the reason someone is a raging asshole", "ADHD does cause time blindness, executive disfunction, working memory issues, and emotional disregulation, among other things though. While it doesn't excuse her behavior, it does in fact explain pretty much all of it.", "OP said she gave him a box of all the stuff he was gifted to do with as he wants. *Here's a box of the crap you didn't want!!!*  That's not an apology.", "As a fellow adhd, I have experienced a lot of people criticizing me for things that were unfair. I was bullied and punished just for exhibiting adhd behavior-impulse control and forgetfulness being the big ones. So I completely understand her going to other people first to figure out if what OP was saying was fair or not. When you’ve been unfairly targeted enough, you check with people you trust weather or not certain claims are valid. \n\nIdk if you noticed, but OP said that when she came to him with the post, they talked about things. That’s healthy. She didn’t freak out at him. Everyone has a right to a second or third opinion. As long as it means healthy discourse, what’s the harm? Copping to things without scrutiny can be a trauma response for some ND people who have experienced targeting due to their ND.", "[removed]", "yeah no she's the worst, forgets about a birthday or special occasion and doesn't just take the time to get a good gift still even if it comes late its the thought that counts", "this is such a frustrating attitude. as if people with ADHD haven't heard and tried the advice to \"just add a reminder\" 500 times. if our issues with forgetfulness and timeblindness could be solved this easily, it wouldn't qualify as a disorder and wouldn't need to be medicated.\n\ngf isn't excused by her disorder obviously, but your comment is ignorant and exhausting.", "Yes. You open the calendar on your phone and you see it's their birthday and you think to yourself, I will do a thing for that! But then you put your phone down and begin to do tasks, and now you're not thinking about the birthday any more you're thinking about this task and the next task and how to get allt he tasks done without losing steam or stopping in the middle and you look at your phone 800 times and see the notification every time and every time youre like oh yeah I need to do that! And then you arent looking at the notification anymore but you are doing something else and then you do something else and then the memory of the notification is gone. \n\nI'm not saying people with ADHD are exempt from remembering things, I'm just saying it truly isn't as easy as just setting a reminder. Everyone is different, and it might be that simple for some people. But some of us can forget things immediately after we wind ourselves to do them. I don't understand why it happens. But it's like setting down a note to look at it later but there's nothing there to set it on it just floats into an abyss but you don't know that it did because you were SURE there was a surface there.", "That's exactly what I do today. But getting there took quite a bit of specialized therapy. In the past I'd think, oh I'll put it in my calendar, finish whatever I was doing and by the time I was ready to move on to the next task (the CaleNDAR!!!!!), I'd already forgotten about it. It's like when you walk into a room and you don't remember what you wanted to do in there, except that's what your entire life is like. Sounds fake and exaggerated, I know, but it's the truth. ADHD has a lot in common with autism and can affect your life on a similar level, but it's often seen as a quirk or not that much of a deal, when it can be absolutely debilitating.\n\nEdit: OP's girlfriend is still the asshole, because none of that is an excuse.", "Honestly I wonder if narcissism is just adhd minus empathy and maturity.", "It doesn't explain her fixation on him remembering HER birthday and expecting expensive presents. It doesn't explain her inability to put any thought into another person. I object to that on behalf of all of us NDs.\n\nAlso an ADHDer and I am the Queen of the Last Minute Gift because of it. Take him out somewhere! Buy him tickets to an event for an artist he loves in the future! Take him shopping for a new coat.  Buy him a massage. Give him a massage. Make a beautiful dinner.  None of these require you remembering to order him a gift two weeks out so that it's wrapped up and ready to go, and all of them are about the gift recipient and not the gift giver.", "I also have ADHD and have a really hard time with dates.  A really hard time. But at no point ever in my entire life have I been this selfish about gift giving. That cannot be blamed on ND.\n\nAll my life, my anxiety about letting down others has been my most helpful coping strategy with ADHD.  Please do remember that hyperfixation is also part of ADHD, and if you care about someone and want to make them happy, ESPECIALLY if you've failed once in the past, that part can also kick in.\n\nIf you care about them. If you care about the mistakes you made.\n\nI'm not okay with giving her a pass on this one because of ND, I think that's insulting to all of us with ND.\n\nETA: Some of the very best gifts I have given people were done at the zero hour because of my inability to keep track of time. For instance, two months ago, my uncle in law's birthday sprang out of nowhere. LOL.  I spent two minutes thinking deeply about him and what he loved and then sent my husband a link to Cameo and told him to pick out a former player from his ride or die college football team who is now pro. This gift is now legendary- he was beyond tickled.  So no, no no. You can do something last minute and still have the present be about the person you're gifting to, and not about you.", "This is a bot comment stolen [from here ](https://www.reddit.com/r/AmItheAsshole/comments/127603c/-/jed1uem)", "When you have to have reminders for EVERYTHING than your brain starts ignoring them. Or you will see the reminder then forget two minutes later.", "I’ve got what I often refer to as fairly prolific ADHD. Between coaching, medication, a metaphorical support system, and a physical system that works for me, I’ve gotten *this* part of it to a far more manageable state than it’s been in years past. It’ll never be perfect or effortless, but it’s been worth it for me, at least. So while I also think “just put it on a calendar” is along the lines of “just cheer up”… I do think the spirit of the comment is right. We need to find systems that work for things (and people) we care about. \n\nThe thing is, ADHD isn’t an excuse for being an asshole, and it shouldn’t be used as a crutch. It sometimes feels like comments in this sub tend to just blindly write things off as ADHD, or use that as a reason to deflect criticism from themselves or others. It might be a *reason,* or a contributing factor to why things happened, but it doesn’t absolve someone of blame.", "I have pretty terrible time blindness and also can't remember dates. So I use a calendar app with reminders, because while I can't help it, it's my responsibility to deal with it. \n\nTo be fair, I also have anxiety about being a disappointment and terrible family member so I have all important birthdays memorized. Never forgotten any of those. My own birthday, though? Yeah. Have forgotten that once.", "I’m glad your friend helped you realize that this behavior (and thought process) is not normal and that you can get the help you need ❤️", "Also true! There's no winning! 😅😓", "It's true. Anxiety is my built in ADHD med, and it sucks.", "\"I Tried\" No she didn't. She tried to find something she likes. She's still the absolute asshole in this situation. I have friends with Severe ADHD and they still manage to not be assholes to their relationships like your girlfriend did.\n\nAlso, she's not sorry. She's sorry no one agreed with her and will probably appease you for a limited time. I'm sure in the next 6 months to a year, she will go right back to this shitty behavior. Why are you tolerating this?", "\"when I brought up her list, she had no answer\"\nYeah OP your girlfriend knows what she is doing!!!", ">She refused to look at my wishlist because gifts should be a surprise but when I brought up her list, she had no answer. She said she'll look at mine from now on.\n\nWant to know one of the secrets to my parents successful 40-year marriage?  My dad lets my mom pick out her gifts, he said it's less painful that way.  Birthday's and holidays my mom gives my dad a list and he selects the gift from that list.  It is still a surprise because my mom would have no way of knowing which item my dad had selected (pre-online wish lists).  She still hands him a paper list to keep it as a surprise.  That's another option you and your girlfriend can use.", "I get your GF has adhd but wouldn't a simple calendar help?  hey look it's my BF's bday next week, what should i get him?  hey look, we have plans for tomorrow maybe I should prep. hey look we agreed to do something so i'll put it on my calendar, or i'll put it on my todo list.  It sounds like she's making poor excuses and makes no effort to find a solution to help her (simple calendar).\n\nWhy would these issues have gotten worse after you moved in? that doesn't make sense to me.  I think she was taking you for granted since now that you live together, she doesn't have to make much effort\n\nI hope the therapy works for you individually and as a couple.  Know what you want in a relationship and don't accept any less.  You are worth being loved equally to the love you put out.  Don't settle for anything less and best of luck to you", "Just an idea... maybe instead of not getting her gifts the next few occasions, get something you both can do that is geared towards something you like.  That way you two get to do something together rather then building a gap, but it is something YOU want.", "I can only imagine being her reading through all these comments… I hope she doesn’t do that, because the guilt I’d feel would do horrible things to me. \n\nI don’t have ADHD, but I can imagine how hard it is to be always forgetting things and remembering last minute and getting distracted etc… \n\nA lot of people are saying “in that case she should get something you genuinely want” but does nobody else feel this immense pressure to make presents a surprise?? Getting something from a wish list feels like cheating. I relate to her in that I wouldn’t mind someone getting me presents from a wish list, but I would feel like a horrible and predictable person getting something that you expect. Idk where that comes from. I’m surprised so few people seem to relate and I never really thought about how irrational this is. \n\nI find getting people presents super stressful on a good day. I don’t blame her for remembering the date last minute and panic-buying a gift. My understanding from what OP said is she doesn’t get it because she wants it, but because in case it’s a bad fit, it’s not wasted.\n\nShe definitely should have had this honest discussion much sooner, and getting therapy is a great idea. \n\nOP is definitely NTA but some of the commenters… I agree that if this doesn’t get resolved through therapy, the relationship might need to move on, as this behaviour is not healthy, but come on, imagine how she might be feeling right now.", "I have severe ADHD and memory loss issues from PTSD.\n\nThis is not normal. These behaviors can't just be chalked up to forgetfulness stemming from neurodivergency.", "Look, this is your life but I do think you still have rose colored glasses on.\n\nEveryone told you how selfish she was being. She sees the post and instead of thinking about her behavior, shares it with her friends, who admonish her. Then to her siblings AND your family, and NO ONE takes her side. Only after failing to find a single ally does she apologize. \n\nThat is telling my man. She does not care about you. If she did, she would use this new fangled device called a cell phone to put in an annual reminder to buy a present for you. SHE DOESN'T. \n\nShe has your Amazon wish list but figures it is better to buy you something from hers. BS.\n\nYou share how much it hurts you when she does this and she DOES NOT CHANGE. It takes the internet, her friends, her family and your family all telling her she is wrong for her to do the bare minimum. \n\nYour girlfriend is extremely selfish and self-absorbed. Honestly I don't see a happy ending. Heaven forbid you guys have kids and she does this to them because she WILL.\n\nIt is your life, but don't think because you have been together a long time, you have to stay together. Look out for yourself. You don't want to get gored by a bull, who is attracted to all the red flags your GF is waving.", "So, we all agree that the apology and excuses are bullshit? ADHD isn't an excuse for this, she doesn't give a flying fuck about you, OP", "I'm glad the GF seems to have recognized her behavior, and is trying to do better, hope that actually continues for OP's sake.  \n\nHonestly, I think refusing to even look at someone's gift wishlist because \"gifts should be a surprise,\" is kind of selfish behavior on the part of the gift-giver.  Yes, it's the thought that counts and all that, but the girlfriend's mindset here seems to be that her enjoyment of \"surprising\" OP is more important than getting him something that he actually wants.  And then what she actually does get him winds up being thoughtless and last-minute.  Just pick something off the list, then you know the receiver will be happy and they'll still have the surprise of not knowing which list gift they get.  Or you could get a list present and add in a little something extra that you pick as your \"surprise.\"", "OP: The optimistic reading of this is that she is realizing that she messed up and she's trying to get better. The pessimistic reading of this is that she is still bullshitting you. Which one is reality is up to you to find out. I wish you luck, but please keep an open mind and an open eye towards her and her behavior so that you're not taken advantage of going forward.", "Sorry but everything you described about her completely points to her being a narcissist. Good luck ig.", "Congratulations on getting a constructive process started.\n\nHappy (very belated) birthday.", "hope she improves after this because it's a bit infuriating that she keeps buying stuff for her and passing it like a gift for you, sounds like an endless Simpsons episode when Homer buys a bowling ball for Marge", "I'm probably late here, but this \"I've got ADHD\" Is a lame excuse. I know this because I do have it myself, I'm also an artist too. Not that I'm trying to be extra harsh but it just sounds to me she does not care at all on gifting you meaningful things and just is pushing herself to seem like she does to save face. \n\nI get the forgetting dates thing, that's why I have alarms set for the week I gotta buy gifts. I plan with time to spare bc I know I'm gonna forget and because I care abt my boyfriend. Him, ont he other hand was an awful gift giver because he grew up not receiving them himself, ever. But since we are living together he pays attention to my interests and gifts me accordingly. He learned because its important to me and I never said a word about it. \n\nTo sum it up: if she doesnt care, no ammount of therapy is gonna change that. I'd have a open heart discussion about everything. Best of luck to you OP!", "This isn't over. It took the entire world telling the gf she was wrong before she apologized. I hope it was a real apology.", "Thank you for updating! I don't think the gift-giving issue in itself is a deal-breaker... but her unwillingness to be held accountable until brute-forced by the collective and her absolute trash explanations/excuses are harbingers, man. It gets worse when you live together because this manipulation stuff has patterns, and she's showing them.", "Your gf sucks.\n\nI hope therapy helps.  But I hope you also learn to not tolerate her bs anymore.", "I wasn’t expecting a break up to be honest, but I’m glad she’s acknowledging her mistake. Hopefully therapy helps. If she still doesn’t change, then at least you know that you tried", "She's still pulling your leg OP. Hopefully, counseling will work. But unless she is open to making changes, don't count on her changing how she is.", "Dude I constantly forget everyone's birthday!! Genuinely thought my best friends birthday is this month, when it's not till May. However the solution I have for that is everytime someone brings up a birthday I write it down. Some apps (particularly snapchat) even show the birthday month so that helps too. ADHD isn't a excuse (because there's solutions other than what she did) but it definitely explains it. I can definitely sympathize with the realisation that she totally forgot and the rush to try to get something, anything even. For her it might be ultra embarrassing to completely forget so getting something at least shows some level of remembering. Hopefully now she'll do better", "No, this sounds like a totally adhd thing to do.  Probably, She remembers his birthday a couple times a day, but then gets distracted by other things. And yes, that can include getting distracted on the wall from the toilet to the computer to place an order, because adhd is crappy like that.\n\nThis isn’t a free-pass for bad behavior. It’s a sign that her systems aren’t working, and she needs to find new support methods - to do list (phone or paper), checking on if she needs a med change, doing certain tasks in the time of day she has the best executive function, etc.\n\nShe’s making the mistake here, but it’s not unfathomable, if you have adhd, how this is not an intentional mistake. \n\nI wonder if she was shamed for it as a kid, and is using maladaptive techniques to try to hide her mistakes rather than admitting them (even to herself).", "Amen to that.", "I often really stress out when getting things for people. When I’m having a bad week/month trying to get a present for someone can literally make me cry. I have also always felt massive pressure to make sure a gift is a surprise. I can only imagine how stressed she might get when she realises “oh shit it’s tomorrow” and panic buys something. She can’t get something from the list because that feels like “cheating”. And some people are really hard to find gifts for beyond something they specifically want. \n\nShe definitely should have brought this up with her bf sooner… and she should accept the wish list, despite her instincts. But I think everyone is being really harsh about this detail, while she probably genuinely feels bad about it.", "She has an idea of what he'd like, she even had a friggin list, OP said so in his original post.   He also said that she refuses to look at it.  \n\nADHD has it's issues, undoubtedly, but it's not an excuse or justification for being a totally selfish, narcissistic, lying asshole, which is what gf is.", "Ahahaha. Notifications just blend into the background for me. The only reason I remembered my best friends’ birthdays in high school was because they were all in a cluster right before school started. Not to mention the disconnect others have mentioned between dates and time—sometimes it’s like having two timelines (that’s when I double book myself because things on the work timeline don’t exist in the home timeline and vice versa), and sometimes it’s like important dates are entrenched in my memory but have no relation to the real world. Like I sometimes forget Christmas is coming because I know Christmas is December 25. I know that it’s currently December 21. My brain does not consistently connect those two known facts to conclude “Christmas is in four days.”\n\nThat being said, there are absolutely things OP’s gf could be doing to manage her symptoms so they aren’t hurting or burdening others. Maybe notifications would work for her. Maybe a dedicated physical calendar. Maybe she needs her medications adjusted. There are strategies to cope with this that would at least keep this stuff to an occasional oops rather than a constant pattern. \n\nIf I had to guess, based on OP saying she got worse when they moved in together, I would guess that she shifted a lot of the mental load of timekeeping to OP when they moved in together. It probably wasn’t intentional, just a subconscious reliance that “oh, if we have plans then OP will remember and remind me.” If they’re okay with that in their relationship, that’s their business. But it does mean that when there are things that she needs to keep track of FOR OP (like his birthday), she’s not going to be getting the same prompts from OP that she may be relying on otherwise (because I’m guessing, like most adults, OP is not going around reminding people of his upcoming birthday).\n\nNot that I’m excusing her—she needs to manage her own symptoms or at least be open when she needs help. And I’m not saying it’s in any way OP’s fault when I speculate that she may be leaning on him for help with time management—this is her responsibility; OP shouldn’t have to nag her about his own birthday. I guess I’m just saying that it’s very plausible her explanation is legit.", "It's not even that. When you fuck up ADD can explain why, however ADD is not reason for an utterly shitty reaction to someone else's disappointment. Nor it explains the need to gaslight your partner that they have no right to be upset and then go around bitching about it to others, only changing your mid when everyone said you were in the wrong.\n\nShe is seriously mental and not a partner material.", "True! Currently planning for the coolest bday present for my friend...includes a handmade painting of Eddy, a Funko pop, a pokemon card of her favorite pokemon(s) and a pride flag\n\nHopefully it'll make up for me forgetting her birthday every year lol", "No, it doesn't. And I say as a person with ADD.\n\nADD doesn't make someone a huge asshole that doesn't give a shit about other people's feelings. If anything, the blindness makes you apologetic and frustrated AT YOURSELF", "[deleted]", "That’s why I love Alex. I’ll be in the middle of something and remember or find out something important is going to happen and will ask her to remind me before I move on to something else. That or drop everything I’m doing to write in my very large paper calendar that’s by my bed.", "[deleted]", "I’m not giving her a pass on what she did, I’m saying that her reason makes sense and internet people need to stop telling others that they don’t know that their SO’s are terrible people. \n\nLike I give really good gifts. But usually I have to start MONTHS in advance to make sure I’ve figured it out on time. But I got a new job recently as well that has gotten me very busy so I’m realizing just how time blind I can be. Like this post is actually a good reminder to start figuring out what I’m going to get my partner for his bday at the end of June. No joke. \n\nMy main point was that just because someone’s reason doesn’t make sense to you, doesn’t mean that they’re an “abusive narcissist” or whatever these armchair psychiatrists like to say. Like these comments with people being like “she’s full of shit” when honestly I was glad they could work it out with minimal drama just drives me nuts. I think it just flies really close to “it’s not ND, they’re just an asshole” thing which is super damaging.", "Bold of you to assume they aren't for severe ADHD. My personal issue is I can usually set myself up to be re-reminded enough for those things, but I'm CONSTANTLY being surprised at what the current time is in relationship to the  time I need to leave. \n\nUnfortunately, to keep on time, I basically have to cut aside huge swathes of the day in advance for those things. 2-3 hours before I need to leave to make sure I have time if I need to finish up what I was working on, another reminder to make sure I have time to eat or change if needed, another to make sure I'm not dallying too long making decisions, another to make sure I had time to let the dogs out before I leave, another to make sure I start grabbing things before I leave the house with enough time...It takes SO much effort, time, and energy to not forget or be late to such things that there is rarely enough reserves to do the same for non-critical events. \n\nDon't get me wrong, birthdays are important, especially if they are important to the person having one, but it's not typically \"critical\" for my ability to function as an independent adult. Missing a train, bus, airplane, or leave time for work is directly and personally impactful, and can lead to you but having income to survive or completely missing out on something personally imperative. Someone else's birthday is also a bit \"random\" as it relates to yourself and the relatively infrequent amount of times it happens, so it's much harder to remember. \n\nThere's also a big difference between remembering a birthday and acting upon that knowledge. I may remember Christmas is coming repeatedly, but taking the time to prepare in advance for it, like buying gifts, is much more difficult to instigate. Same with birthdays. I may remember multiple times it's my parent's birthday, but actually picking up the phone for a text or call is a weirdly difficult hump to get over. \n\nI swear I try, I'm just often not successful.", "I absolutely think the GF is an AH, it may or may not be exasperated by her ADHD. I commented elsewhere that I keep a list of gift ideas on my phone I add to all year so I don't go blank when it comes around. For me it helps to have reminders of X many days to X's birthday or major holidays because I can't keep track of time. \n\nI just thought the comment I replied to was flippant and ableist about people with neurological disorders.", "What I'm finding interesting is that buses, trains or planes or even going to work on time isn't forgotten. But bf's birthday, that can be forgotten, not important enough", "yes, obviously many people who struggle with ADHD are also regularly late or miss things other than birthdays? though something that happens every day is easier to keep track of than something that happens only once a year.", "I’m like that in my personal life but professionally I swing the other way where my anxiety makes me put things off and I have to force myself through it so I don’t fail y my own job lol.", "I'm going to strongly disagree with you that her reason makes sense, if you mean it makes sense because she has ADHD. The timeblindness, yes. Absolutely. Everything else, no.", "ADHD didn't make her pick out a random item and present it as a gift. ADHD only made her lose track of time. She could very easily have just ordered a gift, Apologized for it being late and giving it to him then.", "Yeah, I can definitely get that.\n\n> I commented elsewhere that I keep a list of gift ideas on my phone I add to all year so I don't go blank when it comes around\n\n& I love this!\n\nI’ve actually started keeping “gift bins” where I store presents I buy throughout the year for the folks I know best, so I have a supply I can raid when needed lol", "I’ll say that for me at least, there’s some truth in that lol. Not a loved one’s birthday — that’s sometime I pull out all of the stops for — but for other things that may seem important to others. \n\n￼For me, I’m a fairly high-anxiety person as well, so events that can cause Big Consequences are a lot easier for me to keep track of. \n\nMissing a plane? That’s a lot of money I’ve just lost, and it will probably detrimentally impact my relationship with people I care about, whether personally or professionally. Those are Big Consequences, so I’ve never missed a plane.\n\nBeing on time for work? Well, this one I can’t fully claim, but I’m almost always on time for my first meeting at least. Internal coffee chat with someone I’ve worked with for years? I’ve had to push those out sometimes, admittedly. Client? Depending on what I know of them, I’m either right on time or could be a few minutes late. CEO? I’m there early and camera-ready.\n\nBuses and trains? Well, how much will they set me back? If it’s 4 hours before the next one runs, that’s again a Big Consequence, so it gets flagged mentally. If they run every 8-15m? Yeah, I’ve missed a few of those.\n\ntl;dr is that the bigger the potential consequences, the easier it is for me to spotlight it.\n\nFamilies and SOs (assuming healthy relationships) are sometimes easier to fudge in that way, though. They’re safe zones, and you know you have more leeway with them than you do with your grandboss or the ticketing counter, so the consequences are usually smaller. That said, for things like birthdays, or other things that they’ve told me hurt them or are important to them, those get a bit more lit up in my brain too, because to me hurting someone I love is also a Big Consequence.", "Literally even in a situation like when I’m gaming, if combat gets tough I panic bd lose my dang mind 😭 like I don’t even feel like I’m control of my own body anymore and I can’t see what I’m doing.", "Are you me? The person who shows up 2 hours early to make sure he's not 3 minutes late?", "That's a very good idea :)", "Um, we have:\n\n-\tphones\n-\tpost it notes\n-\tpaper\n-\tcalendars \n\nAnd a whole lot more things to make notes, track events like recurring birthdays, etc,.\n\nI have ADHD and there’s zero excuse for someone not doing the minimum of *writing things down* or using tools to avoid messing up events.\n\nShe’s using her ADHD as an excuse instead of being aware and taking steps to compensate. If she’s medicated, she has even less of an excuse, assuming the meds are effective.", "> She's also open to not receiving gifts for the next couple of special occasions which I will be doing.\n\nWhy?  Do you feel she needs to be punished?  Or that the relationship is transactional, and she has a debt to work off?\n\nShe's apologized, she's trying to make amends, she's promising to do better, so why are you feeling the need to punish her?", "Hopefully now that she’s seen many people think she’s wrong she will change. I don’t think this is relationship ending over if she does change. Good luck!", "Oh, hon, just the fact that she went trolling for votes and kept going and going and going, hoping to find that one person who would agree with her, is a HUGE red flag. (No, your asking for feedback here is not trolling for votes.  People who troll for votes desperately go looking for “support” in order to manipulate their partner or friend so they can avoid taking responsibility for their choices. You were second guessing your instincts, looking for feedback.)\n\nLet’s take this out to its logical conclusion.  Say you marry her and you get into a marital spat.  Do you really want your dirty laundry aired in public when she’s the one in the wrong but goes trolling for votes to avoid taking responsibility?  This is her way of managing conflict.  It’s not healthy, and in fact, it’s destructive.  You are way too accepting of this.  Somehow, you don’t see this for the abnormal behavior it is.  \n\nI don’t see therapy working well in this scenario unless she fully understands how her entire set of behaviors is wrong and she’s willing to do the hard work.  This isn’t really about gift giving, not at the root.  She seems to recognize (now) that her gift giving behavior is messed up, but has she ever acknowledged that the way in which she managed this conflict is equally messed up?  This doesn’t have anything to do with ADHD.  This is about CHARACTER.\n\nAssuming you really love her, space is in order. Separate your living situations while you’re in therapy and watch her actions.  Don’t move back in together until you see meaningful change.  How will you know?  If you have a fight and she doesn’t go around trolling for votes and you both hear each other’s concerns and can both validate each other—-THAT’S meaningful change.", "Hi I am glad to hear it.   \n\nI have  ADHD very badly and my own birthday is a struggle.. and the thing I do is shop for individualised presents all the time. If anyone's birthday is tomorrow I am set. With DH I do that and a gift voucher. \n\nOne thing my bad memory  did to me when I was young  was make me seek others opinions about reality, so I do not think your gf is necessarily sinister there.  Just believing others perspectives took me long decades- and I still often want to  react defensively.    \n\nI had to learn to  just believe people that I forgot agreeing to things, or forgot events or mucked up ,  to never make promises or commitments that involve me remembering(I wont so making agreements that factor that in helps) to have all bills paid automatically and to use regular professional cleaning and how to make heroic efforts for things like birthdays and appointments ..", "ADHD? OP, please… no. She’s just selfish. Plain and simple.", "if your gf has trouble remembering your bday due to her adhd ask her to buy you something she knows you will like as a present whenever she sees it and to put it in the \"emergency gifts box\" when she gets home. that way every year she can pop to the gift box on your bday/xmas/aniversary/valentines etc and pick a thing out. it shouldnt be too hard for her to on the spot see something in a shop you would like and buy it and pop it in her handbag. then even if she forgets she did that the next time she looks in her bag when at home she will see it and think oh yeh i better pop it in the gift box.", "Hi, I’m sure I’m one of a million people with ADHD commenting and here are my two cents:\n\nI am medicated. I forget things often. Like VERY often. Yes, I have missed my bf’s birthday before and legitimately forgetting to buy a gift is a thing even if you set a million reminders. Most ADHDers I’ve read about/know seem to experience the same dilemma when trying to start and complete a task: executive dysfunction. This is specifically when you cannot *bring* yourself to do a task that might be so simple to others but to us it’s nearly impossible; however, *once we begin the task we are usually able to complete it to a satisfactory degree.*\n\nNow, I’m not talking about big projects that take a long time like painting, knitting, woodworking, etc. I’m specifically talking about tasks like dishes, vacuuming, chores in general or, you know, *buying someone a gift*.\n\nSo when it comes to buying a gift for someone, the struggle is with: 1) remembering to do it and 2) getting yourself to do it (although let’s be real it’s not hard to get online and look for something and buy it). I know personally, along with others, I hyper-focus on gifts and end up searching for hours for the perfect gift for someone, sometimes over the course of days.\n\n*What she is doing is not because of her ADHD.*\n\nShe is putting no thought or effort into what she’s getting you and considering you have a wishlist, she doesn’t even have to! It’s made so easy for her *especially* if she’s medicated. Her ADHD is not an excuse for her lack of caring and even if you’re not excusing her behavior, it’s not even a valid reason for her to buy the first thing she sees. I mean let’s all be for real here, everyone at this point knows how algorithms work so I have a hard time believing that she genuinely “hopes you’ll like it” when she goes to buy it considering you obviously haven’t been into her gifts previously.\n\nI’m calling BS, I’m calling shenanigans. I hope you get this situation figured out because I feel like in the future a lot of her shortcomings are going to be blamed on ADHD.", "Listen, she is making excuses.\n\nIf you have diagnosed ADHD and do nothing to combat it or make your life more manageable, you are basically saying you have a problem and it's now everyone else's problem.\n\nTell her to start using her Google calendar more. There is no excuse for forgetting a birthday.\n\nAs for the wish list idea, that was a great compromise. Her lack of wanting to use it is another bad excuse. I think she'd be happy to have that list! Less guesswork! She would rather get you a selfish gift than an expected gift. \n\nAnd, it's not as if she is giving you a crap gift that no one can use; she is literally getting herself something!!\n\nThe fact that she knew what she was doing to the T makes me think this was all planned out. Don't let her use her ADHD as an excuse.", "OP, I hope you see this. You said it got worse when you guys moved in together, would that also correspond to her changing contraception methods? If so, it can have major effects. Like, my contraception method was rendering my ADHD meds almost ineffective.\n\nI am no medical professional, but if that applies, Google \"ADHD and progesterone\" and she should talk to her doctor. \n\nIt might have nothing to do with it, but since it's common for people to change contraception methods when moving in together, it's worth talking mentioning.", "ADHD isnt a personality disorder and it’s not related to narcissism. Also, being a thoughtless gift giver isn’t a symptom of ADHD and neither is buying something for oneself and giving it to someone who doesn’t want or use it so that you can take it back without giving them a real gift. She has ADHD and is ALSO either a narcissist or just a dick.", "Awesome update. Good luck with all of your therapies, individual and couples. Hopefully she will get individual therapy as well and stick to it. Her admitting to her faults was a huge step and you acknowledged her step. That will help with couples counseling. It was actually good she got so many involved because she sees it wasn’t just those on your side but from her friends and family as well. Sometimes we need that. Good luck in the future. I hope things work out for both of you!", "Also what kind of f*cking adult gives stickers to a grown man for his birthday?! 🥴", "OP, sorry but based on all you wrote, I'm not optimistic about your relationship. Kind of like throwing good \"money\" after bad. Only you can decide how much you want to throw away until it is too much.", "I have ADHD, the only reason I don't forget is because gift giving is one of my love languages, but I have left it to the very last minute for acquaintances and such. This sounds very plausible.", ">She hastily gets them off of Amazon from what ever shows up first on her homepage\n\nI think that part is another lie. She clearly just gets something for herself, and trying to obscure that in \"I panicked\" is not a good lie. I'd be miffed if after all this talking she's still clinging to a \"it's not THAT bad\" modifier instead of just admitting she was wholly and completely self-serving.\n\nLike it's one thing to have an incident where you were completely selfish (we've all been there) but not admitting to it and convincing herself/her BF that she was better than she was? That means her apologies aren't real. You can't move on and be better in areas where you refuse to admit you're wrong. \n\n&#x200B;\n\n>when I brought up her list, she had no answer. She said she'll look at mine from now on.\n\nThe fact that you have to \"gotcha\" her into looking at your wishlist instead of her being willing to from a place of love and caring about what you want... Yeah. \n\nGet out of there", "This dude is like an abused and conditional partner. THIS IS NOT OKAY. She is full of sh*t! I have ADHD and you know what OP? I am an attorney, don’t forget special occasions or plans. There is a thing called a calendar you can use on your phone and set reminders. Also let’s be real, she is specifically buying presents for herself she’s just blatantly lying to you dude. Snap out of it! Your friends and family need to have an intervention.", "I am not going to edit my previous comment, however due to autocorrect it's almost Charlie talk. Many apologies, however, I am glad people know what point I was trying to make.", "Right?? I'm not always the best with dates; I've definitely had to do the last minute Amazon gift scramble. But it's really not that hard to find SOMETHING on Amazon the giftee will actually like. Maybe it won't be the perfect gift if you have to pick only things with two day delivery or whatever, but put in ten minutes and you will at least be able to find something at all relevant to their interests.", "“Better late than never” and she chose “never” lol", "Ha, yes, pretty sure I'd forget my own birthday if no-one reminded me. I keep forgetting how old I am too.", "Right? This excuse would work for kinda mediocre gifts (\"she always just gets me a mug with my favorite baseball team\") but not for not even trying that little bit.", "I honestly see no progress in this update.  GF got caught and shamed.  All her actions about HER still.  Getting people off her back.  I won't be surprised when we get the third update in 6 months about how she is still the same.", "straight up lmao", "I remember my loved one's birthdays because I have them in my calendar, but that doesn't help my awful ADHD time management get around to ordering gifts in time. I'm terrible for last minute panicked shopping because I procrastinated then forgot until it was too late (not forgot their birthday, just forgot I should have ordered the thing a week before their birthday), but I've still never been this lazy about it. I might not get the perfect gift because now I'm limited to what I can find locally today after work, but I can still manage something I actually think they'd like and use. Like, this might be a reasonable excuse for not managing to pull off super thoughtful, hard to find, take tons of time to put together gifts, but its not an excuse for not just going to a store they like and grabbing something that lines up with their interests and taste.", "I’m not at all defending OP’s gf but it doesn’t always work like this.", "\n> She has an idea of what he'd like, she even had a friggin list, OP said so in his original post\n\n\n\nYeah, I’m saying needing a list to get an idea of what he’d like shouldn’t be a thing after being in a relationship for 8 years. \n\nYou should just actually know the kind of stuff your partner likes by that point. \n\nWhat’s his favorite movie/game/show? Get him a poster/figurine from that. Does he have a favorite author? Get him a signed copy/first edition. What kind of clothes does he like to wear? Get him some of that kind of stuff. What does he like to drink? Buy him a bottle/case of that. What’s his favorite food? Make that, or find some place that sells it. \n\nAll of that is stuff you should just know about your partner after a relationship that spans the better part of a decade. It shouldn’t be hard to think of a gift they at least kind of like after 8 years. \n\nLike, even if you get them a different type of Scotch than they normally drink, or you buy them a Star Wars poster from the sequel trilogy, at least show that you know they like Scotch and Star Wars.", "If you look at the original post you can see this is not the first time this has come up. This has been an ongoing issue that he has brought up before. He has proposed solutions and she has rejected them without even attempting to change her behaviour at all.", "I mean honestly it’s unhealthy because she’s being manipulative. Sure, I’ll give you the “tour de poste” but that’s not even the issue.\n\nBuying the first thing you see on Amazon isn’t ADHD, it’s not caring. It’s selfish.\n\nThe kicker is she knows that, especially if they’ve had the conversation before! So sure, calm conversations are healthy but saying you can’t figure what to give him when he has a damn wish list set up for you *after* he’s asked you to buy from the wishlist…is just being a bad girlfriend.", "I agree with you, actually, by that point she should know.  I was just pointing out that in addition, in case she's *that* oblivious and uncaring, that she actually has a list, but refuses to look at it.", "I have ADHD and giving people gifts I think they would love is one of my favorite things! Gifting is definitely my love language. And I have accumulated long lists of things I think my partner would like so when occasionally a special occasion does sneak up on me I've got a bunch of possibilities ready to act on!", "Tbh, it’s a moot point, since she straight up admitted to planning on using the “gift” herself, which proves that she wasn’t just panic buying something and hoping he’d like it.", "I wish I could say I forgot only once. It happens almost every year. My husband usually wakes me up by saying happy birthday, and my brain goes, \"It's my birthday!\". Last year, he had to leave early for work and let me sleep in, and when he got home with flowers and balloons and said happy birthday, he said my surprised Pikachu face was hilarious.", "Well she is full of shit and it’s not ADHD and she is just being an AH…I know you said you’re not giving her pass, so then I won’t give her pass. If she feels it’s damaging, maybe don’t be an AH.", "\"I keep a list of gift ideas on my phone I add to all year so I don't go blank when it comes around\"\n\nThat's such a good idea! I absolutely need that.", "True.  \nI think OP is far too forgiving of the gf; she's lazy, uncaring, inconsiderate, and narcissistic, and teying to justify it with her ADHD. But, really, that's a moot point too. Not my relationship, and looks like OP has decided to stay. 🤷‍♀️", "Not everyone is the same and not everyone has had the same experiences or has the same reactions to situations. Background, life experience, trauma, acceptance, and relationship dynamics all contribute to how we react in certain situations. Everyone is so quick to jump to conclusions when they don’t even know this person. If she had blown up on him or turned it into a massive fight once she found the post, I’d say yeah it’s BS but it actually sounds like she handled it within the scope of reason. \n\nSometimes it’s about meeting people where they are at and balancing between giving grace and having boundaries. I feel like a lot of people get on this subreddit read something that triggers them and they freak out and feel like they have to save the OP. I’ve been there. It’s easy to do and sometimes I have to click off here because I’m getting triggered. \n\nMaybe she is an awful person who is abusing OP. But it’s more likely she’s human and fucked up and went about it all the wrong ways. What would this subreddit say about some of your more unflattering moments? If you read about something you’d done that was shitty without knowing who the person was, would you still give yourself grace?", "I even do it with my husband because my mind goes *blank* when facing a deadline or pressure. I wrote lists of questions for job interviews, lists of tasks at work, and even just to tell someone something when I see him next. \n\nI didn't learn these coping mechanisms until I was diagnosed (at 41) and able to give myself grace.\n\nETA I keep it in my notes app and link the item", "I ain’t ever heard of not one person with ADHD (myself included) but a gift for someone that’s really for themselves because of their ADHD.\n\nSure, she might have some trauma and stuff that might lead to her doing that, but it’s not ADHD. if she made a mistake, she needs to own it and not blame it on her disability if it’s not a contributing factor.\n\nThis isn’t something you meet people halfway on.\n\nETA: I like you’re saying her trauma responses might lead her to being selfish and to give some grace but then shame us for being triggered that she’s using our disability as an excuse for something not related as if we don’t already get enough shit for it.", "Truly wish you luck in working through this and hope your relationship improves for you.", "As someone who has ADHD and is married to someone who also has ADHD (very well versed with the subject matter), one cannot make excuses for their ADHD as a reason for being a shitty individual.  While ADHD might mean that we are pre-programmed to having inherently 'selfish' behaviors, it also means that we have to try that much harder to be self-aware of our thoughts and actions, and try to course correct where possible.  \n\nWhile you did not mention your GF blaming ADHD for her issues, it appears to be driving some (most) of the selfish/negative behaviors affecting your relationship, and she is not trying to work on them.  She has accepted them as normal, and until now you have as well.  I hope y'all work it out.  \n\nINFO: In addition to taking meds does she see a therapist?  I find that both meds + talk therapy have been crucial in addressing and rectifying ADHD driven behaviors that have negative consequences.  I was diagnosed as an adult, thus I have YEARS of 'learned' behavior that I am still trying to work on.  It is not easy.", "Sounds like you two need to end.", "Tbh this does sound like an adhd thing, and i don't say that as an excuse; she needs to try harder if she actually cares.\nSome advice from someone who has adhd as well; don't wait to buy gifts until special occasions, buy them right when you see something that you think that person would like, and then put them in a box marked \"gifts\". If you always put them away there you won't lose them, and if you forget and buy and extra gift, then you have it for next time. This both takes the pressure off getting a gift quickly, and ends up with more thoughtful gifts because you're looking over a longer period of time.", "Listen here  bro adhd is not an excuse .as a medical professional ( a nurse who worked in psychic hospital for over a year ) nearly all of my adhd patients are forgetful guess what they do? They are have a reminder ( notebook or using calendar app ) heck i even had a patient where she had 8 different reminder just for her husband birthday so she will get him a gift , cake and prepare for it . I would strongly recommend u look deep inside of u and see if its worth it to stay in a relationship  with her for 1 more year ( until ur next birthday) if u find even 10% doubt i would recommend to break up . You had an amazon wish list it takes exactly 3 mins to open it and see something with in ur budget to get as a gift and pay for it . To me if she flat out told me she forgot and got me a gift the next would be 10 times better than this excuse she gave u", "I'd given this a trial run to see how you like it. This genuinely does sound like ADHD behavior and not just BS because she's opened a pathway of possible reparations that will be enforced by the people around her. I wouldn't even say you're a doormat. You have a learned helplessness that teaches you to take stuff you aren't happy with on your birthday of all days. I'd bring this up with her too and ask if you could set some exact boundaries so both of you kind of know what to expect from another. This seems like it could work, however it's in your ballpark", "Bro get a grip", "I have ADHD and I'm a very thoughtful gift giver so that crutch is BS.", "Something from the homepage which is based on previous things she looked at/bought, likely for herself. If only she had a list of items that she knew OP would like…. I get the desire to not use a wishlist. A wishlist isn’t so much you getting the item for them than as it is just paying for the item. Essentially a gift card without the gift card. But if you’re getting something last minute, better a gift you know they’ll like than just rolling the dice on some random crap that has no thought or care to it.", ">  \n\nThis is probably a result of her ADHD. Even with medication, it still takes a lot of skills training to get to a point where it doesn't impact your life. \n\nMy guess is she forgets until the 11th hour, panics close to anxiety attack, and just picks the first thing that shows up *that will ship in time* \n\nu/Salty-Pension300, you might want to recommend your gf get an adhd coach or do adhd skills work to get a better handle on these thing. My guess is it got worse after you moved in together because it gets harder to track days when you're always together.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "OP doesn’t really strike me as the sailor moon type on top of it lmao", ">She hastily gets them off of Amazon from what ever shows up first on her homepage and just hopes I'll like them enough to not say anything negatively and uses them when I won't.\n\n...which def plays into the selfish gifting because that homepage is completely tailored to her, and only her, buying habits. Virtually impossible for it to suggest anything you specifically wanted unless you have several shared interests.\n\n>She refused to look at my wishlist because gifts should be a surprise but when I brought up her list, she had no answer.\n\nAlso, fun fact, her buying an item off a wish list on Amazon IS a surprise as the default setting (i think) is that it won't remove the item when she buys it. Provided she uses her own account. The only way it would be ruined is if you went to buy it off that list, then Amazon warns you someone may have bought something on the list. The fix for that. You agree to leave the list alone around holidays and birthday and/or she buys the item elsewhere if possible.", "I would tread with caution until she decides to be completely honest. Idk how her words don't reek of bullshit to you. Both of you will not move forward until she's honest with you and herself.", "I think it is funny that she showed all those people the post expecting them to be on her side and nobody was. I love it", "Bro, I am severely adhd to the point that it makes my life a living hell, and I have NEVER bought my husband a gift for myself.  I also have never forgotten his birthday. ADHD is not an excuse to be an asshole, medicated or not. Unbelievably selfish on her part. And just an awful excuse. I’m glad that’s she’s taking her head out of her ass, but I hope for your sake that it stays that way.", "Wow, I just read the original. Sounds like Homer and the bowling ball\n\nHopefully it’s enough of a wake up call for her", "I have ADD, and I am prone to forgetting birthdays – ***which is why I note close friends' and family members' birthdays and anniversaries in my phone's calendar, and set it to remind me of them.*** All this woman has to do – literally one tiny thing to fix the problem of forgetting OP's birthday – is to set reminders, and make them recurring in perpetuity, so they will pop up every year (unless and until she disables them, of course).\n\nShe has no excuse.", "Not saying there isn’t bs happening here. But my partner has pretty bad adhd and dating them has been eye opening. I see someone who wants so badly to do something nice and thoughtful struggle so much to do it, put it off, and sometimes flounder just like this. I’ve learned to not interpret their actions as intent all the time. That may be what’s going on here.", "Scrolled to hopefully find a comment like this, a person can have ADHD and be an asshole at the same time.", "I’m really sick of AHs using adhd as an excuse to be terrible partners. My husband has adhd and he freaking tries and listens to how I feel. I can’t stand people who weaponize adhd.", "I honestly had to Google what that was haha"]}