{"id": 13612, "submission_id": "12744bz", "title": "WIBTA For Calling Out SIL and BIL For Not Including His Daughter / Her Stepdaughter On Disney Trip ?", "selftext": "My SIL (40F) has been married to her husband, my BIL (40ishM) for about 4 years. They have a child (2M) together and he has a child (14F) from a previous marriage. \n\nThey recently asked to borrow a dvd player for their car for a trip to Disney they were planning for Spring Break. I was confused because I know they have one. Turns out it belongs to his daughter and she won’t let them borrow it because she isn’t going on the trip.  She will be with her mom for the week. \n\nNow I admittedly do not know all the facts, but it really made me feel uncomfortable that she wasn’t going on this trip with them. My husband seems to think it’s no big deal. I feel like they should have planned the trip for when they all could go, especially since it is a big trip. I worry that going without her is going to hurt her feelings. And it sounds like she isn’t happy since she won’t even let them use her dvd player.  She already deals with a bit of anxiety and depression and I think they are being cruel by not making sure she’s included. I really want to say something in a round about kind way but I know that it isn’t a good idea. But I would like to know other people’s opinions on the situation. Are they assholes for not taking her?  Or is this something that is normal for blended families?", "created_utc": 1680221682, "permalink": "/r/AmItheAsshole/comments/12744bz/wibta_for_calling_out_sil_and_bil_for_not/", "score": 1359, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I would  be the asshole if I said something, but I think they are being assholes too by not making sure she is included. If I were in that position, even if it was my stepdaughter, I would make sure that she was included in big trips like this.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Is it possible that she's not going because her mother wouldn't let her?", "MYOB. If you don't know the details, you don't know why they're not taking her. Maybe her mom won't let her go. Maybe her mom is bringing her somewhere else. Maybe she really hates amusement parks. (My 16-yo son asked us to plan our family Disney trip when he was away at camp.) Maybe she's not allowed to go because she is being disciplined for whatever reason. Maybe she can't go because she has another activity planned. Maybe she's protesting Bob Iger being CEO or boycotting because of Genie+. \n\nYou have no idea, so yes, YWBTA.", "YWBTA. \n\n>Now I admittedly do not know all the facts.\n\nYou said it yourself, you do not know all the facts nor are you privy to them. They're not leaving her home alone, she will be with her mother. There are a multitude of factors that were considered before making their decision, of which your input has zero bearing.", "YWBTA, you admit you don’t know all the facts. Stay out of it. Blended families are difficult enough without people who don’t know the whole story butting in.", "YWBTA\n\nyou said it yourself, you dont know the facts and you probably never will without snooping. im sure they dont want to get into the details and you trying to have a word on this is gonna make you look bad. who are you exactly to give your two cents?\n\nlet it go. mind your business.", "YWBTA, you don't know the details of why she is not going, you've already said that. Why would you ever consider interfering if you don't have all the information? Do you want to be known as a busybody? Do you want to cause tension with both your husband and your in-law? Just don't lend them the DVD player and stay out of it.", "Maybe the 14 year old doesn’t want to go on a trip with a 2 year old. It would be different if they had someone their own age to hang out with.", "She is with her mother. It's really none of your business.", "I get where you are coming from. My husband and I have a blended family and we try to plan getaways and short vacations for when we have all of our kids. However, If it's her mothers time with her via the custody agreement, that is her mothers time with her. YWBTA if you brought this up.", "Ywbta you don’t have nearly enough info on this.", "Well from your responses I assume you've seen some signs of favouritism. Hard to make a judgement here considering there isn't much info, but I say go with your gut.  You're NTA if you are asking purely in the interest of the 14 year old.", "Lots of people firmly telling you not to bring it up but as a child of crappy parents who didn't consider me, I would have given a great deal to have another adult in my life who cared enough to raise injustices on my behalf. \n\nObviously going in hot and accusatory is a bad move since you don't know the facts. I would have a private conversation with your brother and ask what led to the decision to go at a time she couldn't go and how she feels about it. Approach with curiosity and concern instead of ire. He may not have considered how she would feel in any depth and having it queried may open that door. If he tells you to leave it alone then do, but I think YWNBTA for gently asking what led to her being excluded and if she's OK in a caring way that doesn't accuse your brother of doing wrong", "MYOB", "you seem pretty sure you've got the right read on things here. you asked what people thought and i'm seeing an overwhelmingly negative response, but it doesn't seem to have changed your mind. \n\ncan i ask why that is?", "I dislike the way OP seems to centre this on their SIL when the parent of the child in question is their BIL.", "I wouldn’t say anything. You never know the dynamics in the house.", "So for half of the younger child’s life (2), when the older child (24) is having life experiences with their mom, younger child’s life is in hold? How does that work?", "YTBTA. You don’t know the details.\n\nMost teenagers have plans with friends or extracurriculars over Spring Break. Also, 14 is a bit past Disney, so it’s likely she doesn’t want to go.\n\nYou could gently ask why your niece isn’t going on the trip, but also this is your husbands family. Any “calling out” should be done by him, not you.", "YWBTA - As you said you don't know all the facts, and seems like you're getting involved with something that doesn't affect you.", "YTA for assuming such ill intent with so little information. \n\nAnd you wouldn’t be in the wrong to simply ask them why the teenager isn’t going. There may be a perfectly valid reason. Maybe her mom’s taking her to Disney later this year. Maybe they asked her to go and she declined.\n\nIf you have a good relationship with them, than ask for details, and approach with grace, not judgment. If you don’t have a good relationship already than just MYOB.", "Well to me it would depend on how you did it.\n\nMaybe casually ask what the 14 year old has done to warrant the punishment of not going or if it’s because they can’t afford to all go? And if so why they are going to Disney if they can’t afford to all go?", "It's always fun seeing OP's (like this one) who come here purely cause they want people to agree with them and not because they want to be judged. Just ignoring the purpose of this sub in an attempt to have your assholery validated only to be regarded as an even bigger asshole. Also if you havent gathered OP, yes you are the asshole, for one it's none of your business and two even if it was your responsibility to interfere in mundane issues that you play no part in, like pretty much everyone else said here, you dont know all the facts and are assuming everything besides the one thing you know that is, \"child is not going on Disney trip\" while they could easily be doing something else or not be invited because they did something wrong. YTA.", "NTA I would politely ask your brother what SD is doing. Then ask if she did she not want to go to Disney?", "I’m going against the grain and saying YWNBTA, at least not if there’s evidence that this is a pattern. It may be better coming from someone else, but I know so many stepkids who get deliberately left out of trips. It’s heartbreaking and the longterm effects on family dynamics are not pretty. I kind of get it if a trip CAN’T be scheduled to accommodate the child, but that’s often not the case. \n\nIf this isn’t a pattern then maybe let it go or get someone else to talk to them about it - maybe your spouse or in-laws that are the parents to either BIL or MIL. But if you’re pretty confident about your read, then I think it’s good someone is willing to stand up for the child here. But, the best way may be to inquire rather than accuse, like politely asking questions about if she didn’t want to go or couldn’t go or if her mom said know why they didn’t plan a trip at a time they had her (the first three are probably better). This could lead into a conversation or at least a better gauge of the situation. \n\nI’ve also seen this far too often to not be cynical about there being a good reason for this. It’s almost always a repeated thing and indicative of the step-child not really being considered part of the family. I actually know someone who did this exact thing - planned a Disney trip when they knew the older stepchild who could remember wouldn’t go but took the kids too young to remember. The  stepmom in this case always plans family trips when they don’t have her step-child and she’s even gone as far as to not include the step-child in pictures. Said stepchild has basically no self esteem now (was vibrant in the past) and hates going to her dad’s. And unfortunately I’ve seen this in a lot of blended families.", "NTA.  I get where you're coming from on this, and you are right. I have a blended family, and money was tight but we never planned a trip where one of the kids was left out.  It sounds like they picked a time where daughter was with mom so they didn't have to invite her.  Not cool.  And this decision will come back and bite them in the butt.  Also, I wouldn't loan them the DVD player.", "Yes they are , but you don’t want to get involved that drama. Let them crash and burn all on their own.\n\nHopefully her mother is a better parent than her father.", "YWNBTA. Seems very cruel to me, taking their 2 year old, who probably won't remember anything about it, but *not* taking the 14 year old, who would really enjoy the trip and have lots of memories!   How do they think this is okay?  It's so mean. No wonder the 14 y/o has anxiety and depression, if this is how they treat her.", "NTA, but don’t do it even though I agree with you, it’s messed up. These people aren’t your blood relatives and it’s really more your husband’s responsibility to stand up for his niece.", "They're AHs. & unfortunately it's too common.\n\nI was the stepchild & my mom & her (now ex-)husband used to do BS like this all the time. Half the time I didn't care because as a teen i didn't want to be around them anyway, but being excluded still hurt.\n\nYou could tell them you need your DVD player & ask how the stepdaughter feela about not being able to go.\n\nYou could also be insanely nice to her when you see her. Oddly, that doesn't take much. If you get the 2yo a present, give the teen a teen appropriate gift. If you go to the store &/or run errands, ask if she wants to go too.\n\nWhen my mom divorced her ex, I kept his siblings that were simply nice to me. They're aunt & uncle & get great hugs & pure excitement when I  see or hear them on the phone. But I ignore his ass because the AH is irrelevant. \n\nBe nice to her, because your SIL & BIL  are AHs & she knows it.", "Why are you so adamant on being nosy? YTA", "YWNBTA\n\nAs the child who was the outsider, it warms my heart to see someone wanting to stick up for the kid and see them included. Frankly the 14 year old would get more out of a disney trip than a 2 year old in terms of all the adventures. \n\nYou're right, kids absolutely feel left out of stuff like that. They wonder why they're not good enough to go with. Why they're not important enough. \n\nIt hurts to see kids who are the product of split parents, always getting left out of the big events. If you call them out on it, it's probably still going to cause issues. But it doesn't make you an asshole. And idk if she'd ever know you stood up for her or not. But this child left out would thank you and be proud of you", "YWBT\n\nA massive AH. You *do not* know what's going on. You sound judgemental and nosy. She's 2!! It's probably a hassle to take her and she's not even going to remember it. Maybe there's legal implications if they're going out of the country/state for it. Maybe her mother doesn't want her to go. Maybe it's none of your damn business and they haven't done anything wrong.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy SIL (40F) has been married to her husband, my BIL (40ishM) for about 4 years. They have a child (2M) together and he has a child (14F) from a previous marriage. \n\nThey recently asked to borrow a dvd player for their car for a trip to Disney they were planning for Spring Break. I was confused because I know they have one. Turns out it belongs to his daughter and she won’t let them borrow it because she isn’t going on the trip.  She will be with her mom for the week. \n\nNow I admittedly do not know all the facts, but it really made me feel uncomfortable that she wasn’t going on this trip with them. My husband seems to think it’s no big deal. I feel like they should have planned the trip for when they all could go, especially since it is a big trip. I worry that going without her is going to hurt her feelings. And it sounds like she isn’t happy since she won’t even let them use her dvd player.  She already deals with a bit of anxiety and depression and I think they are being cruel by not making sure she’s included. I really want to say something in a round about kind way but I know that it isn’t a good idea. But I would like to know other people’s opinions on the situation. Are they assholes for not taking her?  Or is this something that is normal for blended families?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "First, you should stay out of it. However, there's a very good chance that you're right and the daughter not going is a crappy move. There's nothing you can do, which is why you say nothing. \n\nHowever, if in the future the relationship breaks down between these parents and the daughter, don't automatically blame the daughter.", "ahh..not bringing either kid to disney is some dumb shit my wife and I joke about...your SIL and BIL are definitely fuckin goofballs", "You don’t have all the facts.     \nLike maybe the mother won’t let them take her ?       \nUntil you know don’t say anything", "NTA for thinking about stepdaughter but ask around first, don't just make assumptions. Don't confront on a whim. Ask why stepdad isn't going with them, if the answer is still just she's at her mom's that week ask didn't she want to go or if its something to do with the custody agreement, ask if the couldn't rearrange the trip for a time they could all go together.\n\nInstead of confrontation ask very obvious questions to make them think about it.\n\nI wonder if she went if they make her baby sit her toddler half sibling.", "its not out of the ordinary to alternate who gets the child during breaks from school. totally possible that mom wanted her for the spring and wouldnt let her go", "I think that it is possible - since it is her week to have her. But even so I think they should have scheduled it so that they could all go.", "I will not say anything, but I do know she loves the parks and all the rides. My gut just says this is wrong.", "Yep. You are right. I think that the stepdaughter should have been a more important factor in the decision.", "I know I would be the ass, and I have stepped in it before because I spoke up and said something that I thought needed to be said. It was the right thing to say, but in the absence of other people who should say it I felt I needed to step up.", "I get it. I would never say anything but I really want to. It hurts my heart to think they are hurting her - but again, I don’t know all the details. But if she’s mad enough to not let them borrow the dvd player because she isn’t going then to me that is a sign that it does bother her.", "I won’t say anything, I agree it isn’t my place. But I do think it is a shitty thing to do.", "Agreed - but then who would be okay to speak up for this little girl?????", "Totally get that and I don’t expect her mom to give up her time. And I understand it is hard to schedule things with everyone’s schedule, but if it were me and we all couldn’t go we would go period. I’m not leaving someone out.", "I will but I wonder WHO would be in the right to say something for this girl??", "Yes!  And I feel like they send her mixed messages. They spend a ton of money on sports gear and things for her and then exclude her from family trips. No wonder she has anxiety issues.", "Agreed, but he would absolutely never say anything.", "Good idea. I will try to give her a little extra love and attention. She’s a good kid that has had to go through a lot and I just wish they would make more of an effort.", "I cannot stand the thought of someone being left out - especially when parents and children are involved.", "Yes but don’t you think they should have planned for a time when they would have her??", "Is it out of state to go to Disney? There may be legal implications that you are missing for crossing state lines with a child with shared custody that you are missing. You also have no idea if they do have future plans for fun things.", "You have NO IDEA how much of a factor she was in the decision. You're assuming facts not in evidence.", "Who said she wouldn't let them borrow the DVD player because she's mad? She just doesn't want her 2-yo sister to borrow her technology, which I think is perfectly acceptable. She doesn't have to be mad about anything.", "But you don't know anything so nothing is shifty.\n\nYou don't know who what or why so there is nothing to sink is shifty.\n\nYou know absolutely nothing and arr talking about how they should plan better this and if one can't go all can't go but you have ZERO idea about any of it.\n\nNothing. Keep your business in your pocket its easier to kind that way.", "Her mother would be the one who should speak up. Not you.", "Blended families are HARD. Don’t butt in. I understand you think you wouldn’t “leave someone out”. But there are a dozen reasons why they made the decision they made. No one truly knows what decisions they’ll make into they’re in that situation in that moment. Give your BIL and SIL grace not judgment", "Her parents, for the next four years until she turns 18. Their custody agreement is none of your business. Are you even that close with your BIL’s daughter?", "You know so little about her situation, you don't seem to have any concept of visitations or her life so you do not sound like a good candidate to speak up for her at all.", "But by your own admission you know little about their lives or hers so you don't know the effort they put in. It's a bit obsessive how little know but how many opinions you have.", "Adults have schedules too. Personally, in my industry, I can't take a vacation from September til January cause that's peak season. Parents need time off too y'know. Are they supposed to just sit at home doing nothing cause the girls at her mom's. They have another child to think of as well. And if the young one is only two years old, that means this pair have been going through alllllllll the stressed that comes with raising a newborn. Theyre probably in desperate need of a vacation.", "It’s either spring break, or summer break. And summer breaks vary greatly by custody situations. But the weather is also insane sometimes if you’re not used to the heat.", "So the other child who only has 1 home can only do fund things 50% of the time because his sister has two?", "I wonder what the daughter is doing with the other parent, I'd it involves the use of the DVD player, and if OP makes sure that everything cool thing that the daughter does with the mom the other kids also get to experience.", "True - but I also have past experiences with them which leads me to believe this.", "She would let them take it “since she wasn’t going on the trip”. That was what she said.", "Or you know she may be going away with her mother and need it for that", "Not always. Sometimes the mother doesn't care and would be perfectly fine to let the other parent do that to intentionally let it sabotage the relationship and turn daughter against father", "Well said , thank you. Grace not judgement.", "I understand trying to schedule things - our schedules are difficult to schedule around. But at the VERY LEAST if she couldn’t go I would maybe try and plan a smaller trip, not something totally awesome that she lives like Disney.", "I recommend adding those experiences to your post. The less details you give, the less accurate judgements are going to be.", "Please keep responding like this, it is very convincing", "Could just be something as simple as not trusting the 2 year old to use the dvd player alone (parents are both sitting up front). Which isn’t that weird.", "The word \"mad\" never appears in that reason. She's not going on the trip, so she wants to keep her DVD player. Totally reasonable. She may very well be going on a completely different trip with her mom.", "Exactly!  This is just more ammunition for her against the dad - which believe me she loves to have me use.", "So the other child only gets mediocre vacations if sis isn't around? How come that's fair? And don't say a 2 yr old cant enjoy Disney. I've seen it happen 100 times. They love it. And if mom takes sis on a lavish vacation? Jimmy only gets to go to Chuck E Cheese cause BIL can't risk making sister feel left out.\n\nAnd if next year mom wants to take daughter to Hawaii or Lego Land does she not get to go cause her brother can't? After all, why is it okay to leave HIM out and not leave HER out. Is it okay to tell a toddler to understand that sister gets to do special stuff with only her mommy sometimes but he isn't allowed to do special stuff with only his mommy.\n\nIt's gonna be unequal any way u cut it cause life isn't fair. Blended families are tricky business and you're not helping by judging and gossiping (yes, coming to reddit to talk about your in-laws in gossip)", "Freudian slip much??", "*To have and use.", "If I were 14, I wouldn’t want to go with them to Disney. I can’t imagine two 40 yr olds enjoying the park with a baby/toddler that can barely walk. They wouldn’t be able to go on any of the good rides together, and would probably have pushed babysitting responsibilities onto the teen..", "Info: Do you have a close relationship with your SIL (I'm guessing your husband's sister) and her husband?\n\nIf you do, I think you could ask her how the daughter feels about the trip, and how they are getting along in general.\n\nIf you don't, you unfortunately have no standing to get involved in this at all. You're several degrees separated from the people actually involved\n1. Daughter, her mother, her father\n2. Your SIL, her stepmother\n3. Your husband\n4. You", "Yes, YWBTA.  \n\nNot your family, not your business.", "I don’t think you’d be the AH for asking. But ask. Don’t assume. Be curious not accusing. And in the end, love your niece and let her know you’re in her corner generally.", "You can't be sticking your nose in their business, but the kid will never forget. Karma rules. Ywbtah", "YWNBTA\n\nCalling out sounds confrontational and isn’t the best place to start. Gently and politely asking about the situation would be great. \n\nSo many people say nothing because “it’s not their place” or “maybe there are reasons”. Um no that’s whack. If you see that a kid is potentially being treated badly it’s a good thing to be their advocate. How is this a hot take?!?\n\nI don’t see the harm in asking in a non confrontational way and there may be a lot to gain from it.\n\nBeing unloved and unwanted as a kid in blatant hurtful ways and the other adults in your life ignoring it is deeply damaging. And even if the parents are not doing it with bad intentions that doesn’t change how it feels to the kid. \n\nI would have loved to have an aunt like you when my stepmom was being cruel and conveniently forgetting I existed for many special events. My mom couldn’t force her or my dad to be decent and having other adults stick up for me would have at minimum told me that I wasn’t worthless or less than simply because the lady my dad decided to marry said so.\n\nBe an advocate. If there aren’t bad reasons for them excluding her they shouldn’t get upset and would appreciate that you care. If they’re deeply defensive it’s likely they know they’re being dicks and simply don’t care.", "Thank you for being concerned about the 14 yr old.", "YTA simply because you don't know their family dynamics. you don't know your BILs relationship with his child's mother or the custody agreement. You don't know if he's allowed to take her out of state (if y'all don't live in the state of the park), you aren't privy to anything. You're making assumptions. I think you should just mind your business.", "You could just ask why 14F isn’t going as a general topic of conversation without any rage or accusations. And then you’d know whether or not to ask the question “WIBTA if..?” because at the moment you know nothing.", "I’m from a broken home. Children from broken homes have unpleasant issues to deal with. This is her reality and you cannot protect her from that. I know you want to, but this situation was created when her parents broke up. \n\nI’m a mum and step-mum. Being a step-mum is so much harder. Blended families are difficult. It’s ideal if everyone gets on, but that’s rarely the reality. \n\nThere is a large age gap between the children. Taking both the children along would strain the whole trip as they’d want to do different things. Maybe everyone would end up not enjoying the trip then, that’s not ideal either. \n\nI spend time with my step-son. But there are a lot of things I only want to do with my daughter. And that’s ok too. I am allowed to make memories with my daughter that’s just us. I also have feelings that matter. \n\nIf your niece hasn’t been to Disney before, then your brother should plan a separate trip with her. That would be fair. What you do for one child, you should do for another. She would enjoy a Disney trip without a 2 year old more. \n\nFind out the facts first, then speak to your brother. Good luck. Your hearts in the right place.", "NTA. Ask them if they recognize how awful it looks on them to take a big family trip but leave one of the family members behind? Maybe there’s a good explanation, but I’m on your side OP. As the child who has been left behind, I wish someone had stood up for me.", "Why not just ask why she isn’t going? Then you’ll have the facts?", "YWBTA. It's very simple - it's none of your business.", "YWNBTA\n\nIf you have a relationship with the brother get the facts from him.  If the trip is set in stone just remind him his daughter will be an adult soon and his constant rejection of her isn't beneficial to either of them. \n\nIf you end up taking your kids to Disney land take her with you.  Sometimes family members need to pick up the slack when the parents are floundering.", "Her mother??", "Her mother who divorced her dad? Why would he listen to her? Parents, especially divorced ones can’t force their exs to do anything.", "So should the other kids (who live with them full time) not get a full sized trip bc their sister isn't around? You should really just mind your business.", "I have been the stepdaughter. I was told I was going on a trip then a month before told I wouldn't be and I'd be going to spend time with my uncle instead. It hurt like hell and she will always remember it. I would say NTA, I think they need to know the damage this will do to their relationship. I rarely speak to my dad now. Once a year I get an email birthday card from him, I say thank you and then the same at Christmas. That's the type of relationship he is heading for.", "Your intentions are good. Maybe just ask your brother why? That’s normal thing for a family to do. Ya know, talking to each other.\n\nBut leave it be once he tells you", "INFO - are there any signs of favoritism? Do they regularly do \"fun\" or \"expensive\" things without her? Does you SIL ever show distaste or resentment towards the stepdaughter?", "OP please see this! \n\nI'm going against the grain with NTA because as a child I was also excluded from most family vacations, as a 13-14 year old I would stay alone for days while my dad was out with his significant other (who wasn't my mother) and their young toddler aged kid (my half sister). My mom's place was even worse because her husband was a compulsive liar, an alcoholic and prone to violence. So when I was at my mom's I also stayed home alone for days when they took vacations.It hurt so much, and of course there we're many other issues, but this exclusion from my own family kind of broke me, it shaped who I am as an adult and not in a good way.\n\nAbuse or neglect (not saying it's the case here!) does not necessarily leave an obvious physical mark, it's \"smaller\" things that seem less dramatic that are noticed by other adults, like not going on the family vacation or not having your own \"special\" foods but your half sister gets all the candy and chips and you have to ask the toddler's permission if you want some, or having to wear worn out clothes or shoes that are too small while the rest of the family as all new clothes and let me tell you what's hiding behind those things I just mentioned; insults, financial abuse, starvation, neglect and physical violence that doesn't leave a trace because they are smart enough not to hit you in the face, but the rest of you? Fair game to them. They manipulate others into thinking that they are good step-parents so as a kid you know you cannot tell anyone because they won't believe you.\n\nAgain, I'm not saying this is abuse or that anything wrong is happening, just that there's a possibility, maybe there's another reason, but the potential for it is there.\n\n Just saying if I had an adult like you in my life say something to my parents, it may have kept the worst of their behavior in check because they wouldn't want to be called out by other adults. I would have appreciated it and maybe not felt so lonely and alienated. Thank you for caring about that young person.", "YTA - its none of your business.\n\nSure they sound terrible, that 14 has effectively been told that her father has a new family now and there isn't money to include her on the trip.\n\nUnfortunately holidays are often planned by the wife and when a husband is lazy, his children could easily be ignored in the plans.  What 2yo will remember this trip!? It was almost designed to upset the teenager but still - none of your beeswax", "So, you keep saying you don’t have all the facts.  What’s to keep you from having a conversation to get all the facts?  It’s not like your only option is to stand up for the child or stay silent.  Could you call SIL to just catch up and when you’re talking about the trip, casually ask why the step daughter isn’t going?  Then you’d get the information and should know if you should be standing up for her or if the explanation is perfectly reasonable.", "I’ll go beyond this post and get a little meta: YTA because everyone in this thread is telling you that YWBTA and you just keep doubling down.", "YWBTA\n\nAs a stepmom it's is almost impossible to please everyone. Custody schedules, work time off, money, there are so many factors. \n\nWe have to do a lot of things without my stepkids due to custody agreement. We have 50/50 but can not bring the kids across state lines without the other parents permission legally. We have had to go to court over this before. My husband ex-wife is extremely high conflict, and we never ask for additional time. My in-laws get upset all the time when the kids can't go to things. My husband always responds if you want them here it needs to be on my custody time. At the end of the day we can't and shot not have our life dictated by someone else. \n\nYou said they pay for her sports, gear and everything else. So they are not neglecting her stay out of it. Unless your willing to pay the court fees thta go along with children cuatodyiws schedules stay out of it. \n\n\nUnless you're the parent you are just being judgemental.", "I would ask them why the step daughter doesn’t want to go since she would get more out of this trip than a 2 year old who will never remember it or truly enjoy it since a 2 year old can’t go on rides.", "Info: can you just ask - why isn’t stepdaughter going? Or ask the stepdaughter about it?\n\nI think your heart is in the right place but you might be causing unnecessary trouble.", "Imo NTA\nYou don't exclude a child from a trip. If she was fine with it, she'd have let them borrow the DVD.\nPlus if it was her mother's time, they could simply arrange the trip when she is with her dad.\nUnless you want to make her feel excluded exclusively for some weird af reason.", "I would ask them first. Just a casual “hey why isn’t SD going?” Their answer will tell you whether it’s a custody issue with the bio mom not letting her go or just an Ah move of “we just wanted this particular week/didn’t want to pay”", "Im going to go against the grain, have you spoken to your niece? I get the vibe she is sad since she wont let them take her dvd player.\n\nImma hold my judgement until I know what the daughter thinks", "NAH everyone needs a wise fool, someone to say the uncomfortable thing that needs to be said. Even if everything is above board this looks kinda bad for them. I think they would want to avoid looking like stereotypes.", "Exactly! I agree with you on this, it has potential to be the tip of the iceberg, pretty often people only see that and they decide not to investigate further BeCaUsE iTs tHe PaReNts JoB 🙄 but they don't realize the abuse and neglect that's hissing underneath the calm waters.", "Even if there's no evidence of previous pattern it's still not okay to plan a family trip without one of the child. Unless you want the kid to feel excluded.\nThe kid would obviously let them borrow the DVD if she didn't feel excluded or had enough trust on her own father and step mom.\nMakes me so mad that they are doing this to a child.", "Get over yourself. You're not a stepparent you have no idea how hard it is to make everyone happy. As a stepmom it's people like you who make us out to be the villain all of the time. At some point you can't make everyone happy. you need to respect that the parents are doing the best they can.", "Look I get it.  And I’m glad you are trying to look after your niece. \n\nBut the realty is life is not always “equal”.  Heck it’s not always “equal” in intact families.  But as long as the overall experience are FAIRLY given, it’s okay.\n\nThere are so so so many variables that affect life, let alone planning vacations, variables that may even be insignificant but can have a major impact. \n\nAnd at the end of the day, could then make it impossible for your younger nibbling to go on an amazing trip.  So your options would then be to punish your nephew or both?", "Why are you coming here and just arguing with everyone telling you the truth?\n\nYou’re bending over backwards to virtue signal about this step daughter in law of yours, but you don’t have any indication or evidence that she even would want to go to Disney.\n\nWhen I was 14 and in high school, I would’ve had ZERO interest in going to a Disney theme park with my 2 yo half sibling.", "You’re not Spartacus. You’re just an AH.", "you really don’t know what you’re talking about. have you considered that her mother didn’t give consent for her to take this trip, to leave the state, regardless of whether it’s on their time or hers? \n\nor if a large part of the trip is funded by the stepmothers parents and 14f parents(both) cannot come up with the funds? \n\nor that a 14 yo has expressed disinterest and resentment in a long drive with a toddler and an amusement park visit that will be filled at least halfway with toddler friendly activities? \n\nor that the 14 yo has plans with her friends that she wants to use her dvd player for? maybe going camping or a beach trip or sleepover. nice to think of yourself as a friend and potential ally for your niece, but before you start running your mouth remember she has a mother and her own voice that can speak up first. if the niece said something to you, that’d be a different story. otherwise, don’t start drama", "Not you.", "So are going to post examples or just leave it extremely vague?", "She probably has more context to the situation than you", "Context which she should be providing if she wants a fair judgement.", "NTA well done for thinking of her as no one else seems to be. \n\nThe fact the girl has said no to them borrowing her things for said trip shows she isn’t happy about it.", "In MY book, you are NOT THE AH.\n\nYou know darn well, they excluded her. He will make his new life and new baby a priority . She's hurt and the only thing she can hurt him back with is by NOT sharing the DVD player.", "YWNBTA. This is your family. If you can’t advocate for your family or communicate with your family when they’re doing something wrong, who can you talk to? I would ask why the girl isn’t going and, if they don’t have a good reason, I’d tell them my opinion of their nasty actions taking one child and leaving out the other. They wouldn’t get my dvd player, either.", "NTA you're looking out for her", "NTA\n\nGo direct in their face. You're concerned for the child's safe upbringing, that's more than enough reason to confront them. If you don't like their answer, you know what to do.", "Just say to bil.  How come 14 isn’t coming with you.  Don’t ask SIL, just him.  NTA.", "Depends, which parent has Spring Break this year (they tend to alternate year to year)?  If it’s the mother’s then that could be the reason she’s not going.\n\nAnd why are they going on Spring Break?  A 2yo isn’t bound to a school schedule, so they can go at anytime.  Really shouldn’t have waiting til the summer when they can take both kids.  AH move on there part for doing it when she can’t go.\n\nBased on the daughter not letting them used her dvd players lends me to think she is feeling excluded no matter the reasons she can’t go.", "This is delicate territory, but I think, if you approached it with concern and no judgement, you could ask them.  It is a very fine line, and in some families, there may not be enough mutual trust or respect to have the conversation constructively.  \n\n\nApproach your SIL\\\\BIL to ask if they have any concerns about going on the trip without the older child, but only if you think you can do it without sounding accusatory or intrusive.  If that is not your dynamic with them, then leave it alone", "YWBTA\n\nSTOP pushing your nasty controlling fingers on someone else’s family! Go find something else to do with your time.\n\nThis is your SIL and BIL, none of them are directly related to you, even YOU admit you don’t know the details. Get off of your tall horse and let the adults involved decide what to do with their kids and time.", "Honestly even if you were to speak up now and they were indeed somehow favoring their 2 year old and intentionally leaving behind their 14 year old - if your SIL and BIL were to now begrudgingly take their 14 year old with them after all because “you saved the day” I promise you, the trip would be hell for all of them. Your SIL and BIL because they made different plans and didn’t want the 14 year old there. The 14 year old because she’s old enough to know what’s happening and would be stuck in a place for a week with people who don’t want her there. It is NOT a good outcome. So yes, YWBTA if you said anything now, especially since you don’t know all the facts.\n\nI think it would be better to, in a LIGHT manner, ask how the trip was AFTER it has taken place. And in the same light manner, whether the 14 year old didn’t want to come as she wasn’t there, you happened to notice?\n\nDon’t give your opinion if you don’t know everything. It doesn’t help anyone.", "Maybe it’s just a vacation for the couple only?", "What makes think a 14 year old girl would want to go to Disney with parents and your kids?\n\nAt 14 I would of preferred to stay home to.", "Consider if you will, that perhaps this isn't a \"call them out\" moment, but rather a \"how come you're doing x?\" moment.", "Please don’t listen to the people telling you to butt out. As a mother and an aunt, I would not be doing my duty to my niece if I didn’t ask what led to the decision of her not going. I recently called my sister out for not taking her child to Florida with her. YWBTA if you DIDNT ask.", "The age difference between a 2 year old and 14 year old is huge. Do you think she actually even wants to go on this trip? Either way, not your business. YWBTA", "nta a trip to disney is a kids dream ... all ages i bet its not the only thing he leaves her out of ... it wont be the last", "N T A  **if** you obtain the facts first. Ask about the different factors - mom not consenting or other custody agreement clauses, did she want to go, etc.", "YWBTA, it's not your business. \n\nFor what it's worth, when I was 14 I would have hated a trip to Disney and turned it down if there was the option. She may well not be going on the trip by choice. If the DVD player is \"hers\" I think there's a good chance she wouldn't want someone else using it whether she chose to go or not.", "This isn't even your business, so stay out of it. You also don't know all the facts, so don't go assuming stuff when you don't even know anything about the situation. \n\nYTA", "I'm gonna say YWNBTA, the daughter herself sounds mad she's not included, and I know I wouldn't give my dad player to my father who wasn't including me either. I know the whole not knowing facts is a big deal so maybe if you're close to the diaghter you could talk to her. Or else, just stay out of it so you don't become an enemy. The father will face the consequences in the future and see for himself.", "Echoing what a few others have said but it seems to be a minority opinion. YWNBTA to bring it up, but go in gently and with questions rather than accusations. You're right, you don't have all the info- so what info do you need? Then you can make your decision and either see they're being reasonable or call them out and help them see what they're doing isn't fair and could even cause lasting damage to the relationship. \n\nLove that you're looking out for this girl. It's so important for adults to speak out if they think a child is being mistreated.", "NTA for wanting to know what’s going on. Yes they’re a blended family but if the step daughter won’t let them take her DVD player there might be something going on. Or there might kit be at all.\n\nThese comments are weird tho. Why is it okay to take a 2 year old to didn’t and not the 14 year old? What is the two year old going to remember about the day? It seems like the step daughter would have a better time \n\nNTA", "YTA. Stick your nose out of something that clearly isn't your business.", "You can ask the kid yourself if it's a big problem for you", "YWBTA you have made major judgments with absolutely no facts. In the end this isn't your concern and you would just be stiring up trouble for no reason.", "NTA. A 2 year old is too young for Disney in my mind. But would be fun for the 14 year old. I'd say something to them but basically ask WHY they aren't bringing her.", "Just stay out of it. This is not your business, you don't know the circumstances of why she isn't going and people like you drive me nuts - looking in from the outside and thinking you have a right to intervene. \n\nYWBTA.", "I would be nosy and ask why she wasn’t going with them. Parents can be petty and you can’t cross state lines with a child unless you have the other permission. Her Mom could have put a hard stop to it. I think getting things straight is best because she may have been punished for something.", "YTA. This has nothing to do with you. Mind your own business.", "This is the answer. Everyone telling OP to mind their business likely hasn’t been neglected or ignored as a child. I look back at my childhood and remember many people who could have said something but never did. Despite knowing what was going on in our home. I wish they spoke up.", "Agree. I think op would be the ah if they went in accusatory. A simple “is x doing something fun with her mom while you guys are at Disney?” Would get the info and the point across.", "Hard agree. I was also the \"let's force this one out\" black sheep in a blended family and while I may be projecting, this stinks to me of that. It would have been nice if family members had called out my parents on not bringing me on trips/etc. and I suspect none of them ever did.", ">  I would have a private conversation with your brother and ask what led to the decision to go at a time \n\nHer brother isn’t involved. It’s her husband’s sister (SIL) and her SIL’s husband who she is referring to as BIL. The girl in question is her husband’s sister’s husband’s daughter.", "Yeah, the comments made me kind of sad honestly. I’m the kid from another marriage that, after my mom died when I was 6, had to live with my dad, stepmom and (half)brother. And I felt hugely neglected due to being excluded from certain family outings. I still vividly remember waking up and finding a note saying they all went on a day trip and there’s leftovers in the fridge. I was lonely and depressed and tried to find love in wrong ways. It also messed up my relationship with my brother (who I love with my whole heart) because I was envious of all the love and care he had that I desperately craved. I dismissed him a lot when he wasn’t to blame and all he wanted was to spend time with the big sister he loved. I’m lucky he was forgiving and we have a close relationship now as adults. \n\nBut as a child I was miserable. Children can’t rationalize situations. All this child will know is that her dad took her brother to Disneyland without her.\n\nGranted this isn’t the same situation but still… I would at least inquire with your BIL how come his daughter isn’t going with them and see what reason he gives. \n\nYou can’t really influence their behavior but I hope this doesn’t become a pattern of behavior for them, leaving the daughter behind…", "Because OP “knows. She knows”. Isn’t that enough . Hell with actual facts", "Her mom might not have given consent. The daughter might not like Disney. The daughter might not want to road trip with a baby. The daughter might have other plans with friends for spring break. The daughter might not want to go on the trip with a baby because the types of things a baby does at Disney are very different from the types of things a 14 year old does. The family might have made plans for a different trip for the 14 year old. The 14 year old might be totally fine with the arrangement and also want to keep her DVD player. The 14 year old might be totally fine with the arrangement but also be experiencing twinges of hurt feelings anyway because even when you know you have chosen the option you want, you’re still a human who has natural emotional responses that are ok to experience. See how there are a lot of potential facts you don’t know that would make this a legitimate choice", "OP , you could ask your niece if she even WANTED to go … if she says yes ….. then rip your brother and his wife a new one", "So why are you asking here if you're just going to argue with everyone and if you think you're in the right anyway?", "Have you even asked her niece how she feels about this yet? Maybe she doesn't even want to go considering it would be a trip that would have to cater to a 2yr old. Or maybe her mother didn't give consent.", "Remember that fair =/= equal.  But sometimes trying to be fair comes close to making things equal. \n\nMaybe they want to give their younger child the same kind of trip that your niece got 12 year ago.  One that is fully toddler centric?  Disney for a toddler is 100% different than Disney for a teen and 110% different for an adult.  \n\nCan you imagine the boredom for the toddler waiting on your Niece to get to go the rides she wants.  Conversely, would your niece want to spend a couple hours eating at HollyWood and Vine with the Disney JR bunch?  And how about your Brother and SIL having to deal with the temper tantrums for the both of them?  \n\nSo the only solution would be to make everyone miserable at some point during the very expensive day, make everyone miserable by not going at all (and depriving your nephew the very equal childhood your niece got to have) or reminding your niece she already got a trip like this and it’s now her brothers turn.  And then making another, more fully age appropriate for all trip later on.\n\nOh and this kind of thing happens in intact families as well.  This very thing infact.  My parents took\nMe to Disney when I was 5.  I am five years older than my sister and 10 years older than my brother.  They took my sister by herself at 5 and my bother by himself at 6.  Was I disappointed at the time?  Sure.  But I wasn’t pissed or resentful because I got fair and equal treatment", "Oh good lord. This would require they stay home during literally half of all holidays. And I assume she also takes vacation with her mother. \n\nOP, you clearly don’t understand how blended families work. YWBTA. Butt out.", "Then have your own kids and manage your family your own way. \n\nBut they are not obligated to make their younger kid suffer and miss out on trips, outings, and experiences just because a related-by-marriage busybody feels like it.", "And how many rides does a 2 month old go on? A family trip to Disney with an infant is not the ride-going experience. It’s naptime, diapers, and costumed character parades.", "When you don’t know the facts. Won’t ask to find the facts. But comes here for answers. YTA", "How do you know she even likes/wants to go to Disney?\n\nFor me as a 14 year old, Disney would have been my idea of hell on Earth. But I never was a Disney fan.", "OP did specify that the daughter loves rides and Disney", "I love this response and I’m using it for everything from now on 😂", "the kid is two years old", "Maybe she’s just careful with her electronics?", "Why don’t you take your step-niece out for some treats when she’s with your side of the family? Obviously you can’t start with a multi-day trip away, but you can show her someone cares by showing her that someone cares.", "Are you serious right now?\n\nIf your husband asked to borrow your portable speaker at home to play music while he did work in the backyard, you’d let him . \n\nIf he asked to take it with him to the beach for a day with his friends, you might let him. \n\nIf he asked to take it on trip for a week you’d tell him no because…wait for it…YOU WANT AND NEED TO USE YOUR OWN ITEM. \n\nOf course a 14-year-old isn’t going to let them take one of her electronic devices for a week. That has nothing to do with how she does or doesn’t feel about the trip.", "Yes, a two year old can have lots of fun at Disney, however, he won't remember the trip in a few years. His sister, on the other hand, certainly will remember being left out.", "SIL is also a first time parent and that’s a big part of why people take toddlers places. It’s an experience for the adult with their kid. I don’t read this as the 14 year old was ever excluded on purpose, just unfortunate schedules and parents doing their best.", "If they can afford to take their 2 year old to Disney, they can afford to get him a dvd player", "INFO\n\n>Now I admittedly do not know all the facts, but it really made me feel uncomfortable that she wasn’t going on this trip with them. My husband seems to think it’s no big deal.\n\nYou don't know what's going on, though you may perceive it as unfair.\n\nSometimes, either mother or father doesn't give their time or schedule to let blended children vacate with their respective parent's times.\nWhere they are no aholes\n\nSometimes, it is deliberate, to exculude blended children, and have 'family things' for selfish stepparents. \nYou will see a pattern , normalisation, and excuses. This where they are the aholes.\n\n\nAnother thing I would like to add is that they may have intimidated the  daughter for asking a dvd for a 'family trip' they are going where she is not included ,*regardless of any reason*. That's definitely rude. \n\nYou don't talk about plans in front of someone who is not included. Yes , it especially applies to celebratory or memorable events.", "I think you WBTA if you jump to conclusions and address them in a confrontational manner. There could be many reasons why BIL's daughter isn't going with them; she may even have chosen not to go herself because of her mental health; it's a very stimulating and potentially overwhelming environment, especially with so many people there. \n\nBlended families are all different, and there may well be an arrangement where 14f is with mum one year for Spring Break, then with your BIL and SIL the next year. Maybe they split the holidays, and this happens to be her mum's time with her. \n\nIt's very heart warming that you are concerned and care about 14f, and I mean that sincerely; however, I think you need to tread very carefully so as not to ruffle any feathers. Has this sort of thing happened before? Do you have a general idea of their family dynamic? These are things it would be good to know before saying anything about this incident.", "NTA. A two year old didn’t remember Disney but a 14 year old would. What’s wrong with him?", "YWBTA if you said your opinions without asking questions to get the facts. My husband, myself, my stepchildren, and our child together are a blended family. Every other year we go on a very large whole family vacation. Every year we also go on a vacation with just my husband, myself, and our biologically shared child.\n\nMy step kids like this, they got to decide what vacation schedule they were happy with. Having to be a kid with little choice in vacations matters, and forced to go on back to back vacations with mom and then dad, is exhausting. They want to enjoy school holidays with friends sometimes, or just sleeping lol. They don’t want to go to Disney with their younger sibling, they feel too old for a lot of stuff. And why should our youngest miss out on the types of vacations that we gave to her older siblings, just because they don’t want to go? \n\nMy point is, you don’t know the specifics of any of this, but your heart is in the right place. I’m happy that your niece has someone on her side if she feels like her dad isn’t, but you need to figure out the situation before you lecture him.", "When I was younger it was extremely clear my sister and I were annoyances to my stepdad and his own children were angels. The only person that made me feel understood and loved was my aunt. People who say you’re TA simply don’t understand this type of hurt.\n\nI’d try to figure out if they intentionally left the stepdaughter out or not, but a Disney trip is so huge (In my opinion) so to me it seems incredibly weird they wouldn’t take the stepdaughter as well, or chose a different date when she could also join them.\n\nThank you for caring about her. You’re a good person.", "NTA\n\nGet the facts.  Ask why she’s not being included.  Gently point out that this could have future ramifications for the family’s dynamics.", "INFO\n\nSince you seem close with her and care so much for her wellbeing, are you planning something with your niece during that week - obviously not disney-level, but something else she'd enjoy?\n\n\n>I really want to say something in a round about kind way but I know that it isn’t a good idea.\n\nWhat would you say, and why do you know it's not a good idea?", "YTA\n\nyou genuinely have NO idea what you’re talking about and you need to refrain from assuming you know anything about the situation. Maybe she didn’t want to go??? Her mom has the right to spend time with her as well. Mind your own business.", "YWBTA.  Honestly, it's not your place to put your nose in their family issues. \n\nEither loan the DVD player or don't.  It's not your circus, not your monkeys.", "We need more details what is their relationship have you seen any type of favoritism or acts of cruelty?", "Can you have a talk with your niece and ask how she feels about it? Life is tough for teenagers but for ones in blended families its even harder.", "INFO: Did your BIL ever take your niece to Disney before ?", "NAH I think. Depends how you approach it. I think it could be okay to ask with curiosity Vs judgment about why she isn’t going and letting your BIL know that you worry about her sometimes. But it also might not be your business and if that’s his response you’d have to respect it. I also have a niece I feel like I have things in common with (or did at her age) and it leads me to want to protect her more than I need to (she has told me this too haha so I backed off). Maybe could also ask yourself if you are projecting your own feelings (did you feel left over of stuff growing up? Did you feel rejected or abandoned back then?) onto her or if this is truly about her. I do think it’s kind of you to want to advocate for her but it is important to respect everyone else’s boundaries.", "First of all, a trip to Disney for a 2 year old seems like a massive waste of money and an unnecessary headache. Maybe 14F doesn’t want to deal with being held captive by a toddler at Disney if she knows she won’t be able to go on the good rides because they won’t let her do things on her own/split up. YWNBTA depending on how you ask. I’d ask in a super innocuous way why 14F doesn’t want to go too or isn’t coming too (vs why didn’t she get invited, which might sound accusing).", "Her mother may not have given consent or they didn't want to include her.  You should have simply asked why she wasn't going when you first learned she was staying home.", "Hmm… NTA yet. Maybe just calmly ask why she isn’t going.", "NTA. There's no \"normal\" when it comes to blended families. No rules, no guidance, no established norms. Everyone is just winging it, and most are f-ing it up badly.", "YWNBTA, I don’t care what happened there is NO reason to leave one of your children behind on a trip like that. Kid (well adult now) of dysfunctional parents here, this is definitely going to show that poor girl how her dad really feels about her. Thank you for being a caring person", "Don’t make assumptions, ask the question. “Doesn’t niece want to go to Disney too?” \nI can tell you really care, but you can’t assume they’re just leaving her behind to be AHs.", "YTA if you made assumptions, just have non confrontational conversation about it.", "NTA. Just ask why she wasn't able to go?", "nta. my mum and ex step dad took my 3 sisters on a disney trip and left me behind over the summer while I stayed back with step dads daughter and her kid. one of the shittiest summers I can think of", "NTA - The 2yo won't even remember the trip.  Just another couple foisting their strollers onto a paying public.  The 14you would love the trip.  Make memories with her other family.", "In my opinion, YWNBTA\n\nAs the product of an affair, I was not always treated like my siblings and would sometimes be left out of plans or trips. Nothing big like Disney, but for example, my mother once left when I was in middle school for 1 week to my grandmother's house with my brother and sister without telling me. When I called to see where everyone was, my mother told me to eat what was in the house and have a friend stay the night if I *really* couldnt be alone for a week. (Note, this took place during summer, so no school). It made me feel so left out and like an outsider in my own family.\n\nIf I had a caring person standing up for me growing up, I would've appreciated it so much.\n\nNo matter what any adults say in this situation, I think you should say something. At the very least, it's something their daughter will never forget and will appreciate for the rest of her life.", "YWNBTA we as a society have just normalized a toxic mentality where children are viewed as their parent's property and any encroachment on their right to do what they please with said property unquestioned is viewed as a grievous overreach. This course of action should absolutely be questioned because on the face of it it sounds callous and assuming the best case scenario without further investigation so you don't have to do anything is the coward's way forward.", "have you tried asking them why she isn’t going?  There may be a legitimate reason such as a scheduling conflict with school for the 14 year old and work time off for the parents.  Maybe they asked and she said no.  Do not approach them like you have an idea as to what is going on and they are the bad guys here.  If they answer that they just didn’t want her to go, then yeah you could say something then.  If you take an accusatory approach then YTA!", "I would like to know why they are spending so much on a trip the 2 yo won’t remember but a 14yo will", "Nta, please kindly go something like \"oh she isn't going?\"\n\nI was the middle child and 5 years younger than my older sister. She went on trips by herself all the time with grandparents. I kept being told I was too young, and at that age, I'd go. Well then, it became I had to go with my younger cousins who are 3 years younger than me. My little sister is a year, so it didn't matter.\n\nWell then, the trip got canceled. Or my older sister got so many more things than me because she was the favorite. Pearl necklaces, brand new instruments, a computer.\n\nSo yeah, just ask but not accuse. Maybe the oldest doesn't like Disney or something.", "NTA. They probably planned the trip around the time she had to visit her mom. You’re worried for her but just ask them about this.", "Why don't you just ask?  Sounds like it is a scheduling thing.  Maybe she doesn't want to go. I wouldn't go in with accusations until you know the facts. NAH", "YTA, OH NO A CHILD CAN'T GO TO DISNEY the world is gonna end. Parents shouldn't feel guilted for wanting some alone time and a special trip just the 2 of them. PARENTS ARE HUMANS TOO.", "YWNBTA\n\nIt’s a family member, not some stranger on the street. this is where tact comes in. I would approach with being curious vs accusing. \n\nI find that gentle parenting approach works on 90% of adults. So maybe go that route when asking. You don’t have to start a war, but you can plant the seeds of how wrong they are acting.", "NTA. It is cruel of them, I’d never dare go to Disney on a week we don’t have my stepson.", "As a child of divorce with multiple half/step siblings, and a spouse with a blended family, you can't put one child's life on hold every other week/weekend/holiday because the other child isn't there. There is no fair in this situation. The 14 yr old has had 12 years of experiences without her 2 year-old brother. I'm sure they are doing their best working within the parameters of the custody agreement. And despite popular opinion, yes, mind your own business. This isn't abuse. ETA: NAH because I don't believe you can possibly understand the extremely difficult and complicated dynamics and decisions involved in these types of situations. If you involve yourself, you will be t a.", "YWBTA \n\nUnless you have the facts don’t it up. Maybe the asked the 14 year if she wants ti go and she doesn’t? Maybe her mom won’t let her? Maybe she hates amusement parks and or/Disney. Not every kid wants ti go to Disney and I think 14 year might be board there. I have a 14f daughter and asked if she and her her birthed wanted ti do Disney when we go to Florida next month and both responded with a hard no. I also think Disney would be lost in a toddler as well as they won’t temper the trip, but their money their choice. \n\nThe issue doesn’t effect you so let it go. If it makes you feel better you could ask your niece and get her side if the story, but otherwise don’t bring it up.", "Stay out of it. It's not your business. If you don't want to lend your DVD player, you don't have to. Just say no and leave it alone. If he presses, remind him it's yours and you don't have to. They're spending money on Disney, they can afford to buy a second DVD player they're not expensive anymore. But do not intervene. Reverse roles. Would you want them interfering with your parenting?", "Just ask them how come she’s not going if it bothers you that much. Right now you don’t have the info to determine if they excluded her or if the kid just didn’t want to go.", "I may be a little confused here or maybe the first sentence is a possible typo..but, you're saying that both your husband's sister and brother are married together...SIL/BIL", "YWNBTA if you talk to them about it in a calm manner. Of course not. Perhaps the stepmother is deliberately trying to exclude the kid. In that case, it will be helpful if you raise awareness of that fact. Or the kid doesn't want to go because of any of a million reasons. She's a teenager, after all. Or it's not possible due to scheduling issues, or the co parenting with the mother is not great. We don't know, and you don't know. The only way to find out is to talk to them.\n\nPersonally, I think it's weird to exclude one kid on a family vacation. I have a blended family, and I would not travel without any of my kids.", "It's a crappy thing to do. There was a time my dad took my brother,half brother,and step brother and stepmom on a \"family trip\" to Chicago. I got left behind. It's a crappy thing to do and it hurts.", "YWBTA\n\nI get it. From your report, yeah, the BIL & SIL are assholes and it doesn't matter why .....if they are going to Disney, ALL their children should be included. I'm sure the 14 yo's mother could/would make an exception for a trip to Disney. \n\nBut ultimately, whether they include all their children or not is not your business. I feel bad that the 14 yo now knows exactly where she fits in in her father's life now with the new wife and new siblings. But you can't get in the middle of that. All you can do is make sure you do what you can to let the 14yo know that her place in your heart is safe and secure.", "You have to find out exactly what's going on here before assuming the worst of your inlaws.  \n\n\"14F's mom is going to take her to Hawaii for Spring Break!  Awesome!  Let's do something fun targeted at 2M during that week!\" is very different from, \"Hey, we're taking 2M to Disney.  Go hang out at your mom's, I guess, or whatever.\"\n\nUntil you know which one it is I think it's a tentative NAH.  In a family where the kids aren't full-time with either parent there's inevitably going to be some pleasurable experiences that don't get to be shared.  You're not wrong to be concerned and to speak up if they actually are excluding the half-sibling from their family.", "I agree but, at 14, I think _asking the niece first_ is the way to approach it. She may not _want_ to go. And if that’s the case, then everyone’s fine, but you’ve still demonstrated that you’re paying attention to her and care. And if she does admit that she feels excluded, (and you get consent to meddle—both because consent is important at giving kids that age agency and choice, and because you don’t know all the details such as if meddling might make the family dynamics between her and your brother even worse) then no matter how your interaction with your brother goes, she knows she still has other adults she can ask to fight for her. \n\nI expect that whatever reasons your brother has for not taking his daughter, it’s probably deliberate and you’re probably not going to change the outcome. And if you did, it’s no fun to be 14 and on a trip where everyone you’re with is resentful you are there. So supporting your niece is the most/the best you can do, and should be primary when you consider how to interact with your brother. If “fair” is going to just make her more miserable, fighting for it is just about your own personal ethics, and isn’t about empathy with her at all.", "Yeah I can't believe all the people saying she's the AH and it's not her business. It's one thing to have something scheduled with one child while the other one is with their mother, like going to the movies or a restaurant, it's a whole other thing going to an awesome park that costs an arm and a leg! It stinks of preferential treatment and I think she's an awesome aunt for worrying about the kiddo.", "In my 30s and finally having heart to hearts with my aunts (dad’s sisters) and finding out they all saw how shitty my mom was.  It is both validating and saddening.  It feels so good to know she didn’t hide her true colors to others as well as she thought, but it’s heartbreaking knowing no one said anything.  I do not blame them, but I do wonder what would have happened if they did step up.", "All I ever wanted as a child was for an adult to say \"What about Mildone?\"\nI was always just background noise in my family and it would have meant the entire world to me if someone,  anyone would have spoken up on my behalf. As an adult I get myself in trouble from time to time because I have to speak up on behalf of others.  As a teen I went toe to toe with my little sister's friend's moms once or twice.  I speak up for my kid's friends and even my own friends who are being mistreated. I don't know that you are an asshole either way but I do know you have the opportunity to help your niece to feel seen and loved.", "I agree with you, but in todays world, the \"questioning of parenting decisions\" can and most likely will result in incredible backlash from the parents. Op should talk to the left behind daughter only, and figure out how they can support that child.", "This. Being concerned and open to reasons.", "As a stepmom, I agree with you. I would never plan a Disney vacation without my stepkids.", "Emotional well-being is as much as important to physical well-being. \n\nEmotional and mental health is often juggled of the blended children. \n\nWhat we adults see as little is big and at points even heartfelt and memorable for kids.\n\nWish more parents take this into consideration. \n\nI am sorry you went through that. I, in some ways, relate to you, too.\nWhile I try my best in my blend.", "What are good facts to leave a child out of a trip?\n\nEdit: Everyone keeps talking about custody agreements. Sure, I understand that could cause an issue but rearrange when you can ALL go rather than leaving out a child from Disney land.", "This ain't it. OP should be digging into to figure out what's going on", "It’s not her brother’s kid. It’s her SIL’s husband’s kid.", "Not necessarily. The teen would be limited to toddler appropriate activities. She quit possibly will spend the trip whining \"I'm bored\" \"I'm not a baby, why am I stuck doing baby stuff\" and \"Why did baby have to come. This is MY trip\".", "I was thinking this too. We brought our then 3 and 1 year old to Disney last year and you are simply limited in what you can do with young kids.  You can’t go on Space Mountain with a 2 year old.  Also nap/sleep schedules are a thing.  We were at our AirBnB by 5pm every day because my kids go\nto sleep at like 6pm.  For a 14 year old things are just getting good.", "That is rugged American individualism speaking. Where old people are put out to pasture and the whole “it takes a village” thing is seen as idea from other inferior cultures not good enough for us. Because as long as it doesn’t affect me personally, then it isn’t my business and doesn’t really matter.", "The question more often is, for those Who could have spoken up but didnt, that wether they want to Bring up what they see wrong Or be estranged from that person.\n\n\nNeglectful People dont take criticizing well, they Will rather further ignore the criticizer than listen to them and thank them for their insight and become better.", "In blended families there are going to be things that they do with just the 3 of them the same way that the 14 ur old will do things without them. You sound bored.", "This is a great way to word it!", "With the added insult that kiddo is two, and unlikely to retain more than one or two brief memories, while teenager (assuming they like Disney) is of a prime age to enjoy the park. \n\nOP should not go in guns blazing, but they should take care, and I agree: taking out teenager for a local trip would be a good thing.", "This isn’t remotely similar to your story. She lives with her mother half time and gets to do things with her mother solo.", "How many big trips has 14 yo gone on without her baby sibling? How many more will she go on?", "There may be a set schedule from the court listing who gets her for vacations, holidays, etc, and yes alternate these each year.", "OP has commented elsewhere that it’s shared custody and the daughter will be with her mother for spring break as it’s her week. \n\nSo it’s likely mum doesn’t want her to go because it’s her time/has something else planned.", "Her mother doesn’t want her to go, as she has custody during her spring break.", "I don't know if you've read this comment by someone else but I'm directly telling you, approach the problem to your brother with curiosity. Ask him what it is that stopped him from rearranging and what caused him to book a holiday at the time his daughter was going to be with her mother. If he brushes it off there isn't much you can do. But you might be able to understand or convince him to change. Don't let your niece be neglected.\n\nThanks to bellesavage for the words", "I think you're looking for justice, and there's nothing wrong with having a heart for your niece. Even if you do say something and it's justified, what did it do? Does it change anything? Does it actually help your niece. The best thing you can do is talk to your niece. Find out why she's not going. You can be that aunt who's willing to listen. However, it really is none of your business. Unless you put in, pushed out, or are raising the kid, it's not your place. I have siblings who have blended families, and while I don't always agree with how they parent, it's not my place to tell them how.", "I don’t think you’re an asshole for side-eyeing it, but the most you could do would be ask “oh, how come 14yo can’t make it?” And let the answer stand for itself.", "You are getting demolished in these comments, but I think you are more familiar with the situation than any of these strangers.  Listen to your gut.  Gut instincts are usually never wrong.", "You cannot may a judgement as to whether or not you should even be upset about it until you know the details.  It's honestly that simple. You are worrying about something and you have no idea what is going on behind the scenes.\n\nAnd the average 14 year old is generally possessive of their belongings. It is very easy to think that she doesn't want to go, but also wants to keep the player because she intends to use it while they're gone.  I've known many 14 year olds.  This is entirely within character for even the really nice ones.", "Why are you acting like she’s an orphan on the street?\n\nShe has two parents. \nShe presumably has some other relatives on both or either side. \n\nYou admit to not knowing the details and you haven’t even indicated that you and her have a close relationship at all. It’s bizarre you think that there aren’t others who know more and who aren’t better equipped to evaluate the situation.", "yes, but those types of things are normally like visiting the pool, or heading out for dinner somewhere special. Not going to Disney. That's the type of thing to raise a little suspicion at.", "Of course it’s not the same as my story. That doesn’t really matter though. One parent doesn’t replace the other. She can still feel neglected and abandoned by her dad while feeling loved by her mom and no child should feel that way in my opinion. The feeling of abandonment is still the same even if one parent is present. Especially when you have a half-sibling to see exactly what you’ve been excluded from.", "You mean because he wasn't born yet? Therefore making it literally impossible to exclude him. And your second question is only relevant if the trips are with the dad. He's the shared parent.", "They may have tried.\n\nYou admit you don't have the whole story. Without the full picture you're spiraling down thenassholendrain and you can't get out", "Being concerned is not virtue signaling. It’s being concerned for a valid reason.", "I just came back from Disney with my 8 yr old nephew. I'm almost 18. I loved it more now than when I was 11. Just because you don't enjoy amusement parks doesn't mean every teen hates it too", "Lol some parents do not do the best that they can either. Nothing wrong with just asking nicely to check.", "Right! People have no idea how much most step parents think about all this stuff. SD will miss things, it’s the unfortunate reality.", "Sick martyr complex, I bet that makes parenting a lot easier for you", "You don’t think that the 14 year old isn’t going to be going on big trips with her mom that they will be excluded from?", "How many rides would the daughter be able to go on with a toddler in tow? Probably not many.", "Not her place and it seems like she has already been asked to stay out of it. In that case there is.", "Perhaps because she wouldn’t be there to ensure nothing happens to it.", "Does the sibling go to her mom's house ever? See the difference?", "It’s entirely different for the 14 y/o to go on trips with her mom that her step family is excluded from. It’s not comparable to her dad leaving her out of a big family vacation. Maybe there’s a good reason, maybe step mom thinks she shouldn’t go because she’s “not her kid”. Either way, you can’t compare her doing something with her mom to her own father not wanting to do something with her.", "But the 2yr old isn't the mums child.", "Plenty, there's no reason that the toddler would affect rides, with 2 adults present too", "Nah nothing wrong with checking in. It would be my business if it turned out my sibling was excluding my niece.", "Exactly 14 yo has 2 homes and the opportunity to do more things, and that’s ok, just like this is ok.", "I’ve been the other child in this situation and it breeds resentment knowing your older sibling gets to do stuff without you, but you have to share every single special moment with them. It has definitely had a negative impact on my relationship with my brother now.", "So. Younger sibling may still feel left out that they can’t do some of the big things 14 yo gets to solo while they have to share all of their vacations with sister.", "So you would have absolutely zero problems if for every parenting decision you made to your children was questioned by some other party just so they can check in?\n\nOr do you think that would get pretty exhausting after a while when others are automatically assuming you are a bad parent because they know better even if they are not privy to the facts?\n\nLook I fully understand wanting to look after the kids and wanting them to have the best of everything, but that isn't reality.", "just because the 14 yr old has 2 houses does not mean she has more opportunities for things like this\nif anything it would be less because now she has a single parent household", "I’ve been that child too. But expecting the 14 y/o’s mom to take her ex’s kid on vacations or trips is too far. Thinking it’s okay for her dad to act like she doesn’t exist so he can play happy family with his new wife is even worse. That kid has both of his parents together to do that stuff with him. Unless there’s an actual good reason, like her mom doesn’t want her going out of state, her own father is excluding her and treating her like she’s less than since he has a new kid.\n\nEdit: added a word", "Tbf that's the dad and step mum's problem and would need to talk to 2yr old when they are older. My sister done things with her dad that I wasn't included in  but my mum included all her children in the  activities she planned.  The 14yr old is being left out by her dad. Who will see the trip to Disney without her as dad preferring the new child to her.", "Maybe the daughter doesn't want to go to Disney because she won't be able to do activities she likes because a toddler can't do them. Definitely wouldn't be a day of rollercoasters. Most likely, her memories if she were to go would be she went to Disney and couldn't have fun because the family was stuck doing toddler-friendly activities!\n\nYTA and MYOB! This is not something you should be involved in.", "We don’t know if mom is a single parent. I’ve been the other child in this situation and it breeds resentment knowing your older sibling gets to do stuff without you, but you have to share every single special moment with them. It has definitely had a negative impact on my relationship with my brother now.", "I read it as the opposite so maybe OP nicely checking in to find out would answer the question honestly.", "Does your arm hurt from all that reaching?", "Understandable for sure. But not in this scenario because the younger brother is 2 and will never remember this trip, which means leaving out the sister was probably step moms idea…", "Based on this judgy post I don’t trust OP to actually ask nicely. But I agree, it’s not an outrageous thing to say “oh (14 year old) isn’t going with you guys?” and open up the conversation.", "Most teens I've been around don't want to spend time with a toddler, especially at a theme park. Saw it a lot at my local, very famous, largest waterpark in the world. (I lived down the road from it) Older kids stuck at the kiddy pool because the youngest couldn't go on any of the rides.\n\nEdit: The other thing I saw was parents waiting in line with a squalling toddler so the teen could go on the ride. Parent then had to walk back down the stairs with toddler. The best one was having the parent change diapers while in line. Fun times for all.", "YWBTA. Your feelings on this situation do not matter especially if you stated yourself that you don't know all the details. They're asking to borrow a DVD player and nothing more. Maybe the dad had his daughter for one week of spring break and the mother the following week.", "Not enough information. \n\nIt could be that they are AH's, but you don't know the whole story.  In lieu of that, you have no dog in this fight, so, mind your own business.", "NTA\n\n&#x200B;\n\nThey are massiva AHs, and BIL is a shitty parent.", "NTA. Do they seriously think the 2 year old is going to enjoy Disney more than the teen??", "YWNBTA for asking in a non-confrontational manner why they aren't taking her.  With divorced parents the situation is a bit complicated.  Since she'll be with her mom for the week it could be that her mom refused to change weeks to enable her to go on the Disney trip and then lied to your niece about it.  So, it could be that your niece is upset because she wasn't told the truth that her dad wants her to go but it is her mom that is forbidding it.  If that's the case, then your BIL is the one who needs to figure out how to address it with his daughter.", "Y W B T A-  I’d say something and wear that A H badge of honor (shine bright like a MF diamond), sounds like she needs someone to have the balls to say something. And to those saying you minding their business -when they asked for your DVD player to go on the trip and let you know it’s because she won’t let them use hers- they opened the door. So I don’t see it as minding their business - they put their business out there. I don’t like sketchy parents or stepparents, I’ve dealt with them more than I ever care to.", "NTA depending on how you bring it up. Do you know for sure that your BIL/SIL aren’t allowing her to come, or is it possible her mom not allowing her to go with them? I would just ask in a curious way, why she isn’t joining them on the trip. See what kind of discussion it creates but don’t push it if they don’t want to talk about it since it’s not actually your business.", "NTA, definitely approach the issue with caution but you’re right to be concerned. They have 2 year old who won’t remember the trip at all and yet they’re leaving the 14 yo who would definitely retain the memory of either going or not going. Seems odd to me that they’d spend so much on a trip for one child that can’t really enjoy it and not the other that would definitely love the experience.", "Calling it out literally? Yes, you WBTA. What others are suggesting, one on one with bro in a curious vs confrontational way? That would not. If he wonders why you care: she’s my niece, I’m concerned, what with the anxiety/depression. (This could be why she’s not going…unless it’s why they don’t want her to go…because she’ll “ruin” the trip??? Be prepared for this…and then you can confront them in their BS…but right now? You just don’t know the whole story.)", "NTA. Because some people do treat one kid horribly. But ask, don't accuse. It's possible the girl's BioMom won't let them take her out of state. My husband's ex would pull that crap, and the kids would be mad at us but there wasn't anything we could do. I hope that's the case with them. If it's not and they are just excluding her, get their butts for being AH", "going to disney with a 14yo is so much different than with a 2yo. it makes sense to me to separate those trips. \n\nand if the 14yo is with her mom for the school holiday, it simply doesn't allow them to take 14yo with them, it's not personal. IME trying to trade holiday time can be a big fight. they maybe could have planned a disney trip for the summer or some other time with both kids around. they probably could have handled their message to her better, but with shared custody, kiddos miss out sometimes. \n\nalso, it sounds like the 14yo is making her feelings clear, without your voice added. these are your husband's siblings? i don't think it's worth mentioning your opinions to them.", "Stepparent here & it’s rude af to plan a big trip without all the kids. It’s obviously crappy being restricted to limited dates but that’s not the child’s fault", "YTA  1)you don't know the situation with all its intricacies. 2) You don't know if its the mother that will not allow the child to go to Disney because if ghe mother wants she could give up that custody time to allow her but you seem to jus go straight at the Step parents / Father. Thats sexist. Most separated mothers isolate fathers and step parents by refusing to give custody for family trip ghier children would enjoy and then blame the father or step parents. 3) The 14yr old would probably be bored having to do activities for younger kids especially if she's introvert or anti social or having social anxiety. The crowd and people and noise could be a horrible experience especially if someone is forcing you to play happy blended family. 4)While she may not want to go and would have a horrible time like most teenagers if they were invited and said no and the father still decided to go she my feel resentful because she can't stop him from going or spoiling the trip.", "YWNBTA. My heart breaks for her. I’ve been that kid. It hurts. It really really hurts. Plus she’ll remember that trip far more than the 2 year old.", "Have you asked why she isn't going? It could be coming from her mom not letting her go. I mean, if it turns out that they deliberately excluded her, then yeah call them out for it. But maybe wait until the full story is out before getting involved as it will likely cause drama.", "So you have no idea whether she wants to go, what she's doing instead, what discussions have taken place or why the decision has been made ... and you want to \"call out\" the people involved?\n\nOh yes, YWBTA.", "YWBTA. We have definitely taken trips without my stepdaughter because of scheduling. However, unlike in this situation, we just make a point not to talk about it around her so as not to rub in that she's not going on the trip. But you don't know the whys of it. Likely it's scheduling. But if you're working around school and work schedules, those things aren't flexible. And once the trip is planned, it can't just be changed anyway, so I'm not sure what you're hoping to accomplish.", "First thing you need to do is find out why they're not taking her.", "YWNBTA. They planned it for spring break which wouldn't impact the 2 year old at all, but aren't bringing the 14 year old who would benefit? What was the point? I don't get it. \n\nAlso, IMO, taking a 2yo to Disney sounds awful!", "My dad took his family (my stepmom and step siblings) to Disney without me when I was about 12. No reason was really given. I remember going to school and thinking about my family on vacation and how badly I wished I was too. It was a tough week. I think that was when I officially felt like the outcast of the family. A feeling which has never left. Our relationship did get worse as I got older because of these sorts of issues and at one point I didn't speak to anyone in the family for 13 years. Even now it's a very superficial relationship. I wish someone had spoken to my dad and said you need to take the whole family or not go. It is a big deal.", "I agree w this, but it’s not crazy to think that a 14 year old wouldn’t want to tag along on what’s really a Disney trip for the 2 year old.", "Girl by who takes a trip to Disney world without their kid? DISNEY WORLD a place that’s as me at for parents to take their KIDS your a shitty step mom period my dad was a step father to my sisters AND NEVER EVER left them out of anything he did for his bio kids you and your husband are just shit people you don’t exclude kids even if it’s not your time you simply work around the schedule or ask it’s not judgement it’s the simple fact that your treated your kids differently if one is able to go buy the other ain’ it’s just selfish and tbh I feel bad for your step kids it’s disturbing and disgusting to not want to include them into tried just because it “isn’t your time” do you stop being a parent when it’s not your “time” imagine being a kid and seeing your whole family on vacation without and their y is oh we didn’t wanna mess us the agreement BULLSHIT", "We don't know the whole story.  It could be that mom said, \"It's my week, no you can't take her to Disney!\" and then turned around and lied to her daughter about it.  That happens a lot, unfortunately.\n\nETA:  People seem to be forgetting that this trip was scheduled over the kid's *Spring Break* when they are already off of school.  If they tried to schedule it for the week they have her, mom could shoot it down because she doesn't want her to miss school.", "> Everyone telling OP to mind their business likely hasn’t been neglected or ignored as a child.\n\nThis just in: not going to Disney is NOT \"neglect\". Spending time with you mother is NOT \"being ignored\".", "But have you actually asked your niece if she wants to go? At age 14 she’s really past the ideal age for Disney unless she happens to be one of those people who is a huge lifelong Disney fan. I’d say the parks are ideal for kids age 4-10 and after that it can start to get boring. Additionally, most teens I know would be super bored by going on a Disney trip with two adults and a toddler. Teens generally want to be with their friends or at least with other teens. \n\nI actually took a Disney trip with my father, stepmother, and two young siblings (I think they were 2 and 4) when I was 15 and it was so incredibly boring. I wish I had been given a chance to stay home with my mother and hang out with friends instead. \n\nIt sounds like you are projecting what you would want in that situation without any information about what your niece actually wants. It’s ok to gently ask for information if you are close to your niece, but you would be an AH if you scold your brother without any information on what your niece actually wants.", "Literally what facts, if there is favoritism obviously parents wouldn’t admit to it", "Unless their custody schedule changed unexpectedly after the trip was planned, they should have planned the trip for their week with her.", "Or the mother could have refused to allow an out of state trip. Usually local trips fall under the \"your time, your decision\" category, but out of state can require consent by the other parent, even if it's not their time.", "You're being willfully obtuse. It's being the only child left out of a family vacation and the emotional ramifications that come with that.", "If it's spring break they can't control it but could opt for summer", "They planned the trip for Spring Break so that they wouldn't have to take the kids out of school, and they'd already be off.  Neither parent has control over when the school schedules Spring Break.\n\nIf they didn't plan it for an already scheduled week off of school the mother could still object to her daughter missing school.", "Firstly I would hope that dad is doing things with the 14 yo alone without stepmom and little one. In that same vein it’s ok for just the three of them to do things together as long as it’s not during dad’s custody time, and they also do big vacations with both kids.", "It could just be that the daughter knows they have left her behind so is unwilling to let them use her dvd player. She could very well not need it.", "They have a two year old, spring break isnt much of a factor unless they are teachers", "ok wait, one of the kids is 2yo so he's not in school, and if they knew spring break is Mom's time then they should have picked a school holiday that they would have her for. custody during holidays and breaks is typically decided and known well in advance, as are the school breaks themselves, so i dont really get what youre saying?", "Also going to Disney with a 2 year old where they will barely enjoy anything (massive tantrums all the time seems more likely) and definitely not remember any of it seems like terrible idea.", "There's also rider switch, which they could easily use.", "Oh by no means am I saying that the mom should include the little one on her family vacations, but there is nothing wrong with taking a vacation with just the 3 of them as long as it’s not during dads time, and they also take big vacations with all 4 of them. Little one should not have to miss out on things because oldest  can’t go. Little one should get to do things with  just his mom and dad. Dad should also be doing things with just the 14 yo alone. Blending families is hard, and someone will always be left out. The important thing is to make up for those times in an equitable way.", "I disagree. There is nothing wrong neither doing big vacations with the 3 of them as long as it’s not during dads custody time, and they also do big vacations with the 4 of them. Dad should also make sure to do things solo with the 14 yo.", "YTA. Mind your own fucking business. You say yourself that you don’t know the facts.", "Waiting for a update", "You would be because you don't have all the facts. If you feel your niece (I'm making an assumption you view her this way since you are so concerned) is being let down, the biggest way you can impact positive change for her would be to make plans to do something nice with just her.", "YWNBTA if you just asked them why she wasn’t going on the trip with them but YWBTA if you just assumed things and called them out for your assumptions. No one has any idea of the context here. Maybe BIL and his ex have an agreement that neither can take their child more than X number of hours away without the other parent’s consent and his ex won’t agree to it. Maybe the child doesn’t want to go to Disney because she thinks Disney with a 2 year old won’t be fun. Maybe your SIL and BIL are assholes that don’t include his daughter in things. Nobody knows, including you.", "I think it’s totally fair to ask why daughter isn’t going. It’s all in the tone. Don’t accuse but try a tone of surprise. It could be that mom won’t let her go on her visitation time but it could also be they are intentionally leaving her out because a fourteen year old on vacation costs more than a two year old. I hope she gets to go though.", "NTA, but ask why rather than call out until you get more details? Maybe the daughter has special plans with the mom that week?", "My boyfriend had a similar situation happen to him as a child; grandparents took the two favorites and left the other two at home, if someone would’ve spoke up on the injustices that were being done (more than just one), i fully believe there would’ve been a different story for his childhood. I wouldn’t come at them accusatory, but try to form an open ended question about what the other child is doing, or even look for more information, but if you DO get the information and it isn’t good, if you were to confront at that point, NTA.", "You're making a lot of assumptions without knowing the facts. She may not be letting them borrow the DVD player because she's using it. Maybe she's going somewhere with her mom. You don't even know if she wants to go. If she had said she was upset about it that would be one thing, but you are inserting yourself with no information. YTA", "NTA I'd just innocently ask, \"oh why isn't she coming along too?\" \n\nCould be that her mother is particular about her custody days, jealous and doesn't want them taking her daughter to fun places because it can make her prefer dad's family, or MOST LIKELY, step mom wants to purposely exclude step daughter because she considers her an outsider/ doesn't want to spend her family's money on her and dad is going along with it because he's pathetic and prioritizes his new wife over his own child.", "You WNBTA. I was the only cousin excluded from a family trip to Disneyland when I was a kid, even though both my step siblings got to go. It honestly made me hate everything Disney for years, and made me incredibly bitter and hateful about the exclusion. It wasn’t until I finally got to go to Disneyland as an adult that I was able to feel better. I have never forgiven my aunts, uncles, and older cousins. My brother tried to get them to bring me on the trip, my sister was glad I didn’t get to go and threw it in my face for years. Guess who I have a better relationship with? I’d die for my brother and his family, I can’t stand being around my sister. This will breed massive amounts of resentment, and will absolutely destroy any relationship he has with her, AND her mother. She will see this as being replaced, and she will hold it against them forever.", "If she doesn't have all the facts... how it's an asshole thing to politely ask BIL why he isn't bringing his daughter, so OP can get all the facts before forming a opinion?\n\nYou are just a gigantic asshole, saying someone shouldn't investigate further a possible case of parental neglect. One that is easy to investigate and harms no one.", "I recently visited my childhood next door neighbor after almost 40 years. At one point she said that her father always felt bad for me, knowing what was going on next door and being unable to do anything about it. Apparently, \"back then\" you respected your neighbor's privacy and minded your own business. Fuck the kids, I guess!!\n\nIt was the first time in my life that anyone acknowledged knowing our situation. But saying that her family knew and did nothing was like being stabbed in the gut.", "Disney isn’t fun with a toddler.  They’ll only go on the rides for young children and won’t want to wait while the teen goes on rides.  They’ll have to leave the park early to put the younger child to bed. \n\nIf you’re so concerned about your niece being left out, why don’t you take her, just the two of you?  It could be a great opportunity to bond with her.  If you can’t afford it, see if BIL won’t consider taking his daughter, just the two of them, or if he’d help pay for you to take her.\n\nNAH.  That’s her mother’s week and the experience would be ruined (for the teen) by the presence of the toddler.  I do think it’s lovely you’re watching out for your niece.  It wouldn’t hurt to ask your BIL a few questions to get him thinking about whether or not he’s excluding his daughter and what some alternatives might be so she feels valued.", "Disney is geared towards school age kids. A 14 year old would not have trouble finding things to do.", "Co-parenting is complicated enough without other people butting in with their opinions. Not going on a vacation with one parent when they are in the care of their parent is NOT neglect. It’s not OP’s business. If OP doesn’t want to lend the DVD player, fine. But there could be dozens of reasons the 14yo isn’t going. 14 could be in trouble and this is punishment. 14 could not want to vacation with their 1/2 sibling and asked to stay behind. And even IF it’s because step-mom needs a break and wants time without 14. THAT IS NOT NEGLECT. And really no one’s business outside 14’s parents.", "Perhaps she's planning on using it for a trip with her mom on Spring Break?", "Yeah but then as an aunt approaching asking with caution and no accusations it can be just a harmless short conversation. Then if you find out they did exclude your niece you can make a little extra time to give your niece extra love. You don't need to create any tension if you handle things well. \n\nLots of people don't know how to navigate potentially rocky situations though.", "Who, exactly, is on Spring Break EXCEPT his daughter? His son is only 2. So, why are they on \"Spring Break\"? Confusing unless one of them is a student or teacher.", "So why you're against OP politely asking her BIL.\n\nThat way she can discover why his daughter isn't going in the trip", "You know trips can change dates as well right?\n\nLet's change the date to one where my child can go as well... is not that hard.\n\nOP should ask... precisely because she doesn't know all the facts;", "So...no one, then?\n\nGreat plan - for the dad. Horrible for the poor child.", "they could also work at a school so this is their time off as well", "The son could be at a daycare that also does a \"spring break\" especially if it is connected to a larger school or university.", "You are assuming that the child wants to go, for a start. Not all children like Disney, believe it or not. Perhaps she actually wants to be with her mother.", "Oh I love amusement parks, but I hate Disneyland. Id fight over missing Knotts berry farm, not care about Disney. And a lot of people feel the same way and would rather go to 6flags, Knott's, silver dollar city....\n\n>Just because you don't enjoy amusement parks doesn't mean every teen hates it too\n\nSo why dont you delete this part of your asinine comment.", "Yes, dates for a trip can change, but spring break cannot. No one is going to take her out of school for an additional week for a Disney trip.", "Their 2 yo isn't even in school.", "If she does that's awesome! But we don't have that information, so I'm not really sure what weight that's supposed to hold.", "You're argument is that she probably wouldn't like Disney anyway, my point being that teens can most definitely enjoy it. Good for you if you enjoy other amusement parks but that's irrelevant", "You realize the comment they were replying to makes the assumption that because they would have no desire to go to Disney when they were 14 doesn't mean others would right?\n\nLike your comment came at them sideways for zero reason.", "Spring break is one week only?", "School breaks aren't known as far in advance as custody time.  School calendars are released close to the beginning of the year.  Custody time can be scheduled years in advance by using an \"alternating week\" system so these planned trips can have a monkey wrench thrown into them when the school calendar doesn't jive with custody time.\n\nAlso, sometimes school schedules get thrown off due to natural disasters or other emergencies.  My sister is a teacher and one year they had a nasty flood, so the school rearranged their entire calendar at the last minute and spring break changed.", "But the oldest *is* in school and that is the point that people are missing.", "No more weight than the equally unsupported claim that she would prefer to go to Disney.\n\n*Note: Perhaps she just wants to use her DVD player while she's with her mother.*", "Thats actually not my argument, but at least I'm not making half ass assumptions about other people not liking ALL AMUSEMENT PARKS because they dont like Disney, unlike you. It's funny how you call my comment irrelevant when yours added nothing to the conversation besides to put someone down.", "I agree, that's why I quite literally said that the issue has nothing to do with Disney in my very first comment. :) I'm so glad we're on the same page now.", "It's a trip to Disney not some random event lol.  Come on now obviously there is a difference between Disney and most other things.", ">I’ve been the other child in this situation and it breeds resentment knowing your older sibling gets to do stuff without you, but you have to share every single special moment with them. It has definitely had a negative impact on my relationship with my brother now.\n\nI've been the OTHER child. My siblings have a lot of amazing memories and inside jokes that I won't ever get to be a part of. It's not their fault, I'm not mad, I'm really happy they got to do cool stuff even without me!\n\nBut there's no pretending it hasn't created a gap between us. How can they feel like we grew up together when I only lived with them half the time, and I wasn't allowed to go on the big amazing trips with them? It really negatively impacted our relationships, because we couldn't build the whole foundation together.\n\nGrass isn't always greener dude.", "But a trip to Disney is a way to really make his 14 year old start to resent her dad & his new family. That kid won’t remember anything about it, even if there is pictures taken. Trying to make sure something that big could include his daughter would be an excellent way to help blend the families, and help his daughter build a bond with her step mom and half brother. Prioritizing a trip like that with his new family, making sure it’s done on a week he doesn’t have his daughter, it’s awful. Imagine if she did want to go & her mom was ok with it, but he said no because it was for his *new* family.", "I’d ask the question, but I can’t think many 14YOs would enjoy Disney. I certainly wouldn’t have enjoyed having to give up a whole spring break with my friends to go to a kids’ theme park. Maybe the 14YO said no to going…?", "I don’t know how anyone here has any answer besides “just talk to him”. You don’t have to accuse him or anything. Do you not have a good relationship with them? I would have immediately and without even thinking about it said “oh, 14F isn’t going? Why?” Just out of curiosity.\n\nNTA at all but it doesn’t have to be you calling him out. You just need to communicate and get more info if it’s something that really bothers you. I do agree with the people that said maybe she does need an advocate, but don’t go in there guns blazing or it will be counter productive.", "NTA - unless she said herself she didn't want to go. But it's unlikely. Still among them 4 she's the one who is most in age to be thrilled to be going to Disneyland and they exclude her. I mean bringing a toddler who won't even remember in a few months he went there is pretty pointless and they are both grown-ups who should know if they want to go the 14 yo obviously would love it too. That's a pretty horrible thing to do, the girl will probably never forgive them that.", "My husband won't allow us to have a family vacation unless all of us are together. My older 2 children are his step children. Their dad would always plan his vacations when he didn't have them because it cost less without 2 extra kids. I flat out told him that's crappy to not include them in his plans. He figured just because I took them on family trips, he would have to. I told him he makes them feel like they don't matter as much as his wife, her son, and their adopted son. He stopped planning trips without them after I pointed that out. Someone needs to advocate for that girl, so I think ywnbta to say something.", "Don’t mind your business when an event that could hurt a child is happening. That’s just bad advice. Calm them out. It’s a terrible thing to do not to take her.", "Sil and Bil are the assholes but not your problem stay out of it. Personally I’d get the popcorn ready and wait for the show to start.", "No need to \"call out\" anyone , just ask why the daughter isnt going would be enough? No?. Once you have more facts then you can make that type of call but sorry you dont have enough to go on YET! .... i remember a family trip from year ago my brother didnt go , simply because he just didnt want to go and my parents never forced him.", "I am alive today only because two of my aunts cared enough to to bring things up.  To give me a safe space.\n\nI wouldn't leave it alone.", "OP has a story of ASSUMING \n[Here is in another post](https://www.reddit.com/r/AmItheAsshole/comments/wub112/aita_for_cutting_off_friends_who_didnt_come_to_my/ildh2h2?utm_medium=android_app&utm_source=share&context=3)\nAnd yet again, without evidence, she assumed things and made stories on her head about the FACTS.\nSo yeah, seems like she needs to clarify things before going on about them. Ask, don't tell.", "Agree. She doesn't know all the things. She just was asked for a favor and now wants to do a whole shitshow of the situation. MIND YOUR BUSINESS.\n I feel like they.... \nI worry that...\n I think they... \nYes, everything you. Why assume all those things in 1st place. \nJust answer yes or no can you do a favor while staying in your lane.", "Of course its remotely similar? The OP is talking about being the first child, and being disinvited from things, while watching the second sibling, with both parents in one household, experiencing a vastly different childhood. \n\nThe only thing that’s different is the reason the older child is being excluded, the theme of the story is the same.", "Mom’s being TA.", "Again... YES. There could be dozens of reasons. No harm is done by asking BIL.\n\n\"Hey, why is niece not going with you guys? I thought she loved Disney.\"\n\n_______________\n\nPeople here pretending that \"outsiders\" shouldn't ask parents about their parenting decisions, and that is ludicrous. She doesn't get to harass or acuse BIL of anything, but no harm is done by asking and gathering more info.\n\nAnd just look at the responses here of people who actually suffered neglect, and that's all you need to know. They ALL agree OP should politely as BIL to know more. And they all said they wished they had someone like OP willing to investigate a little bit more.", "\"WIBTA For Calling Out SIL and BIL\" does not sound like \"Politely Asking\" lol", "Nope. Disagree. If BIL wanted them to know, BIL would tell them. The post gives no indication of abuse or neglect. It’s a bunch of people meddling when they shouldn’t.", " Sure but summer break is generally 6-12 weeks long and only 2 months away.", "Yes, usually spring break is 1 week - or 5 school days."]}