{"id": 13679, "submission_id": "1282fcx", "title": "AITA for throwing away an entire bottle of moisturizer because I think my brother used it for \"fun times\"?", "selftext": "Not sure how much more expansion is needed after the title, but... Yeah. I got chewed out for this a few days ago and just wanna know if I was really TA here.\n\nI (20F) have a younger brother, (15M), who's an absolute pain in the ass to live with in many ways. One of his issues is he completely lacks empathy and will often do things without caring about how others may take it.\n\nOne night, I noticed my bottle of face moisturizer that I keep in the bathroom was facing backwards and in the wrong spot, and had a dent in the bottle like a lot had been squeezed out. Sure enough a lot more was missing than usual, like 1/4 of the product.\n\nThe only two people who use this bathroom are myself, my brother and my mum. I asked my mum if she borrowed some and she said she didn't, and I believe her. She's not a liar and would just tell me if she had.\n\nIt was pretty obvious to me at this point that my brother had used it. I didn't know for what, and thought maybe he just had some dry skin or whatever, but then I realised he might have used it as lotion to jack off in the shower. I know he does this because he's constantly leaving the dried ejaculate on the shower screen. I've never brought it up because eww, but I'm 20, I know what that shit is. And at waist height as well. I think he tries to wash it off but is too lazy to check if he gets all of it. Sure enough, I noticed there was a suspicious streak in the shower that hadn't been there the night before.\n\nI felt super squicky about using that stuff on my face being 90% sure where some of it had gone. I also don't know if he's ever used some before. I ended up throwing the rest away and have bought myself another tub from a different brand that I'm now keeping in my room. My mum found out I threw the bottle away and got mad at me for wasting it. I tried to discreetly explain but she called my actions \"ridiculous\" and said I was just making assumptions. She's still a little salty if I'm honest, even though I paid for the products myself. I don't normally like to waste things but I was never using that stuff again if I'm being honest.", "created_utc": 1680302734, "permalink": "/r/AmItheAsshole/comments/1282fcx/aita_for_throwing_away_an_entire_bottle_of/", "score": 90, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I threw away an entire bottle of fairly expensive face moisturizer even though I didn't actually know why a lot was missing. Obviously this is a waste of product and money.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "If he stuck his ‘finger’ inside yes chuck it. If it’s a squeeze bottle or a hand pump (oh m g didn’t mean it like that) and he just used some of it, I’d say wasteful. But if you bought it you have the right to use or not use the product. NTA", "NTA. I mean we cant be 1000% sure of what he did but ultimately its your moisturizer so you can do whatever", "NTA. If u bought it, and can afford to waste it if u fear your brother came on it or in it, or with it, doesn’t matter. U made a valid decision", "Ew. Love sex and masturbation. Disgusted by using a sibling’s lotion to do it. \n\nNTA. If you’re uncomfortable with it, it was yours and you threw it out for comfort. You didn’t make your mother or brother buy you a new one, you simply bought yourself a new one that no one else can touch.", "NTA but just say “quite leaving your jizz in the drain dumbass”.", "Haha so gross! No you’re not the AH!", "NTA\n\nI get why you'd throw it away, its not very expensive, and its weird. \n\nHe should buy his own lotion and not use his sister's.", "Hold the fuck up he jerks off then leaves the white stuff to get dried and visible??? \n\nWhat the actual fuck? Enough reddit for today", "NAH. If you bought it with your own money, then it’s your to do with it what you want. Your mom probably just wants to know you’re not wasting things. \n\nEither way, sounds like you need to have a talk with your bro about hygiene. He needs to be cleaning things after he’s done *handling his business* because that’s the mature way to deal with things.", "NTA but INSTEAD of throwing it out...you should have filled it with Tiger Balm or something.", "NTA, it's your property and money, if you want to waste it that's up to you\n\nBut unless he was...using the bottle I don't really see why you felt the need to throw it out", "NTA but if the bro and mom are behaving this way and you’re 20, it’s time to move out buddy.", "NTA, and from now on I'd employ the Hannibal Buress technique: since there's nothing more embarrassing to a teenage boy than being called out for jerking off (save being caught in the act), buy him a bottle of lotion and explain that since he keeps using so much of yours, he must have really dry skin.", "NTA I definitely get being weirded out enough to wanna toss it in the trash and get a new container", "NTA as it's your lotion but, like, grow up. He most likely didn't cum in it and you throwing away the lotion isn't going to stop him from jerking off. Someone's gotta rip the band-aid and tell him to stop leaving cum everywhere though. Maybe like \"hey, you're on bathroom duty since you keep cumming all over the shower curtain\" or \"hey, stop cumming all over the shower curtain\" or someone get him his own jerk off lotion for his bday.", "NTA but you should have taken the bottle to your brother and had a very frank conversation about your observations.  I also maybe would have offered to buy him a cheap brand if he is willing to clean up after himself.", "NTA\n\nnot only did you pay for it yourself, but have reasoning and enough proof and suspicion to come to the conclusion that, most likely, he 'used it'.\n\nI would personally get a humourous sibling jab at him, while also informing him that you know what's up (ex. \"didn't know you liked (brand name) so much\", \"I sure do wonder why most of my (brand name) is gone, oh hey, did you take a shower?\").\n\nA response to all the people in this comment section responding with \"YTA, it wasn't contaminated\" or \"it's not like he stuck his **** in it\", it's better to be safe than sorry. Even if he simply pumped a large potion out he could have been touching something earlier that might be a little uncleanly (seeing as he doesn't bother to clean up), and if it wasn't a pump, well, you can imagine direct skin contact (no matter the body part) with a load of face moisturizer.\n\nEven if by some chance we could be absolutely certain OPs brother did not 'contaminate' it, some people just outright find it gross. I myself, though I might hide it away in a drawer instead of throwing it out immediately, in the same situation would probably gag at the thought of using it again. The bare thought can be a lot for some, if not most, people.", "Do you know that when dudes masturbate they use their hands? He didn’t stick his penis in the bottle.", "NTA. You didn't need to throw the bottle away, but you won't be an AH because you paid for it.\n\nTell your brother to clean up after himself, it's something nobody wants to talk about with their sibling but yeah, he needs to know and be considerate.", "I mean… it’s not like he put the used lotion back in the bottle. But hey, if you wanna waste your money, you do you. NTA", "NTA\n\nInstead of throwing it away, you should have put some itching powder or something in it.", "NTA your money, your product, your choice", "NTA since you pay for your stuff", "NTA cuz it's your bottle . But it might not be justified depending on the form of the bottle. Can he stick his dick inside ? If not, you'd be safe.", "I wouldn’t say you’re an asshole just weird for throwing it away", "I'd say NTA. You're allowed to throw away whatever it is you bought. \n\nI do think you're being overly paranoid about it though. I mean, he may be that much of an AH himself, but the likelihood of it being contaminated is low to zero. \n\nIf it were me, I would have gift wrapped it for him and left a pointed note, something along the lines of \"here, I noticed how much you like this stuff. It's yours now. You owe (prorated amount) for the replacement.\" or something. That way he is aware that he isn't as sneaky as he thinks.", "NTA\n\nA bit weird but NTA if it is your lotion do with it as you please.", "I wouldn't say you're TA, but it's weird to waste what's likely not a cheap product. Your mom needs to talk to your brother and make sure he has his own lubricants and cleans up after himself.", "YTA\n\nHe used product that’s no longer there… you think he was humping the bottle or what?", "You…. Threw out a bottle of unused moisturizer because you think your younger brother jacked off in the shower with a sizable portion of it? \n\nYTA.\n\nNot saying he doesn’t do it but…. You’re wasting product that is untainted over suspicion and no actionable evidence.", "YTA. It’s not like he put his junk directly in the bottle. I mean at worst you could have just given it to your brother if you were that creeped out by it. Also, I’m sorry to tell you this, you might want to avoid any place other than your room if you’re getting this worked up. I guarantee there are bodily fluids literally everywhere in your house.", "I wouldn't worry about a pump stlr product.  No one lubes up after they whack (I think/assume).\n\nThis was 5 squirts before commencing action.  I'm not sure the contamination would have been worse than unwashed hands.\n\nNAH\n\nBut get some $1tree coco butter and set it on there.  He's not gonna stop wanking and you will still need your face for stuff.", "Good Lord you're 20. Grow up.", "Either ESH or YTA depending on whether your brother did use it for that or not, and unfortunately unless he owns up to it you'll never know for sure.  Either way, unless he somehow ejaculated INTO the bottle it's not like it was contaminated in any way.  Your mom is right, that is wasteful.  If you were that insistent on not using it you could have given it to your mom or brother and still gotten yourself a new one.", "NAH but you could have just left it there for him to use, gross as that is, and still bought your own to keep in your room.", "I'll say it. YTA for being wasteful. This is like refusing to shower because I know the last person in it had the shower water all over their balls and ass. Ick!  \n\nDude is, or will be using a whole lot more of your skin care products to beat off if he doesn't either buy his own or get given his own.\n\n\nTo the community, this post should be up voted. It's divisive, a bit layered, and not so serious. Good post OP. You're NTA for posting.", "You should tell your brother you're pregnant and you haven't even had sex. You just play with yourself a lot in the shower.\n\nHow could this have happened???", "YTA like a little bit only\n\ncouldn't you have just given it to your bro? It is wasteful.. I imagine it's a pump action bottle so it wasn't contaminated. You were squiked out over him using lotion but not by the dry semen in the shower you share?", "Good Lord you're 20. Grow up.", "Dude move out. You are 20. Grow up get a job and live on your own", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNot sure how much more expansion is needed after the title, but... Yeah. I got chewed out for this a few days ago and just wanna know if I was really TA here.\n\nI (20F) have a younger brother, (15M), who's an absolute pain in the ass to live with in many ways. One of his issues is he completely lacks empathy and will often do things without caring about how others may take it.\n\nOne night, I noticed my bottle of face moisturizer that I keep in the bathroom was facing backwards and in the wrong spot, and had a dent in the bottle like a lot had been squeezed out. Sure enough a lot more was missing than usual, like 1/4 of the product.\n\nThe only two people who use this bathroom are myself, my brother and my mum. I asked my mum if she borrowed some and she said she didn't, and I believe her. She's not a liar and would just tell me if she had.\n\nIt was pretty obvious to me at this point that my brother had used it. I didn't know for what, and thought maybe he just had some dry skin or whatever, but then I realised he might have used it as lotion to jack off in the shower. I know he does this because he's constantly leaving the dried ejaculate on the shower screen. I've never brought it up because eww, but I'm 20, I know what that shit is. And at waist height as well. I think he tries to wash it off but is too lazy to check if he gets all of it. Sure enough, I noticed there was a suspicious streak in the shower that hadn't been there the night before.\n\nI felt super squicky about using that stuff on my face being 90% sure where some of it had gone. I also don't know if he's ever used some before. I ended up throwing the rest away and have bought myself another tub from a different brand that I'm now keeping in my room. My mum found out I threw the bottle away and got mad at me for wasting it. I tried to discreetly explain but she called my actions \"ridiculous\" and said I was just making assumptions. She's still a little salty if I'm honest, even though I paid for the products myself. I don't normally like to waste things but I was never using that stuff again if I'm being honest.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Seems likely he just pumped some in his hand before the “shower” so it was probably fine. Still, as others have said, you bought it, do what you want with it. Gift wrap the old one and give it to your brother for Christmas. Edit because forgot to say NTA", "I’m gonna say NTA although you do sound a little immature. Personally I’d be FAR more bothered by the “residue” he leaves then if he uses your moisturizer", "Ad a 14 yr old who's done it before youre not ta here if anyone is it's your little bro for sure your actions weren't ridiculous or anything you should talk to him about the mess he leaves tho bc eww", "I mean if its yours you can do what you want so NTA for that. I do still think thats wasteful and you could just talk to your brother about not using it. Dont even need to mention what you think he is using it for, just that its yours and to not touch it.", "NTA but I mean it's not like he came in you're face moisturizer", "NTA. This is both gross and hilarious. Definitely get yourself some new face lotion, if for no other reason than your own peace of mind. 15 year old boys are going to do 15 year old boy things. If I were in your shoes, I’d make him a little ‘care’ package. Put in a pump bottle of sensitive skin lotion, a box of Kleenex, a bottle of shower cleaning spray, and a cheap squeegee. No note, don’t say anything, just leave it on his bed.", "NTA. Your lotion, your rules. Dunno why your mom is chewing you out for it. Kinda like how the brother is not even part of the confrontation. Lol.", "NTA, he might've tried to \"replace\" some of what he used...", "no it was tainted", "NTA but leave it on his pillow with a bow on it", "Lol you can waste your money however you want to. You’re 20. How about you move out", "NAH. \nDon't really see a conflict, other then you dragging your brother on the internet unless its about your mom saying to not be wastful?. \nDo you ever do you as an adult, do adult activities on your bed? (Please dont answer that, its not important) But Do you immediately wash the sheets, pillow cases, mattress? Cause you leave a lot of fluids directly absorbed in the the fabrics, and someone else might touch or lay on or in thoses things. (Much higher chance then his fluids getting back in to the bottle.)\n\nI guess be an adult and just say \"Hey bud I know you're at that age, but you need to clean up / clean the bathroom daily if your going to do activities, and please do not touch my belongings.\"", "BAHAHA\n\nWish I had some gold to give you for 'hand pump'!! Hilarious@", "I completely agree. If it's a squeeze-the-lotion-out kind of deal like it sounds, then it probably wasn't contaminated. Throwing it out is wasteful, but it's entirely up to you because you paid for it and a single bottle that was 3/4 or 1/2 full isn't a big deal in the grand scheme of how much industrial countries waste. Maybe giving the lotion to your mom or just giving it to your brother might've been a slightly better move, but you didn't do anything wrong. Definitely NTA.", "At least let him finish the bottle", "😵‍💫💀🤣💀", "Step one: Tell brother “please don’t use my products”\n\nStep two: add peppermint essential oil to lotion\n\nStep three: pop popcorn and wait", "How about not jerkin the gherkin in a shared area of the house? Suggest he takes a scented candle in there and makes a night of it, in front of mum.", "You could end up rubbing some fungus or bacteria onto your face, and your face skin is more delicate than the rest.", "depends on the bottleif its a pumps fine but a bottle squeezed out could very well have some that went back into the bottle if he squeezed to much out or went for more... Ick... She is putting that on herFACE", "Lol food coloring would be amusing", "... who knows", "TF kind of fucked up shit is this? This isn't funny at all.", "My question would be if he washed the bottle off after using it.", "THIS is the stupidest thing I've read on the internet.", "Fungus or bacteria from what and how?", "This is one of the stupidest things I've read on the internet.", "No chance", "Dye! lol caught red handed", "I think I saw it on a cartoon.", "Some containers just have shitty dispenser holes and can totally backwash back into themselves somewhat.  Some chance", "Lol and isn’t Red number 40 bad for sperm or some urban legend??? 🤣🤣", "Seek help", "You're lyin but ok. It's a completely fucked up comment and the fact that you'd repeat it is disgusting.", "There is no chance", "Nope."]}