{"id": 13697, "submission_id": "128dxo4", "title": "AITA for scheduling my text messages and gift reminders?", "selftext": "So my daily life is kind of a mess. I manage a large number of people at my company, am constantly traveling and frequently get pulled in many directions throughout a given day. All in all, it's very easy for me to lose track of little details and forget something important because of all of this. I'm always looking for ways to use technology to mitigate these issues and be more organized.\n\nA couple years ago, our IT guy showed me how the new iphone has a scheduling system and you can set it to automatically do things like send a text at a specific time or when you arrive at a certain place. After learning how this works, I've come to use it fairly often.\n\nFor example, I have it set so when I leave the house in the morning, it texts my secretary that I'll be at the office in 10 minutes - I leave at varying times depending on if an executive needs to call me about something before I get to the office. This helps her schedule out the first couple hours of my morning when I set aside time to meet with account reps who need me to approve budgets, sign off on proposals, etc before getting to my own meetings and calls.\n\nI also started using it a lot in my personal life. My girlfriend really loves it when I text her in the morning and I'd sometimes get caught up in work and forget, so I started writing a personal text out to her in the evening and setting it to send out at some time the next morning, just a little note about how I hope she has a great day, wishing her good luck on a presentation she has, etc.\n\nMy mom is also a bit forgetful these days, so I'll frequently days in advance set up something like \"Hey mom, hope you're having a great day! Just wanted to make sure you remember it's \\[niece\\]'s birthday party tonight at 7, don't forget to bring cupcakes.\" to go out to her that afternoon around 4p.\n\nMore of the same with other things, like I'll have it text my secretary a few days before a client's birthday to ask her to send a gift, things like that. Overall I think it's been really helpful.\n\nLast week, I showed my brother how it all worked and suggested he could use it to help himself get more organized. He told my mom and girlfriend about how I use my phone to automate when I text them or send gifts, and now they're both really pissed at me. They both say they felt like I had been putting in so much effort to be thoughtful and caring despite how busy I am, but it's all just been a facade and I'm just using my phone to automate it all.\n\nI honestly don't think that's fair. Every message I sent them is something I wrote myself. Every reminder is there because I set it myself. I'm doing this because I felt bad that I had in the past missed these details, and I feel like I'm just using the phone to help me be more organized and thoughtful. But they clearly don't see it that way and are acting like I betrayed them or something.\n\nAITA?", "created_utc": 1680331741, "permalink": "/r/AmItheAsshole/comments/128dxo4/aita_for_scheduling_my_text_messages_and_gift/", "score": 170, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1-I've been using my iphone to automatically schedule text messages, reminders, gifts, etc in advance because I would sometimes forget these things when I got busy with work\n\n2-I might be the asshole because my friends, family and coworkers thought I was taking the time to remember all of these things now, but I was in fact scheduling much of it in advance so that it wouldn't be overlooked\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You should set your iPhone to automatically text your brother several times throughout the day reminding him to go fuck himself.\n\nNTA.", "NTA. \n\n>They both say they felt like I had been putting in so much effort to be thoughtful and caring despite how busy I am,\n\nThat's just what you have been doing.\n\n>I showed my brother how it all worked and suggested he could use it to help himself get more organized. He told my mom and girlfriend\n\nI'm assuming you won't try to help him again.", "From what I just read, anyone who thinks you're the asshole for this is an asshole who is clearly not the brightest crayon in the box.", "NTA. Your mom and gf are obviously important to you, so you use the tools at your disposal to convey your love for them.\n\nHave they never written someone birthday or anniversary on a calendar or on a day planner?", "NTA. After reading this, I’m considering doing it myself! You’re still putting in the effort when you remember to message them, but just at a more convenient time for everyone. \n\nYou know that you’ll likely forget to message at the appropriate time, so you found a way to still show you care even if you’re busy.", "NTA\n\nWhile I’m sure it does break the image that your mother and girlfriend had of you, all the messages were personalized. It’s not like it was an automated message, such as “Good morning, [girlfriend’s name]. I love you. Have a good day.”  or something mundane like that. From your description, it was a thought out response written the prior night regarding the following days special activities sent with an automated sending system because you live a busy life. I don’t see the harm in that!", "Your brother is the ass hole here. I bet *he* doesn’t text your mother to remind her to bring the cupcakes. I bet *he* doesn’t  text his GF a good morning. It sounds like there is some jealousy and sour grapes here.\n\nAnd so *what* if you have set your phone to remind you to do all these thoughtful things? *You* set your phone, and you *do* the thoughtful things!\n\nI won’t tell you to *stop* doing the thoughtful things. But maybe your mama can just “forget the cupcakes”,  *or* remember them… without your promoting, sometimes. It’s up to her. \n\nAnd your GF?  Well, I hope she is pretty . NTA", "NTA!\nYour making time and trying to be there for your loved ones in the best way you can. They don’t understand how busy your are and how caught up your work gets and this is how you can circumvent it. They make as if your having a robot communicate for you. \n\nI do want to caution though, do not get too caught up in pre-scheduling to the point where you don’t “think” about them at all. You could easily get so used to this program you got going that you lose ability to consider them throughout your day.I think this is what your mom & gf fear/are mad about- that your are totally automating. Sure set some texts for important reminders, bigger events happening that week for them. But also keep in the habit of just sending a random text with no automation. Balance both. \n\nLastly, F your bro for telling them, what an absolute idiot d!ckhead. Definitely program F you bro reminders for him several times a day for several months.", "NTA like you say it's your words and you've put thought into things, just because you've set them on a timer should make no difference. I'm lucky if my husband even replies to a text and that applies to his family and friends as well. I wouldn't care if he sent me a lovely text on a timer because the thought is still there and at least he did it for once lol.", "How's this different from eg buying a gift months early, wrapping it and keeping it hidden until the time is right? \n\nYou literally want to do things that make them feel good and treasured without messing up because you get pulled in a lot of different directions so you found a solution. You write the messages yourself, you just send them at a different time. The reaction is childish. NTA", "NTA. I use scheduled messages all the time because it helps me manage my attention deficit. It has helped me be a much better friend, son, and person. If people are giving you crap for finding a way to help you be a good partner, then they are the assholes. It is no different than say setting an alarm for yourself to remind yourself to call someone, or go to an appointment, or anything else!", "NTA. You’re still writing the texts and sending the gifts etc. You’re just setting reminders essentially. Now if you just had copy and paste texts automatically sent to your gf without thought, then YTA.", "YTA. I really feel for your mom and girlfriend. I would be so pissed too. Finding out what seemed to be thoughtful texts are actually automated texts is really emotionally hurtful. Ouch :( </3", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my daily life is kind of a mess. I manage a large number of people at my company, am constantly traveling and frequently get pulled in many directions throughout a given day. All in all, it's very easy for me to lose track of little details and forget something important because of all of this. I'm always looking for ways to use technology to mitigate these issues and be more organized.\n\nA couple years ago, our IT guy showed me how the new iphone has a scheduling system and you can set it to automatically do things like send a text at a specific time or when you arrive at a certain place. After learning how this works, I've come to use it fairly often.\n\nFor example, I have it set so when I leave the house in the morning, it texts my secretary that I'll be at the office in 10 minutes - I leave at varying times depending on if an executive needs to call me about something before I get to the office. This helps her schedule out the first couple hours of my morning when I set aside time to meet with account reps who need me to approve budgets, sign off on proposals, etc before getting to my own meetings and calls.\n\nI also started using it a lot in my personal life. My girlfriend really loves it when I text her in the morning and I'd sometimes get caught up in work and forget, so I started writing a personal text out to her in the evening and setting it to send out at some time the next morning, just a little note about how I hope she has a great day, wishing her good luck on a presentation she has, etc.\n\nMy mom is also a bit forgetful these days, so I'll frequently days in advance set up something like \"Hey mom, hope you're having a great day! Just wanted to make sure you remember it's \\[niece\\]'s birthday party tonight at 7, don't forget to bring cupcakes.\" to go out to her that afternoon around 4p.\n\nMore of the same with other things, like I'll have it text my secretary a few days before a client's birthday to ask her to send a gift, things like that. Overall I think it's been really helpful.\n\nLast week, I showed my brother how it all worked and suggested he could use it to help himself get more organized. He told my mom and girlfriend about how I use my phone to automate when I text them or send gifts, and now they're both really pissed at me. They both say they felt like I had been putting in so much effort to be thoughtful and caring despite how busy I am, but it's all just been a facade and I'm just using my phone to automate it all.\n\nI honestly don't think that's fair. Every message I sent them is something I wrote myself. Every reminder is there because I set it myself. I'm doing this because I felt bad that I had in the past missed these details, and I feel like I'm just using the phone to help me be more organized and thoughtful. But they clearly don't see it that way and are acting like I betrayed them or something.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You're doing this because you've missed the details in the past. It's important for you to not forget anymore and you use your phone to do so. It's all personally written, not generated by your phone or looked up on the internet, so no NTA. It's actually smart and it's better than letting people down time after time because you're so busy.", "Easy NTA, you \\*are\\* making an effort, and both your mom and girlfriend are being absurd.", "NTA.\n\nEven though the messages sent are automated, you’re still thoughtful enough to write them and plan out when you send them.\n\nI think that’s really sweet actually. It’s like if you plan a birthday gift for someone and it arrives a day early, no one will complain that they didn’t get it on that exact day. \n\nNot sure what you’ll say to mom and gf but you’re NTA in my book.", "NTA.  For me, I'd appreciate the fact that you found a way to ensure you were being attentive.  I don't get the anger.", "Uh, is it really any different than you just texting them normally? If you had set a reminder for yourself to manually text them at that time, I guarantee they'd feel differently. If I want my girlfriend to drive safe on her way to work, why shouldn't I schedule a text for an hour before she starts? Better than thinking \"hey, I should text X at Y time\" and then forgetting about it. NTA", "NTA, but I unfortunately do see why your mom and girlfriend might have an adverse reaction at first. On the surface, it might sound to them like you are just pre-scheduling a whole backlog of messages to have sent out at random times so that you don’t have to think about anything at all, but it doesn’t sound like that’s what you’re doing. If anything, it sounds like you are trying to be really thoughtful. I wonder if they might come around if you try to explain your system to them in a better way.", "NTA. The automation *is* the effort to be thoughtful and caring. That's all that needs to be said.", "I have a paper diary so I can keep on top of things and I write notes there for birthdays, exams coming up, anniversaries of the date people lost a loved one (that sounds so morbid!) so that I remember to check in with people on days they really need it. You’re just doing the high tech version and no-one has ever been upset that I wrote it down! NTA and I assume your brother has given them a slanted version (say that the Chatbot or something types the messages?). When they calm down, show them how much work goes into this - you have to think ahead enough to type out individual personalised messages and also set them up to go at the right time", "I think what you did is great. I’m going to utilize this option. And you did put in the effort, they’re your words. Your brother is the only asshole here…maybe a little bit your mom and your girlfriend as they don’t seem to appreciate your efforts. It’s  actually a thoughtful gesture on your part.", "NTA", "NTA", "NTA - And actually really brilliant for my ADHD ass. Only problem is an old phone…\n\nYou ARE making an effort. You are writing the text ahead of time, when you think about them, so you won’t forget. \nThe words and the sentiments are all yours even if they were written some time before the texts are sent.", "NTA in fact I think quite the opposite. You put so much thought into making sure that they got recognized that you set it up to be an automatic part of your life. To me that's more thought than you just trying to remember to do it at random times. I wonder if they would be mad if they got flowers on a weekly basis because you set up automatic delivery and not because you just thought of them every week.", "You value the people in your life enough that you want them to feel cared about. \n\nI hate remembering that I need to respond to a text late at night because I don't know if they're asleep already, and I don't want to wake them. This is such a fantastic solution to forgetting it in the morning rush. They're still personalised. They're just scheduled to be received at a more ideal time. \n\nNTA", "Brilliant.", "Those people clearly will have a great career as dullest tool in the shed for sure", "Gasp! I have birthday reminders on my phone! Clearly I am heartless.", "But they are thoughtful, handwritten texts, they're just written a little while before OP sends them. Why would that be hurtful?", "NTA. please help me!!! What is this scheduling app? I NEEEEEED it in my life!!", "NTA\n\nI’m a busy person who has memory issues. The other day I set reminders to check in on my friend whose parent is in the hospital. Part of me felt bad that I might forget to check in on my friend during such a time, but it’s good to acknowledge where we need help. There are tools out there, so let’s use them.\n\nThey’re being ridiculous. Do they not mark things on calendars?", "This is great! Teach me please 🙏🏻", "NTA. You are putting in the effort!", "NTA, my partner and I do this all the time for eachother because we're both pretty scatterbrained and work very different hours. We both love it! All youre doing is having the messages sent at a different time, and you're still putting effort into your relationships", "NTA. Your brother is an asshole. I would not talk to him for awhile. Why did he tell them? What is wrong with him? Does he like stirring up? \n\nYour mother is an asshole. It makes literally no difference when you write reminder texts to her. I would stop doing that. She doesn't feel \"special\" enough than you don't need to do it. If she forgets things, that's now her problem. \n\nYour gf is a special asshole for knowing you have a very busy stressful job but needing you to send her a text every morning like she's a kid that needs a note in her lunchbox. I'm sure it's because she was telling herself I'm so important to him he remembers me even though he's so busy while ignoring that you are doing a job. This is self centered to feel she needs to be your focus when you have other things to do. \n\nDon't bend over backwards to do things for people who then get angry you don't do it the exact way they want. If your gf and your mom feel like you should be thinking about them all day, they need to deal with their own issues.", "NTA\n\nThis is honestly supercute and loving and I do not get why your relatives are mad at you for *being caring towards them*", "Yeah, they don't see the fact that you care enough and are doing this from the heart and putting actual effort into the messages, they only see that you're not spontaneously thinking \"oh, my love, my mother, I must contact her forthwith\" while you're swamped with work.\n\nNTA, but your brother is a raging d*ckhead.", "NTA - This is no different from ordering flowers to be delivered on a specific day. The thought is still there, you're just carrying out the action ahead of time.", "NTA this is brilliant and I need to learn how to do it", "Soft YTA.\n\nYou may have written the sweet notes etc., but to me it still doesn't come across as genuine. Reminders about birthdays etc., of course should be in a calendar - that's exactly what they are for. But a scheduled personal message isn't very personal. I text family and friends in the moment and I wish my child a good day at school in the moment because it tells them I'm thinking about them at that exact moment.\n\nYou're really THAT busy and THAT important that you can't wish your girlfriend a great day? And literally every single second of your work day is planned out so you have to tell your assistant when you leave the house? That's just sad. No one can or should keep up with that - it's not healthy.\n\nYour gift-giving doesn't sound very genuine either if someone else does it for you.", "NAH. You didn't realize your loved ones would feel this way about this but they're also entitled to have their own feelings about this and they aren't AHs for not liking that this is how you handle these gestures.", "You are putting in the time and effort, but not at the time they thought you were doing it. They need to get a grip. NTA", "NTA. You are being thoughtful. Maybe clarify with them what exactly is automated. They might be misunderstanding and thinking it's all AI generated or otherwise not your own words and thoughts.", "NTA, you are still putting that effort in just before you need to so you don't need to worry about forgetting when it needs to be done. God I need something like this in my life to help me keep in touch with my brother's and such.", "NTA\n\nSetting those messages IS making an effort. It is a wise time management skill.\n\nIf I don't schedule messages and reminders, things don't get done.", "NTA", "NTA it is thoughtful of you you are still putting the same time and effort just ensuring that it delivers when you want it to. i think this is so sweet and don’t understand how your family is upset. hopefully they get over it soon. also your brother is an AH", "Nta", "NTA. Tell everyone that since they believe you are an AH for the reminder system you use to let them know you care about them you will stop immediately. Stop sending them thoughtful text’s altogether. Put your brother on low contact. Who needs this bs?", "Wait, that sounds like an amazing life hack. I wouldn’t survive without birthday AND gift reminders. There are so many things to do in a day, I simply cannot remember every damn thing. Your bro is an AH and is probably jealous you’re so organised. Send him a daily reminder that he’s an absolute dick.\n\nNTA", "I fucking snorted.", "*throughout the night", "This is the way", "Absolutely brilliant 🤣", "OP's family doesn't understand what automate means.\n\nIf they were automated, they would be automatically generated by some script or AI and sent.\n\nHe schedules the messages to be sent.\n\nThis is like claiming ordering something from amazon to be delivered at a specific time is having the purchase be automated.", "Exactly.  I do something similar with my wife.  We live on the East Coast of the US and I travel to Las Vegas a few times a year.  She has no interest in Vegas so she doesn’t come with me.  \n\nWe like to talk every day when we’re apart but the time difference makes it harder.  So I always send her an email before I go to bed (and after she’s already asleep) for her to read when she gets up (because I’ll still be asleep then), wishing her a good morning and telling her what I have planned for that day and asking what her day is doing to be like. \n\nNow, it’s somewhat different from OP because the email isn’t scheduled ahead of time, though it is sent with the knowledge that it won’t be read until the next morning, and my wife knows that I’m doing this.  But it’s the same general idea. \n\nI could see OP’s wife maybe being a little thrown off once she realizes that the messages were not actually written when she thought they were written.  But that seems like a minor issue, and the overall effort from OP is thoughtful.", "I feel like when they respond to his texts, he would definitely be thinking about them throughout the day.", "Exactly! OP is putting a lot of effort into this but it’s just the night before when they have time.", "I think it’s a knee jerk reaction to go from thinking that he’s been having them on his mind all day to realizing it’s possible he wrote this two days ago and scheduled it to send at the perfect time. \n\nI’m sure they’ll come around, he’s not doing anything bad and it does keep them in communication or give them a boost. But it is slightly different to be like “oh OP took time out of his busy day to remember my presentation, how sweet” rather than realize “oh he checked ‘wish me luck’ off his to-do list last night and scheduled it for this morning”. The sentiment is still there! It’s just feels a little different when you find out.", "But you see how someone would be annoyed if you had scheduled your PA to deliver their birthday gift and your happy birthday wishes because you forgot on the actual day yes? There's something impersonal about automating these gestures and I can absolutely see people feeling that they're less meaningful as a result.", "I think y'alls emotional intelligence may be what's dull because I can absolutely see why everyone involved is irked by this even if I don't necessarily agree.", "Which is less meaningful than remembering and taking time to do it when you're actually dealing with other things. Like you folks realize half the meaning of these gestures is the fact that the other person took time when they had other stuff going on to think of you and act on that thought right? It's not just a todo list item that needs to be checked off however is most convenient for you.", "I think scheduling a birthday gift is fine. Lots of people would order flowers for a specific date, like valentines ahead of time, and schedule the delivery for a good time. Same with holiday gift boxes, etc.\n\nLike buying a gift ahead of time and sending it in the mail. If your delivery service can guarantee arrival on an exact meaningful date, that doesn't make your gift impersonal.", "I can see it but I don't agree with it blindly.", "No one agrees with you you know?", "Aw are you the brother? The \"spurned\" girlfriend 🙄\n\nGrow up.", "So you'd rather OP forgets/gets overwhelmed/gets too busy at work and just **doesn't** text or remind family members about stuff at all?\n\nGot it.\n\nHey everyone!! It's more emotionally intelligent to **NOT** text someone at all, than it is to use technology to *still write out personal and meaningful texts yourself* and have them be sent out when you need them to be sent out even if you happen to be caught up in work at that time!\n\nOP isn't using ChatGPT to write texts for them, friend. They're still writing all the texts and reminders themselves. They're using a scheduling system to send them out at the proper time. If that makes it horrible and impersonal and cruel, then no one is allowed to use alarms, timers, Google calendar, or Apple calendar reminders any more either, because *it's the same concept*.", "Also going to point out here that, while OP did not mention any neurodivergence/ADHD/etc., many people DO have ADHD or another form of neurodivergence where they cannot \"just remember\" small things like this. They're not cruel. They're not horrible. They're not heartless. They have a physical brain impediment that makes it so that it's hard to remember these kinds of small things. Telling them to \"just remember\" these kinds of things is impossible. Some people NEED calendars, reminders, alarms, etc. \n\nThe fact that OP is trying to find other ways to make sure they STILL make loving, caring gestures to their loved ones in the proper time/manner, knowing that they are forgetful/may get too busy otherwise, shows an incredible amount of love and care and concern for their loved ones.", "No it isn't. He remembers and he remembers *in advance* and writes handcrafted notes to his loved ones. He doesn't ask AI or his secretary to do it. He sets aside what little free time he has to put others above himself. Please grow up and gain some perspective.", "> Which is less meaningful than remembering and taking time to do it when you're actually dealing with other things\n\nSometimes I'll see something funny in the middle of the night and not want to send them a notification in case they accidentally didn't put their phone on DND for the night. It's still me taking the time to compose the message and send it to them to read at a more convenient time for them.", "No I'm saying set a reminder and then do the thing when you're reminded to instead of setting up all of your expressions of affection when it's most convenient for you. Like I'm sorry folks but the inconvenience of these gestures is half the reason they matter you don't get full credit for half assing things.", "I mean I'm one of these people and still recognize there's a tacit line in the sand between \"remind myself to do this thing\" and \"automate this thing to happen without me having to think about it at the appropriate time.\" It's an expression of sentiment not a bill payment.", "What is the difference between having to be reminded to send the texts at all versus setting the texts up to be sent ahead of time while it’s on your mind?  \nBecause the former can and would be twisted into “I can’t believe you need a reminder to text me!!!”"]}