{"id": 13746, "submission_id": "128w1y5", "title": "AITA for not letting my dad hold my daughter?", "selftext": "Alright, so I'm young I'm 19M and I have a daughter \"Deliah\" who's 1 year old. Yes, I had her young, as I and my gf messed up.  My gf didn't want to take care of Deliah, which is whatever and I cannot change that. So I'm basically a single dad. I love Deliah, she is my life. She means everything to me, and I'd give a life and take a life for my baby. That's how much I love her. She's my world.\n\nWhen i informed my mom & dad that i had a daughter and i introduced my baby girl to my parents. , my dad's first move was to run upstairs and barge in my room grab all my stuff and go to the door and throw it out on the ground, he then pointed outside and yelled, and snapped his finger \"GET OUT RIGHT NOW!\" my mom was crying telling my dad \"no let him stay let him stay, we finally have some good news, etc\" and my mom was happy about my daughter as the last few years in our family, was not good. So announcing a new family member on the way brought a smile to my mom.\n\nMy dad put all my belongings outside, while I held Deliah on my shoulder. I grabbed my stuff and left. I then walked to my local motel holding Deliah and we stayed there for a few days, till i figured out what i need to do and everything. It was rough. I didn't have enough money, and I had a daughter but I knew that i have to give my baby girl a good life regardless. I called my best friend \"Deandre\" who then gave my number to \"John\" and a lady named \"Janice\" who runs a daycare at her house which was super cheap so i could drop deliah off before work\n\nJohn owns a small warehouse. He offered me a job for $14/hr and he hooked me up with one of his connections to offer me a small studio apartment for cheap. So the baby was taken care of at daycare, and i got a job. I worked daily, and using the money i had after taking care of Deliah, the bills, etc. I started saving it up and whatever i saved i started a business. I started an e-commerce arbitrage-based business which took a lot of work and months. A lot of time, and money was lost but i eventually succeeded and my life changed completely. Moved into a new apartment, bought a car, got the best for my baby, and changed my lifestyle. Now i'm living good, i get to work from home. Take care of my daughter and life is amazing. \n\nI recently invited mom to my new home to see her granddaughter, and she was excited and came over instantly i open the door and it's my dad with mom. I ignore dad, and let my mom meet deliah and hold her. dad wanted to hold her and i said no. Don't touch my daughter. AITA?", "created_utc": 1680377189, "permalink": "/r/AmItheAsshole/comments/128w1y5/aita_for_not_letting_my_dad_hold_my_daughter/", "score": 78, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because he is my dad and he does have a right.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, dude you did everything you could for your baby, after he put you AND your daughter out on the streets, respectfully? fuck him, you got your life together when you had to. hes a dick, you dont owe him anything.", "Nta. Your dad treated you and his grandchild terribly, kicking you and the infant to the curb. And good for you, working and getting everything together.", "NTA.  He would have had to wait outside, too.  I'd no longer have a dad.", "NTA\n\n&#x200B;\n\ni wouldn't have let him in", "all that at 19? sus", "NTA. I don’t let my dad even see or speak to my kids for far less than that.", "NTA - your dad over reacted and it was possibly just a knee jerk reaction...but he's had a year to apologise and try make it right. \n\nIn your position, i would talk to him, explain how his actions affected you and tell him that a relationship (with you, with his granddaughter) may be possible, but there's a lot of ground to make up and it will take time. He can't just waltz back in as if nothing happened!!", "Definitely NTA! Your dad treated you and your daughter horribly for some years. INFO: Had he tried to apologize, express regret, make amends or anything during that time -- or during that surprise visit?\nEdit: your father has NO rights to your daughter or to you.", "Sorry pal a lot of things don't add up here. \n\nYou get thrown out, live in a motel, get daycare for cheap, a place to live for cheap, a good paying job, start a business, fail a little, loose a little, win even more (with what money?????)\n\nAnd all in just ONE year? \n\nNo way. \n\nGuy if you have a job paying 14 $ the hour and you have to pay the apartment, daycare, food, Healthcare (aka doctors), formula, diapers, clothes for the baby and you have then money left to waste for your start-up.... Thats even crazy. \n\nBut being 19 all on your own with a baby, having a full-time job AND you have the energy to invest time (you state it was lots of time) for your business.... I am beyond words. \nWhat is your secret????? You're basically Superman. \n\nNo way this is true. Not in 10 years. And definitely not possible in 1 year. Not if you did  not win in the lottery. Then maybe.\n\nI am a grown woman. \nWith a very good paying job. \nA spouse who is in that family thing with me. \nWe have two very different kids. \n\nNo way your story is true. Sorry not buying it.", "NTA but this sounds like such a made up, classic and super general/boring story so I downvoted it. You managed to start a business as a 19 year old single dad who was originally homeless and be able to afford a car and apartment (~million dollars in this economy) all within the span of 1-2 years as it’s implied your child is still a toddler.\n\nMy guy, childrenless middle aged couples both working full time can barely afford that.  \n\nAll with zero experience as a 19 year old. \nHow you even afforded rent + baby sitting for your kid + essentials AND sustained investments and losses that come with start up business on 14$/hour within ~year is beyond me and unless ur like 200 iq jeffy bezos (which by the sounds of having unprotected sex- guess not) this sounds like a karma farm..", "NTA surprised you let him in YOUR house", "NTA. He doesn't deserve to hold a child that he threw out the door. Congrats on getting your shit together & making a better life for both of you :)", "Confused - you say you had your daughter with you when your dad found out which implies you hid the pregnancy until after the birth. But then you say your mom was happy that she was “on the way”.  So which is it? They threw you out when you randomly came home with an infant or they threw you out when you came home and told them your girlfriend was pregnant? \n\nIf she was already born -  How did you bring a baby home without the carrier and supplies you’d need whichI assume your parents would have noticed being stored in the house?", "NTA surprised you let him in YOUR house", "NTA.  I know what your dad did was seriously f'ed up but this may be a situation where being the bigger person may be the way to go.  If it were me I'd give him a chance to make it up to you.  (This would be his last chance in my eyes.). I'm sure your relationship is severely damaged and I'm not saying to just forget what he did, but if you can reach a point where you can be cordial around each other it may be worth it.  It would make the relationship with your mother easier because he will be part of the equation since they are together.  It's up to you if you are willing to move on past what happened and I wouldn't fault you for whatever you choose.", "NTA", "NTA but people do end up with a change of heart. You could just have an adult conversation with him and then see if you actually want him around or not. Wouldn't hurt to hear his side.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAlright, so I'm young I'm 19M and I have a daughter \"Deliah\" who's 1 year old. Yes, I had her young, as I and my gf messed up.  My gf didn't want to take care of Deliah, which is whatever and I cannot change that. So I'm basically a single dad. I love Deliah, she is my life. She means everything to me, and I'd give a life and take a life for my baby. That's how much I love her. She's my world.\n\nWhen i informed my mom & dad that i had a daughter and i introduced my baby girl to my parents. , my dad's first move was to run upstairs and barge in my room grab all my stuff and go to the door and throw it out on the ground, he then pointed outside and yelled, and snapped his finger \"GET OUT RIGHT NOW!\" my mom was crying telling my dad \"no let him stay let him stay, we finally have some good news, etc\" and my mom was happy about my daughter as the last few years in our family, was not good. So announcing a new family member on the way brought a smile to my mom. \n\nMy dad put all my belongings outside, while I held Deliah on my shoulder. I grabbed my stuff and left. I then walked to my local motel holding Deliah and we stayed there for a few days, till i figured out what i need to do and everything. It was rough. I didn't have enough money, and I had a daughter but I knew that i have to give my baby girl a good life regardless. I called my best friend \"Deandre\" who then gave my number to \"John\" and a lady named \"Janice\" who runs a daycare at her house which was super cheap so i could drop deliah off before work\n\nJohn owns a small warehouse. He offered me a job for $14/hr and he hooked me up with one of his connections to offer me a small studio apartment for cheap. So the baby was taken care of at daycare, and i got a job. I worked daily, and using the money i had after taking care of Deliah, the bills, etc. I started saving it up and whatever i saved i started a business. I started an e-commerce arbitrage-based business which took a lot of work and months. A lot of time, and money was lost but i eventually succeeded and my life changed completely. Moved into a new apartment, bought a car, got the best for my baby, and changed my lifestyle. \n\nI recently invited mom to my new home to see her granddaughter, and she was excited and came over instantly i open the door and it's my dad with mom. I ignore dad, and let my mom meet deliah and hold her. dad wanted to hold her and i said no. Don't touch my daughter. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. He didn't mind forcing you and your daughter to be homeless before. So he doesn't get to play the loving grandparent now especially when it doesn't even sound like he's sorry for what he did.", "op=NTA\n\nyour father wasn't invited.  \n\nHe needs to apologize, make amends AND wait for your forgiveness.  \n\nI would not have allowed father in home at all.", "NTA. Your dad kicked you AND your daughter out into the cold when he found out you had a kid. He has yet to apologize for his reaction. He doesn't deserve to know your daughter. Tell him as much. Tell him he has to do some serious grovelling for you to even consider letting him see her.\n\nTell him next time he comes to visit you'll call the police for tresspassing. Tell him if he tries to stop your mom from visiting you'll call them for a wellness check.", "Please downvote his post it’s so bait.\n\nCopied and pasted but this sounds like such a made up, classic and super general/boring story so I downvoted it. You managed to start a business as a 19 year old single dad who was originally homeless and be able to afford a car and apartment (~million dollars in this economy) all within the span of 1-2 years as it’s implied your child is still a toddler.\n\nMy guy, childrenless middle aged couples both working full time can barely afford that.  \n\nAll with zero experience as a 19 year old. \nHow you even afforded rent + baby sitting for your kid + essentials AND sustained investments and losses that come with start up business on 14$/hour within ~year is beyond me and unless ur like 200 iq jeffy bezos (which by the sounds of having unprotected sex- guess not) this sounds like a karma farm.", "Good points. I'm starting to think you're right.  Especially since he can't keep baby's name straight.", "Number one, when i mentioned apartments. I didn't mention a luxury, expensive apartment. I meant an apartment if you want to know what type of apartment. It was $500/a month in a not-so-good area. So that explains it. \n\nNumber two, regarding diapers and baby supplies. It wasn't the best supplies and all. I'll agree with that, but i got them for either free or cheap. From food banks, etc. \n\nHolding a full-time job wasn't that hard ben. It really wasn't. When you have a kid, you'll make things work, somehow someway. When you are in that situation. When i'd wake up in the morning. I'd get deliah ready and walk her to the daycare and drop her off and go to the warehouse to work. Then when my shift was over, i'd walk to the daycare to grab deliah and go home. \n\nWhen i'd go home, i'd feed Deliah and put her to sleep and I'd open my laptop and work. I'd work 8 hours a day and their are 24hrs in a day. So yeah.", "Not to mention putting a baby on his shoulder, carrying all his stuff, and walking to a motel", "Yep, I would not have let him in.", "Thank You! I had to. Honestly having deliah in my life is a blessing. I believe she was the one who made me the person who i am today, without her. I probaly would've been broke, been a bum etc. And not amount to shit.\n\nShe made me into who i am, and it's all because of her. I'm blessed that god gave me an opportunity to become a father.", "And how old is the daughter once OP gets on his feet?  He struggled at his $14/hr job long enough to save up to start a business, navigate that startup into a profitable business and she's not walking around and talking yet?", "1) Didn't tell my parents I had a kid on the way, only told them after a couple of days when i brought deliah to my parent's house. Otherwise, when Delilah was first born, she was staying at her mom's place for a while. Then when the time felt right which was when my post comes in. Then I announced it and all.\n\n2) I didn't have any of her baby stuff my parents house to begin with, all of the baby stuff including carrier, etc was at deliah's mom's place.", "You have a point, honestly, i do want to forgive him and all. But it's like. You kicked me out at my worst point in my life?  I had a baby, and you had a grand daughter and you kicked her out too. \n\nThat kind of hurt me the most, it wasn't about me but my baby deliah. You didn't even want to say hi, or acknowledge her and ur first move was to kick your son out while he's holding his baby. Feels sad.", "Hahahahahaha.\n\nSorry guy you making a fool of yourself. \n\n14 an hour at 8 hours a day then you're working nearly a week only for your rent, which was 500 a week. Childcare a cheap one takes like 300 per week thats another 2,5 weeks payment gone. And then you've not bought ANYTHING for the kid yet. \n\nA doctors visit for lets say your daughter has a rash or ear infection what does that cost? Plus medication. But of course you have a health insurance that covers that all, right? So no extra spendings on that. Or wonderbaby never gets sick.... \n\nAnd then you forget THE most important thing. 8 hours you're working, get home which may take some time. Unless you don't live next your working spot and daycare is not next to your apartment and next to working spot you need to calculate some time for getting home and pick up kid from daycare. Then quickly feed kiddo. But with what? You forgot shopping. \n\nOK never mind you don't shop you go to food bank and they do home deliveries. Thats The new thing with them. So after feeding you directly put baby to sleep and yeah she's wonderbaby she sleeps right away. Never sick, never moody, no sleepless nights for you and her. \n\nThen when she's sound asleep and remains asleep miraculously for the rest of the night you open laptop and work. \n\nBut who does laundry, who does dishes, who cleans your place, who gets rid of the mess people generate when living their live? Get and organize new clothes? You need to get constantly new clothes in the first year for kids. Meaning you also need to sort out old clothes which are too small and put them away. Bottles you need to clean and desinfect them, like constantly. Who does that because you sit on your laptop. When do you do that all when you start working as soon as wonderbaby is asleep. And do you ever interact with that kid? Like play? Go for walks? To the park? See doctors? Visit friends (your or hers doesn't matter)? Do you know how much time all that eats? Especially if you do that all alone? \n\nAs I said I have a job. And someone staying home with the kids, my husband. I know what it means to hold a job and to have kids. I know what it means to live of off a budget and I an happy that that was BEFORE I had kids. \n\nThe worst hole in your story is that you talk about me me me me but never about your wonderbaby that you love more than everything. \n\nYou seem to have no idea what living with a baby is like because then you knew what I was talking of. It's not about holding a job. I've been holding my job for very many years now. Thats not so difficult if you're not an idiot. Finding that job that pays good and is at a stable company is difficult. Manage kids and job at once is difficult. Surviving the sleepless nights and still get up in the morning is difficult. Get all the chores done is difficult. \n\nYour telling stories.", "OP is telling stories. How did he become a millionaire such that he could afford a house AND car within a year while also paying rent, essentials, day care AND taking care of Deliah as a single dad. \n\nPlease downvote his post it’s so bait", "She's close to 2 years old now. And she can walk/talk.", "I get 100% where you're coming from.  I haven't had contact with my dad in close to ten years.  Not going into the reasons why but I wish it didn't have to be that way.  My parents aren't together so my relationship with my mom isn't affected but it makes things awkward with other people in my family at times.  I tried, and I think he did too, to remedy the situation but unfortunately we just couldn't make a relationship between us work.  I don't get all the people on Reddit that seem so caviler about cutting people out of your life and making it seem like an easy thing to do.  It sucks, even if sometimes it's the right thing to do.\n\nI really hope you two can somehow get past what happened and your daughter will know her grandpa.  That is one of the hardest things I had to deal with, when my kids asked why they didn't ever see their grandpa.", "Legit. I thought I was going crazy when I read his story and thought none of the maths made ANY sense.", "I prefer OP's made up story to this load of self drivel.", "I didn't read it as he bought the new apartment but moved into a better rental"]}