{"id": 1374, "submission_id": "ymbxj5", "title": "AITA For Refusing To Forgive My Sister And Not Inviting Her To My Wedding?", "selftext": "Throwaway Account\n\nI (30m) have a sister \"Julie\" (25f) and she is in line to inherit our great-grandmother's ring as the first born female through our mom's side. My girlfriend \"Laura\" (26f) saw the ring and thought it was gorgeous and said that one day she'd like to have a ring just like that. Now, I know what you're thinking if you've seen other Reddit posts but Laura isn't the type to actually expect me to give her that exact ring just something like it.\n\nI wanted to propose to Laura and because I knew that she wanted a ring just like that one I decided to pay to have a custom one made. I showed the jewelry maker pictures but they said that it would be better if they could actually see it in-person. I went to my mom (the current holder of the ring) explained the situation and even showed the invoice before asking if I could borrow it. She agreed and so I took the ring.\n\nThe jewelry maker held on to it for about 48 hours and when I was about to head back to my parent's place with the ring, I got a phone call that Laura was in an accident and at the hospital. I rushed over to the hospital with her family and was horrified to hear that she needed immediate surgery. I honestly couldn't really think of anything else other than my girlfriend and stayed with her mom and sister the entire time. I was so relieved when the doctor's said that she was going to be okay and agreed to drive Laura's sister back to the house and then come back.\n\nI dropped Laura's sister off and when back to my place to shower when I saw the police there waiting for me with my parents and Julie. Julie then ran over to me calling me a thief and demanded her ring. Apparently Julie found out that mom gave me the ring and assumed that I lied about just borrowing it. My parents tried to calm her down but when I wouldn't pick up (bad cell reception at the hospital/phone died) Laura called the police. I handed Julie the ring right then and there and told my family about Laura before walking into my apartment.\n\nI also saw that Julie had trashed me all over social media but almost everyone was apologetic when I and Laura's sister explained everything. Julie took down her posts but never apologized. I proposed to Laura once she had recovered, she said \"yes\" and we're preparing for the wedding. Laura asked my other sister \"Annie\" (21f) to be a bridesmaid and when Julie asked if she was going to be one Laura and I informed her that she wasn't invited. Julie is calling me bitter and that I had no reason to still be angry with her. My parents think I'm being too harsh by not at least inviting her but I'm still angry. AITA?\n\n&#x200B;\n\nETA: Because I keep seeing this in the comments or in the DMs\n\n1. Julie took down the post(s) the following day she got the ring back.\n2. Julie thinks that I made myself look guilty by not responding to the multiple calls and texts that I received before the called the police.\n3. I'm not sure what Julie said or did to convince the police to come with her but all I know is that she was trying to report a theft.\n4. My parents didn't arrive with Julie or the police, they showed up after and was arguing with her with I arrived.\n5. My parents were on my side about being upset with Julie but feels that since it was a year since the mistake/misunderstanding that it was time to let things go. \n6. Julie has read a lot of stories on Reddit about sibling stealing each others possessions and I think that it got to her when it came to the ring.\n7. My mom told Julie I borrowed the ring when Julie stopped by to borrow it for an event.  ", "created_utc": 1667599649, "permalink": "/r/AmItheAsshole/comments/ymbxj5/aita_for_refusing_to_forgive_my_sister_and_not/", "score": 19, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I may be TA because I do admit that I am holding a grudge\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  You have all the reasons to be bitter.  Maybe you guys will repair your relationship in the future, but your wedding isn’t the place for a trial run.", "NTA. Please don't invite that kind of negative energy/drama into your wedding (or your life too for that matter).", "NTA.  How on Earth did Julie call the police about your mother's ring?  It wasn't even her ring yet!  Realistically, you probably want to resolve this one day unless you want to litigate this for the next fifty years, and I'd invite her to the wedding, but I can see your response while the memory is fresh.", "NTA. Your sister is a greedy, self entitled individual. She hadn’t even been given the ring yet by your mother. I do question though why your mother bothered telling her when you’d just borrowed it.", "Nta, you went about everything the right way. You allowed your sister to keep the original and even went above and beyond to ask your mom to borrow the ring for the sole purpose to recreate something similar to it so it would be just right for Laura. Even showing the proper paperwork and more. But when tragedy strikes and you aren’t there to answer at that second because your SO is in emergency care, Julie hauls tail to your house with police and your parents (probably there to stop her). Julie went to far and even going as far as to slander you without probable cause. Plus at the end of the day you AND Laura didn’t want Julie at your wedding the big event BOTH you and Laura paid for. That you have every right to invite who ever you want and not invite who you don’t. Julie can throw her tantrum and let it be a harsh reality that she reaps what she sews.", "NTA I'd never speak to her again", "NTA - if she wants to fuck around then she is going to find out", "I don’t believe this happened. Cops tend to have other priorities.", "NTA. Your sister massively overreacted.", "NTA. If your mom is alive, then it’s still her ring and I don’t understand how your sister considered it her property anyway. Being in line to inherit it doesn’t mean shit. She called the cops on you over it. That’s a big deal. That had potential to really screw with your life, which I can only assume is what she wanted to happen or wanted you to be afraid would happen. She hasn’t even apologized. She’s not even sorry.\n\nI’d probably respond to family with something like “You know, I would understand you thinking I’m bitter if she’d tried the best she can to apologize, smooth things over, and make things right. That hasn’t happened though. So I’m not bitter. I’m just acknowledging reality. I get that engaging in denial by pretending everything is okay works well for you all, but I like reality. And reality is she treated us horribly and apparently thinks it was okay because she hasn’t apologized. And no, people who think it’s okay to treat me horribly are not invited to my wedding.”", "NTa\n\n\"I'm not angry or bitter, I just don't like you.\"", "NTA and I would go No Contact with that person. I got secondhand embarrassment from your sister's audacity", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway Account \n\nI (30m) have a sister \"Julie\" (25f) and she is in line to inherit our great-grandmother's ring as the first born female through our mom's side. My girlfriend \"Laura\" (26f) saw the ring and thought it was gorgeous and said that one day she'd like to have a ring just like that. Now, I know what you're thinking if you've seen other Reddit posts but Laura isn't the type to actually expect me to give her that exact ring just something like it. \n\nI wanted to propose to Laura and because I knew that she wanted a ring just like that one I decided to pay to have a custom one made. I showed the jewelry maker pictures but they said that it would be better if they could actually see it in-person. I went to my mom (the current holder of the ring) explained the situation and even showed the invoice before asking if I could borrow it. She agreed and so I took the ring. \n\nThe jewelry maker held on to it for about 48 hours and when I was about to head back to my parent's place with the ring, I got a phone call that Laura was in an accident and at the hospital. I rushed over to the hospital with her family and was horrified to hear that she needed immediate surgery. I honestly couldn't really think of anything else other than my girlfriend and stayed with her mom and sister the entire time. I was so relieved when the doctor's said that she was going to be okay and agreed to drive Laura's sister back to the house and then come back. \n\nI dropped Laura's sister off and when back to my place to shower when I saw the police there waiting for me with my parents and Julie. Julie then ran over to me calling me a thief and demanded her ring. Apparently Julie found out that mom gave me the ring and assumed that I lied about just borrowing it. My parents tried to calm her down but when I wouldn't pick up (bad cell reception at the hospital/phone died) Laura called the police. I handed Julie the ring right then and there and told my family about Laura before walking into my apartment. \n\nI also saw that Julie had trashed me all over social media but almost everyone was apologetic when I and Laura's sister explained everything. Julie took down her posts but never apologized. I proposed to Laura once she had recovered, she said \"yes\" and we're preparing for the wedding. Laura asked my other sister \"Annie\" (21f) to be a bridesmaid and when Julie asked if she was going to be one Laura and I informed her that she wasn't invited. Julie is calling me bitter and that I had no reason to still be angry with her. My parents think I'm being too harsh by not at least inviting her but I'm still angry. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYou did nothing wrong.\n\nJulie owes you a HUGE apology for calling you a thief, calling the cops on you, and smearing you all over the internet.\n\nYou can inform your parents that this is the condition for her getting invited.", "NTA\n\nEven if you give her a pass on the reaction to the ring being gone, the fact she’s never apologised isn’t okay. She should also post a version of said apology on whatever platform she originally blasted you on. \n\nShe’s told you what sort of person she thinks you are. I wouldn’t want her at my wedding either.\n\nDon’t invite her. Tell your parents not to raise it again unless they’re taking it up with her, not you.", "NTA. Why would anyone want someone like her at their wedding. Good for you for standing by Laura. Don’t invite Julie.", "Sorry who called the police? Either way I think you're NTA, that was a huge reaction for nothing, I'd rescind her invitation until she apologized but if seems like she doubled down and started showing true colours again. You two have a special day, glad Laura's okay.", "Wowza. NTA at all in my opinion. Shes the one who jumped to conclusions for absolutely no reason and never apologized for it. Even if she did, I wouldnt want her at my wedding. If she thinks so little of you, why would you want her there?", "NTA. Talk about over reaction. If she can't immediately get in touch with you, you'd think you'd give it at least a few days to see. Besides, it's not even her ring (yet), it's your moms.", "NTA\n\nIntroduce your parents and Julie to the four-part apology.\n\n1. I’m sorry that I…\n\n2. It was wrong because… \n\n3. In the future, I will…\n\n4. Will you forgive me?\n\nJulie also needs to post a retraction and public apology repeatedly on every social media platform she has.\n\nTell your parents that you have no way of knowing if Julie realizes that what she did was wrong as she has made no effort towards reparation. Because she thinks so little of you that she assumes you would steal from her, you can’t imagine why she would be interested in attending your wedding.", "NTA, you didn't steal from her and she never apologized for insulting you and trying to get you arrested (assuming since you said the police was there)", "Julie would be blocked!!!!!!", "NTA - Julie called the cops on you for taking something that technically wasn’t even hers yet? That’s preposterous. I’m surprised the cops showed up, must have been a slow night. \n\nI can’t blame you for not inviting her but I would still leave yourself open to repairing your relationship", "NTA. Your own sister thought you a thief, despite your parents trying to calm her down called the cops on you for not answering the phone the day of and then had the gall to post about her being the \"victim\" on SM. And instead of apologizing, she doesn't seem to see her shortcomings, both as a sister and a decent human being.\n\nCongratulations on the engagement, may your fiancée have a speedy recovery.", "INFO: Julie needs to apologize. Has no one (like your parents) suggested this to her? Might you forgive her if she did?", "I understand not wanting to invite your sister but why would you make a replica of your grandmothers now your sisters ring. I would be pissed for that if I was your sister. But she should definitely apologize for her wrong sound and accusing you of something you did not do.", "NTA she went nuclear on you and now she has to deal with the consequences.", "According to what I was told, Julie wanted to wear the ring for some fancy event and that's when our mom told her.", "Well, I'm not sure what Julie told the police. All I know is that they were there because of a reported theft but left as soon as I gave the ring back.", "I think it was because she's read a lot stories about brothers stealing family rings to propose to their girlfriends on Reddit.", "Honestly, even if she did do that, I still wouldn't want her at the wedding. Although, it would start the forgiving process for me.", "Julie did. I'm not sure what she told them exactly, but she did report the ring missing and was convincing enough to get the authorities to come.", "100% this. Also NTA", "Agree.  While I do think OP should work on getting to a place where he feels comfortable inviting his sister, I don’t think that should happen without a sincere apology from her.\n\nNTA - No apology - No invitation", "Yes but Julie thinks her taking down the post IS the apology since it was my fault for not answering my phone and looking guilty.", "Still not hers to call the cops about though. That’s insane. And I’m not sure why the cops even stuck around if your mom said “she’s complaining about a ring that belongs to ME that I allowed someone to borrow.”", "I'm sure \"Julie\" couldn't say she owned the ring since she doesn't, your \"mom\" does.", "This still makes no sense.  Your parents were there. Once they tell the cops that they owned the ring and gave you permission to borrow it, the cops would have left as there was no crime.", "Well she would be in the wrong on that.", "The cops left as soon as I gave the ring which was within 30 minutes of me arriving home and seeing them."]}