{"id": 13760, "submission_id": "128zgrh", "title": "AITA for not aggreeing on looking after strangers kid during concert?", "selftext": "I have to ask this because 1) I am still shaken and angry about this  2) To me the other persons were clearly the assholes 3) Judging by the reaction i got from some other persons at the end of the concert, i’m the asshole.\n\nI attended a sold-out mixed classical / movie music consert held by the local symphony orchestra. It was a late night concert which lasted several hours. Next to me, between me and the end of the row, sat a couple with four kids. The youngest one was probably 3-4-year old and the eldest was probably preschool or 1st grade aged. From the get-go the concert seemed to be way too much for the kids as they squirmed and complained (although very quietly, props for the parents). They also complained several times that the music was too loud or scary. The seats were constantly shaking as they rocked back and forth or climbed their parents. They also crawled back and forth the footspace of the fifty-ish seat row. Before the intermission the kids were so frustrated that the parents had to physically hold two of them to stop them from running away, but there still was an occasional limb blocking my view to the stage or nudging me as the kids managed to squirm themselves nearly upside down in their parent’s hold. I tried to gesture them once that i’m not okay with this, but they gave me a shrug.\n\nI thought about leaving during the intermission because i had missed most of the concert so far, but then selfisly hoped that the family would leave during the intermission, but no, they came back. During the second part two kids sat between the parents and parents held the smallest ones on their laps. After about ten minutes to the second part i noticed from the smell that the youngest one sitting on their fathers lap next to me needed their diaper to be changed. After a moment the parent begun reacting. The parents had their hands full with keeping the kids physically under control as they were still just as active as before. The father next to me could not hold the squirming kid still by themselves so he whispered to me if i could take the kid and hold him and they would change the diaper. I apologized and declined as i just wanted to concentrate on the music, but told them there is a child changing station just outside the hall. This pissed the father, but they managed to change the diaper without leaving their places.\n\nWhen the concert ended several (older) persons on the row behind and in front of me begun loudly berating me for several minutes for being an asshole and not helping with the diaper episode and the kids in general. Without this reaction i would not have even asked, but AITA for not holding some random persons half naked, poopy, squirming kid’s so that they can change the diaper during a concert?", "created_utc": 1680384508, "permalink": "/r/AmItheAsshole/comments/128zgrh/aita_for_not_aggreeing_on_looking_after_strangers/", "score": 404, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) i did not help stranger to change their child’s diaper during a concert. 2) because it is customary to help parents with their children as paremting is hard. I did not believe refusing to help during concert would be a big issue, but the other concert-goers got very angry at me for refusing to help change the diaper and they called me an asshole for this.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. The parents are for bringing kids to a classical performance. Did any of the folks complaining offer to help with the kids?", "NTA. Those parents were so out of line. If you must bring young children to these events, at least be prepared and don't expect other people to do your parenting for you. I think they were inconsiderate to the children and to the other concert goers just by bringing the kids in the first place.", "NTA. \n\nWho changes a baby in an audience?", "I wonder if the people behind thought you all came together. But no, NTA. Not your child, not your concern.", "NTA — it doesn’t take two people to change a nappy/diaper. One parent could’ve held the non-poopy kid while the other dealt with the poopy one. I would’ve refused too; it’s certainly not your responsibility to look after someone else’s child.", "NTA\n\nI never watch or handle a stranger's kid and you shouldn't be expected to, either.", "Nta. If the others wanted the child held so badly why didn't they volunteer to do it themselves", "Uh..no. I’m a child development specialist and I still wouldn’t watch a stranger’s child. No. No. Nope. NTA", "Definitely NTA", "NTA-you didn't go there to change diapers.", "NTA\n\nI would have been furious that they even brought kids that young, let alone 4 of them", "NTA - People who think it's OK to bring children to events like this are total assholes who clearly don't respect other people who spent good money on tickets to the symphony.", "NTA. Who does that? They should have left when it became clear the kids wouldn't settle down.", "Not your kid. Not your responsibility. Not obliged to help out. Nta", "NTA have things changed so drastically that it’s now appropriate to change a diaper in a theatre?", "I was wondering why this would be expected, then realized OP is a woman. Yeah NTA.", "NTA. My blood boiled reading this. I have stopped going to classical music concerts, opera and ballet unless I can get a private box. People have completely lost any semblance of manners and sanity. Having four small children at a classical concert and changing a diaper right there… I would have left five minutes in, it never gets better in my experience. I have seen all sorts of things but a poopy diaper tops it all.\n\nWhere I live some theaters have had to institute orderlies who go around with lasers which they point at people who are talking, using their phone (yes, they even take calls right there), unruly children… One thing I have noticed is that it is NEVER teenagers and young people causing a disturbance. I am ashamed of my own middle aged generation but old people are the absolute worst. One old woman gave an excuse that she was trying to whisper but she got carried away and started talking loudly - you are not supposed to be whispering either, you old bat. Ugh.", "NTA!", "NTA you would've been well within your rights to tell an usher to get them kicked out for changing a diaper ugh", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have to ask this because 1) I am still shaken and angry about this  2) To me the other persons were clearly the assholes 3) Judging by the reaction i got from some other persons at the end of the concert, i’m the asshole.\n\nI attended a sold-out mixed classical / movie music consert held by the local symphony orchestra. It was a late night concert which lasted several hours. Next to me, between me and the end of the row, sat a couple with four kids. The youngest one was probably 3-4-year old and the eldest was probably preschool or 1st grade aged. From the get-go the concert seemed to be way too much for the kids as they squirmed and complained (although very quietly, props for the parents). They also complained several times that the music was too loud or scary. The seats were constantly shaking as they rocked back and forth or climbed their parents. They also crawled back and forth the footspace of the fifty-ish seat row. Before the intermission the kids were so frustrated that the parents had to physically hold two of them to stop them from running away, but there still was an occasional limb blocking my view to the stage or nudging me as the kids managed to squirm themselves nearly upside down in their parent’s hold. I tried to gesture them once that i’m not okay with this, but they gave me a shrug.\n\nI thought about leaving during the intermission because i had missed most of the concert so far, but then selfisly hoped that the family would leave during the intermission, but no, they came back. During the second part two kids sat between the parents and parents held the smallest ones on their laps. After about ten minutes to the second part i noticed from the smell that the youngest one sitting on their fathers lap next to me needed their diaper to be changed. After a moment the parent begun reacting. The parents had their hands full with keeping the kids physically under control as they were still just as active as before. The father next to me could not hold the squirming kid still by themselves so he whispered to me if i could take the kid and hold him and they would change the diaper. I apologized and declined as i just wanted to concentrate on the music, but told them there is a child changing station just outside the hall. This pissed the father, but they managed to change the diaper without leaving their places.\n\nWhen the concert ended several (older) persons on the row behind and in front of me begun loudly berating me for several minutes for being an asshole and not helping with the diaper episode and the kids in general. Without this reaction i would not have even asked, but AITA for not holding some random persons half naked, poopy, squirming kid’s so that they can change the diaper during a concert?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nThe changed the diaper IN the seats?\n\nES but you.  I would have approached an attendant at intermission myself, kids crawling in between the seats is when I was beyond done with the whole mess of them.\n\nThis was a health violation.\n\nThe old people behind you were nosy.", "Oh lord NTA.\n\nWho the hell changes their kids shitty diaper in the middle of a concert hall? It’s beyond disgusting and rude to inflict that smell on people who are trying to mind their own business and watch an event.\n\nNot to mention, disgustingly unsanitary. If there’s a baby changing space available, there’s no excuse for not using it in that scenario, or at least not doing it right there in the damn row. \n\nAs for holding their kid… just no. It takes a village, but that village is supposed to be populated by people who actually want to be part of the village, not whichever random bystanders are closest and can be forced to join the village. And people tend to be more willing to be part of that village if you and your children are respectful and not infringing on their ability to enjoy an event.", "NTA, they are the parents, they brought the children to a concert that they probably should not have. Their monkeys, their circus, their problem.", "Oh hell no!! They changed a diaper during the concert sitting next to people?! I'm a parent and I find that offensive. You don't know them, so to ask you to help with their kid outside of a true emergency is not acceptable. NTA", "No, the people in front of me did not react in any way during the concert apart from flinching when the seats suddenly shook when the kids accidently bumped them. The people behind me did not at least offer to help verbally and if they tried to gesture something, i did not notice it. I was told that the least i could’ve done was to hand the kid to them or ask around for help and they would’ve gladly helped.", "That's a good point...they could have offered. Seems hypocritical.", "Agreed. They should not have brought the kids at all. The kids are way too young to get anything out of an experience like that.", "THANK YOU! I thought i was an idiot for thinking this. They have great lavatories here. At least the men’s room has stalls with caring tables for babies and bins for used diapers.", "This! That is incredibly inappropriate and, potentially, unsanitary.", "My thoughts exactly! Actually, it was more like \"EWWWWW!\"", "Ah, this could be it! Thank you!", "Thanks, this was my thought aswell. There was a restroom with nappy changing board (is that what it is called) just outside the hall (although the walk is rather long). The parent sitting at the edge of the row could’ve taken the kid there and security would have let them back in between pieces. This would have saved the rest of us from the reek of poop and commotion.", "I’m actually a guy, i just use the avatar Reddit randomized for without paying attention on how it looks. Sorry for the confusion!", ">I was told that the least i could’ve done was to hand the kid to them or ask around for help and they would’ve gladly helped.\n\nright, but it was totally impossible for THEM to just say to the parents \"hey i'll help\". their mouths must have been mysteriously, temporarily sewn shut. just sounds like an excuse for them to heap more blame upon you since they're big fat hypocrites and they know it", "So it wasn’t sexism at work. \n\nSure it would have been helpful but it’s not a social obligation to help strangers wrangle their children. \n\nSounds like not a very fun event for you.", ">When the concert ended several (older) persons on the row behind and in front of me begun loudly berating me for several minutes for being an asshole and not helping with the diaper episode and the kids in general.\n\nWtf. No. I'm not touching stranger's kids. People need to stop bringing children to places where they can not handle their kids. NTA. They changed a kid on the seat. What gross behavior. They should have been kicked out.", "NTA. I would have complained and requested a refund.", "You showed a lot of fortitude for staying. I honestly think I'd have left. No way on earth I'd help some total stranger change his kid's poopy diaper in the seats. There are valid reasons people are legally required to take care of bodily functions in the restroom and changing area. They should have been kicked out. I like kids, but the distraction and noise and then the coup de gras of the diaper right next to me would just be too much.\n\n'", "NTA", "NTA\n\nPerhaps the people behind thought you were part of the family? \n\nIf it was my child, No i'd be taking the little one to the change station.", "NTA, coming from a parent of 3 kids. I would never torture myself or others by trying to bring my kids to a classical music concert. These people are selfish. I can’t stand parents with the attitude that everyone needs to cater to them in public, and parents need to realize some things just are not kid appropriate!", "Forget them and don't give them a second thought. \nNTA", "NTA, I would have gotten up and reported then for changing a sh\\*t loaded diaper in the concert hall.  They most likely would be kicked out for that.", "NTA. I would have been livid if I were you!! First of all, if your kids can’t behave for an event like this, don’t take them. My 4yo could never sit through something like this, so we don’t take her (aside from the “family day” our local philharmonic does once a year). Second of all, that’s absolutely disgusting they wouldn’t take their toddler to a BATHROOM to change a diaper. Unsanitary and unbelievable.", "NTA NTA NTA, and did I mention NTA?  You were there for the concert, and had I been in that situation, I would have found a member of the venue’s staff and alerted them that the family was causing a ruckus that was affecting your ability to enjoy the concert.", "NTA. The parents on the other hand, definitely.", "NTA. Some people shouldn’t have kids. Two examples right here.", "NTA. This is revolting behaviour from the parents on so many levels, not least being changing a diaper in the middle of a performance. If you can’t stop your children from interfering with the enjoyment of others during a performance, you shouldn’t be there. You should especially not expect strangers to help with your children.", "NTA. I’m a mom of a 4 year old and another coming very very soon. There’s these wonderful things called babysitters and they should have hired 1 or 2 and left their children at home. That’s far too young to expect small kids to stay still and pay attention.\n\nI took my oldest to the movies starting at 3. Kids movies. Where people expect small children to blurt out random things at funny parts and the movie isn’t longer than 2 hours. Granted my kid is very quiet and well behaved besides playing musical chairs between her dad and me but we sit at the very back and would have left if it was too much for her. \n\nThose parents were wildly inappropriate and who tf asks a stranger to help change their child’s diaper?? Especially IN the audience. I’m a mom and I would have literally snapped at these people for their lack of manors and common sense.", "NTA.  These people are cretins.", "NTA. I would have made it maybe ten minutes before getting an usher to ask them to leave. It's fine for parents to try taking their kids to an event like this, but they need to recognize when their plan has failed.", "This is wildly inappropriate behavior on their part. I have 3 kids. I would never, ever ask a stranger in a concert I was interrupting to hold my child!! That’s so weird! \n\nFor future reference a lot of theaters have ushers who you can speak to if they are being very loud and disruptive.", "NTA. they're lucky it was you beside them, bc i would have 100% been TA. parents that can't control their kids in public places are one thing, but to then expect strangers to help them control them??? after ruining the entire show for you??? i can't even fathom that thought process. and the old people need to learn how to mind their business", "op=NTA\n\nAt the intermission, I would have found an usher or management AND requested either they be moved or you be moved.\n\nYou absolutely were not obligated to do ANYTHING to care for these strangers kids and if these OLD people in the rows behind/front of you thought YOU should have done something different, they had the OPPORTUNITY to offer to HELP.", "NTA - who brings a bunch of small children to a concert! There should have been attendants to talk to. I believe it’s part of their job to remove people and I suspect a poopy duper being changed in the seat would be a reason", "NTA", "NTA", "NTA OP the proper reply to jerks that start that crap is 'and why can't you help them then?'", "Oh it was old people mad at you, so NTA those guys get mad at any younger person who doesn't bend over backwards to help a family or whatever. I think they had a lot of nerve to ask you to hold the poopy kid while they changed him. Gross!\n\nI was once trapped in a car (not really, but it broke down and for some reason they didn't let us get out and stretch) with a friend of my mom's and her kids. They had to change the baby and while I heavily protested them leaning the baby on me, they did anyway and poop got on my favorite dress. (The end of that story is we got back at midnight, I was extremely fatigued and my whole body hurt in that restless muscle kinda way, I didn't even have an appetite after hours of no food, and then I was officially in full blown sickness 2 days later when I was picked up to go home.) I can now see why my mom said I couldn't go back after the next 3 visits, I was the oldest kid and unfortunately I was more of a pushover so I was resigned to just being upset they didn't listen to me.\n\nAnyway, yeah no, they could've walked out to change the baby at the table but they were selfish enough to bring 4 small children to concerto and were determined to stay there no matter what.", "Nta. Not your kid not your problem.", "NTA\n\nNot your kids. Not your monkeys. Not your circus..not your smelly responsibility.", "NTA.", "NTA the story doesn't matter they aren't yours.", "Nta but you should have gotten a member of staff to deal with the issue, they would have been told to control the kids or they would have to leave, not to mention changing a diaper in there instead of getting up to change it at the proper location...AND I bet after changing said poopy diaper dad didn't get up to  wash his hands either... Nasty", "NTA wtf who asks a stranger to watch their kid at a concert. That’s deranged.", "WTF?  \n\n\nAll of this is terrible on part of the parents - negligent parenting keeping the kids up late in a non- kid friendly environment, disrupting everyone else etc...  \n\n\nBut to CHANGE THE NAPPY IN THE MIDDLE OF THE CONCERT HALL? WTF? I would have gotten up and got an usher at that point. That's fucked  \n\n\nNTA", "People were bad before covid but it’s gotten unhinged in certain spaces since.", "NTA!!", "NTA. You were there for the concert not as auxiliary child care.", "NTA \n\nMy first guess is those people who berated you might have thought that you were with that family.  Because who in their right mind asks a complete stranger to hold their kid for a diaper change?", "NTA. The parents should not have brought children that were too young to appreciate the event, to it. They should have known that children that young would tired and would not be sufficiently entertained by the event to stay calm, and planned accordingly with a babysitter or not attended the event. As parents of 4, husband and I have had to make that decision many times. It is the parents' responsibility to entertain and care for their children and to make sure that their children do not interfere with the rest of the ticket holders' ability to enjoy the event. It is not the responsibility of the people around them to look after the children that have been interrupting the event that they paid to attend.", "They changed a f*cking poopy diaper right there? Are you kidding me. NTA and those people are savages. Let the people who complained to you hold the shit stained kid next time. My god. (Am a parent, am fully judging all those a$$holes.)", "Oh lordy NTA - I'm sorry but you don't take young kids to an event like this where you have to sit for long periods of time why didn't the snooty others offer to hold said child if they were so concerned I'd ask for a repeat performance as your enjoyability of the evening was destroyed", "NTA. I am a parent. I would never dream of asking a complete stranger to watch my child, even for a moment. That's just weird and inappropriate.", "Yeah, honestly. Some kids can handle sitting still for that long and some cannot. A lot of concert halls do kids’ concerts occasionally, mostly around holidays, where people going can expect the crowd to be a little louder and more fidgety. I’m assuming this was a regular ol’ concert.\n\nAnd uh. Who on earth wants to hold some random kid while their diaper gets changed IN PUBLIC?? WHAT?? The poop smell is going to float all over the place and the kid’s going to be fully naked in a concert hall. Which is fine when it needs to happen but man is that not the place for it, especially if there were good changing rooms right outside.\n\nThe kids were NOT enjoying that concert, I’ll tell you that much.", "NTA, but I think you should have complained to get these ridiculous entitled parents kicked out. Kids that small don’t give a shit about classical music and really can’t sit still for that long. That’s just not an appropriate place to bring their massive brood of kids.", "NTA. Not your kids, not your responsibility. You were just attending a concert. You said it was a late night concert that lasted several hours as well? The kids were likely tired and bored. Poor planning on the parents part.", "NTA. Are you female-presenting? There is often an implicit assumption that women will step in and help with parenting strangers’ kids while men get a pass to enjoy the show that they paid good money for. Older people are especially prone to this.", "NTA. It’s not your responsibility.", "Did these older do-gooders offer to take the writhing mass of child to help the parents? I'm betting 'no'.\n\nDon't criticise others for something you do not want to do yourself. In addition, the parents should have known the event would be too much for their young kids. Quite why they expected you to be happy at being dragged into their childcare when you only wanted to enjoy the concert is baffling.\n\nNTA at all", "NTA. You don't ask a stranger to do that! (Apart from not taking kids to a concert where they would be so bored.)\n So there are two possible scenarios why those people were angry at you. \n 1. As father ask you so freely they thought you were part of their company. And thus should have helped as you brought kids with you.\n 2. They were frustrated themselves. And hoped that with an extra person it would be quiet. Or they thought it distasteful to have a diaper changed in front of them and we're frustrated about that.\n\n The parents here are the real ah.", "NTA, the parents were the AHs for ruining the concert for you and possibly other people as well.", "NTA. They changed the diaper on the seat. Disgusting. That's what baby changing stations are for. \n\nIf the older persons were so damn concerned, why didn't they step up and mind the kids?\n\nBabysitters are a thing. Why would you willfully take kids to something that you know that they'll be bored/ restless/ scared at? Entitled asshole parents.", "\"I'd love to help, but my parole officer says I can't have any contact with children\"  They'll move right quick.", "NTA, not your job to be nanny for a stranger.", "The only non kid concert I’ve been to I don’t even remember. I was 10 and my drum teacher was touring with a famous band and invited my parents and me to come see him play. I think I feel asleep within 10 minutes. Both my mom and I have no idea how I feel asleep since not only was it very loud but we’re in incredibly uncomfortable metal seats. I still need to get my concrete cheery popped, hopefully this summer I will be able to.", "At some places the ushers won’t even do anything anymore. I was at a musical and the kids behind us were kicking our seats. Complained to the usher who then made a general announcement to the whole section about keeping our hands to ourselves so everyone can enjoy the show. So annoying. \n\nOP: NTA those parents and old people suck.", "Pretty crappy parenting choices and even if they weren’t concerned about ruining the show for others they should care about their kids. \n\nChanging a toddler right there in the seats…so gross", "NTA\n\nIn future the phrase “I didn’t see you offering to help, if I’m an AH then so are you”…can shit them up real fast. Or just walk off. No one can berate you if you’re not there to listen.", "NTA Why couldn't one of the parents just take the child to the bathroom where there is a changing station?", "NTA - wtf is wrong with those people bringing such small kids to a concert? Especially a classical concert. I could see bringing some teens to concert, but small children? A toddler? The hell?", "NTA. They should have been ushered out and blacklisted at the venue 3 times over.", "NTA. And how gross that he changed the diaper IN the concert hall! Ewww. They were way out of line and you were already considerate by not loudly berating them during intermission or reporting them to the concert staff. They should never have brought kids that young. If they can afford symphony tickets, they can afford a babysitter.", "NTA", "Definitely NTA", "NTA dude. And I feel kinda bad for you because you paid for a ticket to enjoy the show but you had to deal with interrupting kids and missed parts of it. On top of that, I cant imagine how gross it must have been when the dad in the seat next to you was dealing with smelly dirty diapers. Like who does that? Why not go to the washroom? I get it must be tough dealing with four very young kids but that does not entitle them to ruin a show for someone else.", "NTA\n\n&#x200B;\n\n\"When the concert ended several (older) persons on the row behind and in front of me begun loudly berating me for several minutes for being an asshole and not helping with the diaper episode and the kids in general.\" .. THOSE AHs could have helped themselves. So ignore them.", "NTA, why would you bring 4 very young children to something they will not sit still in or enjoy. Also, not your responsibility to hold someone else’s half naked child to help them change a diaper.", "Am I the only one who thinks it weird to the parents to change the kids nappy in the middle of a concert hall? To me that's just disrespectful to everyone else. I would never do that with my child.", "This! WHO THE FUCK DEALS WITH POOP IN A PUBLIC PLACE?????????????????? \n\nGod this made me so uncomfortable just reading 😭", "And the public place was likely very dark.", "Yes, they should have known the kids would not be able to sit still, especially this late when they are tired. So either don't bring them or be prepared to leave early when the kids can't sit still anymore."]}