{"id": 13793, "submission_id": "129aawk", "title": "AITA for sending my father a \"Father Application Fee\" invoice after he texted me Happy Birthday?", "selftext": "Let me start off by saying this happened a few years ago but my aunt recently found out and now I’m being called an asshole for it.\n\nFor some background, I (25F) was raised by my mother and have no real relationship with my biological father. The last time I saw my father in person was when I was either 15 or 16 and had visited him and his side of the family for a week in the summer. He had taken no part in raising me as he lived on other the other side of the country. He never visited. Never came to sports events and never called.\n\nThe first time I had seen him since I was probably 1/2 was when I was 11 the summer before going into middle school with my mom. When I had gotten there I had learned that had another little sister and 2 younger brothers (all about 5-7 years younger than me) who he was raising with my stepmom.\n\nAnd though it was nice meeting them and everyone on my father’s side of the family(Aunts, Uncles, Cousins, Grandad) I had never really created a connection with anyone and no one had tried to stay in contact with me. The only person who had tried to somewhat stay in contact with me was my father’s wife who would send me Happy Holiday and Happy Birthday texts every now and again. Though no sorts of texts would come from my Father who was given my cellphone number at the same time as my stepmom. My cellphone number has not changed since middle school to this day.\n\nBecause I did live on the other side of the country my mom did have my father on child support but it wouldn’t have even been enough to survive on. We used it for competition fees in gymnastics. My mom has never spoken bad about my father but after endless years of no contact and empty promises from him I didn’t want or feel the need to have a relationship with my him.\n\nSo to the actual AITA…My father texted me out of the blue on my 22nd birthday “Happy Birthday”. He had not sent me a text or called me since Christmas 2 years before that. He then asked me if I was doing well.\n\nI didn’t want to respond after seeing it but during that time I thought it would be funny to send him a request on his Zelle, Cashapp and Venmo accounts that I found using his number saying “Father Application Fee $2500”. Then I sent him a text saying, “please pay the application fee to acquire a response from daughter”. He sent me a flurry of texts telling me that I was disrespectful and we had gone back and forth before I decided to block him.\n\nRecently I was on the phone with my aunt (his sister) who I have begun connecting to have a relationship with. She had asked me when the last time I had spoken to my father. I relayed to story to her and instead of finding it funny she said that I had been an asshole.\n\nSo Reddit…AITA?\n\nEDIT: My mom and father were in a relationship and had broken up due to him cheating when I was around 2. He decided to leave and move back to his home town on the other side of the country. My mom never stopped me from having contact with my father or his side of the family. Aunts and Uncles and even my older sister would sometimes send messages every few years or so. My Step-mom was more in the picture than my father as she would try to keep me in contact with my brothers", "created_utc": 1680410686, "permalink": "/r/AmItheAsshole/comments/129aawk/aita_for_sending_my_father_a_father_application/", "score": 36, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I sent my father an invoice that said \"Father Application Fee\". I may be the asshole because all he had done was send me a Happy Birthday text and I could've just said thank you. He was upset after I sent it and it was a little mean.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. A father that cannot be present for his own child is not only not a father at all, but a shell of a man at best. You owe nothing to this man that hasn't done more than write a check to help cover the bills. I will say though that if your relationships with his side of the family are important to you, jt may be good to lay off after this blows over to not jeopardize those relationships.", "NTA and also lol. It’s such a large amount of money that it is clearly a joke and not actual extortion. He should be a better sport about it and show some self awareness.", "NTA. The edit kind of confirms that daddy dearest here started a new family with his new wife after cheating on OP’s mom, and it was just easier to ignore op. \n\nAlso I doubt mom stopped dad like op said. For one op has been an adult for a while now, which would give dad plenty of time to explain himself if mom was blocking him. But, probably more important is that he moved to the other side of the country when op was still really young. IDK what he was expecting from a literal child to keep in contact with him. \n\nIf that joke was enough to rile him up like that…you probably dodged a bullet. If I were in OP’s shoes I’m not sure if I’d care to keep in contact with dad here much either tbh. \n\nYou cannot shamelessly ignore someone with the exception of once in a blue moon for 22 years and expect them to welcome you with open arms.", "NTA. That’s actually hilarious. You were obviously joking. He’s a deadbeat. Kick him to the curb", "NTA that's a cheaper cost than he owes for 16 years worth of no child support + help with college", "You're my hero", "I see two very real scenarios in front of me here:\n\nIn one, he had nothing to do with you because your mother didn't allow him or his family contact with you- not only does it happen in some cases, but that's quite literally what happened to me (which does make me biased towards believing this scenario)\n\n&#x200B;\n\nThe other is that he's just a fully deadbeat dad who only started cleaning up his act for his 'new' family and reached out because of that. Absolutely possible, happens literally all the time. Happened to my half brother. Happened to half of my cousins. Etc.\n\nIn the first scenario, while it was hurtful, I'd say no one is at fault because you didn't know, and he was genuinely reaching out.\n\nIn the second, sure it was hurtful, but he has zero right to call himself your dad when he never stepped up to the plate.\n\n&#x200B;\n\nYour aunt is obviously inclined to think you're a jerk regardless, since she's essentially known him longer.\n\n&#x200B;\n\nRegardless of the situation, NTA- but the first scenario would definitely be a no assholes vote from me.\n\n&#x200B;\n\nIf you think the first scenario is possible and want to learn more, I'd recommend asking your father's family why they never reached out, or mentioning that you grew up feeling isolated from them. But it's your life, and you're also 100% okay if you never decide to explore those feelings or possibilities, either bc they're unlikely, or some other reason.\n\nTake care, and I hope your aunt can see where you were coming from and forgive you. Best of luck out there <3", "NTA. It was a joke and he got butt hurt over it. I think it took a lot of courage for him to reach out and I think he was expecting an appreciation text from you which you don’t owe him at all. The man was never there.", "NTA. The fact that he took it seriously means he knows he screwed up. Im just curious why he chose to reach out then instead of any other time? I assume to ask for something.", "ESH\n\nHe should have been present for you, but he wasn’t. Raising another family and forgetting you exist isn’t right. That’s a dick move. \n\nHowever, he’s nearly a stranger to you. Not knowing his sense of humor or how he would take it, you decided to use his moment of trying to connect with you as a prank to rub your resentment in his face for his absence. That’s a dick move too and kind of chicken, if you ask me. You didn’t have the 🥚🥚to tell him how his text made you feel, so you did something incredibly passive aggressive and I think you knew it was hurtful. \n\nThe non-dick move would have been for you to text him back and say, “While I appreciate that you’re reaching out, I have to admit that it sucks that you choose to do it so randomly. I don’t feel very important to you. I was even tempted to jokingly send you an application with a fee to get a response from me because it feels like you’re a stranger to me. If you want to talk about that, I’m open to it. But these random texts just serve to make me continue to feel like someone you only occasionally remember exists and that doesn’t feel very good.”", "ESH. Maybe he was trying to turn things around? I’m not excusing him for his past behavior but he needs to start somewhere. He reached out - it was a start. I’m betting he won’t try again.", "ESH He failed as a father but your vindictive message shows your character as well. Especially the asking for money part. You could have taken the high road or just ignored him, but I guess you chose a different route. You're saying it was a joke, what exactly is funny about it?", "Yes, YTA.  If you want to continue not having a relationship with him, that's certainly your right.  Telling your father, or anyone for that matter, that they have to pay for the privilege of interacting with you is assholery.", "YTA - I don't blame you though. There was no way for him to know it was sarcasm (assuming it was - if not, you are an even bigger AH). Just because someone is your blood relation does not mean that you are required to have a relationship with him/her. Question: When was the last time you texted your dad \"Happy Birthday\"? Do you ever acknowledge it?", "NTA…. Ish.   \nI think you need to find out WHY he hasn’t had contact with you… from your Aunt. Because she has his side of things… which could be wildly different from your mother’s. But also he might have painted a specific picture to her that isn’t truthful too.   \nFor him to contact you out of the blue on your birthday and then not have a serious conversation with you… isn’t great form. He should have texted and asked to chat. If the text was only “Happy Birthday” then I can see your annoyance for sure.", "YTA", "YTA.  It's unfortunate that people who are not compatible at all end up reproducing so frequently.  But the bottom line is that your mother chose to bring you into this world, knowing that you would have little or no contact with your father.  Even if there's nothing \"wrong\" with a person, that person can be a toxic influence in your own life.  If we could go back in time, we could tell your mom and dad both to keep their pants on.  But even so..sex happens.  Pregnancy happens.  Because he couldn't make it work with your mom, he did you a favor by disappearing.  Otherwise, you would have been raised by parents who hate each other, which would scar you (mentally) for life.\n\nIt takes great courage for him to reach out to you after all these years.  In return, you shit on him.  You don't have to love him.  But do you need to abuse him?  YTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLet me start off by saying this happened a few years ago but my aunt recently found out and now I’m being called an asshole for it. \n\nFor some background, I (25F) was raised by my mother and have no real relationship with my biological father. The last time I saw my father in person was when I was either 15 or 16 and had visited him and his side of the family for a week in the summer. He had taken no part in raising me as he lived on other the other side of the country. He never visited. Never came to sports events and never called. \n\nThe first time I had seen him since I was probably 1/2 was when I was 11 the summer before going into middle school with my mom. When I had gotten there I had learned that had another little sister and 2 younger brothers (all about 5-7 years younger than me) who he was raising with my stepmom. \n\nAnd though it was nice meeting them and everyone on my father’s side of the family(Aunts, Uncles, Cousins, Grandad) I had never really created a connection with anyone and no one had tried to stay in contact with me. The only person who had tried to somewhat stay in contact with me was my father’s wife who would send me Happy Holiday and Happy Birthday texts every now and again. Though no sorts of texts would come from my Father who was given my cellphone number at the same time as my stepmom. My cellphone number has not changed since middle school to this day. \n\nBecause I did live on the other side of the country my mom did have my father on child support but it wouldn’t have even been enough to survive on. We used it for competition fees in gymnastics. My mom has never spoken bad about my father but after endless years of no contact and empty promises from him I didn’t want or feel the need to have a relationship with my him. \n\nSo to the actual AITA…My father texted me out of the blue on my 22nd birthday “Happy Birthday”. He had not sent me a text or called me since Christmas 2 years before that. He then asked me if I was doing well. \n\nI didn’t want to respond after seeing it but during that time I thought it would be funny to send him a request on his Zelle, Cashapp and Venmo accounts that I found using his number saying “Father Application Fee $2500”. Then I sent him a text saying, “please pay the application fee to acquire a response from daughter”. He sent me a flurry of texts telling me that I was disrespectful and we had gone back and forth before I decided to block him. \n\nRecently I was on the phone with my aunt (his sister) who I have begun connecting to have a relationship with. She had asked me when the last time I had spoken to my father. I relayed to story to her and instead of finding it funny she said that I had been an asshole. \n\nSo Reddit…AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. This is so funny. I am guessing most people in the comments trying to say that it isn’t funny don’t have any experience dealing with deadbeat parents. Sometimes you have to joke about it as a coping mechanism. It’s really not that deep.", "NTA. Guy might as well be a stranger to you. He cheated on your mom and replaced you with a new family. He has the audacity to call you disrespectful when he's been an absent father for years and spent years out of contact with you. Hes a deadbeat loser. Good job blocking him your dad is trash and you took the trash out your life.", "NTA. I wish I thought of this. My behind went looking for mines. My life would be so much simplier if I hadn't.", "Just want to point out child support isn't supposed to fully cover you living off it. It is to help support you. As far as the text IMO you were unnecessary and it doesn't come off as a joke. I'd you don't want contact that's understandable but to create unnecessary drama is ridiculous.", "Thank you! It was a joke. Honestly didn't think he would take it seriously. No average person would actually do that.", "I put this in the edit cause I realize I probably should've put more info but it's definitely scenario number 2. My mom was super open whenever I wanted to talk about my father and even encouraged me whenever I wanted to talk to my father or his family. He was just a deadbeat though. Other than the 3 kids he has with my step mom. My other siblings by him also weren't raised by him and don't have a relationship because he didn't try.", "Why does she owe him niceness or a kind reply. How many dick moves he gets versus her one. Why cant she make a joke out of a messed up situation. \n\nI think your response is an example of toxic kindness. When they go low, you go high. That has proven to be the wrong strategy over and over again. Yet. People claim it is ideal. Ideal to people with sense and values who mess up. Not to people who have been trifling for 20 years.", "If he doesn’t know her well enough to know that she was requesting TWENTY FIVE HUNDRED dollars as a *joke* and cannot take that joke in stride, it further indicates that he’s never really been her father.", "Why on earth would OP wish a happy birthday to an absent parent who has only shown that they couldn’t give a shit about them?", "The text was only Happy Birthday and I didn't even have his new number in my phone cause he never calls or texts. I found out it was him through my stepmom because she had told me that he texted.", ">YTA.  It's unfortunate that people who are not compatible at all end up reproducing so frequently.  But the bottom line is that your mother chose to bring you into this world, knowing that you would have little or no contact with your father.  Even if there's nothing \"wrong\" with a person, that person can be a toxic influence in your own life.  If we could go back in time, we could tell your mom and dad both to keep their pants on.  But even so..sex happens.  Pregnancy happens.  Because he couldn't make it work with your mom, he did you a favor by disappearing.  Otherwise, you would have been raised by parents who hate each other, which would scar you (mentally) for life.  \n>  \n>It takes great courage for him to\n\nAbuse is definitely the wrong word to use. lol. My mother did not chose to bring me into this world with having no contact my father. They were still in a relationship after I was born. You obviously made an asshole assumption.", "Abuse is a very strong word. She threw some shade in a silly bit.", "Could also very much be a generational difference I guess. And yea it’s pathetic that he wasn’t even trying as hard as your step mom. You didn’t (and probably shouldn’t) share many details about the argument that followed, but the original act of jokingly requesting 2500 bucks is not some massive faux pas. Parents who are actually there throughout childhood hear worse things said with sincerity. 5-year olds will tell their moms they don’t want them as their mommy anymore. Teenagers do the same thing. You are 25 years old; it would be super weird for you to NOT be a bit jaded. He’s allowed to be upset about it, and clearly you struck a nerve but his guilt is not your responsibility and what you did was not mean-spirited.", "I need this to be not to be a joke. Im not average. 🤣 I need to implement this in my life so I can get rid of people.", "Okay, yea, no, f that guy. NTA, fully. He can kick rocks.", "Wow… that’s special.   \n\n\nCan I do a dance that’s the “ YNTA DANCE” lol. \n\nNothing says ‘special’ like a random two word happy birthday text from an unknown number.", "Doesn't matter.  These two people should not have been reproducing.  At some point, they realized that.  Both of them realized that.  The timeframe, whether it's conception or conception plus two years....does not make a difference.  HE still did you a favor by disappearing, if he could not get along with your mother.  If you are mad about growing up without a father, know that he alone did not make that decision, no matter how your mom might spin it.", "From her own perspective, sure.  But her aunt sees it differently.  And her bio-dad sees it differently.  And so do I.", "So you’re saying that OP’s father cheating on OP’s mom and then abandoning OP was a good thing? And also OP’s mom’s fault? How? Seems like you’re projecting quite a bit here…", ">So you’re saying that OP’s father cheating on OP’s mom and then abandoning OP was a good thing?\n\nIf a man is going to cheat, he's going to cheat.  Nobody could agree that is a good decision.  HOWEVER, seeing that he did cheat, the relationship was O-V-E-R.  At that point, only two ways forward.\n\n1)  The couple try to stay together but constantly fight.  Their children suffer permanent mental damage.\n\n2)  The couple break up and do not see each other anymore.  Not the ideal way to raise a child, 1000% better than option 1", "The relationship between OP’s mom and bio-dad was over. He was still OP’s bio-dad yet made no effort to have a relationship with her. Even his wife put in more effort. OP’s parents did not have to stay together in an unhappy marriage for bio-dad to have a relationship with OP."]}