{"id": 13792, "submission_id": "1295f68", "title": "WIBTA if I uninvited one friend on vacation and invited another instead?", "selftext": "About six months ago me and my husband were asked by another one of our couple friends if we wanted to take a vacation together. We said yes and started making plans. After hashing out all the dates I went and bought lodging, travel and attraction tickets for the four of us - with them saying they would pay me back in two weeks. So everything besides food is paid for. The total was around 4k. \n\nWell, the vacation is in two weeks and they haven't paid me back yet, despite my bringing it up numerous times. At this point, I'm pretty pissed. This is not the first time they haven't paid me back a significant sum (I know, my bad for trusting them again). \n\nSo, I'm thinking of telling them if they don't pay me back they can't come and I was going to invite my best friend instead. I think I'm pretty justified as they keep on not paying me back, but my husband things I'm over reacting. So, WIBTA?", "created_utc": 1680398200, "permalink": "/r/AmItheAsshole/comments/1295f68/wibta_if_i_uninvited_one_friend_on_vacation_and/", "score": 74, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I would be the asshole because I am uninviting someone from a vacation we've had planned for six months.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Tell them if you do not have the money in the next 72 hours you’re inviting your friend to come instead. You book this months ago they owe you $2000 and they are not paying. People who don’t pay don’t get to come on vacations.", "Tell your husband to grow a spine. NTA.", "NTA. If they have not paid towards anything or booked any of the reservations, then it's for you to decide. \n\nYou will probably be TA to the friend you are ditching, but at this point, they probably shouldn't be your travel buddies.", "NTA as long as you first tell them “either pay me today or I’m taking someone else instead” before you invite your best friend. That way they can’t argue “but we were going to pay you before the trip, we just didn’t get around to it yet! You didn’t tell us there was a deadline!”", "NTA.\n\nOf course. What is there even to argue about? Does your husband love wasting money?", "WNBTA, they’re using you. Make sure the final attempt to collect is documented and their names aren’t on the reservation at all.", "WNBTA\n\nThey haven’t paid, therefore they haven’t bought tickets.\n\nDo they normally pay you back eventually though or do they still owe you money?", "NTA. Don’t let them take advantage of you.", "NTA. I guess this is the last time you trust them to do the right thing and pay you back. Needless to say, you won’t be putting up a large sum of money for another couple ever again. There is absolutely no reason for you to do this! Everyone can book and purchase their own passage and lodging.", "NTA make it clear that if they don’t pay the trip is of and you will be going with out them asap. To be honest I think going with them now is not going to be good for any of you as the resentment is going to be there no matter what at this point. Good luck 🤞", "NTA and don't let them come on vacation if they don't pay. I assume the tickets, etc are in your name. No payment, no vacation.", "NTA. If they have not paid you, then invite else. So let them know, but give them a deadline and hold fast to it. Your other friend will need time to plan and take off. So I’d say “if you don’t pay me in 24 hours…” and honestly, I think that’s plenty of time, because they have had six months. Don’t take any excuses either “but we don’t have it yet or we will have it in a week”. NO. They had six months and if they don’t have the money yet then they shouldn’t be going on vacation.", "NTA-seems reasonable.", "NTA. Don’t even give them the opportunity or any notice. The trip is already gonna be awkward either way. Just replace them and day of ‘oh you never paid up so I assumed you weren’t coming anymore’\n\nA housesitter may be a good idea too", "NTA. Tell your husband to grow up.", "NTA - You need to get it up front next time Good Luck Just say hey was really hoping to have an amazing time with you guys so please pay the $$ by such and such date we have others that want to come in your place", "NTA. You don't even need to invite anyone else yet. Just threaten it and see what happens.", "NTA.  If they have not paid you before the trip do they just expect to go anyway?  I think they do, I think they intend to go and just promise to pay you back later ie. never.\n\nTell them you need the money in the next 24 hours or you will have to find someone else who would like to go at such short notice.", "NTA, number one rule of group travel.  Everyone pays up front before booking.", "Don't think, take action. Its been 6 months. Tell them that you need the money in 48 hours. If you don't get it they are off the trip. If your husband doesn't like it, tell him he can pay,  as you know these people have  form for not paying their debts.\nBTW, I get really cross with people who sit on their hands, do nothing to deal with a situation, and THEN tell those that do not to over-react. \n\nThis couple is very likely to shaft you, and let you pick up all the bill, and you should do nothing??!!\nTell your husband that if he's so blasé about £4K you will be expecting a very good Christmas gift this year, as he is clearly flush with cash!", "NTA. You paid for it, they promised to play you back, they didn't pay you back. I don't know why you made the post here.", "NTA", "ESH.  You said yourself they haven’t paid you back a significant sum before and that’s your bad.  Yeah they suck for not paying you the money as well.  You are justified in giving them 24 hours to pay you or you’ll invite someone else.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAbout six months ago me and my husband were asked by another one of our couple friends if we wanted to take a vacation together. We said yes and started making plans. After hashing out all the dates I went and bought lodging, travel and attraction tickets for the four of us - with them saying they would pay me back in two weeks. So everything besides food is paid for. The total was around 4k. \n\nWell, the vacation is in two weeks and they haven't paid me back yet, despite my bringing it up numerous times. At this point, I'm pretty pissed. This is not the first time they haven't paid me back a significant sum (I know, my bad for trusting them again). \n\nSo, I'm thinking of telling them if they don't pay me back they can't come and I was going to invite my best friend instead. I think I'm pretty justified as they keep on not paying me back, but my husband things I'm over reacting. So, WIBTA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "You are more generous then I am, I said 24 hours. Lol", "me and my husband were invited by our friends to spend the easter holiday at a lake 2 hours away of home. friday to monday. we accepted, and they made the resevation. as soon as they confirmed and paid, we transfered our part. its not a problem to pass a day, or 2 or 3 even, if you announce beforehand, but otherwise.... \nyou want to go, you have to pay, as soon as possible.", "This!  And it should serve as a reminder that you should never be so trusting with money.\n\nNTA", "I mean, NTA, but I think the stipulation is more than these folks deserve. Six months ago, *they* suggested vacationing together with OP and husband. OP does the legwork on the planning, booking and paying for the accommodations, and they agreed to pay it back in two weeks. That was the deadline. It’s now been six months, and that puts them 20+ weeks behind on that deadline already, and it’s been brought up multiple times in the interim. OP has some things to consider, but I don’t think  an extra deadline is required at this point.", "OP asked them numerous times to pay, so I feel like they should have gotten around to it by now. I booked flights for a vacation with my sisters 9 months in advanced and they both paid me working a week. On the trip I put the hotel, excursions and Uber on my card and when I got home, we split it three ways. They each paid me within a day.", "Sometimes your vacation fund is tied up in another bank account and it takes the full 5 days for it to process so you can pay your friend.  Sometimes you're an AH and never really have the money in the first place.", "This is even worse since THEY asked to go vacation together.", "5 days for bank transfer is not being an asshole, as money are going through and both know they might take this long . (for us is instant, we sent now, they received a few moments later) . \nand sometimes people take advantage just. because people are sometimes like that :( \nmy point is, when someone else includes you in the plans, and invites you, and do the reservations and all, just repay that friend asap.", "Absolutely right. And they have done this to her before she said."]}