{"id": 13802, "submission_id": "129f4al", "title": "AITA for planning to move to the other side of the country for university?", "selftext": "\nObligatory throw away acc bc my dad uses reddit \n\nThis whole situation is incredibly complicated but I'll try to keep it as short as possible. \n\nI (M17) am set to graduate highschool in April and because of it I've been applying to different unis. I applied to one that's on the other side of the country and absolutely fell in love with the place. \nOf all 5 courses I applied to, I only got into 2. \nOne is at my dream school and the other is one that's more local.\nThe local one isn't a bad school or anything, I just don't want to go there. \n\nThis is where the issue lies:\nIf I go to the one that's further away, I'll need to move there. And it's about 6 grand per year for the accommodations.\nMy parents (M39 and F40) keep trying to convince me it's a bad idea and too expensive.\nWe aren't rich or anything, but between loans and savings and my job, I can definitely make it work.\nMy parents and I have always had a strained relationship, both were neglectful and unsupportive when I came out as gay at 14. Being around each other is pretty miserable, and honestly I've been looking for an out for a while now. (I can shed more info on my home light if people need it, I just wanna try be as anonymous as possible)\n\nGoing across the country seems like the perfect opportunity to start my life fresh.\n\nSo reddit, AITA?\n\nTL:DR I (17m) plan on leaving my entire life behind for university against my parents wishes\n\nEdit to clarify : I'm paying for EVERYTHING myself, if my parents do pay I will be paying them back for it! \nI do understand that debt is hard to get rid of, but I'm from the UK where we don't start repaying until you make a certain amount of money! I qualify for about 7 grand in loans a year, so I won't actually be going into huge amounts of debt like some people do! \nThis school is one of the top schools 400 in the WORLD, and in the top 5 schools in the UK\nIt has one of the best art and design courses in the entire of the UK , which is the course I'm studying!", "created_utc": 1680424595, "permalink": "/r/AmItheAsshole/comments/129f4al/aita_for_planning_to_move_to_the_other_side_of/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) deciding to move across country 2)it's against my parents wishes\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You've got a great opportunity, grab it with both hands. You'll spend your life regretting it if you don't.", "Nta. Go, enjoy it and never look back", "NTA If you’re confident that you can manage financially (you really want to avoid having to go cap in hand to your parents if you’ve got it wrong) then go for it, cliche alert - life is short so go for it.    \nHowever, unless your parents are outright abusive (in which case screw ‘em) try not to burn all your bridges on the way out the door.", "First off, congratulations!! Second, NTA. Go. Have a great time. Learn lots. Be free!", "NTA\n\nAs long as you can do it financially  on your own, do it.", "Nta. I’m a transfer student who who changed schools to one farther away and it was one of the best decisions I’ve made. I needed to be away from home, even though my parents wanted me closer", "NTA\n\nIf you think you can manage it, then go. \n\nFor whatever reason, they don't want to let go, but that's not how life works.", "Assuming you’re taking on this extra financial burden, then NAH. If you’re saying “You guys can afford an extra 6 grand, don’t be cheapskates” then YTA. \n\nThis is about you, and you get to make the choice to push yourself into debt to attend the school of your dreams. You may regret that choice when the bill comes due. Or you may not. But this is the sort of thing that we try to let young adults choose for themselves, to give them some agency. \n\nThe issue is if your parents are taking on that extra burden. They get to set their piece of the budget.", "This question is more about judgement than being an asshole.  If you use your parents money they get a vote.  If you do it on your own, your vote is the only one that counts.  In reality,  where you go to school has little to do with life success.  At 17, you have little ability to judge.  Your parents are more likely smarter than you give them credit for.  And clearly you just want to be away from them.  V", "NTA. Being at home sucks for you. It'll be good for you to get away! Go, be free, my young gay friend!", "NTA, but fair warning as someone who got student loans - it doesn't seem like a big deal when you're getting them because many assume they'll get a great job and have it all sorted by the time they graduate, but once you're done with college and the reality sets in of how much you will have to pay back and that you'll be making payments for years and years, it's a lot more anxiety producing and affects your life for a long time after college. If I had the option and experience that I have now, I would have avoided student loans as much as was possible for me at the time. \n\nMy other thought was that maybe you could spend your first year or two at the local, less expensive, college to get your general courses completed and then transfer to your dream college for the remaining years? \n\nAnyway you slice it, you're NTA as you're the one taking on the risk and it is your life to live.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nObligatory throw away acc bc my dad uses reddit \n\nThis whole situation is incredibly complicated but I'll try to keep it as short as possible. \n\nI (M17) am set to graduate highschool in April and because of it I've been applying to different unis. I applied to one that's on the other side of the country and absolutely fell in love with the place. \nOf all 5 courses I applied to, I only got into 2. \nOne is at my dream school and the other is one that's more local.\nThe local one isn't a bad school or anything, I just don't want to go there. \n\nThis is where the issue lies:\nIf I go to the one that's further away, I'll need to move there. And it's about 6 grand per year for the accommodations.\nMy parents (M39 and F40) keep trying to convince me it's a bad idea and too expensive.\nWe aren't rich or anything, but between loans and savings and my job, I can definitely make it work.\nMy parents and I have always had a strained relationship, both were neglectful and unsupportive when I came out as gay at 14. Being around each other is pretty miserable, and honestly I've been looking for an out for a while now. (I can shed more info on my home light if people need it, I just wanna try be as anonymous as possible)\n\nGoing across the country seems like the perfect opportunity to start my life fresh.\n\nSo reddit, AITA?\n\nTL:DR I (17m) plan on leaving my entire life behind for university against my parents wishes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - A good parent prays for the day when their child breaks their heart to chase dreams and have adventures.", "NTA, if you are not pushing for them to give you the money, even if they cannot afford it. If you can make it work, do it. \n\nBut let me tell you something: don't go there just to get away from your family. Do it if it is the best school, the best solution for your future, and it is worth putting yourself under a lot of financial strain to obtain \"that degree\". \n\nYou can get out of the house even if you just go round the corner, that's not the issue. Think carefully. Physical distance is not the only solution to one's problems, it is usually just a patch-up.", "Your parents are right in that going to your dream school far away is the expensive option before you.\n\nBut its your money, so you get to decide what to do. \n\nNTA", "NTA. As long as you’re paying for the difference, you need to make decisions for what’s best for your future.", "Since you are paying it yourself and not asking your parents for financial support for it, NTA. Your money, your choice.", "NTA.\n\nyour future, your dreams, your money what pays for it.\n\nas long as you pay yourself for everything they get no say whatsoever. other than you being a minor, that is. but if they pay just one dime, they have a say. period.\n\nmy gloom-and-doom wants to warn you:\n\nmake sure to inform dream university that you choosing them is against your parents wishes so could you please put a password on your file so that they can't decline on your behalf?\n\nthe same with the (expected) loans / grants.\n\nanything send to you by snail mail gets into the mailbox your parents have access to - how easy it is to interfere with these letters, they 'arrived too late', parents 'forgot to give them to you, sorry', parents 'never saw a letter from university / loan office'.\n\ninform yourself if you can get a po box, if your parents are able to retrieve your mail without your consent as they are your legal guardians? if the answers are yes and no, get the box and redirect your snail mail.\n\nmake also sure that any money you already have is in an account your parents can't access.\n\ntalk to banks around you if they have some kind of minor account, i.e. accounts a minor can open without consent from its legal guardian.\n\nthen depending on the (banking) laws where you live, your parents have the legal right to withdraw any kind of money from any kind of your accounts because you are a minor. \n\nthus derailing your plans onto a path you do not wish to travel. \n\nfair warning: do NOT choose a bank where your parents have accounts, do NOT open the new account at your old bank. mistakes can happen and suddenly your parents are on your new account and the money gone.\n\noh, and transfer the money in cash or cashiers check (?). again, depending on the (banking) laws they can dispute any transaction since they are your guardians / you are the minor.\n\nbe prepared for scorched earth tactics - them 'robbing' your money to force you to attend their chosen university and you having to sue them to get the money back to fulfill your dream.\n\nhopefully you become legal before university starts, otherwise you could be royally screwed - and *not* in the good kind!\n\nworst case? your parents confiscate your money -> university starts without you because no money -> weeks / months later you become legal. all they have to do is giving you your money back at your 18th birthday and you can do nothing other than seething, cutting them out of your life and praying that dream university and loan / grant office are able to help you attend dream university the following year.\n\nthey ruined your plans and face no legal consequences. after all, they were your guardians and 'just looking out for you'.\n\nanother worst case: they take your money -> you become legal -> they do **not** give you your money back -> you have to sue them and are praying fervently that everything is resolved before university starts.\n\nare you prepared for this?\n\nthe idiom 'hope for the best but prepare for the worst' exists for a reason. \n\ngood luck to you, may your future be as bright and joyfull as you envision it.", "NTA\n\n&#x200B;\n\nMoving away sounds like a GOOD thing.", "NTA. Move away, start fresh it'll be hard but it would be worth it.", "Nta.  This is a normal thing to do", "NTA. I also have a negative relationship with my parents. I can totally understand wanting to move far, far away.", "If you're paying on your own and your job is stable, go for it. \n\nNta", "NTA. If this is a top school for your subject, it seems to me a good investment. Also, it seems like an excellent idea to get away from your parents, and distance often eases strained relationships a bit. I'd stick to your guns.", "NTA Thank your lucky stars you were born in the UK and leave!", "NTA, get out there! Just try to save up as much as you can before you go because loans don't go as far as you might think. Also if you have the option go into self-catered accommodation rather than catered,  it's cheaper to feed yourself and more flexible.", "NTA, but you might be unwise. The differences in career outcome between one university or another is rarely significant, but the cost is. Take a long look at your decision-making process and figure out how much is it the quality of the school and how much is the distance from your parents.\n\nFun fact: you are totally allowed to go to the cheaper, closer school and simply TELL your parents you've gone across the country. If you're an adult paying your own way, you owe them nothing.", "NTA\n\nGo build yourself a wonderful life away from your parents at your dream university!\n\nThe best is yet to come. \n And I hope all your dreams come true 👨‍🎓\n\nBest of luck! Xx", "NTA. Go to your dream school.", "NTA. Also it's funny that they think \"the other side of the country\" is a long way when you live in the UK, which is considered easy driving distance in most of the US lol.", "NTA. I love my kids and even if their dream school was the other side of the world, I’d be first one to tell them to jump at the opportunity.\n\nGo enjoy your life on your terms!", "Mentioned in another comment that I'm paying for all of this! If my parents do end up paying , we've agreed I'll be paying them back with my student loan! \nRn I need a £300 deposit , but I can get that no problem! From there I can set up installments each month to pay !", "I probably should have included in the post that I'm paying for all of this myself! I'm saving money right now, so between that , the job I'll have when I'm there, and student loans , I'll be completely financially independent! \nWe discussed the idea of them paying for the accommodations and then me paying them back when I get my loan each month, but chances are I'll just pay it myself", "I'm 100% opening a new bank account with another bank! I turn 18 in a couple months. They don't currently have access to my banks, but better safe than sorry! I'll be 18 3 weeks ish after I start my course, but until then, I just gotta pray that nothing goes wrong", "Yeah I probably should've specified that originally 💀the school is 80-ish miles/2 hours from my home town", "Then you’re morally in the clear. \n\nStudent debt can be a real burden. Look closely at it. But good luck, and know that you’re NTA", "If you are paying for it all yourself then it doesn't matter what your parents think.", "I don't think your parents get a vote.  BUT, I am guessing you will be paying out of state tuition, which is exorbitant. It almost never played off in the long run.  Sounds like you are using emotions instead off logic.  You don't want to live with parents. Fine.  Go to a state school and live by yourself.", ">They don't currently have access to my banks\n\nare you sure? like, really sure? or do the laws allow them to go to your bank, show their identification, your birth certificate and - since you are a minor - gain access nevertheless?\n\n\\*we are mom & dad, here are our id's, there is the birth certificate that shows account holder is our - still minor - child, we want to gain access since we fear child will do something stupid with this money  --  sure thing sir & ma'am, please sign on the dotted lines\\*\n\nwere they needed to open your account? did they open the account for you? then they *are* on your account. \n\nonly if you opened your account all by yourself they might not be on the account but as i wrote above - can they still gain access depending on the (banking) laws where you live?\n\ni reiterate: inform yourself about po boxes (can you get one? is your mail secure from your parents?), get one if both answers are yes, then open the minor account at another bank and use the po box as mailing address for your new account and all snail mail letters from university / loans office. put passwords everywhere into place so that they can't withdraw you against your will. \n\nmaybe your dream university has a financial advisor for you / financial department who can help you to secure your money for you? \n\nuniversities are used to getting grief from parents who are not  agreeing with their kids choice of future, they deal with these problems on a daily basis, they heard, saw, handled scenarios nobody would dream off untill it happened.\n\nso do not be shy, speak with your dream university, tell them about your predicament, maybe ask for help.\n\nthen in the end they may be an educational institution but they also want to make money. they want you to be able to pay them. \n\nand if your parents have your money, well, how will you pay them then? \n\nso it is / may be in their best interest to help you secure your future. \n\ni know i know, i am a doomsayer. i always expect things to go awry, sorry.", "I mentioned in an edit that I'm from the UK, so I'm actually not going to be paying any extra! Scottish education is free, so the only money I need is for housing!", "OP is in the UK. Parents aren't on their kids' accounts there."]}