{"id": 13888, "submission_id": "12agd81", "title": "AITA for refusing to make my dog sleep on the landing", "selftext": "I (31F) have a wonderful dog. I've had him since he was 6 months old and he has always slept on *his* bed in my bedroom. He has quite bad separation anxiety (he's a rescue) so he has always slept in my room. He doesn't sleep on my bed unless I'm sick and comes for a snuggle.\n\nI have been dating a wonderful guy (34M) for just over a year. Everything else is amazing. But.\n\nHe hates having the dog in the bedroom \"because he makes noise moving around/snores at times\"\n\nI have made my dog sleep on the landing several times (on his bed) at the request of my bf, but he (the dog) gets visibly anxious (he sits right behind the door and pants for hours) and it breaks my heart. This dog has gotten me through some extremely rough times and he means the world to me. Knowing he's out there stressed just makes me anxious and everyone but my bf has a bad night's sleep as a result.\n\nThe past few times bf has stayed over, I have tried leaving dog outside the room but ended up letting him in because a) it's my house/dogs house and b) I just can't leave him stressed all night and c) it isn't fair to have him in some nights but not others, the dog doesn't understand.\n\nHe isn't even that loud, usually lies on his bed and goes to sleep and doesn't move until morning. He will sometimes get up turn round and lay back down but the noise is minimal. I admit some nights he does snore, but I drown it out whereas bf is a lighter sleeper.\n\nThis has caused a few small arguments/us going to sleep not talking and I'm seriously wondering if this can even work long-term if we can't even agree on where the dog sleeps. What if it was a baby in a crib? Are they a nuisance too?\n\nI've decided I just won't put my dog and myself through this again night after night, so he will sleep on his bed in my room whether bf sleeps over or not.\n\nSo..AITA for refusing to make my dog sleep out on the landing because it inconveniences my bf?\n\nEDIT: for those confused by \"landing\" I mean the hallway outside of my bedroom door.\n\nEDIT 2: The dog does not sleep on *my* bed. He sleeps on a dog bed in the bedroom.", "created_utc": 1680518532, "permalink": "/r/AmItheAsshole/comments/12agd81/aita_for_refusing_to_make_my_dog_sleep_on_the/", "score": 509, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am refusing to make my dog sleep on the landing because he makes too much noise according to my bf. My bf argues that he doesn't sleep well as a result so I could be the AH by essentially putting my dogs wellbeing above my bfs\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA Puppy was there first and is your family.", "NTA let the bf sleep on the landing (idk what landing is tbh) or get him earplugs. This is easily resolvable so not sure why this is being made into a big deal.", "NTA. Your dog is family and he comes first. I can slightly understand if he doesn’t want the dog in the bed with you but if he’s in his own bed that’s his bed. He shouldn’t have to be moved (which causes anxiety to an already anxious dog) because he moves around a lot or snores. What if you start snoring? Will you have to move out of your bed too?", "NAH.\n\nThe dog was there first. The dog is family, that is your baby and you all have a routine. It is not unreasonable for you to be against changing that. \n\nHowever, your BF isn't an AH either as his life and routine do not include a dog like yours does, that's a big change/adjustment as well. \n\nAs ridiculous as it can be at times, there is something to be said for the whole \"cat people/ dog people\" argument.  Cat people need to be with cat people, dog people with dog people. Yeah you can like both and be alright with having both, but your partner needs to be in that boat too; and if you want no pets, date someone who wants no pets.\n\n Is your BF a dog lover? If so, maybe suggest alternatives to the noise, such as a fan? (white noise like that can prevent the dog from waking him). Talk to him, as a fellow dog lover I'm sure something can be arranged that is more fair. If he ISN'T a dog person, you have to decide if that's ok in your relationship. I know that sounds extreme but seriously, I'm not saying just dump him. What I AM saying is everyone makes sacrifices and compromises in relationships, and maybe this sacrifice/compromise is one too many to make; only you can know that, so be mindful and look at the big picture when deciding what to do.\n\n It can be hard managing pets and relationships sometimes lol BUUUT hey, we say pets are family, family can OBVIOUSLY be difficult on relationships so I guess this should be expected 🤣", "I’m going to say NAH.\n\nTotally understandable that you do not want to cause your dog undue anxiety and stress, and displace a well established routine. But it’s also understandable that your partner is unhappy about it if it is disturbing his sleep. \n\nSo I see the following options:\n- sleep separately, then you can keep the dog with you and he can sleep undisturbed (requires a second bedroom);\n- decide whether you’re willing to compromise on your dog’s quality of life and care for the partner. Your dog might adjust, but he also might not. Are you willing to try that? If you are, then you’re going to need to be disciplined (ie every night). But it’s also okay if you’re not willing to. It’s okay to be incompatible on this issue. But this is potentially going to be a dealbreaker, because this is about diametrically opposed needs (his sleep vs your dog’s anxiety).\n\nI have a cat I love very much and I don’t let her in the bedroom at night because I need undisturbed sleep; she’s always had that routine and she’s fine with it. But having seen the stress that a change in routine causes her, I would certainly think twice about a relationship if that’s what they needed me to do.", "Nope NTA at all. This might just not be the partner for you and that’s ok. Treasure your dog. Tell your boyfriend that you are sorry but the dog has to be in his bed in whatever room you are sleeping whether his house or yours. Tell him if this is a deal breaker than sorry.", "NAH. You both have quite reasonable positions that neither of you want to compromise on. You don't want your dog to be stressed, your boyfriend wants to get a decent night's sleep. Unless you can find a compromise that works, this may be a make or break issue. You might think your boyfriend's position is one that's dumb or comes from a lack of empathy, but he very clearly feels strongly about this, so it's worth sitting down and having a reasonable conversation about.\n\nAlso, because no one else has mentioned it, and I know it would be an issue for me, you might want to ask if boyfriend's actual problem is having the dog in the room while you're having sex. Because that will be much easier to solve.", "NTA - doggo is family.  now if doggo was sleeping on your bed, thats a problem.  but he's got his own bed.  if bf can't deal with that it's best you know about it now before you waste too much time on him.", "NAH. There is no easy answer here. Yes it’s your place, your pup was there first and you’re well within your rights to not want to switch up the routine. Your doggo is hugely important to you and that’s more than understandable. I absolutely love dogs and love having them around.\n\nI have also however been in the situation of your partner. I dated a guy whose dog would sleep in the same bedroom and, as a light sleeper, it drove me nuts. You also mention your dog is large: that can make a difference. My dogs have always slept in another room. Not that you’re wrong, at all, I just can hear everything and they can shuffle around, snore, pant etc….You mention your partner didn’t grow up with pets, so whilst the situation is hard for you to understand, that’s just his preference. \n\nYour preference for doggo in your room is more than ok, as is his for not wanting your pupper in the room you both sleep in. This is about current compatibility, and if either of you can adapt/compromise. I hope you can, and best of luck.", "NTA - the dog has been their longer and you know what is best for him, it's your house. Also, I'm sure your BF moves around and snores which might distract you or the dog, just saying...", "oh my god, doggo has been with you for *years.* one year is nothing next to that. NTA. *he* can sleep in the landing lol", "[deleted]", "Everyone is different, I like animals but I would never dream of allowing a pet on my bed ever and especially when I sleep. I do have allergies and such but even without them, it’s not happening\n\nHowever I understand people are close with their pets and can’t imagine a reality where their pets don’t sleep with them and that is okay, cute even.\n\nNone of these realities are wrong, they are just different, there is no AH or badguy simply from the differences\n\nHowever, if you combine these two people, it’s chaos. Your dog is part of your home and it is his right to sleep in the bed so naturally you don’t understand why the dog should be made to be put out.\nYour partner doesn’t even believe the dog should be in the bed so they don’t understand why you can’t put the dog out. \nTo you, the dog snoring isn’t a big deal and you are able to sleep through but you don’t see the fact that your partner is struggling to sleep, as a direct result of the dog, as a big issue. disturbances in sleep are serious no matter how fickle. \nI see why your partner feels upset that you don’t seem to think it’s a big deal.\nYour partner however also fully knows your relationship and habits with your dog and still wants to sleep in your home. They could simply not sleepover or could understand that you too have completely different ideas on the boundaries of the dog. He knew the situation when he got into it and chose to continue and so it’s weird that he is now trying to change something that you have always done.\nThen comes the fact that the dog takes a portion of the bed, for you, youre used to it and you don’t even notice it, to your partner it’s a huge adjustment in their comfortability whilst they sleep and again affects the amount of sleep they get. \nHowever, your dog should absolutely be able to go where it wants and it’s comfort should also be considered. This is also what they are used to, they’re used to sleeping there and i know changing it habits is probably confusing to him. Its a no win situation. It’s up to you which one matter the most to you and act accordingly Z\nBut you can’t negate the physical issues that your partner has with the current routine\nNAH/ ESH", "NTA. It seems unfair to you and your dog that both of you should get worse sleep for someone who starts fights when he's ultimately in your home as a guest and he's seemingly taken no steps to resolve the situation other than trying to make you and your dog alter your routines.", "NTA. Make the boyfriend sleep on the landing.", "NAH. He’s your dog and he was there first, but not everyone can sleep well with dogs in the bed and he’s not an AH for not wanting a dog in his bed (I do think you’re overreacting a bit with the “what if it were a baby?? part - animals are not children). It sounds like you two just aren’t compatible.", "Your boyfriend lacks empathy. Keep the pooch, get rid of the boyfriend", "nta  your dog needs special treatment because of the anxiety, thats how it is.  \nyou both need to make a choice, and hopefully the choice is sustainable.", "NTA. Your house your rules. But if you see your bf relationship progressing to the next level then you’ll likely have to be okay with dog sleeping elsewhere. You can train the dog. Move the bed to the doorway inside the room for a while. Then outside the room with the door open. Then eventually with the door closed. Unless you have a studio appt, then bf needs to suck it up and get himself some earplugs.", "NTA It's your house and your dogs. If you want to put less stress on the dog leave him in your room in his bed. If bf is going to make an issue of it then perhaps you and bf need to reevaluate your relationship.", "NTA drop that dude. He’s not a dog person or else he would understand how confusing and sad this is for the dog. He also has some nerve to make you change things around in your own house. Move on, a year is not incredibly long and you’ve not moved in together yet. Cut ties bc if this progresses and you do move in together, it’s gonna be his way in the house all of the time if he’s making demands when just visiting your house. Bye bye", " NAH...everyone has a different view about animals. You tried it his way and it didn't work for you or your dog. It's  time for your boyfriend to decide if this is a make or break issue for him.", "NAH, you care about you dog well-being more than your boyfriend well-being, it’s your right. And he care about himself more than your dog also his right… just doesn’t sound like this relationship have romm to grow.", "NTA - keep the dog, ditch the boyfriend.\n\nI had a \"special needs\" rescue dog when I met my now-husband. I won't lie and say they fell in love with each other, but they did eventually learn to tolerate one another. Because the dog was important *to me*, my husband was willing to make sacrifices so the dog could be accommodated (the dog was severely abused before he came to me).", "NTA this is not the man for you.\n\nIf the dog slept on the human bed and hogged the covers and scratched you in his sleep with doggie claws, there might be some room for compromise and discussion. \n\nBut your dog sleeps happily and relatively quietly on the dog bed. Your BF should take that as a win. \n\nWhat if he got you pregnant and you wanted your baby to sleep in the room with you-for the first few months, at least? \n\nHow your partner treats pets is a good test drive for bigger things. This is not the man for you.", "NTA. I'm a lesbian so that might make a difference but I would make the BF sleep on the landing (I'm assuming this means porch and there my be some language barrier.) lol. But really the dog was there first and it is your house so if he doesn't like it he can kick rocks in my opinion.", "Bf is currently away for work, but when he's back I think it's clear we need to sit down and have a heart to heart conversation. I appreciate everyone's input and feel somewhat reassured that I'm NTA. I guess I need to have a good think about how we move forward and if there even is a moving forward together if we can't find a solution.\n\nI will suggest the earplugs, and see if he's open to giving that a try.", "NTA - You're a dog person trying to date a non-dog person. Tell the bf to go sleep out on the landing, or better yet just break up because this is an untenable situation. If your bf and your dog cannot coexist, you and your bf an flat out not compatible.", "NTA - Buy your BF ear plugs or put his bedding on the landing. He’s the one sleeping in your dog’s bedroom, not the other way around.", "NTA. Keep the dog, ditch the bf. This will never be a fight you will stop. Your bf will resent you because of the dog. If you move into his home or a home together the first rule will be no dogs in the bedroom, maybe even the house.", "I overhead a conversation between a couple of friends. One of them said that her new boyfriend had stated that he would never share a bed with her dog. She told him that fine, I’ll find you a mattress and you can sleep on the floor.", "NTA the dog was there first", "NTA, but consider getting a white noise machine or app to help drown out the sound of your dog moving around", "YTA The mutt you dragged home is making you upset the baby you've been taking care of so long. The dog stays he never bothered you, and if the guy don't like it you can find one that does.", "Nta. Dog is part of the pack", "fuck this guy.  NTA.  your dog is FAMILY", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (31F) have a wonderful dog. I've had him since he was 6 months old and he has always slept on *his* bed in my bedroom. He has quite bad separation anxiety (he's a rescue) so he has always slept in my room. He doesn't sleep on my bed unless I'm sick and comes for a snuggle.\n\nI have been dating a wonderful guy (34M) for just over a year. Everything else is amazing. But.\n\nHe hates having the dog in the bedroom \"because he makes noise moving around/snores at times\"\n\nI have made my dog sleep on the landing several times (on his bed) at the request of my bf, but he (the dog) gets visibly anxious (he sits right behind the door and pants for hours) and it breaks my heart. This dog has gotten me through some extremely rough times and he means the world to me. Knowing he's out there stressed just makes me anxious and everyone but my bf has a bad night's sleep as a result.\n\nThe past few times bf has stayed over, I have tried leaving dog outside the room but ended up letting him in because a) it's my house/dogs house and b) I just can't leave him stressed all night and c) it isn't fair to have him in some nights but not others, the dog doesn't understand.\n\nHe isn't even that loud, usually lies on his bed and goes to sleep and doesn't move until morning. He will sometimes get up turn round and lay back down but the noise is minimal. I admit some nights he does snore, but I drown it out whereas bf is a lighter sleeper.\n\nThis has caused a few small arguments/us going to sleep not talking and I'm seriously wondering if this can even work long-term if we can't even agree on where the dog sleeps. What if it was a baby in a crib? Are they a nuisance too?\n\nI've decided I just won't put my dog and myself through this again night after night, so he will sleep on his bed in my room whether bf sleeps over or not.\n\nSo..AITA for refusing to make my dog sleep out on the landing because it inconveniences my bf?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. It’s pups bedroom too. But if it’s the noises only that bother bf, perhaps there is a compromise. Like white noise machine or app playing on your phone. I started doing this for my dogs, the white noise makes it so the brain ignores small noises like moving around. (It helped the dogs bc we had to move into an apartment for a while and noises woke them and they’d move around and wake me, it also helped me mask their snores - boxers squishy faces are adorable but man the snores)", "Yup. Keep the dog and get rid of the boyfriend if he continues to press the dog sleeping elsewhere but your bedroom. NTA", "Hahah the dogbed is memory foam.. 🤣 and my dog is the size of a horse so it's definitely big enough.\n\nLike someone said, landing is the area at the top of the stairs. It's bascially the hallway outside my bedroom", "The landing is the hallway at the top of the stairs :)", "You have a good point there. Pretty sure I don't snore but I do move a lot in bed", "He's never had pets but he does love my dog, he literally spends hours petting him, will take him on walks just.. because (and sometimes I wonder if the dog loves him more than me 🤣). It is a big adjustment so I do get it, but I just don't think it's something I'm willing to compromise on. Like you said, pets are family and that is 100% how I view it.\n\nIf my dog had always slept outside it would be fine but i really don't think he will adjust well.", "I don't think he's being unreasonable per se, I can see both sides (hence why I could see me potentially being the AH) but I appreciate your points and do think we need to have a real conversation about it all.\n\nRe sex, we already leave him out of the room for those times and whilst doggo doesn't like it, he's OK *ish* for that short period of time.\n\nI am conflicted because everything about the relationship outside of this is amazing (it's the only real argument we've had the entire time we've been dating)", "Thank you ! I do see his side of things and really have tried to get doggo to sleep outside the room but it just doesn't work for us (me and doggo)\n\nHe is a big lad, he's a 60kg boy 🙈", "I do appreciate the sleeping issues that come from it, and really do want us to find a solution.\n\nJust to clarify though, the dogt doesn't sleep in my bed. He has his own dog bed that lives on the floor at the end of the bed, so he doesn't take over any space in my actual bed. I would 100% not let that happen especially with a partner in my bed too", "The dog doesn't sleep in my bed, he sleeps on a dog bed in my bedroom - completely get not wanting the dog in the bed (he's too big to do that anyway).", "The dog is sleeping on the floor of the bedroom in its own bed.", "Exactly! I have had pets and I am a firm believer of \"no pets inside the house\", They smell, they shed, they get in the way. Getting them even into the bedroom? Of course not!   \nDid I have my babies in my bedroom? Yes, they shed less, brush their teeth and there is hope that one day they will get less in the way :D", "It's confusing because he is so empathetic in all other areas. He didn't grow up with pets so I guess a lot of what I see as \"normal life with pets\" isn't the same \"normal\" to him. He also hates the pet hair that comes with having.. Well a dog that sheds. I hoover every day pretty much but there will always be dog hair that just appears.. he's a dog 😅😅\n\nAnd I would NEVER get rid of my doggo, I would literally die for him ❤️", "The baby argument is one that has crossed my mind and I did mention it to him at one point in the way of \"what if we have a baby and the baby makes *too much noise*?\"", "Landing means the hallway outside my bedroom, at the top of the stairs.\n\nHaa I love your take on it, I wonder if men and women have different takes on this or if it's similarly spread views across the board", "For what it's worth I get where your BF is coming from- I have misophonia from autism and it makes sleeping with the dog impossible. I will wake up multiple times a night to her snoring and moving- and she's not even on the bed. For other reasons, she's locked away in another room overnight now instead of in the room with us but I learned I needed earplugs to sleep through the night. I use Happy Ears- which have a low profile and are pretty comfortable to sleep in. If you need any recommendations- they're not exactly cheap but so much more comfortable than your standard plugs.", "🤣 I'm not quite going to that extreme, he doesn't sleep in my bed because I'd need a double king size to make that even work 🙈🤣 but your friend has a good point", "Not sure I get what you're saying about \"the mutt I dragged home\" and how that makes me the AH ? \n\nHe's a pedigree dog but even if he wasn't I don't see how it's relevant particularly.\n\nHe isn't a child, but he is everything to me, he's got me through some rough times including being fully ghosted by my ex-husband so he is extremely important to me.", "Just make sure to vacuum it before hahah", "Thank you!", "I feel like that would wake him up more than your dog snoring. What kind of dog do you have?", "Are there other compromises you tried/have tried? Like, are there things that would help your bf sleep through the dog's movement such as earplugs or something? Or is worth trying something to make the dog more comfortable in another room and see if that works?\n\nAnd if none of that works, is this something you two could work out, or would it be a dealbreaker?", "throw out the whole man!", "NTA. It’s easy for strangers to say that you should break up. But if you really do want to find a solution, a compromise is possible. If you get a child gate for your bedroom doorway, then doggie will be able to see you from the hallway. This should reduce anxiety. You could move your dog’s bed closer to the door each night and eventually to the hallway. Give your dog a piece of your clothing that smells like you to sleep with. \nGet a white noise machine (or use a phone app) to help drown out any snoring noise.", "If you think “no pets inside the house” please have farm animals not pets.", "Some people are just lighter sleepers, and snoring absolutely can ruin someone's night. Repeatedly getting poor sleep is not ok either. The dog can't move, so the potential solutions are to investigate the snoring, have him try earplugs and white noise machines, or you sleep separately.", "IDK if it is a man and woman thing but I will say that I am an animal person. I have 22 pets. I am married and luckily my wife and I are in agreeance about the pets. They are all pretty much allowed to be everywhere the humans are. If I had come across someone who felt this way about pets before my wife that would have been a deal breaker. I wish you good luck with this dilemma.", "Thank you for the recommendation! I'm glad you found a solution that works for you 💜", "“The mutt” is the *human* (dog) you brought into your household. Not your Rottweiler. Your *baby* is your sweet puppy dog.", "Haha it has a removable cover so I'll throw it in the wash for him", "He's a big soft rottie", "Oh wowww 22 pets! That sounds like my dream !  Thank you!", "If he doesn’t like it, throw him in the wash 😂", "Do we get the “dog tax?”", "It is a dream but it is also a ton of work. All of my babies are rescues and require a lot of attention but it is worth it for all the love they have to offer.", "That might be a tight squeeze 🤣", "NTA but I find it distinctly odd that you blame “being a rescue” for your dog’s anxiety/behaviors when you got him at six months and have had him for years?", "NAH", "NTA. And to put it less bluntly than some others, the reality is that there may be a fundamental incompatibility between you and BF", "NTA, sorry, I don't think this is the right fit for a relationship for you. \n\nI have two dogs, very well behaved, and my ex- boyfriend did not like dogs on furniture, dogs on beds, dogs playing...you get it, dogs. \n\nThat relationship was doomed.", "NTA", "NTA, though, maybe you should reconsider this relationship. I have a dog, she's tiny, and she does sleep on my bed. I'm single at the moment, but I do know that when a partner comes along, they'll have to accept it. If they can't, then that'll be a deal breaker for me.", "NTA.", "NTA *of course* your dog should sleep in his bedroom! I dont think this guy is right for you", "NAH\n\n&#x200B;\n\nBut your relationship has no future.", "NTA.  I have always slept with my pets on the bed and always will.  Anyone who has a problem with that can piss off.  You aren’t even asking your very good boy to sleep on your bed, but in his own doggie bed.  You and your bf will never agree about your dog so I think it’s time to reevaluate the situation, in favour of your dog.  NTA", "NTA\n\nThe Dog was there before the bf.", "NTA. The dog is family. He sleeps in your room. You are a package deal. If BF doesn’t like that fact, he does not need to sleep over.", "NTA - you’d be TA if you give in on this. Don’t put your dog through that. It sounds like he becomes very distressed. Also ask yourself if you’re sure how the boyfriend will treat your doggo when you’re not around, as he’s more bothered by feeling inconvenienced than the pupper’s feelings. Doggo was there first, it is not boyfriend’s house. Personally I see it as a bit of a red flag too, because it is not his house and comes off as entitled. It’s your house, and doggo’s house. Also why is he okay by your boy feeling distressed every night? Will he make doggo’s well-being a priority if the relationship continues? Personally, my doggo sleeps with me, I’d be damned if someone told me he couldn’t anymore. He’s 95 lbs., hogs the bed, sideways-donkey-kicks me in his sleep and his snoring sounds like pig-monster noises. He’s still not going anywhere.\n\nI’d understand if someone didn’t like that. But we wouldn’t be compatible. It’s too important to me as well as my velvety pig-monster.", "NTA\n\nMy dogs slept on my bed, despite having their own beds.   I'm not making them move for anybody.", "Dog stays, dude goes", "NTA.  Kick bf to the curb.", "NTA. Find a new man and buy your doggo a toy for putting up with this clown", "NTA\n\nDogs are more intuitive than men are most times. Let the dog in the room.", "NTA - dude can take a sleep aid if he’s that light of a sleeper.", "NTA, and it's up to you to decide if your boyfriend is worth working through this with. Have you tried getting a box fan, or white noise machine or something? My wife can't sleep without noise, so we have a box fan in our room that she turns on every night at bedtime. I got used to it easily, and it's been great for drowning out the neighborhood noise in the morning. We used to live in an apartment with a baby living below us, he'd wake up our roommate super early every morning, but we'd sleep through it because of the fan. I'd consider trying that, it might be enough to drown out the dog nose so you can all sleep comfortably.", "NTA - it's not about the noise your dog makes - otherwise your bf would have issues sleeping beside any other living being as ALL of us move and snore/fart/ talk in their sleep/ etc.", "Nta, but I do understand the bf not being able to sleep I'm SUCH a light sleeper it's why we don't let the dog sleep in the bedroom with his night time running and licking and snoring! \nHe's your dog and he was there first, bf can wear headphones or ear plugs, or get used to it but it's not fair to the dog to suddenly kick him out", "No. I've got the same thing with my cat (right down to him being a rescue too/separation anxiety) and the worst thing I ever did was let my (now ex) boyfriend shut him out of my bedroom. They don't understand and they've done nothing wrong to deserve it, and I would never ever let a man lay down the law like that again in MY house! Boyfriend needs to realise he's coming into your dog's house, he doesn't get to start making decisions like that. Suck it up or don't stay over.", "NTA. One of my dogs is the same way. They sleep in my room and sometimes wake me up when they move or lick. I use a sound machine to drown it out. Works perfectly. Try that", ">>let the bf sleep on the landing...\n\n....because HE makes noise moving around and snores at times 😉", "Woah a reasonable answer !\n\nPoor sleep is not healthy for OP ‘s partner nor their relationship. \n\nIf OP chooses the dog over the partner, that’s all fine and dandy, but it means their relationship likely won’t last.\n\nMost dogs (not all) will adjust given proper training. As you noted, consistency is key. OP needs to make the dog new new home and make it special and have it that way all the time. I would suggest OP try this first as a reasonable solution because the 2 bedroom option is still choosing dog over partner and probably won’t go over great.\n\nOther potential solutions:\n- earplugs\n- white noise maker\n- sleep music that plays all night\n- if OP doesn’t have them, curtains and rugs help absorb noise", "I don't blame him being a rescue for his anxiety, but it is a big part of the root issue. Before I got him, he was locked in a room for days on end with no food. We have worked on it A LOT and he is much better today vs when he first came to me as a terrified skinny pup.\n\nI'll have had him for 3 years in a couple of weeks.", "What ridiculous speculation. Guy just doesn't want to be woken up in the middle of the night, that must mean he hates dogs", "Haha I feel you with boxers, they are snory boys! \n\nI'll look at white noise apps and earplugs as a second suggestion from people and have a sit down with bf to try and find a solution that works for both of us.", "Aww that's so sad, I get people aren't all dog lovers but it was kind of the deal when we started dating. I never hid my furball, he knew that it was a 2 for 1 deal from the start", "Most people don't equate human children to dogs and likely would treat them very differently. \n\nI realize that many dog owners view them similarly and treat them that way. Most non-dog owners would likely treat a human child very differently than a dog.", "Ear plugs are not very comfortable but may a white noise machine can help \nNah", "Well, it *is* a very common issue. Lots of people have different opinions and preferences. Is there a specific part of the dog moving around that wakes him? Like I'm thinking since the dog isn't on the bed at night and if your floors aren't carpet, get a large rug to put under the dog bed that spans towards the door so if the dog moves around, the sound is cushioned and there's no nails on a hard floor sound.\n\nOther than that, have an honest conversation. You've tried to compromise on it and are willing to try other things to help, but the dog staying in the room is non negotiable. Explain the dog has been there longer, and you made a commitment to your dog when you got him, so the dog is going to take priority barring extreme circumstances. If he's an okay guy, he'll understand and yall can figure something out, like possible separate rooms if you move into together down the road and he doesn't adjust", "Honestly I’d talk to him about getting separate bedrooms if you move in together. It’s really not that uncommon to do when one person is a light sleeper. My grandparents did it cause my grandma snored and they were married for 55 years.", "If you think your bf would treat a child poorly that reflects badly on him, but most people dont view dogs and children the same. You can't really equate to the two. \n\nI don't have a dog and wouldn't let one sleep in my room. Both my children slept in my room as infants. I cared for them often during the night, feeding and changing as needed and getting them back to sleep. My ability to parent my children is has no relation to the fact I wouldn't want a dog sleeping my room. \n\nDogs are not children.", "A big soft Rottie? 😍 BF is dreaming if he thinks you’re choosing him over that sweet chonky angel. \n\nSeriously though my big old American Bully sleeps on my bed and snores like a… well like a big old American Bully. I pop in the earplugs, problem solved.\n\nYou’re definitely NTA and keep on advocating for your fur family.", "Hahaha bless your big floof! My buddy is too big to be on the bed he would need his own entire side 🤣🤣 he is literally human size once he's lying down fully comfy legs extended 🙈\n\nI'm definitely going to suggest trying earplugs a few people have mentioned it", "Thank you for taking care of so many babies that deserve a loving home 💜💜 I can only imagine the work that goes into it so you my friend are an angel 🥰", "If he's on the bed, does he try to contort his giant body to fit the space? My brother's huge dog loved to cuddle but was way too big to fit on the bed with two other people. So she would squeeze between them, very carefully contort herself, and hold this awkward pose and pretend to sleep, as if to say, \"See! I fit! Let's snuggle and go to sleep as if I'm just a little 15 pound pup. This is totally normal!\"\n\nShe was such a good goofball.", "I believe it, lol.  I have a 40 lb GSD/Pit Bull/Shih Tzu/ Rotti mix (bizarre mix I know, lol), she basically looks like a GSD with stumpy little legs, and she STILL manages to hog half of my queen size bed every night, lol.  Some nights it’s more like 3/4, depending on how she stretches out.  😂", "My dog sleeps in the bed with me, but when my BF stays over the dog sleeps on his own bed on the floor. It's gotten to the point where Roswell knows that if my BF is in bed, he'll get in his own bed. And it's totally fine.   \n\n\nTo address your issue, maybe a white noise machine would be helpful! My BF uses one to drown out other stuff too. But honestly, you could make the same argument that your BF moving in bed and breathing and snoring keeps you up too...your dog is a living breathing creature who was here before the man. Sorry boyfriend!   \n\n\nIn case it wasn't clear, NTA.", "Find a man who will let your dog sleep in the same room without complaint. \n\nWe tried to only have our two dogs sleep on the floor. They're in the bed with us now and love to cuddle and we can't sleep without them.  They snore, but so so does my husband.", "NTA\n\nMy spouse and I currently have two dogs, and they both sleep with us.\n\nI understand not everyone wants to have dogs in the bed with them, but to not even be in the same room I can't imagine. Dogs are pack animals, they need their humans.", "NTA. Your home, your dog. The dog was there first ditch the AH boyfriend and find someone who loves you AND your pup. \n(Also is there a pet tax photo that’s been paid yet?)", "[Dog Tax](https://ibb.co/K2mgLZq) for those who were asking 💜💜", "nta cant sleep without having my cats walking on me sleeping on my side and purring next to me", "NTA, it’s time to say boy byyyyye", "NTA\n\nBut do try to find a trainer specialized in separation anxiety. There may come a time when separation is needed (travel, veterinarian, etc) and him being able to deal with it is sometimes essential.", "NTA - my boyfriend has a corgi and I love him very much (he is like a son for me) but I have a lot of trouble sleeping and he is also very anxious then he usually sleep in my parents-in-law's room (my bf still lives at their house bc we are both young). One day we went to Center Park and  took his dog with us, since I can't stand the little mouth/snoring noises he makes, I left the door of a bedroom open, so the dog could come in. My boyfriend hugged me and then he went to sleep with the dog in the other room.\n\nMaybe you should sleep separately?", "NTA.\n\nI've always put my dogs before my boyfriends, and I've never regretted it.", "Get rid of the bf and find one who likes your dog", "NTA\n\nYour dog is part of your family.\n\nYour BF is not.", "NAH. However your BF should try a white noise machine or even a small fan in the bedroom to muffle the sounds. People adjust to sounds in the night over time.", "Hell no. NTA. My dogs are my family and here before anyone that comes along.", "NTA.\n\nSo I have a dachshund mix.  Adopted him 10 years ago. I also bought my house 5 years ago.  I let my dog sleep on his bed next to my bed.  He also has a small kennel area in another room which he’s fine going to, but we use that more when I’m at work.  My fiancé and I got together about 2 years ago and have been living together for 1. My dog sleeps and will get up occasionally to stretch and scratch, etc.  My fiancé has never once asked me to move the dog, and we would have big problems if he did.  \n\nI’d try talking to your boyfriend, but if he continues to be unreasonable, he may not fit into your life.", "My boy is a Jack Russell/Lhasa apso cross so is a small dog but takes up a lot of room, he stretches lol...I've learned to sleep on the edge of the bed lol\n\nBut my furbabies comfort comes first \n\nNTA OP your furbaby was there first, your BF will just have to get used to him being in the room \n\nYou should think about this relationship OP, like you said about what if you had a baby, your BF is basically telling you that it would be 100% your responsibility as he doesn't like his sleep disturbed \n\n\nDump the man and let the dog keep sleeping in your/his room", "NAH.\n\nSounds like you and BF are incompatible, and that's fine.  Break up and move on.\n\nYou know, it's funny, my current dog sleeps in the basement.  I met my partner, and her dog slept in an open crate beside her bed.\n\nOne day, when her dog was being particularly loud licking itself and making happy grunts while she was trying to sleep, she moved it's crate downstairs beside my dog.  She'd always made it clear that this wasn't an option, as her dog would spend all night crying and begging.\n\nWell, surprise, he loves sleeping beside his big black girlfriend, and she says things like 'how did I ever put up with having him in here?'", "NTA\n\nI can't quite zero in on the BF. AH or not. His need/request is reasonable enough. But it depends on his execution/expectation. It feels like he expects the dog to be out of the room, and doesn't care about the cost. That would be AH.\n\nI'm amazed at all the DVs for \"keep the dog, dump the guy\". SO I'll say it too. Keep the dog, dump the guy. Unless you can find a functional solution that isn't just you and/or your dog doing all the sacrificing (which is a common outcome).", "I’m going to say\n\nNTA\n\nIt absolutely hinges on you two having separate houses and presumably a guest room. Which means when your boyfriend stays over, he’s a guest. So if BF doesn’t like the dog being in the room on its own bed, then BF can do his actual *sleeping* in the guest room. However if you don’t have a guest room, then you need to consider your partner’s sleep, if these overnights are a frequent thing.\n\nYou will likely need to revisit this if you ever get a place together, as it wouldn’t then be just *your* house.", "NTA . Super slippery slope. First it's the dog is to noisy then it's the dog has to go.  Partner seems incompatible.", "NTA\n\nYour BF needs to realize your dog has his bed in your room. And that's the way it's going to be. Period. He needs to figure out a way around that. Not you.", "NTA. Dog first!", "NTA", "NAH - your relationship is doomed becasue your boyfriend is quite entitled to find having a dog in the bedroom revolting and you love your dog more than having your boyfreind in bed with you. Both of these are OK  but These two things are not compatible. Admit it can’t work and move on", "Dogs > BF \nNTA\nget rid of the guy, the longer you are together the more he will demand you change", "NTA.   Having your dog sleep in your room is perfectly acceptable. Just curious if you and your boyfriend have tried anything else like running a fan or white noise while you sleep which could help resolve some of the snoring issues.  If boyfriend demands that you treat your beloved pet differently / poorly and you allow that, then you would be the asshole. Dogs are best friends for life.  Boys come and go. 🤣", "NTA. If my bf wakes before me on weekends, he gets out of bed, invites my dog up and tucks him in under the covers.", "Macs earplugs are amazing", "How is the b/f an AH here? I have absolutely no problem that the dog is the priority for OP, but I don't see how the b/f is an AH for wanting what sounds like barely even half-decent sleep. \n\n>He isn't even that loud... I admit some nights he does snore, but I drown it out whereas bf is a lighter sleeper.\n\nSo OP *fully admits* the dog can be somewhat loud but is trying to justify it as acceptable, while also admitting she's not even really the one that needs to accept it since she's a deep enough sleeper to drown it out while knowing her b/f is not? Certainly sounds like she's dismissing his legitimate concerns, and that's far more worthy of calling AH behavior than what the b/f has done. \n\nThere's a reason some couples (even without pets, etc.) choose to sleep separately since it makes a lot of sense to do so when sleeping habits/factors/symptoms don't align, and that sounds to be the case here. Ultimately, they need to find a compromise and maybe aren't compatible. But it seems far more YTA or even NAH as the proper judgement here. Judging NTA tells me you're completely ignoring what each side has/hasn't done, and siding with whomever favors the pet (reasonable without any info, completely illogical when there is info).", "I think the photo option has been turned off but bear with me I *can* insert a link!", "u/StuDawggie", "A dog isn’t a baby. It may not even be safe for the baby and the dog to sleep with her at night. Which one gets put out? The dog or the baby?", "I'm not dismissing his concerns. I think I've said in a few comments that I do understand not everyone is used to having dogs in the bedroom, and that he is a lighter sleeper than me. I do want to find a compromise with my partner, because I don't want him to not be able to sleep well as a result. I can see how I could be the AH, hence the post, so I do appreciate your comment.\n\nI accept that I am putting my dogs wellbeing above his currently, because the dog didn't ask for anything and doesn't understand why the hell he's being locked out of his bedroom that he's always slept in. I have tried having him sleep outside the bedroom, but it just doesn't work, so I guess currently next step is having a proper conversation about what we can try to solve the issue (some people have suggested a white noise machine and/or earplugs which i will discuss with him)", "You have a big dog and think it makes minimal noise when it changes position? Stop wasting  this man’s time. Your commitment is to the dog.", "Does he try ear pugs?", "Have you tried a weighted blanket? I move a lot and my husband says I move a lot less now after buying one.", "Yeah. I'd suggest a fan, or white noise machine. ANYTHING that he can tolerate that will give a little distraction from any sound the dog may make for now. In time he will get used to it for sure, just gotta get that far! XD good luck!!", "A dog isn’t a baby. It’s also worth wondering what you would do if you had to choose between the dog and the baby.", "Why even date if the dog is going to be more important than any partner you’ll ever have?", "I mean, I'm woken up way more by my husband moving around in bed versus the softer noise of a dog readjusting.", "My commitment is to the dog, you are right. I adopted him and made a commitment to him to give him the best possible life. I never hid that the dog is my number 1 from my bf. He knew how much he means to me from the beginning, I've never changed the goalposts.\n\nThe dog doesn't particularly move during the night so it is what I would call minimal but I do accept that what I consider minimal isn't for other people.\n\nI'm not sure how I'm wasting his time though.", "I think it's just general \"getting up and lying back down\" noises or if he's dreaming and his little paws are moving. Floor is carpet so no claw noises to be heard.\n\nA conversation is definitely needed and you've put it really well so thank you for the advice 🙏🏻", "That’s a big ask over a dog.", "Rereading the comment I see that I fully misread it initially 😅😅", "Dogs aren't children, I agree, but my dog *is* as important as a child to me.\n\nI don't know how he would act with a child and I don't think he would treat a child poorly, but I don't know if he would be as hands on as you have been with your children (and I can't assume having never seen him with young children)", "Not really.", "DOG TAX please OP", "Hahaa he's only ever been on the bed a few times with me alone when I've been sick and feeling sorry for myself but yep I could 100% see him doing this! He definitely doesn't realise how damn big he is 😅", "If the landing is good enough for a helpless little doggie that has a momma that's his whole world then the landing is good enough for boyfriend who isn't helpless, you are not his whole world (not saying he doesn't care deeply for you) and doggie was there first so sounds like a great option for boyfriend to get the rest he so desperately needs.  NTA!", "NTA\n\nYou are completely within your right to let the dog in.\n\nJust want to add: I'm a light sleeper, I wake up for any noise, especially unfamiliar noise, and while I could have gotten used to a dog after a long time, it's difficult getting irregular sleep. I had my cousin's dog for 2 years (while she was studying) and I spent 3 months slowly slowly moving the cage (she preferred sleeping in it, but right below the bed) toward the hallway. I moved it a few cm each night, and if she seemed to get agitated I would leave it at the spot until she accepted it. Just having it not touching the bed took 2 weeks.\n\nIn the end she was sleeping in the hallway, no crying, pacing or whining. She would just stretch and yawn at me in the mornings with a wagging tail.\n\n\nJust mentioning it if you want to consider trying. It's all up to you and your doggo. Give some scritches from me <3", "Find another boyfriend that likes dogs", "NTA.\n\nI'm sorry OP but this would be a deal breaker for me.  Your dog was there first, boyfriend knew you had a dog and now he wants to change the rules?  NOPE.  Keep the dog and get rid of the man.", "NTA. \n\nKeep the dog. Lose the dude.", "NTA\n\nIf it bugs BF that much, he can get some of those little foam earplugs.\n\nAnd if having a dog in the bedroom is a deal breaker for him, that's okay, no judgement... different strokes for different folks... \nBetter to find that out now and.gonyoir separate ways.", "NTA, drop the boyfriend or make him sleep in another room, dog comes first.", "YTA \n\nAll dog trainers tell you that you should not let your dog sleep in the bedroom. This reinforces separation anxiety.\n\nSource: my dog trainer at dog obedience school.", "NTA", "Nta there's enough people out there to date that will actually be okay with your dog.", "NTA, but can something be done so everyone wins? Would white noise help? Would ear plugs (expensive ones) be an option?", "My gf's dog sleeps in a bed next to hers. She also claims it never makes noise at night.\n\n&#x200B;\n\nShe is infact 1000% incorrect and i have to use earplugs when i stay over (and even then, it doesn't fully block it out). She is just used to it. As you may be? Or it my infact not make any noise at all. But I am aware the dog came before me so theres not much i can do about it.", "NTA. If noise is the actual issue for your BF, maybe consider getting a white noise machine? It’s amazing for people who normally are disturbed by every little sound.", "NTA. My friend is a light sleeper too, so he plays some rain noises in the background when he goes to sleep, so that drowns out any noise from outside. Perhaps your bf can try similar techniques too, if only the noise in the night is the problem.", "I told my boyfriend re: my dog the first time he set foot in my house: \nIt is her house. She is allowing YOU to be here, not the other way around. \n\nYour boyfriend is TA. Dog was there first. End of story.", "NAH.  \nSome people are fine with dogs in the bedroom, some aren't. He asked you, you tried but don't like it.  \nTime to cut ties with the BF I feel, before it becomes an actual issue.", "NTA the dog is showing clear signs of distress with the panting, that’s not ok and I’m glad you’re putting his health first", "NTA. IT'S YOUR DOGS HOUSE TOO! Your bf is just a VISITOR. Get him some earplugs and if he doesn't like it and can't make it work, find a new bf because his sleep is important too. My fiance spent 2 years getting my dog to love him. She is also a rescue(Rotti, Akita, Samoyed and Shar Pei) and is very standoffish with most people. She'll tolerate you and take treats, but typically doesn't want anything to do with strangers, especially men. He knew she was important to me and if he couldn't make it work, he was gone. If someone truly cares about you, they will know that your pet is a priority and they will treat it as such and find a way to make it work. Men come and go, your dog is for its lifetime.", "NAH. You and your boyfriend are just incompatible. If you’re going to be in a relationship with someone who has a boundary you cannot adapt to, it’s never going to be a healthy relationship. Ultimately, you are either choosing the dog’s comfort and well-being or your boyfriend’s.", "Get your BF a large dog bed and he can sleep in the hallway.", "NTA. Dog comes first. If you were to move in together he would want the dog further away..", "I'd suggest trying a white noise machine. Many come with plain white noise which sounds like static. But they also have rain sounds and ocean waves.\nBlocks out street noise too", "In all honesty, you might want to look at getting a new boyfriend. I’ve been in situations like this before and clearly he’s not into dogs and if you are, you guys are never going to hundred percent match you’re always gonna have to fight this.", "NTA - if he has an issue he can sleep on the landing instead 😂", "Nta. Dog was there first, dog is priority before boyfriend unless they are behaving in a dangerous or aggressive manner, which is clearly not the case here. Ask yourself: who loves you no matter what? The dog. Boys come and go pets are in your heart forever.", "NTA. Dog comes first. If you were to move in together he would want the dog further away..", "white noise machine perhaps?", "Much needed! And definitely NTA", "so beautiful!!!!", "Yep. I stand by my decision. Keep the dog lose the loser. \n(FYI I’m a sucker for rotties)", "Thank you 🙏🏻 I'm willing to give it another go, but do need to have a real conversation with my partner about alternatives too.\n\nScritches given 💜 he's a happy boy (and would sit being pet for hours on end 😅)", "Are we really comparing waking up a dog in the middle of the night with waking up a human?", "To be fair, trying something just once with a dog isn't going to accomplish anything. There would be no such thing as training a dog if everyone gave up after the first failed attempt.", "That’s not odd at all. Some dogs are just born with certain temperaments. Often times it is due to the way the dog is bred. You can’t train away their whole personality. I find it “distinctly odd” that you are seemingly suggesting it is the fault of OP that her dog has anxiety. Mindsets like that are also pretty insulting to people who have anxious dogs, who put in a ton of effort, money, time, and training, do everything right, everything they can, and still have an anxious dog.", "It's not odd to be honest, 6 months is a long time for a dog, considering they're adult at 1yo it's like for a human having had childhood and teenage traumas.  \nI also adopted my dogs around that age and they were very full of traumas and fears from the life they lived till then.", "I don't think he would ever do that tbh", "Seriously. People acting like trying a new routine for a dog means you're choosing your bf over your dog", "And honestly, it sounds like bf is not a dog person. I am married to a non-dog person. Those relationships can work. But they require compromise on both ends. In our case, it looks like saying we won’t have a dog until we can afford enough space for our dog to basically have their own space, and be primarily an outside dog (which includes being able to provide an appropriate dog house, fence, etc.) It doesn’t sound like either of you is really ready to compromise on this. That’s fine. You are allowed to have a line in the sand. So is your boyfriend. Either the lines have to be redrawn in a way that everyone is comfortable with, or it’s not going to work. I hope you don’t put yourself or your dog through that, and I hope your bf won’t put himself through that.", "He's the asshole because he's not at all considering how this impacts the dog's health. You're absolutely right that this is a situation where they should sleep in separate rooms, but he's still an asshole for disregarding how this impacts the dog.", "Appreciate the advice, and will look into white noise machines this evening 🙏🏻", "I can't sleep with a dog in the room unless I'm sleeping beside the dog. My brain registers anything moving around in the room outside the bed as danger for some reason. It sounds dumb, but he might do better with the dogs bed right beside his side, that way his brain may have an easier time attributing the dog moving around as the dog, not as a mystery sound that wakes him up.", "Make sure he knows it can take months if you decide to try to acclimatise the dog to the landing. It can be a bit of moving around and stuff, especially when it's on the other side of the doorway. I let the door be open so she could come and see I was there for a few weeks, just trying to slowly close it.\n\nOfc this all went out the window when she returned to my cousin 😂", "Anxiety issues are often lifelong according to my vet.\n\nI’ve got a dog with separation anxiety, I got her at 4 months and she’s been with me for 3 years now. I spent months trying to train her to not have separation anxiety (including meds). She is better than she was, but there’s no way she would let me go to sleep with her outside the room. She would 100% pant and scratch and try to get through the door.\n\nSeparation anxiety is a tough one and is unlikely to be trained away.", "The dog doesn't sleep *with* me, he sleeps in my room, this is quite different to the dog sleeping in my bed (which agreed would not work with a child in my bed too).", "The possible dismissing was from the impression you gave trying to say the issues weren't really that bad, and that's made worse when you don't actually experience them the same way your b/f does (if at all). However I do think you coming here for an outside opinion means that you're not fully dismissing him, so that's a very good thing. \n\n>I accept that I am putting my dogs wellbeing above his currently\n\nAnd you are well within your right to do so. My comment was more about wondering why everyone is calling your b/f an AH (by their NTA judgement) when I still haven't seen a single comment actually explaining why he is one. Anyone wanting decent sleep is not only perfectly reasonable but should be expected. \n\nYou definitely should have a conversation and compromise, if he isn't willing to compromise then *that* would make him an AH. But keep in mind people do sleep differently - just because some people can sleep with earplugs doesn't mean everyone can, and honestly even if I could sleep with earplugs I wouldn't want to sleep with them long-term. I think everyone needs to be comfortable, and that might end up meaning you're not compatible sleepers.", "Where does OP mention that \"he's not at all considering how this impacts the dog's health\" or anything similar? I think you've made that assumption based on \n\n>He hates having the dog in the bedroom\n\nbut that is in no way the same thing at all - he hates the noise, NOT the pet. And OP has even mentioned in another comment that he loves her dog and she jokingly suspects the dog loves him more than her. It would be ridiculous for me to equate a mother hating the noise from having her own baby in her bedroom with her \"not at all considering how it impacts her baby's health\" (rephrasing your comment). Yet that's what you're trying to do.\n\nIt certainly is possible he is prioritizing his own health over the dog's, as many people might, but for you to assume he has \"not at all\" considered the dog is awfully naive. Ultimately this requires some compromise, but calling him an AH for something that OP hasn't even mentioned of him is pretty ridiculous.", "For the dog? Not sure if he'd love a blanket on him all night haha but I do own a human weighted blanket (just never used it) so could try that and see!", "You can download an app on your phone(free) with lots of different sounds. I use the sleep sounds app to help drown out my husbands snoring(earplugs too).", "Good luck! Hope it work out.", "I don’t get that solution at all either. \n\nOuch-they are SO big. They just kind of  muffle some sounds but actually amplify others. They pop out unless they are practically jammed down to the ear drum. \nEar wax gets impacted. Fluid doesn’t drain.", "Yes, we've worked with trainers on the separation anxiety, and it is ten million times better than it was before but it will never fully go away, he was sadly very badly treated before he came to me and these things stick. He still hates big vans for some reason, but will walk past one *carefully* if I'm there, knowing the big van isn't going to hurt him.", "Appreciate the follow up. I think I'll suggest a white noise machine over earplugs as a starter, because like you said not everyone wants to sleep with earplugs, but I'll mention them as an option and see if he's open to at least trying one or both options and go from there. Not sure how open he will be to the ideas but I do want to try and find something that works for all of us.\n\nI don't personally think he's an AH, but I do think that he knew the dog was part of the \"package\" so we need to figure something out if this is going to work long term.\n\nI'll update on how the conversation goes!", "Because he still wants the dog to sleep out on the landing despite it negatively impacting the dog's health. Not sure how it gets any clearer than that.\n\nOr his girlfriend's health for that matter, since it's ruining her sleep too.\n\nHe can hate the noise all he wants, but that's why a separate sleeping situation would be ideal, then all three of them get their sleep.", "You also mention your dog is large: that can make a difference. My dogs have always slept in another room.", "Haha! Human blanket. My dog actually moves less than I do.", "My friend actually got his dog a weighted blanket, poor guy was abused badly prior to him adopting him and used to wake up panicking when he was dozing off. Dog is a massive newfie cross and loves his weighted blankie, though he already insisted on sleeping tucked in under the covers spooning my friend so he was already used to blankets. He is scared of thunder and brings the blankie to whoever is nearby when it storms to tuck him in with, I almost cried when he did it to me, he's the sweetest giant boy.", "NTA Pick the dog. He was there first. Its his home. Boyfriend is an occasional houseguest. He doesn't get to dictate how your home is run.\n\nIf you all ever decide to move in together and go 1/2 and 1/2, you will have to find another way to compromise, do something different to figure that out. But not now.", "NTA", "Let the bf sleep on the landing. Dog was there first. I would really reconsider this relationship if this person could be such a dick towards an animal.  Animals are so much better than people!", "NTA boyfriend can get earplugs or stay at his own place", "NTA. Keep the dog, lose the BF.\n\nYWBTA if you continue to let your BF dictate where your dog sleeps in your home.", "NAH. Your bf is entitled to not want to share the room with the dog. You are reasonable to want the dog in the room (and a bit TA for giving in at all). This probably does make you incompatible, so giving in a few times gave mixed messages.", "NTA.\n\nEarplugs exist.", "Nta. Your bf isn't compatible with yiur house.\nSo send him home at the end of the evening. I wouldn't hive up or kick my dog out of my room for any guy.", "NTA, but almost any behavior can be trained out/into a dog. Be consistent and your dog will learn where his new sleeping spot is.\n\nEveryone is saying the dogs are family, need to keep in mind that dogs are not people, and you need to treat them like dogs. In the sense you need to understand canine behavior and dogs can be trained. \n\nIt sounds like your BF likes the dog, so that’s a win,  I think doggie sleeping in the hallway is an acceptable compromise.", "NTA\n\n\nGet a noise machine or play sleep music to drown out the dog snores.", "One of them has to go, and we all know which one. Or he can belt up and accept the dog was there first.", "Your boyfriend is the AH.", "NTA - Time to rehome the boyfriend", "NTA. Find a new boyfriend if he suggests it again - he has THE answer from you. Especially with a rescue (my girl Molli is a rescue as well), they have additional needs. The bf needs to either get used to it, get over it, or get out. Pretty simple.", "NTA. If your boyfriend doesn't like it, he can go sleep at home.\n\nYour dog was there before the bf. If he can't accept the dog, he's not the guy for you. I wouldn't stress out or upset a pet for anyone.", "NTA. One can often judge someone’s character based on how they treat animals. This in my mind is a bit of a red flag.", "NTA if your boyfriend can’t manage a dog in the room this is not someone you can have children with.", "NTA. He’s not even on the bed so why is there an issue?", "NTA but your BF likely has Misophonia, which I also have.\n\nCertain sounds literally spike your anger from 0-100 in an instant and it is genuinely horrible to live with.", "Find another man who loves the sound of an old dog snoring.  I have 6 rescue dogs and my mom said I'd never find a man to love dogs as much as I do.  Well it took almost 50 years but I found my husband who loves the snoring of my old dog at 3am plus the other 3 that sleep in the bed with us.\n\nKeep the dog in the bedroom and make the BF sleep on the landing. LOL", "Keep the dog in your room, make the BF sleep on the landing, or better yet, in his own bed, in his own apartment.  He sounds insufferable and entitled.", "Dog sleeps in bedroom, bf sleeps in landing. \n\nDoggoo was there first and he will always be best boy", "Dogs > People\n\nI'd never date anyone who didn't accept my animals in the same capacity I do.", "NTA. Dog first. Man second or third. \nDog was there first and will give you unconditional love. Man....... ???", "NTA. Get rid of the bf and get one who likes animals.", "My dogs sleep in my room, one on the bed and one in her own bed next to me. It's not negotiable. Get the bf  earplugs or give him the spare room, pupper was there first.", "NTA\n\nBF is coming into your space and should have some respect for your house rules. I wouldn't dream of entering into relationship and making demands like that. He knew what he was letting himself in for.\n\nAs for a future with this guy and how a baby would affect that...yeah it would. A baby generally sleeps in a cot (crib) in parents room for a few months. They wake, frequently through the night for feeds, changes and a cuddle. How will he cope with a screaming baby if he can't handle a dog rolling over in its sleep. Is he going to make you take baby elsewhere in the house so he can catch some Zs? Will he get up to offer feeds if you opt to bottle or combination feed? Yes this is hypothetical, but it's something to consider.\n\nOnly you can know for sure.\n\nBut he is defo the AH here. Not you :)", "Hahaha my dog is my best friend so I would more then likely tell a S.O to pound sand before making my dog sleep outside my room.", "Time for the boyfriend to go!!!!!!", "NTA - don't date people who don't like your dog.", "NTA.\n\nI've got rescue mutts, too. I would never make them suffer a stressful night to please a human being, especially not one who doesn't need to sleep there.", "NAH. Maybe try a white noise machine if he’s a light sleeper and doesn’t want to hear the dog moving around/snoring. It might take some getting used to, but white noise machines are awesome and effective if you need complete silence to sleep, like me.", ">I have been dating a wonderful guy (34M) for just over a year.\n\nSorry, but he ain't that wonderful if he's prepared to cause your dog anxiety and distress just because he's a 'light sleeper'. He is, however, a selfish asshole. You've been seeing him for just over a year - you are still in the 'honeymoon phase' of this relationship. This isn't likely to get better - it'll probably get worse.  \n\n> I have tried leaving dog outside the room but ended up letting him in because a) it's my house/dogs house and b) I just can't leave him stressed all night and c) it isn't fair to have him in some nights but not others, the dog doesn't understand.\n\nGood for you! Yes, it is Doggo's house too, and if \"Mr Wonderful\" can't take that on board then sucks to be him, I guess.\n\n>I'm seriously wondering if this can even work long-term if we can't even agree on where the dog sleeps. What if it was a baby in a crib? Are they a nuisance too?\n\nExactly! I know Reddit's default position in the majority of cases is 'Get a divorce!', 'Leave him/her!', 'Dump his/her ass!', etc., but you are already having (perfectly valid) doubts yourself.\n\nMy OH and I have a dog. She belonged to his son and son's (now ex) girlfriend. Son worked full time, gf would shut the dog in the kitchen when she was a puppy and go off with her friends all day. Dog has separation anxiety (understandably) and gets distressed if she thinks she's been left alone. She sleeps in our room, on a dog bed in a kids pop-up tent, because she feels safe in there. She used to sleep under the bed (her choice) until she got too big to get under it - she likes an enclosed space. Yes, the tent takes up a bit of space in the room, and it would be much easier for us if she would sleep on her bed downstairs, but she would be so unhappy if we tried to make her do that, so it's not even a consideration. We've even arraged our working hours around making sure she's never left alone, and if there's ever a time where one of us can't stay with her (e.g. hospital appointments), we will take her across town to my daughter or to an elderly friend so that she doesn't have to be left alone. Doggo is still anxious, but not to the point that she will injure herself trying to get out to find me or my OH (which would totally happen if she was left completely alone). She likes visiting both my daughter and my friend, but she is soooo relieved when we pick her up. \n\nAll the above rambling is just to say - you do what's best for you and Doggo, and if bf don't like it, tough shit, dude.\n\nNTA, totally, completely, 100%.", "Agreed. \n\nOP is NTA.  Does boyfriend not know that earplugs are a thing?", "That is not remotely odd. By the time a dog is six months old, they've already gone through at least one of their fear periods and are possibly starting the second. If they have poor experiences during those periods, their fears are reinforced and can result in lifelong anxieties. You can try to train this away later on, but the fact is that a dog's personality and emotional tendencies are mostly solidified in puppyhood.", "The boyfriend can either deal with it or sleep in the separate room at his place.", "[deleted]", "It sounds like it's just a sleep issue, not a dog issue.  I'm a light sleeper so I don't allow our cats or dog in my room while I'm sleeping.  But I also forced myself to learn to sleep with a quiet fan on in order to buffer some background household noise so I wouldn't wake up so easily.\n\nIf I had a dog with separation anxiety who was already accustomed to sleeping in my room there's no way I'd kick him out.  I'd figure out how to fix my own sleep situation to make it work.\n\nTalk to your boyfriend when you two are in a good mood and it's not bedtime.  Tell him you care for him a lot.  He and you both love your dog and it's not healthy or fair to your dog to be kicked out. At the same time you recognize that your bf is a light sleeper so you'd like to brainstorm ideas together on how to help him sleep more soundly while still having your dog be able to sleep in his normal place.\n\nIf BF refuses to try any alternative solutions, he's not good partner potential.  A good partner has empathy, can compromise, and will work with you to solve problems.\n\nDon't put doggo out on the landing anymore.", "Exactly, she let the dog sleep on the landing a couple of times (and always let him in when he started panting). That's not training. Also, she ignores people who suggest training the dog but entertaines the idea of earplugs and white noise machines which can be uncomfortable for the boyfriend to sleep with. Unfortunately, sleep is crutial for good health and it doesn't seem like she's taking her boyfriends well-being seriously, at least not as seriously as her dog's temporary uncomfort.", ">Just make sure to vacuum it before hahah\n\nYes hover it before your dog needs it again.", "Pugs also snore. I'm not sure that would help.", "Google and Alexa have a white noise option if you have one of those.  I use my Google one sometimes", "[deleted]", "Have you considered that earplugs aren’t very comfortable for many people? I’ve had noisy roommates before and tried them, but they would make my ears hurt and I would wake up because of that instead of noisy roommate. For me white noise / background music works like a charm. Everyone, doggie included, deserve a good nights rest. I am hoping they find a good solution that works for everyone, which might take trial and error and not be so obvious.", "🤣", "Ear plugs can be uncomfortable, and also make it difficult to hear one's alarm in the morning. A white noise app causes neither of those problems.", "I actually use a child’s weighted blanket for my dog because of her extreme anxiety from her abusive former owners. Your dog sounds a bit bigger than her (she’s only 70 lbs) but I’d suggest making sure the weight is appropriate for your dog’s size. Her blanket is about 10% of her body weight.", ">Because he still wants the dog to sleep out on the landing **despite** it negatively impacting the dog's health.\n\nYou're contradicting yourself now. Which is it, he's \"*not at all considering how this impacts the dog's health*\" as you claimed before, or he is actually considering that it does impact the dog but is making a decision *despite* that as you're claiming now? Those things are most certainly not equivalent. The only thing clear here is that you are making poor assumptions to make your argument sound better. \n\nYour first comment is the one I had a problem with, because you were ignorantly implying that the b/f completely disregarded the dog, when instead the more likely scenario was he knew about and did consider the dog that he also loved but came to the eventual conclusion to prioritize his own sleep. You're delusional if you really believe you're anywhere remotely \"clear\" with your arguments here. \n\nAnd when it comes to being an AH, if you're naive enough to ignore nuance and trying to imply that he is an AH for putting the dog's sleep or even her sleep at a lower priority: \n\n>Or his girlfriend's health for that matter, since it's ruining her sleep too.\n\nwhile judging OP NTA and saying she's not an AH when she is literally putting his sleep at a lower priority, you're just an outright hypocrite.", "NTA! Doggo was there before bf. He needs to get over it. I wouldn't be able to sleep if I kept my bedroom door shut. My youngest kitty would go nuts, and throw herself at the door.", "nta", "He doesn't love your dog, toss out the whole man 🤷🏻‍♀️", "NTA \n\nThe pup lives here, bf does not.  This would be a deal breaker for me.", "Get a sound machine. For like twenty bucks on Amazon, or wherever, you can get a small one that makes about forty difference sounds. White noise is your friend. Golfers used to wake me up at an obscene time on a Sunday morning. NTA", "NTA\n\n\nI wonder if your ex tells them he got dumped over a dog ...", "NTA\n\nDitch the dude; keep the dog.", "NTA. This is your dog’s house, not your boyfriend’s.", "NAH. Maybe try a noise machine for the bf and incrementally moving the dog bed for the dog. Anxious dogs are common so there is probably some profess guidance on how exactly to do it.", "NTA. Why can’t bf just go home? Why is is so important for him to alter your routine instead of finding his own solutions? If he’s never had a dog it’s on you to show him how that relationship functions AKA consistency is more important for a rescue in its own home that whatever a guest demands. He wants in Your bed then he better appreciate Your hospitality.", "NTA If the dog out of the bedroom is keeping you up and stressing you out, that takes precedence over the occasional snore that might disturb bf.\n\nAnd that's beside the fact that bf is a guest and his preferences aren't more important than your dog's well being in its own home.", " NTA at all, and I wonder if his complaints about the dog making noise are more about him just generally not liking your dog. You probably make noises when you sleep, too! He should wear earplugs if he’s that sensitive.", "I’d offer the landing the boyfriend.", "NTA. Rescue dogs sometimes need a little more assurance. What if y'all move in together? Is he going to push you to re-home your dog?", "I say NAH, leaning towards NTA.\n\nMy cat just turned 10 a few days ago. He's allowed wherever he wants, and allowed to sleep wherever. I don't think I'd be able to suddenly kick him out of certain part(s) of our home just because my partner disagreed with me.\n\nThankfully, he loves me cat just as much, and cat loves him, too. The three of us have lived together for 8 years.", "NTA. Tell your boyfriend three words: \" invest in earplugs.\" They work wonders.", "NTA. Dog was here first. \n\nI bet your BF occasionally moves or snores during the night. Perhaps he should be banished to the landing/hallway.", "Came here to suggest earplugs…. They’re cheap and they work.", "Maybe try getting a white noise machine/program before ditching the boyfriend though.", "Yes, or melatonin? NTA.", "Melatonin made me suicidal 🫠", "Thank you, the way you've laid this out is really constructive I'll definitely be stealing some of these phrases during our chat (probably end of this week). \n\nDoggo is currently snuggled on his bed in the lounge while I do some work, he's a happy boy 💜", ">My commitment is to the dog, you are right. I adopted him and made a commitment to him to give him the best possible life. \n\nGood for you! ❤", "Aww.  Give the happy boy an ear rub from me on your next break.   My good boy is sleeping on the couch.", "[dog tax delivered](https://ibb.co/K2mgLZq) ❤️❤️", "Thanks for the tip u/HowlingOperatic\n\nHe's about 130/132lbs so almost double your girl haha", "Ah, so you can't make real arguments, but need to argue so you do it semantically. Everybody else understood bud. Sorry you couldn't.\n\nP.S. He doesn't live there. It's not hypocrisy, he can just go sleep at home.", "I love him already, and want him. \n\nNTA OP, my partner is a fairly light sleeper and I was a notorious TV sleeper, he didn't so much struggle with the sound as I always put it on low enough you could drown it out, but the light always woke him up, we compromised and I have a little app on my phone next to my pillow that plays raining sounds next to me, it took awhile but I sleep with that now instead of the TV being on. \n\nThink your BF just needs to suck it up.", "D'aww! Cutie pie.", "So beautiful!", "A very big boy! You probably could use an adult’s blanket then.", "Gonna need that dog tax on this combo please!"]}