{"id": 13974, "submission_id": "12biqcg", "title": "AITA for telling my girlfriend that I told her so after one of her male friends tried to get with her?", "selftext": "My girlfriend and I have been together for about a year now. My girlfriend has more than a few guy friends, and I'm not one of those guys that thinks men and women can't be friends. However, with 2 of these guys, it's very clear that they want more than just friendship from her.  Like clear as day to the point where I don't get how she doesn't see it. If I can notice just by the weird energy they try to exude when I'm present, she should  be able to get too right? Wrong.\n\nAny time I have pointed this out, she gets upset with me. She tells me that I am being jealous and reading into things, that aren't there. I argue back that I'm just letting her know and as a guy, I can probably tell much better than she can since women tend to be a little slow regarding things like this. So 2 nights ago night, she was hanging out with her friends and this guy was present. From what she told me, they were all drinking and he said some things that implied he'd want to be with her. She was made uncomfortable by this and the night ended shortly after.\n\nFast forward to yesterday morning. She got a series of texts apologizing for what he said, and then backpedaling and saying he would treat her so much better than me and she's wasting her time with me. She of course said no and was upset with him. After she told me, I just read the texts and simply said, \"Wow who could've seen this coming\" a bit sarcastically. \n\nThis set her off and she got mad. She said that I was being such a huge asshole to her and she had no way of seeing this coming. She's been pissed at me since.\n\n AITA?", "created_utc": 1680613865, "permalink": "/r/AmItheAsshole/comments/12biqcg/aita_for_telling_my_girlfriend_that_i_told_her_so/", "score": 257, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole because this very clearly upset her. I get that sarcasm when someone is already a little upset has a chance of making it worse but I was just trying to be funny, however she viewed this as me kicking her when she was down\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "\"I told you so\" is rarely expressed in an attractive way.", "> I'm just letting her know and as a guy, I can probably tell much better than she can since women tend to be a little slow regarding things like this\n\nWow, as a woman this was extremely revelatory. Now I know that whenever I need to determine if something a man says to me is just a sincere, harmless compliment vs. him subtly hitting on me, I can just ask someone with a faster man brain to help me out. Yay! I learned something today!\n\nYTA", "YTA\nSo someone made your GF uncomfortable, overstepped boundarys, she did everything right, told him to get lost, and instead of comforting her and make sure she ist okay, you scold her? Are you insane?\nShe lost a friend and was harrassed, and you tell her she deserved it? \nHuge AH.", "I was on your side until I read \"I can probably tell much better than she can since women tend to be a little slow regarding things like this.\" And then I read more that showed you should have been supportive of her and not an AH towards her. So yes, YTA.", "YTA,   \nYour reactions like *\"Wow who could've seen this coming\"* and  *\"I can probably tell much better than she can since women tend to be a little slow regarding things like this.\"*  wasn't appropriate, in fact, its childish, and this is how you break apart her bond with you. You need to support your partner, not put them down.   \nBe aware of what you are saying, and what you are trying to say, and how it affects other people.", "YTA\n\nIt’s a big betrayal when this happens. It sucks to realize you care about someone as a friend and they’ve not only had ulterior motives, but are actively willing to assert that you don’t know your own mind and have chosen the wrong boyfriend. She likely assured herself this wasn’t the case in her own way, and he either hid it well or she’s just learning more about this dynamic and was fooled. She’s likely feeling very hurt, stupid, and betrayed, and the appropriate response in the moment was to comfort her. Later, if you must, you can offer some ways you think it was given away but you needed to separate your resentment towards him from her experience of a loss of a friend. You failed to support her and you owe her an apology. \n\nAlso if you said the “girls are slower” thing no wonder she didn’t take your word for it. That’s insulting and inaccurate. What is accurate is that he likely behaves differently when you’re around and you clearly didn’t like him so it’s easy to chalk it up to an interpersonal thing. Eg, my friend doesn’t like my boyfriend, not that my friend doesn’t like that I *have* a boyfriend.", "NTA but C'mon man, there was no need to gloat. She's probably also sad that someone she thought of as a friend disrespected her relationship and basically only wanted to hang around with her just to date her.", "YTA - for your jackass condescending attitude about this. \n\nYou’re not even seeing that your girlfriend was honest with you, talked about it with you, clearly chose you over that person. She could have easily not said anything but she’s coming to you, as a partner, and you’re here stomping around like an ass because you were right. That’s what was most important to you. \n\nI wouldn’t be surprised if she doesn’t come to you with things like this anymore because of how you made her feel.", "YTA\nNo one likes 'I told you so'\nIt isn't a helpful comment to make.", "I’m going to go with YTA for A) saying that girls are a bit slow and B) for gloating.   Your gf was likely really hurt by the way her friend acted and you rubbed salt into the wound.", "I'm not sure theres any assholes here.\n\nAs a girl with a lot of guy friends where one of them ends crushing on us: its uncomfortable. It sucks that we end up in this spot where we see we can't even have a good friendship with someone where it is just that, a friendship.\n\nHeres where you could be TA: you're rubbing it in, for some reason? Yeah you saw it coming, she most likely did too, dont be that naive. But what was she gonna do? Imply right away she wasn't interested? Stop talking to him? That just sets up a weird mood and ruins what could actually be a friendship once the people involved realize they should back off. Besides if its a set group of friends it would just make it very awkward overall.\n\nShe's your gf. Support her. That easy.", "YTA , You're just gloating about being right , rather than appreciating the fact she's turned the guy down in favor of you.", "Yta and the fact that you can’t tell shows that the only one slow here is you.", "YTA.\n\nYou didn't have to kick her while she was down.  If you had to say *something*, if you just couldn't stop yourself, it could have been more like \"I'm so sorry, that's why I tried to warn you\" instead of sarcastic mockery.", "NTA. But rubbing her nose in it is counterproductive. Perhaps sit down and have an adult talk?", "YTA\n\nAny adult who says \"I told you so\" or any variation of that is an asshole 90% of the time. Those comments are only made to hurt to other person. Grow up.", "YTA, it feels like you care more about making sure she feels stupid and wrong than you care about forging a positive path for the future when you approach it this way.", "YTA. It’s disappointing and hurtful to find out someone you thought was a friend had an agenda. It probably made her feel objectified and question her other friendships. Don’t be a jerk about it. You’re kicking someone when they’re down.", "YTA, yeah you might be right, but all you’re doing is making them feel like a fool when they’re already upset. It’s not helpful and just makes you appear like a know-it-all. What exactly was the intent of your comment? To make them laugh or to make them feel stupid? \n\nI joke about pretty much everything with my partner but if it was a serious situation I would still bite my tongue rather than say “I told you so”. Just opens the door for them to say it back to you one day. Swallow your comment and give them a shoulder to cry on instead imo.", "bro u are NTA these ppl here lying.", "YTA.  \n\n\nThe only thing worse than a sore loser is a sore winner.", "YTA for how you approached this. Your gf didn't want to lose someone she thought was a good friend because he only had romantic feelings. It's a rough go for anyone.\n\nYou weren't wrong (except you were wrong to attribute being \"slow\" to wanting to be accepted as a friend and person. Sexist without actually thinking about the reasons why women ignore certain behaviors) but you were an AH. Not the time for an \"I told you so\"", "NTA, but it may be worth it to sit her down and tell her that you say these things to give her a heads up not because you're jealous. Explain that it's frustrating that you're trying to look out for her and being dismissed only to watch it happen and have her act like it was unavoidable or unforeseeable. Tell her you're sorry if your delivery made her feel stupid but you would appreciate if she took your advice into account in the future.", "So you have a girlfriend who is not only showing you she is outright loyal to you, but is also oblivious to the passive advance of other guys.\n\nMost fellows would consider this a boon. I’m not quite comprehending your issue - you’d rather she pick up on it, exclude them from her life maybe? That’s a stretch of an ask from a partner already showing you, quite literally, that her only interest is you.\n\nYTA", "NTA. You knew this was coming and she got angry when you tried to warn her. For all the people calling OP the AH, how can OP let her know what he sees? OP has already said he can't believe she doesn't see what is front of her, and when it happens she is still blindsided. I think gf was angry at herself but the sarcasm made it easy to turn it on OP. It's gonna happen again with guy #2 and the cycle is gonna repeat. So how does OP prevent it if she won't believe him?", "I don't understand all the Y-T-A votes. If the genders were reversed we'd be calling the female OP N-T-A. At best this is an ESH, mainly because OP was sarcastic.", "NTA your attitude isn’t great but you are correct in this instance. I’d be worried your gf secretly likes it though. Is she really that clueless? Or does she like the attention?", "ESH. She should have taken your observations more into consideration but you shouldn’t be gloating either. She just lost one of her best guy friends", "YTA but a small one. You usually wait until after she's gotten over it to say that so it comes off more as a joke rather than rubbing salt in a wound. She's still wrapping her head around the fact that her friend wasn't a friend at all", "NTA - The cheek of her to say no way to see it coming when you had repeatedly done so and warned her.", "NTA\n\nIf she doesn't block this guy immediately and stop hanging out with him after he's made his intentions known **and** told her to dump you for him, then you need to leave her.  She doesn't respect you.", "NTA she's being intentionally obtuse", "YTA - Dude, your gf just lost someone she thought was a friend and you are making her feel worse! It's not time for \"I told you so!\"  Be a good bf and support her. Grow the f up!", "YTA. One of her friends just possibly ruined their friendship -  and let me tell you, it's heartbreaking to learn that one of your friends didn't actually value your friendship - and instead of being sympathetic and supportive, you decided to jump to \"told you so\". \n\nYou may be better at telling when a guy is just interested in a woman for sex, but you obviously don't understand how it feels to be the woman in that scenario. You think someone values you as a person, but really they're just being nice to try to find a way into your pants? It sucks. It hurts. So why would you make the conscious decision to add to that pain?", "YTA.\n\nYour gf is dealing with someone who she thought was a friend making inappropriate advances at her. This can feel like a violation and a betrayal. A loving boyfriend would understand she is now struggling with everything she thought about her friendship with this person, struggling with how to trust and believe people, and how to navigate that friendship going forward. And here you are giving an \"I told you so\" rather than being empathetic. \n\nYTA the also just for how you talk about her not seeing it and saying women are slow. No. Maybe we just are able to view relationships beyond sex so give people the benefit of the doubt. \n\nDo you even like or respect your girlfriend? Honestly?", " *I argue back that I'm just letting her know and as a guy, I can probably tell much better than she can since women tend to be a little slow regarding things like this.*\n\nI guess the other guy was right when he texted :\n\n*he would treat her so much better than me and she's wasting her time with me.*\n\nYTA", "I *think* what you meant to say was ‘it’s often easier for an outsider to spot these things’ rather that tell all women that men know better.\n\nYou were doing the ‘I told you so’ which is never a good look.\n\nYTA", "NTA but I was literally laughing out loud at your post. I have friends and had partners like this. It is frustrating in a harmless way.", "Lol, no. NTA.\n\nI get it from you - it's such an eye-roll moment. However, some people don't like sarcasm much and it seems unnecessary to fall out over it. Sit her down and explain the red flags you saw (not just \"I knew\". Things like \"he got too close to you\" or \"his comments were inappropriate\") and tell her your point of view. If she refuses to see this, then she's in denial and I would GTFO.", "NTA. Most people are saying YTA for the “wow who could’ve seen this coming”, but the fact is that you were RIGHT, and nowhere in your story did she affirm that you had been right all along. If she had said “OP you were right, and I shouldn’t have dismissed your perspective so quickly”, you probably wouldn’t have felt any need to say “I told you so”. What’s most important now is that you both work together so that in the future, you are playing on the same team, instead of “me vs her”", "YTA for rubbing it in her face. But I would be questioning my relationship if my partner continued a friendship with someone that hit on them. That’s not a friend, that’s someone hovering and waiting for a chance to get with them.", "ESH. She shouldn’t have called you jealous and you shouldn’t gloat.", "Shocking to some but I'm going with NTA, though your comment about knowing better than her would irk any woman so chill with that crap.  The fact is that you could clearly see something that she was in denial about and then when it happened you brought it to her attention that you've warned her several times and all she could do was get mad - she got mad because she knew you were right.   I've tried to be friends with guys before and have been in denial about how they feel about me until it eventually comes out… it really sucks and as a woman you don't want to admit that someone that you care about as a friend could just be hanging around just to get in your pants but it is a sad fact.  It's also a fact that some women actually like this kind of attention and prefer to not cut them off because they enjoy being admired. So I wonder if your girlfriend was really that oblivious, or if she knew all along and chose to ignore it until confronted with the situation. In any case, not the asshole.\n\nEdited to add: some of your responses make you an asshole though.  Geez dude...", "YTA Yes, you warned her. When someone you care about doesn't listen to you, the last thing they want to hear is \"I told you so\". You were  sarcastic and rude when one of her friends let her down. You should have been supportive, and that makes you the asshole. You owe her an apology - a heartfelt one.\n\nAnd everyone around you wants you to stop generalizing about women and men because whether your plumbing is indoor or outdoor doesn't affect your your ability to trust friends.", "ESH I get where you come from but it's useless to comment more on this at this point so yeah just don't comment about it, she was upset with him that should be enough for you", "YTA for not appreciating the fact that she wanted to be with *you*, defended *you* to the guy hitting on her, only to have *you* rub her nose in her mistake in the end. \n\nDude, you handled this badly. Don't be surprised if she ends up with the other guy after all.", "YTA, you sound just as bad or even worse than this guy.", "YTA. She just lost a friend. And not because she did anything wrong, but because he led her to believe that he was interested in a platonic relationship, and she believed him. Not her fault. Be more sensitive.", "YTA. \n\nKnowledge is knowing this guy friend wants your girl. \n\nWisdom is knowing not to harp on about this fact with your girl.", "YTA - sure your hunch was correct but the fact that your gf is uncomfortable and essentially just lost a friendship, your concerned that you were right and she was wrong? Like dude your girl is loyal AND transparent, what more could you possibly want?", "NTA", "I stopped reading after ‘women tend to be a bit slow regarding things like this’ and I bet she did too", "So OP, NTA but as a guy, i would like to give you some advice on this situation DM me.", "YTA. Women are often put in the unfortunate position of believing something reasonable- that people view them as humans and not just sex objects- and it's really painful to find out that someone you trusted as a friend was looking for a chance to hit all along. It's a real AH move to push the blame back onto her while she's dealing with a friend that betrayed her trust. \nIt's not a matter of being slow, it's a matter of perception. Some men get way ahead of themselves over simple things. A girl remembers something they said from a previous conversation- \"damn, that must mean she wants to date me.\" A girl compliments a well put-together outfit- \"that means she wants to f*ck.\" Some men read really deeply into these simple, small talk level kindnesses and take them really personally. Woman, on the other hand, seem to be more comfortable giving and receiving compliments and just paying general attention to another person in a conversation. So women tend to think behavior like this is normal, friendly banter and not realize that the guy can't take simple kindness without building up a fantasy in his mind. \nYou should be supporting her, and mourning with her that she lost a friend instead of shoving it in her face that her \"friend\" was just waiting for an opportunity to transcend the \"friend zone.\"", "Wow, \"women tend to be a little slow regarding things like this,\" really?  I hope your not listening to that Tate asshole.", "YTA. It was a childish response, you probably could have just been comforting. She felt betrayed by who she thought was a friend and then her ridiculed her.", "NTA OP. While saying \"women tend to be a bit slow\" was just a horrendous way of saying that as a straight male, you can identify with other straight males better than she can, I really dunno how else you were supposed to react here. You tried to warn you, she brushes you off. Honestly, a single sarcastic phrase when the inevitable happens isn't out of line. If you rubbed it in her face for weeks, then you'd be the asshole.\n\nFolks in this thread, lesson to learn here: if you ignore someone's justified warnings and this happens, suck it up, accept the sarcastic comment, and eat the crow that you served yourself.", "NTA.\n\nYou had a gut feeling, were honest about it with her, let her know, and she should have honored that instead of still engaging.\n\nMy wife was flirted with by a married man a few weeks ago.  After a family member's funeral!  25 years older than she is.  It was pretty damn obvious to me, and I'm not a jealous type.  I trust her, but did mention what I saw later.\n\nSometimes all you can do is say what you think.  And trust your partner.  Or not.\n\nBut I think the issue here is you mentioned concerns, and she accepted texts trashing you anyway.", "This is a lose-lose situation.  You feel like you're not being heard when you are voicing your concerns and she thinks your victim blaming.", "NTA - you warned her, she disregarded your concerns, then it happened, and she was mad you were right lol. Your gf is dense fr tho.", "NTA\n\nShe could see it coming if she would've just had an open mind and realized that out of all her male friends, you were only concerned with one. She was being prideful and it bit her in the ass. If you were this way with ALL of her male friends, I could understand. It seems though its just the two friends.", "Absolute NTA. People saying YTA clearly love to jump on the sexist bandwagon. You as a guy will obviously be more familiar to the ways of guys. Your gf clearly can't handle being in the wrong. She could have avoided all this if she had listened to you. Don't get dispirited OP", "YTA for the generally attitude and sounding condescending. You’re not the asshole for saying anything I told you so after you warned her continually and she dismissed your concerns. I’m sure if she said something about one of your female friends and something happened it’d play out the same way.", "I didn't even read your post, but no, NTA.", "NTA. You told her, she refused to listen, she learned the hard way. I would have had to say told you so too. Anyone giving her props for not cheating is being ridiculous. She's just mad that you warned her and you were right. Don't push the issue, it's over, now she just has to get over her pride and that her friendship wasn't what she thought it was.", "NTA, but be prepared for more of this in the future. Seems like she likes attention. Also, if I was in your position. I would make overt comments to her 'guy friends' along the lines of: \"If you get a significant other by encouraging them to leave their current partner, you deserve to lose them that same way.\"", "Nta if that's all you said to reading the text, if you kept it going then yta. A one liner like that is alright and kinda funny since you've told her repeatedly that that friend likes her. It's not like you got mad about the texts either.", "NAH", "NTA.", "NTA.  She walked right into an \" I told you so moment\". It is what it is. You're protecting yourself, looking out for her and the relationship and you were proven correct.. Just incredible that you're painted as a bad guy.  Random men that encroach on her relationship and try to manipulate their connection into something more are not what she should be protecting here. \n\nAnd that guy is not a friend, hopefully she doesn't need to you further hold her hand and explain that, because you're wasting your time with her if that's the case. \n\nI have women that I consider friends and while some may be objectively attractive, I have zero interest in banging them nor have I tried.. Wouldn't be much of a friend, now would I??? That would make me a snake in the grass.", "YTA..\n\nYour (hopefully soon-to-be ex) GF is dealing with two AH’S, her ”nice guy” friend and YOU..\n\nI hope she kicks the both of you to the curb for good…", "YTA \n\nThere is a big difference between a “this man is trying to manipulate you” and “your woman brain is too slow to pick this up.”", "I don't even have to read the responses to know the sexist verdict here.  People would be saying you are jealous and insecure if you tried to be more forthright initially.  Even though you weren't too insistent, trusted her, trusted them, but warned her, they will now be saying Y T A for your response afterwards.\n\nThey will have zero regard for your feelings, and they will sympathise with her. They will say, \"The poor girl has just learned that her awful male friend did a wrong thing and you should stand by her.\"  The subtext there will be that your feelings don't matter.", "ESH\n\nI know, don't be mad at me but imo the both suck.\n\nSo first of OP, u are horribly misogynistic with many of ur comments and u have really outdated views on how to handle normal relationship problems. No matter what is going on, how u are acting here and towards ur girlfriend is why ur an A.\n\nSecond ur girlfriend did not only ignore ur concerns but also broke multiple boundaries u tried to set up. Instead of listening or taking ur problems seriously she chose to ignore them and stayed ignorant of the friends feelings. Which is why I went ESH.\n\nIn general ur communication needs to get better, work on ur f\\*\\*\\*ed up views and try to be a better person. I hope u will do better and hopefully she will also listen in return.", "NTA.", "ESH. I would be frustrated if my partner was brushing me off like this too - unless of course I had a history of being needlessly jealous. But you were rude to her and women in general, and saying “I told you so” is never a good way to handle things.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy girlfriend and I have been together for about a year now. My girlfriend has more than a few guy friends, and I'm not one of those guys that thinks men and women can't be friends. However, with 2 of these guys, it's very clear that they want more than just friendship from her.  Like clear as day to the point where I don't get how she doesn't see it. If I can notice just by the weird energy they try to exude when I'm present, she should  be able to get too right? Wrong.\n\nAny time I have pointed this out, she gets upset with me. She tells me that I am being jealous and reading into things, that aren't there. I argue back that I'm just letting her know and as a guy, I can probably tell much better than she can since women tend to be a little slow regarding things like this. So 2 nights ago night, she was hanging out with her friends and this guy was present. From what she told me, they were all drinking and he said some things that implied he'd want to be with her. She was made uncomfortable by this and the night ended shortly after.\n\nFast forward to yesterday morning. She got a series of texts apologizing for what he said, and then backpedaling and saying he would treat her so much better than me and she's wasting her time with me. She of course said no and was upset with him. After she told me, I just read the texts and simply said, \"Wow who could've seen this coming\" a bit sarcastically. \n\nThis set her off and she got mad. She said that I was being such a huge asshole to her and she had no way of seeing this coming. She's been pissed at me since.\n\n AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA.", "Okay if you’d been more supportive and not on your high horse it would’ve been a N T A, but holy cow. YTA dude. I’ve been in enough relationships of hearing things like that for it just to be jealousy and there was nothing actually flirty with my friendships. Aside from that, how cruel is that for something to make her uncomfortable and for you to show no sympathy? I hope she sees this for what it is and gets out real fast. I can’t imagine something like this happening and to have no support from the person who supposedly loves me.", "I don't get the Y T A. The guy could read the cues, warned his GF repetitively,  she ignored him then, o shocker, what she was warned for happened. Women can read other women cues (I am a woman myself), men can do it as well. So yeah, in his position, I would be sarcastic as well. \nNTA", "My (now) wife was also oblivious to many men’s intentions towards her. She refused to acknowledge it all and thought I was seeing things! However, she was single for a short while before she and I got together and low and behold, all her great male friends suddenly declared their love for her! She was actually really upset by it all - she thought they were simply friends but what they actually biding their time and all they wanted was to get in her knickers. \n\nI too, at the time, said “I told you so” and it wasn’t until afterwards that I realized my error in this. She was sad and genuinely jaded by this and me rubbing it in her face just made it worse. \n\nSo, like me at the time, YTA, I’m afraid!", "YTA purely for the smugness. Whether you're actually right or not (speaking from experience, this is a lot more complicated than a gendered thing, and I'm inclined to say double YTA for making it a gendered thing) is completely irrelevant to whether you're an AH or not, what she needs right now is support and you are being the opposite of supportive.\n\nThis is not the time for an 'I told you so', not that that time exists in these kind of situations.", "I mean bro, sometimes girls just want to have male friends and it just be platonic.. especially when they turn out to have common interests. So want to give them the benefit of the doubt, despite knowing they could be wrong about his intentions. Regardless, she is upset that it is exactly what was feared and is probably also not happy to be losing a friend. While you're there like, \"I told you so,\" and calling women slow.\n\nWas this really worth gloating about?", "Sometimes you have to choose whether it’s more important to be right or more important to be happy. Here you chose that it was more important to be right than it was to be an empathetic, supportive boyfriend. YTA because your ego took precedent over your gf.", "Gonna go against the grain and say ESH. OP is obviously an asshole with that “women tend to be a bit slow with these things” bullshit. That’s sexist AF. But I also can’t entirely fault you for your sarcastic remark when you’ve pointed out to her multiple times about this specific person clearly having a thing for her. Reminds me of an old gf who would keep hanging out with a mutual coworker of ours. I’d tell her time and time again how he had an obvious thing for her but she insisted he didn’t. So they would hang out and drink. He would get handsy. She would push him away and come home crying about it. Around the 3rd time this happened I stopped being sympathetic and directly asked her how she didn’t realize this was going to happen. Like, at some point you just have to open your eyes and turn your brain on…", "YTA for being condescending and rude. Like I tell my children, sometimes it doesn't matter that what you said is correct. What matters is that what you said was mean.", "YTA \n\nSaying \"I told you so\" is not going to make your gf feel any better.\n\nAlso, it's a tad sexist to assume that women are slow on the uptake. In my experience, they tend to be better at picking up hints from men than men are from women. You just have an advantage in this case because you are a guy observing a guy and know how men's brains work.", "NTA but lose the sarcasm in general.", "NTA maybe your gf should take your advice about the other one", "Unpopular opinion: I think this is a little tricky to make a judgement on. I've been the woman blindsided by finding out a male friend liked me either by their revelation or via their change of behaviour once they stopped liking me. It hurts to know the friendship wasn't based on valued respect but on his thinking he could friendship his way into a relationship. I've also had male friends I've been careful with because I realised they would be interested if I was interested. And I've seen from the outside how it is when someone is like, *omg XX fancies me?* And it's like really? you were the only person in the world who didn't notice? \n\n\nWe don't know how obvious these guys were. If it was signals you only picked up because you're also a straight guy and they were only weird to you when she wasn't around. Or if it was that everyone except your gf picked up their crushes. If it was the second that I get why you rolled your eyes and were sarcastic. If it was the first than your gf is probably feeling really betrayed right now and your lack of support pushed her over the edge. I am voting NAH because without knowing the nuances of the situation, I can see both sides, it sounds like you're both having very human reactions to the situation. If I were warning my bf about his girl best friend for ages and then this happened, I would probably react how you did too.", "NTA you were right", "Nta", "Have you tried explaining this to her more slowly and with easier words? Her little girl brain may have a hard time understanding you.", "YTA \nAnd the way you talk about women? Right trash.", "NTA. Had a similar situation with my wife and her coworker. I knew he was interested in her, but trusted my wife to not cheat on me. He was her \"best friend\" and i didnt want my wife to think i would block her friendship. I was right, he wanted her. In fact he wanted her so much he tried to get her to go gome with him AT OUR WEDDING. She ended it and apologized for not seeing it.", "YTA. Truth is she'd be better off without the both of you.", "NTA and if you were a woman I know all that comments will be different..\nBut your little « I told you so » was too much, but nobody’s perfect", "NTA. If you switched the genders people would tell you that you arent an asshole. I feel like same sex and orientation people can judge others a little bit better with attraction. Still it ain’t cool that she was hanging out with them and diminishing your feelings. Maybe you could have been more supportive but at the same time if you’re telling her from a genuine place multiple times this person is trying to get with you and i am uncomfortable then I can understand why you said it sarcastically. \n\nI genuinely don’t understand the Y.T.A. comments.", "Imma say this as a woman...ESH\n\nYour girlfriend was a dummy for thinking this dude wasn't into her. I have never had a guy friend I was confident *wasn't* into me unless I knew very clearly they were gay.\n\nI have also never had a guy friend *who didn't end up coming onto me* at some point. \n\nSo I get the concern there and it's warranted.\n\nAt the same time...you suck cus of the way you talk about women.\n\nWomen aren't \"slow\" to recognize these things.\n\nYour girlfriend just is. \n\nShe may be naive and hasn't dealt with this before. She may be one of those people who give others the benefit of the doubt. She may be subconsciously craving that male attention that these dudes gave her by subtly hitting on her because *you* aren't providing that to her in yalls relationship.\n\nIt also makes sense that she would be highly reactive to you basically saying \"told you so\"- she just went thru a highly uncomfortable situation and likely lost a friend over it, even tho he never really was her friend. She still has a right to grieve that loss and she likely is PISSED AT HERSELF for not listening to you before.\n\nSo her anger at you is probably just projected anger at herself for falling for the charade.", "It’s always an asshole move to say “told you so” but the fact that you have opinions such as  \n>> women tend to be a little slow regarding things like this  \n\nnot only shows that you are an asshole, but a misogynistic one at that!", "YTA.  Her friendships are hers to manage.  When he made a move on her, she shut him down.  So she's managing just fine.  There's really nothing for you to object to.  It's not her responsibility to be sure that she's never around men who find her attractive or might want to date her.  When it became an issue, she dealt with it.", "NTA, you just made a remark after you alerted her correctly a lot about it. was a little tasteless but not terrible, people here are just pissed because you are a man as usual.", "I knew this was going to be a YTA when I read that sentence", "I think the point was that straight men are best placed to predict the feelings and intentions of other straight men. Just how women are best placed to understand how it feels be be a woman. Maybe it came out wrong in OP’s post but this shouldn’t really be controversial. \n\nIt’s also pretty wild that people are expecting this guy to be cool with his GF hanging out with some dude that was actively trying to break them up. Not much common sense on display tbh", "No, that's a double standard. Men CONSTANTLY hear from women that we're dense, never pick up hints, and don't recognize flirting, but the ONE TIME a man implies that women have the same trouble, it's misogynistic and he's sexist. And don't even pretend yall haven't heard this kind of language about men dozens of times. It stands out here because it's the opposite of the norm. Women are always allowed to criticize men as a whole, but a throwaway statement about men understanding other men better is sexist? Get out of here with that. Unless you also speak up when a woman says the same thing about men, which again happens all the time.", "Lol that line triggered this sub so hard. It doesn’t change anything in this scenario despite it making you dislike OP. He’s still NTA for sure", "That line was mysogonistic or w.e... but he wasn't wrong in this particular case with his gf. Js..", "As a man, couldn't agree more. That's why I feel like only men should make decisions about abortion and other women's healthcare. We're not biased because we don't have that equipment, so we know better.\n\n/s in case anyone needs it", "Yep. I feel for OP's girlfriend, who clearly has terrible taste in men, both as friends and boyfriends: her \"friends\" view her as a potential conquest, her boyfriend views her as a dummy. She can and should do better than all of these fools.   \n\n\nYTA, OP.", "I knew as soon as I read that line that someone would be all up in arms about it, instead of taking it for what it is, indicating that women don't pick up on this sort of thing, which is very much true. This subreddit is alone is FILLED with women who insist their guys friends just want to be friends, and then a very similar situation playing out as the one in this post. \n\nIt is the same as guys having zero clue when a woman is expressing interest in us, and being very slow to pick up on that.\n\nDon't get your knickers twisted, it's not an attack on the overall intelligence of women, jesus.", "I think you’re taking this as a sexist slight when it’s not. Many times men are completely oblivious to women being into them to the point where other women have to point it out. Often times, it’s that man’s SO who’ll point it out. The same can be said for who women who may be oblivious to certain may act around them signaling that they like them.", "This sentence alone pushed him into AH territory for me.", "I was going to say n\\_t\\_a because I dint see that sentence.\n\nYTA", "I disagree. I don’t like the term “slow,” but I’ve been in a very similar predicament and I just couldn’t see it, whereas my partner at the time could see it very clearly. He could see it because as a guy he noticed my friend doing things that he would do when he was attracted to someone. I also feel like I could see the same thing if a female friend was attracted to him. The big thing here is OP was RIGHT", "That line is what makes it YTA for me.", "GF put her self in this position after he repeatedly warned her that it would happen.  He said it was two guys in particular not all her male friends.  I mean I get pissed when I warn someone repeatedly about something, the ignore me, the thing that I warned them about happens and then they vent to me about it.  It’s frustrating as hell.", "But it's true though. Men know when other men are spitting game and not being sincere. He was right all along and his concerns and feelings were disregarded.", ">She’s likely feeling very hurt, stupid, and betrayed, and the appropriate response in the moment was to comfort her.\n\nI think this is a big part of her reaction.  She just lost a friend, in an ugly way.  And her boyfriend is gloating about it instead of acknowledging that she's dealing with something.  \n\nIt really hurts to realize your friend was only trying to get with you.  Hearing \"I told you so\" just feels like salt on the wound, because then you feel hurt AND stupid.  OP's timing was way off here.", "I mean, it was completely accurate in this case. \n\nAlso, in my experience men read men better and women read women better. OP is correct.\n\nThe comments on here are hilarious. If OP is an asshole for gloating then she is an asshole for calling him jealous.., and at least he was right in the end.\n\nEdit: also reading that entire comment again, and you could paraphrase the whole thing as ‘yes she is slower at reading his intentions, but..’ lol. How dare you call her slow at thing she is bad at.", "I agree NTA. The comment about not seeing it coming was pretty rude though and I think doesn't just apply to women but everyone in general. It sucks when you warn someone repeatedly and they brush it off but then get upset when said thing happens.", "\n> You’re not even seeing that your girlfriend was honest with you, talked about it with you, clearly chose you over that person. She could have easily not said anything but she’s coming to you, as a partner, and you’re here stomping around like an ass because you were right. That’s what was most important to you.\n\nWe’re giving out brownie points for the bare minimum in a monogamous relationship now? Jesus Christ this sub sets a low bar for women.", "Yep. YTA. Because that is an asinine reaction. \n\nA relationship needs to be a safe place to be wrong sometimes. So the gf was wrong about her friend’s intentions and OP was right. So what? She should hire the Minority Report pre-cogs to give the ok for friends? \n\nHer behavior didn’t need any modification. The guy friend’s did. And OP’s did. God, the guys she knows kinda suck.", "If I had a female friend I knew liked me I would stop talking to her out of respect for my girlfriend...", "So I should be groveling on hands and knees because she didn't cheat on me?\n\nI'm fully appreciative to be with her, but come on, I warned her about him", "Let's be honest he's an ass for the I told you so. \n\nIn his defense he told her about him before it happened. She didn't trust his judgement on this person because they were such good friends. He wasn't jealous when he brought it up and didn't belabor the point. \n\nIf you trust your partner you should take things like this seriously when they say it. She didn't reevaluate the relationship with the friend and got hurt.", "Please don't do this. This is incredibly condescending and patronizing. She's an adult and is perfectly capable of managing her own life and friendships. This will just piss her off even more.", "Yup", "He can be right but still be an asshole", "How is it misogynistic? If OP was female and she pointed out how her boyfriend's female friends wanted him, saying that as a girl she can tell when girls are interested in guys, but he couldn't see it until one of them made a move on her, no one would call her a misandrist.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Same. I could’ve stopped reading there", "[deleted]", "Gf shouldn't be still talking to this dude after what happened of course.\n\nBut I feel like the sentiment is the issue. He should not condescending towards his partner. Yes, my partner does tend to read things better than me. (Not because of gender, I'm just autistic and can't tell social cues.) But at no point is it okay for him to treat me like I'm dumb for not picking up on something.\n\nOP could have made a comment and been like hey he's into you. But to make a comment about how she's slow? Like it doesn't really matter the intentions imo", "Yea I don't get the vitrol, men tend to be better at reading men while women reading women. I had a similar song and dance with my best friend who never believed me when I told her some guy we met at a party will probably confess to her in a month or so.\n\nLikewise she's told me some girl at a party wanted me to go and talk to her and I would have never noticed the cues because I'm a complete moron. \n\nThis feels like the sub kinda looking for reasons to be upset.", "Seriously though. My boyfriend was doing landscape work for a business and one of the servers/cashiers came out to chat up the crew a little bit before opening and she commented on his beautiful hair(it really is a nice head of hair) then ran her fingers through it. I’m like yeah bud you gotta nip that right now because she’s coming on to you. He said no she was just being nice and she is engaged. I asked how many of the other guys hair did she run her fingers through. He of course said none. Lo and behold about a time or two after them being back at this site she tells him her fiancé is treating her horribly, asking if he would help her get back at him. \nHe called me on his lunch break and said I think you’re right. \nDuh bud, I know how women play because I am a woman. I would expect him to call it out if he saw a man feeling any type of way about me that I wasn’t expecting or whatever", "It just feels like callous speech to me (read: phrased in a way the internet doesn’t like). It’s not wrong; both sexes tend to be pretty bad at catching on when the other is interested", "Why? It’s true lol. Same way men are terrible at catching on when women are interested.", "“She put herself in this situation by trusting someone who was her friend, despite being warned to not trust her friends” I’d hate to have you around if something more severe had happened!", "Absolutely. Its incredibly frustrating to point something out that is going to happen over and over and nobody listens and then it does happen. Like don't come crying to me!", "Women know too. It's just what are you gonna do, not be friends with any men because one might want to sleep with you?\n\nSo many men in my life would be down to sleep with me. Maybe even date me. I'm great, I'm hot, I'm not going to hold that against them. It's their response to my boundaries which matters.", "Ok great, that's one point to him then. Still not how to support your partner when they're hurt though", "Really? Why is it that men can never tell when their friends are total creeps then?\n\nIt's always \"I never would have expected that from him\" when the mask comes off even though every girl could tell after spending thirty seconds in his presence.", "I understand BOTH sides. I think BF just messed up the phrasing but he is 100% correct. Just get rid of that attitude is all. I think it's ESH. \n\nBF said, \"GF, he is clearly not a friend.\"\n\nGF said, \"Yes he is. You're jealous and projecting.\"\n\nIt happens. \n\nBF said, \"I told you he wasn't a friend.\"\n\nGF angry for 3 things at once:\n\n* losing what she thought was a friend \n\n* BF not supporting her \n\nAND \n\n* BF being 100% correct. \n\nI have been the guy friend, not a boyfriend, trying to say similar things to my female friends and most of the time it ends up like this. I lived with 4 girls off campus in a house 5. From BF perspective, you can only point out something so many times before feeling like the person you are warning is insane or stupid. I ended up saying the same thing to many of my friends that did not listen to me. I tried to be objective about it as possible, not feelings. Like the person literally sits up straighter when you are near; they are leaning into you or your direction whenever conversing; they are attempting to be right next to you at all times; they have a million different reasons for touching you or caressing your arm, etc. etc.\n\nI wholeheartedly admit I said stuff like, \"I pointed out the signs as much as I could,\" etc. Basically the same thing as OP, but not as harsh.", "It also hurts to be called jealous when you point out that someone is obviously into your gf.\n\nBasically he can’t tell her before or after, or ever.", ">If OP is an asshole for gloating\n\nHe is. And that's what he was asking", "That's not the case here, though, is it?\n\nIf you had a female friend you didn't believe liked you -- but your girlfriend emphatically believed *did* like you. That would be an equivalent situation. Would you drop a female friend that you believe is perfectly innocent, simply because your girlfriend said to?\n\nAnd be careful here -- because there are only two options here, based on the context:\n\n>Yes, I am a bad friend.\n\nor \n\n>No, I am a hypocrite", "Why? How is it disrespectful to your gf if it's not mutual? You might have to have a sit down with the friend, and if the friend pursuits anything, or acts strangely/negatively to your gf that would be wrong. And if they wouldn't drop it, like this guy, sure it would end the friendship.\n\nBut before that point?", "It's 2023. Your gf is with you and continuously chooses you over anyone else. You acting like she doesn't have the right to have male friends who might potentially have feelings for her despite not being mutual, is a red flag.", "I think there's no need to add insult to injury. Don't make a big deal about that and just say you are sorry for that guy hitting on her 🤷🏻‍♂️", "No, I didn't say you should be grovelling to her. Just don't be so smug about being right.", "Someone never learnt how to be a gracious winner as a child.\n\nNo-one mentioned grovelling, what a weird jump to make.", "if you always need to be right then it's going to cause problems - you could have just made sure she was ok", ">So I should be groveling on hands and knees because she didn't cheat on me?\n\nNobody said that.\n\nBut this would have been a nice time to say \"I'm sorry that he used your friendship to hit on you. I suspected it but I'm sorry to be right because he put you in such an uncomfortable position\".\n\nYou could try being supportive rather than gloating.", "Is it really one or the other? No. You’re going to the opposite side of the spectrum to try to make your reaction look better. You couldn’t just support her and say that it’s crappy that her friend said all that stuff and just leave it at that.", "You learned a lesson today: People cannot be told things they don't want to hear and if you taunt them when they finally see it they will be angry with you.\n\nGet used to it and learn to let your partners make their own judgement calls.\n\nYTA, obviously.", "Have some fucking sympathy.  It's hard to learn as a woman that there are plenty of men out there who will fake treating you like a grown adult and peer when they really just see you as a potential fleshlight.  It's a betrayal, and it's dehumanizing.\n\nYou were correct about the intentions of those assholes, but you gloated like an asshole yourself.  YTA", "I think you should, you sound like a pric and every woman gracing you with her Attention may be praised.", "OP ignore all these y t a, these people are delusional.", "Well I guess those are literally the only two possible reactions in this scenario", "talking to your partner like a person and expressing your feelings in a non-confrontational way isn't patronizing. if your partner is prone to getting upset like OPs is, this is a good way to express your feelings without making them upset.", "“Perfectly capable of managing her own…friendships” I mean that’s not the vibe I’m getting from this post at all. I think they wouldn’t be having this argument if that was the case", "I don’t think I’m sensitive, I found the sentence rude and according to the comments so did a lot of other people. If you disagree that’s fine but there’s no reason to assume things about me", "THIS. This is why OP's statement is infuriating.", "That's funny, b/c whenever I say \"That guy seems like a creep\", I always get guys telling me they don't see that at all. When he turns out to be a creep, they guys  are shocked.\n\nDoes this special sense work only on guys who are hitting on your girlfriend?", "Like women see the cattiness, manipulation, mean girl sheyat and men seem to be oblivious.  Even with their mothers.  A MIL can say passive-aggressive things to a man's wife and yet, he doesn't see it.  That she's just trying to be HeLPfUl and the wife is taking it wrong.", "Its just getting ridiculous. Absolutely NTA.", "Agreed. I just think that the numerous yta's he's getting are because people cant get over that one line. \n\nIt was poorly written tho and I wont argue that.. but its drawing too many people from the topic of the post imo.", "There’s a difference between a friend and an orbiter loser. Friends don’t try to tear apart their friends’ relationships so that they can get with them. This guy was never a friend, he was a sex vulture.", "This is might actually be the most self-aware comment I've ever seen on Reddit in my lifetime. \n\nYou're insight is spot-on, yet something the majority of people refuse to admit when it comes to friendships of the opposite sex. OP refused to admit this fact to herself though, which led to the \"confused pikachu face\" once the truth was revealed. \n\nThe boyfriend obviously wasn't the most supportive when she came to that revelation, but you can't fault him too much for suggesting he was right all along. His (accurate) description of the situation was disregarded so it's only natural he recognize that fact. \n\nNTA!", "I just assume all men are creeps.", "There is an option called ESH. You don’t have to choose one or the other.", "Holy shit. Those are some hefty Double standards!!!", "What???? I absolutely wouldn't want my wife hanging out with male friends that she knows have feelings for her.  She has male friends and I don't care, but if one of them made advances toward her, I would hope she would end the \"friendship\" immediately", "So I should be okay with her being friends with someone who actively wants our relationship to end and then pulls behavior like I described in an attempt to win her over? That's kinda crazy. Its disrespectful to the relationship", "He wasn't smug he was sarcastic.", "This situation isn't about being a winner, it's about her ignoring his justified warnings.", "Wait so he makes an observation and she gets to tell him he's just jealous and disregard his feelings but he's the problem for saying I told you so? Maybe it could have been solved if she took into account what he said and asked why or asked him to point it out when he thinks it's happening so it could be accurately assesed instead of disregarded.\n\nI dont think OP is right to gloat about it but everyone acting like she did nothing but trust a friend and he's shitting on her is blatantly ignoring that he's brought it up multiple times and she seemingly ignored it cause she knows better. I'd say ESH.", "No lies detected.. he voiced his concerns to her and she blew him off just for him to be spot on. Ive been in OP's situation before and have had the scenario where a gf cheated on me and the opposite where she cut the friend off and stopped hanging out with them.\n\nPoint is... the girl should feel silly for not seeing the obvious signs... but instead she gets mad at OP for being a bit negative since she clearly didnt respect his deductions.\n\nNTA.", "yeah you all found it rude despite all of you constantly implying men are slow in this sub because none of you have self awareness. He said slower to notice a guy might be hitting on you, based on things he notices as a guy you might not.  Women say this sort of thing all the time and now you collectively freak out if it gets said about you? how does this dispel stereotypes that women overreact and the fact you all agree with each other shows how bad your mob mentality has gotten. You make way more offensive statements than this towards men on a daily basis so acknowledge your hypocrisy and respond to the actual situation instead of being the language police on what is ultimately not even that bad of a statement.", "[deleted]", "What about her calling him jealous? Why is that acceptable?", "Sweeping generalizations are like slushies - they are the best when self-serving.", "I think it's possible that women have a better sense of creepy/dangerous men, while men may be able to see crushes from other men more?", "Depends, when you call the guy a creep is he already friends with your other guy mates because in that case they know he's a creep just choosing to ignore it until they can't no more (But every friend groups got someone like that)", "I mean my example was specifically not my SO, but I have laughed and told her that the male coworker texting her on the weekend is probably interested in her. \n\nIts not some super power to know that when a guy texts a girl like 8 times without getting a response hes probably not completely altruistic.", "Your definition of creep is probably a bit more arbitrary than someone being obviously into someone", "You’re kind of proving the point. As a woman who has had to deal with men making her uncomfortable, I do feel better equipped to determine whether a guy is a creep (a creep in relation to how he treats women) because of my experiences. I think it’s less about gender and more about life experience.", "Everytime I’ve said I’ve experienced cattiness and mean girl behavior from other women far more frequently than men I’m accused of internal misogyny.\n\nIt is VERY much a thing.", "The topic of the post: AITA?   \n\n\nThe answer: for calling women \"slow,\" yes, YTA.   \n\n\nNo one is distracted, y'all just want to give him a pass that he didn't earn.", "I recognize that! And I’m sure she does too now! But obviously if she knew that she wouldn’t have been friends with him. Do you assume the absolute worst of everyone who tries to befriend you, so you never get surprised by an “orbiter loser” ?", "True. I don't think she was an asshole for feeling hurt and betrayed though", "She is in no way the asshole here.", "This. How good of a friend can a guy be if he won’t respect her relationship", "What is your definition of \"know\" though?\n\nI agree if someone disrespects your relationship, that's an issue. But what about someone respectful who likely would make an overture, if there was no relationship?\n\nWhat are women supposed to do? \n\n*you've done nothing untoward, but I think you'd be willing to get it on, so we shouldn't talk*", "she ended the friendship tho??", "I'm in two minds here bruh, I had a mental ex who made me block almost ALL my female friends, not just exes only for her to get all defensive when I said I was uncomfortable with her guy friend telling her shit like he's horny, granted I never told her at any point to stop speaking to him.\n\nPersonally, I'd let her be friends with whoever and if you're uncomfortable you'll have to cut your losses. We broke up for other reasons, but she did end up hooking up with that guy fwiw.\n\nI think it just comes down to differences in mentality, I personally could not remove a friend for someone anymore, and I would still never make anyone do that. Have a think about things, and if either of ya are willing to possibly sacrifice friendships", "> That's kinda crazy. Its disrespectful to the relationship\n\nIn what way? When he took a swing, she said no - everything went fine. So... what's the issue here, exactly? She clearly maintained her boundaries with him.\n\nAlso -- just because you happened to be right about this person doesn't necessarily vindicate your belief that you have some deeper insight into who likes your girlfriend than she does. It just means you were right about this one guy -- that could absolutely just be chance. Case in point - you lead the post by talking about *two* guys, but there's only been an issue with one of them. Which is to say -- for all your deep *male* insight, you were right precisely half of the time.\n\nFrom where I'm standing, you're hitting 50% of the pitches and acting like you should be granted authority over who she can be friends with on account of your accuracy. Bad look.", "Yes, you should trust her enough to shut this down. It sounds like she did. While navigating through life she’s going to have some people, such as friends and coworkers, be interested in her. You mentioned a couple of guys you suspected are interested in her, but only one recently crossed the line (which she addressed.) So how are the other guys “actively” trying to sabotage your relationship? You don’t actually have trust if she needs to cut out any person that might have an interest in her.", "Ooooff. I agree that she chooses him but she’s also choosing to remain friends with someone that has no respect for her relationship. Not a good look. I’m all for friends of the opposite sex but this is a slippery slope.", "I would think it's more disrespectful to be dismissive and sarcastic when your partner gets harassed by someone who she considered a friend.\n\nYou're meant to be supportive and caring instead you sarcastically prioritised letting her know you were right and she was wrong. How exactly does this help your relationship with her apart from making her feel belittled and stupid?", "The line between smugness and sarcasm is very blurry.", "I meant smug. The OP was peacocking over being right about his GF's male friend on Social Media. It's the definition of being smug . Google it.", "If she had no indication of this in the past, it’s only reasonable she’d not heed the warning?? Because crazy concept, but sometimes it takes feelings things yourSELF and not what OTHERS TELL YOU to see things like this??? God god.", "And being gracious in this situation (or any situation as a matter of fact) doesn't involve saying \"I told you so\" and rubbing it in her face. Doing that makes him TA.", "Respect his deductions? Hey, she was wrong this time, but what if she wasn't? She'd end a friendship just because her boyfriend believes some guy likes her?\n\nI'd say that she should have at least entertained where OP was coming from, but \"respect his deductions\" seems dramatic... and pseudo-sexist.", "No, I understood it. And still thought it was dumb", "I love this phrase.", "If had both cases where he was already their friend or someone recently met. I don't say \"seems like a creep\" just out of nowhere, ot is usually after I observe multiple different things (comments, actuons, etc). \n\nEither way, being willing to ignore a creep and telling a woman her instincts about a guy are wrong when they are not, but also expecting her to believe you when you say some other guy is actually hitting on her is some really interesting mental jujitsu.", "She called him jealous when he pointed this out. He’s not a saint. He supposed to transition directly into being supportive?", "So, then he isn’t an asshole for not being super supportive after being called jealous. That works both ways, doesn’t it?", "That is a little bit of a crazy concept for an adult in a relationship. I generally listen to my partner and assume she's coming from a place of rationality, and don't immediately assume she's jealous or some other negative emotion.", "Nah, he was being gracious with the initial warning. She dug her own grave after that.", "Respecting his deductions only means exactly what your last paragraph said.. what do you mean?\n\nLook up deductions.. you seem to think it means \"commands\" or something based on your reaction.\n\nEdit: I guess expecting your partner to respect your 'awareness' (there.. easier word for you), is sexist now.. but only if you're a guy. TIL (/s)", "God I hope you don't treat people like this in real life. Buh bye now!", "They're completely different words. I don't know how you could think someone could get those mixed up.\n\n\"respect his deductions\" is just a really dramatic way to say that is all I'm saying. When I think \"respect\" used that way, I think, \"respect the law\" or \"respect the rules of the roads\", which of course aren't suggestions.\n\nI'd say, she probably should have \"taken his concerns more seriously\".\n\nIt's really all semantics, I suppose. It's just that sometimes, choice of words can be telling.", "Oh, just saw your edit. No need to be so condescending...\n\nUsing \"awareness\" like that is really vague, and sounds awkward in this context.", "Respecting something doesnt give that 'something' authority over you (or whoever). It just means exactly what u said; taking into consideration, or taking it seriously.\n\nI didn't say, \"obey his 'deductions'\" that wouldnt even make sense lol", "Yeah sorry. I didnt mean to be mean."]}