{"id": 13979, "submission_id": "12bm6vy", "title": "AITA for deleting a video of myself from my friend’s phone that he took while I was drunk?", "selftext": "My friend filmed me while I was drunk basically confessing to loving him since we were kids. It isn’t something I ever would’ve said to him sober and I absolutely cannot let anybody else see that video because he’s seeing my best friend and it would hurt her if she saw it. I asked him to delete it multiple times but he would always turn it into a joke and refuse.\n\nHe promised he wouldn’t show it to anybody else but he’s watched it in front of me in places where anybody could’ve overheard so I didn’t trust him and I secretly deleted it from his phone. \n\nHe’s mad at me for taking his phone, deleting the video and because he thinks I looked at other things on it. The only thing I did was delete the video but he doesn’t believe me. My best friend knows he’s mad at me but doesn’t know why, but he threatened to tell her and is claiming he had the video backed up which I think is pretty shitty of him.\n\nI don’t plan to apologise to him because I feel like he forced my hand as he should’ve deleted it when I asked him to.\n\nBut... AITA?", "created_utc": 1680621422, "permalink": "/r/AmItheAsshole/comments/12bm6vy/aita_for_deleting_a_video_of_myself_from_my/", "score": 654, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I deleted a video of myself from my friend’s phone. I took his phone and secretly deleted it without his permission.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Wow, no, NTA, but your “friend” is an AH for not deleting that video right away. Watching it in front of you after you asked him to delete it was straight-up emotional blackmail.", "NTA. He got some power over you, and he was happily abusing it. F him.", "NTA\n\nYou told him to delete a compromising video and he refused, so you fixed the problem yourself.  Don't get drunk around him again.", "NTA.  But your friend certainly is.\n\nHe filmed you without your consent, then refused to delete the video.  While I'm generally against deleting things from other people's phones, I can't blame you in this instance.\n\nI'd talk to your best friend and get ahead of this.  Explain what happened (without fully disclosing what you said in the video), including the fact that he constantly played that video to you around others where it was likely that it would cause hurt and embarrassment.  I'd also let her know that you did not consent to him filming you, and you are hurt and angered by his actions.\n\nIf you take away the shock value and get your version out there, that video won't have any power over you.", "NTA - Real friends don't hold stuff like that over your head. Going into someone's phone is usually a big no, but he was clearly hanging onto it to hurt you and your friendship between you and your best friend.", "NTA and this dude is not your friend.", "NTA \n\nHe was essentially blackmailing you.  Very AH move. Some “friend”. \n\nYou went through his phone. Not cool normally, but while AH material it is completely justified in this instance. I’d have done the same, there are just some situations where being an asshole is the only way to get it done. So you are off the hook in this case.", "NTA\n\nYou confessed something deeply personal to him and he used it to dominate and then blackmail you. I hope this leads you to see that he is not worthy of your feelings. \n\nCut him out of your life.", "NTA.  I absolutely hate how people record shit all the time without any consideration for the feelings of those being recorded.  Good for you for deleting it", "NTA. I’m sorry, but blackmail just isn’t my cup of tea. I’d tell her what happened. You may lose your friend over it, but at this point I wouldn’t have cared, you’re not about to blackmail me, wtf..", "Question: why was he filming you in the first place?", "You might have deleted it off the phone but my phone backs up to cloud storage so your video might not really be gone.", "NTA - Normally, going on someone's phone w/o permission is a big no/no.  But you had good reason in this case, as he was mildly abusing you with it (not sure if abusing is too strong a word here, but whatever). Hopefully he has not saved it on the cloud, someone else has mentioned.  And I hope that your deep crush on him has dissipated, as he has shown his true AH colors.  What a jerk!", "Did your best friend know your feelings for him before she started dating him???", "NTA. I hope your love for him is dead. I would tell your best friend what happened.", "If he backed it up, then he lied about not showing it. Or he wants you too. Either way, nta", "NTA but your friend will find out and she needs to hear from you. You may lose her until they break up but at least you know that she knows the truth.", "NTA, because I would treat that the same as any pics or vids taken without your consent and having it while being asked multiple times to get rid of it is an AH move. His claim that he has it backed up sounds like bs because if he did he wouldn't have been so upset once he found out.", "NTA but your friend will find out and she needs to hear from you. You may lose her until they break up but at least you know that she knows the truth.", "ESH you shouldn’t be hiding this from your friend. She’ll be even more hurt when she does find out And he’s basically blackmailing you. \n\nI hope you see that this guy is NOT a good guy to have a crush on. Not only is he taken but he’s toxic", "Well, if you needed a reason to not be in love with him anymore….", "Not the AH for deleting it, HE is from filming and refusing to delete.  But yes for drunkenly telling him how you felt.  Not when he’s seeing your friend", "NTA You need new friends.", "Soft YTA, you shouldn't be deleting stuff from his phone, but he shouldn't be antagonizing you over it.\n\nYou say you don't want to hurt your best friend, but she is going to be hurt by him eventually anyway...  You have to ask yourself why he would keep that video, because he likes teasing you, holding it over you, and the attention.  What kind of decent person behaves that way?  \n\nAlso why would you even be in love with someone like that.  I doubt he's going to tell the friend, because then it's going to backfire on him about why he didn't tell her for so long.\n\nBoth you and him are AH for keeping her ignorant of this information and robbing her of the choice to make informed decisions relevant to her life.  She has a right to know if her friend is in love with her bf, and she also has a right to know if her bf has that knowledge and has kept it from her.  The real question is whether you actually care about your friend, or whether you feel the truth is too inconvenient so you'd rather keep her in the dark.", "YTA for trying to shoot your shot with your best friend's boyfriend. He's TA for recording the video. YTA again for removing things from property that wasn't yours. I understand that he was using you in a weak moment but that's the sacrifice you make while drinking. If I wouldn't have used my ex in a moment of weakness, I'd have no video proof of him threatening to kill me while he was drunk in the middle of our kitchen claiming he didn't know where he was.\n\nYou need to tell your friend and expect that she will be upset. But everyone telling you that she's a \"bad friend\" if she chooses him over you are wrong. You tried to confess your love to her boyfriend and you were recorded doing it. You aren't upset that you did it, you're upset that you got caught doing it.", "Hey, you asked and he refused. Sucks to be him.\n\nESH but I'm on your side.", "Why would you allow him to video it to start with… you have some blame here too. If you can’t handle your alcohol- you shouldn’t drink. But maybe you need to tell your friend what happened because his narrative might be totally different.", "NTA. He sounds gross.", "Justified AH move = NTA\n\nHe should not have recorded you and he certainly should have deleted it the first time you asked.\n\nThis dude is not your friend.", "YTA; I think he shot the video as a precaution in case you got vindictive about him not returning your feelings and tried to make out to his partner, your supposed friend, that HE came onto YOU. He has the right to preemptively protect himself against false allegations.", "Why are you friends with either of these people?\n\nYou're betraying your best friend by hiding your feelings and being close with a guy that you like. Why? What did she do to deserve this treatment?\n\nYou're not wrong for deleting the video but you are wrong for putting yourself in a position where you were drunk enough to confess your feelings.\n\nA good therapist can help you get to the root of why you think it's okay to behave this way. You're not being very much of a friend to her, I hope you can get to the root of why.\n\nESH.", "INFO - how old are you all?\n\nI'm wondering if you're all 16, 18, or 28 etc as there's also a big difference to advice imo considering ages.\n\n\n>My best friend knows he’s mad at me but doesn’t know why, but he threatened to tell her and is claiming he had the video backed up which I think is pretty shitty of him.\n\nNote to folks reading - deleting a photo or video doesn't mean it's gone forever!  \n\nMany devices auto back things up.\nThat doesn't make a person shitty...? \n\nYou seem to be *completely assuming here* that this guy made a conscious choice to back it up.  \n\nI've had my phones set to auto back up everything I do with the camera app for like a decade or something.  This isn't new technology.", "I'm going with ESH, but I feel like that's not even the point.\n\nThere is some weird, unaddressed love triangle shit going on here. He loved having that video of you confessing your feelings waaaay too much. He wasn't rewatching it for laughs. He has some kind of conflicted feelings too. Or gets off on the self-esteem boost from having a gf AND sexual tension with gf's friend. He's also way too worried about what else you might have seen on his phone. Yikes! That makes me suspicious.\n\nBut the way he handled this is definitely emotional blackmail. Huge red flag. Do not engage with this fucked up dynamic. His behavior will hopefully end whatever crush you have on him.", "NTA he’s definitely not your friend and him keeping a backup of it is creepy.", "NTA, and he's not your friend. Sorry you had to find out this way.", "YTA", "ESH - Him more than you. You dont take people’s phones without their permission but he also shouldn’t be holding this over you and shouldnt have filmed you and they are clearly an AH for not deleting it. You all sound messy. \n\nIf the concern is being filmed without your permission, thats one thing but you seem more concerned with your feelings coming to light. \n\nMaybe you all need to talk because this unrequited love isnt just going to go away…", "ESH\nDon’t drink so much around someone your best friend is seeing that you confess you’re in love with them. If you can’t control yourself when you’re drinking then you need to control your drinking. I don’t have a moral issue with your deletion of the video.\nYour friend is behaving as a manipulative bully and in this situation is not showing any care to you or your best friend.", "NTA he's gross for recording you when intoxicated to begin with, and even more so for holding it over your head and refusing to delete it when you asked him.  He does not sound like a good person.", "ESH. Dont mess with other people's phones", "ESH. He still has a right to get mad because you did go through his phone. But he's definitely an asshole tho for holding that over you instead of just deleting it. I don't think a real friend would do that.", "YTA \n\nDon't drink if you can't control your words and actions. He can technically record you any place especially in public. You do not have permission to just access someone elses property like that.", "[deleted]", "Bet you’re not in love with him anymore, lmao. NTA.", "NTA if he did not get your permission before taking a video you do not need his permission to delete it!\n\nFair and Square.", "NTA. But you need to tell your best friend before he tells the twisted version.", "NTA, quit talking to his ass. He had an ounce of power and abused it. \n\nGOOD THING YOURE NOT DATING HIM! BULLET DODGED!!!", "That is blackmail and emotional blackmail. If he wants  it that way. your friend is a shitty person.", "NTA.  If he was your friend he would have deleted it himself.", "If he was really your friend, he would have deleted himself.\n\nYou did the right thing, don't let him abuse the situation.\n\nNTA, but he is.", "That’s ✨Blackmail✨ and ✨abuse✨ you’re NTA, but he is. I’d tell you’re friend about the situation as soon as possible, tell her that you don’t have those feelings, you were just drunk, and now her boyfriend is trying to ✨blackmail✨ you. If she doesn’t want to be friends anymore, then now you have two people that you don’t need in you’re life outta it.", "Not the asshole that you have a creepy “friend“ who doesn’t have any sense of boundaries or respect. If he has an iPhone, you have to delete it from his photo album and then go to the recently deleted photos and delete it there too. Otherwise, he can restore it within 30 days.", "Not the asshole you made a drunken mistake and you wanted to delete it because you didn’t want to hurt you friend but it is extremely weird that he didn’t want to delete it when dating someone and also playing while around other people is a huge red flag if anything his the asshole.", "NTA but you’re in love with one", "ESH. You shouldn't have deleted it and prob could have played it off as just being drunk. He sucks for not understanding the implications of what could have happened if your friend saw the video.", "NTA. That guy is NOT your friend. I can't imagine doing this to anyone I cared about. This is some enemy type of behaviour. The best thing for you to do is let your best friend know what happened to eliminate any power this guys has over you, and then distance yourself from the situation.", "NTA, and that guy is not your friend. He is using you for an ego boost. If I was you I would thank him for showing me his true colors and killing all feelings I ever had for him.", "NTA", "NTA. Only an absolute simpering weakling wouldn't do what you did.", "Your “friend” is fully blackmailing you. What a shitty little man. You’re NTA, he CERTAINLY is. I suggest you not only cut contact with him, but also let your best friend know what’s happening. She won’t be happy that you confessed your love, but she’ll be especially angry knowing what he’s doing to you.", "NTA....um This sounds like blackmail. I don't know what country you live in but it might be best to ask for legal advice or advice from the police on this if possible", "NTA even without reading it. Even more NTA after reading it. \n\nThat is one shitty friend, there's no way I'm not deleting if a friend asks me to do so, especially if it's a case like this.", "NTA.\n\nAfter doing a video of you without your consent he must be happy you didn’t clean the all memory.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy friend filmed me while I was drunk basically confessing to loving him since we were kids. It isn’t something I ever would’ve said to him sober and I absolutely cannot let anybody else see that video because he’s seeing my best friend and it would hurt her if she saw it. I asked him to delete it multiple times but he would always turn it into a joke and refuse.\n\nHe promised he wouldn’t show it to anybody else but he’s watched it in front of me in places where anybody could’ve overheard so I didn’t trust him and I secretly deleted it from his phone. \n\nHe’s mad at me for taking his phone, deleting the video and because he thinks I looked at other things on it. The only thing I did was delete the video but he doesn’t believe me. My best friend knows he’s mad at me but doesn’t know why, but he threatened to tell her and is claiming he had the video backed up which I think is pretty shitty of him.\n\nI don’t plan to apologise to him because I feel like he forced my hand as he should’ve deleted it when I asked him to.\n\nBut... AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nTell your bestie what went down. That you were drunk and made a drunk love confession that he recorded and wouldn't delete even though you were wildly uncomfortable with him having it, so you deleted it yourself before he could further embarrass you with it.", "NTA. Talk to his GF and tell her he had taken a video of you while you were drunk and did not consent to being videoed AND he refused to delete the video, therefore you deleted it for him and now he's mad.", "NTA. i hope you remembered to delete it from recently deleted as well.", "NTA, but I think you should sit down and talk to your best friend before he has a chance to twist the story to her.", "NTA, your \"friend\" certainly is", "NTA at all. Wondering how old the people involved here are. The older, the worse it gets.", "NTA. Tell his girlfriend. She's less likely to be mad at you if you phrase it as \"He took a video of me without telling me, when I was drunk  saying a bunch of dumb shit about how I liked him when we were kids and was blackmailing me with it\"\n\nStill his girl and never look back lol", "I don’t condone looking through someone’s phone but honestly? It sound like he is/was thinking of blackmailing you with it. Edit: forgot judgement, NTA", "NTA but I have a question: why exactly do you love this guy? He is acting like an absolute AH, humiliating you, blackmailing you. \n\nHe's neither your friend nor worthy of your feelings", "NTA OP.  This is a “friend” that you should definitely disengage from.", "Nta - you actually love this guy? No accounting for taste\n\nSo he takes a humiliating video of you \n\nScares you by watching it in public\n\nNow blackmail you", "NTA \n\nYour friend was using the video to bully you. You did the only thing you could.", "He’s blackmailing you. He’s not a friend. Yta for continuing to engage with this person.", "How do you make a blackmailer lose all power over you? In this case, I'd consider just telling your best friend the whole story. Let her boyfriend deal with the rage she'd enact upon him :)", "NTA but did you delete it from his recently deleted?", "NTA. That was crappy of your “friend.” You might want to reconsider your feelings for someone who would do this to you.", "NTA but I doubt the video is actually gone for good. If you get your hands on his phone again make sure to check for anything like Google Photos, Amazon Photos, etc. because it likely would have automatically uploaded to any cloud service like that shortly after he recorded it. He could also have a copy saved in a secure folder.", "NTA and this person you think is your friend, he is someone you've known for a long time through proximity but he is NOT your friend. As you get older you'll start finding out that more and more of your friends are just people you know, they don't actually care about you all that much. \n\nRing your friend and tell her that he has this video of you, tell her what was said and that he's blackmailing you. You've already lost both of them, best option is honesty and calling that AH's bluff. What a fucking creep, can't believe you actually fancied him.", "nta", "NTA", "NTA - hope you find a way to level the field with him, because such long friendships should go a long way (unless they are abusive), and not be canceled over something trivial", "NTA. He’s not a friend.", "Nta- I had a friend like this. Ditch his ass. He's not worth keeping around.", "Nta- I had a friend like this. Ditch his ass. He's not worth keeping around.", "NTA. You didn't give consent to being video taped. Don't hang out with him anymore and stop drinking so much.", "NTA\n\nI’d rip off the band-aid and tell your friend. Also include the fact that he was using the power he had over you to make fun and keep you anxious.", "NTA he is one", "I would get ahead of him and tell her first! “Yeah he’s mad at me because he took a very embarrassing video of me while drunk and wouldn’t delete it after me asking several times. While it wasn’t gross it was embarrassing and I never consented to being filmed.”", "NTA\n \nHe wants you out of your bestie’s life.  Tell her everything and kneecap him information wise.   Once she knows I doubt she’ll be all that hurt.\n \nIf his bluff is true then she ca see that you never made a move.  It works out because there is no way you could still be attracted to that guy.", "imagine professing your love for someone and they take out their phone record you saying that and then use it to gain leverage over you for the rest of your life.", "Eh NTA but you realize that you’re not really friends with him.  You’re infatuated with him and you can’t be friends like that.  I was you and did something similar.  Never got together with the other person and as time went by I realized it was infatuation, not love.   I really really advise that you slowly pull back from him.  I get he’s with your friend so you can’t disengage completely but pull back as much as you can and start dating other people if you already aren’t.\n\nAlso he’s a huge Dick to hold this over you.  He’s emotional abusive.  Fuck this guy.  Maybe he holds secret feelings for you too but what he’s doing is unforgivable.", "NTA\n\nHe was recording you without your consent and is using it as blackmail, he is not a friend, get rid of him", "NTA… why are you still friends with and pining after this person? Don’t you see this is how they would treat you if you were in a relationship with them? I know it’s easier said than done, but dump them from your life, move on, and find what you deserve!", "NTA. He’s supposed to be a friend, right?", "info: why are you friends with these people", "NTA.  Friendship is a balance.  He was inappropriately exerting control over you with that video, and you took it back.  Balance restored and he can get over it.", "NTA at all, and he definitely doesn't deserve you (and probably doesn't deserve your bestie either)", "NTA.\n\nIt's you on the video and refusing to delete it just shows what an AH he is... you have every right to ask him to delete it, in which case he has no right to keep it.\n\nAnd why does he watch it in front of you? Is he enjoying making you feel bad? Anyway... don't feel bad about what you did, normally it's not nice to take someone's phone without their consent, but as he refused to delete it, it was your only choice (you could have probably involved the police, but that way was much easier and ensured being successful).", "NTA \n\nBack when cameras were more of a thing, this lady took a picture of me even after I said no. She thought she did it surreptitiously, but I saw her. I asked to see it and deleted it right in front of her. No means no. Your “friend” is no friend.", "NTA and he has other things on his phone he doesn't want you to know about.", "NTA... Look what this \"friend\" did the second they had an ounce of leverage over you.", "NTA. I felt a slight panic for you when he refused to delete the video. You had to do what you had to do. I despise how easy it is for someone to record others without their consent. It's extremely scary and uncomfortable. My friends used to post drunk videos of me on Facebook and I had to move mountains to get them to delete it. I'm no longer friends with those people. You should definitely reevaluate this friendship. Sorry you went thru this.", "NTA. But without the video what can he do? I’d move on", "NTA. I'm so sorry you love this guy.", "NTA and what was the reason for them wanting to keep it?  I cannot see any reason why he would need that.  There is no reason for him to have to watch it over and over in front of  you.    It was not ok for him to record you.  That is not something a friend does.  You should not trust this \"friend\".  They are not looking out for you.", "NTA and honestly sounds like he has some things he is hiding, and based on how he was using this video as a power play, I reckon he has done worse and doesn't want your best friend to know which is probably something keeping your secret safe... but at what cost. Honestly, trash him as a friend he isn't a friend if that's how he treats you, especially taking advantage of a vulnerable drunken moment.", "NTA. He recorded you in a vulnerable state and then weaponized it. He rewatched it bc of his ego. He didn't talk to you about it. He didn't seem to even care. He wanted to be able to use it against you. \n\nHe is not a friend. Get rid of him.", "NTA", "NTA - if he gets really shitty and threatening you just tell your friend he’s a creep who videos drunk people then blackmails them with the videos. \n\nWhat’s he going to do? Tell her it’s all because he had this video of you drunk….", "NTA. I also think a *good* friend would have deleted it upon request.", "NTA, this is so incredibly awful for someone to do to you. You were uninhibited, felt vulnerable and he completely took advantage of you. He's knowingly hurting you by essentially blackmailing you, and he obviously doesn't care too much about your best friend because it hurts her as well. \n\nI'd say to trash this \"friendship\" but he did that the second he filmed you, or, at the very least, not deleting it IMMEDIATELY when you asked him to. \n\nI'd tell your bestie too. It probably won't be pretty, but I'd rather tell her myself than continue to give him control of that situation. \n\nHe's exhibiting narcissistic behavior with a streak of cruelty", "I hope you emptied the trash or he still has the video.", "NTA! Did you also delete it out of the recently deleted items folder? If not, deleted items stay in that folder for 30 days so he may try to restore it and then show your friend. If you were concerned about that I would maybe get ahead of him and explain to her the situation so it’s coming from you and not him.", "NTA. Your friend is the AH. \n\nHis coveting of blackmail material should help sort out the infatuation you may still have. If he'll do that as a friend, imagine the things he could do if you trusted him with your love and faith.", "NTA & He's the Ass. you did not consent to being recorded, you were not sober, He's in a relationship, and its CREEPY. Why would he want to keep that video anyways? To wank to it? To use it against you? Nothing good comes of that. If i were you i'd contact his s/o and tell them about him recording you when you were drunk", "NTA Your \"friend\" is slimy AF, holding onto a video for an ego stroke and playing it back too... fucking gross.", "Ew, what an AH (him, not you). I hope he's your former friend now. NTA.", "I'm getting confused with all the him and hers", "NTA. not even gonna read the text.", "NTA. He should be grateful you didn't fix the problem via use of a hammer, thirty foot drop, or handy drain.\n\nTell his girlfriend everything and cut this arsehole out of your life.", "NTA. NEVER get intoxicated around this individual again. This is the kind of person who will take advantage of someone and claim they were asking for it.", "NTA. This is some twisted emotional blackmail he's been pulling on you. For what reason even? Does he just enjoy torturing people? I hope you're over your crush and I think you should tell your friend what a dick he is being. If he's doing this to you, who knows what he could to to your friend?", "NTA but your crush is.\n\nHe sounds like someone you don't want to get with. He's toying with your emotions and taking advantage.", "NTA you dodged a bullet, but I'd consider being honest with your best friend (if you think she'll listen) because this man just showed his true colors and they are not good. I hope he hasn't manipulated the hell out of her yet and she's able to see the truth and escape.", "NTA - if he was any type of friend he’d have deleted it when you asked, if he had more feelings for you than that he’d have just spoken to you and explored them", "NTA. That’s so manipulative. The watching it in front of you knowing it makes you uncomfortable really freaks me out. Keep an eye open for your best friend that’s not normal or healthy to play with someone that way.", "You need to tell your friend. I know you don't want to hurt her but when you explain what he's been doing, she'll realize who's really the asshole in this situation. NTA", "NTA. So you liking/loving someone who is dating your best friend and not acting on it to respect your best friend is something that shouldn’t hurt her/him. You getting drunk with your crush and confessing your love of/to him, maybe shitty, but definitely not assholic. If you acted on it, different story. \n\nYour “love” (hopefully no longer) is an AH because he is holding something over your head, and threatening you with it. \n\nTalk to your BF. Be honest, tell her you have (hopefully had now) feelings for her boyfriend and in a drunken vulnerable state you confessed your feelings. And that he recorded that drunk confession and held it over your head.  You found an opportunity to delete the video from his phone and you did. \n\nNow, I feel you like you have an AH vibe as you have feelings for a guy, and you hang out with him without your BF present. Not only hanging out with him, but getting drunk with/around him. I get you have been friends for a long time, but this is a recipe to ruin many friendships.", "NTA. That's messed up of him. You did what you had to do. But can we go back to two points?\n1 - how drunk were you in the video, and did you know at the time you were being recorded? Were you cognizant, or off your face?\n2 - can we not brush past his anger and fear that you might have looked at OTHER things on his phone? Sure, he may just have photos of his own pee-pee on there or whatever, but considering his behaviour,  I'd be wondering if he had other photos/videos of you on there.\nAlso, the cloud exists. Deleted isn't always deleted. Then again, he's angry you did it, so maybe he never uploaded it to cloud storage.", "NTA\n\nI would've done the same thing fr. Plus you asked him and he didn't respect your wishes. Yeah there's something wrong with taking someone's phone without their permission but in this case i understand why you did it.", "NTA and I don’t think he’s your friend…", "NTA and he is NOT a friend.", "NTA \n\nhe took a video of you drunk without your consent and is using it as blackmail, he is not a friend, get rid of him", "Yta. For unloading that on your best friends partner no matter your sobriety", "YTA  \n\n\nYou have no right to the contents of anyone's phone.   \nYou did dumb shit and got caught.   \n100% Asshole.", "As others have said, get ahead of it and be honest. I know that it's a hard conversation to have, but you have ways you can word it to keep the friendship in tact since you have time to think about it. \n\nYou could consider something like this\n\n\"Listen xyz, asshole is mad at me because he took a video of be drunk against my consent and kept showing it to me to bully and embarrass me, and is now mad I deleted the video off his phone. He is threatening to tell you what is on the video, so I need to tell you first. Basically while drunk I said that I had feelings for you. I do have feelings, but you are first and foremost only my friend. I've known you for longer than I've known what love is, and being the closest person of the opposite gender in my life growing up, at times in adolescence romantic love and friendship love got confused. Make no mistake I'm not here just 'waiting' for you. I love you as my best friend, and would never do anything to jeopardize that. I hope you can accept the fact that feelings may come and go given our entire history together, but that I only ever want you in my life as a friend. \\*\\*\\*OPTIONAL\\*\\*\\* If you ever wanted to discuss something more we could have a conversation about it, but I will never risk losing a friendship like ours for anything lesser\".", "NTA sounds like he's not really a friend at all", "NTA - he sounds like a giant ah.", "ESH.\n\nYou’re playing the victim when you’re the one who got drunk and said things you shouldn’t have. That’s on you, and so are any consequences. Especially if you knew there was a camera. And it’s not cool to snoop in someone’s phone, which is what you did even if you only looked at one thing.\n\nHowever, he’s being an AH about it. He should have just deleted the video, and he shouldn’t be making threats in response to your violation.\n\nSounds like you shouldn’t be friends. You’re not acting like friends.", "Anyone else think he’s cheating on the friend? He was pretty scared you saw something in his phone. Nta", "I say NTA", "NTA he definitely had some ill intent behind keeping the video. Also, there is usually a trash folder that keeps deleted things for 30 days on the phone. The video could possibly restored if it's not permanently deleted from that folder. \n\nAdvice: be the one to tell the friend he is with instead of it coming from him. He'll twist the story.", "NTA fuck that guy. Imagine what he does with pics of his gf. I would literally stop crushing on that guy immediately for soooo many reasons. He’s gross bud, just drop it.", "NTA he shouldve deleted it as soon as you asked", "NTA he took advantage of you while you were drunk and recorded it, even then if you refuse to delete a picture or video of a person while there is nothing inherently wrong with that imo, its disrespectful and frankly creepy", "your best friend know your feelings for him before she started dating him?", "NTA…why are you crushing on a jerk? Find a better crush…and a better friend.", "NTA\n\nDoes the cloud no longer exist? That video is DEFINITELY backed up.", "NTA... any recording something embarrassing to you can and will most likely be used against you later... what if you ran for mayor or became famous, then that video popped up and went viral? Good for you that you were able to defend yourself. People can be jerks, yknow.", "He was AH for recording it in the first place", "You don’t need someone like that in your life. NTA", "Yeah I hope this successfully cured OP of her crush. He sounds like a jerk. May she and her friend move on to better! NTA OP", "Until the gf starts berating the bf and he reveals what the video is just to hurt OP. if OP is going to tell the gf anything about what's going on, they are going to need to come clean about what's on the video too, in order to take away power from this loser.", "NTA.  I agree.  What kind of person would play that kind of emotional game with someone", "> without fully disclosing what you said in the video\n\nSurely you're not so naive to think there's any way OP's friend isn't going to find out OP took a shot?", "This right here. If your friend is a good one, she'll understand. She might be mad at you too, initially, but will understand. \n\nIf she chooses him over you, she's not really your friend and she's not one to herself, either, since she's choosing a dude who has threatened to blackmail you for not doing what he wants.", "> He was essentially blackmailing you. \n\nTo what end? He was holding an embarrassing video of her -- which I think is a dick move that makes him an AH. But also, blackmail would requiring leveraging that video to compel OP to *do* something. It's essentially *not* blackmail.", "This is an important question. He saw OP was drunk and vulnerable and started recording?", "Yes, every photo and video i take automatically uploads to the cloud. I think you should proceed with the presumption that THERE IS a back-up. This might mean talking to your friend that the video was about, so that you can cut off this blackmail. Also, dump the friend who recorded you, that's a shitty friend.", "No", "And this way she finds out what a stellar character he is.", "This.\n\nAnd I hope OP can also make it clear that her feelings for the guy have changed, because she saw how we weaponized her honesty and vulnerability. \n\nOne can hope that's the case, because this guy has shown his true colors and is not a good guy.", "That last sentence is so clearly true, it's heartbreaking for the  friend", "I like this answer. Im of the same mind. Nobody likes when people go through their phone. Only crappy friends would refuse to delete unflattering images/videos. Especially if significant others would be hurt by them.\n\nESH\n\nBeing an ahole is sometimes justified. This sounds like one of those times.", "I agree with you. I'm actually shocked that people are siding with OP. Every bad move made in this scenario, was made by OP except the recording which, in my opinion, isn't even THAT BAD. Play stupid games, win stupid prizes. I don't think there's anything wrong with this guy deciding to open his phone to record OP especially if OP is considering his girlfriend their best friend. If my partner's \"BEST FRIEND\" was confessing their love for me wasted in a public setting (have to assume it was a public setting because if OP and the boyfriend were drunk alone, that's a completely different issue) then clearly, OP didn't care that much about who heard them. They're mad that they got caught not that the video existed.", "Thank you!! \n\nEveryone was jumping over how OP has betrayed her best friend, who is the actual victim here.\n\nHe's shit for the emotional manipulation, absolutely! Also, he's definitely using it as an ego boost; he should've already told his gf!\n\nBut OP thinks she's innocent but just doesn't want any repercussions for her admission.\n\nBoth of them make my stomach turn.\n\nESH.", "I love how you said “without someone’s permission”. The video was taken and kept WITHOUT OP’s permission. I would’ve done the same thing", "Drunk confessions are just sober thoughts given voice. If you can't hold yourself together while drinking, you're drinking too much, full stop.", "No, OP is NTA. There is no excuse for taking a video or recording someone without their permission. The person who did the filming without consent is the jerk and absolutely should have deleted the video upon request.", "It is a video of her, taken without her consent she has every right to delate it.", "It's pretty simple... don't do things you're wildly uncomfortable with...? I bet $100 that OP would have NEVER told their friend about this if it weren't for the video existing.", "He's getting off on the ego trip, the power he now has over OP and the mind games. What a giant AH", "Agreed! Hopefully, OP realizes her crush is not a good person and she can find someone that will respect her. NTA.", "If he backed it up, then he lied about not showing it.", " I suspect he might have been egging her on in the video and getting her to spill her guts, taking advantage of her drunkenness'.", "Upon reflection, I agree - honesty is the best policy here.  And OP's best friend probably has some clue about OP's feelings anyway.", "Indeed. It's only going to seem worse if she's cagey/lies and then comes up against the boyfriend revealing the truth. Sad situation, but the boyfriend is such an A that it's probably good to take a step back from him friendship-wise either way.", "[removed]", "Did OP really \"take a shot\" or just admit she had feelings?\n\nAnd yeah, I think I was a bit naive there.  The boyfriend may have already said something.  But I do think it's entirely possible that OP's best friend may already have an idea that OP had a crush on this guy.", "She could also counter that a real friend wouldn’t shoot their shot at their boyfriend. The friend should cut her loses with both of them tbh", "I think it counts as emotional blackmail. His payoff is the positive feeling he gets from making her so uncomfortable. He is getting off on watching her squirm.", "This reads like a possibly gay confession so maybe we shouldn't assume it's not blackmail", "You're right it's not blackmail it's emotional torture. At least blackmail would have a goal in mind rather than just holding something over someone's head for the fun of making them miserable.", "Yes, it is because the leverage is her best friend’s ignorance about the video, unless she just let him keep taunting her with it and holding it over her.", "I agree that it's not blackmail but it could have easily turned into that if she hadn't deleted the video.", ">It's essentially not blackmail.\n\nExactly.\n\nCmon people... Let's tell the truth when we give advice!   Lying helps no one.", "You are right, but there isn't a word for this because people don't do it.", "Its called an ego boost my dear watson. Some people enjoy seeing other squirm", "Yeah there's definitely something not right here. I suspect he might have been egging her on in the video and getting her to spill her guts, taking advantage of her drunkeness. In which case he's an even bigger asshole!", "Well do you still like him now that you’ve seen how he really acts?", "The fact that he's threatening to tell your best friend about this shows his true colors to you. It wasn't a matter of fun, it's a matter of having some kind of power over you.  \n\n\nIf your best friend is level headed with this kind of info, I'd recommend telling her yourself about what happened. About the video, about how he took it knowing you were in a vulnerable state and took it without your permission, how he plans to tell her because it was deleted, and that he claimed that it was backed up somewhere.  \n\n\nThis guy is really giving creep vibes, and it's better she hears this coming from you than from him. Take away his leverage against you, and hopefully she's wise enough to see the creep for who he really is as well.", "\"Being an ahole is sometimes justified.\"\n\nAbsolutely.", "Agreed. It's been discussed often that we need a judgement for JAH (justified asshole) or something similar.", "Exactly! Both OP and the bf are the AHs, making this an ESH situation. And I agree 100% that OP was more concerned about being caught confessing her love than anything else. I feel sorry for the BFF. She has a fake best friend who is drunkenly hitting on her man, and a man who is cruelty delighting in holding the friend’s crush over her head rather than telling his girl and letting her decide what the best course of action is.", "Thats what ESH is for. Two wrongs dont make a right.", "> There is no excuse for taking a video or recording someone without their permission.\n\nLet's wind that back a bit, chief. \n\nIf someone is committing a crime against me, and I need evidence later, you bet your ass I'm recording it despite their objections.", "If OP's in the USA and in public setting *or* a one-party state, then her consent isn't required. On the other hand, accessing someone else's phone actually *is* illegal. If you post an embarrassing but legal photo of your friend to social media, and your friend *hacks into your account to delete it*, you might both be shitty people but only your friend is a criminal.", "I had instant flash backs to my abusive ex reading that. I’m not going to call him abusive because we don’t have enough info but god the power trip and laughing at her discomfort really, really creeps me out.", "NTA. And also, I know it will be hard, but you need to tell your best friend, and you need to be the first to do it too, before he does.", "[removed]", "Coming exactly to comment on this. Not only isn't he a friend to OP, he's a pretty shit boyfriend to bff. A good guy would NEVER EVER have recorded this confession much less keep it because (checks notes) he finds it funny? A joke? Or he likes the ego boost this confession gives him. I'm genuinely concerned for bff dating this jerk but unfortunately OP can't say shit cuz friend would assume it's jealousy and nothing else. NTA and stay tf away from this guy as much as possible", "I like how no one believes her when she said that wasn't anything she would say sober bwhaha", "Yeah I have a feeling this is what will happen. Poor OP, I feel bad for her", "Calling it emotional blackmail would be somewhat appropriate. \n\nIf you really wanted to get in to it, it’s more emotional torment. He’s pulling it out and showing it to OP in situations where it will make her overly anxious. He’s literally toying with her for his own enjoyment. \n\nWhatever you want to call it it’s super fucked up with this “friend” is doing. \n\nMy two guesses are he’s either doing this because he likes OP too and is trying to get caught so his GF finds out or he’s just a giant asshole with no regard for people’s feelings.", "I hope not. And the fact that he is threatening to tell his girlfriend, so he is willing to hurt her as well to keep whatever power trip this is.", "Justified AH is just NTA and if you want you can explain they suck too but less and you understand why they did whatever. There isn’t a need for a special justified AH vote.", "It does in this situation. Dont let people blackmail and run all over you because “oops I don’t have permission”", "Whether or not something is legal has no bearing on whether or not it makes someone an asshole for doing it.", "I know you're right but this is gonna end poorly no matter what. Bff will assume it's jealousy and it may very well kill the friendship. But seriously eff this guy. He's getting off on the power trip and mind games", "I suggested this too, but I will also admit that people like this tend to be REALLY charming and manipulative, and OP confessing to bff probably only has a long-term chance of potentially saving their friendship. Short-term, this guy is most likely to lie, lie, lie, and break up their friendship (regardless of who tells bff first) until he gets comfortable, starts showing this controlling side of himself, and bff finally sees it for herself. And that could take years.", "*former best friend", "I'll agree that emotional torment sounds quite fitting.\n\n>My two guesses are he’s either doing this because he likes OP too\n\nI had similar thoughts, and is why I asked for the ages as this seems quite \"younger person\" behaviour, and also just from OP writes.  I can't see any of them being like in their 40s+ ... But then again it could be!  This is just guesswork and thoughts from my head after all :)\n\n(Edit. Oh wait. That was in a different comment I wrote on this same post!  About asking for their ages)", "It literally doesnt. He didnt blackmail until she went through his phone, so ur sentence is wrong", "Lets calm down with the dramatics. OP never mentioned whether there was permission to film or not - the issue is them having a crush on their bff’s bf. They’re trying to prevent THAT from coming out. \n\nTheyre all messy.", "Unless OP's friend got her drunk and forced her to confess, she has no moral right to delete a video from *his* phone, but he's still an AH for not complying with her request. Drunk people aren't entitled to access and delete the records of their drunk actions.", "So? U can see is ESH right?", " a vulnerable drunken moment.", "? He was drunk and asked multiple times for it to be deleted. Doesn’t sound like permission to me. And yes! They’re concerned that the video taken of them without permission stating something personal is going to be….. used against them!! Like you know, blackmail", "? He was drunk and asked multiple times for it to be deleted. Doesn’t sound like permission to me. And yes! They’re concerned that the video taken of them without permission stating something personal is going to be….. used against them!! Like you know, blackmail", "No. OP is NTA. A video was taken of OP without their consent and they deleted said video. The video should never have existed and therefore nothing wrong was done in deleting it.", "No. OP is NTA. A video was taken of OP without their consent and they deleted said video. The video should never have existed and therefore nothing wrong was done in deleting it.", "Because what other reason does this friend have to not delete a video of someone who is asking repeatedly.", "Recording someone else's non-explicit interactions with you is not immoral. If OP had confessed to his video doorbell would she be entitled to break into his house and delete the video?", "It doesnt matter her consent, he can record who ever he wants of they r in public or a party. By deleting the video she went through his phone invading his privacy. 2 wrongs doesnt make 1 right", "Bc is a funny video of a friend of yours lol", "Legally, you are correct. Morally, you are an AH.", "Yeah sounds hilarious fr 🙄 The funniest part is upsetting your friend for no reason", "The sub is literally called \"Am I the *Asshole*?\" I don't know how people can end up here, spend so much time here, and still not get it. OP didn't ask if they did anything illegal, they asked if they were an asshole. And given that he had already begun to hold this over her head, and is still claiming to do so, all she did was meet his manipulative asshole behavior with some firepower of her own and I think she was totally justified. I also think it's adorable that people actually think this guy has a case in court, like fucking go outside, that shit doesn't happen in real life, you'll have to get your schaudenfreude somewhere else. He has 0 case. He needs to stop abusing the trust his friends have in him.\n\nWhether something is legal or not is often irrelevant to morality. In the US, yes, it's legal to film people without their consent and upload it online to ruin their lives. It's not legal elsewhere though. So it's not really a \"natural law\", like laws against murder, it's just decided upon by the given society. Which is why there are so many assholes in the US filming the worst moments of peoples' lives to go viral. I don't personally think it's ethical because it's legal, it feels a lot like harassment sometimes.", "Yeah, she still is", "Yeah that's the point 🤦‍♂️🤦‍♂️, it wasnt an issue until she decided to go through his phone without permision"]}