{"id": 13985, "submission_id": "12bl3gk", "title": "AITA if I take my bff to a free dinner instead of my BIL?", "selftext": "WAITA?\nI won a giveaway of $100 to a new restaurant in town. I am bringing my husband, but looking at the menu, we can’t spend all by ourselves. The restaurant said to just show them my social media account since they don’t have a system in place meaning we have to spend all the amount at one visit.\nWell, I prefer to bring my bff, but I feel obligated to bring my husband’s brother. I have a dilemma bc the BIL is extremely cheap. Every time we go out, my husband always pays for his meals. My husband sometimes also buys his grocery. I have complained to my husband about this as we all have our own family. A little bg, my husband lived with his brother for a year without paying rent, but paid for grocery. To me, we can’t be covering my BIL food for life. We have our own family, our own mortgage and expecting a baby. But my husband is “my money, my rule”. \nWhereas my bff, she always treats me well. She brought me to dinner, hosted parties, and buy me stuff with all her money when I was upset over my pet’s death.  In return, I also buy her dinner, host dinner, etc. \nWAITA if I bring my bff?", "created_utc": 1680619104, "permalink": "/r/AmItheAsshole/comments/12bl3gk/aita_if_i_take_my_bff_to_a_free_dinner_instead_of/", "score": 154, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because that’s my brother in law, supposed to be a family closer than a friend.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Why in the world would you bring your BIL. According to your husband, it's \"my money, my rules\". So bring your friend! NTA.", "\" I won a... \"  You won it, not your husband.  You should get to pick the +1.\n\nNTA  Bring your BFF.", "NTA - You won it, you can decide who to bring. Its technically \"your money, your rules\" in this case!", "No, you wouldn't. The same way your husband says it's his money to do with as he pleases when you talk to him about buying BIL groceries all of the time, this is your $100 discount to do with as you please. Return the energy. NTA", "NTA.  You won it, you get to choose who accompanies you.  If your husband demands you bring his brother, just tell him \"My win, my choice\" as he seems keen to voice his views on the matter.\n\nYour husband, by the way, is an asshole.", "NTA - this is your prize, you should be able to spend it however you see fit.  That means inviting the people you want to.", "Nope, OP if you want to take your husband and your best friend to an expensive dinner, instead of bringing your BIL that’s your prerogative, in other words, you have the right to invite or not invite anybody you want, you won the money therefore, it’s your decision.\nNTA", "NTA. Take who ever you want. No need to explain your reason for choosing them to any one else.", "You won the prize, you can share it with whomever you want.\n\nThis is outside the obligation, your husband feels when his brother housed him.\n\nBIL didn't house you, you won the prize, you choose to take your BFF.\n\nNTA\n\nEnjoy your meal", "NTA. Just don't bring your husband and go with your bff. Do a ladies night with her. Your money, spend it however you please. Drinks, appetizer, main course, and dessert.", "NTA. Your prize, your rules. \n\nThere is nothing stopping \"my money, my rules\" husband from working more and bringing his brother...on his dime.", "NTA. Your GC invite who you want. \n\nOP - the “My Money My Rules” comment would indicate your not his wife but a housekeeper and nanny to him. Does he think what you do has no value? He is an AH.", "Nta. Your giveaway win your rules. Whatever your husband feels he owes his brother is on him with his money his rules attitude and is not on you to participate or contribute to this dynamic in anyway. Heck you don't even have to bring the husband......", "NTA. Your money, your rule", ">I feel obligated to bring my husband’s brother\n\nWhy? It's your winnings and your choice. NTA", "NTA. Your $100 giveaway, your rule.", "NTA. It's your voucher so you bring whomever you want. Your issues with your BIL don't need to have any relevance here.", "NTA in this case it's your money, your rules. You should bring your BFF.", ".... how many extra people are you allowed? You could bring both BIL and BFF.\n\nIf that's not an option, I don't think you'd be TA if you brought your BFF. \n\nBut sounds like there's some issues between you and your husband you need to work out as well. \"My money, my rule\"? Yeah, when you're married it kinda doesn't work that way anymore.", "NAH You won the giveaway. Should be up to you who comes to this dinner, and it makes much more sense for you to want your BFF there instead of this BIL (that it sounds like you don't really like).", "NTA bring whoever you want", "YWNBTA - bring who you want.", "INFO: How often is your husband paying for his brother's dinner? How much is the dinner usually?", "No you would not be the AH. You won the coupon, it’s up to you who you choose to take.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWAITA?\nI won a giveaway of $100 to a new restaurant in town. I am bringing my husband, but looking at the menu, we can’t spend all by ourselves. The restaurant said to just show them my social media account since they don’t have a system in place meaning we have to spend all the amount at one visit.\nWell, I prefer to bring my bff, but I feel obligated to bring my husband’s brother. I have a dilemma bc the BIL is extremely cheap. Every time we go out, my husband always pays for his meals. My husband sometimes also buys his grocery. I have complained to my husband about this as we all have our own family. A little bg, my husband lived with his brother for a year without paying rent, but paid for grocery. To me, we can’t be covering my BIL food for life. We have our own family, our own mortgage and expecting a baby. But my husband is “my money, my rule”. \nWhereas my bff, she always treats me well. She brought me to dinner, hosted parties, and buy me stuff with all her money when I was upset over my pet’s death.  In return, I also buy her dinner, host dinner, etc. \nWAITA if I bring my bff?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "First off “my money, my rule”? Sounds like financial abuse to me. Is your husband usually this controlling? \n\nThat said, you won the gift card so technically this is *your* money *your* rule. Bring your bff! You get to decide who to spend the money on and your bff will bring you more joy. Honestly I’d use it for girls night entirely and leave your husband at home. Go eat a ton of food and get a ton of drinks and have a blast without the guys cramping your style!", "NTA", "NTA it’s you’re money to do wish as you please. This is a good example of how social capital works though. Obviously, gifts and favors should be extended without the assumption of being “paid back” later. Yet, if you’re always in the receiving end (taking from you social capital) and never on the giving end (adding to your social capital) eventually your social capital will run out (think of it as a bank account). You have to refill to continue receiving the benefits of social capital. \n\nIf you’re always asking for friends to help you move apartments but never show up when friends need help moving, eventually no one is going to want to help you move. Humans evolved to (unconsciously) recognize and avoid one sided relationships. \n\nThe whole theory is much more complicated and takes into account that things are always a 1 to 1 exchange, but this is just as a brief example of evolutionary psychology in action! \n\nDon’t feel bad, the choice to take your BFF is the same choice humans have been making for millennia and it’s one reason we’ve been so successful.", "NTA It’s your money spend it on who you want.", "Just take your BFF.  Both of you eat your fill, and then use up the rest of the credit getting food to go.  Both of you take that stuff home and use it for lunches or dinner at home.  Leave husband and BIL to manage their own meal.", "I don't get why BIL is even on the list of people to bring.  Just bring your BFF, NTA.", "Your husbands money, his rules.\nThen your money your rules. This is your money so enjoy your BFFs company.\n\nThat said you’ve a problem with your husband that the two of you need to address moving forward. And it’s not a simple as my money my rules (which is also a shitty way to treat a spouse).", "Nta bring your BFF. Since your husband wants to play the \"my money my rules wjo he pats for\". Then use that same logic too. You won this so you get to choose who you invite.", "NTA. \n\nI would take off and only treat my bff (and maybe another one of our friends or a close female relative). \n\nI’d leave hubby and his brother on their own. If hubby wants them to eat dinner together, they’re welcome to it—-on hubby’s dime.", "Can you really not spend $100 in a restaurant? God I could, easily. Buy a couple of bottles of wine to bring home. Or dinner for the following day.\n\nIf you really want to take someone then it’s your prize and your choice. NTA.", "This! Here! As your hubby has said it's his money so he can pay for his brother if he wants. Well this is your \"money\" that you win and so you get to decide on who it is spent on. If he wants to take his brother to this restaurant then he can pay for both of them to go.", "Look at the post history, I wouldn't even take the husband.", "Agreed. If he wants his BIL to go, he can give up his place", "I agree.  To me that is a huge red flag.  NTA", "EVERY time we go out which is like every 3 weeks. He never offered to pay, not even once. Dinner is usually minimum $15 not including tax and tips.", "Unfortunately, BIL doesn’t see it that way. He sometimes also comes over and grab our stuff such as ramen, canned food, frozen food. I get super annoyed. When he does “help” care for my pet when my pet was still alive. He would bring his laundry over to do at our house. I am speechless.", "NTA. You won it, you get to invite who you want. Sure it may not equate to a years rent but you were not part of that deal. You husband was so he can spend his money on his bro. Maybe make it a girls night?", "It still sound cheaper than a year's rent though.. but you won the money, it's yours to choose what to do with.", "Doesn’t really matter too much now he sees it though, does it? Change the locks and have your partner set some boundaries. BIL is a taker and a user and it’s not going to get any better on its own", "That’s true I don’t think the arrangement is necessarily wrong but no need for OP to use her money on him", "I can't see why they'd be an AH at all either.. there's no obligation at all; and the argument is quite simply 'We always take your brother out, i'm 'paying' so I'm choosing who to bring'.\n\nOR.. bring BFF and BIL and let the husband pay for his brother's bill, or anything over the $100 voucher.", "NTA. BIL isn't entitled", "Nta. It’s your win, bring who you want.", "NTA - Bring someone you enjoy being with and have a great time. Taking your BFF sounds fun. You're not obligated to feed your BIL.", "NTA. Bring who you want", "NTA\n\nYOU won the contest YOU get to decide who comes along. I'd leave hubby at home and you and BFF go hog wild and order everything on the menu that you want to try.", "\"his money, his rule\" right? Well you won this giveaway, so now it's\"your money, your rule\". Take your bff and tell BIL to go suck it.", "Oh boy"]}