{"id": 14034, "submission_id": "12c0r8k", "title": "WIBTA if I cut up my grandma's unfinished quilts and made them into clothing?", "selftext": "My grandma (88F) is a wonderful quilter. Everyone in our family owns multiple quilts made by her. Unfortunately, as she got older, she lost her ability to see and had to give up her hobby. She has many completed quilt tops that she expressed wanting to have finished one day. However, they remain unfinished and have been sitting in storage for years.\n\n&#x200B;\n\nFor context, I (34F) am a small clothing designer, focusing on upcycled materials and handmade designs. Several years ago I asked grandma if I could have her fabric supply to make clothing. She gave me a lot of scraps and unused material but did not want to give me the quilt tops.\n\n&#x200B;\n\nMy mom has been slowly helping grandma clean out her house in preparation for the inevitable. Recently, my mom returned from visiting grandma and gifted me 12 quilt tops. I want to turn these into cardigans and sweaters, to both sell and give away to relatives, but I am conflicted as I know grandma intended to have these quilts completed. From what I understand it costs $300-$500 to complete a quilt.\n\n&#x200B;\n\nWould I be the AH if I made the quilt tops into clothing? I can't really ask my grandma because she lives far away and can no longer talk on the phone or text.\n\n&#x200B;\n\nEDIT: Thanks everyone for your feedback. The main thing I took away is that I need to have more communication with everyone involved. I called both my mom and my aunt to get more details. As I said in the original post, grandma is incapable of talking on the phone. A few things I learned after talking to both my mom and aunt: \n\n1.) Grandma has 40+ quilts set aside for family members and potential future family members. \n\n2.) All grandma's quilting machines and supplies were gifted by her to my cousins that live locally. \n\n3.) Those cousins were made aware of the unfinished quilt tops and chose not to take on those projects.\n\n 4.) Grandma was shown a picture of the patchwork dress I made with the scraps she gave me several years ago and really liked it.\n\nI know this is not the explicit \"go ahead\", and I will take no action until I get the ok from grandma (I asked my aunt to talk to her, I won't be able to visit for several months). Thanks again to everyone who took the time to comment.", "created_utc": 1680651045, "permalink": "/r/AmItheAsshole/comments/12c0r8k/wibta_if_i_cut_up_my_grandmas_unfinished_quilts/", "score": 135, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the AH because I want to cut up my grandma's unfinished quilts to make clothing, even though I know that wasn't her intention when she created the quilts.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You want to take an elderly woman’s work to “upscale” into clothes when she has clearly expressed she doesn’t want you to do this? She literally can’t finish her work because she’s dying. That’s just… not right. Does she even know you got the quilt tops? \n\nYTA", "YTA\n\nYou already asked her for the tops and she didn’t want to give them to you to be made into clothing. You know she wants them to be finished. \n\nShe’s still alive and even though your mom gave those to you, respect your grandmas wishes and don’t make them into clothing. \n\nLearn to quilt or find someone who does quilt and can finish them.", "YTA simply because grandma has already given you her answer--years ago, when you asked for her fabric to make clothing, she did not want to give you the quilt tops. Moreover, you're not doing it exclusively to honor her, you're doing it (at least in part) to sell the clothes you make.\n\nIf you can sew clothes, you can sew a quilt--including by doing simple straight stitch machine quilting yourself. You could upcycle a bedsheet for the quilt back and get some batting on sale. The $300 to $500 price you quoted is only if you send out the quilt for professional long-arm quilting and, even then, the price seems high.  Point is, if you really want to honor grandma, use your talents to finish these projects the way she wanted, not turn them into something else.", "YTA\n\nIf you can sew, finish the quilts yourself. They would make great gifts for future generations. You already know your grandma doesn't want them to be cut up and made into other items.", "YTA\n\nShe already gave you all the unused materials, she only wanted to keep the quilt tops, because it was a dear hobby of hers. If you don't want them, you can give them to your other relatives. I think it's disrespectful to ignore her wishes.\n\nIf you really want to, you can wait and ask her again if you have the chance, but I don't think you should outright ignore her answer, that she has already given you. I am certain, that you could afford to buy the fabric to make other clothing or simply wait to get a proper answer. Or maybe you could ask your mother, what was her intentions and what did your grandma tell her, when she gave her the quilt tops.", "YWBTA. \n\nShe's already said she doesn't want that. And even if she was okay with it, it would be crass to make them into clothing to sell. I could almost be okay with gifting them ALL to family (again,  if grandma was okay with it, which she is not). Because they're heirloom pieces,  not to be \"upcycled\" for profit.", "YWBTA if you didn't ask your grandma first!\n\nA simple call would give you the answer you seek from the only person that truly matters where the quilts are concerned.\n\nNothing us Internet strangers say on this matters. \n\nYour Grandmother is alive and they are her quilts, if she say yes go ahead, if she says no finish them for her and make her happy.", "YTA", "YWBTA if you did this without speaking to your grandma or, even with permission, sold them. If you aren't interested in finishing them, find family member who would want them, either as they are or to have finished. If you want to make clothing from quilt tops, make your own. Your grandma gave her answer when she wouldn't give them to you before, so unless you ask now and get a different answer (that she's actually cognitively able to give) then you would be worse than an AH. The quilt tops should be treasured heirlooms and depending on where you are and what you're looking for as far as finishing goes, you can get them finished for less than what you've mention. If nothing else, look up tack quilting, it's pretty damn easy to do yourself and would maintain them as the quilts she intended.", "You know this was done by Ralph Lauren and there was a strong negative reaction afterwards, right?  It was considered tantamount to cutting up American history.  A classy move would be to finish the quilts and give them to family members at baby showers. \nYou can get cheap machine made quilts at goodwill and the like.  Try using those for your fashion projects instead.", "YTA.\n\nFind someone who would finish the quilts.  As your family members if anyone would like a quilt and tell them how much it would cost to finish.\n\nDo not cut up your grandmother's work even though you clearly don't value it.", "YWBTA. As someone whose passion is making things, nothing breaks my heart like watching someone dismantle something I put in time and effort into. You make clothes, you should understand this sentiment. Your grandma didn’t give you the quilt tops because she didn’t want you to cut them into pieces.\n\nEither finish them or sell them to someone who will finish them.", "I love the idea of clothes made from the quilt tops, but you gotta ask grandma first.  There must be some way you can communicate with her.  Whether you're mum 'gave' them to you is irrelevant - Grandma gets final say in what happens to them. \nIf the worst happens and she passes away before you can ask her, you gotta have a family round table and layout your ideas first. They are precious, irreplaceable family heirlooms with much more sentimental value than any brought item could have, so as such it must be agreed before anyone does what some may perceive as irreparable damage. Some relatives may want to have a quilt top to finish/have finished themselves. \n\nI say this as a quilter and someone who treasures many items handmade by now gone relatives, some of which I I upcycled in similar ways to what you discuss.", "YTA - if she was okay with it she would have given them to you when you asked.", "FYI there are groups out there that will finish the quilts for you or will take them and finish them and give them to charities.\n\nExample:\nhttps://www.looseendsproject.org/", "NTA all these non crafter ytas sheesh. JuSt MakE A QuILt. Dumb af. \n\nThey knew what they were doing when they gave them to you if you've already had a discussion about this years ago.", "She lives far away.  That is an excuse, and you know that.  Write her a letter.", "YTA. Why are we parceling out your grandma's belongings before she's even dead?", "Yta", "YTA\n\n“I can’t really ask my grandma” is a cop out. You HAVE already asked her. She said no. You know she doesn’t want you to do it.", "YTA unless, maybe, if you ask your family members if they want these quilt tops made into clothes, and if they do, you give them these clothes, for free. You know your grandma didn't want them made into clothes. Ideally, you would finish the quilts. But, if you can't do that, and your relatives agree, making them into clothes could be seen as an acceptable way to pass on your grandma's legacy. If you just flat out made them into clothes and sold them? No.", "Please get photos of the tops, especially if you are going to cut them up.", "NTA, do ask your family that lives close to your grandmother if they want any of the quilt tops your mother gave you.  Before you do anything with the quilt tops, ask your family how many quilts does one person really need?  If someone wants them, go ahead and let them finish them and display them in their home.  If no one wants them, do something with them that you will enjoy.   I'm a quilter, so I know what is involved in making a quilt, I also understand the issue of inheriting quilts and tops.    My grandmother was a quilter too, she died in 1972!  My grandfather remarried a year later and Mom thought step grandmother had disposed of Granny's stuff.   My grandparents had moved about 2  years before Granny died and apparently the quilts and tops had been packed in a wooden chest for the move, then put in the attic for storage.  Mom sold the house about 1997 and we found the quilts.  There are over 25 quilts and unfinished tops.  Those unfinished tops are doing no one any good at all, they aren't really very valuable to collectors, and I love the idea of making something wearable from them.", "Are these 12 quilt tops all of the unfinished quilts or did you mom give them out to various family members? What happens to these quilt tops if you don't make them into clothes? Would your family be mad if you made the quilts into clothes? Will anyone pay to have the quilts finished if you do nothing?\n\nIt's a tragedy that your grandma couldn't finish the quilts, but it's a waste if they all just sit unfinished in a closet.  I think it's important you don't upset your grandma while she's alive or offend your family by your actions.  BUT assuming your family is ok with using the quilt tops that way and that your grandma isn't hurt in the process, I don't think it makes you a good or bad person.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy grandma (88F) is a wonderful quilter. Everyone in our family owns multiple quilts made by her. Unfortunately, as she got older, she lost her ability to see and had to give up her hobby. She has many completed quilt tops that she expressed wanting to have finished one day. However, they remain unfinished and have been sitting in storage for years.\n\n&#x200B;\n\nFor context, I (34F) am a small clothing designer, focusing on upcycled materials and handmade designs. Several years ago I asked grandma if I could have her fabric supply to make clothing. She gave me a lot of scraps and unused material but did not want to give me the quilt tops.\n\n&#x200B;\n\nMy mom has been slowly helping grandma clean out her house in preparation for the inevitable. Recently, my mom returned from visiting grandma and gifted me 12 quilt tops. I want to turn these into cardigans and sweaters, to both sell and give away to relatives, but I am conflicted as I know grandma intended to have these quilts completed. From what I understand it costs $300-$500 to complete a quilt.\n\n&#x200B;\n\nWould I be the AH if I made the quilt tops into clothing? I can't really ask my grandma because she lives far away and can no longer talk on the phone or text.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: I know you are planning to talk to her and clarify, and that's awesome - not going to Y T A based on that edit. But have you thought about offering to make them into clothes *for* Grandma? She might like the idea of wearing her quilts more than she likes the idea of you selling clothes made from them. If she says okay, you can use one or two and make her some great stuff, and then maybe she likes the idea and lets you go nuts with the rest. Hell, maybe you've also landed the coolest model ever for your brand. If something looked good on me and my grandma, I'd buy two lol", "I am a quilter and I hesitate to rate this. Honestly, you are probably going to get a very mixed response here and rightly so. Each quilt has a story or a reason for existing. They were all made with love and care. Some people would be very happy that you were inspired by their work. Others would be very upset to see their works cut apart. \n\nI can not speak for your grandmother. None of us can as we don’t know her. The fact that she did not give you the quilt tops earlier makes me lean in the direction of, “she would not appreciate that” but I am not sure. \n\nI do however have an idea and an opinion. Make a jacket for your grandma out of the tops. Tell her that you wanted to giver her something to repay her for all the kind things she has done for you. Quilted jackets are the most common form of quilted clothing so I think it would be very appropriate. From there you can gage her reaction to see if it would be okay to do more. However, if you do make more, I wouldn’t sell them. These are the last things that she will probably ever make. They would probably be best as gifts to family and friends. They would appreciate the love that was put into them more than anything", "Would you be TA if you do the thing you know your grandma doesn't want you to do?\n\nDo I really have to say it?\n\nYTA", "YWBTA. Just in terms of labour/hours $300 to finish is actually quite low for a bed sized quilt. That also wouldn’t include additional costs like backing, batting and binding. (Personally I would budget /$500-$600+ if you’re looking for something more thought out than meandering.) \n\nYour gma gave you her answer. Either finish them as quilts or leave them alone. Leave your side hustle out of it.", "YTA", "Please don't do this!", "Clothing designer here. YTA", "That’s a hard no.", "You're not calling her because you know the answer *would still be no*.\n\nWhy did your mom give them to you? She had to know what you were planning.\n\nYTA", "YTA. You already know that your grandma's wishes are to have them finished, why go against it? \nPlus you'd rather just cut them up than actually make time to visit her and ask her is she's changed her mind. Double AH.", "YTA. As a quilter myself, I’d hate for you to do what you plan to do.  Find a quilter, pay them to make quilts and give one to your grandma. Your mother stole them from your grandma. This is heartbreaking. Wait til relatives know your mom took them and gave to you. They will have a feast with your mom, and you in the process.  How shameful.", "YTA, what you're suggesting sounds criminal. The hours of planning, picking patterns, matching colors, blocking, measuring, cutting, sewing... she wanted the quilts finished, not picked apart and made into clothes.", "Yta you asked and she said no. Either finish the quilts into quilts or give them back to your mom so she hire someone to finish them.", "I have a great aunt with lupus, she’s getting up there in age, just recently lost her husband. She’s into quilting, has been since she got out of the army back in the 80s or 90s I think, but she has multiple quilts that need to be finished and she can’t finish them all due to her lupus. In her will, she clearly states that any unfinished quilts are to be finished by the other quilters in the family and either used, or given away. YTA. Your grandmother is elderly, and the inevitable is in fact coming, and I can guarantee you will break her heart if you use those quilts as anything other than their designated use.", "YTA. I'm a quilter. I know how much time, energy, and love goes into making a quilt. Your post just made me quilt.", "YTA. Finish the quilts as they were intended and look for quilt tops at estate sales, flea markets, ets. Buy damaged quilt tops", "No.", "NTA . Finishing them, as clothing is still finishing! Grandma may have no idea that this is even a possibility as she thinks of only quilts. I like the idea of wearing something you made with grandma's handiwork. Show off grandmas skill to the whole  neighborhood not just those who get inside your house!", "NTA, I think it would be more meaningful to give them to family members instead of trying to make a profit off of her work. But either way nta", "[deleted]", "Sorry to say, YTA. She has been very clear she wants them finished and not cut up. \n\nI would find a local chapter of \"Project Linus\", \"Snuggled in Hope\", or a similar charity which specializes in making and providing blankets and ask if they would like the tops to finish. Since she has so many, I think this may be the best option overall, and they may even be able to oblige with some pictures or thank yous of the quilts with their happy new owners for you to pass along to your grandma to enjoy.\n\nA cheaper option for finishing them would be using the \"birthing\" or \"pillowcase\" method, and then doing yarn ties. SO much faster and cheaper, no messing around with binding, and no special sewing machines are needed. There are many YouTubes on how to do this. And usually you can finish a quilt off in a few hours.", "I really like your edit ❤️", "As I'm an avid quilter, the thought of you cutting those up just to profit from and not cherish is horrifying to me. I whole hearted would definitely think yes, you're the asshole.", "Yta how do you know no one else in the family are willing to take these quilts and finish them? Op sounds very selfish and entitled to things that doesn’t belong to them.", "YTA respect her wishes, she didn’t want them to be destroyed. What happened to respecting the belongings of the elderly?? Keep them as they are and cherish them, it takes a long time to quilt.", "YTA", "And it's also likely that she didn't intend for just one person to have (and enjoy or profit off of or whatever) those quilts; she likely intended for them to be one last heirloom for her whole family. So you would likely be going against your grandma's intentions on multiple levels if you take them all and upcycle them for your own personal gain.", "Good god…the family is already taking stuff.", "The price quoted sounds more like having it hand quilted by a very experienced quilter to me. Where I am, which I will admit is a low cost of living area, you can get long arm quilting and finishing for around $150, and that's with only supplying the quilt top. Very good, experienced quilters usually start at about $250 with you supplying everything. As you mentioned, it's possible to roll most quilts and straight line sew them on a home machine, or use fleece as a backing and batting in one and tack quilt it. There's tons of options, but OOP just seems to want to hack up their grandma's hard work and sell it. It's obvious they have no clue how much work and love goes into one. I feel so badly for the grandmother that her hard work and artistry has even been considered for what OOP wants to do.", "Quilting and sewing are totally different. I don't have the proper machine, knowledge, or time to finish the quilts on my own", "They are not heirloom pieces. They have not been in the family for generations. And everyone already owns multiple quilts made by grandma.  \n\n\nI understand your point about gifting only and not selling. Thanks for that.", "Yeah. I upcycle clothing as well and I LOVE quilted pieces. Your request seems reasonable as everyone in the family already has some of her quilts, and it doesn’t sound like anyone is interested in finishing these. \n\nBut if Grandma is still alive, obviously you should just call and ask.", "Can you provide a link to the news story? All I’m getting when searching is Ralph Lauren ads.", "Thanks for your feedback.\n\nI would not consider these quilt tops to be heirlooms. Everyone in the family already owns multiple quilts made by her. But based on this response and other feedback in this thread, I definitely will talk to all other relatives and allow them the opportunity to have any of the 12 quilt tops.", "Thanks for your feedback.", "These are great questions.  \n\n\nHonestly, I made a lot of assumptions based on the fact that my siblings, mom and I live far away, whereas my aunt, uncle, and cousins live in the same city as grandma. I made the assumption that everyone else had the opportunity to take the unfinished tops, and declined, but I can't say that with certainty. I will absolutely reach out to my extended family. Thank you for your feedback.", "I appreciate your feedback.  \n\n\nThe more replies I read, the more I realize that if I do decide to turn them into clothing, gifts to family and friends are the only appropriate option. Thanks.", "That's valid. I kind of assumed that other family members had first dibs and passed at the opportunity since we live the farthest away. But I will reach out to all family and see if they want the unfinished tops.", "Except her gram has already said she didn’t want that done, that she wanted them to be finished.", "Depending on how the family does it, it isn't necessarily a terrible thing. My grandma is working on giving her kids and grandkids sentimental things. When her mother died her sister got very entitled, to the point she and her husband and kids were harassing their step father. My great grandmother's will specified that he'd get to live in the house as long as he was able. Didn't stop my great aunt from doing her best to drive him out. When he finally died she started chucking stuff out into the lawn. Not junk, but pretty valuable things.\n\nThey may just be trying to avoid drama after she dies.", "Taking or being given things? My grandma was giving stuff away long before she passed, everything from the 'family heirloom china cabinet' to giving some cousin's of mine cookie jars. \n\nSome of it was to avoid drama or fighting (mainly about the china hutch) but mostly she wanted to give people things while she was still alive and able to personally offer it to 'em.", "It is probably regional pricing. I literally just shipped a quilt top to my mom to have quilted by a guild member near her because pricing in her area is like 1.5 -2 cents per square inch, and in my area it’s hard to find someone close to 5 cents per square inch. All the actual quilt shops near me are charging between 7-10 cents per square inch! I’m not even talking custom fancy stuff… just basic preset edge to edge!", "Then I would see if any of your family can or is willing to pay to have them done.", " I do both and can say with 100% confidence, clothing making is harder than putting a finished top onto batting.", "Strong disagree. I have sewn for a while and only picked up quilting on my own in the past couple of years, and you can definitely easily learn how to quilt and do a lot on a standard machine.", "They ARE heirloom pieces,  in that they were lovingly sewn by your grandmother and will mean something to the rest of the family when she is gone. I have 4 afghans my grandmother made. There is nothing I currently have or ever hope to possess that I wouldn't trade to have her back for long enough to make me another one", "Deleting comment because I misread", "How many of them there are didn't really affect how many hours of grandma's work, love and thought went into each one.  Frankly you saying they are not heirlooms makes me concerned that you don't understand their value. So, ai reiterate: Talk to grandma - maybe (hopefully) she's fine with it. Talk to family - agree what can be cut up, & for what purpose. \n\nBest case:  Hopefully some of your family will be thrilled at the idea of having a coat or whatnot made from grandma's quilt (I would be). They might be happy for you to use them in your design business.  But check first.\n\nWorst case:  If you cut one up without permission, and it turns out a family member considers that destroying it... well, if thar were a quilt top my grandma made and someone cut it up without checking, I'd call it unforgivable. Don't back yourself into that corner. \n\nThe difference between best case and worst case is just you having a conversation first", "You say everyone has multiple quilts made by her, but what if someone wants enough to pass on to their children/grandchildren? You may not see them as heirlooms, but you might be the only one in the family who doesn't see them as one and they will never get the opportunity to become one even by your standards if they're cut up and sold. I would definitely say you need to make a quilt (top, at least) before you ever consider cutting one up, especially one made by your grandmother. To destroy (or upcycle as you call it) her hard work... for profit, no less... is one of the most disrespectful things I can imagine. I mean, maybe if you hated your grandma...", "As a quilter with a shelf of quilt tops that I might never finish — and especially given what you said about gifts to family — NTA.  It’s about the process for me — I like designing them, buying the fabric, arranging and rearranging the blocks. If it were about finished quilts, I’d never start a new one when I hadn’t completed the last.  If the choice is that they sit unfinished on a shelf until someone a few years from now throws them away or giving them life… give them life.", "Maybe you’re right. Just, Op asks, grandma says no, then OP’s mother gives her a dozen of them. It just read like an end run around Grandma.", "Reading the post, I wasn’t sure. OP asked for some to make clothes out of, was refused. Then OP’s mother brings some,of the previously denied quilt tops home and gives them to OP. OP did not say they were from Grandma,she said her mother ‘gifted me’ quilt tops. It sounds like a decision the mother made.", "That's fair. Thanks.", "Oh my God yes.  New sewist here, my beginning quilting class was SO MUCH EASIER than even a simple dress.", "God clothing is so fucking miserable to make. Quilting is a breeze compared to that!", "I think one of the quilting subs might have a different response to this question. Someone with a lot of unfinished tops might just want them used at this point. As a quilter for 30 years, NAH.", "Op asked for them years ago and was told no,  but now has been given them. I don't see anything wrong with her making heirloom cardigans for the family, as the family would still be getting the grandmas hand quilted work alongside the work of another family member. This makes it extra special.  Asking a random quilter to finish what grandma started, as others here have suggested,  doesn't feel special at all.", "Uh....been sewing and quilting for 50 years. Quilting pieces is easy. Putting a quilt top on batting and making a sandwich is easy. But even if you rent a long arm machine, as I did recently to do the quilting, the work is absolutely grueling and lasts for about 4 hours. And that's the fasted, cheapest way to do it.\n\nGetting them quilted costs a few dollars a square inch. It's more likely to be around $250-$300.", "You did not need a long-arm machine to do basic straight lines for quilting. I've seen someone do straight line quilting for a bed-sized quilt on a Singer 1304. I've made several on a Singer 4452. And though it does take time, it isn't complicated or difficult to figure out.\n\nAnd  you don't need a machine at all for hand-tying.  \n\nIf OP doesn't want to do it, they don't -- I have no quarrel with that. That's reason enough not to finish the quilts themselves. But I do question the assumption that quilting is so difficult that someone experienced in sewing clothing can't do it.", "I quilt all my quilts on a domestic machine, its completely doable.", "NTA. Surely it's better to complete the quilts in a different way than have them sat unused in storage for years and eventually thrown away?", "Just read the updates.\n\nNAH if you get grandma’s ok or if she can’t give it due to her being unable to communicate, double and triple check with mom, aunts, cousins. Even if everyone says they are ok with this NOW, that may change when grandma passes. Also, if you do make clothes, consider saving them for family members. Or if you sell them, reimburse your family for the materials (as people may not mind you recycling the materials but may be angry you are profiting from the “destruction of grandma’s work”). Proceed with caution because grief is weird and you can’t predict the hurt that may happen once the quilts are cut up.", "If the quilt top is made you can literally use a solid piece for the bottom and sew the seams in. \n\nI dont think OP actually looked into finishing it..."]}