{"id": 14046, "submission_id": "12ci0yw", "title": "AITA, I'm being blamed for ruining someone's life and causing anxiety.", "selftext": "I broke up with my girlfriend of 3 years close to 4years, during the first wave of covid. We've never lived together, we were 20 and 21 back then. \nIt's been almost 3 years since, I moved to the other side of the country to continue my study and mostly to get away from everything.\nSince then, she's texted me almost everyday, asking if I had deleted her photos or not. Which I assured I had on the day of our breakup. \nYes some of those were sensitive, and yes I've deleted it all. She won't take my word for it. My life for the past few months has been brought down to a living hell. Where I've become her emotional punching bag of sorts. Whatever anxiety and other problems she's been facing has been blamed on me. I've kept my distance from her since. \nShe threatens to get her parents involved for some reason who are abusive and have tried to harm me in the past. Also one of the points to mention is that she was manipulative and would shut me out whenever things did not get her way. \nI've blocked her from everywhere, when she texted me from her new boyfriend's account. She got herself a boyfriend 3 days after we broke up, this is not the same guy however. Plus asked the same dude to call me up and kinda yell at me when I stopped responding. \nIt's draining me pretty bad. \nI've been accused of having cheated on her, when she stopped me from being friends with most people. When said cheating... It would mean to hug or be in the vicinity of anyone. It's been going on for a while. I've had my exams recently when I told her I can't talk much during this time, which was disregarded as any of my boundaries. It's a weird situation which has drained me a lot. Plus on a different tangent I've been blamed for talking behind her back she also texted the friend and had an argument with her who she suspected that I was talking to behind her back.", "created_utc": 1680696099, "permalink": "/r/AmItheAsshole/comments/12ci0yw/aita_im_being_blamed_for_ruining_someones_life/", "score": 50, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I broke up with my girlfriend. \nShe's blaming me for everything going wrong with her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nThis is awful, and she is extremely toxic.\nI would say you should block her immediately, if she has others contact you trough your number, maybe get a new one.", "Block her number, you moved away so there is no fear of running into her. BLock her number and any number that attempts to call of contact you. If that doesnt work involve the police with harassment charges against her.", "She seems like a damn stalker. Do everything you can to go NC and STAY NC. You're NTA.", "\\~ NTA But, you are guilty of allowing someone else to disrepect your boundries.  \nMake a choice for yourself and stop answering/reacting to her smearcampaign, emotional and verbal abuse, flying monkeys and questions, you don't owe her shit.", "NTA - Time for a new phone number?", "NTA. I would however contact the police about all of thus abuse.", "NTA, but don’t feed her “anxiety” or whatever she claims to have.  Just do not engage. Don’t reply. Do not exchange even one word with her and her boyfriend.  Block every new number that contacts you and she’ll eventually give up.", "NTAI would stop going on social media for a few months. You’re not responsible for her mental health or shitty personality. Seriously, stop engaging. THIS OS NOT GOING TO STOP UNTIL YOU STOP READING AND REPLYING TO HER. Cut all ties because you will never get to where you need to be. Some women might think this situation is a red flag against you", "NTA. Just no. You didn’t do anything except break up with her.", "NTA. Block every new way she tries to communicate. Do not respond at all, to anything. If she writes you a letter, send it back, unopened. If she sends you a package, send ot nack, unopened. She is sounding stalkery and you need to stop feeling sorry for her and start protecting yourself.", "NTA. Change your number and forget this psycho.", "NTA. Get a new number. Block her on everything. Move on with your life.", "NTA\n\nWhy haven’t you blocked her? Block her or get a new number. You don’t have to continue to be her emotional punching bag.", "NTA. Get a new phone number, new fb (with a pseudonym if you must), new everything", "bro what the fuckkkkk definitely NTA, block her number man and disappear from her life, that shit is not normal.", "NTA. Every new way she creates to contact you, block it. Discover that she’s calling using someone else’s phone? Hang up and block. How you’re feeling is why she’s trying to do this. Use caution when visiting your hometown. I would suggest trying to make sure that you have someone with you as much as possible in case she escalates her tactics.", "Nta. But why on earth are you feeding the troll? Keep all harrassing texts, vms, and a log of calls. Your last communication is that you will report her  and anyone else who joins in for harrassment. Block her, block him, go private on social media, do not pick up calls from nimbers you don't recognize, do not EVER accept any form of communication and get a restraining order if this gets worse. NO. CONTACT. you owe this person nothing and she sounds less than stable. You cannot help with her problems.", "NTA-Cut her out completely. You have no obligation to continue this toxic relationship.", "NTA - delete yourself from any platform she could find you on, get an alter ego or something so you can still be online if you like and if this person reaches out to you again in any way shape or form i‘d suggest just threaten some legal action because it‘s at a point that your quality of life suffers due to her being a nasty piece of work anyone who doesn‘t fuck her or didn‘t birth her can see that.", "NTA.  Block all known numbers and accounts.  Don't answer the phone unless you know FOR CERTAIN who it is.  DO NOT RESPOND TO ANY CONTACTS FROM HER OR HER FLYING MONKEYS.  Do not delete any voicemails/texts/emails/etc., in case you need them as evidence for a stalking case.\n\nAt this point, it might be worth your time to have a talk with your local police department. Give them the history and ask what you can do at this point.", "NTA - My friend get yourself a new number! If she doesn't believe you tough cookies for her! It sounds like she wants a reason to keep contacting you.", "NTA, why haven’t you blacked her. Such an easy solution. Come on man", "NTA. Send her a strongly worded \"do not contact me\" letter/email. Then just ignore her; but save the documentation.\n\nIf she continues to try to contact you, get a lawyer to send her a follow-up cease and desist letter. If needed, get a court order.", "NTA. You aren’t obligated to stay in a relationship you’re not happy in. Takes two people to make a relationship work. Sorry she’s a psycho. Give it time eventually it will cease and stop but it’s going to be years when she gets over you. Until then block her and change your number if you have too. Just learned your first rule of “don’t stick you dick in crazy!” This is why.", "YTA - you have no obligation to stay in a relationship you don't want to be in. Sounds like you dodged one crazy bullet. Best advice for you, get a new phone number.\n\nHonestly I'd even look into filing harassment charges and get a restraining order.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI broke up with my girlfriend of 3 years close to 4years, during the first wave of covid. We've never lived together, we were 20 and 21 back then. \nIt's been almost 3 years since, I moved to the other side of the country to continue my study and mostly to get away from everything.\nSince then, she's texted me almost everyday, asking if I had deleted her photos or not. Which I assured I had on the day of our breakup. \nYes some of those were sensitive, and yes I've deleted it all. She won't take my word for it. My life for the past few months has been brought down to a living hell. Where I've become her emotional punching bag of sorts. Whatever anxiety and other problems she's been facing has been blamed on me. I've kept my distance from her since. \nShe threatens to get her parents involved for some reason who are abusive and have tried to harm me in the past. Also one of the points to mention is that she was manipulative and would shut me out whenever things did not get her way. \nI've blocked her from everywhere, when she texted me from her new boyfriend's account. She got herself a boyfriend 3 days after we broke up, this is not the same guy however. Plus asked the same dude to call me up and kinda yell at me when I stopped responding. \nIt's draining me pretty bad. \nI've been accused of having cheated on her, when she stopped me from being friends with most people. When said cheating... It would mean to hug or be in the vicinity of anyone. It's been going on for a while. I've had my exams recently when I told her I can't talk much during this time, which was disregarded as any of my boundaries. It's a weird situation which has drained me a lot. Plus on a different tangent I've been blamed for talking behind her back she also texted the friend and had an argument with her who she suspected that I was talking to behind her back.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, this is harassment. Unfortunately, I can tell you right now the police won't do dick all unless she physically comes at you with a weapon. What you need is to find a lawyer who will work with you for cheap or free to send her a cease & desist, with threat of further legal action if she and her friends continue. This is how I got my stalker to back off. But it's important that you DO NOT reply to her for any reason. Let legal representation do that for you. Block her on every number and account she tries to contact you on, and forward those numbers and names to your lawyer, as well as reporting her usernames to any platform such as Instagram that she's using to harass you.\n\nGood luck, my friend. Hopefully she'll back off soon. Remember: this is not your fault.", "Of course you’re NTA. This is harassment, keep a record of it and report her. Also change your number for the sake of your mental health.", "NTA She sounds like an emotional vampire. Ugh... You broke up a few years ago. My concern is  why are you still entertaining or responding to her? Any reaction you give her only encourages her more because she receives a response from you. Cut her out of your life. Eventually, she'll obsess over someone else.", "NTA. I admire your compassion, trying to be there for her even when you’ve been broken up for years. But this is very unhealthy. She is still clinging to you 3 yrs later, and doesn’t seem to understand the nature of blocking. \n\nA block is a louder action that says, “I don’t want to talk to you”. Did she take each block as a challenge? Did she comprehend your casual contact with her, as a deeper soul connection this entire time? She’s living in her own fantasy world, and for some reason, blocks and a solid, “I can’t talk” aren’t bringing her back to reality. \n\nI would take advice from other comments. Get legal involved, and screenshot everything. This is harassment, which could turn into something far more dangerous later on (such as defamation, in-person stalking etc). She sounds unstable, controlling, and out of tune with reality.", "Nta but honestly grow a pair...\nStop talking to her. And stand up for yourself!", "NTA and she is stalking you. I’d consider filing for a restraining order for harassment and stalking for real. Keep documentation of all the text, emails, messages from SM, how many different numbers an sac out a you have blocked, and of course stay NC contact with her or anyone associated with her. Change your number completely, keep all SM completely private and don’t engage with her. If she manages to get through with a message or call, block it immediately and hang up without saying a word. Good luck.", "OP that sounds awful! My best suggestion is to make every social media you own private so she cannot find information about you. Make a new one if necessary for only close friends you trust without any obvious links to your name. If you can change your phone number then do so, otherwise never pick up numbers that aren’t in your contacts already. \n\nSame with your email. If you can change it easily, then do so. Otherwise maybe put some filters on it so any emails that have similar wording to what she sends get sorted to spam / deleted. \n\nDepending on your phone you might be able to make it that texts from unknown numbers don’t notify you. Part of the challenge here isn’t constantly blocking someone, but removing the anxiety that you’ll be contacted at any moment. \n\nWhen you go back home make sure you only tell your family that you trust so news doesn’t get out. Or if you can arrange to meet them somewhere an hour out. \n\nI also recommend going to the police if you can.", "NTA\n\nI get that you've tried blocking her, but you're really not trying hard enough. The moment you hear her voice, simply hang up and block the new number. Do this every single time. Social media is dumb anyway, so take a break for a year. Or switch to anonymous accounts only.\n\nWhat I'm getting at is that you still are allowing FAR too much contact here. She cannot force you to speak to her, or listen to her. Yet she keeps talking you into having full on discussions about all her crazy bullshit. Oh, her boyfriend yelled at you? Hang up on that goober, and block him too. There is *nothing* he has to say that you need to hear. Not one damn thing. But what about her parents? Same. Don't care. None of them get another second of your time. No exceptions. She's screaming? Hang up. She's sobbing? Hang up. She tells you someone important died? You guessed it: Hang the fuck up. You keep giving her something to work with by reacting in any way. You keep getting sucked in. You keep somehow giving a fuck what she has to say. Stop it.", "NTA, gather evidence and file a police report for harassment and get a restraining order. You are not responsible for her mental health and she needs to back the hell off.", "NTA\n\nAnd dude, please get another phone number and make sure that she never gets it.\n\nIf she keeps threatening you, contact the police with evidence for a restraining order.", "NTA - stop answering numbers you don't know. Make your accounts private etc... (Opting for only friends can message you...). If someone is legit, they will let a voice message, contact you by email etc...\n\nDo not read any letter/email you know are from her/her bf etc... She'll get tired of it, but you have to be clear in your behavior as well : do not engage, hung up, don't reply...  And ofc if it gets physical (like she does to your place or her bf) call the police.", "This sounds like a police matter tbh. I don't know how seriously they take this in (i presume the States?), but in the UK harassment is not treated lightly if causing distress to the victim.\r  \n\r  \nI wish you the best mate, i hope you can get on with your life despite what she's putting you through.", "NTA\n\nGet a new phone and don’t give out your new number to people who might share it with her.", "NTA \n\nGet another phone and phone number \nOnly give that phone number to new friends and family you trust \nObviously someone keeps giving her your phone number which means someone in your old social circle is to blame \nKeep the old phone on for like a month and keep it on silent \nLet her blow up the other phone \nMute all notifications from social media and take a break from it \n\nUse all the angry texts and calls to get a restraining order", "DOCUMENT DOCUMENT DOCUMENT!\n\nTake screen shots of ALL communications. Do not respond to them. Let all calls go to voice mail and save them. \n\nThen, get a no contact order.\n\nNTA", "YTA to yourself mostly, just don't respond and the messages will decrease and stop pretty soon. You're enabling her toxic behavior by responding to everything. She doesn't have boundaries, so either stop responding, go to court or keep suffering.", "Info: where is the part where you ruined someone else's life and gave them anxiety? All I'm seeing is your ex doing this to you.", "NTA.\n\n\nI would say you dodged the bullet but it keeps on turning around and zooming back. If she hasn't stabilized in the intervening years that means there was something else going on and the relationship was doomed to begin with.", "NTA clearly. I recommend to look up the Grey Rock method, maybe this works. Blocking/ignoring makes such people escalate (as witnessed here) so maybe this method will work. It is normally for dealing with, and eventually disengaging from, manipulative and abusive people especially when they are still close but the basic idea can be applied here as well.", "NTA. Block her", "NTA, but why on Earth you are even talking/texting her????? Just ignore and block every single attempt to contact you, don't entertain her. Her problems are not your problems.", "You broke up with her 3 years ago and she is still holding on.  That is her problem not yours.   \n\nKeep all her numbers blocked... But you also need to not respond at all when she contacts you from new numbers.   Never respond!!!   Don't respond to her family members either.\n\n Your responding is allowing this stalking to continue way longer.  Be strong this is not your fault.  She is manipulating you, just cut her off permanently for your own mental health.", "I've blocked 4 Instagram accounts, 1facebook account 3 phone numbers, and whatsApp. She made her new boyfriend call me and ask me to talk to her.", "Yes, I've moved far away, but I still have to go back to my city once in a while, because my mum and granny still live there and all my remaining friends are there.", "This. We are talking three years now, this isn’t normal or healthy behavior.\n\nLet her know you do not wish to be contacted any more, then STOP responding, to everything and anything. Document the continued attempts. If the harassment continues, this would seem to be getting into protective order category, and do it.\n\nNTA", "Possible", "I have disappeared from her life. I've moved across the country, for many reason, this comes in top 10. I've block 3 ig accounts 1 Facebook accounts 3 phone numbers.", "This is the way!", "Here's the fun part, I never got to stick it in her, just kisses and grabbing, never even under clothes.", "Might wanna change that to NTA then, otherwise OP gets voted as an asshole.", "How am I the ahole in that case? There's no restraining order where we are from.", "I'm not from any of the Americas or Europe, where I'm from police does fuck all to harassment and such cases, they just keep a record of what's happening if something major happens someday.", "Ow, since I had sensitive pictures of her, which according to her I still have, she's afraid I'm going to spread it around for the heck of it, that's what's apparently ruining her life, giving her anxiety and making her do everything. I've told her numerous times that I have deleted every single picture which she was a part of from my gallery the day we broke up, but she's not the one to take my word for an answer, idk what else I could provide. She's been keeping the same pattern of asking the same question then going onto a different tangent and making a mess out of my head for as long as I can remember.", "Seek out a lawyer to send a cease and desist letter. Take screenshots of everything. File harassment charges if it doesnt stop.", "Your being very passive.\n\nChange your phone number.\n\nDo the grey rock method.\n\nDO NOT ENGAGE AT ALL.\n\nGET OFF Social media.\n\nMake everything private.\n\nMove home.\n\nCut contact with friends who are still her friends.  \n\nContact a lawyer about harassment.    \n\nDocument everything.", "I would block everyone who is talking on her behalf. Hope, she did not reach for your parents or employer yet.", "Then hang up?", "Get a restraining order.", "This is harassment, report it to the police.", "Exactly", "If possible, don't shut off the old number. As long as she's still thinking it's your number, she won't search out the new number.", "This is stalking. If she forces your attention again, threaten to get the police involved. Then do it, if she doesn't back off.", "Change your privacy settings on SM to where people have to request to message you, idk if it's possible on fb but probably.  Also, change your number and only give it to people you trust since just blocking is obviously not working.", "Be glad you didn’t because she would be even crazier. Godspeed my good man I wish you luck op", "NTA, I’d still contact the police so they have a record in case she takes this further or convinces her boyfriend to go after you in some way.", "NTA, she needs therapy, you've done nothing wrong here. You need to be careful though, because this kind of behavior only gets worse. It's not going to be long before she has one of her new boyfriends visiting you.", "I think you need to do this too.", "I was just going to say the same thing.", "There's no such thing as a restraining order where I'm from. One could however file a case to the police who will keep it a file until something major happens to it and the case blows up everywhere", "Without recent physical violence even in areas that have restraining orders its highly unlikely...", "OP should do it now, there's no need for a warning. NTA obviously.", "yeah but there's a chance considering what the ex is doing is basically harassment and stalking"]}