{"id": 14060, "submission_id": "12cowlr", "title": "AITA for telling my sister her 4 kids are her plus one?", "selftext": "Im (30M) in the midst of planning a wedding and deciding everything regarding the guest list. We have a hard cap of people allowed given the venues small size. We can only have 105 people, anything after that would not be allowed due to fire codes and venue policy. I have an older sister Mia who's life is a bit of a mess right now. She and her latest ex partner and dad of one of her kids broke up in the last 6 months. She has 4 kids and they are all living at my parents' house for the time being.\n\nWe opted to not have a childfree wedding after there being so much drama about it so Mia's 4 kids between 4 and 11 will be at our wedding. She recently got her invite that stated her name and her 4 kids names. She then called me and said \"I assume as an adult I also get a plus 1\". We told her no, she's not a in a serious relationship and she and her kids are already about 5% of our total guest list. Our caterer also doesnt charge less for kids so we're paying about $400 for those 4 kids to be there, we dont want to pay another $100 for some random that she'd bring. She's not dating anyone but said she could easily find a date or bring a friend to have someone to dance with. We told her she has 4 kids there, that should be more than enough instead of having a \"plus one\".\n\nMy dad is my side, and is tired of her taking up their house, my mom is a little more sympathetic and saying I should allow her to have a plus one because thats what you do for adults. Spending $600 on just my sister her kids and a date when she's not seeing anyone seriously just seems ridiculous to me though. She is pretty ticked off though. Am I being the AH here?", "created_utc": 1680710366, "permalink": "/r/AmItheAsshole/comments/12cowlr/aita_for_telling_my_sister_her_4_kids_are_her/", "score": 8495, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the asshole for not allowing my adult sister to bring a plus one to my wedding.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. It's your wedding and your money. If she wants to bring a plus one then let her pay the $100 it's going to be to feed that person. If your mom is all for it then she can pay for your sister to have a plus one.", "NTA. She has options. Attend as planned, stay home with the kids, leave the kids with a sitter and bring someone to dance with, or my favorite, STFU.", "NTA\n\nMia doesn't need to bring more people to the wedding. She is already dragging 4 kids (who are all very young) to your wedding, so why does she think she gets to bring a random \"date\" to this event?\n\nYou are already wasting hundreds of dollars on her alone. Why don't your other guests get this special treatment?", "NTA \n\nYour sister is not in a serious relationship.  105 people is a hard limit - I wouldn't want to fill up a slot for some random person when it can mean that you would have to kick someone you actually know and care about off the invite list.  I'm sure there will be someone at the weeding that she can dance with.", "NTA. I would tell her she can bring her kids OR a plus one. Let her choose. You win either way.", "NTA. I think you're being VERY generous allowing her FOUR CHILDREN to attend...and she had the nerve to ask for an additional person??  Wow.  She's a bit of a choosy beggar, isn't she?", "NTA. If she is taking her kids with her, who she is expecting to watch them when she dances?", "NTA.  She will be there with her 4 kids and her whole family, she doesn’t need to bring some rando to keep her company.", "NTA\n\nHell it's not even just your rules (which would be enough on their own), if the venue has a cap it has a cap, fire codes don't care how old each occupant is.", "NTA. If she had a serious partner, that's one thing.  But she doesn't, so she doesn't need to bring a rando to your wedding.  She had 4 kids to keep an eye on, she'll be occupied lol", "NTA.  I don't even know where your mom gets off on saying \"that's what you do for adults.\"  You're not obligated to give anyone a +1 regardless of their age.  If your sister wants to dance with someone at the wedding, she can socialize with the other guests because that's what adults do.", "NTA\nI’ve been on both sides of this. 1) It’s not like you are telling her no plus one because you dislike her partner or similar. If no serious partner, shouldn’t insist and doesn’t matter who you are. As long as the rule applies for everyone, then it’s fine. 2) limited guest caps are real and it’s your wedding and your guest list and your money being spent.", "So if she brings a plus one, as well as the kids, then I have to ask...who the hell is going to be watching the kids? NTA.", "NTA It's really cute that she wants to wine and dine someone at your expense. A person you have never met and that she is not in a relationship with. I think that the wedding is about you and your future husband and should include people that you want to share the occasion with. If your sister can't have a good time without a date, then she should pay in advance for her date to attend. The wedding and reception are about the married couple after all. Who does she expect to babysit her children while she is dancing anyway? Are other people going to forgo the dancing and babysit so she can have a good time?\n\nSince you have limitations on how many guests you can invite and don't seem to have the extra money to spend, I think you are being reasonable.", "NTA. Your wedding, you get to decide. \n\nIf your mum wants to cave to her then your mum can pay the additional cost. Also I get the impression your sister may ramp it up and turn around and say she won't come if she doesn't get a plus one, do be prepared for that.", "NTA\n\n4 kids is more then a plus one", "NTA. Tell her she gets either to bring her kids OR get a +1. Not both. Her choice.", "NTA- but sis is ! Does she not get how much $$ this is costing?", "NTA \n\nEven if she did bring a +1 it doesn't sound like she really has good judgement in guys to bring someone you'd want around. Plus, if you give her a +1 how much time would she spend looking after her current +4 she's already bringing? Plus no one else is getting a +1 so it's not like you are singling her out for any reason.", "NTA.  She asked you answered.  Hold firm.", "NTA \n\nTell her if she really wants it then she can give you the money for it, your already paying so much for just her and her kids.", "NTA. You already caved to have the kids - she either gets a plus one or the kids. End of story", "NTA she isn't in a relationship.   She has family there she doesn't need to bring a random date \n\nThe only way I would give her a plus one is if she was already in a serious relationship when the invites came out", "NTA. You have a hard limit on the number of guests and have invited the people that are most important. I could maybe understand her being upset if she had been seeing someone seriously for a year or two or longer, but its a pretty normal thing for people not to get a plus one when they arent actually seeing someone seriously.", "NTA.", "NTA. She can dance with her 4 kids.", "NTA it seems like there’s already been so much drama you’ve been forced to cater to her needs just to keep the peace. Give her an inch and she tries to take a mile!!! Remind her that you’re doing her a favour by not having your desired childfree wedding for her sake and that’s where your charity on YOUR special day ends because this day is not about her.", "Info\n\nIn my culture, it's normal for the guest to gift money that is equal or greater than the cost for them to attend the wedding.\n\nFor example, if I came, I'd have to gift you $150. Which is $100 for cost of my meal + $50 as an actual gift. \n\nIs your sister paying this as well? I don't see a problem if she's gifting you $150 x 6 humans = $900 total. You'd get the $600 you spent on her back anyways.", "NTA, its YOUR wedding and honestly at that point I would tell her not to come at all. She sounds like a lot of drama and stress on a day that is supposed to be about you & celebrating your love for your spouse. Set boundaries and stick to them, and don't let anyone else manipulate you into giving in. The sister isn't ever gonna be happy, and will keep demanding more. So no more. As it is, it sounds like you *wanted* a childfree wedding and had to forego that specifically because of her. No. Its not her day, its not about her, and she isnt paying for anything. \n\nPersonally I would uninvite her & her kids entirely. Boundaries are hard but they exist for a reason. Stop stressing so much and focus on enjoying your special day.", "NTA. The day is not about her, and it's very sweet that you went out of your way to make sure your nieces and nephews are there. Explain that you had to bump a number of people off your guest list already to make sure your family is complete, ask her for some understanding. It sounds like she's touchy about being \"alone\" at a wedding because of her recent experiences, which is understandable.", "NTA, she’s unreasonable and you shouldn’t be expected to pay for a random person to attend your wedding.", "NTA.", "NTA", "Nope, NTA.\n\nShe isn't in a serious, committed relationship so why would you invite them? She's being entitled. I am sure your sister can dance with family and friends.", "NTA. It’s not her day, or her money being spent.", "NTA, but those kids are pretty young, and you might find yourself extra irritated when she can't wrangle them all alone for the day", "INFO: Would her kids even eat the catering food? Legitimate question. I have a 4 year old that I know the catering would be wasted on. Depending on their age would it be possible to arrange another meal for them?", "If it’s so important for her to have a date, suggest she pay for their cost. But regardless, I would special order those kids meals so you’re not dropping $400 alone for young children. Expecting to be allowed to bring 4 KIDS and a guest at $100 a pop is cray. NTA", "NTA. What is this thing with people being unable to attend weddings unless they have someone with them? I’ve gone to so many weddings on my own and had a great time. You presumably know at least one or two people at any wedding you’re attending, and if she’s your sister she knows a lot more, and it’s not the end of the world to actually talk to some new people. Why do you need a “plus one”?", "OMG - NTA. If she doesn’t want to come to your wedding without a date, she is welcome to stay home with her 4 spawn. Stand your ground!", "NTA \n\nTell her she can **either** have a plus 1 **or** her kids at the wedding. \n\nThat might give her some perspective. And if she does find someone to watch the kids and prefers to come with a date, maybe its for the better.", "NTA. Also, the reason some people like to bring a plus 1 is that they won't know anyone. Not the case for sister. Also,  who would be minding the 4 kids while she was with date? She can't just ignore whatever rando she drums up,  and it's not fair to pawn 4 kids off on other guests.", "She is 5% of the total guest list and **10% of your half** of the guest list.\n\nNTA", "Nta she has a +4!", "NTA, Your wedding your rules. Nothing else really matters.", "NTA, your wedding your choices. She should be grateful that her 4 kids are invited", "NTA", "NTA. When you have to count every single person, you have to keep your guest list short somehow. Not allowing any plus ones other than serious relationships is perfectly reasonable", "NTA.  Especially if you are shouldering the burden of wedding costs without help from parents.", "NTA", "NTA.  Stand your ground girl!", "NTA sounds like you should have stuck with the wedding being child free. People like her will always complain and want more, you should have the wedding you want instead of what others want and end up regretting it later.", "INFO: You don't seem to like her or her kids or want any of them there. Why are you inviting them at all?\n\nThis isn't really directly about being an AH, but if you've already invited her and her kids to keep the peace, then it seems like your options are either to let her have a +1 and save the hassle, or to accept that there's going to be massive drama anyway and cut her to save headcount. As it stands, you're getting like 70% of the drama of not inviting her *and* burning 83% of the headcount of letting her have a +1, which seems like the worst middle ground.", "INFO: does she have a “plus-one” she could bring not as a random date but as someone who can help wrangle her four young kids? Might be worthwhile to give her one.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIm in the midst of planning a wedding and deciding everything regarding the guest list. We have a hard cap of people allowed given the venues small size. We can only have 105 people, anything after that would not be allowed due to fire codes and venue policy. I have an older sister Mia who's life is a bit of a mess right now. She and her latest ex partner and dad of one of her kids broke up in the last 6 months. She has 4 kids and they are all living at my parents' house for the time being. \n\nWe opted to not have a childfree wedding after there being so much drama about it so Mia's 4 kids between 4 and 11 will be at our wedding. She recently got her invite that stated her name and her 4 kids names. She then called me and said \"I assume as an adult I also get a plus 1\". We told her no, she's not a in a serious relationship and she and her kids are already about 5% of our total guest list. Our caterer also doesnt charge less for kids so we're paying about $400 for those 4 kids to be there, we dont want to pay another $100 for some random that she'd bring. She's not dating anyone but said she could easily find a date or bring a friend to have someone to dance with. We told her she has 4 kids there, that should be more than enough instead of having a \"plus one\". \n\nMy dad is my side, and is tired of her taking up their house, my mom is a little more sympathetic and saying I should allow her to have a plus one because thats what you do for adults. Spending $600 on just my sister her kids and a date when she's not seeing anyone seriously just seems ridiculous to me though. She is pretty ticked off though. Am I being the AH here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, light ESH, but...\n\nINFO - Are you giving other single adult guests +1's just for the hell of it?\n\nYou shouldn't say \"Your kids are your +1's\", you should have said \"My venue has strict limits, so we capped it to invited guests only and no random +1's\"", "I could see putting this limitation on some guests, but your sister?", "NTA your wedding, your rules.", "NTA. She has an entourage with her already.  If your mom wants her to have a plus one then she can foot the bill.", "I wouldn’t have budged on bringing her kids. She sounds like a mess so I have a hunch that her kids are too. Hope they aren’t loud and annoying and hope they don’t ruin your wedding.", "NTA. Plus ones aren't promised for weddings, and she's obviously going to know people there already. \n\nPersonal rant: why is everyone obsessed with bringing a stranger to a wedding? It's one thing if the person anticipates being alone/without friends, but in these situations, it's just wild to me.", "NTA. Its your wedding - why would she get an automatic plus one as an adult. Also its a family wedding so I assume she'll know a lot of the people there so its not like she needs a friend to talk to.", "NTA. The only possible reason to allow her to invite a plus one is to have her on display as a cautionary tale working on baby daddy number five, in contrast to you (and hopefully everyone else there) who have your life together. It would be a poetic counterpoint to your marriage for sure 😅", "NTA .We didn't even allow kids at our wedding EXCEPT for the nieces. Some people got mad but I personally didn't care. I did not want to go into debt for a wedding. We spent about 1500 for everything and had it at my house in the backyard. The grandma got mad at us for not inviting the uncle but i told her I didn't want conspiracy theories being spread around about chem trails. Not the time or day. You're wedding is your wedding.", "NTA, based on the way your post reads it sounds like if she had a legitimate plus one you would even be kind enough to consider allowing them to come, so this doesn’t even come across as spiteful in any way. It just sounds like you’re already paying out and you don’t wanna pay extra for an extra, so to speak", "NTA. Tell her she can bring someone if she leaves the kids home. \n\nYou only pay 200$ and you don't have four kids at your wedding. It's your wedding! Don't cater to your sister.", "NTA \n\nMainly because Mia will have her kids there to watch, plus family and family friends that she can talk with. It's not like without a plus one she will be sitting in a corner with no one to talk to.", "Absolutely NTA. This is YOUR wedding. You do not need to make accommodations for anyone. You are paying for this yourself! Anyone who complains about the rules for YOUR wedding does not need to be there!\n\nSeriously! What is with people making demands of the bride/groom during a wedding??? Bffr...\n\nShe should be grateful she's even invited! \n\nThis makes me so mad!!!!!", "NTA. I get it may suck not having a plus one for a wedding but her children are taking up a considerable part of your budget after all and I gather one of the reasons you won't have a childfree wedding are indeed her kids so your choice doesn't sound unreasonable at all.\n\nShe'll pout for a bit but I'm sure she'll eventually come around.\n\nHave a nice wedding!", "Nope nta.", "No not a bit.  :)     Does your Mom always give in to her because she goes through SO's on a regular basis?     Actually from what I've read here you got a deal at  $100@ head for catering but still she should ease up considering she's costing you $500 already.", "NTA. Your venue's occupancy is capped. Your caterer's cost per plate is set. These are very clear constraints. Her attendance is already taking up a significant (for one family) part of both of those constraints. Given her romantic circumstances - it's not like you're saying her long term partner can't attend - your stance on this is entirely reasonable. She can dance with another guest, she can dance by herself, or she can stay home.", "NTA your wedding, limited costs and you're already covering her kids. it's bad form to bring a casual new person to a wedding.", "If you'r mom is so sympathetic then she should cough up the 100 bucks", "NTA I hate the “plus 1” expectation at weddings.  I didn’t want randos at mine.", "NTA, limited space and not in a relationship means no plus one.", "Tell her that if she wants a plus one she will have to pay for her half a basketball team she is bringing", "Am I the only one who wonders who is looking after the kids (remember,  youngest is 4, and no one is over 11) when Mia is out partying and dancing with her \"plus one\" at the reception?\n\nHell no. She brings the kids and looks after them. Or they all stay home. Or she leaves the kids with a babysitter and goes alone.\n\nMy guess is she wants a date to party with, and plans to have the parents of the bride look after the kids. \n\nNTA.", "NTA. As soon as you said fire codes that should have been it.", "NTA you already wanted a child free wedding and are not getting that because of her. She doesn’t need a plus one.", "NTA - seems like you didn't even want any children at the wedding from the start. changing your wedding and allowing her to bring her 4 kids (and paying for them all) is already so generous of you OP", "We had a solitary plus 1 for a single friend that literally only knew me and my husband. Everyone else if we didn’t have the name to put on the invite, they weren’t coming. Our rough rule was dating a year, engaged, or living together. We did tell our wedding party we’d be more lax if they wanted to bring someone but still had to be someone you were actually dating and that we’d met. I’ve danced more with friends than my husband at weddings we’ve been too so I think that’s a dumb reason to need a +1. Who will be watching the 4 children while she’s dancing with some random person?!", "NTA. Who is she planning to dump the 4 year old on while she dances with her plus one? Is she expecting the your parents to ignore your wedding festivities so they can babysit the grandkids while she parties? \n\nIf she had an SO, it would be wrong not to invite them. But she doesn’t. She’s a single mom of 4 little kids- they are her responsibility during the party. She can dance with her kids- I do it all the time. \n\nNTA", "NTA.  But how about a possible compromise?   Offer to let her do a +1 if she leaves her kids at home.  You can offer to split the cost of the babysitter.    Kids at that age will probably have more fun at home than at a wedding.  Just another thought.  Your sister will have a nice night celebrating without the kids.   I can understand where your sister is coming from, but she is not entitled to a +1.  \n\nNote:  I personally would rather have my niece and nephews at my wedding than a random stranger.   My wedding was very kid friendly.   Every kid got a gift basket with toys that were individual selected for them.   Also we had a bunch of LED necklaces, LED bracelets, etc.  The kids had an absolute blast!", "NTA, she's already got plus-four, which is plus-three more than anybody else gets.", "Aside from the outrageous price of weddings (100 for an 11 year old to not eat the food ?! my goodness!) you are absolutely not the asshole, honestly you're a saint for making this a 'kids included wedding.", "NTA How is sister going to dance when she will have 4 kids to watch at the reception?  Your family wanted kids at the wedding so she can deal with her own.", "NTA", "NTA! Have you asked your sister who will be wrangling her 4 young children, one of them being a 4 year old, while she's off dancing with her imaginary plus one? She'll have her hands full without a date. She can deal for one day.", "Nta give her the option. If she wants to pay for her and her kids she can have a plus 1. If not then she doesn't. Balls in her court then", "NTA. Hope the drama doesn’t get to you…have a glorious wedding ❤️", "NTA, it's your wedding and your money, you get to make the decisions.\n\nFor my wedding we also had a strict limit due to the venue and covid. We specifically stated that only those who were named on the invite were invited, there was no room for interpretation or plus ones.", "Tell her she has a choice…\nShe can bring her children or she can bring her plus one .", "NTA", "NTA. It’s you’re wedding, you made pricey accommodations for her, and she wants to bring a rando for someone to dance with? She should be grateful and not forget the reason she’s even going: to celebrate the union of you and your partner.", "NTA. Give her an ultimatum with the monetary value of what you’re doing. Do you want me to pay the $400 extra for your kids? Or do you want me to pay the $200 for you and your plus one, cause I’m not doing both.", "NTA - The can bring a plus 1 if she has a sitter for all her kids. I can’t believe she’d even be cheeky enough to make that assumption", "INFO: are there other children attending?", "NTA\n\nShe’s not in a serious relationship, anyone she brings will be a stranger to you. It’s ridiculous to think that you should leave out someone you actually want to celebrate your wedding with you in order to make room for some random she brings. \n\nIt’s not like she’s your friend from work and wouldn’t know anyone else there - she’ll know her/your family and can hang out with them.\n\nPlus if she has four kids with her, including a four year old, then she’s going to be busy parenting - so what kind of date is she imagining having? (Kinda kidding with that last one - based on how you report her behaviour in this situation, I suspect her plan would be to palm the kids off on your mum or just let them run wild).\n\nDon’t engage in debates about the $100 or who else is attending - the more you justify yourself to her & your mum, the more you keep it open as a subject for debate or negotiation. Just stick to the flat out no - it’s you & your partner’s wedding, you decide who attends and the answer is no.", "NTA", "NTA", "Personally I'm asking for kids not to be present at my wedding or after party", "Who's gonna be watching her four kids while she's hitting the dance floor with the rando she brought to your wedding? NTA.", "“ I assume as an adult I also get a + 1” \n\nFirst of all, as an adult, maybe don’t assume anything about someone else’s wedding. \n\nSecond of all, you got a +4??", "INFO: who the hell would want to go to a wedding of strangers, with some chick you just met and her *four* curtain monkeys?\n\n(And maybe that’s why the sister is pissed: not that she cannot bring a date but the implication she does not have one to bring.)", "NTA tell your mom when they pay they get an option. It’s your wedding. And it’s a ridiculous amount you are already paying for one person and her 4 kids.", "NTA…her youngest is 4?  Yeah, she needs to be supervising her children in the first place, not bringing a date when she is just separated again.", "NTA. I don’t think you need to phrase it as the kids being here plus one. It’s enough to say that she’s not in a serious relationship and you don’t want randomers at your wedding. \n\nOn an unrelated but sort of relevant note, 105 people is quite a lot of people to have at a wedding imho. My husband and I didn’t have 105 of our nearest and dearest that we were willing to fork out £100+ a head for. And we had five family kids at our wedding with no issues.", "INFO: is it common to assume adults just get a plus one? I’ve never heard of that before", "Nta", "NTA it’s pretty common ime for the plus one to be limited to people in relationships, not just bring anyone you want. Besides you have a hard cap on the number of people who can attend, you have no control over that at all.", "Geez, you could afford to pay a babysitter $200 to watch the kids for the wedding and still come out ahead.", "NTA - I'm so sick of that attitude about \"that's what you do for adults\" etc, etc.... NO, you do not have to give plus ones to everyone and end up with a dozen or more randos you don't know/aren't close with at your wedding! Even if your sister had been seeing someone for 6 months, if you didn't want to invite them you don't have to! People need to get over this entitlement.", "Tell her to pay a sitter and then she can bring a plus one? Hell, even if YOU paid for her sitter you'd be saving money.", "r/choosingbeggars", "NTA, it is your wedding, your money and your rules, she needs to grow up and understand.", "NO plus 1 for her.  Sorry, but your sister is leeching.", ">said she could easily find a date\n\nSo she would bring a random date that would meet her 4 kids on their first ever date? Those poor kids, I wonder how many times they've met mommy's newest boyfriend. NTA.", "NTA, your wedding, your money, your guest list.\n\nBUT it sounds like you do not like your nieces and nephews, children who did nothing wrong and that it so sad to me. Don't you see them as family?\nAnd if you can't afford to invite all family, I personally would look for a different location/ caterer etc.", "NTA - A simple No is sufficient.", "She's broke and Im not expecting to even get a gift from her. She didnt get a gift for my other sibling last year because money was too tight. I honestly dont care about the gift thing but Im already paying roughly $500 for her and her family, and extra $100 just feels unreasonable given she already is bringing 4 extra guests  \nMy partner and I are paying for the entire wedding ourselves.", "She's gonna have four kids there- she should be busy corralling her kids!  As someone with a four year old I would expect at least 60% of my time at a wedding to be child wrangling.  Add three more kids and I can't see how she would have any time to spend with a date.  And who wants to go on a date with someone and their four kids?  Even if it was just a friend, I would read that as 'come to this wedding to help me with my kids'.", "Also agree on NTA. The Being An Adult excuse doesn’t vibe with me either because I’ve been in wedding parties before and didn’t get a plus one because they were so strict with how many people were allowed to come. It is what it is.", "Good point.\n\nOP, tell your sister that she can have a) +1 or b) the kids, as the venue can't accommodate more than that.", "Really.  Leave the youngest two with a sitter, at least.  She wants to enjoy the wedding or spend most of the time watching after kids as young as 4?", ">or my favorite, STFU.\n\nI'm stealing that lol", "This is a great idea, but, I have a sneaking suspicion that if she is given this option, she’ll just show up with the kids and plus 1.\n\nSeems the type to make a scene and try to put all the attention on herself.", "This is the smart play, fair, and good strategy.", "I've never been someone's wedding date when they brought their kids with them. That sounds terrible.", "Not a bad idea", "Exactly, with the youngest of the children being only four.  An age where they won't remember much if anything about the wedding and where they're more likely to have a meltdown over something.  I wouldn't blame OP at all if they only allowed the 11-year-old to come.  For sister to still whine that what she's been given isn't good enough is mind-blowing.", "[removed]", "It is generous to allow blood related family to join a wedding?\nI also find the +1 request ridiculous and unnecessary, but thr children are OPs nieces and nephews. If you don't invite family of that distance, you might as well marry without guests or just family and siblings...", "So this! Technically the plus one is the 4 yr old, since she'll have to be hands on the full event!", "[removed]", "Yes part of being a parent is that when your kids attend an event you take care of your own children and ensure they are having a good time. When you have kids you make sacrifices, you don't expect others to watch and entertain your children while you have a good time at someone else's expense. How much time could she have for a date with 4 children in tow?\n\nShe can get a babysitter and go out for dinner and dancing using her own money at another time.", "Right?  Ask her who on the guest list she wants you to leave off for her to be able to invite some random person.  You have a hard stop at 105, not 106", "Right? I’ve been to plenty of weddings as an adult and never had a plus one. I somehow survived and had a decent time.", "Especially at a family wedding. I could see making an exception for someone who wouldn't know many of the other people at the wedding so they wouldn't be mostly alone but I'm assuming the sister will know plenty of the guests in addition to her parents and four children.", "No, even then, no. OP shouldn't have anyone at her wedding that she doesn't want.", "That would be the best, allows OP to invite 5 people who really do want to come.", "Thats considered pretty normal here as well. But no, she's broke and Im not expecting anything from her. I dont even care about that, I just dont want to spend even more money on her and to have a rando at our wedding in place of someone we'd actually know and like.", "Wanted to add - I worked weddings for a few years and they are very expensive. Spend the money on what matters. Also, hopefully she will be watching her 4 kids and not letting them run freely around a venue to get into trouble, which happens often at weddings. The day isn't about your guests, its about love between you/your spouse. Thats all that matters.", "We are not allowed outside food. The caterer has a kids meal option but its the same price. The older kids will likely eat the \"adult\" meal. The 4 and 7 year old will likely opt for the kids meal.", "We are not allowed to bring outside food. $100 a pop is absolutely cray but thats how weddings are..", "not a girl but thank you", "I’m certain it’s to keep the peace. I bet not having her at all would cause the families to fight etc, this seems like OP has been moving to avoid a bigger issue but I’m reading between the lines and maybe I’m not accurate", "I was wondering this too. The way OP keeps referring to them as her sister's kids and not her nieces and nephews is pretty telling. \n\nEither way though, I think NTA, cause I don't think anyone is entitled to a plus 1, especially if they are single.", "Seconded. If your goal is to avoid drama, then either go all the way or not at all.", "Why? It’s their wedding, they don’t want to pay. Sis can go or not go with the perimeters they have set out. As this sub likes to say “an invitation isn’t a summons”", "Only one person who is not in a serious relationship as a plus one. He is in the wedding party and coming in from out of town. We are also much much closer and him + plus one is less than half the cost of Mia and her kids. All other plus ones are at least living together if not married.", "If she was in a serious relationship or wasnt bringing 4 kids, it'd be a no brainer. As it is, we arent  close and Im already spending $500 on her and her kids to be there.", "What does their relation have to do with anything? Lol", "Then that’s your answer. No means no and you shouldn’t have to justify it to anyone. It’s your wedding and your money. Don’t let anyone bully you into doing something you don’t want to do. Your sister will be fine without a plus one.", "Plus the size of the venue. Don’t feel bad OP, your cash, your day, your way. Sister will get over it.", "Sometimes \"No\" is a perfectly fine complete sentence.\nAlso what does she plan on doing with her kids if she wants to spend the night/day with a random? Is she expecting your parents to watch her kids? In which case i would be telling her to stuff it", "Tell her you can barely afford her brood to be there, she will have to pay for the plus one if she wants one there, and that she is not entitled to spend any more of your money.", "You shouldn’t have to omit a friend in order for her to have an unspecified date.  You have space issues and her limit is 5.", "10/10", "Why are you even inviting her? You clearly don't like her and consider her and her children to be a burden. Why not just be honest and tell her you don't want her there?  It's bizarre that you're this caught up on the cost of having your own nieces and nephews at your wedding.", "This was my thought- a partner to dance with? Honey you won’t have time to dance unless you’re planning on letting your kids run wild!", "Also the younger kids, and probably the older ones as well, will have a lot more fin at home than at the wedding", "I highly doubt she's planning to watch them at all.", "You have an invite for you and 4 (however many kids) if you can get a babysitter for the youngest or whatever then you can exchange that seat with a dance date. Otherwise I’m sorry but we can’t afford all that. I’d love to accommodate you but I simply cannot here so you have to make a choice sis.\n\nNTA", "The 11-year-old would never forgive them for making them come while all their siblings got to have fun", "Exactly, who wants a complete rando at their wedding?!", "When it’s a tiny venue with a limited guest list, and $100 a plate, yeah it is generous.", "Yes.", "No. Don't do this. Sister is oblivious and will give an insensitive, genuine answer that might cause even more issues. It doesn't matter who she wants univited.\n\nNTA, OP.", "Yeah agreed…It’s not just about not wanting to pay for another person it’s that there wouldn’t be room for another person at the wedding, even if they are paid for.", "I think I phrased it wrong, but agreed OP shouldn't have anyone she doesn't want there", "Absolutely... OP needs to stick to her guns and not fall for the blackmail", "Mmm... if her date will fork out $150 to come then I think it should be okay. But if not, then you're NTA for denying her request.\n\nUltimately it is your wedding. Therefore your rules. Go invite the friend you actually know and want at the wedding. Get a bouncer if you need to.", "$100 a pop as an overall cost is normal, for young children, cray cray. But if that’s the rules, you should hold on to yours or compromise with sis on her paying for her guests ticket. Good luck!", "That's sort of my point, though; she has already given up a ton of ground and headcount by allowing the children to attend the wedding to keep the peace. At that point, making a stand about the +1 seems to be getting all of the drama and few of the rewards.", "NTA for not including +1s, but you mishandled your response & it sounds rude.\n\nHer kids are not her +1s. You are not giving out +1s. It’s invited guests only due to venue limitations.\n\nAlso, not sure your venue, but kids are often cheaper b/c they don’t drink, eat kids meals (so you may want to check).", "YTA - You think inviting your nieces and nephews to your wedding is a great favor to their mom, you clearly would prefer your own relatives not be there and you clearly don't have a lot of respect for your sister. \n\nWhy not just be honest and let her know that her and her family aren't important to you and you would prefer to spend the money elsewhere?", "But other guests are undoubtedly going to bring dates from non serious relationships.", "[deleted]", "...\n\n...\n\nWhat", "Everything? It's family, something you'll have almost forever.", "Or - tell her she can have a plus one if she leaves one of her kids at home.  Your guest list is at the max, and there isn't any room or money for anyone else.", "Since the sister is broke that’s a way to get sister ti back off.", "It sounds like OP wanted to have a child-free wedding, but maybe sister pushed to have her kids there, which is part of OP’s resentment about sister now also pushing to have a plus one. I think OP DOES want their sister there, or at least wants to avoid the probably nuclear family drama of not inviting her, but is tired of her continually pushing to take up more space on the limited guest list.", "Yeah… maybe she just finally had enough and decided to dig her heels in at this point. Maybe didn’t believe it would go this far when she started giving leeway. The audacity surprises me, at least… I’d never have expected a wedding guest behave that way but I keep having to remind myself that some people are just nuts who shouldn’t be given any leeway in the first place. Hindsight I guess…", "Who else would including 4 kids be a favor to? Also there's the hard cap of the guest list. A rando there for her is one less person we know and like that can be there.", "It’s a child free wedding. She’s already going against what she wants to accommodate her sister.", ">Why not just be honest and let her know that her and her family aren't important to you and you would prefer to spend the money elsewhere?\n\nSo your reasoning is that her and her family isn't important because OP doesn't want to let her bring a random person that isn't part of her family. Can you explain how that makes sense?", "Yes but they probably are not bringing four kids with them.", "She’s bringing 4 kids! I think she’ll be okay! NTA OP", "Only one person was given a plus one who does not live with their partner. That person is coming in from out of town and in the wedding party. All other plus ones are serious partners.", "family isn’t always #1 priority. Nor do they have to be the most important thing ever. \n\nSome friends are more important than family for some people and that’s honestly perfectly fine.", "The kids are family. I wouldn't give her the opportunity to leave a family member at home in favor of a new fling. Especially since only 1 kid would be left out.", "One…I was thinking all. All 4 kids stay home and she can bring a date I think is very reasonable 😂", "Honestly, I don't really think the sister of the bride, already bringing her four kids along, asking about a +1 is that audacious. The bride is free to decline, but yeah, as far as drama goes \"not allowing your nuclear family to bring a +1\" is pretty much guaranteed to start it and a sibling assuming they have a +1 is not that odd. The biggest issue here is just that AITA's very \"do you have the right to do X\" morality doesn't really work well when the actual question is \"how many seats at your wedding would you trade to avoid drama\", or any question about keeping the peace, really.", "That was what I was thinking. She bringing a new boyfriend or a friend with her will also mean that someone (family member or a friend of the couple) will be out of the guest list due to the small venue", "I suppose if she does not realize how much extra her (reluctantly invited) kids have already cost the OP then she might not realize how much more she is asking of her… but I’d think if sisters were to be making personal sacrifices and allowances for one another the sister who is a guest to the wedding should defer to the bride. \n\nIn any case, I’m just glad it isn’t my problem! Cause you’re right, at the end of the day it isn’t about the guest list itself so much as the cost and everything else behind the decision. Which is above my pay grade lol", "I think the idea is that it feels like an unreasonable request so she'd shut up and just bring her kids. But I don't think it's necessary to even offer that \"compromise.\"\n\nI mean, maybe she could leave her 4 kids at home and bring a random instead, but she currently lives with their parents so that would undoubtedly cause drama over babysitting instead.", "INFO: this really depends on what you've done for other people. \n\nYes it's your wedding, yes it costs a lot to have the kids there but at the end of the day you chose not to have a child free wedding and you shouldn't punish Mia by (scuse the pun) singling her out. If you are giving out plus ones to the adults you should give her a plus one.\n\nThat said, with a small guest list I don't think there's anything wrong with not giving every adult not already in a social unit a plus one. \n\nBut the rule has to be consistent otherwise you're just punishing your sister for having children, and from your comment about drama it seems like you're mad at her for having to invite four kids. \n\nYour wedding is the ceremony. Your reception is an event you host to celebrate with and thank your guests for attending your ceremony. You should be working to make them feel welcome, not resenting them for being there and counting costs. The cost is the same no matter who takes that guest spot,   if you're going to hand out plus ones, it's not your sister's fault she wants to be treated the same as other guests.\nEdit: thanks for the award kind person!", "I’m curious. You said you opted not to have a child free wedding “after there being so much drama about it”. Does that mean y’all WANTED a child free wedding originally? And is this sister “the drama” that caused y’all to relent?  Because if that’s the case, she has already 1) limited y’all’s ability to invite more adult guests in favor of children due to the capacity issue 2) and as you said cost you $400 extra dollars just for her invite alone. And now she wants to add a plus one for a supposed date when she doesn’t even have anyone in mind? \n\nNTA  (But you’re TA to yourself for giving her and others so much power over YALLS wedding day that YALL are paying for.)", ">\t4 kids\n\n>\tdad of **one of** her kids\n\nNTA. Just out of curiosity how many dads are there? She sounds exhausting and she’s lucky you’re allowing kids at all.", "+1 or the kids, her choice", "NTA she’s bringing 5 people!", "NTA - tell her to find a babysitter and then she can have a plus 1.   It is either the kids or the plus one.", "It kind of sounds like you suffer your nieces and nephews as a burden.", "NTA. She has 4 kids, and 3 under the age of 10. She needs to be watching her kids instead of worrying about a plus 1. Weird hill to die on and make a fuss about. SMDH", "NTA. At this point, I would tell her to shut up or don’t come. She’s not in a place to make demands, and you’ve already done enough by inviting four children.", "NTA. You are being gracious enough to turn your wedding into a wedding where kids can be. That is more than enough. If she doesn't like it, oh well.", "NTA, i'm 1 of 4 siblings, 2nd oldest, and only one not married yet....guess what, for each of my siblings weddings i have been single and never once did i expect a plus one just because i am an adult.  Even at 35 years of age I didn't expect or anticipate a plus one to my sisters wedding because I'M WASN'T IN A RELATIONSHIP! I danced with my family and their friends and had a grand old time.", "NTA, your sister sounds like a giant brat", "NTA shit with that many kids she needs to focus on them and not trying to find another +1", "NTA, however you are talking about your nieces and nephews not some random kids. Your sister sounds like quite the character…", "It's pretty common not to invite an expensive +1 these days unless the +1 is a long term partner or spouse. NTA. Sister might just have to dance with her kids or in the group dance circle that will surely form, like a law of nature, on the dance floor.", "NTA I don’t feel like you’re being unreasonable. I was invited to a wedding with a plus one and didn’t use it because I wasn’t seeing anyone at the time and I knew how much her wedding was per head. Also, because I was close to the bride, I was close to a lot of the people she invited. If she wants to dance with someone, she can dance with her kids or literally anyone else in your family. If she were a random out of town guest that didn’t know anyone else, then yeah, give a plus one. But she’s clearly not estranged so there’s no reason she has to bring someone just to have someone to dance with on your dime. \n\nCongrats on the wedding!", "NTA \nIt’s your wedding and she’s got a cheek expecting another invite when there’s already 5 of them going", "NTA.  This is more than reasonable considering she’s not in a relationship.", "Lol, NTA.  As a parent, if I was at a wedding with 4 kids aged 4-11, I’d have zero time for a date.  Id be running myself ragged trying to keep up with them…", "NTA. And tell your parents they can pony up for not only her but her and all the other kids attending since that is only happening for her. So if you parents want you to continue to tailor this event this is about YOU to what they want to see for your sister then they can start paying to have the event organized the way they want. At this point I would just say “you don’t have to come” because fuck this nonsense.", "NTA. For my own wedding we entirely nixed all plus ones just so we didn't have to pay for or meet any strangers on our special day. We only wanted to spend our time and money on people we already knew. \n\nTell your sister that your wedding is about what makes you and your new spouse happy, not what makes her happy.", "NTA", "NTA, it's your wedding. You choose who is invited and how much you're willing to spend, no one else.\n\nMy husband and I chose a child-free wedding specifically because of the cost. Our venue also charged kids as adults. If all of our parent friends had brought their kids, a full third of the guests would have been under 15.\n\nWith how limited your space is, the fact that you are willing to allocate 4 slots (and the associated costs), to kids who will very likely be bored is more than enough.", "NTA. You are paying, and your venue has a finite number of guests. She's bringing 5 people already, and that's sufficient and costly for you. Adding another person that you don't even know would be ridiculous in your circumstances.", "NTA\n\nLet's ignore for a moment that she doesn't have a current partner.  She got an exception to the childfree thing - which is going to cause you drama with some other people too.  This is a case in which it's fine to leave off a plus one even for a close relative.  She basically got plus *four.*  Who you're paying full price for.  She's already getting a sweeter deal than literally every other guest and wedding party member and she's demanding more?  She does realize this wedding isn't about *her* right?", "NTA. Her inability to be in a stable relationship does not constitute any right to “easily find a date.” She should pay more attention to her kids and the situation she herself is in than worrying about a plus one to dance with at your wedding. \n\nCongratulations on your upcoming nuptials, enjoy the day knowing you are NTA even in the slightest.", "NTA.  A +1 is typically for when you’re inviting someone who might be on the fringe and not know anyone there.  This is your SISTER. It’d be different if you were excluding a serious SO.  She’s being ridiculous.\n\nETA. I was ready to say YTA because your title made me think you were gonna make her pick which kid to bring lol", "NTA\nYour wedding your rules", "NTA - if someone isn’t in a serious relationship they don’t get to expect a plus one regardless of her children being there. She’ll be with family including her children - there should be plenty of people to hang with.", "That's rubbish I've never had a plus one when single. Even my siblings never gave or offered me one. Because I know loads of people there and it's about cost of things when you're just a normal person and not rich. You are NTA but your sister is a giant one.", "No answer if NO.  you have a set number of guest and your not willing to give up a set for someone you really want, for someone you don't know or care about.", "NTA. Weddings are expensive as is. Plus ones are standard to reserve for guests who are married or have serious partners only. One, you don’t want to spend money on randos, but you probably don’t want them in your wedding photos either. Also I don’t know anyone who wants to dress up and watch the ceremony of two people they don’t know. Plus with kids that young in tow, how late does she possibly think she can stay for the excuse of bringing a dance partner to even make sense? I work weddings and most of the parents with young children are gone by 8 or 9 unless their hotel room is on site for kids to go to, and most of the weddings last until 10pm at least, if not 12 or 1am. If she wants to dance just dance as a group with friends and her kids until it’s time for her to leave to put them to bed. Also even if the hotel is on site and she can put kids to bed and come back to the reception, a date would be a little weird if she was sharing a room or adjoined room with her kids.", "NTA. Your wedding. End of story", "Okay, first of all: NTA\n\nSecond of all, “no” is a complete sentence. She doesn’t need anymore explanation. If she’s mad? So be it. But she is bringing *four* children to the wedding and is not in a serious relationship. Stick to your guns, OP.", "NTA\nWho is going to watch her 4 kids while she's busy with her date?\n\nIt's your wedding and you get to decide who will be there.  You've already compromised on a child free wedding for her.  \n\nShe can either have the kids there or a date there and get her kids a babysitter. And honestly I wouldn't even give her that choice.", "hey i realized you mentioned you and your fiancé decided to NOT go with a child free wedding due to her not taking that well. here’s the thing. you’re already catering to her with allowing children to attend. it’s not her wedding. sorry but this day isn’t about her. nta. also your reasoning for not allowing her another +1 is justified due to the money and rules of the venue. she needs to get\nover it honestly!!", "NTA \n\nThe fact that she’d actually ask is quite funny.", "Uninvite her and all the kids, and give her 100$ for a nice date with a random +1. Yeah, I'm petty like that.\n\nedit: forgot to mention NTA. You're better than me, OP.", "I don't know how it goes where you live, but here you invite who you knwo, why would you spend money on someone you don't even know or have never met ? Maybe you can decide to add another person if a seat is left open, but I would prioritize your friends\n\nNTA", "NTA. Tell me you’re entitled without telling me you’re entitled. Your wedding, your money, your guest list. Not to mention what would happen if she were dancing the night away with a date- her kids would be running amuck without supervision possibly creating more conflict and disturbing the other guests, which is even worse IMO. You dodged a bullet here by doing this.", "NTA--also, if she wants a 'plus one' to dance with and whatnot, who does she expect to be watching her kids?", "I find it crazy when people complain about the rules at someone else's wedding. It's THEIR day, let them be\nNTA", "NTA.\n\nJust me, I'd send out a note that you've decided to have a child free wedding and send sister a new invitation +1, no kids. Parents will come, sister probably can't afford a sitter and won't come. No loss. \n\nI weep for the gene pool.", "Don't encourage her to bring strangers around her young children. She should have more sense", "I am a stickler for inviting partners no matter how long they've been together, but a truly single adult does not automatically get a +1, and that's a-ok.\n\nNTA", "THE NERVE!\n\nNTA - I can't believe she even asked! What the hell does she need a date for? She can dance with one of her kids. Anyway, who'd watch them while she'd on the dance floor? \n\n&#x200B;\n\nI'd take the invitation back, but I'm petty like that so don't listen to me.", "NTA. Based on the post & your other comments, your sister sounds a lot like my stepsister, which is to say... a total loser. LOL\n\nSorry you're having to deal with this. Just be prepared that she will try to bring someone anyway so have a plan w/the venue or your day-of coordinator. If you don't have one & can afford it, 10/10 would recommend!", "NTA - I don’t think you are the AH but I feel there was a better way to discuss things that didn’t sound so harsh. You could perhaps suggest she finds a nanny to watch her kids so she could bring a +1. It could potentially be a win win situation, you spend less and she gets to dance. Unless she is insistent, you could suggest her paying for her +1 if she really wants them there so bad. Other than that I do feel like there may a be a bit more of some unaddressed underlying issues that need to be discussed with your sister and parents.", "NTA - exactly who is going to supervise these children aged 4 to 11?\n\nso she brings some random person who needs to be minded for the whole event?! and then is this sister going to chip in 600 towards all these people she is bringing", "Wouldnt it be cheaper to hire a babysitter for the kids and let her bring a +1 instead of the kids?  Again, I know you dont support her lifestyle and choices, but this choice will result in the least amount of drama imo, which at my age is worth its weight in gold.\n\n&#x200B;\n\nFYI I understand what its like to have moocher siblings and the resentment that comes with it, so I dont want you to think im discounting your feelings -- they are valid.  Just want you to have a nice wedding.", "I’ll NTA. 600 is a lotta money 😱. Does she know how much it is costing you just for her and her 4 children to attend the meal?", "NTA.  Your wedding, your money, your decision.", "Simple answer: NTA.", "I'm probably going to be in the minority on this one... but... \n\nYTA \n\nI'll explain myself; have you gone to a movie theater or restaurant alone?  for most people that's a giant social hurdle.  going somewhere with someone is preferable to going alone.  You can't tell a mother of 4, that because she has 4 children she doesn't have the right to bring someone.  furthermore 105 people and not enough room for your own sisters +1?  \n\nyou're being petty and spiteful.  and i don't understand why.", "ESH. Calling her kids a plus-one was rude. Your nieces and/or nephews are guests in their own right whom you invited. If you didn't want them there, then you should've stuck to your guns about a childfree wedding. Don't act snide and resentful about a decision **you** made. It also sounds like you're judging your sister for her relationship situation, which isn't very kind especially to the kids who are innocent parties.\n\nHowever, you're in the right to decline her (what should be) request for a plus-one. I saw in your other comments that, with the exception of one groomsman from out of town, only people in serious relationships have gotten plus-one invites. That's a reasonable and common way of handling the matter. I don't blame you for not wanting some rando you'll probably never see again at your wedding, doubly so with the venue's policy and cost. Sister is TA for throwing a tantrum because she isn't getting special treatment. It's extra absurd for her to demand to bring a casual date at a family wedding. She'll know plenty of other guests. I'm sure she can find someone to dance with 🙄", "NTA. Give her a choice. Her kids or a +1. Or if she wants to pay you 100 bucks she can bring a plus one.\n\nI will wager she backs off real fast.", "NTA.\n\nOffer to pay for a babysitter for her 4 kids. Would be cheaper than the $400 you’re paying for their meal.", "You could ask her if the plus 1 would be the nanny? I doubt she's going to be taking care of her 4 kids during the wedding... I don't understand why you would even allow kids. And to pay full price for them? Including a 4 year old? I'd get a different caterer too.\n\nAnyway. NTA.", "$109,000 for a wedding is crazy, but she can dance with a cousin like everyone else who is single. \n\nShe can dance with her kids, she can dance with her dad, and the groom. \n\nShe can also dance solo.\n\nNTA", "YTA. One extra person isnt going to cost you much and it cant be hard to find space. It seems like you want to make a point to her that her life is a mess.", "NAH. I'm surprised by all the NTA, because your sister is not an asshole for wanting a plus one. Its very common for people to be allowed to bring a plus one to a wedding. I think her asking is totally normal. It's also fine for you to say no based on your reasons.\n\nI do feel like there's some judgement going on here. Like you seem annoyed that your sister is a mess and is bringing her kids to your wedding. If it bothers you, man up and have a child free wedding. It sounds like it would be cheaper anyways. \n\nEDIT: Also felt the need to add that it's weird to consider someone's children their plus one at a wedding in general. Your nieces and nephews are not strangers she's bringing along to the event. They're your nieces and nephews, and they're guests at your wedding, not \"plus ones.\"", "ETA. If she was in a serious relationship, I'd definitely say she should be allowed to bring her plus one. But since she's not, it's only mildly jerkish, though she's more in the wrong because she probably knows she's picking bad partners and should have empathy for your situation with having to plan a certain way for your wedding and not want to cause bad feelings on YOUR BIG DAY.", "YTA\n\n&#x200B;\n\nThis is easy: She will find something better to spend the time. Any reasonable person wopuld just not come to your wedding - you are an AH, why would she want to celebrate with you?", "NTA - She or your parents can foot the bill for her +1 if it’s really that big of a deal but you shouldn’t even have to concede that since you’re already accommodating having her kids there.", "NTA. I’ve been to about 13 weddings, some as a direct relative, some as a bridesmaid, some as a regular guests, and I don’t know if I had a +1 for any of them (I’m single). I never thought much of it and certainly never requested a guest if one wasn’t offered. You dance with the other guests and considering she’s family of the bride, I assume she will know lots of people there - at a minimum, her own kids!", "O already dislike your sister just trying your post... NTA and weddings are a great way to meet new people. Certainly there is someone willing to dance with her", "NTA! If she asks again, tell her she can choose to either have one adult +1 or her four kids, not both.", "NTA at all. It's your wedding, so you have all the say over who is and isn't there. \n\nAlso, who's gonna watch all her kids while she's distracted with whoever she decides to bring along as her plus one?", "NTA for saying she can’t have a plus one you are already spending 500$ to have her and her kids there.\n  But why are you telling us she separated from her ex and her kids live at you parents house. It come off as judgmental and unsupportive, we don’t know you think she’s a mess ( that’s just mean).", "NTA. you have a very limited guest list. You aren't leaving out a partner. You're just leaving out some rando \"friend\" for your sister to dance with. She can dance with your friends, dad, etc.", "NTA - Mom can pay for sister’s plus one if she feels so strongly about it. Otherwise everyone can hush up and get ready to celebrate and dance.", "NTA - I would never just -expect- a wedding invitation to include a plus 1. That’s ridiculous.", "NTA at all. It's your wedding, you get to decide the guest list. Who will you have to leave off the list so she can bring a random?\n\nBesides, the wedding of a family member is a family event.", "NTA.  What?  Is she just gonna bring some rando to your wedding?  Super tacky.", "NTA.\n\nIf she was even just seeing somebody for a couple months and not quite in the \"serious relationship\" stage but at least dating has been established with, I would say that it wouldn't hurt to find a way to accommodate her.\n\nBut I've always found the idea of making the bride and groom to pay for a seat for a date for no other purpose than to have a date ridiculous.", "Even without the kids, it’s typical to request only +1s for serious relationships nowadays. Weddings are fucking expensive!", "NTA - With such a small limit on guests having someone there who is just a random add is odd.\n\nWhat you can tell her is you'll add a possible +1 for her if you have some cancelations.  IE the B list.", "NTA. \n\nIf she wants to bring a plus one, then she should get a sitter for her 4 kids. How can she bring a plus one and dance with him/her as well as looking after her kids? They will run riot!\n\nShe has options and it is your wedding! Do as you see fit! If she doesn't like it, then uninvite her.", "NTA. I think that money is better spent to pay for babysitting. Young children really do not belong in wedding receptions it’s not fun for anybody involved including the kids. You’re already paying $400, might as well it goes to your peace of mind and your soon the be spouse.", "NTA stick to your guns", "NTA - I have been to several weddings where people that are not in a serious relationship don‘t get a +1. Your wedding, your choice.", "Id just say find a babysitter for the 4 sprogs, and she can a plus one. \n\nYou save in the process and she has to make a choice of kids or booty call. \n\nIm sure if it ended in costing her money she would take the kids.", "NTA, you are being more that reasonable. If she wants to bring a rando, you could offer her up to $200 for a baby sitter for the 4 kids and then she can have her plus 1. You'd come out a little ahead. Otherwise no.", "nta\n\nplus one is not a universal adult privilege. it’s super nice when you get one as an unattached adult without a ton of other friends/connections at the wedding, but that’s not the case if you’re family.", "NTA - it’s your wedding you can invite who you want and that doesn’t include her mystery guest", "NTA. Remind her to bring $200 for the food. And tell her if she carries on demanding more after you’ve already made an exception for her, she can pay the full $400. If she further pushes. Tell her not to worry about the money, she won’t be there anyway and invite someone who’ll actually appreciate and enjoy your wedding", "NTA.  \nBut have you considered asking her or your mom to pay for her +1? I doubt they will but it may give you some wiggle room to avoid irritation if they agree?", "NTA. You and your fiance are funding this entire wedding. $500 for her to attend. That's more than generous. She doesn't like it then she and her kids can stay at home.", "I'm probably out of touch here, but jeez! $100 per person for catering!?  \n\n\nBut that's completely beside the point. Your sister doesn't \"need\" a +1 if she isn't in a committed relationship. NTA", "NTA. \n\n>to have someone to dance with.\n\nThat is a lame argument as there are other guests she can dance with. Also with all her kids she has to take care off she likely won't have much time for dancing in the first place.\n\nThere is no reason at all for OP do invite a random guy she doesn't even know.", "Seeing she has a plus four already she could always opt for leaving the kids and bring a dude instead🤷🤷", "NTA. For my wedding we only allow the +1s we both (SO and I) know well. Even my friends in serious relationships understood that when there's like 60 guests in total, there's no room for people we are not close with.", "NTA\n\nWeddings are expensive (I'm planning and paying for one right now - we are not having kids) and you have to cut it off somewhere.\n\nBesides, her kids are aged 4-11? When is she going to dance? She will need to be watching her kids.  I mean, frankly if I was her I'd rather get a babysitter and not bring the kids and get night out of fun without having to worry about kids.", "NTA. Don’t let her control your wedding any more than you’re already letting her control it. Because she clearly is. Be careful. She clearly doesn’t care about this wedding; only herself.", "NTA. Shes being unreasonable.", "NTA.\n\nI'd revoke the kids invites personally.", "NTA if she doesn't like it her and her kids can stay home", "NTA", "NTA. But I would’ve stood my ground on the child-free wedding. It’s about you. Not about people with kids.", "NTA at all. It's entirely up to you who you invite.   \n\n\nAs an aside, 105 people seems like a pretty big wedding to me!", "NTA she should not be so entitled to assume that she can bring a plus one when it's your wedding so you get to lay down the law of who goes and who doesn't", "NTA", "NTA. If doing \"what you do for adults\" is so important to your mom, then she can pay for your sister's date and personally deliver the \"un-vitation\" to whoever has to make way.  \n\nThere are always hard decisions that have to be made in determining a wedding guest list because budgets and space are not unlimited. Someone who we'd otherwise love to be there will inevitably be left out. It should be considered an honor to be invited to someone's wedding, relative or not, because there are probably 50 other people that the couple could have justified inviting as well, yet they chose to make space for you, and they are probably commiserating over the people they've had to leave out. A guest giving them more grief on top of that because you weren't granted a plus-one when they could have not invited you altogether is entitled and ungrateful, IMO.", "NTA — It’s your wedding, what you want goes!!", "NTA, plus ones are a thing of the past when weddings didn’t cost an arm and a leg. If you aren’t in a relationship then you don’t get a plus one. Simple.", "NTA. She has plenty of options. \n1.) she can attend with only her four children\n2.) she can get a sitter for one or all of her children and bring a plus 1.\n3.) she can pay the $100 to bring a plus 1 in addition to her 4 children \n4.) she can not attend, freeing up 5 spaces in the venue. \n\nAll four options are reasonable choices for her to make. That said if she were to choose option 4, as by your comments it appears she would be unable to afford options 2 & 3. You cannot be upset with her for choosing to refrain from attending. You can be upset that she’s not there because you wanted her to be but you cannot/should not give her grief/ hold a grudge because she made that choice. Essentially be upset with the situation not with her, if that makes sense. \n\nI understand both points of view and you both just have to decide which route to take within the confines of the situation", "NTA\n\nIt's a wedding, not a bar. Let her date any other day, but this one is not a chance for her to dump her kids on someone else at a child free wedding for her to have fun with a random date.", "NTA. weddings paid for by the bride and groom are simply a giant private party and screw anyone who thinks there is some overriding etiquette to follow\n\nI didnt give single adults plus ones at my wedding. it was expensive! we had venue caps just like yours. I dont know this rando person and they dont know either of us so why should they be included to this day of celebrating my relationship!\n\nAll the adults this would have pertained to had tons of family and/or friends in attendance as well.\n\nno ragrets.", "Cheaper...pay for a baby sitter at your mom's house, bring in pizza and a movie. Maybe let 11 yo come to the wedding if they are behaved. Sister brings plus one. All happy,but if she keeps this up you may have to uninvite. She may bring a date no matter what so prepare how your going to deal with that.", "NTA your sister has 4 kids and is living with your parents, the LAST thing she should be doing is looking for a date for your wedding.\n\nNo is a complete sentence, and you have maxed out your capacity, there is simply no room, at the venue or in your budget, for her to round up some random guy to dance with.", "Every \"AITA for doing X at my wedding\" is an automatic NTA. This is literally the one day in your life when everything is supposed to be about you and your choices.", "The wedding I am familiar with allow plus one for long term relationships and spouses , not random dates. Have you thought about who is going to watch the 4 kids when she is on a date at your wedding.", "NTA. It's your wedding and she needs to understand how much just having her and her kids there is going to cost you.", "Would it cheaper to just have the sister come and get a baby sitter?", "NTA.  Tell her to pick which kid she's not going to bring.  It's your wedding and you're the boss when it comes to the guest list.", "NTA. Maybe she should be more worried about who’s gonna watch her kids than who she can dance with. Unless she’s expecting other people to watch her kids, like your parents.", "NTA as you say, it's not like she has a partner right now or anything that could've made you think that she would bring someone, and also she is not going to be alone or have no one to talk to, since your family is going to be there, but mostly as you said you can only have a certain amount of people so adding someone you didn't even know isn't really an option", "NTA you should have made it childfree though, you're going to regret it", "NTA. She can easily find someone to watch the kids and then bring her plus one. Your wedding, your choices. You’re being pretty lenient as it is.", "NTA. The sarcastic rear-orifice in me wants you to just uninvite your sister and the kids, give her the $600 and tell her it's to help finance getting her tubes tied.  \n\n4 kids? How many dads? Doesn't sound like she's making the best choices.\n\nYour wedding. Your rules. You already bent on the no-kids because sister drama. Stand your ground on this.", "NTA for not allowing a plus one, your wedding your rules. YTA for the not serious partner part, you should not be judging her. It's her life just like it is your wedding. This is a budget issue not a moral one.", "Nope. NTA, your sister is though.", "The sister was out of line asking for a plus one considering the cost of each guest. She obviously feels entitled.", "NTA\n\nSO IT SOUNDS like you’d have gone with child free  originally but because of her, you’re not. That’s a pretty big accommodation in itself \n\nGuess maybe she and her children don’t even hav to come if she’s going to behave that way \n\nYes wedding invitations aren’t summons—as AITA likes to remind people of. But it’s also a celebration of an important event in someone’s life. You get to choose who to invite and it doesn’t make a lot of sense to invite people who don’t actually care about the actual reason for the party beyond free food and booze and their special milestone too, particularly if you’re footing the bill", "NTA. Paying for a babysitter would be cheaper", "NTA\n\nYour wedding, your guest list. At those prices, your sister needs to keep her trap shut. She's not in a relationship and doesn't need to be bringing a rando there.", "NTAH!", "NTA! We didn't allow any plus ones unless they were engaged, married or in a serious relationship where we have met the significant other.", "NTA   \nAt $100 a plate for dinner, she should be grateful you're allowing her to bring the kids. \n\nWho's going to watch her kids of she's off dancing?  If she wants a plus one then she needs to find a babysitter.", "NTA - I am usually the biggest proponent for plus ones but she should be GRATEFUL her FOUR kids are invited!! Her reaction is so insane do NOT give her a plus one haha", "She will have her hands full taking care of 4 kids at the wedding - won't have time to dance!  Unless, of course, she expects the Bride to watch her offspring so she can enjoy herself??  NTA", "It doesn’t even matter how many kids she is bringing - A lot of people choose not to allow casual dates as plus ones and only let people bring their long term/serious significant others if they have one. \n\nWho wants strangers in their wedding pictures?\n\nNTA", "NTA. In the time of Covid, the church and venue gave us an extremely strict 120-person limit (1/4 normal capacity) due to social distancing.\n\nIt never even occured to us to offer anyone a +1. The names of who was invited went out on every invitation and that was it. I'd honestly forgotten a +1 was even a thing for weddings, because as you say, who invites randos to their limited-capacity wedding?", "1)  It appears there was drama about having a childfree wedding because of Mia.\n2)  Mia gets her way\n3)  Mia wants a plus 1 and doesn't get her way\n4)  Drama thy name is Mia,....Mama Mia that's not going to die right away.\n\nNTA", "NTA \n\nif it's a small wedding you don't want a random person to show up. The 4 kids are her plus one and she will need to look after them, so no dancing with a stranger at your wedding. \n\n\"she could easily find a date\" - I am sure she can. lol", "NTA", "NTA and honestly I’d have held strong about the kids as well. My nephews attended my wedding recently and as lovely as it was to have them there, my sister did not get to have a good time because they required so much attention.", "NTA...who the hell is going to be looking after her 4 kids whilst she is getting down on the dance floor?", "NTA. Your caterer, who charges the same price for adults and children, on the other hand…", "NTA, I designated to people plus ones. If not in a serious relationship, no need to bring anyone. Plenty of people to dance with", "It's not like she is in a relationship. Why would you want someone you don't know there?\n\nNTA. And your mother needs to but out.", "NTA. I would simply not invite your sister at all after she complained", "NTA.  Your wedding, your rules.  Give her two options 1) Her and her 4 kids.  2) Her plus one and you will pay for the sitter.\n\nThat is being way generous, and compromising.  As a mother of 4 she deserves a night out with a friend, she should jump on that deal.  Then you get to invite 2 more of your people.\n\nDon't let her drama bring down your wedding.  Tell her no and move on to other things.  If anyone brings it up again, simple say, \"I have already answered\" and change the subject.", "NTA she’s going to be busy watching her 4 children at your wedding.  She won’t have time for a plus one.", "I’ve been to plenty of weddings where you didn’t get a plus 1 unless you were in a serious relationship. Sounds like your sister is very entitled. Your dad’s reaction tells me it’s not just in regards to your wedding", "your sister needs to get a grip", "NTA - a lifelong friend invited me to her wedding. I didn’t get an invite (long story) so I asked her if I could bring a plus one as I was in a committed relationship at the time. She told me no and while on the inside I was a little surprised I said “ok”. And went to her wedding alone. Because it was her wedding.  Sis seems to be confused.", "*my mom is a little more sympathetic and saying I should allow her to have a plus one because thats what you do for adults*\n\nThen tell your mom to pay $100 so your sister can bring her kids and a date. Actually, tell your mother to pay for everyone in your sister's family if she is soooo sympathetic of her", "NTA it's your wedding, your choice. If she can't accept that, then she can just not go to *your* wedding.", "NTA. If you let her bring a random +1 are you also letting everyone else bring one? It's very common to put a cap on extra people. If you're not in a serious relationship of 6+ months, engaged or if neither bride or groom has even met them,  then they are not \"significant\" others in regards to a wedding, especially a small one.", "I'm not getting a plus one to my sisters wedding and I have no kids. It's full of family you don't need a plus one when you know half the people there.\n\nNTA", "NTA. Adults don't always get plus ones. And the plus one thing for unattached guests is usually more of a thing when people aren't close family, so that they're not alone during the festivities. As your sister, and with four kids in tow, she should be plenty occupied caring for her kids.", "NTA she should just enjoy the time with her kids.", "No. You could have told her to leave them at a sitter, still wouldn't be.", "NTA. Sounds like she is making a lot of demands at your wedding.  INFO: were you planning on having a child free wedding, and then changed the plan based on your sister wanting her children to be there? If so, even more NTA.", "I would say NTA. Weddings are very expensive and difficult decisions have to be made. I personally wouldn’t want to bring my four kids to a wedding but I know single parents have to make tough decisions. Childcare isn’t always available nor is it cheap.", "NTA. She’ll be full on watching her 4 kids surely!", "NTA. No discount for kids? That's rude, considering how picky kids can be with food they probably won't even eat enough to justify the price tag. Plus four and just their mom? I don't see much parenting being done at your wedding. NTA unless the plus one is a certified babysitter.", "NTA. I think it’d be pretty rude to bring someone that you’re not in a serious relationship with to a wedding, plus one or not.\n\nIf she were in a serious, long term relationship with someone, I would expect her partner to be allowed to come. But she isn’t. Perhaps if it was about bringing a friend who could help her with the kids, *maybe*. But, she’s indicated that it isn’t. A sibling’s wedding is not the place for a first date.\n\nIf she gets pissy, stress the hard cap. Say you’ve reached it, and to let her bring someone else would mean uninviting someone entirely, which you’re not willing to do on *your wedding*.", "NTA.  They're mouths to feed, and spots to sit.", "NTA but at my wedding I had enough room after some people couldn't make it that my cousins who RSVP'd with a plus one (even though I didn't give them one on the invitation) wasn't a problem. If it was too tight I'd have contacted them and explained. If she's just bringing a random or a friend anyway maybe you can tell her you'll reassess once you've got your replies and she can bring someone if there's room.", "NTA and your mum is wrong, that is certainly not what you do for adults. I’ve never been to a wedding where invites included random plus ones 🤷🏼‍♀️ invites for established couples are addressed to both, people not in serious relationships are invited solo and seated with other guests they know. And, who wants to go to a stranger’s wedding anyway?", "NTA. I’m of the opinion bring your kids OR a date. You decide but it’s one or the other. Your wedding, your money, your day. No one should be dictating any part of it other than you and your partner.", "Nta she wont have time to dance either. 4 Kids lol", "NTA - who is going to be watching the kids while she is going to be dancing and having a good time? She can hire a sitter and save you some guest space.", "NTA - adults get plus-ones if they're already in committed relationships, she's not. She's already got a huge presence at the wedding, and she can always dance with her kids, or your dad, or COUSINS or something.", "NTA\n\nI do not understand everyone’s fixation on a plus one.\n\nImo, plus ones are for people in serious relationships or people who will know no one else at the wedding. Family members will know other family members, so why do they need a plus one if they’re not in a relationship?", "NTA. Either her or your mom can pay for the extra person if they feel that strongly about it. Or better yet, get a sitter for the little fuck trophies, then she can bring a date.", "NTA. If she doesn't have a partner, there isn't a plus-one to invite. Why would she want to invite a random guy to her sister's wedding? I could understand if she wasn't a family member and wouldn't know anyone else at the wedding, but she's your sister and will likely know and have fun with most of the guests. She's being silly.", "NTA, I don’t think getting a plus one is necessarily a given for all adults at a wedding, especially a family one where you’ll know other people. I’ve only ever known people to get plus ones if they’re in a more serious relationship.", "NTA.  Just because you have reproduced does not make you an adult.  And even so adults are not automatically entitled to a plus one.  Stand your ground.", "NTA. I am an adult as well and have been to 3 weddings where due to venue size many guests, myself included, were not allowed a plus 1. I still had a blast and I hope your wedding goes smoothly with those kids there", "NTA in the slightest.\n\nShe's being unreasonable.", "NTA. Who is going to watch her 4 kids if she's on a date at this wedding?", "why can't she dance with a family member/someone who is already there? NTA", "You're allowed to make any rules about your wedding you want, so long as you're respectful about it, which you were.\n\nShe can accept your terms or not attend at all. Either way, NTA", "NTA. She doesn’t get a plus 1 just for being an adult. Our rule for plus 1s was bridal party all got a plus 1, and then the only other people that got a plus 1 were people who were in long term serious relationships.", "Tell her to choose between a date and a babysitter.\n\nNta. Your wedding, your rules.", "nta, she's already bringing 5 people, and she wants to bring another one???  like, who even?  some random dude she banged the night before? lol", "My only thought is allowing her to bring a plus one for the parenting support. As she is a (fairly) new single mom bringing four young kids going to a party, you might appreciate having someone else there to help wrangle the little ones so she's not relying on your already frazzled parents or simply losing control of them altogether.\n\nNAH because while I understand your side completely, I also understand her side. Maybe your parents would be willing to pay if it's brought up with the mindset of \"then you won't be forced to help with the kids\" lol", "Is the other adult she wants to bring a professional nanny or babysitter to keep the four kids in line? If no, f\\*ck her. NTA.", "A responsible parent would not have the time to not watch and care for her four young children at a wedding.", "NTA - an arbitrary plus one that you don’t even know at YOUR WEDDING would be a hard pass from me. This isn’t some random party. I’m guessing she doesn’t want to look “single”. But, she is.", "NTA. I do a lot of event organising and I've met hundreds of your sister. You literally could give her the wedding dress for the day and she'd complaining that it's not the right shade for her. These people will destroy an event if you let them and they'll walk away bitching about how awful it was.. yea Nancy, it was awful because we changed all the good things to suit you, and what was left was a pile of trash. \n\nDon't compromise, do it your way, the way you want it done and let them bitch and moan. The magic words are \" I've listened to your suggestion and we're going it this way *the way you were always gonna do it*, But thanks a million for your input, it was appreciated\"  Sandwich that 'NO fuck off' with nicieties.", "No, if she wants her kids to go then no plus one.if she does not like it she can stay home .", "Easily find a date? Who wants to go to a wedding as a first, second, third or even fourth date?\n\nRegardless, NTA. It’s your wedding, your money", "Adults don’t automatically get plus ones. People in long term, committed relationships get plus ones. You don’t just get to bring a friend because it’ll be more fun. \n\nAs someone dealing with wedding planning I really feel for you because it’s a nightmare but absolutely NTA and I recommend you hold your ground on this.", "Who does she think is going to watch those four kids while she's dancing with her plus one?", "NT\n\nHell, I wouldn't give her a plus one even if the kids weren't going. It would absolutely be just some random date!", "NTA. This is your wedding and you've already taken the L on not having a child free wedding which it sounds like was your original wish. You've already accommodated her, and there is no reason she should be entitled to a plus one. Weddings bring out TERRIBLE behavior from others. This is your day and you've already bent the rules for her to ensure her kids were there. So tired of people thinking other's wedding day should be about anything else beyond the couple.", "NTA… but, would the kids not count as family and general attendees? \nAs an aunt to 7 nieces and nephews myself, I absolutely plan to include all of them as general attendees to my wedding when it happens. I obviously don’t know the family dynamics, but I personally wouldn’t want them to miss out on my special day just because their mom is a hot mess. I understand not giving her a plus one, but I wouldn’t call her kids a plus one either.\n\nTry wording it a little differently so she has a better understanding of your situation.\n\n“Mia, I want you and the kids to be at the wedding. I want to see my nieces and/or nephews faces as I’m walking down the isle. I want to see you guys dancing and having a good time at the reception. \n\n“I don’t mean to upset you. I don’t want you to feel singled out. It’s just that I know you are a reasonable person and I want to be totally honest with you.\n\n“The guest list is already SUPER tight and we’re trying to include everyone we can. Our budget, however is already taking a huge blow with everything that we have to pay for. I was hoping that, as my sister and someone who I want to enjoy at my wedding, that maybe it could just be you and the kids? I promise you’ll have a good time without a date and I wouldn’t ask if I didn’t know whether or not you were in a relationship, I’m just asking this one thing, even as a wedding gift?\n\n“What I’m hoping for is that you know where I’m coming from in all of this and just enjoy being there with your kids and focus on having a good time with the family being together.\nHow do you feel about that?”\n\nMaybe see how that goes?", "Absolutely NTA", "NTA - your wedding your choice and rules!!", "NTA. I can almost guarantee that she won’t be giving you $500 as a gift to cover the cost to have her children there. It’s your wedding and it sounds like you’re already being MORE than accommodating.", "NTA - she’s being ridiculous and needs to learn. I would charge her the $400 for her kids if she wants a plus one (this way you come out ahead by three hundo)", "If sis decides to stay home, you $500 for your honeymoon.", "Bta who even considers a child free wedding.\nThat is just weird", "NTA.", "NTA\n\nBut if she keeps pushing, the alternative should be you saving at least $500 by uninviting all five of them (with that extended to your parents if they fuss). So she can either come with all four kids, a smile on her face, and plans to WATCH HER OWN CHILDREN, or let you know now if they won't be attending.", "Sounds like your sister needs to spend a little more time getting her shit in order and a little less time worrying about a date for your wedding.\n\nNTA", "NTA. Your first mistake was inviting kids just to appease her. Now she’s just assuming you’ll bend to her will.", "NTA. At all. I don't think your sister gets how weddings work, aside from maybe the \"free booze!\" part.", "She is your sister, let her come to your wedding with a partner. YTA", "Why doesn't you mum pay for your sisters guest then. Even still, that would be taking up the space of a person you actually know and want at your iwn wedding. Your sister is entitled AF. NTA. And if I were you my wedding would have been child free too.", "NTA\nWhile it's nice to have your younger family members at the wedding, it's 100% your night and not neccessary to please others wants for the night.  A lot of times if the parent isn't planning on keeping an eye on their kids(stating she wanted a plus one to be able to dance with... hard to dance and have fun while four kids 4 and up run around in a small-ish venue- *105 people total*) it falls on the rest of the wedding party or family members to keep an eye out. That shouldn't be the responsibility of anyone except the parent(s) or if there's a pre discussed plan on who's keeping an eye on someone else's kid.\nA wedding is a celebration of two people becoming one family. Not a requirement to provide your family \n a fun night out on your dime. \nYou said no that means no OP stand your ground and have a wonderful wedding\n\nEdit:typos and clarity", "This but if she wants to bring a date then 1 kid can not come...you are more than generous...", "She’s not planning to watch them. She is assuming other wedding guests/family members will parent for her.", "Am I stuffy or would it be extremely strange to bring a casual date to a major family event AND have them meet your *four* children. Like... who wants to do that? And what kind of boundaries are you setting?", "I would agree if OP spoke more about the random plus one. But there’s something a bit distasteful about fixating on how much it will cost to have the sister and her kids there. Like you’re throwing a wedding. Either you want your loved ones there or you don’t. Calculating the cost to have your loved ones at your wedding feels like maybe you’ve overextended yourself, or your priorities are off. \n\nOP is justified to only give plus ones for committed partners given the size of the wedding. But making it about the money is small and mean (in the stingy meaning of the word).", "She can also dance with her children. As she watches her children. Because that’s what adults do.", "I've been to four weddings as an adult so far. I got a +1 once. For the other three, one didn't have +1s for single people, one was a micro wedding (12 guests total) and for the most recent one my cousin called me, asked if I'd like a +1 and I declined.\n\nEdit: I had a lot of fun at all of those weddings and plenty of people to dance with", "This is well said, I hope OP sees it. It really sounds like OP wants to punish her sister in some fashion. It's very odd she considers her nieces and nephews \"plus ones\" as if they are strangers. They are literally part of her family.", "3 dads, but thats a whole nother subject", "According to one of OP’s comments she already has three Baby Daddies. So the idea of her finding a fourth in time doesn’t sound beyond reason…", "Every wedding I've ever attended had an option for a plus one. I think it's a pretty common courtesy.", "Quite frankly people need to stop compromising with this difficult and clearly irresponsible woman.", "Probably not, seeing her \"plus ones\" (sounds like there are at least two) won't even stay with her a few years to raise their own kids with her.", "If she wants someone else to come she should pay the extra $100 it would cost for her +1, OP is already spending $500 on her and her kids for the catering.", "You can’t be serious", "If she brings a plus one “to dance with” who is watching the 4 small kids?  That means other family members will be roped into babysitting during your wedding and/or reception.", "First, NTA.\n\nSecond, what I said (often) was \"are you paying for that extra person/extra people? No? Cool. Neither am I.\"", "NTA, and you are incredibly generous. $100/kid at those ages is giving spaces to your sister. Plus you already discuss fire codes and max limits. Stick to your guns.", "Also, she’s bringing 4 young kids to the wedding. She should be watching her kids full time, not dancing with some rando.", "Tell her she can bring a plus one if she leaves the kids home with a sitter", "Haha well yeah it’s real easy to be generous with other people’s money.", "She's broke.\n\nYet has 4 kids.\n\nAnother example of the mathematical certainty that the less you have to offer a child, the more fertile you'll be.", "You're entirely correct in your reasoning. Just try to be gentle and affirming in your communication with her instead of mixing it with other frustration about her life being a mess. It's really beautiful that you decided to not do child-free so her kids could attend. Drama aside, you must care about her. You actually aren't pressed about her inability to afford a present. That's nice and caring. Just try to remind her of that and don't engage with the negativity.", "$100 out of your own pocket for your sister to bring a random date she is finding last minute is absolute bullshit. It sucks that she's going through hard times, but from what you've told us it sounds like a lot of it has to do with her decision making. And this is no exception. \n\nIf she wants to bring a \"date\" she absolutely has to pay for it. Or she can get mom to pay for it. s\nShe has to actually work up the humility to ask her, which I doubt she will do. You have already bent over backwards paying for the kids, and they are already going to be an issue whether you realize it yet or not. They are going to get tired, and cranky, and complain. Absolutely draw the line with this.", "> She's broke and Im not expecting to even get a gift from her\n\nUnacceptable. You always either get a gift from the registry or you give cash to cover your plate and the plate of your plus one. I mean, she obviously is not going to cover her and her kids costs but the very least she can do is cover hers. She better start saving now to come up with the fucking $100 to cover her plate.", "ESH, your family doesn’t even like each other, you’re all annoying.", "This was my first thought, literally who is she planning on bringing along? Does she already have a new man?", "She wants to dance. My guess would be sister plans to dump the kids on her parents so she can enjoy her self", "I mean, let's be real, if someone's going to do it, it'd be a person like OP's sister.\n\nBut yes, it *is* extremely  weird to do that to someone. Hopefully, any potential suitor would see the vibrant red flags waving in their face, and run for the hills.", "I'd just like to say, don't discount kids and their memories.  My then 3 year old was a ring bearer for an aunt and still talks about it and has special memories from the day. \n\nMy niece's were 2 and 7 at my wedding and still remember it and we're a special part of the day.", "Yea $100/plate that a 4 year old is gonna eat two bites of? Definitely generous, considering if she’s not watching her kids they can cause so much chaos", "I don't know why you're being downvoted here. Kids are not plus ones, and the \"four children\" are literally nieces and nephews of OP. They talk about them like they're some strangers that are tagging along to the wedding. They're *family.* OP is acting like they're doing their sister some big favor by allowing their children to attend their wedding. If they don't want them there, they should man up and make it a child free wedding.", "That’s so weird, I’ve never seen it if people don’t have serious partners", "I agree and was wondering about this, too.", "Yeah of course, I’m just pointing out on potential benefit I hadn’t seen listed yet. Four kids under that age can be disruptive with just one person at a high-stress event like a wedding.\n\nOP doesn’t owe it to here but it might be worth the cost for a more peaceful wedding.", "Well, yeah, that’s why I said not a “plus one” as in a date but a “plus one” as in someone who can help her manage the kids. Family friend, family member from dad’s side, hell she could even bring a babysitter to assist.", "Only tacky AHs charge their guests for a weddding invitation.", "Of course this is serious. Her isster is an AH, why should she go to the weddding?", "As someone who previously worked weddings, I can say from experience that no one watches the kids if the parents do not watch their own. They run off and usually get into trouble. I've worked multiple weddings where unattended children ended up breaking things at the venue because no one wants to babysit at a special event. Which is why I personally think weddings should be childfree, but thats just my experience from working so many.", "Very good point!", "The sister can barely afford her brood by the sounds of it but is still popping them out", "Being gentle to the sister has gotten her nothing this far except 4 kids…", "She is immediate family — OP presumably wants her there (or wants to avoid the fallout from not inviting her) whether she can pay or not. It’s not always reasonable to restrict your “nearest and dearest” at your event to just those who can pay their way.", "This is just a guess but she seems entitled enough that she expects everyone else at the wedding to watch her kids for free", "My 8 year old would be angry and upset if she had to stay home instead of attending a family wedding. Same for my 5 year old. Even though the younger kid might need a colouring book in between...", "Kids love weddings! The food, the dancing, etc. Of course it’s the parents responsibility to ensure that the kids are behaved or managed throughout the event, but to pretend you’re doing them a favour by leaving them home? Pfft. \n\nIf I had opted out of taking my kids to their aunties wedding where kids were welcome they’d be soooo hurt.", "Pre-social media, it was kind of standard to give plus ones to single adult invitees, especially ones you hadn't seen in a while, because you couldn't be sure what everyone's relationship status was without a fair amount of work. I do think that \"serious relationships only\" is much more common now, because it's easier to find out which of your guests are in one.", "Yeah sure, but think about the “so I can have someone to dance with” comment. This woman is not at all concerned about taking care of her kids during the wedding. If they offer her this graceful option she will more than likely turn around and just bring a date. \n\nQuite frankly her request and lack of self awareness infuriates me.", "Well if the grandparents (or at least grandma) insist on them being there, they should help out with the kids, don't you think?\n\nWhen my friend had her otherwise childfree wedding, her MIL watched her 1 year old son and 6 year old niece... both her grandkids, who were ring bearer and flower girl respectively. Other than the logistics of getting a kid who turned 1 the week before to hand over a ring, there were no issues.", "Get real he is not AH the sister is. They've backed down and allowed kids because of her. She isn't entitled to a plus one regardless of kids or not.", "I never understood why people get plus ones if they are not in a relationship. Why have random people that nobody knows as guests at your wedding? Or why would people voluntarily be a plus one for weddings of people they don't even know (or well enough to be invited themselves)?\n\nIf I were to marry no one would get a plus one. If it were a couple they would get separate invitations - each their own. I wouldn't want random people I don't know at my wedding. This is such an outdated stupid tradition.", "I can’t simplify it any further. Lol", "The correct answer is nothing. Lol.", "Only tacky AHs demand a +1 for some rando…", "Only tacky AHs expect someone to pay $600 for them to attend an already limited venue that they are paying for in its entirety.", "First off, OP is her brother not her sister.", "She probably expects the 11 year old to watch the younger ones.\n\nNTA", "Which is probably what would happen if she got her +1.  NTA", "Yes.", "This is assuming too much, and it puts blame on OP's sister for something we just don't know she caused. \n\nIf OP wants a childfree wedding, she needs to man up and make that happen. It just seems like she wants to punish her sister for bringing \"four extra guests\" which is frankly a ridiculous way to look at it. These are not random people off the street, it's OP's nieces and nephews. They are not \"four extra people,\" they're family. If OP does not see them as such, she should make the wedding childfree.", "Well it wouldn't be a favour to anyone, you'd want them there as your nieces and nephews.", "I thought OP said they decided not to do a child free wedding as it was too much hassle?", "They're saying OP's attitude towards her sister's kids is wrong. OP kept saying she's allowing her sister to bring her kids as her plus ones. Those are her nieces and nephews. She's treating them like strangers that she doesn't want at her wedding, and is acting like she is so gracious for allowing them to attend.", "Obviously someone's relationship with another person will weigh in on their interactions.", "Nah.  So they are cheap and tacky AHs.\n\n&#x200B;\n\nAs I wrote, the sister is better off not going at all. WHO would want to go to an AH's wedding anyway?", "yes but it would be a good way to REALLY know what kind of a mom she is", "Heck yeah. Even offering to pay the babysitter for the 4 kids and giving her a plus one is cheaper, but, well…family.", "You read my mind. And it would be more peaceful for everyone.", "Yes. Because otherwise she’s going to be out on the dance floor with her date, expecting that everyone else is keeping an eye on all four of her kids, as they get into who-knows-what.", "Who would babysit them? She’s living with her parents who will be attending the wedding.", "Except.  Does a recently separated woman with four young kids *need* to be dating anyone?? Maybe taking time to focus on herself and her children would be a good plan?", "Ah, my favorite - the Russian nesting doll of responsibility bestowed upon the slightly larger child to try and wrangle the smaller ones solo while mom parties it up bc \"YOLO\". Gross.", "I’m not saying I disagree that OP should just buck up and have a child-free wedding if they want one, I’m just saying it seems like the issue at hand - giving the sister a plus-one or not - might be partially stemming from the fact that OP wanted a child-free wedding in the first place and already feels like they compromised to let the nieces and nephews come. I’m “assuming” that because it is written in the original post.", "They addressed that by stating it would be a child-free wedding if it were solely based on their preferences", "Who do you think was causing that hassle?", "Flip it the other way, it's her sister's wedding, why does she need to bring someone else to occupy her?", "Apparently all of her other guests that aren't acting entitled to more than their fair share.", "Yes, and if that was the goal, maybe it would be a good idea. The goal here is to have an enjoyable wedding.", "The baby daddies 😜", "It's got a fancy name now and is regarded by professionals as abuse.\n\nParentification of your kids is abusing them & doing it at a wedding is even worse since like everyone can see the parents utter lack of ability to parent and their general dgafitude.", "I get what you're assuming, I just feel like it's wrong to take out that frustration on her sister. If she wanted a child free wedding, she should have had a child free wedding. If she is just bitter that they're are going to be kids at her wedding and she is denying her sister a plus one because of this... I feel like she is an AH for sure. She had the option to have a child free wedding, she chose not to. She can't then be bitter at people because they have kids. Especially when those kids are literally OP's nieces and nephews.", "That's giving the sister too much credit, in my opinion. Definitely wouldn't offer the compromise.", "I don’t think OP is bitter at the sister because she has kids, I think they’re bitter because they feel like they compromised to allow the kids to come and sister will not compromise to understand that she cannot have ANOTHER guest. The issue at hand is not whether the kids are coming - they’re coming. It’s whether the sister gets ANOTHER guest.", "Yeah, sister does not really seem particularly \"reasonable\" so I agree that this wouldn't work.", "She also likely wants her sister to actually watch her kids at the wedding, not be distracted by a date. Going from child-free to having unsupervised children is a big change.", "It's not like the kids are her sister's guests though. They're related to OP. They aren't strangers, they're family. I feel like it's odd to tell your sister she gets to bring her kids as if she's doing her some great favor by allowing this. \n\nEspecially since OP didn't even say they bent the rule for her sister specifically. She may have decided to make the wedding not childfree because multiple guests have children, not solely because of her sister. If that's the case, it's unfair to be annoyed with her sister for bringing her kids. OP could make the wedding child free, but they chose not to.\n\nI'm not saying OP should give her a plus one. It's her wedding her choice, but I also don't think the sister is an AH for asking for a plus one. I've never been to a wedding where guests were not allowed a plus one. I think it's a standard thing that's offered. Her asking for one is not wrong, and OP saying no isn't wrong either.", "Ok, so maybe you think it’s NAH then if you don’t think OP is an asshole for denying the sister a plus one.\n\nPersonally, at least in my family, plus ones are only given to people who have established relationships (married, engaged, or just dating, whether long or short-term). When I was planning my wedding last year, I reached out to all of my cousins (whose relationship statuses I didn’t know) to ask if they were dating someone they wanted to bring. This is a cost-cutting measure because I have a BIG family, so not every adult invited gets a plus one. Sounds like we come from different wedding cultures!", "NYA your wedding your rules. Plus if she’s not serious about anyone yet dont waste money on a random guy lol.", "NTA \n\n\\- She has 4 kids to look after and probably distant relatives to visit with so there isn't going to be time to dance and be \"out on the town\" with a date \n\n\\- She and the kids will be in a ton of the photos. If she brings a random date, that person will also end up in your family photos. Those things last FOREVER. Don't mess with needing to crop out a rando. \n\n\\- She probably thinks she'll be left out of \"couples\" activities, but this isn't a couples retreat. Yeah, lots (most?) of the adult family will be in couples but that doesn't mean she shouldn't consider her kids to be her plus one in those situations. Let her slow dance with the kids, let her share cake with the kids, etc. Maybe designate one kid for each of the \"extra\" activities so they all feel included in a different way? \n\n\\- Does she really want to have to introduce a new person to the entire extended family? It's exhausting. I was engaged and of course brought my then-fiancé to my sister's wedding, but having the same \"Aunt Sally I'd like you to meet...\" conversation three dozen times in a two hour span (when all I wanted to do was party like everyone else) got on my nerves.", "NTA. Personally I don't understand the concept of giving adults random plus 1s. Like yes if you know cousin Joe who lives 3 hours away has a serious gf even though you haven't met her yet sure let him bring her. But if cousin Bob is technically single why should you pay for him to bring a random date to your wedding.", "NTA\n\nThis \"rule\" that +1s are required for weddings is absolute bullshit. I am currently planning a smallish wedding as well and technically no one has a plus one to our wedding. We have many couples invited, but anyone who is not a couple that is invited will know basically an entire friend group there or an entire family group (or both). \n\nI have attended several weddings as an adult and even when offered a plus one, I declined and I also know a couple instances where I did not have one and thought nothing of it. Hell, I will still likely go to weddings \"by myself\" after I am married because I do not expect that in certain cases we would both invited or would be able to make it.", "NTA. You aren't throwing a party for her. This is YOUR wedding.", "NTA, honestly I'd almost give a choice, your kids or a plus one end of discussion. That is if you don't mind her bringing a friend or a new partner. If she decides the plus one it's cheaper for you and opens the door for other people.", "Honestly your already being nice letting her bring her FOUR kids after you and your future husband decided on a CHILD FREE wedding. At this point I would just tell her don’t come. It sounds like shes trying to make YOUR wedding about her.\n\nForgot to add that NTA", "As someone who are getting married in like 10 days or something, I've made the same decision as you, but for a relative who doesn't even have kids. And our venue doesn't have a hard cap (that is relevant for us). They became a couple like 2 weeks ago and she immediately asked if he could come as well, but both me and my wife-to-be were very much in agreement that he won't.\nI refuse to have people at my wedding I've never met and that's that. Maybe if they had been a couple for a year or two, that might have changed my mind, but this girl never managed to hold on to anyone for that long :P", "NTA. Tell her you have both capacity and budgetary limitations. Also, you don’t want some random person taking someone’s place who you care about", "NTA if anyone has an issue with it cut your wedding down some more and put the money you saved towards your hunnymoon or your future.", "NTA. She is not entitled to a plus one. Those are clearly being given out at your and fiancés discretion due to hard limit on guest numbers.", "NTA. \n\n>said she could easily find a date or bring a friend to have someone to dance with\n\n\nSo she wants you to cough up $100 so she can have a dance partner? Nah. Plus there will be plenty of people there she can dance with.", "NTA. Tell her that she can have a plus 1, but the kids cannot attend. She has to decide which she wants and she cannot have both,", "You are absolutely NTA.", "You’re already nicer than me. I wouldn’t even be paying $100 per kid to eat. That’s absurd. I’d tell her that she can be happy that she and her kids are invited or she can not come and save you $400-$500.", "NTA - just uninvite her from the wedding", "nta, its not your job to make room for her everywhere.", "WHHHHYYYYY DOES EVERYONE TREAT WEDDINGS THAT AREN'T THEIR OWN AS A GIANT PARTY THEY CAN INFLUENCE?!?! \n\nI'm so fucking tired of AITA posts from brides/grooms asking if a decision they want to make or have made makes them an asshole. THE ANSWER IS ALWAYS NO. \n\nI don't care what the decision is about, it's YOUR fucking day and YOUR fucking money. You're absolutely allowed to restrict guests, ages, outfits, food, drink, etc...you can tell ppl to dress in all green, you can tell ppl to sit cross-legged, it doesn't fucking matter. \n\nGuests can not attend in protest or attend and be butt-hurt about it, but the day is absolutely not about them and they can fuck right off. In fact, the moment anyone starts feeling some type of way that isn't completely supportive, they should be immediately uninvited.\n\n(And for anyone who says that sometimes it's NOT your money if the couple is getting financial support then remember that financially helping someone is a GIFT and doesn't automatically allow the gifter to control the giftee's decisions unless there are previously agreed upon strings attached.)", "Ignore your mother.  It's not a faux paus to not give every adult a plus one.  I invited non-married couples separately and then gave no plus ones.  I also wouldn't want my sister to bring a random date to my wedding, nor would I ever do that to my sister. Tell her to stop making it about herself. NTA", "You're kinda being an asshole if this is how you conveyed this information to your sister. Because if you'd said \"listen, each person is expensive and we're trying to keep things fairly small. Do you mind not having a plus one? I do want my nephews and nieces there, but it'd really help me out if you didn't bring anyone else.\" and she was still making a fuss then she'd be the asshole here. But the way you put it sounds like it's judgmental and punitive, and...I doubt you're policing *everyone's* plus ones the same way. It feels like this needn't have been a thing and you made it into one.", "Formal event. 4 kids to 1 adult. Yeah, you're the AH and you're going to regret not allowing her to bring backup with her to the wedding.", "No way. Even if the mom pays for the +1, it's still taking a seat away from someone the OP actually wants there.", "I don’t understand the sister’s complaint about needing someone to dance with - it’s a wedding full of family and friends, there’s lots of people there to dance with, including her 4 kids!", "Dang. I absolutely loved this response.", "Bingo. She is already taking up nearly an entire table all by herself since she has been granted +4.... Also  who is going to be watching these 4 kids when she goes to entertain herself with the rando that she dug up to attend with her?", "Yes, it’s very common to not have unnamed +1s! I had a small wedding. We only invited spouses and long term partners, single people didn’t get a +1 to bring a rando.", "Agree, a wedding isn't an occasion for a date. Especially with 4 kids.", "Why not just take everyone off the guest list then? \"Wasting hundreds of dollars\" reeks of an invite to please someone else.\n\nI'm lucky that me and my sister have a good relationship.", "I don't even think I would have her with a plus 1 anyway. So who is going to watch her kids while she is drinking and dancing it up? Other people that's who. Others that are also trying to enjoy themselves but can't because they have to make sure the 4 year old doesn't drink out of someone's whiskey glass by accident.  Or make sure one of the older kids doesn't get into the cake.  \n\nHonestly this sounds miserable for all involved except Mia who then gets a free night off to party and is just pissy she can't bring a friend to party with.", "Yeah, she knows the family there and will have her kids to look after! \n\nAnd if I was getting married I wouldn’t want some random person I didn’t know at my wedding just because. I haven’t been to any weddings where single people get a +1 - I just don’t think it’s the done thing anymore, as weddings are so expensive now. Generally partners only get invited if they also know the couple.", "Some kids do behave, even if reddit does not think so.", "I disagree with this.\n\nNta.", "A decision she was bullied into because of her sister?", "Bump!", "Finally! A very well thought out response. OP, read this and think hard about it. Are you punishing your sister?", "It sounds like it's a money issue more than anything. A plus one would just be an extra $100 plus 4 I eat the kids is an extra $400 that they have to pay just for one person.", ">105 people and not enough room for your own sisters +1?\n\nThe sister wouldn't be alone like at a movie theatre (but honestly, going to movies alone is amazing) or restaurant. They'd have their 4 kids, their parents and the rest of the family there.\n\nHis sister is already taking about \\~5% of the total allowed people for herself. 105 doesnt go very far when you have a decent size family and both people getting married have a good amount of friends. Ive been to 5 weddings in the last year and all had over 100 people and none of them felt like \"big weddings\". They were all pretty normal sized.\n\nOP isn't denying the attendance of a husband or serious partner of the sister, they just arent allowing a stranger to displace somebody that they actually know.", "Why should op pay for a babysitter?! They aren’t her kids!", "Who is going to watch the 4 kids while mom is off partying? And who would want to go as a random date with a woman, and her four kids?! The only kind of guy I can think of would be a fucking mess", "They stated exactly how much it would cost. And if the cap is 105 people based on fire codes and such, where’re they supposed to “find space”?", "And who is going to watch her kids while she is off partying with her tinder date?", "Why does your sister need to bring someone to dance with? There'll be plenty people she knows, and she has 4 kids aged 4 to 11 to keep away from the wedding cake.\n\nNTA", "Honey, it isn't just about the money. Even if you were Jeff Bezos it isn't the point. Who is gonna watch her kids when she is drinking and dancing the night away? Other guests that's who. And she then wants to bring a +1 so she can ignore them even more?  That should be your bigger concern. \n\nKids that young need eyes in them the whole time.  Making sure they don't get into the cake prematurely or drink alcohol from someone's glass accidentally or making sure they aren't running around and crashing into guests. (Can you tell I have had to be a child wrangler for kids that weren't mine at a wedding I was a guest at?)", "Not to mention it mention you'll need to cut someone else out.", "Tell her she can pick. 4 kids. Or 0 kids and a plus one.  She might be selfish enough to pick the latter which save's you money.", "NTA. She doesn’t even have something steady lined up already, there is no need to let her rustle up some random guy for you to pay for or have to possibly un-invite actual guests in order to accommodate fire code.  I wouldn’t even make the offer for her to bring someone if she / they pays, as she’ll just end up ditching her kids on all your other guests.", "Am I right to assume the wedding isn’t child free because she demanded that her kids come?", "NTA\n\nNo is the appropriate answer.  \n\nAnd with relatives there it isn’t like she would be sitting in a corner by herself with no one to talk to. \n\nIf she says she won’t come then say you are sorry and will miss her. But do make it clear once she declines there will not be a place for her - no seat, no meal, etc.   She should also let you know if that means the children will not be attending.", "NTA\n\nShe's not in a serious relationship, numbers are tight and numbers are limited. She's expecting far too much here. \n\nAnd if she brings someone, who's going to look after all her kids? Get the impression she's a bit of a freeloader and will expect someone else to look after them so she can enjoy the day, selfishly at someone else's expense", "I was just thinking that. Who the hell would say yes to a date, with four children at a family wedding.", "Yeah going on a date with your children seems so immature, like maybe don’t introduce them to randoms you’re not serious about.", "I was thinking she was going to ask to bring someone to help child wrangle! I’ve only got two, though granted they are toddlers, but the idea of being solo with my kids at a wedding gives me cold sweats.", "Yes. I would really focus more on the number of people alowed and keep to myself the money thing. And not having a random stranger at my wedding.\n\nOn a side note, it feels to me the sister wants a vacation. Four kids ages 4 to 11 needs attention. Bringing a date isn't gonna keep her eyes on the kids. I understand the whole family can take care of them, but it will likely fall on the grand-parents who wants their eyes on the bride.", "Noo she'll 100% turn up with both a plus 1 and the kids in that scenario", "I was at a wedding and watched in horror as an unsupervised child (about 4-5) picked up a champagne glass and drank out of it. I couldn't move fast enough to stop her. All I thought was how many has she already had?", "I'd agree with this. Nieces and nephews are automatic invites for most people", "I think OP is annoyed and not good at nailing down exactly why she’s annoyed. Not cost exactly, but there’s some “I’ve given you a lot already and you keep demanding more” going on.", "I had a \"no kid\" wedding because I was paying for the wedding myself for the most part (my dad bought wine/beer and my in-laws paid X amount towards catering because we did not do a rehearsal dinner) I was not about to pay for my cousins' 10+ kids and my husband's cousins' 10+ kids when we don't ever see them and only invited cousins because our parents would be offended if we didn't. If the cousins had chosen to stay home because they couldn't bring their kids, then that was their decision. Some people have to keep to a budget and I definitely wouldn't want to pay for some Random to come enjoy my wedding. Especially not $100. Maybe you can mail OP a check for $100, but I'd say she still doesn't want a random at her wedding.", "How does she have that many bd’s and still no flow of cs??", "Even more reason to not give her a plus one to bring a rando. She can't exactly afford her current family as it is, she doesn't need kid number 5 and baby-daddy number 4. It's understandable that you don't want to contribute to that with $100 and giving one of your 105 spots to a random guy who won't be around for long. NTA maybe apart from explaining wedding mathematics to her (number of guests, costs) you could explain birth control to her too and that she doesn't have to have kids with every guy who beds her.", "The post doesn't say that the sister was the one who pressured OP into including kids. It very well could've been OP's parents or somebody else who has kids, at which point it just makes sense to invite the nieces and nephews, too. I think OP would've mentioned if the sister was the one who caused drama about the original plan to do childfree. \n\nRegardless, inviting kids is still a decision OP made. They're a grown adult and could've ignored any complaints. 99% of the time, passive-aggressiveness is asshole behavior, as is the case here.", "oh i agree the wedding is small.  \n\ni still think you need to rank order your invites, the smaller the wedding guest list gets.  simply cutting out a +1 for your sister seams petty to me.  if money or venue size was a concern, she could have gone \"childless\" for the wedding, which probably would have freed up room for more people and avoided this problem entirely.", "it’s less than the cost of having them at her wedding. of course she’s not responsible to pay, but also financially it costs less so is a realistic option", "There's so many assumptions in your comments that have nothing to do with the actual post here.", "ok, $100 more at a wedding costing tens of thousands.\n\nIdk this person but is the 105th lowest priority person on this list worth more than making her sister happy/comfortable on her wedding day? Not saying I approve of her sister's behaviour but family is family and I'd be more inclined to keep the peace.", "The 11 year old will be watching the other three. It won't necessarily go well but I bet the sister is thinking it will.", "It’s not even just the money. They have limited space. They’d have to cut someone they *want* there so her sister has someone to dance with. No effing way. They’re already giving her 5 spots, when they really wanted to have a child-free wedding. \n\nOP, it’s time you learn how to negotiate. Or more accurately, play hardball. You already gave her more than you wanted when you backed down about the kids being there. Tell her if she doesn’t STFU about another guest and take the win about her kids going, that offer will be rescinded and you will use those 4 spots for people you had to cut to accommodate her. Tell her if she shows up with a plus one, she and her entire entourage will be turned away. When someone refuses to accept what I’m willing to give, I give *less*. Chances are, I’m already giving more than I really want, so if they’re going to bitch and throw a tantrum, fuck it. If only one of us gets to be happy, it’s going to be me. *Especially* when I’m footing the bill. \n\nMy MIL tried to pressure me into inviting her friends to our reception. We had a hard limit of 100 and had already cut people we really wanted to be there, because family we “had” to invite took up about 80 spots. I told her there was no way I was cutting the few friends we were inviting in favor of *her* friends, who I had never met. \n\nDo not back down. Your sister is acting like a spoiled brat.", "It’s not “beautiful” that he catered to his brat sister. Especially now that dictating the terms of her brother’s wedding isn’t enough for her and she’s demanding to be allowed to bring any rando to the wedding too. It’s not beautiful. It’s enabling and unhealthy. OP and his fiancé should be having the wedding *they* want to have. I promise you, the littles DGAF about going to the wedding. Edited because to fix misgendering the OP.", "Or expecting your Mom to do it.  Sister is being ridiculous.", "This too. Is her +1 going to assist her with childcare or is that something she feels entitled to receive from other guests?", "I'm betting it'll fall on the 11-year-old. I bet Sister leans pretty heavily on Mom for childcare, but since Mom will also be a guest, she's going to put her oldest in charge while she \"has fun dancing.\"", "The eleven year old *might* enjoy it. And not knowing the age of the two middle ones, the one below her may too. But lower than about ten? Especially if they don't have the \"benefit\" of being in the wedding party, I really don't see kids having a good time", "I’m afraid this is terrible advice.\n\n1) Sis will be occupied with her date while 3 kids run amok.\n\n\n2) left-behind kid will feel left behind.\n\n\nBetter to offer either “random +1” OR her 4 kids. OP can even throw in the money for a babysitter with the 300$ she saved.", "People on this sub have odd ideas about kids sometimes. They seem to think that because kids don’t necessarily remember events all the way into adulthood that they don’t get anything out of them, enjoy them, or remember them during childhood. They’re not some sort of slime mold with rudimentary memories, they are just little people. Some of them love weddings and treasure them, some don’t like them (just like adults)! And just because they might not be lifelong memories doesn’t mean they aren’t important to them or impactful to their development. And it’s impossible to say what will be a lifelong memory. I remember being a flower girl at three in my aunt’s wedding, and I’m 35.", "I was going to comment the same. My kids were that little but remember my sister’s wedding. That’s not a good reason to not include them.", "Where are those kids' meals??", "She would do that, she said, if it didn't create that much drama.\n\nI think she doesn't want the kids there, her sister and mother insisted, and now she's pissed about it.\n\nAnd sister wants a plus one on top of the four effing kids I don't want here? Never. Not even if it was a huge venue with free food.\n\nIt's what it looks like to me at least", "It’s a wedding not a ticketed event. If OP doesn’t want a random at her relatively small wedding then that’s that.", "I'd be willing to bet the baby daddy's arent exactly winners", "You think the wedding size is small, you acknowledge the sister is taking 5% of it to herself, and you still think OP should have to dedicate an extra spot to someone who their sister is not in a relationship with? \n\nIts zero sum, that random person means another person cant go. Not to mention the sister has a 4 year old and 3 other young kids. She'll have her hands full at the wedding unless she's an even bigger AH and trying to pass them off to her parents.", "Agreed. I’ve seen kids put their hands in firepits, play with broken glass from the drunk adults, jam fingers in doors, run outside and not disappear ONLY because of staff, be safe placed in baby carriers next to booming speakers in the areas with most foot traffic, be allowed to scream and run and try to hit our server trays, run into the back of the house and kitchen, drive a motorized kids vehicle inside the venue, etc.  As someone who doesn’t want kids, it’s heartbreaking to see them put in such dangerous situations by those who are supposed to care about them.", "If you’re bringing a kid, you need to watch them (or have someone watching them) and probably leave early with them. I was the MOH for my cousin’s wedding and my 1.5 year old was kind of in her wedding (was supposed to help the ring bearer) because she loves kids. My parents watched my kid during the wedding since I was in the wedding party. The wedding was at a hotel/resort thing and parents took my son back to their room pretty early in the evening to keep him out of trouble. If I hadn’t been the MOH then it would have been me watching him and leaving early because it’s not ok to let your kids run wild at someone’s wedding, no matter how close you are with the couple. I certainly wouldn’t be needing a date to dance with.", "There's a psychological/sociological concept that this falls under. I can't remember what it's called right now... It might be bystander effect?  Everyone thinking someone else will intervene so no one does.", "Yep, my mom had her wedding to my step dad at a children’s museum because many of her siblings and guests had young kids. It was a space where everything was basically safe and kept the kids occupied. At other weddings, you need to just hire a babysitter.", "I’m just saying it’s not on OP to magically fit everything in the sister wants, she has to pick.", "I think that’s more because your kids would be upset about being told they were left out of something and not because they would actually enjoy themselves more at a wedding", "Have they ever been to a wedding? I’m betting they would change their minds real quick once they got there", "My two year old would be upset about being left behind, she wants to be involved with everything we do. People on this sub have odd ideas about children and what they like and are like.", "I agree completely!", "Most venues don't offer kids meals. I work in the wedding industry and the venues where I am don't offer kids meals. It's the same per head regardless who is eating it and the food doesn't change.", "She doesn't ever say her sister is the source of the drama over the kids. There could be loads of other people going to this wedding who are bringing their kids. \n\nIf OP didn't want kids at her wedding, she should have made it childfree. She didn't, so she shouldn't be complaining about kids being there. Especially when \"those kids\" are her nieces and nephews.", "she’s not “take 5% for herself” op made a choice to invite her kids.. if op doesn’t want them there she could have simply not invited them", ">Its zero sum, that random person means another person cant go. Not to mention the sister has a 4 year old and 3 other young kids. She'll have her hands full at the wedding unless she's an even bigger AH and trying to pass them off to her parents.\n\nyou're making assumptions about the mom without the OP's saying anything about her \"passing her kids off\" to her parents.  From what the OP said, i think they're being petty.  again i can only go based on what OP said.", "OP probably would rather have her niblings then some random.", "And especially since they decided not to have a cf wedding just so sister can bring her kids. You’ve done enough op. Nta.", "I agree with you. But if she was a bad parent, boy would it be really apparent to the kids if she left 1 at home to let a new fling come with.", "Well that depends. Does one of the kids (maybe the 4 year old) not actually want to go?", "Let'em run with the pack!", "Kids generally a) don't actually like weddings and b) are a nuisance to have around", "Yes, two. Still talk about it. Maybe America weddings are more boring than ours here.", "Your two year old would forget about it forever within an hour. That’s the reality", "This! OP this is exactly what will happen if you give her a plus one. I have $5 that says she even asks you on your wedding night to watch all her kids because she “hit it off with her date and don’t you want her to be happy?!”", "Right!  Also, these kids are young, who exactly did she plan to have watching over them during the wedding while she's entertaining her \"date\" at the same time?", "But being a mom is *hard work!* And she has *four* of them! She deserves a break, and OP obviously can afford it, he and his partner are paying for the whole thing themselves! She's family, and she should be allowed to have *one evening* where she doesn't have to keep track of her kids (at a wedding, there will be plenty of other adults there, most of them family, who can watch her four children all night) and she can dance the night away and have fun. What a horrible sibling for suggesting that she shouldn't be able to have a good time and ~~party responsibility free~~  er, *celebrate,* yeah, that's it, *celebrate* her siblings new marriage! For free. On their dime. /s\n\nOP has already bent over backward to accommodate her and her four kids, she's gotten them to completely change their plans for their wedding once, she'll assume she will be able to continue to drain them emotionally until they give in to her demands. Let's face it. OP's parents really have four grandkids and another adult sized child living with them.", "Agreed.\n\n>latest ex-partner and dad of one of her kids\n\n\nThis sounds like a pattern to me, I think she's one of those people who can't be by herself and (thinks they) _need_ to be dating someone", "A .... babysitter?", "I think she's a bad parent for wanting to bring a brand new fling around her kids to begin with. 🤷‍♂️", "Probably, and then that's an excellent opportunity for OP to invite someone else that OP wants to be at her wedding.", "How is she going to find baby daddy number 5 unless her 11 year old is babysitting? /s", "Eh, my son at 4 really liked by brothers wedding. He got to hang out with his cousins of a similar age. Not all people are anti social", "My cousins' kids still talk about how much fun they had at my wedding. I dunno if everyone claiming that kids hate weddings is Baptist or Catholic or some religion/denomination that produces profoundly boring wedding ceremonies and/or receptions, but most neurotypical kids love the excitement of a big family party with dancing and fun stuff happening.", "Maybe child free is the norm over here. My parents never took me and my siblings to weddings growing up", "I think you're all being unfairly critical of sis - without dating randoms, how can she ever hope to find baby-daddy #5?", ">who exactly did she plan to have watching over them during the wedding while she's entertaining her \"date\" at the same time\n\nHer and OP’s parents of course!!! Not like it is their child’s wedding and they would have a part in it, right??? (/s)", "Maybe move the problem to the problem maker? Get sister to choose another family member who she thinks her +1 should be bumped for, and set up a zoom call you guest and sister so she can tell them personally they (or their +1) are disinvited.\n\nAfter all, that's basically what sister is asking you to do!", "I wonder who's going to be babysitting these children at the reception if sis wants to bring a date and dance all night.", "Gotta keep that sweet government money flowing", "Hear me out: gladiator fights over spots.", "What kind of country you live in that welfare covers the cost of a kid?", "NTA. Your wedding, your money, and should have just made it a child free wedding. Everyone understands and parents are happy to get a sitter for the evening.", "NTA oh no way, those kids will be running around like rats at a corn fest.", "I would ask her to pretend others have financial concerns too. She sounds like she could be trying to antagonize you and may not be able to resist the urge on your wedding day. Ask her to decide if she wants a date or her children there.  Or option 3. You give her 300 to stay home. Only half kidding .", "NTA. Stick to it!", "NTA \n\nIt’s your wedding. Your sisters feelings literally DON’T matter.", "NTA, Yet another reason to elope and avoid this drama.", "I like this answer, super reasonable and kind.", "It's polite. I was invited to a family wedding and not given a plus 1, and as a result, I didn't have fun at all. Who wants to go to a wedding by themselves, single or no?\n\nYou should want your guests to enjoy your wedding.", "But these kids are her neices and nephews ?????", "considering she’s the sister of the bride it’s safe to assume she knows atleast a few dozen wedding guests. that’s not at all the same as going to a resturant alone. that’s more like going to a resturant with your friends rather than your partner, which is quite normal", "I do things in public alone all the time because I prefer them that way. It's not that big of a deal. Plus a wedding is about the people getting married not about the guests if the people getting married want to make certain rules that's their prerogative.", "Sister turns up with 4 dates, checkmate", "Me too!", "I would have said \"sorry, invites are sent and we are maxed out. Not everyone got a plus 1.  But at least you get a fun date with your kids :)\".", "Agreed. 4 year olds are adorable and they are curious. They are also into everything when they are bored. I'm sure her oldest will be fine but under the age of 10 all bets are off.", "THIS. I would NEVER just bring a \"friend\" who wasn't a lifetime bestie or a \"random date\" to a wedding for a member of my family. I also would not go to a wedding or family reunion or funeral or another large family event with someone I was just casually dating. And I'd hope anyone I'd date would have the sense to not even invite me to that.", "As the Consistently Single member of my family and friend groups, I have never been offered a +1 at anyone's wedding. Now, since I shared an overlapping friend group with my younger brother, I didn't have to worry about \"having to talk to my aunts I never see\" at his wedding, and at every other wedding I've been to, I'm either in the wedding party or have enough acquaintances there that I never even noticed I was \"alone.\"", "Agreed, I think it's pretty normal actually", "Absolutely true, and admittedly we are only getting OP's side of the story here, but people such as OP's sister is portrayed to be tend to be less likely than average to have well behaved kids.", "If it were just a money issue, why mention the guest cap? 105 people is 105 people, regardless of who it is. OP is fully within his rights to choose a friend over giving his sister a plus one, but it’s not like he’s planning on a guest list of 30. $10,500 is $10,500.", "If she does that, upon arriving, OP should challenge her. Listen, I said either+1 or the children, not both. You're completely out of line. \n\nI guarantee that at least the +1 will prefer to leave.", "OP...tell your mom if it's THAT important, she's free to give up her slot for your sister and watch how quickly she changes her tune 😂", "Yup, my husband ended up wrangling my cousins kid ON OUR WEDDING DAY because mum was jealous? Or just being oblivious about them. Happened again at my other cousins wedding, my husband ended up on kid duty again because mum couldn't be bothered.... again.", "The mom sounds like the enabler of the family.", "He. Below is the beginning of the post:\n\nIm (30M) in the midst of planning a wedding and deciding everything regarding the guest list.", "Here, you dropped this: 🏅", "The reasonable thing is she comes alone since she is single. And she gets her tubes tied", "Does your venue step in? Because we were at one reception where they stated at the beginning that unsupervised children that left that room would be detained and taken to the security office and held for one hour. If a parent or guardian did not pick them up within that time, the police would be called and the child(ren) would be turned over to them. No more announcements would be made.\n\nI saw several families find their kids and corral them in. Most of them stayed for dinner and cake then left immediately after.\n\nIt wasn't an hour and a half until we saw the police pull up (front windows of the room look over the portico and parking lot.) Two women immediately started shrieking for their kids. One found hers, the other ran out of the room screaming the kid's name and never returned.\n\nEvery other parent grabbed their kids right then and left.\n\nNext day a half dozen people were bitching because they \"had to go through that\". The bride messaged them back and said responsible parents had a great time and were complimentary, so they must be the other kind of parents. Shut the bitching down quick.", "Oh don't be silly. She'll expect the 11 year old to do it", "Well, that’s how she’d end up being the mom of five kids, so depending on your perspective, it’s either a good idea or a bad one", "Ding ding ding! 🛎️", "If she were that logical, she wouldn't be living at her parents' with four kids. Just tell her that the guest list has to be limited due to the small size of the venue. But you are right. Instead of whining about wanting a date for a wedding, she needs to come up with  a plan to make herself self sufficient.", "That’s kind of outside the scope of a wedding invitation though. “No plus one for you because you need to focus on yourself and your children” is major AH energy. It’s fine to deny a plus one because she’s not seeing anyone seriously, not as judgement on her life choices.", "Their other parents, a friend of hers, a neighbor, a hired babysitter? Why would their parents be the only option in your mind?", "Their other parents, a friend of hers, a neighbor, a hired babysitter? Why would their parents be the only option in your mind?", "I wish. My boss would sometimes just say something or hit them with fees. This is my second job and it’s already even worse this year. Its a newer venue from a larger restaurant business group. I feel like they are new to the game and struggling to handle the heavy load of events and business. I plan to quit once I find a new second job because it’s become abusive and not well run. I also hate to say this, but I am not going to fall on glass if someone’s un behaved child rams into me on purpose. I do all I can and am kind but I won’t have severe injuries for the negligence of others. I wish my venue was like that one, I’d stay working there in a heartbeat.", "This needs to happen \"in life\" everywhere, more.", "I have ten that says she picks up a guy at the wedding and then demands her parents or another family member watch her children so she and pickup can go make baby number five.\n\nOP, warn the groomsmen that your sister is on the prowl and has four kids.", "She also has to keep track when she takes a boyfriend with her.\nAlso it's the night where the bride is supposed to have a good evening.", "And then needs to have a baby with the person they are dating at the time.", "Hopefully", "I somehow have this preconceived notion that a lot of her acquiantances would get/are already tired of such an inconsiderate person. Also OP mentioned that the sister is low on budget so that ruled out the hired babysitter option.\n\nIf she somehow got someone to babysit her kids for free, well bless their hearts.", "Good luck! The venue is in a beach town near Myrtle Beach and it's a destination venue so I am betting they have a lot of problems with drunks and kids. Maybe suggest this possibility to your boss.", "These are going to be the only kids though so they won’t have that", "I used to like family weddings - I'd get to dress up, see my cousins, and there'd be delicious food and cake!  Fun times.", "yeah sounds like she is the type to leave the oldest kid at home to bring a bf du jour instead", "This is amazing", "Now don't be rude, it's baby-daddy #4 to father kid #5.\n\nNTA OP", "how does one even supervise 4 small children at a wedding, date or no?", "No, no. OP's parents deserve a night off too. OP can watch them! /s", "The fight in Michael Jackson's 'Beat it'. Do it with cake forks.", "Short answer? They don't.", "It’s your wedding. You don’t owe her anything in regard to this day. It’s about you. NTA", "NTA. I get your sisters side, but weddings are expensive. And it’s a day for you and your bride. You don’t have to invite someone that you don’t know/don’t want to. \n\nOne of my cousins got married about 7 years ago and I didn’t get a plus one because I had been with my then bf for 9 months. It sucked but her choice. Another cousin didn’t give me a plus one because he didn’t know I was seeing anyone. We had only been together for 2 months when the invites went out. But after talking to him, he added my bf. I’m going to another wedding in 2 weeks and I didn’t get a plus one for that either, because of money constraints. This bride texted me a few days ago and said I can bring my bf, because so many people rsvpd “no”. Again, her decision.  Just like this is yours.", "i would just tell her and the kids not to come lol. my sister with a ton of kids won’t be invited to mine and i’m very happy that way no matter how pissed she may get! \n\nnta", "You're not the a-hole. Having kids at the wedding is hard enough sometimes. She should be glad you allow her kids to come, so she doesn't have to pay for babysitter.", "Tell her that she can if the plus one pays 100. Easy.", "NTA", "NTA. This is your day. Not hers. It sounds like having children at your wedding wasn't even your initial preference. So the fact that you appeased the guests in that aspect is already way more than you owe any of them. You wouldn't be the asshole here even if it were free for the kids. You and your fiancé alone decide who gets to attend your big day. Period.", "Nta. If that’s the case make it a child free wedding 🤷🏽‍♀️ then she can get her plus one and have to pay for a babysitter", "NTA.", "NTA.   A plus one is not a standard for adults.   Parttcuwlly, for a small wedding like yours.   As others have said who is going to be watching het kids?   She is not going to be dancing.   She will be watching her 4 kids.  Your sister sound like an entitled person and your mom lets her get away with it", "NTA- I just told my sister in law that we were doing a no kids wedding but we ended up having 3 kids there.  But not her jerk spawn, who my in laws would’ve ended up having to watch at the reception.", "Nta ,", "NTA, it would be ridiculous for you to spend $600 on her and her group. Tell her she can bring her kids or a date, but not both. And if she’s that salty about it, tell her she can stay home if not bringing a date makes her not want to come.", "Nta, she made her choices in life", "no, you are not being the butthole. \n\nsounds like your sister has serious....attachment....issues. and she sounds pretty entitled. \n\njust lay it out for her. her and her kids, or her and her date. one or the other. so, if she brings a date, she can't bring her kids. if she brings her kids, she can't bring a date. \n\npure and simple.", "NTA. Nobody in my family has given plus ones for years.", "NTA. It's your special day, not hers. Even more so if she's not planning to pay all that money for the extra costs or to find (and pay for) a bigger venue for you. (To clarify, she shouldn't be expected to do so, but that's also all the more reason that she shouldn't be calling the shots for *your* special day.)", "NTA you could give her the option of not bringing any of her kids in exchange for a plus one", "NTA whatsoever. you simply don’t want peoples’ random dates at your wedding. YOUR wedding. YOUR big day. you’re never TA for making a decision regarding the biggest day of your life.", "You're paying 400 anyway so from a loss perspective that's the max you'd be out.\n\nUnless you want the kids there (you mentioned about trying to make it childfree but couldn't), why not give her another option? A) Take all 4 kids like you had originally planned or B) hire a babysitter for them and she can take a +1. B would be cheaper where I live but ymmv.\n\nNTA in any case.", "NTA.\n \nNo “plus ones”.\nIf you are close enough that you are coming to my wedding, and you want to bring a partner, we should be close enough that I will know their name 6 months in advance of the wedding, and they will be invited, by name, at least 6 weeks before the wedding. \n\nYou don’t know them that long or I don’t know them that well, you come alone.\n\nIf you come alone, you sit at a table with other single or single-ish people, you make conversation, you eat the free food, drink the free drink, get on the dance floor, and explore the possibility that a friend of a friend is probably quite a good proposition as either a romantic partner or a new friend.  One night away from the beau of the mo won’t kill you.", "No just no as you said everyone gets a plus one and her bringing her 4 kids already breaks that but her asking to bring another is the thing that gets me mad the most and she seems like she thinks she is entitled to be there and you should cater to here demands", "NTA", "NTA", "People who are suggesting she or your mom pay for her plus one are forgetting that also means there's one person you actually want there who won't be able to attend at all. And since it's not child free, you're probably very limited in how many adults you can invite. NTA at all. She can either attend with her kids, or skip it all together.", "NTA, your wedding, you're paying for it equals your decision who comes and who gets a plus one and who doesn't.  It's as simple as that IMO.", "Even if she was willing to pay extra I would still not want her to ‘bring a date’. She should be too busy babysitting her 4 kids to be attending to a new beau. Might be different if it were a long term relationship where he would know the kids and the family and be a help rather than need attention from her. NTA", "Who's going to supervise her four children... Her date? Watching 4 kids seems like enough to keep someone occupied at a wedding and seems impossible to do while also entertaining a date.", "Coming from a similar sounding family it's usually everyone else's problem while mom gets drunk and has fun on the dance floor.", "i agree, OP sounds super judgy of his sister‘s messy life. even if she is to blame for some of the mess, no one makes the best decisions all of the time.\n\nalso, i assume her +1 would be able to help her handle the 4 kids, which i cannot imagine having to do on my own.", "Who did she think was going to watch her 4 kids if she was dancing with some random date?  NTA", "She has FOUR kids to watch. Between the ages of 4-11.\n\nShe should be plenty busy keeping them entertained, fed, and out of people's way. Is she expecting to show up and have the wedding attendees babysit her kids while she dances with a friend?", "Save yourself the $500 and uninvite her messy entitled ass", "And if this is the hill she’s willing to die on then she’s more than welcome to RSVP “no” so that you don’t have to spend $500.", "Honestly if she continues to push I'd change the wedding to be childfree and exclude her children. She seems so entitled.", "Absolutely NTA, but have to ask are the kids her guests she's bringing or your guests your inviting? They're your neices and nephews right?", "You are already making an exception on a childfree wedding specifically to accommodate her.", "Basic rule of thumb; if you are invited to a wedding, make sure you give a gift worth your food and entertainment for each guest.  She should be taking you about a $300-$600 gift. As her now if she wants a plus 1.", "I agree. If you're a relatively minor guest it's maybe more normal, but if you're a central member of the wedding party or family then it feels odd to be bringing along a random date who doesn't know anybody all to well. Other than the free food do they even really expect to enjoy it? Weddings can be a fun place to meet new people when you know the bride and groom but can't imagine just tagging along to one as a proper extra.", "OP is a man.", "Damn. Can I make some s'mores on this burning wreckage you left?", "Yup. Child care will fall through \"last minute\" and everyone will show expecting to be catered to.", "yesss thissssss", "Did you read the original post? They are not allowed to invite more people", "It sounds like OP tried being gentle. Now it is time to be direct.", "They could ask the kids what they wanted to do. There would probably still be jealousy and tears when they inevitably change their mind, but at least it would be a life lesson.", "This subreddit is really weird about children.", "You are a good a person as any to ask. Why is everyone calling op a woman? It's after the very first word that he says he's male\n\nEdit: just noticed that it was edited two hours ago, which may have been to add the 30M. I guess all the girl comments were just assuming guys don't care about their weddings", "Be my guest friend", "That doesn’t seem fair to the poor kid who got chosen to be left home lmao", "Or tell her you can have a plus one or all your kids, but choose now, and that you are not getting a sitter if she doesn't bring the kids and your parents aren't an option.", "Second this!", "The grandparents look after the kids every other day of the year, why would OP’s wedding day be different? \n\nI think her attitude on show here is precisely how she ended up the single mother of four kids, with god knows how many baby daddy’s.", "Kids are invited, sister can stay home?", "Diffusion of responsibility.", "And if she's off dancing or whatever, where are the kids? Dumped.on another adult? Left unsupervised?", "We already know what kind of mom she is.  She has 4 children, they all live with Grandma, and she is worried about being able to bring a date and dance at a wedding where her children will be present.", "You're assuming she knows who (and where) they are.", "Beat me to it.", "Yeah, this was my concern right away.  She needs her entire focus to be on keeping those 4 kids from making a mess of the whole affair.  It’s sad to see people who can’t get their basic lives organized.", "Good point! Will be good practice for when OP and his partner decides to have a child or adopt a child.. (/s)", "Seen your comment and all I could think of is, Hunger Games style contest or even Triwizard tournament… failing that soap box derby…", "In full wedding dress, of course.", "NTA. It's YOUR wedding. If your mother thinks you should do this, then your MOTHER should pay the $100 for the one plus. YOU should be able to invite who YOU want especially since YOU are paying for it. Where is the four-year-old going to be when your sister is dancing?", "Definitely NTA. It sounds like you already have a pretty limited number of guests allowed and so I think it’s only fair to give +1s to folks whose SO is an important person to you as well and/or are in a serious relationship with the guest. I think it’s your wedding and you get to make the decisions that will bring you the most joy on that day - including who you decide to surround yourself with. That +1 for your sister could instead be a valued person in your life that 10, 20 years from now has more meaning to have had at your wedding than someone insignificant your sister bought “so she had a date.” I’m sorry, it always breaks my heart to see folks on here whose wedding became more about their family members than the bride and groom.", "NTA, tell she can have the kids or a plus one not both. And honesty I would hire a sitter and serve the kids pizza.", "NTA. Constraints are constraints. What else are you supposed to do", "If she wants a plus-one, tell her to leave all her kids with a babysitter. Who really thinks that taking a 4yo to a wedding is a good idea anyway?", "That’s where her +2 comes in!", "Last wedding I went to I didn't get a plus one because I'm not in a serious relationship, totally fair. Plenty of people there without plus ones.", ">I also find the +1 request ridiculous and unnecessary\n\nComing from the UK, I've never known a wedding with the \"bring anyone\"-style plus ones I read about on here. If you're in a longer-term/stable relationship, your partner gets invited. If not, you attend solo.\n\nHaving said that, this is one of the situations where I might actually give a plus one ... but not to bring a date. If my sibling was a single parent of four kids and had a close friend who knew the kids well, I might offer offer a plus one to help look after my nieces and nephews.", "They are only allowed a certain number of guests because of fire codes and venue allowances and such - It can be very difficult making a guest list for a very limited number of people knowing that you will likely have to cut some good friends and family that you would like to have there . It seems like he’s made sure he’s included his whole family in that limited group - why should he have to cut another friend or family member so that his sister can invite someone that no one even knows ? What’s she planning on doing? Trying to find a tinder match and meet at the wedding ?", "Trade in a Plus 1 for ALL four kids. Sis needs to  find/hire a babysitter for the evening.", "First, I'd say 4 kids, or 1 plus one, and if she gets pissy, it's not like there is a rule book, or a state law.  Choose.  Find a date and pay for a babysitter, skip the date and bring the kids.  Period.  No \"well what if. . .\" blah blah blah.  Also, let her know in advance how humiliated she will be if she tries to pull off a +1 and the kids.  I'd annihilate her.\n\nTrue colors time, and I'm not even judgy as long as she plays by the rules laid down by her brother.   Bring your kids or bring a plus one.  Can't have both.  See, now I want an update.", "Not to mention, if sister brings a plus one who is watching the 4 kids???", "☝🏾🤣", "OP mentioned that the sister is tight on budget.", "Because that's a symbol of love and long-term commitment...right? Guys? Back me up here! Ha ha ha. 🥲", "You mean when she shows up with all 4 kids and a date?\n\nMom better be herding kids, but I have a terrible foretelling the kids with be free range, poking their boogery fingers into everything.\n\nNot insulting anyone, but any human below the age of . . .15 for boys, age 9 for girls, just automatically assume boogers.\n\nWhat we need is a side bet app.", "I like the way you think.  Feel free to imagine mad scientist laughter over a thunderstorm track if it feels appropriate.", "Let me go ask all of my cousin’s ex husbands and baby daddies.", "NTA, and she is your sister. This is a family wedding. She can talk to your parents, and anyone from your side of the family, because that is her side of the family. It's not like she knows nobody there!", "Losing your relationship with your sister over such a small petty detail. Grow up! When you have kids which it sounds like you will not. You may know the feeling. 105 people, is the catering service going to count heads? I am sure those kids will eat the entire buffet. SMH", "NTA. Don’t let your sister or mother manipulate you into adding anymore people, you’ve done more than enough to accommodate her plus 4 kids. Tell her to get over herself and be glad she and her kids were invited to begin with.", "We actually KNOW what kind of mother she is! She is bringing her 4 children with her, taking up someone else's space, and her biggest  concern is about who she will be dancing with, instead of concerning herself with keeping her children together, and seeing to it that THEY have a good time! She can't afford to PAY for an extra guest, but feels that it's ok to ask some random stranger/friend to her sister's already tight budgeted wedding. The care of the children will probably be imposed on some poor unsuspecting guest at the wedding, because you KNOW that she won't even keep abreast of where her children are, or what they are doing!", "Hanging out with Grandma, obviously", "Honestly OP could let sister and a plus one come AND pay for a babysitter for a couple hours for less than the price of inviting sis plus 4 kids. You’d think sister would agree to that since she wants to have fun and dance etc", "They'd probably appreciate a night off from spending time with their mother!", "Yes!!! Now you I like! 🤣", "[https://www.youtube.com/watch?v=kbosGuW1VWU](https://www.youtube.com/watch?v=kbosGuW1VWU)\n\nBlackadder and his Scottish Cousin Macadder.\n\nIf you start at 2:33 you will hear how decisions were made in the ancient ways of the MacAdders.  \n\nForget your sister and the kids and see if you can get Rowan Atkinson instead."]}