{"id": 14076, "submission_id": "12co5u0", "title": "AITA for asking my stepmom why she insults my bio mom so much?", "selftext": "So for some background. I am 17, living with my stepmom now and I am extremely grateful. I don't like my bio mom at all. My stepmom is allowing me to thrive and live a better life and not be abused. \n\nBut, she always insults my bio mom. Sometimes for the obvious, she mistreated her kids and does nothing. But sometimes it's for such small things. For example, the way our clothes used to smell. We either smelled really strong or like cigarettes. She complains to us and not our mom though. What am I supposed to do, or say? I'm sorry we smell bad? Like the insults are not going to my mom, you're saying it to us. You make us feel bad for something we literally have no control over. Or she gets mad at the way my mom texts and could never arrange a proper plan to see my brother. I'm aware it's her, not me, but it is placed onto me. What am I supposed to say to it? I can't control what she says. Or sometimes it's a simple as insulting the candles she uses and saying how gross they are. Sorry? Why are you telling us and not her? It has nothing to do with us, but you're saying how bad they are for what? Like maybe I'm projecting. I am ashamed of the way I was living. I feel gross always. But this does not help. So I asked her \"why do you insult our mom so much?\" Not in a rude way. I was laughing. She said \"are you serious?\" I said \"Yes, I'm genuinely wondering!\" While laughing. Like I get it was a very direct and uncomfortable question. I was expecting an answer like \"She is just not a good person\" or \"I'm sorry\". But instead she cancelled our plans for today and said we are ungrateful, so why should she do anything for us? \n\nMy stepmom is a genuinely nice woman. I almost didn't believe her reaction at first and thought she was joking. I thought she would apologize or understand. She is insulting my mom, yes, but she's putting it on me. Like she wants me to apologize for everything she did. I'm sorry I'm in your house. I'm sorry I am a financial burden. I'm sorry my mom made that stupid post on Facebook. I'm sorry I was neglected. I'm sorry she was so gross. I'm sorry she can't communicate. I feel out of place.", "created_utc": 1680708872, "permalink": "/r/AmItheAsshole/comments/12co5u0/aita_for_asking_my_stepmom_why_she_insults_my_bio/", "score": 316, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the AH for asking such a direct question. My stepmom does everything for me and my brother and I just asked something a bit shocking and rude maybe. Maybe I am ungrateful. I also insult my mom sometimes, just not over the small things. More about things like how she neglected me and mistreated me. Not about the damn candles she uses.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA! In fact, I’m proud of you!\n\nYou’re beginning to stand up for yourself. Tell her straight up. “None of this is/was in my control. It upsets me when you bring up these misdirected issues. It feels like you are criticizing me rather than my bio mother. I GREATLY appreciate you stepping up for me, and I’d love to build an even stronger relationship with you - I just ask that you please be more mindful of my feelings & where I come from.” \n\nI’m sorry OP, my bio mom was shit as well. But just because step mom doesn’t abuse you doesn’t mean she can low-key belittle you like that. It’s not okay nor cool nor fun.", "NTA - your stepmom is NOT a nice woman.  A nice person would not put a child in the middle of adult issues.  You are absolutely correct, if she has a problem with your mom, she should discuss it with her or your dad, not with you.  Her behavior and comments are entirely inappropriate.  Making you feel bad about circumstances beyond your control is even worse!  She owes you and your mother a huge apology!  You don't mention your dad.  Where is he?  Have you discussed these issues with him?  Why has he not stepped in?", "NTA \n\nI can see why your stepmom might not like your mom, but she needs to vent to someone else about it. I was raised by my dad. My mom wasn't the greatest, and she had no visitation rights. Dad got full custody. \n\nBut I never put up with my stepmoms (he's on wife 4 lol) talking shit about my mom. Yeah, she sucked, but I was one of the only ones who got to say so. \n\nYou didn't even say anything out of line. You just asked why she does it. You reacted way better than I ever did when I was your age.", "NTA It seems like her hatred towards your biological mom just makes her want to speak about her, and that's not good for you, even though she is a good mom, saying that things and reminding you of things your mom does wrong is just unnecesary and it's really uncomfortable for you and your brother", "nta tbh,your stepmum seems kinda...insecure it looks like she needs to put someone that is considered \"less than\" down to pull herself up,doesn't mean she's not a good person or what she does is invalid,yk just someone being insecure", "NTA \nI think maybe if you want to try communicating this point again to your stepmom and dad you should just show them this post \n\nI doubt she realizes she is putting this stuff on you and thinks it's more like commiserating and based on her reaction probably thought you asking was you \"defending\" your mom's character (which to her I guess unduly implies a lack of appreciation towards her) whereas you simply don't want to made to feel guilty about your mom's behavior or have the negative way it has impacted you highlighted so frequently\n\nSorry you have to deal with all this and I hope they understand", "First of all, I’m sorry that you’re dealing with this at all. It’s awful when you have an unstable parent but just know that your moms inability to be a good parent doesn’t stem from anything wrong with you. It’s something broken within herself. I say this coming from a home with an abusive mom. Now that I’m an adult I recognize that her own trauma hampered her ability to be the parent I needed and she did the best with the tools she had… it just wasn’t good enough. But that’s not my fault. And it certainly isn’t yours that your mom isn’t capable of being the parent you deserve. \n\nAs for your stepmom. NTA *at all*. Her constantly insulting your bio mom is inappropriate. Maybe she isn’t aware of the damage it causes when she says those things and maybe there is some subconscious reason she’s doing it… like she wants you guys to recognize your moms issues and love her more than bio mom… but whatever the reason, it’s not acceptable behaviour. You’re obviously more than aware of the problems with your mom, she doesn’t need to remind you. Plus there is subconscious trauma that comes from someone saying hurtful things about our parents, even when we recognize how crap they are. \n\nHer reaction to the question is also troubling. She isn’t acting in a mature manner but hopefully once she sits with that question for a bit she will realize she needs to dial it back. Once she’s taken some space I recommend telling her how it makes you feel. It’s a hard conversation, but you deserve to be heard and respected. \n\nSay what you wrote in your last paragraph. You feel like a burden. You feel like she wants you to apologize for how your mom is. You feel like she is putting the blame on you for your own trauma. You feel out of place. \n\nYour feelings are valid and she needs to hear them. She needs to know she is hurting you and she needs to stop.", "NTA - you had every right to ask her that.  She should have the decency to not say terrible things about your mom in front of you.  I am a stepmother and would never ever put my stepdaughter's mother down in front of her.  That is just wrong.  My husband knows how I feel about her and my mother-in-law felt the same way about her.  Stop apologizing for things that are out of your control.  You need to sit down with her and explain how her comments make you feel and that you can't and won't take the blame for it.  If that doesn't work - talk to your father and explain how you are feeling.  Good luck.", "NTA. The question was direct, but it wasn't rude. Let me ask you this: What is it about asking a question based on an observation of repeated behavior that comes across as ungrateful to you? Gratitude doesn't mean forfeiting your spine or your right to be treated well.", "NTA, but your stepmom obviously cares about you and is frustrated that your bio mom didn't do a great job because you deserved better. The next time your stepmom says something about your bio mom, you could say something like,\"I love that you care about me so much, but when I'm reminded about everything that went wrong when I lived with my mom, I get upset and can't move forward. I'd really appreciate it if you wouldn't bring it up. Thank you so much\"", "NTA.  She shouldn’t be doing that.  But how to handle it and handle her feelings : \n\nTell her how much you appreciate her and everything she’s done for you.  Start there with the good news. \n\nThen, gently the bad news - you know why she has these bad thoughts about your bio mom, because you experienced it yourself and you also have those thoughts.  BUT - Ask her nicely to refrain from talking about your bio mom to you because it just makes you feel bad again, and brings you down.    Tell her it just reminds you of that bad stuff and you’d just rather not hear about it", "NTA- being genuinely curious about this situation is absolutely normal and for your step mom to punish you for asking is really sad and unfortunate. Experiencing neglect from your bio-mom is NOT helped by hearing her rant about it like it is an issue you have some control over. She should be sympathetic and save her harping for her husband/friends when you are NOT there. I cannot stress enough that her behavior is something that will only exacerbate any trauma or issues you have because of your biological mom's behavior and lifestyle. I'm sorry she responded so badly. (BTW I am a therapist, which doesn't mean I am perfect and know everything, but if a client told me this, I would be taken aback and really upset for them)", "NTA. If you have a cell phone record some of your stepmoms complaining. Then ask her to sit down and play it for her. Let her know that all the good she does for you is washed away when you have to hear all this from her. Let her know there is nothing you can do about what the bio has done and by complaining about her, you feel miserable and unable to enjoy things with stepmom.", "NTA. But your stepmom is and what she is doing is attempting to alienate you from your mother. \nI wonder how much of your not wanting to be around your mom has to do with alienation techniques.", "It's probably a number of factors, you are young so she feels like she has to protect you and therefore may have stronger feelings about it than you do, she knows you don't like your bio mom so maybe she sees it as common ground or a kind of interest  or situation that you guys share, you may not know everything there may have been times where she knows more awful things than you but she can't tell you, she probably only hears really bad things about you bio mom and therefore has absolutely zero good thoughts about her, maybe she has had similar issues in her past and it triggers trauma, not saying she is handling it well but those could be some reasons why she has such strong feelings, to her these feelings are known and understood as fact so when you say why do you insult our mom so much as a joke she takes it as, you are ridiculous for thinking these things or my mom isn't that bad, I'm sure she is working hard to not be like your bio mom and it hurts when it's not noticed. Not saying that's the case just that's the way I would think about it", "I used to have a similar issue with my mom when she complained about things. One time after I reacted badly she said \"I'm not blaming you, or expecting you to fix it! I'm just making an observation!' and since then, it's been easier to handle. \n\nI would hope your stepmom isn't actually trying to hold you accountable, but obviously I don't know either of you enough to determine that. I do think you should let her know that while you understand her grievances with your bio mom, you're not able to compartmentalize when she vents.", "NTA. I reckon your stepmother’s behaviour is based on deep insecurity. She is addressing this insecurity by putting your biological mother down (and therefore attempting to convince herself that she is superior to your biological mother) while trying to get validation from you that your biological mother is inferior to her. I can’t be sure of course it’s just what I feel from reading your story. An approach I suspect may help in this situation may be to not address the reason for your stepmothers questioning. Instead tell her how much you appreciate all she is doing for you, however the constant reminders of your biological mum is making you uncomfortable and taking you back to a worse time. Finish by saying you want to focus on the present and future with your stepmom rather than on the past, as the present and future with your stepmom is where you’re most comfortable and happy. Make this about fulfilling your needs. Good luck!", "NTA and gently--- your stepmom might seem like a genuinely nice person, but no loving parent -- bio or otherwise-- shames children for how they were brought up and for situations out of their own control. Your stepmom is perhaps better at parenting you in some ways, but she's still making you feel 'less than' and insulting you. I think you had every right to address this, but her reaction says to me that she knows she's hurting you when she says those things. Calling you ungrateful for asking a sincere question is not an answer to that question, it's a deflection and, in essence, she's now blaming you for your \"lack of gratitude\" instead of focusing on her own behavior.   \n\n\n There's a saying I picked up in my old childcare days when I was working with women transitioning from incarceration and learning how to parent their kids--- \"Shame the parent, shame the child.\" We were never to speak negatively of the parent in front of the child or make comments like the ones you are describing. I think it would be good for you to get some counseling, and for you to talk to your dad about her comments, if he's willing to listen. I'm a mom myself and what she's saying is not, in any way, acceptable.", "You and your step-mom have to talk. \n\nShe interpreted your question as \"Why are you mean to my biomom for no reason at all?\" while you meant \"When you are insulting my biomom for very valid reasons I feel you are holding me responsible for her faults and I feel wretched because I already feel she destroyed my life and I don't want to be reminded of her so much.\"\n\nOr, show her your post. Show her the best comments. And go to therapy, it will do you a world of good. You could be suffering from complex PTSD. \n\nNTA.", "NTA, she shouldn't be talking to you about her relationship with your mom. That puts every child in an uncomfortable place. This isn't something you should apologize for. She is being very immature and cruel for saying it to you.", "She’s insulting your mom for everything you listed. She’s upset at your mom for being the way she is. She knows that no mom should be that way to their children. And your 17 which means that you smelling is actually a you problem. She’s not blaming you for anything, she is upset at how can a woman like her treat her kids the way she does.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo for some background. I am living with my stepmom now and I am extremely grateful. I don't like my bio mom at all. My stepmom is allowing me to thrive and live a better life and not be abused. \n\nBut, she always insults my bio mom. Sometimes for the obvious, she mistreated her kids and does nothing. But sometimes it's for such small things. For example, the way our clothes used to smell. We either smelled really strong or like cigarettes. She complains to us and not our mom though. What am I supposed to do, or say? I'm sorry we smell bad? Like the insults are not going to my mom, you're saying it to us. You make us feel bad for something we literally have no control over. Or she gets mad at the way my mom texts and could never arrange a proper plan to see my brother. I'm aware it's her, not me, but it is placed onto me. What am I supposed to say to it? I can't control what she says. Or sometimes it's a simple as insulting the candles she uses and saying how gross they are. Sorry? Why are you telling us and not her? It has nothing to do with us, but you're saying how bad they are for what? Like maybe I'm projecting. I am ashamed of the way I was living. I feel gross always. But this does not help. So I asked her \"why do you insult our mom so much?\" Not in a rude way. I was laughing. She said \"are you serious?\" I said \"Yes, I'm genuinely wondering!\" While laughing. Like I get it was a very direct and uncomfortable question. I was expecting an answer like \"She is just not a good person\" or \"I'm sorry\". But instead she cancelled our plans for today and said we are ungrateful, so why should she do anything for us? \n\nMy stepmom is a genuinely nice woman. I almost didn't believe her reaction at first and thought she was joking. I thought she would apologize or understand. She is insulting my mom, yes, but she's putting it on me. Like she wants me to apologize for everything she did. I'm sorry I'm in your house. I'm sorry I am a financial burden. I'm sorry my mom made that stupid post on Facebook. I'm sorry I was neglected. I'm sorry she was so gross. I'm sorry she can't communicate. I feel out of place.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - No one should ever insult a parent to a kids face, even if the parent is flawed or a bad person. It takes a toll on a kids mental health, even if said kid dislikes the parent. It just comes off as petty and makes them feel like they’re expected to be able to do something about it when they can’t, or that it’s their fault. There’s no reason for it. \n\nI was in a similar situation but handled differently. I’d never had a great relationship with my bio mom as she was extremely abusive. Anytime I would visit my mom to see my half siblings and my step dad (whom I have a great relationship with, he’s since separated from her and raised my siblings himself for good reason), I would apologize for how much she had to feed me because I was starved, or that I smelled like cigarettes. My step brother, her first born, would always complain about how bad I smelled, but she always told me it wasn’t my fault, and that no kid should ever take the blame for that stuff after going through it. Her and my dad fought like hell legally to get me out of there, and never once has she taken that out on me or insulted my mom to me. \n\nNone of the stuff she’s complained about is your fault in any way at all, but I know saying that doesn’t help all that much. It was really good for you to mention it to her, hopefully she realizes how it makes you feel when she insults your bio mom and you guys can get over it. Wish you the best.", "NTA. Is there a reasonably sane person you can stay with?", "NTA\n\n&#x200B;\n\nNothing in your post says your step mom is a \"nice\" woman.", "NTA \n\nFeel free to use this phrase every time your stepmother insults your mom to you \"Yeah, b***hes be crazy...\" and just keep it moving. As a general rule, when dealing with assholes (your stepmom is absolutely an asshole) bored dismissiveness will take you to places that hurt feelings or righteous indignation can only dream of.", "Oh, and I am freaking APPALLED step mom canceled plans over this. She’s doing everything wrong. “Step daughter DARED to create a reasonable boundary? UNGRATEFUL BRAT!” \n\nWhen you confront her again, try not to laugh. I know you were nervous but you need to remain calm. Let her know this is serious because IT IS. Of course, don’t forget to stroke her ego in the process; she won’t listen otherwise. Focus on your interest in building a healthy relationship with her and maybe she’ll develop an ounce of empathy. \n\nPlease don’t let her make you feel bad about yourself for things out of your control. You don’t have a damn thing to be sorry about. Wishing you the best!!", "This is the best response!!", ">but she needs to vent to someone else about it.\n\nWhile I agree, that someone should not be the child, even if they are older. The woman needs to have boundaries, and that means keeping your thoughts to yourself until you are with an appropriate person to vent to. Stepmom could have expressed her frustration to OPs father, a friend in confidence, a therapist if it's such a sore spot that it's eating at her.....  there is a lot, A LOT, as a parent that I keep to myself until I can find a peer to talk to. My kid is not that peer and those conversations wouldn't be helpful for him. Stepmom seems not to recognize that the OP is not entitled to her opinion about the mom.", "This is what I wanted to say.\n\nYour step mom shouldn't say it to you.\n\nHowever it does come from a place of love for you.  She is upset that your bio mother didn't treat you well.", "She said it was because of the fabric softener my mom uses and the smell of cigarettes is definitely not my fault. I don't smoke", "That may be the case, she may just be upset- but where she's going wrong is pointing that upset at anyone except the responsible party. And that isn't OP. She is definitely in the wrong for voicing her upset and complaints to OP.  \n\nAnd that needs to stop.", "Step mom can be upset with bio mom all she wants, and rightfully so, but she needs to realize she is only resurfacing OP’s traumas. OP is 17 years old and needs time to heal, not illogical guilt trips.", "You said what I said, just used more words lol", "I feel for you. My stepfather used to smoke in the house all of the time, in the car with us in it. I was fortunate enough that he and my mom divorced before my high school years, but yeah, I was that 'stinky' kid too. :(  No choice in the matter. You can take a shower but if you are living in the same house as a smoker, it gets into everything.", "She’s not blaming you. She’s blaming your mom. She’s mad. Yes she is TA for talking to you about it, but you should sit her down and explain that every time she complains about your mom to you, that it makes you feel uncomfortable and that you feel she is blaming you for her actions", "NTA! Oh my lord, sorry but I don't like my bio mom, or adoptive mom, I love my step mom tho, yet my entire life she has never insulted my mom's. She would say I don't like her, but always say she never felt comfortable with her anger issues, but I found out later how badly they treated her.", "NTA. So she’s not a nice woman.", "Being a step mom is really really hard. She shouldn't be putting all of this on you, but as a SM it's really easy to feel less than and be insecure. None of that makes what's shes doing ok- for the record.But she is human too, and it might just be her way of coping. She won't see what you said as a question- she'll see it as you taking up for your mom, which she won't understand and feels even more insecure. She is the adult and should know better- but she obviously doesn't . \n\nI think you should ask to talk to her, and explain what you said here. That you love her and appreciate what she does, but when she insults your mom, it feels like she's insulting or blaming you. I guarantee she is just blind to that fact. And if she's as good a step mom as you say, hopefully she'll listen and try to see  your point of view and change her ways. Good luck. I hope things get better. Don't let it get to you. \n\nNTA.", "Where’s your dad?", "NTA\n\nAt all, and I'm sorry you're going through all of this.\n\nI wonder if your question came across like, \"there's no reason to insult my mom.\" \n\nNow, even if that's the case, your stepmom should have asked for clarification and used her words to make sure she understood what you were saying. She didn't do that, and that isn't your fault .\n\nBut, it sounds like you are grateful for your stepmom and you aren't defending your mom. So if I were in your position, I'd maybe try to start a new conversation with your stepmom. Something like, \"hey stepmom (however you normally address her), I feel like there was some miscommunication earlier. All I was trying to say is that I agree with all of your comments about my bio mom--she is a crappy mother. But I don't feel comfortable when you say all of those things to me. It makes me feel bad about myself and about the way I was raised even though I know it isn't my fault.\"\n\nSomething like that. Or show her this post, or write her a letter with how you feel.", "This. A nice woman would see kids who need a mom and try to be the best stepmom she could be for you. Instead she’s punishing you for your mother’s failings. That’s not nice at all.\nI have an abusive bio mum too. It took me a long time to realise that “better than my bio mum” was a horribly low bar and did NOT mean that someone was actually good or nice. Just that they weren’t as bad as my mum.\nNTA.", "Ok. First of all. All my love to you. NTA.\n\nIn mental health, we never trash any parent. We listen. That sounds like something you need. To vent. Your bio mom could be the biggest asshole in the world. But I would never say that to a client. I’d validate your feelings. We don’t trash the parent because the children (some children I’m talking about are in their 70s!) have conflicted feelings and I’m being inappropriate jumping into their pain by knocking the parent too. \n\nI work with a lot of clients who were children of hoaders. They don’t like to be reminded of having smelly clothing or unsafe living conditions. Unless it’s something they are talking about. It’s painful. \n\nOP. My sorry will never heal your childhood. I’m proud of you, a stranger on the internet. You’ll grow to be a compassionate adult. \n\nYou need validation and support.", "NTA. Your step mother isn’t a nice person . A nice person wouldn’t insult a child’s mother in front of them . What a nasty person", "NAH, but you should work on how you communicate things because the way you frame what the problem is and the way you claimed to have said it to her come out VERY different.  \nFor some reason it seems like you're taking it as a personal insult when she just reacts in the moment to vent frustration. Like if I stubbed my toe, and said \"ouch that hurts\", it feels like if I said that when you're in the room that you would feel attacked like I thought you caused my toe pain rather than me expressing pain about the situation even though myself is to blame.  \nYour post here **sounds** like you **think**: \"Why does she she blames us for our biological mom's shortcomings, we didn't do it, so why does she say it to us\"\n\nYour comment **to your stepmom sounds** like: \"Why do you think our mom is a bad person?\"\n\nYour comment to your stepmom probably came across as supporting someone you both seem to agree was terrible and she feels frustrated she's trying to help you out, but you feel the need to support your awful bio mom. While it seems like your real problem is why she vents these frustrations to you but for some reason you make it sound like you don't think your bio mom is worthy of defense.  \n\n\nI feel like you should've explain it to the way you explained to us, that you appreciate all she's done and the opportunities she's given, but that you internalize it as your problem because she's venting it to you rather than your bio mom. If you had said something like \"why do you always make these comments about things that my biological mom did to me? When you say it to me instead of her, it feels like you're blaming me for something I can't control and didn't do just because she gave birth to me\" I think she'd have a better understanding of your position and more empathy for how you're feeling and be willing to make adjustments like being mindful of where she makes those comments.  \n\n\nAt this point, I'd say to her something like \"I'm sorry if it came across the wrong way, what I meant earlier wasn't that I think you're wrong for blaming her, and I am grateful for you in my life, but when you vent your frustrations about her in front of me rather than to her personally, it feels like you're blaming me for being her kid that all these problems are happening to you.\" Unless she's secretly really an awful person, she'll probably see the problem with her behavior or try to make clear to you that's now what she intended.  \nI know a lot of people in the comments seem to blame the step mother for venting to a child. I get that in some ideal world a mother(step or bio) wouldn't say these things or vent in front of their kids, but ultimately we're all human and fallible. Sheltering your real feelings in every instance you're in front of your kids would likely be far more stressful and toxic to your own mental health than just taking the time to make sure your kids don't feel responsible for it.", "Don't question her. Say you agree with her, but being constantly reminded of it makes you feel bad and like it's somehow your fault even though you know thats not her goal you cant help it. So can we please move on. NtA", "NTA. Not sure what your step mom is thinking.  Can you talk to your dad?  It might help if you explain your position like you did in this post.  Maybe dad and stepmom don’t understand that you feel like they are blaming you for bio mom’s actions.", "NTA", "NTA, unfortunately your stepmom missed the absolute #1 rule of stepparenting, which is never insult the bio parent in front of the kids. Even when the kids don’t have a good relationship with the bio parent. The way you’re feeling now is exactly the reason why.", "NTA  I think she didn't really understand what you meant --that you are hearing her lay those things on you.  I'm sure she doesn't mean it that way.  Let her read your post.", "Also OP. You’re a minor but I’d gladly find you a non profit you can call to talk to someone to have healthy venting. World would be better if we could support each other.", "NTA. Maybe try phrasing it differently. Instead of asking why she insults your mom, say along the lines of: I feel _____ when you say ______ about my mother. Is this how you intend for me to feel?  There might be better ways of phrasing it but that’s one idea.", "To meet it seems like she's getting to you tell your bio mom what she says. To start shit. I ised to work with people that gossip to spread it. I just cool whatever and ignored it. Maybe that's not what's going on but it was my first thought", "NTA.  I’m sorry your in this position.", "NTA. \n\nYou may not relate to this, but I'm throwing it out there in case you do. My mom says mean things about my father and, yes, he deserves some of them. But, at the end of the day, he is still my father. Whether that be a social or genetic link, hearing someone who I was so closely connected with be constantly bashed started to make me question my own worth as well. It made me wonder if I would do similar things, was like him in certain ways, etc. At times it could even make me feel like it would all be better if she hadn't even met him (then I wouldn't exist as well). I'm not saying these things are true, but it wears you down. Hearing the constant sentiments also can make you question yourself, \"Did I not see this? Why didn't I challenge this? Is it so obvious? Did I let this happen to me?\" In reality, you were a child under her care and share no fault! \n\nNevermind the constant negativity. It can be suffocating. At the end of the day, she has her own opinions about your mom. But, your mom also gave her... You! (Even just in the sense of a stepmother/daughter relationship) If your stepmother is so concerned about how your mother has been treating you, then she should be aware that you need more compassion, not unrealistic responsibilities or unnecessary emotional labor for a 17 year old.", "i was extremely disappointed that she got angry at you for asking that, especially when you took such care to couch it in low stakes tone and body language. \n\nbased on her reaction, what i believe she heard when you said that is \"how dare you?\" she got defensive. to make it clear to her what your point is in asking, i might have suggested as an alternative, \"i don't know what you want me to say when you talk about how bad we used to smell at mom's house. we were embarrassed too.\"\n\nbut frankly, op, she should have figured out what you meant. she's a grown woman. \n\nyou deserve to be cared for and respected. you deserve to be able to speak your mind without being punished for it. \n\ni'm going to give your stepmother the benefit of the doubt and assume this was wildly out of character for her, and that this was just a big misunderstanding. mostly because i hope your life is a good and happy one. \n\nbut just for the record, it's the responsibility of parents to care for kids. since your bio mom couldn't swing it, it fell to stepmom. that doesn't make your stepmom an incredible person just for caring for you. that's the bare minimum. an incredible person wouldn't cancel plans and take away privileges because the kid they're taking care of came across as \"ungrateful.\" \n\nsorry this is happening to you. nta.", "NTA. She sounds insecure. You have every right to set a boundary and explain how this is affecting you. \"It makes me feel gross when you say we smell all the time. I can't fix that, and Mom isn't hearing it, so could you please stop saying these things to me?\"", "NTA.\n\nShe is not being a responsible adult and stepmother by doing this, and regardless of what SHE thinks of your mom, she should never attempt to influence your opinion, or put your mothers shortcomings onto you. \n\nYou're doing so great standing up for yourself, and if you dont mind me asking, what does your father think about all of this? He should really be the one to tell your stepmother to drop it.", "NTA.  Step parent here and no matter what I think of their parent, I would not say it in front of them.  Maybe your choice of words was not the best way to make your point.  Something such as, “I know my mom has a lot of issues, but it hurts to hear them verbalized all the time.  I live with that reality in my mind 24/7.”", "NTA. I’m a step parent and the kids bio mom has done some seriously neglectful and reprehensible things, but I would never bad mouth that woman to her kids. It’s not acceptable under like any circumstances. If I need to vent about how bio mom doesn’t pay child support or see her kids I call my mom and talk about it because it’s a lot to deal with emotionally. If my stepkids want to talk about their mom, it’s my job to be neutral and just give them a safe space to talk and validate their feelings and give them advice if it’s needed/wanted. But even then, I can’t just be like yeah your mom sucks can’t believe she’d do that. I’m sorry your stepmom is using you as some sort of emotional pillar so she can dump her frustrations somewhere, it’s extremely inappropriate and you are in no way in the wrong for asking about her reasoning behind her words. I hope that your stepmom realizes she is hurting you with her actions and apologizes for it and keeps her mouth shut about your mom in the future.", "NTA. It may have been better to give her the explanation along with the question, but her reaction was very over the top. She isn't anice person if she doesn't understand that it is not okay to badmouth a child's patent in front of the child, no matter how true the criticism may be.", "She is a nice woman overally though - one who has taken on all kinds of responsibilities and I am assume has been stuck in the middle of a lot of energy-sapping and unfair situations.\n\nNTA\n\nOP just has to try to speak to his mother the same way he has expressed himself here:\n\n\"You have been so great to us, and we love you.  It is just that hearing bad things about how I used to live makes me feel bad, and I don't like to hear it.  I know my mum has made life difficult, but that is her fault and not mine, and I don't want to feel bad and have it shifted on to me.\"\n\nI think its a bit outrageous to call her a bad person after she has stepped in and taken on all kinds of responsibilities for years and finally given the kids a stable life.", "NTA  Apparently stepmom isn't as nice as you think she is.   Causing children to feel uncomfortable or confronted about something outside their control is wrong.  \n\nI worry that you have no good role models.  Hang in there.", "NTA.\n\nI had to deal with this growing up. My dad and mom had me out of wedlock. Long story short my mother got hooked on pain killers but go help and got better. Her old husbands wife however was an evil person and falsely accused her of shit and got her locked up. (Ironically the evil wife was found grooming a 6th grade boy with at least a year and a half worth of proof.) anyway my parents would shit talk my mother all the time. It sucked because even on her death bed she would never tell me how much they made her life a hell. I had to get that out of my aunt. My dad and step parent would judge her all the time for petty things, make me stay with her and know very well she couldn’t afford it, and over all thought there middle classes asses where better than her.\n\nBut I learned that your colors are truly ugly, when you get jealous of a woman who hold no power to you. I truly hope your situation gets better, and I hope your stepmother gets help."]}