{"id": 14120, "submission_id": "12dct93", "title": "AITA for calling my younger sister stuck up and a brat because she wanted more money?", "selftext": "I (20F) and me sister (16F), have a strained relationship she is an overall brat and manipulative person. Now what happened, today my mum gave her $75 to go out shopping and my sister started saying that she needs more and that her friends parents are giving them like $200. (My sister is quite popular and we live in a wealthy suburb). I came in from my bedroom to grab my phone and keys and my sister started saying that my mum always gave me more that's how I got expensive stuff. I replied telling her no, I had a job from 14 and saved money and the only way I afford stuff now like my car, saving for an apartment  as well as paying for my degree and then a masters, is through 4 jobs and that mum and dad gave me nothing. And I told her if she wanted more money then she should get a job. She got pissy at me and started ranting insults which I won't say. I then told her mum and dad have been more than generous as a I bought all my own stuff while she demands stuff and has tantrums until she gets her way, and that she should get off her stuck up butt stop being a brat and put effort into life. \n\n&#x200B;\n\nMy mum got angry at me saying I shouldn't parent her. My dad however says that my sister needed a reality slap. So AITA?", "created_utc": 1680767519, "permalink": "/r/AmItheAsshole/comments/12dct93/aita_for_calling_my_younger_sister_stuck_up_and_a/", "score": 629, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I may be the asshole because I should have left it to my parents to correct her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour dad  is correct but it should have been him that told her so.", "NTA \\~ Dad is right, and all of you should stop feeding this behaviour. Your mother should know this.", "younger child privilege is real as hell. NTA, I feel like younger sister & mom just mad because there’s truth to what you’re saying.", "NTA\nYour sister is the one who involved you. Mum was probably just embarrassed that you said the things she doesn't dare to say.", "NTA. It sounds like your sister has some entitlement issues and you were just telling her the truth about how you earned your own money. It's not your responsibility to coddle her and it's good that your dad supports you in this situation.", "NTA \n\nShe throws a fit and gets corrected. Typical sibling relationship", ">My mum got angry at me saying I shouldn't parent her. My dad however says that my sister needed a reality slap.\n\nBoth your parents are correct here, it's not your job to parent your sister and she probably DID need a \"reality slap\" - but it shouldn't have been from you.\n\nBut I wouldn't go as far as calling you an a-hole. But I would recommend you to stop trying to correct your sister. It's your parents job and if they don't to it she will have a very difficult life - but that's not your problem. So NAH.", "NTA (neither you nor your father) but your mother and sister are... So it seems that your sister is your mother's golden child... Hopefully your sister & mother will change their way of thinking... You earned everything you have, you worked for it. She didn't.", "NTA - your mom needs to STOP giving her money and tell her to get a job. does she even do anything to earn that money? like help around the house?  \ncause damn when i was that age i got $10 a week and only AFTER i did all my chores, hearing her just get $75 for \"shopping\" and complaining it not enough?! dang she's spoiled.", "“My sister started saying that my mum always gave me more … “\n\nNTA. Sister brought you into it, so she can deal with you having your say in return.", "NTA. Your sister is a typical popular teenager that always wants to be on top ugh🙄", "YTA. Give her more money. /s but seriously how could this story possibly end in anything but an NTA? There’s no ambiguous moral conflict here", "NTA you did the correct thing", "And now you see your mom is the root of this entitled bratty behavior. NTA", "NTA. You're just telling her what you think, and she needs to hear it. I suspect your mum heard it as a criticism of her parenting.", "NTA - Once I was old enough to work, my parents rarely -if ever- helped me out with finances outside of necessities. Your sister needs to grow up and your mother needs to stop enabling her.", "NTA. She “asked” (well accused is probably more accurate) and you told her the truth. Other posters are right - both your parents are correct - it’s not your job to parent her and she did need to hear it. That said you do get to tell her what you think of her as a big sister and I feel that is what you did - and only when prompted.", "Your mom says you shouldn't parent her. Someone has to!\n\nNTA", "NTA.  Dad is right, and he needs to shut down your sister.", "NTA. And unfortunately your mother is the AH. She needs parenting classes. Or perhaps it’s too late", "NTA I'm with your Dad. Your sister does need a reality slap.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (20F) and me sister (16F), have a strained relationship she is an overall brat and manipulative person. Now what happened, today my mum gave her $75 to go out shopping and my sister started saying that she needs more and that her friends parents are giving them like $200. (My sister is quite popular and we live in a wealthy suburb). I came in from my bedroom to grab my phone and keys and my sister started saying that my mum always gave me more that's how I got expensive stuff. I replied telling her no, I had a job from 14 and saved money and the only way I afford stuff now like my car, saving for an apartment  as well as paying for my degree and then a masters, is through 4 jobs and that mum and dad gave me nothing. And I told her if she wanted more money then she should get a job. She got pissy at me and started ranting insults which I won't say. I then told her mum and dad have been more than generous as a I bought all my own stuff while she demands stuff and has tantrums until she gets her way, and that she should get off her stuck up butt stop being a brat and put effort into life. \n\n&#x200B;\n\nMy mum got angry at me saying I shouldn't parent her. My dad however says that my sister needed a reality slap. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA \n\nYour sister cornered you to complain and you gave it to her straight.\n\nNo you're not her parent, but your mum needs to start parenting her instead of giving in to her. \n\nIf your parents had done that already, she wouldn't be whining to you.", "Yeah, I actually agree with the mom wholeheartedly here about OP not being the parent. It was not OP's place to say that really. However, it's such normal behavior to \"check\" a sibling on something like this (siblings call each other out all the time), that I think it would be unreasonable for me to say OP was being an AH.", ">younger child privilege\n\nWhat is this? Is it that younger children are given more of a \"pass\" on the rules or something?", "I feel though my sister feels she is in the right. My mum gave her everything nothing ever happened to her I always had strict rules she never had to follow one example is she cheated on her boyfriend my mum didn't even look up and said he'd get over it my ex cheated and she told me I had to have done something wrong.", "Yes.\n\nAs the baby of the family, I can wholeheartedly agree that I had it a lot easier than my older siblings and even my older siblings.", "Yep new parents are often strict on rules for the first kid, then as more kids come along relax a bit as they 'know' what they're doing now plus less strict with money as they're earning more, relaxing become less strict as more kid come with some of the teaching behaviour aspect getting load of onto the older kids", "Those two experiences aren't really parallel -- if you had cheated on your ex and your mom said you were wrong, and then your sister cheated on her ex and your mom said he would get over it, that would be a fair comparison.", "I don't understand the golden child philosophy, I seriously don't. It does nothing except bring bad things.", "This is relatable as hell with me! My mum has become a complete push over and let’s my sister basically bully her. She gets her way and lives a grand old life with all her ‘rich’ friends yet me and my brother have had to work hard since the age we legally were allowed to and pay our way for a lot of things. We got disciplined and given the cold shoulder for stepping out of line but with her my parents basically grovel at her feet of she raises her voice. NTA she needs a huge reality check as does your mum.", "NTA you just told her the truth lol.", "NTA as someone with many siblings, sometimes you need your siblings brutal honesty in order to get a reality check", "NTA - you're not parenting your sister, you're correcting her assumptions about your teen years, and she WAS being a brat about it, so you were entitled to a little bit of a spicy reply to her.", "NTA", "NTA and the fact your dad sided with you showed that before you came here", "NTA- You corrected her when she brought you into the conversation. She throws tantrums because your parents let her.", "[removed]", "NTA ~ If your Dad had done that already, she wouldn't be whining to you.", "i disagree, her sister brought her into this, she wasn't even gonna entertain it until she was brought up. And idk how other sibling relationships work but as an older sister why wouldn't she give guidance, especially if her parents weren't? Just cause her parents suck doesn't mean a child doesn't deserve parenting. Like imagine being able to help your SISTER but you stay silent and let her turn out the way she is cause you're \"not her parent\", yea but she's her sister, doesn't a sibling bond count for anything?", "I dont think she was being a parent, she was just being a straight up older sibling. As a teenager I would definitely listen to my older sister over my parents. My parents could say something 1000 times and it not get through but as soon as my sister said it, it would sink in.", "I disagree. If the parents were talking to the daughter and OP butted into the conversation, that would be him interfering. She was complaining to him about how she wasn't getting anything and he had all these things provided to him and OP corrected her assumptions and shared his opinion of her.  Siblings have their own relationship and call each other out for behavior they don't like all the time without involving parents, this is exactly that. \n\nNTA", "NTA", "If her parents dont do it, who else beside OP?", "Yes, her sister brought her into the argument looking for support but she could have just corrected her and explained about her jobs and own money. OP is four years older which makes the sister only 10 when OP begun her first job, most 10yo (especially those that are priviliged) doesn't notice all details about an older sibling. They see things, but not how they're paid for.\n\nOP's initial explanation was fine, telling her sister that she has worked for her own things but then she took it too far.\n\n&#x200B;\n\n>I then told her mum and dad have been more than generous as a I bought all my own stuff while she demands stuff and has tantrums until she gets her way, and that she should get off her stuck up butt stop being a brat and put effort into life.\n\nLet the parents be the parents.", "Op interfered because sister brought them into it while she was in the same space. I’m pretty sure if sister would have kept her name and situation she obviously either knows nothing about or is deliberately twisting around the facts  op wouldn’t have gotten involved. I’m pretty sure if you walked into a room and hear someone lying about your situation you would set them straight, that’s all that was being done.. along with a lot of truth bombing.\nMom is an enabler and dad seems to be deferring to what mom says but they both need to be on the same page with raising this girl.", "And as the oldest of 4 . Me and the youngest were the fav 100 percent. I was also the only boy. Me and my stepsister could do no wrong. My sister and my other stepsister were treated fine and all but definitely favoritism. By my dad and my stepmom. Even my bio mom doted on my youngest sister.", "NTA. Mom failed to parent and older sister gave a reality check. Good for you, OP. \nBetter for little sister to learn now.", ">My mum got angry at me saying I shouldn't parent her. My dad however says that my sister needed a reality slap. \n\nWe can tell which parent has a coddled favourite here.\n\nNTA", "NTA", "NTA - your parents will always favour her.  Presumably your sister is pretty  - pretty and popular go hand in hand at that age.  The good news is that she's in for a rude shock after 18, unless your parents are going to beggar themselves satisfying her requirements.", "NTA \n\nYour sister brought you into it and you responded.", "nta", "Well tell Mom that if she parented her, you wouldn't have to.  NTA.", "NTA\n\nShe sounds spoiled as shit and needs a reality check.", "How you have a masters at 20. You some super genius fr.", "NTA", "Sounds like you are a loving brother.  Telling sister about reality.  Get a job or find a sugar daddy and kill him off before he realizes his mistake.\n\nSee how your mom likes that version of life.   \n\nSorry, I should not have said that.  I have seen too many women with no way to support themselves in a bad relationship and had o stay because they had no other way of supporting themselves.  Or found themselves out on the street making ends meet the only way left.", "NTA\n\nI mean your parents are who have enabled her to be this entitled. I mean if they have the means and are happy to be generous, that's fine, but if she has no gratitude then it's become a problem.", "It relates to me as hell! My mom became a total jerk over and let my sister basically bully her. He gets his way and lives a grand old life with all his 'rich' friends yet me and my brother have had to work hard from the age we were legally allowed and pay our way for a lot of things.", "Sometimes your siblings need a brutal honesty check for reality", "[removed]", "Your sister needs to grow up and your mother needs to stop enabling her.", "I disagree.  This was a discussion between the 2 sisters.  younger one accused older one of getting preferential treatment because of what she has so older sister clarified the facts, that she worked for everything she got and it wasn't handed to her, so why not get off your butt and go earn some money.\n\nMom is crippling younger daughter.  Does she plan to financially support her for the rest of her life? if not then she better make some changes and quick, like have her get a job and learn the value of money.\n\nNTA and good for you, you've demonstrated a good work ethic and this will serve you well while your sister will view herself as a victim of circumstances (brought on by her own behavior and mom's spoiling)", "Even when she’s saying something completely untrue about op? That’s what started it. Sis was saying their parents gave op way more than her. This is untrue as op has been working to afford her own things since she was 14.\n\nShe pointed this out- stating if sis wanted to have as much as op did when she was that age she should like op actually get a job too us just a blatantly obvious continuation of that.\n\nSis dragged op into it to use as a prop to get her leverage to get more.\nShe just didn’t think it through.\n\nNTA -if I was op I couldn’t just ignore someone trying to use me like that.", "So real. By the time I came along my parents were older (40s) and had spent the past 15 years getting my older siblings to behave. I still had rules to follow, but way less than they did. They also had more disposable income by the time I was a teenager, so I definitely got a bigger allowance.\n\nOn the flip side, when my siblings were buying their first houses, my parents were guarantors for their loans. When I was buying they could no longer do that, having retired. Also, my siblings had a lot of childcare time from my parents, whereas in my case they no longer have as much energy for it. So win some, lose some.", "NTA...  you didn't say anything that wasn't true..", "NTA\n\nBut it kind of bugs me, that your parents, both parents, gave you anything. I mean, college is expensive, yes, but who let their kid work 4 different jobs and let them pay for everything???? They suck.", "NTA. You shouldn't need to parent her but here we are lol", "NTA, mom is enabling brat to be brat, dad sees the problem.\n\nYou are not parenting her, you are correcting her incorrect victim narrative that you were spoiled more than her, with the fact that you learned to work to get the stuff you want, while she is just being spoiled and expects even more.", "NTA. As a fellow older sister with a mum who coddled the youngest sister, if no one else will parent, who's supposed to do it?", "NTA for telling your sister your reality.", "NTA. \n\nI don't have the total picture, but my kneejerk is: your dad rocks.", "Dad's right and mom is creating a monster", "NTA.\n\nShe brought her problems and her mouth to you, not vice-versa. If she doesn't want schooled she needs to keep herself to herself.\n\nThat wasn't parenting, that was trying to be a good sibling. You told her exactly what she needed to do if she wants money. Not your fault that she'd rather sit on her ass play the blame game.", "It was OPs place to say because the sister had it coming when she antagonized OP over money.", "Oh yeah! I’m the baby of my family and even I know I got a lot more crap and got away with a lot more stuff than my siblings! I admit it! NTA OP", "The mom was not being a parent is the problem.", "No, she wasn't but it's stil not OP's place to step up instead. Especially not when there's a dad who has the right idea.", "NTA", "NTA\n\nShe did need a reality check. What she got was enough and asking for $200 for a single shopping trip was bratty. \n\nHowever, your parents are somewhat of AHs because they seem to  treat her better than you and she now expects it. The both of you have (had) a right to some allowance growing up. Not giving you anything and making you go to work from a young age while also still being in school, needing to focus on your education, was wrong.", "NTA, sister brought you into the argument and you just corrected her", "NTA here. Sad to see you have to put up with what your parents have done. Keep it up, she needs to see what life is really like.", "You're allowed to defend your own honor if someone claims you got things through means that aren't correct", "Mum probably wouldn't like it OP mentioned that if mum was parenting OP wouldn't need to check her sis.", "I'd be willing to bet mommy gives the brat most of the money, the father just ends up finding out after the fact, hence he wasn't too upset, meanwhile mom was being criticized since she lets this happen.", "Oh yeah, but it should not have gotten to that point in the first place.", "*her", "While the dad agrees with the OP. He is going with the flow, and not stopping the mom from indulging the sister.", "NTA  She brought you into the fight.  She's just pissed that you didn't agree to worship at her feet.   I hope it's not too late to turn her life around and make her a better person.", "NTA", "Nta. She's gonna have to figure out eventually that she's gonna have to work if she wants nice things. Unless your mother wants to take care of her for the rest of her life.", "NTA, but your parents are not doing your sister any favors. She will continue to be an entitled brat.", "Yes, the baby of the family is usually spoiled more and given more freedom. I’m the oldest and I can tell you my sister (the baby) is by far the most spoiled child in many ways.", "Yes usually the \"younger\" child or children will be given a \"pass\" on the rules. The younger children are usually able to get away with things the older children can never get away with. Just to give a few examples here.\n\n1.) stay up way longer than the older children or no curfew.\n\n2.) get anything and everything they want\n\n3.) break any and all the rules and the parents ignore the younger child.\n\n4.) the younger child/children can wear what they want go where they want. \n\n5.) get all the money they want, no questions asked.\n\nI'm sure their is more but that is basically it. The younger children are spoiled get what they want etc.", "You sound jealous which is fair but you also have to understand expecting you to pay for all that you do is the unfairness. That's on your parents not your sister. (Can't comment on the other stuff though. Parenting tends to change with time but the cheating stuff is too much)\n\nThar being said does sound ungrateful and that should be taught out of her.", "The sister is totally a brat and doesn't seem to respect the money she has been given but \n\n>Does she plan to financially support her for the rest of her life?\n\nI don't know they financial situation. They live in a nice area but for all we know they could be house poor. She's also sixteen. A lesson needs to be learned but still getting money from their parents isn't being financially dependent on them for the rest of her life. She's a minor. OP probably shouldn't have had to be dependent on herself to buy all the things she did.", "Statistically, oldest children get the best deal in terms of life outcomes (higher incomes, higher IQs, etc.). The most common assumption in the literature that this is because parents spend so much more one-on-one time with oldest children during the most formative years of child development (0-5) relative to younger children, who rarely get one-on-one attention. The privilege is relative. \n\n(obviously, I am a youngest child!)", "NTA.  Your mum is confused.  You weren't parenting her.  You were giving her a good swift kick in the backside.  I have done the same thing to my little brother on multiple occasions.  She's 16.  She's old enough to have a job and earn her own spending money.  Your dad understands this. and realizes they're at risk of having to support her the rest of her life if she doesn't feel the cold hard slap of reality now to prepare her for the future.", "NTA\n\nYour parents need to grow a spine."]}