{"id": 14139, "submission_id": "12dlv6i", "title": "AITA for refusing to let my sister borrow my car after she totaled hers?", "selftext": "My sister (28F) and I (26F) have always been close. We live in the same city and see each other regularly. Recently, my sister got into a car accident and totaled her car. She was lucky to escape with only minor injuries, but her car was completely destroyed.\n\nSince she relies on her car to get to work and run errands, she immediately started asking around to see if anyone could lend her a car until she could afford to buy a new one. I offered to let her borrow my car for a couple of weeks, but with a few conditions.\n\nFirst, I asked her to cover the cost of gas and any maintenance or repairs that might come up while she was using it. Second, I asked her to be responsible and take good care of the car, as it's my primary mode of transportation and I can't afford to be without it for too long.\n\nShe agreed to these conditions and took my car. However, after a few days, I started getting calls from friends and family members who saw my car parked in places where it shouldn't have been. Apparently, my sister was using it to run personal errands and even let her friends borrow it without asking me.\n\nI confronted her about this and she got defensive, saying that it was just for a short time and she needed to get around. I reminded her of our agreement and told her that she couldn't continue to use my car unless she respected my boundaries.\n\nShe got angry and accused me of being selfish and stingy. She said that family should help each other out in times of need and that I was being unreasonable. I argued that I was happy to help her, but I couldn't let her take advantage of me and my property.\n\nWe ended up having a big argument and she stormed out of my apartment. Since then, she's been avoiding me and telling our mutual friends and family members that I'm a terrible sister who doesn't care about her family. Am I the asshole for refusing to let her use my car?", "created_utc": 1680790911, "permalink": "/r/AmItheAsshole/comments/12dlv6i/aita_for_refusing_to_let_my_sister_borrow_my_car/", "score": 38, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Not letting my sister borrow my car I want her to be able to get a round but I can’t let her go the random places or let her friends use it but at the same it’s her only way to get around\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Letting her friends borrow YOUR car? Absolutely not okay. Your car so your rules.", "Wait, your sister was lending out the car you lent to her, to other people you don't know??\n\nNope NTA\n\nYour sister is a boundary stomper. Let her insurance help with a loaner and get your car back ASAP if you haven't already.", "NTA. This car costs too much for Ü to take chances w it", "NTA - your car, your rules.\n\nI would also make sure that your keys are safe in case she tries to take the car anyway because it sounds like she feels entitled to your car.", "NTA.\n\nRunning personal errands herself seems fine and part of what she agreed to, but letting anyone else use the car without your knowledge? She's done, no more.\n\nThe fact that she's calling you selfish and stingy, unreasonable, and talking crap about you behind your back is the final straw - she owes you a major apology and needs to set the record straight with everyone she badmouthed you to. \n\nShame she decided to ruin your relationship out of her own self-centered assholeness.", "NTA hold your ground. You generously lent her your car, set rules (and you were right to do that). She took advantage of you and is now throwing the family card at you. Let her think that you’re the a*shole. And to anybody else siding with her, you should publicly comment that it was great that they’re basically agreeing to lend her their vehicle then", "NTA. She’s lucky you let her borrow it that long. She got defensive when you confronted her because she. was. wrong. Especially because she let other people drive it! What happens when THEY have an accident? You’d say they were not given permission to drive it, and then her whole world blows up.", "NTA Your sister completely ignored your rules.", "NTA, if she doesn't respect you rules it's normal that you don't want her to borrow your car", "NTA.  I probably wouldn't have let her borrow it for a few weeks, especially right after she had an accident.  Was she added to the insurance?  If not, and she got in another one, it could be a big problem.  Especially if she is then lending it out to other people.  There's ride share, public transportation, rental cars, or she can go buy another.", "NTA you had reasonable conditions for lending her the car, she agreed to those conditions but ended up just doing whatever she wanted, and got found out. \n\nLending your car to other people is incredibly irresponsible, the liability alone is a reason not to let her ever borrow your car again. \n\nThe terrible sister who doesn't care about her family is her, not you.", "NTA \n\nIf she can't treat her own things nicely I'd highly doubt she'd treat yours any better\n\nTo borrow your car is an ask not an order, she has no authority here so you are perfectly entitled to say no to a request you aren't comfortable with\n\nThe fact she let other borrow it too is at least dumb asf at most dangerous as anything that went wrong would in your name", "NTA. Loaning out your car alone ends the deal. She's incredibly disrespectful to you and your property.", "NTA\n\n\"even let her friends borrow it without asking me.\"\n\nOh no.  Oh hell no with sprinkles on top.\n\nDon't give an addict money, don't get involved in a land war in Asia, and don't give a reckless, irresponsible person the keys to your car, family or not.", "NTA I'm amazed you let her use it at all.  what would happen if she totalled yours???", "Info:  whose fault was the accident?", "> I argued that I was happy to help her, but I couldn't let her take advantage of me and my property.\n\nThis is the reason you NTA.  She didn't respect your boundaries, she doesn't get to use your stuff.", "NTA , who loans out someone else's property to friends, without permission from the original owner ? Your Sister broke the agreement so she is the AH , not you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister (28F) and I (26F) have always been close. We live in the same city and see each other regularly. Recently, my sister got into a car accident and totaled her car. She was lucky to escape with only minor injuries, but her car was completely destroyed.\n\nSince she relies on her car to get to work and run errands, she immediately started asking around to see if anyone could lend her a car until she could afford to buy a new one. I offered to let her borrow my car for a couple of weeks, but with a few conditions.\n\nFirst, I asked her to cover the cost of gas and any maintenance or repairs that might come up while she was using it. Second, I asked her to be responsible and take good care of the car, as it's my primary mode of transportation and I can't afford to be without it for too long.\n\nShe agreed to these conditions and took my car. However, after a few days, I started getting calls from friends and family members who saw my car parked in places where it shouldn't have been. Apparently, my sister was using it to run personal errands and even let her friends borrow it without asking me.\n\nI confronted her about this and she got defensive, saying that it was just for a short time and she needed to get around. I reminded her of our agreement and told her that she couldn't continue to use my car unless she respected my boundaries.\n\nShe got angry and accused me of being selfish and stingy. She said that family should help each other out in times of need and that I was being unreasonable. I argued that I was happy to help her, but I couldn't let her take advantage of me and my property.\n\nWe ended up having a big argument and she stormed out of my apartment. Since then, she's been avoiding me and telling our mutual friends and family members that I'm a terrible sister who doesn't care about her family. Am I the asshole for refusing to let her use my car?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, you set clear expectations, but they were not met. To help and how much is your choice regardless of the % of DNA you share with a person. She is clearly taking advantage of your good nature and you are well within your authority to set a boundary, even one that makes her life just a little bit harder.", "It's easy to see you're NTA.  You set up some simple and reasonable rules.  She chose to break them.  Open and shut case, car lending is over.\r  \n\r  \nShe didn't *need* your car in the first place; it was merely a convenience.  She could have rented.  Many insurance policies cover up to 30 days of rental.  Even if not, car-replacement rental places have special low rates.", "She let her friends drive your car when you had loaned it to her?? Oh, she's lost her car privileges for eternity. That's 100% unacceptable. NTA.", "NTA.  Your sister sounds very selfish and immature.", "NTA.  Did you get your car back?  For me, that's the bigger concern.", "Nta She should rent a car or ask her friends for rides. Your sister broke your trust and can't be trusted with your car.", "ESH\n\nBecause why you lend her your car in the first place?  Car rentals are widely available and she literally was just in an accident.\n\nYes, her lending the car out to her friends is moronic, but what's wrong with personal errands you said in your post she could.  I would not let her use the based on the friends thing alone, bu don't paint this as her violating \"boundaries\" or \"taking advantage of you and your property\", it's not that serious.", "NTA. If one of her friends were driving your car and got jnto an accident, your insurance probably wouldnt cover it. Tbh that also holds true for if She got into an accident driving. I know i wouldnt be okay with that.", "NTA funny how selfish people always result to that line about how family should help each other out as they abuse any help you DID offer. Fuck her and her emotionally manipulative bullshit.", "NTA. You did not refuse. She borrowed your car, did not follow some pretty basic \"rules\" and lost her privilege."]}