{"id": 14152, "submission_id": "12dotk0", "title": "AITA for not loaning my brother money after he did not invite me to his birthday dinner?", "selftext": "My brother Jake is in a pretty dire financial situation. He and his evil wife have five sons, neither of them really work, they squandered an inheritance on bad investments and too much spending. The situation is starting to affect his health.\n\nWe used to be close until he got married to Amber. I can't stand her and she can't stand me. She thinks that she's this charismatic high-profile person and I'm not impressed so I don't kiss her ass. She has no real friends because she's toxic. Plus the sound of her voice annoys me.\n\nMy brother asked me for a large loan because they were falling behind their mortgage and even grocery shopping was becoming an issue. I told him and Amber straight up that I'm not loaning them $50,000 (because I know they won't pay it back). However, I will give smaller loans as time goes on (that way I can reassess their finances and limit losses on my end). \n\nThus far I've loaned them $15,000 to get up to date on their bills and to get my 9yo nephew braces. Tomorrow is my brother's 40th birthday and I assumed he was doing something low-key.\n\nNope.\n\nHe's having a birthday party dinner at a nice restaurant. He invited a lot of people but me. I asked him about it and he said he didn't think I'd want to go. I said that's bullshit because if I didn't want to go then I'd decline. I'd probably stop by just to see my nephews and that's it. Then he said that he didn't want me and his wife to get into a fight over the loans.\n\nI told him that Amber just didn't want me there and called him a sissy for letting his wife okay his invites. But that's okay. Like I said, I'd probably stop by to see my nephews and leave. I find not being invited as an insult so he could go fuck himself with my loaning him anymore money.\n\nA family friend said that brothers shouldn't fight like this and I'm being a dick for coming down hard on someone who is sick. I said fuck him. When he and Amber apologize then I will reconsider.", "created_utc": 1680796999, "permalink": "/r/AmItheAsshole/comments/12dotk0/aita_for_not_loaning_my_brother_money_after_he/", "score": 702, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I loaned my brother money and he didn't invite me to his birthday party. I thought that was rude given what I've done for him so I'm not loaning him anymore money\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. they didn’t invite you because they know they shouldn’t be spending that kind of money and asking you for loans in the same breath.", "NTA- So Amber can stand your money but not you? Stop loaning them money. You care a lot for your Nephews so maybe buy them stuff directly instead of loaning money to your brother.", "Dude, you're being used. Nta.", "That family friend can fund your brother's life if they feel that way.\n\nBeing related by blood to someone doesn't mean you become their personal ATM.", "NTA.\n\nBut your brother...yes. \n\nAnd your SIL.....also yes.", "NTA. You weren't invited because they assumed you'd make a comment about their spending while borrowing from you. \nDon't lend your brother any money. Instead, if you feel like you can and want to, send him on a financial planning course...", "NTA.  \n\n\nDon't bite the hand that feeds.", "NTA\n\nThat family friend is welcome to give them money.", "NTA\n\n\nHonestly, if I needed to borrow money to just live normally but still chose to throw an extravagant party, I wouldn't be able to look the lender in the eyes either. Maybe they are ashamed and shameless at the same time??? Not that its okay...", "NTA. You ain't getting the 15k back either", "ESH. It would be NTA but calling him a sissy and saying you hate the sound of her voice is giving a pretty gross vibe.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother Jake is in a pretty dire financial situation. He and his evil wife have five sons, neither of them really work, they squandered an inheritance on bad investments and too much spending. The situation is starting to affect his health.\n\nWe used to be close until he got married to Amber. I can't stand her and she can't stand me. She thinks that she's this charismatic high-profile person and I'm not impressed so I don't kiss her ass. She has no real friends because she's toxic. Plus the sound of her voice annoys me.\n\nMy brother asked me for a large loan because they were falling behind their mortgage and even grocery shopping was becoming an issue. I told him and Amber straight up that I'm not loaning them $50,000 (because I know they won't pay it back). However, I will give smaller loans as time goes on (that way I can reassess their finances and limit losses on my end). \n\nThus far I've loaned them $15,000 to get up to date on their bills and to get my 9yo nephew braces. Tomorrow is my brother's 40th birthday and I assumed he was doing something low-key.\n\nNope.\n\nHe's having a birthday party dinner at a nice restaurant. He invited a lot of people but me. I asked him about it and he said he didn't think I'd want to go. I said that's bullshit because if I didn't want to go then I'd decline. I'd probably stop by just to see my nephews and that's it. Then he said that he didn't want me and his wife to get into a fight over the loans.\n\nI told him that Amber just didn't want me there and called him a sissy for letting his wife okay his invites. But that's okay. Like I said, I'd probably stop by to see my nephews and leave. I find not being invited as an insult so he could go fuck himself with my loaning him anymore money.\n\nA family friend said that brothers shouldn't fight like this and I'm being a dick for coming down hard on someone who is sick. I said fuck him. When he and Amber apologize then I will reconsider.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Even if his wife was a pure delight and you were invited to the party - you still wouldn't be the asshole for deciding to withhold funds based on how your brother is spending them.", "Your brothers wife sounds a lot like my brothers wife! And that's what we call her. \"X's wife\" because she is not a part of the family. She's the worst, no one in my family likes her, she hates my mom and grandma, and only likes my dad because he has some money and she tries to use him for it. People like that don't change.\n\nIf your brother is anything like mine, his mind has been poisoned with what she says, and it won't get better until/if they split. I guarantee she said she didn't want you there and your brother complied. That should show you the hill he is willing to die on.\n\nAlso, you're way better of a person than I am. I would have laughed in his face if he asked me for money. There's no helping people that think they are God's gift to the Earth.\n\nNTA.", "Nta. Tell you're family friend to lend them the money otherwise they could stfu.", "NTA.  Y-T-A for loaning him money.  You know they won't pay it back.   Obviously they will spend money they do not have and then ask for money from others.  Walk away.  Your brother made his choice.  Now he can live with it and the fall out.  I think you place entirely too much blame on her.  He doesn't really work and squandered money.  He chose to mary her and have five kids.  Let them get evicted.  Report them to CPS if they can't care for the kids.", "NTA He is treating you as an ATM, without wanting any relationship with you and you are right, that is not on. They cannot take your money then spit in your hand.", "NTA. So he has money for a birthday party for himself but not for braces for his own kid? Sheesh.", "Not understanding why you even loaned them money in the first place when they clearly have no respect for you or even remotely like you.. lol but you do you.", "NTA - now you know that you are only an ATM to your brother and his wife.  They shouldn't be throwing parties when they can't afford food or their mortgage.  I would demand my money back immediately and tell them figure out for themselves how to pay their bills you are done with both of them.", "NTA you were not invited because he doesn’t want you seeing the amount of money he is gonna blow.", "NTA. You will be a fool to give them more money.", "NTA - never loan family in distress money unless you're willing to never see it again.    Most of the time they never repay and you get stiffed", "NTA - He's got money for a nice dinner out for multiple people, but doesn't have money for necessities? Yah, um... the real issue is their priorities and them using you like an ATM.\n\nNot inviting you was the slap on the face for all you've done. So stop doing. For any of them. From now on he can mooch from the people he felt worthy of sharing dinner with *on your dime*.", "Ummm? You've already lent him a substantial amount of money.  The bills are paid up.The kid's braces are paid for. They got what they wanted with a nice dinner that you paid for.\n\nNTA but I don't know what your point is? You got played.", "They’re using you. I know you know that. NTA", "Exactly what I was thinking. They know that he’ll get very upset that they are using money they borrowed on parties.", ">he said that he didn't want me and his wife to get into a fight over the loans.\n\n\"Great, no more loans then, problem solved!\"\n\nHelping them pay their mortgage so your nephews don't loose their home is one thing if they're otherwise being frugal. If they can afford a birthday dinner at a fancy restaurant then their options are to invite their benefactor or find a new one.", "Sounds like OP is throwing a party that he didn't know about!!", "Yeaaah. Like wrt the money I think he's quite right but attitude wise they all sound awful.", "Loaning the money doesn't make OP an AH, it just makes him delusional if he thinks he's going to ever see a dime of it back.", "NTA.\nMaybe Amber should suck some dick to pay some bills.", "ESH - this isn't about his birthday, this is about you feeling used. You are correct, your brother and his wife are taking advantage of you, they suck. You are a grown person, if you don't want them taking advantage of you, then stop letting them. The money you gave is gone unless you have a written loan agreement. Stop giving them money, go low contact and work on your own life.", "NTA…stop listing them money.  They are adults.  They can get jobs.  If you have the money to spend, I would buy for the kids only.  If they need new clothes or shoes.  If they like certain foods, do the shopping g and drop the food off.  But if your brother and his wife can afford a fancy dinner out, then they can afford their bills. What if something happens to you?  Who will pay their bills then?  Stop enabling them.", "BS- shut the ATM off now!!! They want to spend your money.. that is why they didn’t want you there! Stop all loans and ask them to start paying back what they’ve already borrowed.", "NTA. If he can afford a fancy birthday party, then he can afford to pay the mortgage. He's just choosing not to. Big difference. Don't subsidize their fancy lifestyle anymore. If anything, offer to pay for a financial literacy course for them.", "Well, if you're not at the dinner then you and Amber won't get into a fight at dinner... so there's logic in that at least.\n\nI'd stop loaning them money. Not contingent on being invited to dinner or not. You say you won't loan them $50,000 but if you continue to loan them money to get up to date on their bills.... well, by the end of the year it will be $50,000. Keep your cash.\n\nThe family friend said that you shouldn't come down hard on someone who is sick but you said that it is his financial situation that is leading to his illness. Tell him that he can tell your brother that you shouldn't have a fancy dinner when your finances are in the red and they'll only get redder since you won't be financing his lifestyle anymore. \n\nNTA", "NTA about time you cut him off. Send him some links to Dave Ramsey videos.", "NTA stop giving them money", "NTA but you need to sue them to get the money back. Never loan them every again", "nta if he can afford a nice party than he shouldn’t need loans. Honestly you need to quit subsidizing his lifestyle", "Dude. You are paying for their lavish birthday party. They are taking the absolute piss out of you.", "NTA", "Info: what's it's like being an ATM? I invite my brothers to everything. I don't invite my ATM anything.", "NTA. Your brother isn’t a human being…he is…let me think about it a bit…I got it…a leech.", "NTA and stop enabling them. They're using you and not even grateful about it.", "Stop giving your brother money, because that is what you are doing.  You will never get it back. Him and his wife need to get jobs. If they need food then you can buy them food if you want. But stop giving money of they will never learn. NTA", "> A family friend said that brothers shouldn't fight like this \n\nIs he only child?  He doesn't know what he talks about. lol\n\nNTA", "NTA", "StOp bEiNg SuCH a ScROoGe bEcAuSe iT iS HiS biRtHdAy MoNtH!!1!11!!11!", "it makes him a doormat. he needed to grow a spine a long time ago. he should sue to collect the $15k they owe him.", "Stop giving your brother money.  Just stop.  (Those aren't loans; you know you're never getting the money back.)  It doesn't matter if Amber apologizes or your brother makes you guest of honor at his birthday, just stop.\n\nAmber and Jake are grown-ups who blow through money and don't work.  You are their enabler.  Let them get jobs. If they can't afford the house, let them sell it and live some place they can afford.  On their income.  From the jobs they have to get.\n\nYTA for continuing to throw logs into this dumpster fire situation.  Back away.  Stop it.", "ESH.\n\nYes, your brother shouldn't be throwing a huge birthday party at the same time he's asking you for money, but you just sound like an insufferable jackass throughout this whole post.\n\nAlso, INFO, how sick is your brother? Is it possible this could be his last birthday?", "NTA but why is he spending money on a restaurant but borrowing to pay bills?", "NTA.  You're probably paying for the party.  Or rather, he's paying for it but using the money you've loaned him.  I'd be eating beanie weenies until I paid you back.  For my birthday, I'd splurge on pizza and a grocery store cake.  That's it.  If I'm too broke to pay my own bills, I'm too broke to have a birthday party.  If some of his friends were throwing the party, that would be different.  His wife needs to understand that you and your money are a package deal.", "NTA, even without the second part.", "NTA\n\nWho's sick in this story?", "Yes NTA and would inform them of being cut off immediately", "NTA", "NTA but you are not helping your brother by financing his bad decisions. Stop giving them money.", "If OP wants to be TA, he could forgive the loan and then report it to the IRS. The IRS considers forgiven loans as income.", "This.  You do not need an invite because you are paying for it.  I'm petty.  I would show up and make a toast about how happy you are to see him enjoying his birthday on your dime.", "Loaning them money enables them. NTA", "ESH.  \n\nAmber obviously sucks. The brother sucks for not keeping a leash on his wife and for acting like he’s entitled to the loan. \n\nBut the OP sucks for using money to manipulate his brother. Either make the loan because your brother deserves it, or don’t, but don’t insist on your ass being kissed meanwhile.", "NTA", "Nta. For his birthday, forgive the loans and tell him the bro bank is closed.", "NTA\n\nYou are not an ATM and imo they shouldn’t be throwing parties that are costly being funded by you essentially because you paid to help them so whatever they have “extra” to throw this party (or anything else frivolous they do) should have been money given back to you to repay you first", "NTA. Best case, he's embarrassed to let you see him wasting the money you gave him to pay his bills. Worse case, he sees you as an ATM and doesn't actually want you in his life. Likely because of your bad relationship with his wife. \n\nBonus theory: Perhaps there are people there who don't know how poor he is who he wants to think he is rich.", "NTA. That’s the right decision. Don’t give them anymore money.", "Stop lending him money. He is an adult. He and his toxic wife need to work. He will never get his spending under control while he can leech off you. And he is taking the proverbial with his birthday. Who is in effect paying for this event? Ask yourself that. NTA", "NTA, as much as you want to help your nephews  its clear that they're misusing the money you're loaning them. They shouldn't be hosting any lavish parties or dinners. I wouldn't loan them anymore money period. They need to live withing their means", "NTA. Did they pay for the party?", "The only way I could see you being TA is if your brother is dying/really sick and you're the type of person to hold the loan constantly over his head. Like I can see them not inviting you If they knew you'd be passive aggressive about them essentially spending your money on the party during it. Like he wants one  peacefully night free from guilt, shame, and dealing with his declining health.   \n\nJust speculating and spinning tales mostly lol. But would still def love the other take on this.", "NTA What are they doing with the money you are giving them? What is their plan? Do they have any plans to get some kind of money coming in besides what you are \"loaning' them?  It might be time to reassess the situation.", "Damn. For $15000 you could come to all my parties. I would be so grateful if I had a sibling do this for me. Crazy", "Family friend can STFU.\n\nNTA OP, stop providing for your leech of a brother.", "NTA. Why are they spending money at any kind of restaurant (5 kids, 2 adults isn't even cheap at McDonald's)? I absolutely would NOT give any more money. And write off the 15k as a gift. Your brother and SIL need to get their priorities straight and it isn't on you to do it for them. Sucks for the kids yes...but could you take in 2-3 of the kids if it came down to it? What are other family members contributing to their finances if they are so concerned and berating you?", "Or start college funds for them (but only give them if they aren't poisoned by Amber). Depending on age, let them know if they need a safe haven, your door is open. It sucks when kids suffer because of poor decisions by adults but since brother and wife haven't shown any ability to stop making bad decisions, don't fund that.", "I would say that he’s an enabler. The “loans” are allowing them to continue to live above their means. Better to allow them to reach the point of bankruptcy and then use the 15k to pay school fees for the kids or put it in a college savings account in their names.", "NTA. By the way, you probably won't see that 15k ever again.", "NTA\nDon’t give them anymore money", "NTA.  And I would call in those loans.", "NTA\n\nand stop giving them money.  You're not going to see a dime of the money you've already \"leant\" them", "NTA\n\n\"the situation is starting to affect his health\"?\n\nHe needs to change the situation - and not by leeching off his brother or having birthday dinners at fancy restaurants.", "NTA. Stop enabling your brothers bad behavior. You aren’t helping your brother by giving him money. You are simply allowing him to continue to make bad decisions. Let him fail. That might actually help him learn to fend for himself.", "NTA", "NTA at all!", "NTA fuck Amber and fuck him", "NTA but you have to stop loaning them any more money. They will be losing the house so let nature take its course. It would be a different story if they were really responsible but they’re not & aren’t even thinking about consequences. \n\nYou have to treat them like addicts because they are.", "NTA. You are enabling your brother and his wife, just like buying drugs for an addict or greasy food for someone who is severely overweight. Your brother and his wife won't change their ways until they are forced to deal with the reality of their bad financial decisions. So I wouldn't \"lend\" them any more money (which I assume you will never get back). \n\nIf you want to help some or all of your nephews, you could consider helping with college costs or helping them network to find jobs.", "NTA. Sounds like they need a financial counselor, and your brother some other kind of work to see what his wife is. Or maybe he's just the same.", "Honestly: If you needed to borrow money to just live normally, _would_ you still choose to throw an extravagant party?\n\nI think that's what makes them shameless (and the AHs).", "NTA and this!∆", "> The IRS considers forgiven loans as income.\n\nBecause they are.", "nta. You owe no one anything.", "NTA", "Nta", "INFO\n\n> Thus far I've loaned them $15,000 to get up to date on their bills and to get my 9yo nephew braces. \n\n#But *why*?\n\nIf you can't pay your bills, you can declare bankruptcy. It's not the end of the world. \n\nTeeth aren't going away. The family could get braces when they could afford it. Or when the kid's an adult.", "info - your brother is sick? is it a common cold, is it blood pressure, etc? what are the details?\n\nyou said neither of them \"really\" work, does this mean they do not do jobs, or they do not do jobs that seem legitimate to you?", "how is he being used? OP clearly has a head on his shoulders. If the relationship ends here it was the typical Reddit quote of \"you paid 15k to never see someone again\". Of course 15k is a lot of money but considering part of it was for nephew's braces (incredible investment and on the the nephew that OP clearly likes despite everything related to his brother) and that he was asked for a 50k loan and therefore must be stacked, it was a small investment on his part to get rid of someone extremely toxic.", "Literally", "Fancy birthday parties and orthodontics are wants, not needs. \n\nWhat that family really needs is a massive stockpile of condoms and a coupon for a free vasectomy.", "Not really agree on the orthodontics. I mean yes, kid could grow up with crooked teeth, many people did and they didn't have any problem, except for those who did.", "Or how happy I was that I no longer needed to loan them money because clearly if they can afford a big expensive party, they don’t need my money.", "I've had braces. Twice.  It is absolutely a luxury.", "Glad for you that your issues where not severe. You don't know anything about that kid's mouth, though.", "That depends. Orthodontics can be a necessesity, for example if you have trouble chewing.", "Ah, but neither do you.  It could be pure cosmetic adjustment.\n\nMy bite pattern was fine and no damage was being done with my original teeth placement, but it sure did look like I'd been kissing a blender with how randomly the teeth were placed.  There were severe complications with trying to put my teeth into a usual formation.  It just wouldn't take. Braces came off, retainer was used, and teeth just wanted to drift back into their original spots.  I had oral surgery after five years of braces, then a further six years of ortho ten years later.  And that's just cosmetic shit.  PAINFUL. But hey, lulz, I'M AN ENGINEER.  Cash no problem.  Just keep going back for the appointments. I hope to start my third round later this year.  I'm not borrowing money to do this.", "Info : you understand that when you give 15k$ to someone that doesn't respect you, will encourage them to disrespect you even more ?", "NTA Dude they are literally throwing a party on your dime and not inviting you!", "NTA. They didn't want you to see how they spend their money on unimportant things.\n\nBut remember, the money they're asking for are not loans. It's not a loan if they can't pay it back, it's a gift. I wouldn't be giving him any more money  fullstop. It seems he's in this situation as his priorities are messed up.", "NTA. Do not loan him money as it will make me personally angry reading about it.", "NTA \n\nYour brother is in the grips of a narcissistic (starts with a c and rhymes with punt) and needs to grow a spine amongst other things. I agree with some of the comments they’re fine with “borrowing” (siphoning) money but don’t want you around? That’s some bullshit (and your brother is no better for allowing it than her for suggesting it. Maybe they’re both garbage hard to tell.)", ">But the OP sucks for using money to manipulate his brother. \n\n\nReally? \nYou don't suck for begging $15,000 off me but on your happy day, you cannot even give me an invite to your birthday? All those people with invites are those who cannot give you the loan but can celebrate with you? Op is only good for their money? \n\nWho exactly is being fooled here? Whose ass exactly is being kissed here?", "He was being used since OP's brother was in contact with him only when it was convenient. When it wasn't convenient he was cut like with the birthday party. That is exact example of using someone as ATM.", "Personally, absolutely not. I loathe having to borrow money in the first place. It stresses me out, and I try to pay it back ASAP.\n\nBut I know that there are those who will do something like the people in the post. They are either short-sighted or just don't care", "Exactly!", "[removed]", "Family friends need to mind their own goddamn business.", "NTA", "NTA. If he's in a pretty dire financial situation, he shouldn't be throwing parties. Any kind.  And you shouldn't lend him money to throw parties.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "No, Scrooge Mc Duck has a family, massive business and a literal vault with countless coins that he swims in, OP here doesn't have vast resources at his fingertips (I assume)\n\nTo the best of our knowledge I assume OP doesn't have any kids so it's kindof sad that his brother (who has 5 kids) gets him to give loans of money (so far 15k) for general house repayments groceries and the kids medical stuff.. also it sucks balls that OP's brothers wife is a toxic woman, like literally she should be tested to get antigens as she's lethal from the sounds of it 😰😱\n\nThe fact that OPs brother didn't even invite OP, not even formally but at least casually like \"hey bro, it's my birthday and we're doing somefin extravagaaaant, wanna come too? 😀😁\" but he didnt ☹️\n\nhe should have at least  invited  OP because of all OP's aid in paying for the brother's expensive life (5 kids, nagging toxic wife needs expensive special helpless/defenceless bugs to eat so her toxins can easily penetrate and digest them and keep up her \" high maintenance \")", "2 of my kids had teeth issues that were actual medical problems and insurance paid for the braces bc of this. \n\nSo, yes. Orthodontics can absolutely be a medical need."]}