{"id": 14292, "submission_id": "12fovci", "title": "AITA for not helping my son buy a home?", "selftext": "I have a tradition that once my children turn 22 I help them buy a home by paying for a part of it. I have 4 children. I helped the first 2 buy homes however I disowned my 3rd child when he was 20 so he didn't get anything. \n\nHowever about a year ago we started to fix our relationship and I think we are ok now. My 3rd child is having some financial problems amd they might need to downgrade to a smaller home and he has been very worried about this lately. He asked my help but I told him I don't have extra money to help.\n\nWell my youngest turned 22 this year and of course I helped him buy a home. Now my 3rd is mad at me and thinks I should have given the money to him instead since he didn't get any help at 22.\n\nI think he lost his chance when he was 22 and it won't be fair for my ypungest to not get the same help.\n\nMy 3rd and wife both think I'm the asshole but the rest of my kids are on my side", "created_utc": 1680966576, "permalink": "/r/AmItheAsshole/comments/12fovci/aita_for_not_helping_my_son_buy_a_home/", "score": 149, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole because I helped all of my kids buy homes except for one which made him really upset\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info - come on… there’s CLEARLY not enough info here. Why did you disown them?!", "Without knowing how old the 3rd is or why he got disowned. Nobody can answer this. \n\nINFO\n\nEdit:\n\nFound a comment, OP disowned 3rd for being a deadbeat dad. OP is helping to support the grandchild that was abandoned. OP is NTA", "Eh, I read your comment that he decided to be a deadbeat dad and you cut him out for that. That's fair. I feel like his toxic relationship with money and responsibility has not been changed for the better with the petulant way he's behaving.\n\nNormally I'm a strong advocate for treating every child the same. But considering he was skirting the responsibility of paying for/taking care of his kid, he probably got the value of the house by avoiding his responsibilities. Lol. This is a gift. He isn't owed anything. It's your money and he's an adult.\n\nThe way your finances were set up was, I assume, to accommodate everyone turning 22. If you can't afford both, then it's tough beans for him. Should've taken care of his kid.\n\nThere's an irony to a father refusing to take care of his own kid's basic needs for love/home goods while demanding a bonus check from their own father. NTA.", "Ok. After reading your other responses, i change my vote to NTA. You got a tough choice i think", "After reading the comments, NTA. I have a shitty father that my grandparents back blindly, regardless of how he treats me. Thank you for holding you child responsible. The youngest shouldn't have to wait or miss out because of their sibling's actions.", "INFO: Why was #3 disowned?", "From your original post, I was going to say you are (slightly) the AH but having seen in your comments that you disowned him because he abandoned his own baby, there's a lot of irony in hiscoming to you for money now!!!!\n\nInfo: did you end up contributing financially or otherwise to supporting that abandoned baby?\n\nEdit: I've just seen that yes you contribute to that daughter he had. \n\nIn which case, you are NTA, and any money he may have once expected had been spent on his daughter instead. He can suck eggs.", "NTA. Personally I’d tell him you’re using the money you would have given him to buy a house for your granddaughter. Then start a trust or college fund for her, if you haven’t already. If he’s changed, he’ll be happy for his daughter. Although I hesitate to call her that since he clearly isn’t much of a father.", "Depending on your information NTA \n\nYou're paying money for his child which he didn't take care of. So that's were his money went. I feel like that's fair.", "After reading your comments NTA. The money to help pay for his house went towards raising the daughter he abandoned. If it hasn’t maybe you can help his daughter buy a house with it at 22.", "Depends on why you disowned your third child.", "NTA, he left his child, but then demands pampering from his own parents, this audacity. Maybe you should make an edit to the original post", "NTA. He made the choices that got him disowned and now there are consequences for that.", "We need more info on why you disowned your third child", "NTA\n\nHe's a deadbeat. Use the money you save by buying his \"daughter\" a home when she is 22 :)", "Yeah we need more information, why was 3 disowned?", "Not sure yet - How is your 3rd child's relationship with their child now?  What has changed that made you willing to mend some fences?", "Was ready to vote that you were the A because I got a little triggered from my own issues with my parents (minimal contact), but once I see the additional info...sigh.\n\nNTA.", "Having seen the comments you left I have to say NTA and please add that info to your post so people get more of a picture of situation before they judge", "NTA. It’s your money. He’s not entitled to it.", "> I helped the first 2 buy homes however I disowned my 3rd child when he was 20 so he didn't get anything.\n\nOP, you really yadda yadda yadda-ed over the whole disowning your third born?! C'mon, what happened?\n\nINFO", "Info:  why was 3rd “disowned”?  Depends on the circumstances.", "NTA. You need to edit the post to include why you disowned him. You spend his house money taking care of his kid. Your youngest shouldn't be punished for your 3rd's mistakes.", "NTA, but you have to edit post and put the clarification about why you disowned him. Your post scream yta, but when I went to look for reason in comments - I never changed my mind this fast. \n\nYour son doesn't deserve his father help since he isn't the father to help his own child.", "NTA, but for the love of God, edit the original post as to WHY this has happened.\n\nYou are supporting a child your son abandoned, and he has the gall to think it's unfair that you aren't giving *him* money?  Yeah you're good.", "NTA because you have been supporting his kid for 15 years.", "I feel like we need more context. Disowning your child is a big deal - what did they do to deserve that?", "based on your post I would have came to a different judgement however after reading the comments and your justification for cutting him of you're obviously NTA", "NTA. All the money he would have received skipped a generation and went to helping your grand-daughter.  You are a good grandparent OP, I'm sure your grand daughter really appreciates you", "NTA - Good job OP on holding your kids responsible. 3rd made the conscience decision to abandon his child even after you told them the consequences. Unfortunately it seems like 3rd sees you as a cash cow and maybe that’s the only reason he attempting to be a parent now. I understand where your wife is coming from but you can’t be an enabler for someone who is still doing wrong. INFO- What solution or alternative does your wife have for 3rd? Like say you 4th hadn’t yet turn 22, what would she have wanted to happen? Give 3rd money and potentially not be able to buy 4th their home?", "You should definitely put in the post WHY you disowned him. Because the way you didn’t mention it made me worry there was a silly reason for disowning him but you had a very VALID reason for doing so. Way to be a good grandparent and way to not enable your kid when he decided to be a deadbeat!! NTA", "About a year ago, your 3rd child started to mend your relationship…..around the same time he was having, or starting to have, financial issues.  Do you see where I’m going with this?\n\nNTA\n\nBTW, I chuckled when you said that the three kids you helped buy homes were on your side.", "Info where do you live that a 22 year old can afford a home?", "Nta", "I agree more INFO is needed. However, by how you write  about and lord money over your kids, you’re almost assuredly the asshole. The most likely question for me is whether anyone else is as well.", "Info:   So did he actually abandon his child, and has he now taken responsibility?  \n\nAnd when you say \"abandon\" do you mean refused to take responsibility or just refused to marry the mother?", "[deleted]", "Yta. \n\nYou give 3 kids help but not the other.", "Edit to NTA since apparently there’s an abandoned grandchild being raised here which changes the dynamic but that REALLY needs to be included in the post. \n\nBoth for disowning your own child and now refusing to treat your children equally. You’re playing favorites and going to destroy your relationship again.", "NTA", "yta (initially) but nta now bc your son is totally a brat, you're a good person.", "NTA\n\nNot for not helping financially, but for lying... and not only that, but a lie that's way too easy to prove you lied. If you were serious about fixing the relationship, you would have told them that maybe in the future you'll be in a position to forgive whatever they did enough to help financially, but at the moment you have someone coming into age where you need what money you have to help them the way you helped the two older. \n\nHonestly, how can you not see that? Your other kids are probably only on your side given that they agree you shouldn't pay, which I also agree, but what you did and how you did it damaged the relationship you say you're trying to fix.\n\nEdited to change judgement. Realize I was judging off the wrong thing.", "INFO: why 22? That's so young to make a decision about where to settle down. I think I moved three times at that age.", "you’re definitely the asshole oh my god.\nas the hated child in my family, it hurts a lot when all my siblings get prioritised and i don’t receive the same treatment as them. you owe your son some help. that’s cruel.", "Of course the rest of your kids are on your side. You helped them.\n\nHave you done anything to help your 3rd child? Why did you disown him?? \n\nBased on the info provided so far...YTA", "[deleted]", "Why can't you just delay buying a house for the youngest??", "[deleted]", "YTA, whatever money you had should have been split between the last two children. In what world do you think it is fair to help only 3 of your kids and tell the other they lost their chance. What did your child do to be disowned, not wear the right shirt. It doesn't matter at this point, the child is back in your life and you obviously had money to spare and lied to him. It's clear you don't love this child the same or you would never treat him so unfairly. Get ready to never be in his life again and own the fact that it's entirely your fault for being so unfair and cruel.", "Yes you are the AH do better", "YTA- there’s a socking great info gap about why you disowned your third child. If you’re in here, tell the whole truth and don’t conveniently leave bits out.", "Why wasn’t the money set aside?  You had started the tradition years ago. I’m don’t know the backstory of why the break but if I was the 3rd child I was go NC again", "YTA. Help your son.", "YTA. Once you have a child, you are a parent. ITS A LIFETIME COMMITMENT.", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a tradition that once my children turn 22 I help them buy a home by paying for a part of it. I have 4 children. I helped the first 2 buy homes however I disowned my 3rd child when he was 20 so he didn't get anything. \n\nHowever about a year ago we started to fix our relationship and I think we are ok now. My 3rd child is having some financial problems amd they might need to downgrade to a smaller home and he has been very worried about this lately. He asked my help but I told him I don't have extra money to help.\n\nWell my youngest turned 22 this year and of course I helped him buy a home. Now my 3rd is mad at me and thinks I should have given the money to him instead since he didn't get any help at 22.\n\nI think he lost his chance when he was 22 and it won't be fair for my ypungest to not get the same help.\n\nMy 3rd and wife both think I'm the asshole but the rest of my kids are on my side\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta you took on expenses for you grand daughter when yr son decided to be a dead beat dad so I'm sure that amounted to much more. Now he wants you to pay for his house? Why doesn't he take care of his kid first.", "NTA Your 3rd child is a deadbeat and won't support his own child but he expects financial help from you. I think the money that would have gone to child #3 should go to the child #3 is ignoring.", "NTA. I'd split the difference and put \"his\" house money into an investment account so the child he abandoned can buy a house with it someday", "NTA Help the 22 year old. Being a deadbeat dad has consequences. The 3rd son doesn't deserve your help.", "NTA. I'd tell your son that the money that would have gone towards a house, instead went to the care and upbringing of the daughter he couldn't be arsed to take responsibility for.", "NTA. Tell him his portion of the money for a house went to child support once he abandoned his daughter.", "NTA after reading your comments. \n\nYour 3rd son is still an awful father it seems.", "How in the world can your wife think you’re the AH considering all circumstances?? Serious question. What is her reasoning?", "NTA. It sounds like you were reasonable in your decisions, and are actively supporting your granddaughter who your son abandoned. It's great that he wants to continue rebuilding the relationship, but it doesn't sound like he's holding himself accountable for his actions. He wouldn't continue being unreasonable about your decision if he fully comprehended the ramifications of his decisions. Your expectations have been and still are rational. \n\nI wonder, is there a future in which helping with a house be possible? If so, what are the stipulations?", "NTA. He made the decision to have you give his money to his child.", "After scrolling and finding your comments I vote NTA but you need to put some edits as I was going to vote Y T A based on the original post alone.", "I was gonna vote you’re the asshole until I saw the WHY you disowned him. \nAbsolutely NTA. \nGood for you. And good for your granddaughter. You actually sound like an amazing man.", "Both YTA and NTA.  If you were truly \"good\" with your son, I could see helping, but not at the expense of the 3rd child. If this is something you planned for earlier, then you have the money, you're just being an AH about it🤣🤣🤣", "He had a child and decided to be a deadbeat. I told him if he abandons his child I won't talk to him again", "NTA for not buying your son a house but there's such a double standard with men", "This is my thought as well. Son 3 spent his \"house payment\" on the childcare his parents provided when he decided to be a deadbeat dad for 15 years!", "It's either him or the youngest and the youngest didn't do anything wrong to miss this", "OP said they (#3) decided to be a deadbeat and essentially abandon their daughter (who is now 15). OP is helping pay for the grandchilds costs.", "Because third child decided to abandon his pregnant gf and subsequent child. And OP said if you're going to be a deadbeat dad, then I'm done with you, and supported the grandchild instead.", "OP said in another comment that he 3rd son is a deadbeat dad, and OP has been helping to support their abandoned grandchild.", "He had a child and decided to be a deadbeat. I told him if he abandons his child I won't talk to him again", "3rd knocked up gf and ran away 😂", "3rd is a deadbeat dad and OP is paying the grandkid's costs.", "Third kid abandoned their own kid. OP told him if he did then they wouldn't talk again. OP has paid to support their granddaughter for the last 15 years", "He had a child and decided to be a deadbeat. I told him if he abandons his child I won't talk to him again", "I'm not 22", "By home, he means a small apartment/flat/condo (based on another comment)", "His third child decided to be a deadbeat father, so OP disowned him and financially supported the mother and his granddaughter.", "Yeah… there’s usually a whole lot more to those stories. I’m not buying OP’s over-simplified explanation glossing over that. \n\nI’ve seen a couple people raised by a spiteful mother who was “abandoned” and how she poisoned her children against their father and it’s not pretty.", "And the child this son abandoned is getting the money that he would of got for a house", "OPs paying for the child he abandoned he’s had his help", "OP specified that the reason he disowned the son is because the son decided he didn't want to talk care of his own daughter. This is karmic justice, as far as I'm concerned. Don't know if you saw that, though. I sure as shit wouldn't give my kid any money if he felt he didn't even have to provide for basic needs for his own kid.", "Because it’s none of his business.  In no way whatsoever did the OP lie.", "I don't want them back home after college. They need to become independent", "He's paying for his granddaughter which his son refused to take care of tho.", "Then do things to not be the hated child.\n\nOP disowned an adult child because that adult child abandoned their own infant child. OP has been helping to support the abandoned child for over a decade\n\nAlso adults have individualized relationships with their parents. Sometimes people just like other people more. Demanding equal treatment as an adult just comes off as bratty", "He has helped his son by paying for everything for the daughter the son abandoned.  Why do you think the son deserves more?", "Op is supporting the 15 year old child of third son. The reason they were disowned is that they abandoned their child", "She’s using that money to pay for the child he abandoned", "Lol whaaat", "It's a house. It's not like I can buy one now and another one next month.", "3rd is a deadbeat dad and OP has had to substitute in as a parent to the abandoned grandchild. \n\nOP wouldn’t be missing much", "3rd decided they didn't want to be a parent and dropped baby in OP' s lap and took off. OP raised the kid. Seems like fair reasoning", "Tell that to the son who abandon his own kid which OP is taking care of.", "Why would I set it aside for him when I can use it for myself?", "Because he is using the money to help to raise the child son number 3 abandoned?", "This is messed up thinking. Adults are not obligated to be committed to other adults if the relationship is not mutually respectful.", "Including if adult child is unrepentantly awful? Lol\n\nNope", "Thank you. Say that to him not me", "NTA then - he should work on rebuilding his relationships and being a father than getting your money.", "And what's the situation now?", "NTA!! How tf can he ask you for money after refusing to do the bare minimum for his own child? He's an adult. His choices have consequences, and this is one of them.", "Glad I saw this comment prior to writing mine . This is 100% a good enough reason to not help him Imo . If more parents took the same attitude you did there may be less deadbeats around cos far too many are enabled and excused", "OP add this to the post it’s relevant and a big factor when rendering judgment", "NTA!! Congrats for being ethical.", "Why would you make a commitment to help all of your children buy a house, if you couldn’t afford to do that? What if you had never disowned him? Would you still be deciding that you couldn’t do it for all of them? If you made a commitment you should own up to that", "That is so succinctly perfect.", "Thank you for holding him responsible to do the right thing for his baby. What an ironically hypocritical stance that he expects YOU to provide him with money because you are his parent, yet the reason you had a falling out is over him abandoning his own child.", "Please put this in your post oh my goodness.", "This needs to be a update", "Do you not see the irony in that?", "[deleted]", "You have four kids, you helped three kids buy a home by paying for part of it.  They would still be responsible for mortgage, taxes, insurance, etc.  Unless you paid cash for three homes for your kids.", "Not the case since she has a relationship with OP and  he is helping to raise the child his son abandoned", "I saw that after I posted but I honestly think the reason for the fallout is irrelevant. He's trying to fix the divide and went about it wrong. I do agree he shouldn't give him any money though", "\"I don't have any money\" *spend who knows how much on a house for sibling*\n\nNo matter how you cut it that's a lie. If you're trying to fix a relationship you be up front with \"I'm not ready to financially help you right now. \"", "a) having someone buy you a house isn't independence\n\nb) yeah, but they could get an apartment. Buying a house just seems so permanent at 22.", "Ah, well that greatly changes matters.", "OP, you're lucky you didn't have any twins!", "Shouldn’t have made it a tradition/commitment then. You should treat them the same", "Didn't km now that when I posted. So that son is an  ass.", "Ahh, yes this information needed to be added to the post.", "Oh, you're absolutely an AH. The only reason your other kids don't think so is because you paid them.", "Preach it. \nOP actually did his part by reconcilinng, but since he is footing the bill for the child, his son abandoned, I think his son is the one that owes OP.", "Why did you disown him? Sorry if you've already answered this.", "Saying it to you, because you're a hypocrite.", "My granddaughter(his child) has decided that she doesn't care about him anymore and can tolerate him for a few hours once in a while which is why we are talking to him again", "FR", "NTA for not buying your son a house but there's such a double standard with men not wanting to be a father.Would you have rather he been forced to be a father and him being resentful and being even worse to your granddaughter.", "Sounds like the OP has been supporting the son’s child that he abandoned, which caused the fall out. So I imagine that is where the OP’s money went.", "He could but he is raising his granddaughter for son number 3, which costs way more", "OP probably could afford to help #3 until she had to bankroll the kid he abandoned instead", "Are you comparing a one week old baby to a 20 years old adult?", "There is no irony. \n\nOne is an infant, one is an adult. One is capable of providing for themselves, one is not. One is capable of making moral choices, one is not. Etc", "Exactly. The hypocrisy of the son demanding money from his parent despite the fact that the son abandoned his own child is so gross!", "You mean the irony of an adult demanding support from a parent when they shirked the responsibility of being a parent themselves to the parent they're asking the support from?  Yes, much irony.", "She apparently doesn't.", "I don't care to know.", "Well depending on the area a home might not be all that expensive and depending on the down payment it might be cheaper then rent.", "My mortgage, taxes and insurance are half of what equivalent rent would be. The down payment is often the biggest hurdle towards home ownership.", "Where I live (not US) you can get a mortgage for up to 80% the value of the house the 20% is a down payment.\n\nI pay rent, any mortgage would be at most the same amount,if my parents gave me the down payment I would be able to buy a house right now, since that is not possible, I'm stuck renting because I don't have any extra money at the end of the month to save for the down payment....", "Honestly, we don’t know what that relationship is like either. We know that OP says they pay for everything. So of course they’re going to have access to granddaughter.", "Yeah I was talking about a small apartment. English isn't my first language I assumed apartment is also a house?", "But they are not the same", "3rd abandoned an infant. OP has helped the mother support the abandoned infant.", "No OP isn’t.", "No he is not. He is using the money to provide for the child his son did not parent....who is now 15.", "Are you raising the grandchild?  Who pays for her support?  How old is she now and how old is the son?", "Oof. That definitely needs to be included in the post instead of just saying basically “oh I disowned my son and bought all my other kids houses”", "[deleted]", "So you don’t care to know the whole scope of the situation with your son and baby mama.. how do you know your son “abandoned” this child? \n\nI’ve seen people raised who were kept from their father and told they were abandoned and poisoned against their father by a spiteful mother, and it isn’t pretty and it happens way more than you probably think.", "Ok I get it.  I live in California and it is insane here.", "Typically a house is a separate dwelling unattached to others with some kind of yard. Not a small 1 or 2 bedroom apartment.", "When people see house they assume a multi bedroom property probably at least two stories.\n\nA flat is a term also used for an apartment:-)", "I think the assumption may come from apartments and houses both qualifying as a “home”. Houses are a whole building and property (aka land) that are usually owned. Unless it’s a duplex (two houses built together but separated by a wall) houses are usually meant to house one family (unless it’s really big). Your neighbors would be in a separate building that’s not on the same legal land as yours. Apartments are sectioned clusters in a building that are usually rented (at least in the states).", "They are all your children, and if you made a commitment you should stick to that. It’s nobody’s fault that you made a crazy ass tradition out of buying all of your children homes and then having four children. That’s 100% on you, but you should own up to your word.", "YTA, you're not a likable person.", "I don't really care what you think about what I think.", "She is 15 now. She lives with her mom but she is at my home all the time and I pay everything", "Who cares WHY he decided to abandon his kid? The ONLY legitimate reason would be if it wasn't actually his kid, so if it wasn't that, then there is no other reason that would or should be acceptable.", "He abandoned his kid period. There is nothing more to be said. He is a deadbeat father and OP is raising his child, I think that cost more than helping him with a house.", "And why would this \"spiteful mother\" send her child to our home at least once a week? Where the child's dad will have free access?", "OP is paying for everything for the child this son abandoned", "You need to read OP's comments. Kid he disowned ran away from his own kid.", "Well neither is son number 3 since he abandoned his child for OP to raise.", "You don’t have to. But you did post your thoughts to a public forum. Lol", "Send your bratty son a bill for all your free childcare and tell him he can pay that off first, then you can talk.", "Here's a cool idea: when she turns 22, help HER buy a house (if you can) instead of helping her deadbeat father :)", "Sooooo NTA.\n\nYour son is not entitled to money from his dad when he isn't willing to support his own child. He does not deserve the father he isn't.", "The support you provided to the other kids has gone towards supporting your third kid's child.\n\nIf that's correct, it's right and proper and kid number three deserves nothing more.\n\nBut you should add this info to your original post.", "You should've put that in the post. Also why you abandoned him. That's important info.", "In that case, it's simple.    Name the sum you would have given him, offer to add up all you have spent on his child plus projected expenses, and subtract that from your house assistance.\n\nTell him that if your expenditures for his child are less than the house expense, you will give him the difference.   If they are MORE than you would have given him for the house, he owes YOU the difference.", "Yeah, no, fuck that. You paid your debt when you took responsibility towards your grandkid/his child. Also, if kiddo is 15, then your third son must be quite... mature, at least in age. It's not your problem anymore.  \nedit: NTA", "Okay, NTA then. It was hard to tell from your original post though.", "I feel like you really needed to put this in the post...\n\nNTA", "Who said that op is raising his kid?", "You said you pay for everything. Spiteful mothers, IF that’s what she is, aren’t stupid about money. And you said the only reason you’re now speaking to your son sometimes is because your granddaughter has decided SHE can tolerate her dad for a couple hours at a time. \n\nAnd to clarify further, I am not accusing mom of being spiteful, I used a real life example as an illustration of why I doubt the veracity of your story. ESPECIALLY, when your answer to why he would “abandon” his child was “I don’t care to know.” \n\nBe honest. You wrote off this kid more than 15 years ago. This 3rd was expected to be your last right? #4 who is just now reaching 22 was the surprise? \n\nI think honestly you’ve probably got repair work to do with your son that goes back much further than you think.", "Didn't say the son was likable. Thank  you for responding to an argument I never made.", "My oldest has already done something like this. They had a huge fight over it", "This is the way tbh.", "👍👏👏👏", "Good for them.\n\nI think you should express the irony that this son wants free money from his parents when he wasn't even willing to provide money/care for his own child. Ask him if he plans on giving his daughter this money when she's 22.", "Nta sounds like you put his house money towards raising his child he abandoned. Sounds like you did help him financially, just not the way he wanted but how it was as needed,"]}