{"id": 14299, "submission_id": "12fskby", "title": "AITA For refusing to pay for my girlfriends best friend?", "selftext": "I (27 M) am dating the sweetest woman in the world Sammy (25F). It has been about a year now and I can see spending the rest of my life with her. The only thing is her best friend Lyn is horrible. She is an entitled rich Karen who not only dictates Sammy’s life but tries to order everyone else around her. Needless to say Lyn and I do not get along.\n\nWhen we go out Lyn has to pick where we eat, she needs to order the apps and suggest drinks (especially for Sammy) and she always talks like she is the most important person in the room. Oh yeah, and the ultimate best part is she orders expensive stuff and drinks and we have to split the bill…yup every time. Sammy never says a word though.\n\nA month ago we went out and Lyn picked the place. It was one of those expensive places where there were no prices on the menu. Lyn ordered drinks and food and when the bill came I stopped the waiter and told him to give each couple a separate check because I wasn’t paying for her and her bf. \n\nSammy was not happy when we got home and when I told my brother he said I was TA. I don’t think I should have to pay for her expensive taste though.", "created_utc": 1680974960, "permalink": "/r/AmItheAsshole/comments/12fskby/aita_for_refusing_to_pay_for_my_girlfriends_best/", "score": 161, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My gfs best friend always orders expensive things then wants me and my gf to pay/ split the bill. I decided we are not paying anymore and the free ride is over. It’s 50/50 if this girl wants to go to expensive places and make us go with her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "How's this for a solution to the eating out problem:  You say, \"Hey, Lyn, I just wanted to let you know that from now on, when we go out to eat, we're going to be getting separate checks as I'm not going to pay for you or your boyfriend in the future.\"\n\nAlso, when Lyn demands that you all go to an extremely expensive place, you say, \"No Lyn, I don't want to go there.  It's too expensive.  GF and I made reservations for all of us at XYZ restaurant.  We hope you'll join us.\"\n\nLet your GF know this is happening.  This isn't you being controlling, this is you refusing to be jerked around financially by her BFF.  \n\nIn terms of Lyn ordering all kind of food and drink for your GF, is GF OK with this?  Maybe talk with her about it.  If she's not OK with it, maybe discuss different ways she can handle it.  Maybe it's hard to be assertive in the face of Lyn's steamroller.  Maybe you modeling being polite but firm in setting limits with Lyn will help her.\n\nIf your GF is a person who likes others to make all her decisions for her and take charge and tell her what to do and treat her as if she has no agency, you'd better make sure you want a relationship with a wife like this before you tie the knot.  You cannot go into a marriage expecting that the other person will change.\n\nNTA", "NTA you aren't required to pay anything for them and I'm sorry your gf doesn't realize. Why doesn't she pay if she feels someone else should?", "Not TA.  But you need to be frank with Sammy about how she's Lyn's doormat.  And when Lyn orders for others, you simply, plainly explain that you'll order your own food and pay for your own food.  Also maybe try to peel away from Lyn and going out to dinner.", "NTA. \n\n>when I told my brother he said I was TA.\n\nBased on what? Shut this down now.", "NTA, IT'S NOT YOUR RESPONSIBILITY TO PAY FOR OTHER PEOPLE! Especially not her and her boyfriend! Good on you getting separate checks like that. Always have them separate based on who ordered what! Do not feel bad at all.", "Based on the information provided, your are NTA. It's understandable to not want to pay for someone else's expensive tastes, especially if you are not close with them and they consistently order pricey items. It's not fair for Lyn to dictate where everyone eats and what they order, especially if she's not willing to cover the extra costs.\n\nIt's important to communicate your concerns with Sammy and come to a mutual agreement on how to handle situations like this in the future. It's possible that Sammy feels uncomfortable standing up to Lyn or splitting the bill differently, and it's important to respect her feelings and work together to find a solution that works for everyone.", "NTA\n\nFirst, if *you order drinks for someone else, or choose to order appetizers, its on* ***you to pay***\n\nSecond, why does she think you guys should foot the bill for her expensive tastes?\n\nLyn is clearly an entitled AH.", "NTA.  Suggest taking turns selecting the restaurant though.  My wife had a friend like that, but she stopped wanting to go out after I chose a place with bbq ribs, and ate everyone with my hands.", "NTA\n\nhowever you should reconsider your relationship with Sammy.\n\nBest friend with such person, i doubt Sammy's real personality.", "INFO: Did you actually say \"because I'm not paying for her and her boyfriend,\" or did you just ask for the separate checks?", "NTA, but set the expectation ahead of time in the future. That said, you need to have a serious discussion about this with your GF, because it sounds like she and Lyn are a package deal. Is that what you want long term?", "NTA. You're not bankrolling Lyn's lifestyle. You need to sit down and have a serious discussion with Sammy because if you don't, this is your life. She's a doormat to Lyn, and if she won't realise that, then you're not dating Sammy, you're basically dating Lyn by proxy, with all of the horror that that encompasses.", "NTA. wow you're a saint for putting up with this so long ... Congratulations on finding your spine, you need to have a serious talk with Sammy about why she thinks it's your responsibility to pay for her friend all the time. The little quip about not paying for them was unnecessary, but I get the frustration. They are entitled.", "F that! You are NTA. Does she expect you to wipe her butt too? She isn't your people (family, friends). She has been financially abusing your girlfriend a long time.", "NTA\n\nYou NEED to have serious in-depth heart to heart talk with your gf. Especially if you see yourself with her long-term. \n\nTime to set some boundaries with with your gf and Lynn.\n\nYou are in a relationship eith HER. Not with her AND Lynn and Lynn's bf. You shouldn't be expected nor should it be assumed that you will pay for them every time because that is NOT YOUR RESPONSIBILITY.\n\nLynn is not your gf. Not your wife..nor your relative. You do not owe her.\n\nIf you want this relationship to last Sammy needs to sever the umbilical cord connecting her to Lynn so she can be an individual who can make her own choices and decisions. Unless of course she enjoys being Lynn's doormat. If that is the case do you really want to marry someone who is a doormat.\n\nIf Sammy continues to blow you off and refuse then she is not the one for you. Especially if she is not willing to be with you WITHOUT Lynn.", "NTA. Anytime a person goes out they should be ok paying for themselves.", "NTA. And I’d be suspicious of your gf if she is perfectly ok with Lyn treating you like this.", "NTA.  But you should stop going out with Lyn.  Sammy can go out with her alone.", ">I stopped the waiter and told him to give each couple a separate check because I wasn’t paying for her and her bf.\n\n\n\nCould you not have just asked for separate checks without adding in that you weren’t paying for them? Like it’s not as much of a what you did as it is how you did it.", "NTA. However, you're placing all of the blame on Lyn when Sammy are both AHs in this situation. Sammy is not only enabling, but encouraging Lyn's behaviour (since she got mad at you for not paying). She knows exactly what she's doing here. \n\n>It has been about a year now and I can see spending the rest of my life with her. \n\nThen I hope you're prepared to have this type of scenario play out for the rest of your life. If it's not Lyn it will be someone else (friend, family member, etc.). This isn't about Lyn, this is who Sammy is. You can't see the red flags because you're viewing Sammy through rose colored glasses.", "NTA.", "ESH. \n\nLyn sucks for obvious reasons. \n\nBut you should set the expectation of everyone paying for themselves at the beginning of the meal. And telling the waiter that you're \"not paying for her and her bf\" was unnecessarily combative.", "ESH - your gf needs boundaries. Her friend seem like she needs some tough love and you should be upfront  if changing the status quo on things like bills. \n\nBut your part is the least of the three.", "Soft YTA. You need to set expectations up front not put them on the spot with wait staff.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (27 M) am dating the sweetest woman in the world Sammy (25F). It has been about a year now and I can see spending the rest of my life with her. The only thing is her best friend Lyn is horrible. She is an entitled rich Karen who not only dictates Sammy’s life but tries to order everyone else around her. Needless to say Lyn and I do not get along.\n\nWhen we go out Lyn has to pick where we eat, she needs to order the apps and suggest drinks (especially for Sammy) and she always talks like she is the most important person in the room. Oh yeah, and the ultimate best part is she orders expensive stuff and drinks and we have to split the bill…yup every time. Sammy never says a word though.\n\nA month ago we went out and Lyn picked the place. It was one of those expensive places where there were no prices on the menu. Lyn ordered drinks and food and when the bill came I stopped the waiter and told him to give each couple a separate check because I wasn’t paying for her and her bf. \n\nSammy was not happy when we got home and when I told my brother he said I was TA. I don’t think I should have to pay for her expensive taste though.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA\n\nBut you can be less dramatic. You made it seem like you were paying for them, whereas you were just splitting the entire bill.", "NTA", "If her friend isn’t going to pay for herself then stop going places with her.\nNTA", "NTA.  You don't have to pay for her.  Separate bills/checks is the way to go.  For me it's something I automatically do because usually my main is a more expensive one, so I don't think it's fair to make someone else pay for my meal, and I can drink wine/beer, so would get spirits or cocktails, again, not fair to make someone pay for my more expensive items.", "NTA But...Sammy isn't so great if she expects you to pay for Lyn and her boyfriend.", "NTA and you need to be very careful here. Lyn will manipulate Sammy into thinking you are the controlling one.", "SEPARATE BILLS!! Make this clear before going out with anyone!!", "NTA, not at all. \nBut if you go out with them again, you should indicate at the start that bills will be separate.", "NTA. You need to be up from and clear about not paying for Lynn and whoever else. You also need to have a serious conversation with your girlfriend on why she thinks this behavior is okay, because it honestly won’t get better until she does something about it.", "NTA. But moving forward, upon ordering, ask for separate checks. Not only does that make things way easier for the waiter, it makes it clear to Lyn/her boyfriend that whatever they order is fully on them. \n\nIt’s best to learn ways of dealing with difficult people in a way that isn’t directly confronting them. It’s unclear if you actually said to the waiter “I want separate checks so I don’t pay for the other couple” but if you did, probably best to just address things as I suggested instead, because passive aggressive and snide remarks about your girlfriend’s best friend in front of said best friend without ever saying trying anything else is also not the most mature way of handling things, and is bound to rub your gf the wrong way, regardless of how in the right you are.", "Info \n\nwhat is the relationship dynamic like ?\n\nHow does Sammy feel ?\n\nHave you actually talked about it?", "Is Lyn fun, funny?  Hot?  Why are you guys eating out with her so frequently?  \nIf she has great qualities, be polite and genial about this.  The whole matter is a tempest in a teapot if it's managed.  She orders an $18 pinot, Sammy a $12 prosecco.  $6 saved.  There's no need for you to be so passive aggressive or to let this get so deeply rooted in you.  Resolve the issue, and from now on, separate checks is the expectation.  Say so prior to ordering to the wait person.    \nAt home: \"Sammy, I have $140 budgeted for dinner tonight.  We cannot go over unless you are willing to chip in.  You know how Lyn can be, so let's order accordingly.  We can't afford her tastes.\"  \nAlso, if you know Lyn is manipulative and self important, then expect it and you won't be frustrated.  If she's that and also fun to have dinner with, great.  Don't be manipulated, just laugh at what's funny and be fun to be around.  Allow her to feel self important.  It has zero bearing on you and the fun time you can have with Sammy.  \n\n\nAnd... I'm catching the faintest, merest whiffs of esteem, jealousy, and power struggle issues here.  Keep an eye on that!", "So... Just last month you had a post here removed regarding kicking out your disabled nephew from your wedding. And now you are dating the sweetest woman for about a year. Uhm... What is it?", "ARE you dating the sweetest woman in the world? She sounds like she’s either stupid, a doormat, or a bit of an asshole for expecting you to not say anything about this.", "NTA. Don't need to say anything else. Absolutely 💯 NTA", "NTA but as you alluded dude has had ample opportunity to avoid this exact situation, multiple times and multiple ways, before it happened.", "That IS being controlling.  Weirdly controlling.  Why ON EARTH would he be in the middle of Lyn and Sammy making plans to go to a restaurant?  They're friends.  He's a peripherally involved boyfriend of one of them.   This isn't a soap opera.  This is tiny, tiny minutia.  \nHe doesn't need to dictate every facet of Sammy's life, like make dinner plans with her friends.  Also, Sammy can pay.  Also, they can go and not get the $75 steak.  Also, they can go and make explicitly clear that checks are separate.  Again, not a soap opera.", "If Lyn actually think she is worth a lot, she shouldn’t even split the bill but instead offer to cover her share herself. Ordering more and then splitting doesn’t scream high class. If she says she didn’t realize, it is a lie.\n\nNTA", "Not necessarily entitled.  Possibly obliviously extravagant.  She's manipulative.", "Absolutely!  This is why I suggested really clear, simple, direct things he can say, as it seems like effective communication is not necessarily the strong suit here."]}