{"id": 14309, "submission_id": "12fxwvc", "title": "AITA for telling my wife her parents didn't love her?", "selftext": "I’m(47m) a divorcee, and I have two wonderful  daughters 15 and 13 respectively. I got remarried to Kate(37f) 3 years ago who has a daughter named Meg(7).\n\nI’m very close with my daughters, we often cuddle together while watching a show, pecks on the cheek, hugs out of nowhere etc…. We’re a very affectionate family. Kate isn’t, she comes from a family where hugs weren’t that common and as such she sees affection to the level of ours as highly unusual, maybe even weird. She expresses her discomfort with our affection on occasion, but I tell her I don’t apologize for loving my daughters. \n\nMeg and I developed a relationship. She saw us being affectionate to each other and she wondered if I liked her as much as her step sisters. I told her if she wanted to id do the same things with her, she said yes so I did. We started cuddling, hugging and all that I did with my other daughters.\n One day Kate saw us cuddling on the couch, and she didn’t like it, she said that I could do whatever I wanted with my daughters, but not to do it with hers. So I stopped, and when Meg wanted to cuddle I had to politely let her down. I told her that her mom told me I couldn’t anymore so to blame her.\n\nBefore anyone says it, Kate is a a great mom. Meg is well taken care of and shown tons of love, just not much physical affection.\n\nAnyway, Meg blamed Kate for me not “loving her” anymore, and Kate got extremely mad at me. She said hugging my kids as much as I do was really weird. I got pissed and I told her that it wasn’t my fault that her parents didn’t love her. She was really taken aback by that and she hasn’t talked to me since, this was two days ago.\n\nLike I said I’m not apologizing for being affectionate with my kids. But I felt I may have crossed a line with what I said about her parents not loving her.\n\nAITA?", "created_utc": 1680986786, "permalink": "/r/AmItheAsshole/comments/12fxwvc/aita_for_telling_my_wife_her_parents_didnt_love/", "score": 2330, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the AH because I crossed a line by telling my wife she wasn't loved by her family.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH - You were doing fine until you said Kate's parents didn't love her. It sounds like Meg would also like Kate to be more affectionate.", "ESH. Your wife shouldn't have stopped you from being affectionate with your step daughter (especially since she now sees you treating her step sisters differently). It's not weird to show physical affection to your children (even step children). That said, you went nuclear. Not all families show affection the same way, and just because her family wasn't into physical affection, doesn't mean that they don't love her.\n\nEdit: I do want to clarify she does have the right to ask you to stop being physically affectionate with her child. That said, she shouldn't have implied that it's weird. It's not.", "ESH. Your wife sucks for trying to dictate how you show affection and for sabotaging your relationship with Meg. She should allow Meg to make her own decisions about her relationships. You suck for telling her she was unloved. Her family may have showed love differently. You also shouldn’t be blaming your wife. You and Kate need to discuss this between you but having Meg caught in the middle isn’t fair.", "ESH - (Apart from the kids).\n\nYes Kate has been deprived of affection from her parents and this is having a negative impact on her daughter, given her reaction to having had it and it being withdrawn.\n\nTo suggest that there was something improper about you hugging your daughters is a really awful thing to say.\n\nBut so is saying her parents didn’t love her. I know it just slipped out and get how, it might even be true, but I think maybe having a discussion about expressing affection is needed here when you are not having an altercation. Weaving doubt into her mind about her upbringing is kinda cruel.\n\nI would suggest that maybe couple counselling therapy might help.I did couple’s therapy - I grew up in an n abusive household but had not really realised that a lot of the things that happened/didn’t happen were unusual and unhealthy/abusive. (I’m not saying anyone else’s parents are abusive, I’m just giving context as to WHY we were in therapy when our relationship was fine!)\n\nTalking through family relationships with both my partner and the therapist was like a light being turned on and it felt somehow safer with there being three people rather than two.\n\nAlso, it just helped us understand that we’re just different and express things differently. Like you and Kate do. \n\nI hope you get it sorted out. No one here sounds like a bad person, you both could have reacted better in this situation is all.", "ESH. Neither of you appreciate your differences and Meg got caught in the crossfire.", "This is a tough one. I'm ngl, the comment about her parents not loving her was probably too far so maybe you're the AH for your specific choice of words, but I don't think you're the AH for reacting out of frustration. It seems like she's trying to frame physical affection with your daughters as some creepy, perverted thing when it's not. I can see why she might feel uncomfortable when it concerns her own daughter, but overall it seems like she's perceiving physical affection between family members the wrong way. Maybe this does have something to do with the way her parents raised her, and maybe it doesn't. Either way it was a low blow that I would probably apologize for (without necessarily apologizing for showing your daughters love and affection).", "ESH  You said yourself that Kate is a great mom who loves her daughter, just doesn't show much physical affection. So why does her own parents not showing her the same affection mean they didn't love her. You seen to understand that these behaviors are learned, but decided to be needlessly cruel. \n\nBut she's also an A H because she should have talked to you before being so reactionary. And talked to Meg about her needs separately at an age-appropriate level. I feel for Kate. I'm also a single mother of a similarly-aged daughter. The drive to protect can be overwhelming. I'm not saying she handled this well, but I can see why she may have gotten uncomfortable. The deep-seeded discomfort around physical touch doesn't just disappear.", "NTA. Been married for 3 years. This is something that should’ve been addressed a long time ago. Hard to believe dad just started doing out of the blue. Being affectionate is not a bad thing and will make this young girl more willing to be affectionate with her own family some day. Further more it puts a wall between the the 2 blended families. Seems like they’re not fully committed to each other. Op I don’t think your off in your assessment of your spouse. It’s hard truth. Personally I don’t think Reddit is going to help the situation but I’d consider some martial counseling. Father of 4 and I didn’t come from an affectionate family so it doesn’t come naturally to show that to my children. Thankfully my wife fills this void.", "esh.  Kate's parents love her.  Kate loves Meg.  Everyone is too judgemental, but I don't blame Kate for not wanting you to cuddle her children.", "[deleted]", "YTA. You have to understand that not everyone is comfortable with that type of physical affection. Not everyone is the same as you are. While I don't think it was very nice of your new wife to question this behavior, you definitely shouldn't have retaliated by blaming it all on your stepdaughters mother. Telling her that her parents didn't love her is a serious low blow", "[deleted]", "ESH. I was at my friend’s house when I was like, 13-14 maybe? Her mom went to say goodnight to us and she gave my friend a peck on the lips. I was raised in a super affectionate family but that was weird to me. I asked my mom when I got home about that and she said that a lot of parents do that so I was just like, well ok then and moved on. It’s weird that your wife is almost sexualizing your relationship with your daughters - appropriate physical touch is really great for mental health in kids and adults and many kids really crave it. But you crossed a major line when you said hey parents didn’t love her. My in-laws are not physically affectionate at all but are still very loving. Nothing wrong with that. You two might benefit from a few counseling sessions to iron this out", "Yes YTA. Some people are not demonstrative, it doesn't mean they don't love their family\n I love my husband and children but I hate being hugged and having people hang all over me. It doesn't make me a bad wife, mother, sister or daughter. My family and friends know I love them and I have their backs no matter what.", "NTA but you should apologize for snapping. Lack of physical affection is a lack of emotional love. You weren't wrong.", "YTA.\n\n>> I told her that her mom told me I couldn’t anymore so to blame her\n\nAh, yes. Nothing says “healthy marriage” quite like pitting your stepchild against their parent.\n\n>> it wasn’t my fault that her parents didn’t love her\n\nSome people are uncomfortable showing affection. Some people show affection in non-physical ways. This doesn’t automatically mean that they don’t love their child/family member. \n\nTelling your wife this when you violated a boundary she put in place and deliberately attempted to damage her relationship with her child is out of line and fucking cruel. \n\nGrow up, OP, or you’ll have a second ex-wife.", "YTA.   \n\nThere are plenty of loving parents who don’t hug/ kiss/ cuddle their kids every day. \n\nI grew up in a cuddly/hugging/ saying I love you 5x a day to each other kind of house.   But I would never conclude that people who didn’t grow up with that same family dynamic were unloved.   \n\nThat being said, it sucks that your wife is so uncomfortable for with you treating your bonus kid the same as your bio kids.   I hate that for you.", "YTA for telling Meg to blame her mom. Why do you want to destroy their relationship? Why cant you have a talk about this instead of resorting to petty insults?", ">I got remarried to Kate(37f) 3 years ago who has a daughter named Meg(7).\n\n>We started cuddling, hugging and all that I did with my other daughters. One day Kate saw us cuddling on the couch, and she didn’t like it, she said that I could do whatever I wanted with my daughters, but not to do it with hers.\n\n>I told her that her mom told me I couldn’t anymore so to blame her.\n\n>Kate got extremely mad at me. She said hugging my kids as much as I do was really weird. I got pissed and I told her that it wasn’t my fault that her parents didn’t love her. She was really taken aback by that and she hasn’t talked to me since, this was two days ago.\n\nYTA. You're not Meg's biological father. It *is* weird and disturbing for you to be suddenly hugging and cuddling her like that with no context. Your wife was being protective. Instead of trying to understand where she was coming from, you first intentionally put a wedge in between her and Meg. Then when she (rightfully) became upset, you came out of left field about her parents not loving her. There not being a ton of physical affection in the house doesn't mean her parents didn't love her. What you actually should have done after she brought it up the first time was tell your wife what Meg said that led to you to start hugging and cuddling her. There was absolutely no reason to become so passive aggressive and combative.", "Yes YTA. You crossed a line. Not everyone shows love the same as others. Her parents love her just as much as your parents love you. Just some prefer to show it through actions and not words or being affectionate like that. My Dad and his family aren't affectionate and we don't really say I love you much but we all know we are cared for through actions and how we treat each other. My mom and her family are like you and your daughters. Saying I love you every 5 minutes, hugging for 10-15 minutes at a time and can't back away until they do first, lots of kissing, etc and they honestly don't mean any of it. It's all for show. I'd rather be in a family who shows love through actions instead of a competition between affectionate but that's just me and my experience with it. To each their own but it doesn't impact her relationship with her parents. That was too far.", "YTA. You crossed a line both when telling Kate her parents didn't love her, and also with cuddling with Meg without explaining to Kate what you were doing and why. Kate's parents loved her, they just showed affection differently and had boundaries that were respected. Not every family and not every person wants physical affection as a demonstration of love. Meg may have been feeling left out, but you should've talked to Kate and explained what Meg said to you, then allowed her to decide how to address it.", "YTA.   \n\n\nThere is absolutely nothing my mom wouldn't do for me, but we were not a touchy-feely family. Different people express familial love differently.", "YTA, holy crap. She said it was weird to her, and you responded with, \"Your parents didn't love you!\"???", "Yta. You dont really believe her parents did not love her just because they weren't outwardly affectionate? BTW enjoy the cuddles with your daughters. At there ages they cuddles will be ending soon.", "YTA. You literally told her to blame her mom, driving a wedge between a young girl and her mother. You then decided her parents never loved her because they showed it differently. Your wife is also TA, though, because physical affection is important, and while I understand her protectiveness, Meg is being deprived of it, which has consequences. Especially if it's a love language of hers, which it sounds like it is.", "Info I would recommend getting a divorce lawyer", "YTA. While I think your wife is wrong, every family shows affection differently. Telling her her own family doesn't love her is toxic, abusive and will trash her self esteem.  There was a better way to broach this subject and you chose cruelty.", "yes, of course YTA. How is this even a question?", "YTA", "YTA and honestly, I agree more with your wife then with you. Either way, everyone shows love in a different way. You can't say what you said. You should apologise ASAP. Also ask your wife why she doesn't want you to do it with her daughter. There might be more to the story there.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m(47m) a divorcee, and I have two wonderful  daughters 15 and 13 respectively. I got remarried to Kate(37f) 3 years ago who has a daughter named Meg(7).\n\nI’m very close with my daughters, we often cuddle together while watching a show, pecks on the cheek, hugs out of nowhere etc…. We’re a very affectionate family. Kate isn’t, she comes from a family where hugs weren’t that common and as such she sees affection to the level of ours as highly unusual, maybe even weird. She expresses her discomfort with our affection on occasion, but I tell her I don’t apologize for loving my daughters. \n\nMeg and I developed a relationship. She saw us being affectionate to each other and she wondered if I liked her as much as her step sisters. I told her if she wanted to id do the same things with her, she said yes so I did. We started cuddling, hugging and all that I did with my other daughters.\n One day Kate saw us cuddling on the couch, and she didn’t like it, she said that I could do whatever I wanted with my daughters, but not to do it with hers. So I stopped, and when Meg wanted to cuddle I had to politely let her down. I told her that her mom told me I couldn’t anymore so to blame her.\n\nBefore anyone says it, Kate is a a great mom. Meg is well taken care of and shown tons of love, just not much physical affection.\n\nAnyway, Meg blamed Kate for me not “loving her” anymore, and Kate got extremely mad at me. She said hugging my kids as much as I do was really weird. I got pissed and I told her that it wasn’t my fault that her parents didn’t love her. She was really taken aback by that and she hasn’t talked to me since, this was two days ago.\n\nLike I said I’m not apologizing for being affectionate with my kids. But I felt I may have crossed a line with what I said about her parents not loving her.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. How is this a question. It's just different boundaries and yes I do think it's weird. When I have a child in the future, i would also expect my husband to not constantly cuddle and kiss them at a certain age. Cause that would be around the time I teach them sex education and how people should not touch her and understand what's right/wrong. And I mean that for everyone with no exceptions for relative. Do not want some sick minded relative to wiggle their way into telling my child it's ok.", "YTA. For sabotaging your wife’s relationship with her daughter and for your awful, abusive comments to your wife.", "This is hard on all fronts.  I (56F) grew up in a kind and supportive and not-touching family.  I married a lovely person who comes from a touchy feely family.  I found it weird that my adult husband cuddled and held hands with his mom - but okay.  Our kids are on the touchy-feely side too.  I do participate and sometimes initiate affection.  Honestly, the extra hugging etc.  makes my skin itch. I would lay down my life for my adult children and my granddaughter, but I am not a hugger!\n\nOkay, I lavish physical affection on babies, toddlers & young children - any child, and animals of all kinds. It is just a *thing* I have about touching other adult people.  I currently have an 85 yo F neighbor who is a hugger... I love her dearly but geez... I am not a hugger.  Yet her husband has died and her kids live quite a ways away.  I recognize that most people need physical touch.  I hug the neighbor, but inside I cringe.  Oh well, we all get a long and go alone - I hope.", "ESH except for the children of course.", "ESH. Different families have different attitudes to hugging. My mother was against though she regretted it later in life when she was ill and saw other people being hugged by children. But bit hard to change to informal hugging.\n\nYour wife is wrong to set boundaries between you and your step-daughter if your step-daughter and Reddit being what it is, no suspicious behaviour. Your  stepdaughter felt being treated same way by you as your own daughters was inconclusive. And if your wife has suspicions, well that is a whole different kettle of fish and she shouldn't be with you.\n\nBut it was taking the low road to say her parents didn't love her. That must have stung esp as by same logic, you are saying she doesn't love her daughters (bio and step) because she doesn't hug.", "YTA: Love is shown in a lot of ways and it was really bad to say that. You even admitted that Kate is a great mom so unless you have another reason you think her parents didn’t love her, it’s not even true by your logic. If you keep it up, your attitude will teach your kids that there is only one type of affection.", "YTA. You already knew your wife was uncomfortable with the amount of physical affection you show your daughters and you didn't even have a conversation with her before starting to do the same with her daughter. \n\nAnd yeah it was an asshole thing to say that her parents didn't love her because they weren't big into physical affection. There are many different ways to show love and affection.\n\nYou and your wife should probably seek out some counseling to work all this out.", "YTA. A lack of physical affection doesn't mean a lack of love. My grandparents weren't physically affectionate people but Grandma showed her love in cards she drew herself that she personalized for everyone in the family and sent out for birthdays and holidays. My grandfather was a pest and by that I mean sneaky tickles as he walked by you or pretending like he was going to drop an olive in your soda can, that kind of thing. They're the children of German farming immigrants who grew up during the Great Depression. They did the best they could with what they had. Let your wife parent her kid the way she wants and you parent yours they way you want but for the love of God, DO NOT have a child together since you clearly don't see parenting the same way.", "NTA. \n\n>Meg blamed Kate for me not “loving her” anymore, and Kate got extremely mad at me. \n\nThis is too much, play stupid games win stupid prize.", "YTA, you can't possibly know what the parents felt. You said what said to hurt her. Can't you just agree to back off on the affection? You don't have to cuddle to show love.", "Dang OP is under the hammer because people don't like that he expresses his love through hugs and kisses to his own daughters. I loved hugging and kissing my dad, and on certain days I miss that. Let it be known there was nothing weird about it. As for your wife, it's sad that she can't embrace this because the one who misses out is her daughter.  Meg must watch your daughters with a certain amount of envy.  But I do agree YTA for saying your wife's parents didn't love her, that was unfair because they may have different standards just like how multiple cultures do things differently. It doesn't make them less capable of showing love it just means they show it differently. I'd say apologise to the wife and maybe sit down as a family with Meg and explain to her that while you cannot hug her, it doesn't mean you think of her any less.", "He sabotaged Meg’s relationship with her mother. He’s acting kinda predatory.", ">You also shouldn’t be blaming your wife.\n\nDisagree. Usually parents should present a united front, but in this case a united front would require either a) OP stops being affectionate with his daughters to avoid a disparity between the kids, which would be cruel and wrong, b) carrying on with being affectionate with his daughters and refusing affection to his step-daughter, making his step-daughter feel uniquely unloved, which would be cruel and wrong, or c) giving accurate information to his step-daughter about why she can't cuddle with him.", "His wife is protecting Meg.", "the post doesn't say that Kate has been deprived of affection by her parents - it says they don't come from a family which is as tactile \n\nphysical affection is only one way of showing affection", "[deleted]", "Personally I think cuddling you 13 and 15 year old daughter is really weird. I love my dad but if I was 13/15 i would not want him cuddling me.", "It’s not weird. Most kids are abused by a relative, and most often it’s a stepparent or parent’s partner.", "bit of a sweeping statement there - different people show love and affection in different ways.", "So what is OP supposed to say?? I dont like you anymore insread of the truth?\nHow is he the AH? All he did was tell the child the truth.\n\nThe wife is the AH for suggesting something improper about OP hugging his daughters.", "Literally just reading a true crime story about a guy having a relationship with the step daughter and she ends up killing the mother. Think she's right to be concerned 😂", "From what?", "If she has concerns about abuse, keeping the kid in the same household with the potential abuser is not protecting the kid.", "Personally I find it weird that you find it weird.  Stop sexualizing underage girls.", "Same, but I ain't trying to judge! My parents told me they loved me twice in my life. The rest of the time it was greatly implied by them continuing to feed me and tell me strange stories about what adulthood was.", "OP is an adult, his stepdaughter is 7. If he had any ounce of emotional maturity, he would’ve found a way to explain it other than “go blame your mom, it’s her fault.” \n\nIf you don’t find OP to be an AH for this, or for telling his wife that her parents don’t love her simply because they weren’t physically affectionate, your level of emotional maturity is equally as suspect.", "The most likely perpetrator of abuse.", "I am a 19 year old teenage girl and I can tell you very objectively i would find my dad weird if his cuddling me when I'm 13/15", "My parents always tell me they loved me but did not showed physical affection other than my mom biting me. 🤣🤣 They also force feed me fruits", "Truly, if his intentions were good, telling the daughter to blame her mom is not it.  That sets it up to become a secret, and from there weird shit can happen. 'i loved cuddling you, but mommy does want us to. If we do, you can't tell her.\" Meg wants the affection and goes with it.  Something happens that makes her uncomfortable, she fears getting in trouble or disappointing her mom so says nothing.  It's one of a parents nightmares. \n\nAn appropriate, non creepy way to respond would be to tell his wife what her daughter said, and discuss what new boundaries they could/should consider. It's her young, vulnerable child and her decision alone.  \n\n No one gets together with someone thinking they might harm their child, but it sounds like Meg's mom knows that and will protect her from that threat.", "Good thing your dad did not do that!  It's almost like each family is different.", "Those sound like perfectly normal parents from my perspective! Lol .. I would think OP was kind of a weirdo, and maybe he is, but my ex's family was like his. They always said they loved you and always piled up on the couch to watch movies.. I never doubted that my parents loved me, we just didn't touch each other or say it.. it was a culture shock", "That's why people are saying YTA to OP saying his wife wasn't loved? And it's perfectly in his wife's right to feel uncomfortable and draw a boundary with that. I think many do draw that boundary.", "Well I guess I’m gonna be in the minority but NTA, but very closely toeing the line to E S H. \n\nwas he an asshole for snapping that at her? of course. i can’t imagine my partner ever going that far when snapping at me, and if i ever do that to them i fully expect us to discuss it in depth and maybe consider couple’s therapy. \n\nbut our relationship would survive a bite like that, i think, if we properly take care of it. \n\non the other hand, i have less empathy for the mother because she’s *actively sexualizing his relationship with his daughters* and i find that abhorrent!!\n\nat 32 i still cuddle with my mom sometimes. maybe i’m biased but i’ve always appreciated her never faltering in her physical affection after i came out as lesbian to her. so cuddling with her means a lot to me. and i have very fond memories of being a little girl napping with my dad. i grew out of that of couse, but it was always my decision to do so when i felt ready. i think he should let his girls decide when they’re ready. \n\nI fully accept that I’m taking this personally but I’m someone who’s had their relationship with three male members of their family sexualized. And so I am about ten times more offended at the mom than the dad. bringing that up to him is sick. planting that idea into his head is SICK. like, you should try it. bring up incest between you and one of your parents. just drop that idea into the universe. \n\nsee how well your relationship takes it.\n\nThat’s what she did to him. She can at least be comforted by the fact that what dad said is obviously a lie and parents express affection in different ways. But she could have permanently affected his relationship with his daughters.", "I think this could have been handled differently,  but I hold strong to the fact that A) I'm on yhr outside and B) have the ability to read it and digest it, and don't have to react in the moment.\n\nRetrospectively, you should have asked her mum how she felt about it first. This could have avoided a lot. But I'm literally learning from your mistakes. I'm no guru.\n\nI think what makes you the AH is the comment about her parents not loving her. That wasn't ok, but you've also owned that.\n\nHer implying your love language with your children was weird, is not ok. Borderline offensive.\n\nI wouldn't say ESH, but I would say everyone has a lesson to learn here. Patience and communication will help a lot.", "ESH. You’re not wrong, but damn. Went for the throat. A little more diplomacy is better in romantic relationships.", "YTA.   \n\n\n>I told her that her mom told me I couldn’t anymore so to blame her.\n\n>it wasn’t my fault that her parents didn’t love her. \n\nI’ve rarely heard such obviously manipulative nastiness. Admittedly I have a biased take on this due to abuse in my childhood but saying things like this is not going to help your wife feel comfortable - at best it’s strangely and unnecessarily defensive.", "ESH for the 2 adults.  I am not a cuddly person, not everyone is.  The AH issue here is not hashing this out through communication in private.", "I think it's perfectly understandable for a man to get upset and maybe over-react when someone raises suspicions about how they show affection. We have way too much policing of men's ability to show affection. It's stifling and unhealthy for everyone.   \n\n\nThat said, yeah you did cross the line with what you said. Now that the moment is over, you need to go back and have some real talk with your wife and it needs to include an apology from both of you for the hurtful things that you both said.  \n\n\nGood luck!   \n\n\n(no judgement offered)", "I'm going to say NTA but you did handle this fallout badly. \n\nClearly Meg has the same love language as you and your bio daughters--physical affection. It's totally okay that it's not Kate's love language, but her baring Meg from feeling loved the way she wants is truly heartbreaking. I would assure Meg that you love her, and that not being physically affectionate makes you sad too. She's 7 for crying out loud! \n\nKate created this whole situation out of nothing, and unfortunately the one who is hurt most is the one she's supposed to love the most--Meg. \n\nYour conversation should have focused on this. Meg specifically requested physical contact and it made her feel loved, but then her mom ripped that away from her. Unfortunately, instead of defending Meg feeling like part of the family, you clapped back about Kate's upbringing. It was obviously an emotional reaction, but you did widen the divide in your family. You should apologize to Kate for that comment specifically, but also defend Meg's right to feel loved by the adults who care for her. \n\nMaybe one day Meg will grow out of snuggles, but she's not there yet, and she deserves for her parents to show love in a way she understands", "NTA\n\n&#x200B;\n\nSeems like something your wife needed to hear. It wasn't well-received, but sometimes the kindest thing to do is the one that temporarily hurts feelings.", "My SS(13 almost 14), is INCREDIBLY physically affectionate with my husband/his dad. I mean he spoons his dad, mouth kisses, long hugs, lays on his lap during movies, holds his hand in public. \n\nMaybe it’s how I grew up (I’m almost 29 and have an almost 28 sister and a 23 brother) and we were all super affectionate with our parents. Even as adults we still are. When I visit my mom, we still spoon, give physical affection. Even us as siblings are affectionate with each mother. We do family spooning, etc. so I never view my SS and my husbands affection as weird. \n\nI honestly would be uncomfortable being married to someone who viewed me as a potential predator not just with my children but my partner’s.\n\nYou’re NTA, but you and your wife need to have a serious conversation and most definitely should be in counseling.", "NTA. She is. I don't get the ESh. People are social creatures and respond to physical touch. It's been demonstrated in scientific research and is common in other mammals, as well. It is MORE normal to show physical love (that's why doctors care so much about skin to skin and bonding with newborns) than to not. I wouldn't have said \"blame your mom\" I would have said talk to her. And it sounds like this family needs therapy. I cannot imagine turning away my half sister, daughter, step son, or foster child or even my puppy if they wanted a hug or a cuddle!! How sad.", "ESH She’s being really weird about the entire situation and Meg is suffering. I think since you guys are married, Meg is your daughter now too and your wife shouldn’t be able to tell you not to be affectionate to her. \n\nBut also what you said was way out of line. A lack of physical affection doesn’t mean her parents didn’t love her. A lot of families have generational issues with physical affection and the cycle just continues. Her parents likely didn’t have a lot of physical affection from their parents and so they did the same thing with your wife. It absolutely doesn’t mean she wasn’t loved, that was a cruel thing to say. \n\nYou guys both need to talk this out and maybe your wife should see a therapist about her issues with physical affection", "OP=YTA\n\nfor TWO things \n\n1) Telling wife that her parents didn't love her just because they don't show physical affection to YOUR satisfaction.\n\n2)  << *I told her that her mom told me I couldn’t anymore so to blame her.*\\>>  It is fine to say, that her mom asked you NOT to do it, but the SO BLAME HER was the AH move here. \n\nYou said Kate expresses discomfort sometimes, but do not Indicate she has asked you to stop.  Therefore she has not asked you to apologize for being affectionate with your kids.\n\nI don't know the situation with Meg's Father/family--but your expressive affection, could be regarded with suspicion by them and used against Kate(and her custody), so that MIGHT also be a concern that she has to deal with.", "ESH\n\nHugging your children is not weird. And your wife shouldn’t have said that\n\nBUT\nDude, why do you feel the need to tell your stepdaughter “sorry, I can’t cuddle you because your mom does not want me to”???? Why don’t you talk with your wife as the adult you are supposed to be?\n\n(I’m not going on a tirade about how dangerous is for a little girl not to be able to trust her mother when speaking about her body/cuddling/wanted vs unwanted physical affection. But depicting your wife to your stepdaughter as an enemy who does not like cuddling/physical love is dumb. Like reaaaaally dumb. And dangerous).", "ESH\n\nAs far as I can tell, you dont say that Kates parents didnt love her, just that they werent as physically affectionate. Kate is also not physically affectionate. By drawing the conclution that her parents didnt love her from them not being physically affectionate with her, you more or less have to draw the same conclution that Kate doesnt love her kid since she isnt physically affectionate.\n\nYou also did put Kate in a tough spot when getting more physically affectionate with Meg without talking to Kate about it first. There was no way for anyone to walk that back without Kate becoming the bad guy, and you knew her discomfort with the physical affection, and did it without talking to her anyway. You painted her into a corner, forcing her hand to either do it your way or hurt her kids feelings. \n\nShe thinks your physical closeness to the kids is weird. You find it weird that she isnt more physically close. Thats the crux of the problem that you guys need to figure out asap before this derails further and hurts the kids more.", "YTA. Just because her parents didn't show her physical affection doesn't mean they didn't love her. While physical cuddling is totally fine, it is not the ONLY way to show love. \n\nWhile I don't think your wife should make her daughter feel left out by putting the moratorium on physical affection, you are more TA than her because of what you said. I'd almost go E S H because you both need to have a conversation in which you realize there are multiple ways of showing love, figure out what makes each of you comfortable/feel loved, and learn to let others show love to others the way they want.", "ESH for sure. Not the kids but you don’t tell someone their parents didn’t love them. Just say she didn’t grow up with as affectionate parents", "YTA- everyone doesn’t express their love the same way. Kate is not very physical in her affection but you say she is a great mom.  You can’t have it both ways. Just because her parents weren’t very physical doesn’t mean they didn’t love her. \nAlso YTA for turning her daughter against her. You could have spoken to Kate about this ahead of time.", "YTA - first of all you probably should have discussed the cuddling with kate before doing it, especially already knowing how she feels about it. what makes you the biggest asshole is telling meg that you cant cuddle with her because her mom said you cant, its super shitty to put a child in the middle of your disagreement. this isn’t normal in every family, that doesnt mean kates parents dont love her and she has every right to ask you to not cuddle with her daughter. it might not be great for your relationship with meg and that sucks but there are ways to find your own thing with her that kate’s comfortable with.", "Sounds like you lashed out because she accused you of being a perv with her daughter.  I think she’s the initial asshole and kind of deserved the cutting comment, but I guess if you’re asking are you the asshole for saying what you said, then yeah YTA.", "ESH\n\nWithout therapy and some intense communication, I don't see your marriage surviving that comment, no matter how obviously true it is.", "Nta, Kate should be grateful to have a spouse who treats her child the same as he treats his. Also, she created this situation. It's not your fault that her daughter is angry w her.", "Yta. You don't get to decide how your wife's parents feel about her.  Some families aren't as affectionate as others. Instead of a calm rational conversation, you chose to deliberately hurt your wife with cruel words aimed to hurt her. \n\nIt's no wonder your wife hasn't spoken to you in days. \n\nI get you were frustrated by your wife's different point of view, but you could have discussed the matter properly.", "From telling Meg to blame her mom to flying off the handle and telling your wife her parents’ didn’t love her, you sound really immature.\n\nYTA", "YTA - there are many ways to show love, and to assert that your wife was a neglected child because her family wasn’t affectionate (by your own admission) is cruel.\n\nYou should’ve also had a conversation with her about what Meg said before just diving into physical affection.\n\nAnd you think you’re right and that your way is more right in parenting based on the ‘blame your mom’ attitude you took **with a 6yo.** \n\nWould you also put your bio daughters in the middle like that??", "That's so adorable that you're like that with your children. I was the same as your wife growing up, didn't get much affection. My husband is 31 years old and he'll still sit next to his mum with her legs draped over him or something, play fights with his brother, his and kisses goodbye, says I love you at the end of every phone call... They're a very affectionate family and it's lovely to be a part of :)\n\nI think that stopping it with your step kid wasn't necessary. You should be able to treat them the same and it's great you were. Your comment to your wife was probably a bit hurtful though. I'd consider apologising and having a heart to heart with her. Your children probably feel safe in your cuddles and the might grow out of it soon, so explain how you feel and ask why she feels differently?", "I honestly wonder if maybe your wife has been sexually abused in the past. I think you need to address why this makes her uncomfortable", "ESH \n\nYou may be an asshole, but if that is what it takes to not deprive Meg of affection your wife has been deprived off, then go be a big nasty asshole.", "YTA\n\nYou were aware of Kate’s discomfort regarding the affection, so you should have spoken to her first before engaging in that behaviour with Meg. \n\nAlso, telling someone their parents didn’t love them is a totally fucked up thing to say.\n\nKate has some stuff going on around this affection thing. Have you spoken to her about it? Does she know where it comes from, what it feels like? She is reacting strongly and where it’s impacting the kids so much, it ought to be unpacked. \n\nKate has not conducted herself well here either though. She’s lost sight of her daughter’s wellbeing and is transferring her own issues down to her daughter, likely leading to a lot of confusion about all of this. Kate also certainly doesn’t have the right to interfere with how you communicate with your daughters. \n\n\nThere seems to be a sense of entitlement to your position: the “I’m right, so fuck you, I’ll do what I want” attitude is not part of a healthy relationship. I agree that you shouldn’t need to apologise for being affectionate with your kids, but there’s an issue here, so work it through.", "YTA \n\nI don't actually know of ANY families this huggy, so yes, you are an outlier at the extreme end of the bell curve and are not \"normal\".\n\nYou should have anticipated that being extremely physically affectionate with your stepdaughter would be innapropriate. Protest all you want about how things \"should\" be, but that's the world and culture we love in, and you are breaking norms, which always comes with a little side eye.\n\nYou are getting voted an asshole for 1) not recognizing that you are an outlier, 2) the equating touching with loving (that is SO unhealthy), 3) blaming your wife, rather than having a conversation explaining with the kid, 4) assuming behaving this way with the kid was allowed without asking in the first place, and 5) lashing out in extremely hurtful, outsized ways, which shows you are not in control of yourself.", "YTA/ESH\n\nYou told a 7 year old to blame her mother for why she won’t get affection like she sees her siblings get. Holy shit I’d be pissed as fuck if you did that to me. That’s destruction of a relationship you just did, to multiple people, with a single sentence. I’m not even getting into that hornet’s nest of telling your wife her parents didn’t love her.\n\nYour wife also sucks for creating a circumstance where kids get treated differently because of who their parents are. That’s shitty.\n\nYou probably deserve each other.", "normally I'd go with every sucks here but what you said was pretty over the top, pretty hard to take back kind of thing. Don't have to resort to low blows right away.\n\nYTA.", "YTA you 100% said something to hurt her cause youre frustrated and you feel like she is attacking your parenting. You both need to sit down and figure this out maybe add a therapist because it seems like it is a deep seeded issue with your wife.  Meg is the one loosing out and it’s effecting her. You adults need to figure your shit out", "YTA Telling the child it was her mom's fault very ICKY makes you sound like an abuser rather than an affectionate father figure. Telling the mom, she wasn't loved even worse. 7 year old doesn't have the same agency as your children. It is better that you spend some time cuddling and showing affection to your wife. Alienating a child from her mom is a predator move.", "ESH. All adults failed this one. I honestly don’t know how you come back from this. Meg is the one that is going to suffer the most from this. Did you not discuss this at all before you got married?\n\nOP, I do get where you are coming from, I am also from a family of people who are big on physical and verbal affection and if I am completely honest, in my heart of hearts I feel like parents who do not physically or verbally express any affection to their children don’t love them. Rationally I know this is not true due to people with that lived experience telling me so but when I hear people say “my parents never told me they loved me” or “my parents never hugged me” my heart hurts for them.", "ESH- you and Kate blew a huge parenting opportunity here. You can still save it though. You and Kate need to sit down with Meg and talk to her about boundaries. It's 100% ok for people to have different boundaries and here's a chance to brag to Meg about how her mom clearly communicated some boundaries. Meg should feel free to communicate like her mom does. (Focus on the good parts here.)\n\n\nAs a mom, Kate gets to help Meg set boundaries while Meg is developing her instincts to figure out where her own should be. Meg can talk to her mom about where she wants her own boundaries to be. You will respect what they decide. \n\n\nYou can explain why you and Kate grew up with different boundaries and how EVERYONE grows up differently. This is a chance to talk to your kid about respect and communication. Take advantage of it, OP!", "ESH. You suck for making a very unnecessary comment that hurt your wife’s feelings. Your wife sucks for not letting her/your daughter get hugs and cuddles from you. Just because that wasn’t the way she was raised doesn’t mean Meg should have to grow up that way. If Meg likes to be cuddled and hugged and kissed (appropriately) then she should be. Research shows that 8-10 meaningful touches (I.e. hugs) a day is very good for our emotional well-being. Not everyone likes physical touch and that’s a boundary people should respect. But Meg does like it and wants it. I feel sorry she is stuck in the middle of two people who have different ideas of how to raise her. I would suggest family therapy.", "Didn’t we just see this story from the man’s point of view a few days ago?", "ESH\n\nWhat you said to your wife was extremely unkind and likely inaccurate; just because people aren't physically affectionate and cuddly doesn't mean they don't love their children, or that they don't show them love in a hundred other ways.\n\nThat said, your wife finding it weird that you're physically affectionate with your children is problematic.  And although she has every right to ask you not to cuddle her child, this is making her daughter feel that you don't love her and is undermining your relationship with her due to the fact that you cuddle your girls but are forbidden from cuddling her.\n\nI would strongly suggest some therapy for you and your wife right away.  The issue with the physical affection is not going to go away and it's hurting your wife's child.  You two need to find a way to address the issue.", "ESH", "Just wondering why the moderators are okay with all men being called potential predators in the comments? If comments get removed for not being civil, then why is blatant misandry allowed???", "ESH. That escalated way too quickly. \n\nPhysical affection from unrelated men to little kids (esp. girls) is a super fraught topic. The fact that you are a physically affectionate with your daughters is great. They clearly enjoy it and benefit from it. But Meg’s situation is different. The majority of childhood sex abuse is committed by someone the child already knows and trusts.\n\nI think if you wanted to address this in a meaningful way, you could have sat down and tried to probe a little to see why Kate has such a deep distaste for physical affection. It’s possible that there is more to it than just her parents not being affectionate with her. She may have a history of abuse that she doesn’t know how to share with you, and she *definitely* won’t want to share with you now. \n\nIt sounds like maybe she needs to check in with a therapist to make sure she isn’t forcing her own fears onto Meg, and work towards a compromise with you.", "ESH. Your wife shouldn’t be stopping you hugging your daughter but just because her parents weren’t physically affectionate doesn’t mean they didn’t love your wife and saying that is awful. My mum wasn’t much into being physically affectionate with me and I know she loved me and she showed it in many ways. Apologise to your wife but I would also say that your going to treat all your daughters the same way. Your youngest seeing the difference is only going to get really hurt.", "NTA, but you should not have said that. 🤣🤣🤣", "not going to be popular but E.S.H.\n\n> So I stopped, and when Meg wanted to cuddle I had to politely let her down. I told her that her mom told me I couldn’t anymore so to blame her.\n\nYou and Kate need to sit down and have some long talks about what affection means to you. Eventually you'll have to address why she's okay with you showing your daughters affection  but not hers. \n\nIt was a super shitty thing to put a 7yr old in between you instead of just talking to your wife. Actually; I've changed my opinion. YTA.", "nta but was your wife abused before. im east asian so im also affectionately distant with my family (literally have to ask my Dad specifically for a hug if i want one, we're just not wired to be outwardly affectionate). and EVEN THEN I will still give mom and pops a hug and a kiss whenever i can see them because oh my god they're family.\n\njust sounds like wifey is either asian or has some trauma that maybe you should start uncovering with her. not saying it justifies her hating you loving your kids and stepdaughter, but it would pave a reason as to of why she gets so agitated by physical affection", "NTA", "NTA\n\nIf you feel like saying that about her parents was a bit over the line that's cause it was, but on the other hand she had kept being judgy of you a long time & it's understandable that you snapped eventually if she kept & kept hammering you with judgement-\n\nI would still apologize for diplomacy's sake, but be firm that you will take no more judgy comments.  Inform her that North American culture's touch aversion is highly unusual & that physical affection between friends & family is super common all over the world & good for kid's health. Get some pic of south korean kids doing physically affectionate gestures all over the place.", "Yeah. You crossed the line, but you're still a good man. I'm hoping the two of you can work this out without coming at each other, out of anger.", "NTA What ever Kate's issue's are she needs to deal with them without hurting her own daughter or your daughter's.\n\nYou were doing nothing wrong.     \n\nShe was projecting.", "ESH - When Kate objected the first time a calm discussion should have happened right then. That Meg requested it should be the deciding factor in this to me.", "ETA. You should not have used Meg as a tool in your fight with your fight. She’s being to much but you are being immature", "NTA", "She is sexualizing you and the way you show affection. She keeps separating “your kids” vs “my kids” after 3 years of marriage. Either you are a predator and she sees it, she’s projecting or she really have no idea what affection looks like in her own family so she is limiting everything. I vote NTA, constantly being looked at as weird in your own family and her insistence on making everything an issue even after you stopped hugging her child would make anyone frustrated. And anyone who says he’s an A H for telling the step child that reason, please tell me how you would have said it to make the situation any better.", "ESH but not too much.  I think it's mostly just a lack of understanding from both of you.  Everyone has good intentions for the most part and is just handling the disconnect badly.  Counseling would likely help here.", "ESH. I would say you both went about the argument very poorly. That said, you are right there is nothing wrong with hugs and cheek kisses for one's children.", "Nta!!", "ESH.  But yes, you definitely did more than cross a line, you destroyed that line.  And you have done grave damage to your marriage.   Don't be surprised if she wants a divorce after this.", "ESH", "Should OP apologise for his words? After she apologises for accusing him of perving on their kids. OP isn't blameless but OP reacted badly to a nasty attack. ESH.", "Are you that affectionate with your wife?", "ESH, for the reasons others have stated.\n\nBut if you want to keep this a healthy family relationship, Kate needs to be in counselling *now*.", "ESH you lost me at \n\n>I told her that her mom told me I couldn’t anymore so to blame her.\n\nI was really on your side. I am super affectionate with my son in part because I grew up in an extremely not affectionate household. I'm *learning* how to make holidays magical because nobody ever did it for me as a kid.\n\n\nBut your wife has a right to set boundaries around what she's comfortable with. There are other ways to make your step daughter feel loved without cuddling. You could even sit on the ground in front of the couch while she lays on the couch therefore close but not cuddling, still showing love and being close without physically cuddling. \n\n\n\nBlaming your wife was not okay. That will cause a rift between your wife and her daughter and that isn't okay at all. Keeping the entire family tight knit should always be the goal.", "NTA, as far as I'm concerned. Was what you said too far? Maybe. Does that make you an asshole? Sure, but it's justified in my opinion, and we have no 'justified asshole' rating. Honestly, I don't know how calm I'd be if my spouse insinuated that me hugging children, OUR children specifically, is weird. The connotations piss me off. It's been THREE YEARS since you married. This should've been discussed in the beginning, she shouldn't draw a rift between you and her 7 year old. Poor little girl.", "NTA. Your wife wont say it but I will, she is sexualizing your intimacy with your children and she is afraid of that with her child. Me personally, this would be grounds for separation until she gets clearly much needed therapy for her issues.", "Also, telling Meg to blame her mother was a huge AH move. Way to mess with a 7 year old. You could have handled that gently with tact, OP. YTA", "I’m still kind of a noob here, what does ESH mean?", "I also think it's weird how he says his wife is a great mom just not affectionate but then he tells wife she wasn't loved because of having the same parenting style as his wife.", "OP, you and your wife need to clarify your love languages. Get the book. She may not show love through touch and affection but other ways. You both need to understand that, but you went for the jugular by saying her parents didn't love her. I'm going to say gentle YTA, but you two need a good conversation.", ">I do want to clarify she does have the right to ask you to stop being physically affectionate with her child. \n\nNo she doesn't. There's nothing sexual going on. The child is the one who should be deciding who she wants to receive physical affection from, in the absence of inappropriate behavior. Weirdly enough, seven is old enough to have bodily autonomy.", "You’re a good egg for supporting your neighbor.", "Idk why but your comment made my heart warm. I can’t imagine how it must feel NOT loving physical affection and being around people who do. It sounds like you have done the BEST you can, and you seem so sweet and genuine. I just wish SO much happiness for you.", "No he is wrong. Just because her family isn’t physically affectionate, that doesn’t mean she grew up unloved", "That goes both ways. She also should stop being a nuisance of how he is with his daughters just because it's not how she and her family is. She wants to impose her view and her family's way as the \"Normal\" way, she's a huge asshole", "I do feel that it was okay to explain that the mother has asked him to stop,  Because the kid does have a right to ask mom why.  \n\nBut OP went to far with the \"Blame mom\"\n\nI just don't see any way he can explain why he won't cuddle her anymore without making her feel he's rejecting her.   I simply cannot think of another way to explain it to the kid that isn't a lie. \n\nJust My opinion.", "He did understand. That’s why he stopped when his wife requested it. But he shouldn’t have to let his stepdaughter think he doesn’t love her as much as his own daughters because of the mothers discomfort. If the wife wants him to stop what the stepdaughter feels is required affection to show he loves her as much as his daughters then the stepdaughter has a right to know that it’s because of the wife and not because he doesn’t love her.\n\nNTA", "I mean, New wife did the exact same thing, by stating OP's means of showing affection is weird. That's more of an ESH.", "This! She’s uncomfortable for reasons he doesn’t understand. And his response is totally unacceptable.", "I'm curious what the people who are saying he shouldn't have said that to his stepdaughter think he should have said instead. If it's so important to Meg that knowing the truth would destroy her relationship with her mother, shouldn't you also be asking why her mother wants to destroy her child's relationship with her stepparent? If he lies about it to \"preserve her relationship with her mother,\" he's now the bad guy to her, and that doesn't exactly seem like a good way to blend a family.", "I’m sorry, it’s weird to show affection to your step-daughter which she requested?", "You’re exactly right.", "This!", "Teaching your children about boundaries also means teaching them that they get to decide. If the children want to have that kind of relationship with their father, then they get to have that kind of relationship. It’s not for you to tell them that they can’t. Teaching your children to have control over their bodies also mean they get to decide who they cuddle. It’s not like dad wants to cuddle and the child doesn’t want to. THAT would be bad. The child wants affection and that’s absolutely the child’s choice. Rejecting a child and not showing them affection just makes them feel unloved. Cuddling family isn’t inappropriate unless one party doesn’t consent.", "What a great way to maintain a marriage, accuse your partner of potentially SA’ing your kid. She should stay a single mom then.", "There is no tactful way to tell a 7 year old that you can't hug her", "Yes OP should have said i cant hug you like i hug my own daughters. Because yes that sends such a nice message to the 7 year old. It helps blending the families soo much. Wow", "[removed]", "Yes. Down with honesty! We must lie to our children so that mom can feel better about her weirdness around people who express love like normal human beings!!!", "ESH - You were doing fine until you said Kate's parents didn't love her.", "How would you suggest he reject a 7 year old then??", "It means Everyone Sucks Here", "Everyone sucks here", "It means everyone sucks here :)", "He could have said, \"your mother doesn't think it's appropriate\" instead of literally, \"blame your mother.\"\n\nEither one sucks, but the first doesn't seem like the two are having issues.", "From what? She is sexualising a father showing affection to his daughters. He's always done this and if it's a problem it should've been resolved years ago. They should have never gotten as far as marriage if this is such a problem. In essence she married a man that she half suspects has nefarious plans for his daughters and hers. Who does that?", "What the fuck??? It’s not predatory to cuddle and hug your kids. He’s not sabotaging anything. Meg just wants to be loved and hugged, damn", "What the actual hell is this??", "No actually. He’s respecting his wife’s wishes while also maintaining some semblance of a relationship with his stepdaughter which is honestly hard to balance in a situation like this. You’re just as weird as the wife is for saying that. Fix yourself.", "Projecting much?", "What 🤣🤣🤣", "Thanks - she is great.  In fact, she is joining us for Easter dinner tomorrow afternoon.", "I mostly dislike hugs and too much touch. My family on my dad’s side are the same so it was normal for him. My mom said it was an adjustment learning how show affection to me. I wish more people understood this.", "That’s your opinion. We’re getting a snippet of their lives in the post. Second marriages. There’s a lot going on here. We’ve all said hurtful things to our significant others that may be true but will regret the manor in which we did it.", "That's exactly what it means. Research shows time and time again that even small babies grow healthier and faster when touched and cuddled. Humans need physical affection throughout their growth cycle, and into adulthood. We are a social species with hyper-awareness of when we are unloved or outcast. The harshest punishment most modern societies give to prisoners who misbehave isn't a physical beating or death - it's solitary confinement.\n\n&#x200B;\n\nNot showing physical affection to your family is abuse.", "\"Most kids\" are not abused. Fucking stop this, you creepy perv. You've spammed this entire thread with your gross comments, sexualizing little girls. \n\n&#x200B;\n\nYou need help. Ongoing, professional help.", "That doesn't mean we should be afraid of healthy physical affection.", "And raising your kids to fear / be uncomfortable with physicalnaffection will not protect them from that. If anything it will make them more at risk of seeing physical affection as a shameful thing and then hiding it.\n\nMy mom was like Kate, having been through trauma of her own, and because I saw physical affection as something that was shameful and bad, I was easy to manipulate into hiding what was happening. There had never been an conversations about boundaries or saying no, nothing that would have empowered me to speak out. \n\nSo if you're really interested in protecting your kids teach them about consent and personal boundaries. Let them set their own boundaries (where appropriate) and then respect them.", "You just want her to look for the affection she doesn't receive home outside, which actually puts her on real risks, don't you?", "And in my family, extended and immediate “cuddling” on the sofa watching tv is totally normal.  And not one of us have been abused.", "I feel like most people with the same idea as you are thinking spooning, which it probably isn’t and would be weird", "[deleted]", "I would have talked to the Mom before that even happened when she objected and come to a mutual decision, from there if they decided to not allow physical affection they could have explained to her together. At the end of the day though Meg said that's what she wanted and in a case like this I think they should hold a lot of weight.", "She's 7. They got married when she was 4. Suddenly hugging and cuddling her now is weird af. Some people like to actually look out for potential child abuse. It would be different if he actually explained what happened but all he did was get passive aggressive and nasty about it which makes him look guilty as hell.", "Sure, but I grew up in a non physically affectionate family and most people around me are the same but I don't think it's weird for a father to hug his daughters. The problem isn't different styles of expressing love at all. It's that Meg's mother thinks of one as weird and her constant opinion on that is clearly wrong. If she doesn't want her husband to cuddle her daughter, she can tell her daughter herself instead of putting a step parent on the spot. What can he tell meg that he doesn't love her enough to treat her like his own daughters?", "This right here is the comment I wanted to see. I'd like to know from those who suggested tact how they would handle this", "It sounds like Meg would also like Kate to be more affectionate.", "Exactly", "It is absolutely NTA.  The wife is playing some really strange abusive and damaging games here.  Imagine having a step parent happy to treat your kid as their own and then shitting on them and the kid for doing so.\n\nBeing a step parent is hard, because people bring forward their past trauma.  You get all the stress and pressure, and then you get idiot partners undermining you while you are doing nice things for their kids, making decisions, discipline etc.  You just can't win if it turns out you are caught up with  an idiot.\n\nThe woman is a borderline abusive, jealous, controlling person.  OP is in a very awkward position due to that fact.  The partner needs some serious help before she damages a loving partner and daughter further.", "He should have just deferred. Said I would love to hug you but we need to ask your mom about it.", "/u/Amazing_Spinac is a scammer!  **Do not click any links they share or reply to**.  Please downvote their comment and click the `report` button, selecting `Spam` then `Harmful bots`.  \n\nWith enough reports, the reddit algorithm will suspend this scammer.\n\n---\n>!^(If this message seems out of context, it may be because Amazing_Spinac is copying content to farm karma, and deletes their scam activity when called out - Read the pins on my profile for more information.)!<", "That would imply, though, that there is something inappropriate about it. Especially to a child for whom nuance wouldn't be as clear.", "Easier said", "[removed]", "My thoughts exactly! Why would she marry him if she thought this was concerning?", "Someone abused by her own parents who didnt love her?", "[removed]", "It's Reddit. Chronically online people who don't understand the real world and real families lol", "Just a projecting lunatic with many unresolved issues. I’m 50 and still fall asleep on my dads shoulder at family gatherings. I dread the day I won’t be able to hug and kiss my parents anymore.", "Same here", "What do you mean that’s my opinion? He himself that his wife is a wonderful mother, she’s just not very physically affectionate. He knows that what he said wasn’t true, and he said that to hurt his wife. There’s plenty of families who aren’t “huggers” but are still loving families.", "> will regret the manor in which we did it\n\n&#x200B;\n\nI mean, if you can afford a whole manor, a few therapy sessions should fit the budget. =)", "I'm not saying y'all are abused but that boundary is very common and normal in a lot of other family.", "There's an underlying insinuation implied when a man showing affection to children is described as weird.", "How could OP have possibly explained it to the step daughter? I can’t think of any way. Myself I would have just told her that her mom asked me not to cuddle her anymore and that that is her mothers decision to make. I definitely wouldn’t have said “blame your mother” , but if anyone has a responsibility to explain why he can’t cuddle with her anymore, it’s the person who made that decision", "So the OP should have said no i cant hug you or treat you like my own daughters because that is soo much better. Its not the OP's job to explain the mother's decision. She should have talked to her daughter after OP so OP would never be in a situation like this because  the mom made this boundry. She needs to deal with it the OP just needs to respect it and he did.", "You still didn’t answer the question. How was OP to explain it to the step daughter??? What was the right way??", "Spending 3 years with someone is not “suddenly”.", "I think you missed the part where the step-daughter asked him to show her physical affection like he does to his own daughters because she was feeling left out. It wasn’t like the dad just decided out of nowhere on his own to start cuddling with her.", "Funny how you draw the conclusion that it's weird, while simultaneously pointing out they got married when Meg still wasn't even at the age when most kids start forming permanent memories (5). They were also probably dating for while and had met each other's kids before deciding to get married. \n\nThat means OP has been Meg's primary father figure for the majority of her life. And you think it's weird she asked him for cuddles? I think it would be weird if she didn't.", "Also all the your daughter my daughters. That bothers me. You married into a family, they aren't yours and mine anymore.", "It wasn't me, and I agree there's no tactful way to say he couldn't cuddle with her any more. However, saying, \"Your mom said I couldn't hug you any more, *so blame her*,\" was an AH move. He could have stopped before those last three words. Or he could have said, \"so you need to talk to her.\"", "[removed]", "Tell her let's go ask her mom. Pretty simple. I also agree he's an AH.", "Okay dial it back about 20%", "Then why marry?  No seriously answer the question?", "Men who abuse young girls aren't typically affectionate with them in public and discussing it with the child's mother. \n\nAnd they certainly aren't directing the child to go talk to her mother about it.", "The word \"potential\" makes this statement incredibly meaningless. Every person is a potential abuser, every person is a potential murderer, every person is a potential murder victim. This means absolutely nothing.", "All ~~men~~ people are potential abusers.\n\nThere, ftfy. I guess we just avoid everyone now.", "Oh fuck right off", "Found the straight up AH in the comments", "You’re an asshole. \n\nI was diddled as a kid by a man, and I still think you’re an asshole for acting as if men are unable to show affection towards children, because of “potential” abuse. \n\nIf you believe your husband will assault your child, to the point where you’re not even allowing him to hug her, you need to divorce, and get therapy. It’s absolutely not normal to treat all of the men in your life like a ticking time bomb.", "If that level of risk is alarming to someone, the appropriate option is not to have children with a man.", "The problem is that the cost of this rule is too great, because it's come at the cost of making Meg feel unloved by OP. Perhaps a better rule would be that none of OP and Meg's interactions should be kept \"secret\" from Kate. And for Kate to privately ask Meg how she feels and ensure that she never feels obligated to give physical affection.", "What a ridiculous thing to say. If all men have the potential then so do women.", "By that logic, all people who hug are potential abusers, regardless of gender.", "All women are potential abusers, too. Should the husband keep his wife from ever touching his daughters?\n\n&#x200B;\n\nGTFO here with that misandrist bull.", "Get bent.", "I think you’re reading way too much into that. What was he supposed to say? Lie to Meg when she asked? The reason why he won’t be affectionate with her is literally because her mother said so. I don’t understand what he was supposed to say if not the truth. You’re taking it in a weird place, nowhere did OP said there was secret cuddle times. You’re sexualizing something that isn’t sexual. Your mind is in a very weird place. Trust me I understand being cautious, I was sexually abused as a child. But literally just wanting cuddles and hugs from your father is not sexual and it’s really weird to make it sexual\n\nIf anything mom is making the wedge by sexualizing her daughter and husband for no reason. She literally said no, that’s all dad said. He told Meg the truth\n\nIt’s so sad literal children can’t be affectionate with their parents without people making it sexual. She’s just a little girl that wants affection and love", "The mother deliberately created a wedge between OP and his stepdaughter. She *is* the reason Meg can’t have the loving hugs and cuddles.", "“But first, let me post it online and leave a trail of evidence” lol you are not well", "Projecting much?", "Are you actually serious right now? \n\nSeems like serious projection on your behalf. \n\nAs a stepparent who hugs and kisses and cuddles her stepkids constantly, you have some serious issues if you automatically go to that line of thinking.\n\nMy YOUNGEST stepchild is 17. I've been with their Dad for 13 years and I have ALWAYS been the cuddly one. It doesn't mean I'm engaging in anything untoward at all, just showing love. \n\nOh- and the kids mother is not the cuddly type. So does that mean I'm luring them by being affectionate?\n\nAffection is affection, stop making it into something gross.", "Go to therapy", "You're sick and you need to stop.", "I cuddle my son and he’s 12, I can’t see that stopping anytime soon. Same thing for my daughters with my husband (and me) They’re my kids, cuddling them is completely normal and loving for our family", "Can really have a full on decision of what is going on here by 3 paragraphs ? It's everyone opinions here. We don't have the moms pov . It's half the story anyway.", "Agreed. Telling a man that how he shows affection with minors is weird is weighted with a lot heavier subtext than if you say the exact same words to, for instance, the unmarried aunt.  \n\n\nI don't know if it's exactly \"fighting words,\" but it is a dangerous accusation, and blowing up about it is not an unreasonable reaction.", "I definitely would have gone with some version of, \"I'm sorry, but I'm not allowed to do that with you anymore.\" But why?? \"Because your mom said so.\"  \n\n\nI just don't know any other way to be square with the kid.", "He spent 3 years *not* hugging and cuddling her. At age 7, he started with no explanation to her mother despite knowing the way he was with his own daughters made her uncomfortable. It's fcking creepy without a proper explanation.", "And even if we took that as the case, then it should be Mom explaining the affection rules, not stepdad", "wife is toxic and needs some serious help.  She has a good situation she is destroying.", "[removed]", "Bad bot", "Well I’m generally of the opinion that parents shouldn’t remarry, especially mothers, since it significantly heightens the risk of abuse for the children, but if people are going to, they need to be vigilant. \n\nThat this parent equates love to physical acts is concerning.", "She's against him showing love for his own daughters. Who seem to be very happy about it. It's not only her daughter. And if she's worried about him being a abuser, then she shouldn't be there to begin with.", "This, exactly.", "Men are statistically more likely than other people to be sexual abusers of children. And step parents are the most common abusers.", "He’s not Meg’s parent. And he could have talked to his wife about boundaries and they could have had the conversation together. He also didn’t need to add “blame her” onto the end of his discussion. \n\nI mean a respectful step parent would have asked his wife before engaging in physical affection with her daughter that he knew his wife was not comfortable with. He’s stomping all over her boundaries and dividing his wife and step child.", "Just goes along with the ESH.", "Ew, bad bot", "Wow, sexualization of minors is literally one of the report categories. If you were joking, that's poor taste", "What do you think parents are demonstrating when they hug and cuddle their children if not love? \n\nIt’s not the only way to show love to a child but it certainly is one of the more tangible ones.", "No, no, no. You back to the dark Tumblr corner. None of that here.", "Children need physical affection. Withholding physical affection is detrimental to their development. \n\nPhysical touch is often cited as one of the main types of love languages. \n\nhttps://cedarskids.org/news/news.html/article/2021/08/11/hold-me-close-physical-touch-and-brain-development\n\nhttps://www.betterhelp.com/advice/love/what-is-the-physical-touch-love-language/", "No, no, no. You back to the dark Tumblr corner. None of that here.", "Wooooowwww talk about judgemental. \n\nSo especially mothers shouldn't remarry? So fuck falling in love, building a life, etc yeah?", "Are you bored at home and decided to intentionally stir the pot? Your statements of him being an abuser has no grounds here. It's unfortunate you weren't hugged enough as a kid.", "I'm sorry you had a traumatic childhood, but please stop projecting.", "You have very heavy unresolved issues. I'm really sorry for whatever you've been thru.", "And women are statistically more likely to murder their child.\nDoesn't mean anything here, does it?", "If OPs wife is that concerned, she should never be with another man while she has children under 18.Telling them not to hug isn't going to stop a 'potential abuser'. Like, if you hate men so much don't be around them.", "Then why is she with him? If she's worried about him being an abuser, she shouldn't be with him at all. Pretty simple.", "He said they got married three years ago. And on average people date for at least a year, probably more, before getting married. With Meg only being 7, that means that OP has been acting as her father for the majority of her life, possibly the vast majority. And she obviously feels comfortable enough to ask him for cuddles, and wants him to treat her as his daughter. \n\nYou're just an asshole who believes (incorrectly) that step parents can't be real parents. In fact your insistence that OP is a predator is really creepy. If you're concerned that YOU have predatory tendencies just lurking below the surface, keep that to yourself, and don't project it onto other people.", "A respectful stepparent listens to the CHILD. \n\nThe CHILD sets their boundaries and holds their own autonomy. \n\nI didn't really care that my stepkids mother thought it was weird that I'm a cuddler, if the kids asked me for a cuddle, they can have all the cuddles they like. \n\nTheir consent matters most to me.", "Stop watching true crime videos and making weird assumptions about normal interactions. This makes YOU look really creepy.", "It sounds like he has been acting as a father figure for most of the child’s life, and the healthy thing to do is to allow the child to establish boundaries. The mom shouldn’t be telling the child that she can’t hug the man she’s known as her father for most of her life. They are married, have been together for years, he is likely the only father figure Meg has ever known. Children should get to set these boundaries, there is nothing inappropriate about hugging and there’s no reason to think while you would need to ask mom‘s permission to hug your child. Not allowing Meg to decide for herself is just teaching her that she doesn’t have any control over her own body, which is an incredibly unhealthy thing to teach a girl. Her body her choice", "It definitely is within her right to draw that boundary. And he respected that boundary. And she got upset with the consequences of that. Now I’m personally leaning toward ESH because what he said to her was wayyyy out of line but like…. The way y’all are weirdly sexualizing father/daughter affection screams projection. His daughters don’t mind and he doesn’t mind so that’s all there is to say about it.", "Except, no.\n\n it's not HER boundary to draw, it's her daughter's and she specifically asked for physical affection... I bet she would want it from her mom as well...", "You’re almost there. \n\nOf course hugging and kissing is one way. OP believes it is the only way.", "Hey now most people on tumblr would call them an idiot too 😔", "Fuck your condescension.", "YTA. Just bc some ppl don’t cuddle their teenage daughters doesn’t mean they aren’t good parents. You don’t get to tell someone their parents didn’t love them just bc they were raised differently.", "When I was growing up, my parents were not very affectionate with me and my siblings. We never thought anything of it because we didn’t know anything different. Then I went to an arts college and the friends I made were really affectionate. There was a lot if hugging. And at first I was very put off by it. But after a time, I started hugging back. And then, when I saw my parents, I started hugging them. And at first, they were awkward, but over time, they started hugging me back. And us siblings started hugging each other too. I write all this because I understand how weird it can be to experience affection when you have not known it. \n\nIt’s concerning that Kate has so much discomfort with affection. After 3 years, surely she must know that this is how you show love—you must be affectionate with Kate, right? \n\nWhat happened with Meg deserved a family conversation.  Meg wants affection, Meg should get affection. Kate needs to unpack what her deal is. \n\nBut you, OP, are the AH, for telling Meg it’s her mother’s fault—it is not her fault for sticking to what she knows, understands and is comfortable with. \n\nYou are also the AH for telling your wife her parents didn’t love her enough. My parents loved me, but they didn’t know how to show affection. They weren’t taught that. They modeled what they knew from their parents. Until I showed them different. Then they changed. \n\nBut that’s all to say, ESH. Kate has seen affection as an example of love and has not warmed up to it. She has recoiled, and even denied her own daughter affection. That’s concerning to me. So she’s kinda an AH too. I wonder what Kate experienced to make her think that physical affection is wrong.\n\nVerdict: ESH", "Esh. Your stepdaughter is craving love and affection and how wonderful that she expressed to you that she want to get treated the same as your other daughters. That took a lot of courage for her at 7 to communicate with you...and it shows the trust and love she has in you. Thats such a good good good thing! Your wife should be happy! But instead her  discomfort and issues are depriving her daughter of a healthy loving relationship and it may foster some serious intimacy issues as she gets older where she looks in the wrong places for validation.\nYour wife needs to listen to her daughters needs and what her daughter wants instead of complaining about it being weird. She needs to get some serious therapy to sort through her unhealthy views and stop projecting her attitude on you. Even if she never overcomes her personal aversion to being huggy and snuggly she should support your relationship with her child and encourage the bonding.\nAs far as your comment to your wife about her parents not loving her...slightly AHish but funny as fuck  and I would have said the same thing to make a point.", "Nta. Op blended family well while the wife didnt. He told the truth, stopped when asked to then wife is called out for treating her kid different by her own kid. She pushed the envelope with keep judging him and his daughter’s relationship like its wrong to hug and cuddle like its an inappropriate sexual behavior. Dont know what the wifes issue stem from but shes pushing it on her kid.", "Something about the way this is written creeps me out", "YTA. \n\n>Kate is a a great mom. Meg is well taken care of and shown tons of love, just not much physical affection.\n\n>I got pissed and I told her that it wasn’t my fault that her parents didn’t love her.\n\nMake up your damn mind. Either minimal or little affection can equal love or it doesn't. \n\nI also don't know too many 13 & 15 yr old girls cuddling with their dad all the time.", "It might not be anything to do with her parents. Speaking from personal experience… \n\nI can, looking back, remember the way my parents were hurt by my staunch rejection of physical affection. I didn’t even understand it at the time, I just hated being touched. \n\nIt took me a long time and a lot of work to recognize that it wasn’t natural to reject physical affection the way I did. I had known all along what happened to me, but I didn’t make the connection between being molested and hating to be held or cuddled. \n\nIf there’s damage like that in her past, it would easily explain her discomfort with what most healthy people consider to be normal displays of affection between family members. \n\nSo I make no judgment because it sounds like you’re trying to be a good stepfather. But don’t assume you know where someone’s pain comes from, no matter how well you know them.", "ESH. Her being weirded out by how you show affection to your own daughters and forbidding you from treated your stepdaughter the same way you treat your bio daughters sucks, it really does. But, You crossed a line by saying her parents didn’t love her and you also didn’t have to add “blame her” when you were explaining to Meg why you couldn’t hug her anymore. A simple “your mom asked me not to and I respect her wishes” would have suffice without making your stepdaughter angry at her mother.\n\nHowever it’s clear that Meg desires physical affection and her mother is obviously not giving it to her, and now she’s taking away the only other adult who WILL give it to her, and that’s a problem. I suggest you apologize to your wife for what you said and then have a talk with her about Meg’s needs and how to meet them, maybe even have a joint talk with Meg as well.", "ESH\n\nYour wife wasn’t shown physical affection and as a result, it makes her uncomfortable. It was very wrong of her to tell you that you can’t show love to your stepdaughter with physical affection since it’s clearly what she wants. That being said, not giving physical affection doesn’t mean someone doesn’t love. You were both wrong and need to have a conversation about how your stepdaughter wants to be shown physical affection and denying her that will make her feel less loved than your her half sisters. You also both need to apologize.", "YTA. I grew up in a family without much physical affection, but there’s no doubt my parents did/do love me. They show it over and over again in others ways.", "YTA - make sure you tell Meg being physically affectionate with somebody is not the only way to show love.", "YTA. Not all families show a lot of affection. That doesn't mean that there's no love. \n\nYou heavily emphasize that this is how you show love, but I think you forget that everyone is different. Your wife's feelings are just as valid as yours. Hurting her isn't going to make her more open to this.", "ESH. It's weird your wife took issue with this and tried to stop you from showing affection. But, everyone also shows love differently, and her not having as physically affectionate parents doesn't mean they didn't love her.", "NTA, OMG, it was a fight.  It happens when your married.  This is literally the definition of an emotional topic.  My ex and I (married 20 yrs, still friends) had a fight about once every couple of months.  My current wife and I (married 17 years, she is friends with ex and kids, holidays together with all) ague a lot less.  Sometimes, in the heat of the moment you lash out in an argument.  It's not that your being mean, it's just hard to fight fair when you get angry.\n\nI grew up in a bad situation (lots of abuse by both parents) and I can't remember ever being hugged or seeing my siblings being hugged as children.  I'm still uncomfortable with anyone, who is not close to me, hugging me.  Not sure why but I have been fine hugging both wives and I've always been very affectionate with my kids and grandkids.  I think I worked on changing and becoming affectionate because of the abuse I grew up with.\n\nThere are cultures, German for example (I'm 4th generation US citizen) that tend to be stoic and tend not to be physically affectionate (or so I've been told by older family members).  So it is not unreasonable that people can come from that type of background and the parents still love their kids.  I also know it's healthy and appropriate to be physically affectionate to your loved ones.  Calling out your wife like that won't help.  What you need to do is apologize and talk to her about getting marriage counseling to start with.  You both need to come together on this and it sounds like the two of you need to work on your communication.  This is common as healthy communication tends to be different for each couple.  In there you can start talking about being physically affectionate.  It may be she needs separate therapy or the couples counseling may handle it.  Good luck.", "Wow ok so yeah you're TA. She shouldn't have implied that it was weird but you telling Meg to blame her mother and saying her parents didn't love her was absolutely an asshole move. She could have gone through something or knew someone who went through something that makes her uncomfortable with it. She tried to discuss setting boundaries with you and THATS how you respond?\n\nYes you are absolutely an asshole.", "My mother in a nutshell with affection but I don’t yearn for her maternal affection lol", "ESH", "Esh. She needs therapy", "ESH. \n\nYou were right but come on, there was a better way of doing that without saying that.", "I wonder how things would be different if genders were reversed.", "NTA.  She took a really nasty shot at you, and you clapped back.  Hopefully she learned something.", "Definitely apologist for what you said it angry, but I’d reiterate that you’re not apologizing for loving your daughters.\n\nMy gf is really affectionate with her family.  She’ll always go for hugs, cuddles up to the eldest brother etc.\nThey’re really close.  How they show love.\n\nAbsolutely nothing wrong with it.\n\nIt’s how I show love too.\n\nYour wife was completely in the wrong telling you it’s weird.  \n\nHow is she right?  Because she did get that love and affection?  \n\nIt’s weird she didn’t get that from her family.\n\nTo me.  Cause I did.\n\nJust like she thinks it’s weird of you.\n\nNobody’s right.  It’s just how people are.", "Torn on this one but im leaning toward NTA -but you shouldn't have said her parents didn't love her ...People have different ways of showing love and affection and its fine if she is less keen on physical affection. What I think is sad though is that she won't allow her daughter to experience physical affection from you when she very clearly wants it... you were respectful and asked her before so I don't understand it .", "She is Insinuating that it's sexual. Was your wife abused.?", "YTA.", "The fact that you have to come HERE to find out that it’s inappropriate to say that to ANYONE (let alone your wife) just goes to show that you really may not know what love really is. WILLINGLY, INTENTIONALLY hurting someone is not a loving action, OP. \n\nYTA \n\nSolution: you treat all three of your girls the same way and let Kate treat all three of the girls the same way. You don’t have to show your love the same way. No set of parents ever do. And BTW-I think it’s weird too.", "NTA", "There’s hugging, and there’s creepy dad stepping over the line.", "NTA and neither is your wife. You both did say some things in heated moment but that's not our true self. Your wife should have asked your step daughter instead if she feels bad, should have taught her instead the difference between good touch and bad touch which is what I'm sure she was worried about in the first place.\nIn my opinion there is nothing you did. Your wife became weird because of her upbringing so can't totally blame her even though she is to be blamed a little.\n\nAll I think is you both should have discussed the whole thing before breaking a 7yo's heart saying that she can't be loved the way she wants.\n\nAlso physical affection is sooo important. You can't always do things silently and expect the child to know that they are loved.\nI hope you both resolve this issue like mature adults", "why is no one talking about how weird it is to be married to someone that is implying youre possibly predatory??", "NTA you're alright", "NTA\n\nI'm tired of hearing about these emotionally stunted parents taking their baggage out on their spouses.", "NTA. My mum grew up in a house without hugs and hated it so much that she swore to be affectionate with her own kids. I’m so glad she did cause growing up without affectionate touch would’ve been absolutely awful", "NTA. A child can never have enough love in their lives. This was an opportunity for her mother to change her own behavior and teach her daughter a different way to live. She told you to not show that affection to her daughter, she also should have talked to her daughter. She is the only AH in this.", "NTA. it may have been 'too far' to some but it was a moment of frustration, and she is quite literally framing affection with your daughters as some creepy perverted thing. thats weird and if she has some sort of problem she needs to deal with it on her own, not create distance in your relationship with your daughters. obviously everything should come with a compromise, but what does she want? she wants you to quit showing affection to your children in yalls own way because it makes her uncomfortable because she didn't experience it, well whoopsie daisy. she has the right to ask you not to do whatever with her daughter technically, and a 7 year old can't understand things properly so maybe different wording would have been better, but you were straight up with her and she would have blamed you otherwise. your wife should have explained to her daughter herself that she isn't allowed to hug her stepfather, (father figure as she's literally 7), anymore, that shouldn't have been on you and she's an AH. now she is upset with you after framing your relationship with your daughters as weird. she is weird. this relationship is weird. her weird ass needs to get to a therapist if she can't comprehend people being affectionate, just show her other peoples and cultures that kiss on the cheeks and forehead to show their love she would be shocked!!\n\nedit to add: now she's being a petty child straight up ignoring you after being a close minded AH, that is not how a marriage typically works, jfc", "NTA you’re right about all of it. That said your choice of words could have been more tactful, while likely true I’m sure what you said strung.", "NTA it’s like she’s accusing you of inappropriate contact, so you hit back with something equally hurtful. Additionally she’s put you in the awkward position of having to hurt a little girl’s feelings or withholding affection from your other kids. Healthy, affectionate relationships with father figures sets little girls up to grow into healthy,affectionate adult relationships. She’s not just hurting them short term but long term.", "NTA.  Everyone saying ESH isn't realising that this wasn't a one time; OP was probably fed up with his wife constantly berating him for showing affection to their children. While he could have handled it better, his reaction was simply an unfortunate response to her toxic behaviour. Physical affection is an integral part of the development of a child. Your wife needs therapy", ">Before anyone says it, Kate is a a great mom.\n\nShe's not though is she.\n\n>Meg is well taken care of and shown tons of love, just not much physical affection.\n\nThat's not the issue though. The problem is the issues she has caused when her daughter wanted the physical affection from someone else.", "ESH, look my family it's physically affectionate but I know that my siblings and my dad love me, they tell me, they show it in different ways. You don't have to be physical to show love. So telling her that her parents don't love her is major A H move.\n\nOn the other hand Kate telling you to stop showing affection to Meg is going to have a major detrimental affect on her mentally and in her adult relationships. On top of that small children need that reassurance that they are loved, to see you show that love to your kids but not her is only going to \"prove\" in her eyes that you don't love her. Kate is allowed to tell you to stop showing that affection to Kate, but that makes her an A H", "ESH. You were fine until you made that comment.", "ESH", "I don’t know about anyone being TA here, but you’re not necessarily correct. My family isn’t big on physical affection, but we love each other. We just don’t happen to show it in that manner.", "My mom isn’t big on affection. Took me as a person who does enjoy hugs and cuddles a while to understand. My mom will always have my back, fight for me and guide me when I need it. She just doesn’t do physical affection 🤷🏽‍♀️.", "ESH. Your wife has some issues with physicality... there may be a reason in her past, considering how over the top her response was.\n\nHowever, saying her parents didn't live her, and throwing her under", "YBTAs because u can’t take in each others approach to family affection", "YTA for telling your wife that terrible thing and also for telling her daughter to blame her, very manipulative. Nta for being affectionate but u need to have a long talk with your wife about boundaries and apologize.", "A combo of YTA and Kate sucks too.\n\nMy family isn't very physically affectionate, and that's fine with ALL of us. Heck, as a baby I'd scream if i was held for too long. As a child, i didn't like being hugged. We tell and show each other. Saying that your wife wasn't loved because her family wasn't physically affectionate is so rude and possibly horribly incorrect.\n\nI also find it a little uncomfortable to be around people who are very physically affectionate (though I acknowledge that has far more to do with a worry that they will want me to also be physically affectionate, which unfortunately is more often true than not).\n\nYour wife was wrong for how she handled it all, but perhaps there's a reason she hasn't shared (i.e. worry about her personal tactile boundaries being ignored or something). \n\nYou were just rude.", "Both are in the wrong. Your wife shouldn't try to dictate how affection is expressed, especially if it's obvious enough that her daughter starts doubting if her stepdad loves her as much as her step sisters. And ofc, OP, you shouldn't have told Meg to blame her mom then told your wife that her parents didn't love her. \r  \n\r  \nTalk it out and nip the issue in the bud because this is something that will affect you and your step daughter's relationship in the long run.", "Was right along with you until you said that fatal line.  If you'd sa'd \" didn't show her much physical affection\" I'd still be with you.    But \"Your parents don't love you\" is such a hurtful way to say that she didn't grow up with a lot of platonic physical affectoion.\n\nGoing with ESH here.  Your wife needs to cool it and stop attachin inappropriate motives to you for engaging in ordinary platonic affection.  And you could just about tickle your tonsils with your toenails right about now.  \n\nLike it often goes with parenting, you both F'd up and the kid got caught in the crossfire, so you two need to figure out how to set things right again.", "ESH. Your affection with your daughters is completely normal and wonderful and your wife is wrong to call it weird just because it’s uncomfortable for her. But *knowing* that your wife is uncomfortable with it, you should have discussed Meg’s inquiry and request with her mom first. And you should have also talked about how to address it with Meg after your wife asked you to stop. And saying your wife’s parents didn’t love her was COMPLETELY out of line.", "YTA. You intentionally said a negative thing to your step child about her mom.  WTF? You told your wife her parents didn't love her? WTF?   You think his you demonstrate caring is by touching.  Touching can be extremely uncomfortable and painful for multiple reasons.  You should first consider that your feelings are not inherently right and others feelings are in inherently wrong when feelings are not identical.  And due the record,  many men feel its all fine because it's how you show affection.  But it's also how men show dominance and control.  Not cool,  Dude. You owe both your step daughter and your wife huge apologies!", "You crossed a bunch of lines. Not being very physically affectionate is not the same as lacking love, and if you want her to respect your family culture, you need to respect hers as well. There are a lot of reasons people aren't comfortable with physical affection, and you don't get to judge that. You also intentionally responded to Meg in the way that would piss her off most at her mom. You have a lot to apologize for, starting with your complete disrespect and lack of acceptance for your wife, who is absolutely right to be taking space from you, which she is probably using to reevaluate her marriage. YTA.", "She's a big AH for what she said about it being weird, but what you said was harsh and probably not true. I understand why you said it but I'd apologize and explain how hurtful what she said was to you.", "YTA. How dare you say something like that to her! You have no idea what great things her parents did in her life. They just didn't have a lot of physical affection in her family. Yeah, you're cuddly, but you are also really mean when you don't get your way. You said something awful to your stepdaughter, and something worse to your wife. She may be right to keep your hands off her child.", "ESH you guys have different backgrounds and life experience but get it together bc now a little girl is hurting and that hurt will carry into her adult life! When step child is in your home it should no longer a step anything but your child you treat like your own. Her mom needs to do what is right for her daughter. But you were right not to lie to her though, she needs the truth and knows you won’t lie to her at least that’s something.", "NTA", "ESH. Your wife was wrong (not for asking you to stop, but for calling it weird), but let me tell you why you were wrong too. In my family, my mother is more physically affectionate. She hugs and kisses me. My dad, on the other hand, hardly ever hugs me. Even when he does, it's just a side hug. That does not mean he doesn't love me, though. I know he does because there are other ways of showing love, not only physical affection. You were very wrong to say that your wife's parents didn't love her.            Edit: Added the part in brackets", "Cuddling with a 15 year old??? YTA. Telling your wife her parents didn’t love her? YTA. YTA YTA. You might be a creep.", "ESH\n\nWhen the two of you had this discussion about her wanting you to treat her daughter differently you should have discussed how you were going to communicate that to the kid, preferably together and in advance. The kid was always going to ask why things had changed and she was being treated differently, it was silly not to prepare for that. \nPlus that conversation might have unearthed what her issue is with it more specifically and with a bit of luck might have made it clear to her that the ‘hug your own kids but not mine’ stance wasn’t really viable. \n\nThe ‘your parents didn’t love you’ crack was completely unjustifiable. It’s either not true (some families just express their love in different ways, her parents might have been one of them) which makes it just a nasty dig, or it is true and you rubbed salt in a wound. Added to that you also implied that she doesn’t love her daughter - if you think her parents not being huggers means they didn’t love her, then by extension you think her not hugging her daughter means she doesn’t love her. \nIt seems like you made that comment just to hurt her. Congratulations, you succeeded. \n\nBut honestly I think the pair of you would be better off stopping worrying about who’s right and wrong and starting family therapy to work out how you’re going to parent your kids together as one family. The best time to have done that would have been before you joined your families together, the second best time is now.", "YTA. But soft. My family is a lot like Kates the year I was married my mom gave me two hugs and two kisses and that was a huge deal. I’m not huge on physical affection as a result. My husband’s family are middle eastern and SUPER physically affectionate. When I met his aunt she kissed me on the lips. They hand hold snuggle nuzzle kiss hug, the whole 9. It’s A LOT I’ve had to teach my mother I’m law I don’t like it but still let her get some hugs and kisses in. My kids all have their dads sense of affection and I feed into it. It something I’ve had to unlearn but it doesn’t mean I wasn’t loved. We were just different", "NTA.", "NTA or ESH - So, she can prevent her daughter from getting physical affection (while seeing her two step sisters getting said affection), and imply that your (perfectly normal and healthy) relationship with your daughters is gross, but you can't tell her something hurtful ONCE?\n\nSure, she's her daughter, but she's still a person as a whole. Not some doll Kate can choose to control or something. Yall are living together. It's simply selfish and cruel to prevent the kid from getting cuddles and hugs.", "That was an incredibly tactless response, and you hurt both daughter and wife. I really hope you exhibit a little more emotional maturity in other areas of your life. You sound exceptionally childish in this instance. \n\nDo a whole lot better in the future.", "NTA but maybe you and Meg can have your own way of showing affection like holding hands or something", "ESH   \n  \n...but I'd say I'm more on your side than your wife's. That being said, you should probably sit and reflect on whether or not you're reactionary in your communication because telling the kid to blame mom and telling your wife she wasn't loved both seem like you were upset and said some things that crossed the line.  \n   \nI don't really think you had a great option in explaining to a kid why they can't be treated the same way as their siblings but sitting them down with your wife to explain the situation on their level was probably better than sending them along as a messenger.  \n  \nLastly, her insinuating you're a creep for being affectionate to your daughters (step and bio) is just... wrong? She needs to seriously think about whether or not she sees you all as a family unit or not because it's pretty normal (and generally good) to hug, kiss, and cuddle your kids and generally not great to isolate a kid by treating them differently from their siblings.", "ESH this requires therapy", "Urgh. Yes you could have handled that better, and should not have said that, perhaps her parents showed it in different ways?? \n\nBut the fact that your wife also doesn't seem to understand that people show love in different ways and need to receive love in different ways is a Concern. (love languages) She's a grown adult, has she been living under a rock??\n\nAnd children need more obvious signs of love and affection than adults. She shouldn't be denying her daughter anything positive.\nBut like some other commenters, perhaps therapy might be useful, as this is clearly triggering for her.", "ESH I almost never say this but you as good a person as me.", "How did you two end up married? How did this not come up before..... The difference in your love languages? She thinks you're a preditor to her child, and you tell a kid your mom won't let me love you. ESH, please don't have a kid together, that would be the cherry on top of this emotional sh!t sundae.", "I'm concerned that OP's wife is afraid of him cuddling with all three girls, but can only control what happens with her bio daughter. \n\nIn any case, the wife needs to understand that physical affection with loved ones is healthy, comforting and great for strengthening the familial bond. \n\nI'm going with ESH here, because not only was the comment about her parents' love kinda harsh, but also may be entirely untrue! Overall, I think the wife is far worse. I hope her behavior doesn't leave the girls uncomfortable with Dad cuddles, since the problem is in her own head.", "ESH. What she demands of you is unreasonable, but your response was cruel and hurtful.", "YTA. You know that physical affection isn’t the only way to show love. You were mad at your wife and you said something mean.", "NTA - your wife should have had the conversation with Meg regarding the boundaries she had set on behalf of Meg, not you. Seems like a real AH move by Kate to throw that to you to deal with.", "So I’m going to be the minority here but YTA not for being affectionate but for assuming because you’re not shown physical affection that you’re not loved and especially for saying it to your wife. My dad loved me and I never felt he didn’t. He helped me feel equal and intelligent growing up. I would have loved for more physical affection and think it’s important for kids but he grew up in a different era and his family also wasn’t prone to show affection but he loved me. Now as an adult it was a little weird to me to see dads so affectionate with their daughters but I mess blessed to marry a wonderful man that shows me a lot of affection and I love it and I want our daughter to have that as well because it’s a beautiful thing but it took time for me to be comfortable with it. I wonder if you cuddle and show affection to your wife and if you’ve tried to understand her POV", "ESH. People are allowed to show love in different ways.", "ESH.\n\nYou crossed a line with your comment, yes, but Kate's been consistently crossing the line for a while with her comments on you being affectionate with your kids.\n\nFamily therapy? Someone to confirm that physical affection isn't 'weird' (or suspicious) in and of itself, in case Kate's objection is really her \"Something's off\" meter pinging at ordinary hugs?", "YTA for blaming your wife to your step and saying her parents didn’t love her was the worst way to put it. Of course you can’t be to careful with other people  around your kids, maybe if the 3 of you sat down and explained to your wife that since step is 15 and knows what a bad touch is, both of you can tell her nothing is making her uncomfortable by your hugs or snuggles  alone or with others around , she is just being and feeling just as loved as her half sisters are from the same person. Obviously if mom says no, that’s that. I hope she doesn’t, because she’s lucky her daughter doesn’t hate you like most steps do!", "YTA. You obviously should have spoken to Kate as soon as Meg came to you looking for physical affection. I say \"obviously\" because Kate expressed discomfort with you cuddling, kissing, etc. You knew it was an issue. You chose not to address it.", "NTA\n\ni hug my daughter too", "Honestly idk but I’m leaning slight NTA I feel so bad for that kid who is begging for affection and being rejected. It really hurts.", "NTA.  Totally Norma to act that way with your kids.  She could benefit from therapy.  Poor Meg.", "I am a survivor of childhood sexual trauma. Honestly, it would not surprise me to hear that kate was also because her responses are framed like mine would be. \n\nIt's normal for people to have cuddles  and hugs in families, A lot of the grown man touching children makes me hyper vigilant. It doesn't mean anybody's bad. It means I have PTSD and it's not been dealt with completely yet.\n\nWhere I differ from kate is, I freely admit that's my problem, not the man's, not the kids. But i've also had a metric butt ton of counseling to get me to that point. And it doesn't sound like Kate's even admitted she has anything to work on yet.\n\nVoid of evidence of actual abuse, it is never okay to tell somebody their parents don't love them. It is not okay to tell a seven year old your mom won't let me blame her. \n\nYou couldn't easily have said, It made your mom uncomfortable, but I bet she would like a cuddle.", "ESH. Your behaviour with your kids doesn't sound like anything out of the ordinary.  But you both handled the situatuon with Meg poorly.  Are you and Kate unable to discuss an issue better than that?", "Yeah, families show affection in different ways. I grew up in a family that verbally says \"I love you\" a lot, so i say those words (and mean them!) very freely. My partner's family showed their love in other ways, mostly actions, and didn't often verbalize \"i love you\"s. At first, he found my frequent \"i love you\"s cloying and disingenuous. I imagine OP's wife is feeling a similar dissonance. Hopefully with some communication they can get on the same page the way my partner and I now have.", "Op needs to go to family therapy with his wife and stepdaughter.\n\nThat way they can all discuss how they feel about physical affection with a professional who can mediate and validate everyone's feelings and come up with some healthy guidelines and boundaries, while maybe also arranging some one-on-one therapy with the wife to help her deal with her issues around this subject.", "Except, the stepdaughter clearly wants the physical affection. I find it weird the mother is being adamant about this when her daughter has expressed how much she enjoys it. I'm 29 and cuddle my stepdad on occasion when we watch TV, and we hug and kiss on the cheek to greet each other and say goodbye.", "The photo my dad shares on my sister's (his step daughter) birthday every year is him picking her up and giving her a big smooch on the cheek (she was like 16 in this picture). Every kid deserves affection if they want it, even if it comes from a step parent \nEdit: spelling", "I agree ESH. Except for the kids.", "It’s also possible that wife has some trauma from a father figure in her life that is contributing to her discomfort", "In the same boat as you! I married into a hugging/touchy feely family and my husband married into a family that isn’t touchy feely but shows love and support in other ways. When we first began dating, it took a bit of getting used to when he would come up and randomly hug me. I would ask what was wrong and he would explain he just wanted to hug me. When I met my in laws for the first time, they immediately came in with the hugs which caught me off guard and I’ll admit, I was a terribly awkward hugger in the beginning! And it’s still a bit forced on my end whenever we all get together but it makes them happy so I go with it. \n\nWhen my husband met my parents for the first time, no hugs lol and he thought they hated him! For the first year together he was convinced my parents hated him but I had to point out to him all the different ways they were showing they cared for him. I pointed out that my mom sending him back to school (we were in college at the time) with a backseat full of groceries and home cooked food was her way of showing him love. And I pointed out that my dad fixing up his car for him and sharing advice was his way of showing his love. \n\nWe come from different cultures so it took some adjusting on both our ends to get used to how each of us and our families show love. It’s been a bit infuriating reading the comments saying that lacking physical affection is abuse so thank you for your comment!", "Honestly, when I see stories about moms being wildly uncomfortable about male family members interactions with daughters/female relatives, my alarm bells go off because there's decent amount of those same stories where wouldn't you know-- Mom was abused or molested by a male family member, and it's *her* trauma coming out in fear for her daughters. \n\n\nObviously, this doesn't mean OP has done anything wrong but it's a situation to tread carefully with and one that should probably be dealt in family therapy so Mom can also get some support for her feelings, and Dad can have better language then saying \"your parents don't love you\" because... Yeesh.\n\n\nI really hope she doesn't have a trauma background, because I'm not sure you could come back from that one.", "> she should have talked to you before being so reactionary\n\nShe DID talk to OP, that was her reaction. To talk to OP about how his way of showing affection made her uncomfortable. That's the most appropriate course of action she could take, and it's not unfair of her to say \"this makes me feel weird\" even if she's weird for feeling that way.", "Yeah, I’m really disturbed by all the replies calling OP the asshole for ‘not respecting Kate’s boundaries’. He isn’t a random stranger, he’s Meg’s stepdad. I don’t think it’s healthy for Kate to ‘set boundaries’ on totally normal familial affection that her daughter has actively expressed interest in. Kate doesn’t have to be a touchy person, but she shouldn’t keep Meg from seeking out appropriate physical affection within appropriate relationships. That has the potential to do such huge damage to Meg and the entire family dynamic. The only excuse would be if she was genuinely concerned that OP will groom and abuse her daughter, in which case, holy SHIT she shouldn’t be anywhere near him in the first place!\n\nThat being said… OP handled it poorly. This should be a parental conversation / conflict and it was totally uncalled for to put Meg in the middle of it by telling her to blame her mom.", "Only one is hers, she's being weird about him cuddling his own children as well.", "> I’ve rarely heard such obviously manipulative nastiness\n\nHow would you tell the 7-year-old that her mother had forbidden him from hugging her? I cannot think of an honest way that wouldn't blame her.", "Nta Bro, there’s nothing wrong with the first comment, it’s the second one that he shouldn’t have made. He’s also not being manipulative by saying that her mother didn’t want him hugging her, that’s what she actually said. Good grief, way to make something out of nothing! The fact that people are upvoting you is baffling to me. There’s no manipulation going on here!", "Thank you. ESH? Really, reddit? \n\nHow TF is a parent an AH for setting boundaries around the physical interactions a grown adult has with their young child?\n\nAbsolutely E S H from the standpoint that these are two adults with prior marriages and children. They ought to know the important things to align on before marriage FFS. Good god, I feel for the children of these idiots. \n\nThe only thing that's *certain* here is that OP threw his wife under the bus to one of their children, then attacked her and her family in a heinous way because their way of expressing affection is different than OP's.\n\nWTF OP. I'm not saying this is an easy or clearcut situation, but I can't imagine a *universe* in which either my spouse or I made comments to our children that could turn them against the other. I can't imagine a universe where one of us would be so cruel to the other that we'd suggest they were unloved. That you have to ask whether your words make you an AH is shocking. \n\n**YTA**", "\"Different people express familial love differently\" the wife should be able to respect that to instead of making his relationship with his daughters all about her and how she feels and what she likes.", "So you are as touch starved as the wife and think that just because you are a certain way everyone else should be that way and they should act only that way around you to appease you?", "Lol, that's not an outlier, just because Americans are touch starved and make even the tiniest touch about sex doesn't mean it's the norm, thankfully.", "So in one short piece you say people have different boundaries and they have to be respected but also that only your boundaries matter and are the \"normal\" ones everybody should ideally adhere to. Don't reproduce, you sound like a freak, and will produce more freaks that by the time they turn 18 will try to overcompensate everything they didn't have with you, putting them ironically at more risk with all the stupid choices they will make.", "Definitely agree with you there.", "Still her child, still her choice. Do I agree with it? Not at all. But she does have the right to make that decision.", "That’s just the difference between speaking in anger and being calm and rational.", "Is it weird? He is literally here saying he thinks probably shouldn't have told his wife that...", "I do agree with you. I came from a very NOT affectionate family, and I can count the number of times my mom has said \"I love you\" on both hands. The number of times my dad has said \"I love you\" is zero. It sucks growing up in a family like that. However, it is not OP's choice to make. He is not Meg's parent. He has not adopted her. I think his wife is making a bad choice, but it is still her choice to make. And going behind his wife's back is going to make this worse, not better.", "I very much disagree. It’s the mother’s rule so the mother should get the blame.", "Nope! The truth bloody hurts, and he told Meg THE TRUTH! Kate can deal with it because she is making the issue here! And this is coming from someone who was molested and raped by my stepdad! \nOP is not in the wrong here AT ALL! Kate has issues and needs to seek therapy!", "I am not sure what you would tell the little girl. That sounds very tricky to me.", "Bro what should he have said? \"Nah gang you good off that\", \"I'd prefer not to hug you *proceeds to continue hugging the others*\" or \"Sorry, I don't want to hug you\" then continuing to hug the others?", "what exactly was he supposed to tell? He told the truth. His mother told him to stop being affectionate with her. Otherwise the 7 year old would blame herself.", ">OP, you and your wife need to clarify your love languages. She may not show love through touch and affection but other ways. You both need to understand that, but you went for the jugular by saying her parents didn't love her.\n\nExactly this! Not everyone is the touchy-feely type like OP, and that's fine. People can show love, care, affection in different ways and not just with constantly touching each other and that doesn't mean they love others less. \n\nThrough the whole post I got the impression that OP looks down on his wife and her parents for not doing a lot of physical affection, not being comfortable witnessing lot of / constant physical affection. What he said about her parents not loving her was a very low-blow and vile **and saying that OP also implied that she doesn't love her daughter either in OP's eyes just like her parents don't love her in OP's eyes because she is the same way about touching as her parents**. There are people who don't like to touch others a lot or to be touched by others a lot, not even family members, but they can still love them, and those people are not broken or less for having different preferences.\n\nWife should have handled better the situation and should have a talk with OP and her daughter about what her daughter wants, see if there's a solution that works for everyone, everyone is comfortable with and have a talk with her daughter about different ways of affection, that she is loved even if she is not constantly showed physical affection by everyone. ESH", "I don't think it's fair to say he's TA when she's shaming him & his daughters for having a different love language as well. He never should have said that to his wife, but she also shouldn't be attempting to make him & his daughters feel weird about theirs. ESH.", "Yes, they definitely need to read The Five Love Languages. And understand that while no affection might not have hurt Kate, Meg is being deprived of a very basic need and may not feel loved at all right now. Some people can't go through life without snuggles and growing up that way is extremely traumatic.", "She does actually. Meg is the wife's child, not OP's. There's no mention of adoption, and it seems likely that no adoption occurred given that OP refers to his daughters as step sisters. She DOES have the right to make decisions about what happens to her daughter. Do I agree with her decision? No. But she does have that right.", "Thank you.  I do see, appreciate and even enjoy physical contact with other adults occasionally.  It just feels awkward.  Have you ever seen the show the Good Doctor?  He is a very successful autistic medical doctor.  I have been asked if I am autistic before... once by another highly functioning autistic person.  Whatever, I am satisfied with life and I think my family is healthy and happy.", "you r in this whole thread Shaming on op\n\nSo you don't think that it's wrong wife is saying that op's relationship with his daughters is creepy ??? Or maybe misandrist mind just ignored that part?", "> Most kids are abused by a relative, \n\nI think you might have some paranoia issues.", "I'm saying this again\n\nStop watching porn and PLEASE seek therapy... You r in the entire thread..  wtf is wrong with you???? I just know u r projecting your own trauma here\n\nPlease SEEK THERAPY.. it's not  healthy", "Thank you, this is the only response I liked on this whole thread.", "He could have said \"can you talk to mom about this kiddo\" and left it at that. Leave it to the mom to make explanations. What is the mom has some previous trauma that has made her like this? This guy is being so thoroughly anti-empathetic its gross", "The question isn't about being touch starved as you say. The question is about what he told her. Now YTA", "I didn’t say he was an abuser. I said she would benefit from seeing a therapist to work out whatever she’s got going on before she passes it onto her own child. I’m not holding him accountable for her recovery.", "I disagree. I think at 7, a child can decide if they want to cuddle with their parent", "The thought came from somewhere", "He shouldn't even have thought it in the first place.\n\nBeing loved and being hugged are not the same things for a hell of a lot of people. \n\nIt's nasty and judgemental to imply that they are.", "Ok??? The thought came from somewhere", "True. If I were OP I'd say I understand you're not comfortable with lots of physical affection between parents and kids, can we ask Meg what she is comfortable with?\n\nI know Meg has been clear she wants affection but this question underlines the point that it should be MEG deciding what amount of physical affection SHE is comfortable with. But it doesn't throw it in the wife's face that she's not respecting her daughter's autonomy over her own body (since it's not hurting her or inappropriate).", "\"Your mom doesn't want me to hug/kiss you and I have to respect that. Her family showed love in a different way. She can explain it better if you want.\nIt doesn't mean I love you any less\"\n\nThat would have been better. Because that would take into consideration the kid and not just punishing his partner for a rule he doesn't agree with.", "[removed]", "Why is “I can’t hug you because your mother and her family aren’t comfortable with physical displays of affection” not tactful? I disagree he is the ah because he basically threw his wife under the bus and went nuclear on her family when there clearly was a better way of dealing with this. Both sides need better, more open communication here and maybe some family therapy. ESH apart from the kids maybe fits better here honestly as she judged the whole situation really unfairly as well.", "Not in the moment, at the very least.", "Yes Kate needs help. And a seven year old needs to be treated gently.", " Are you in favor of punishing small children for holding hands with or accepting hugs from small children of the opposite sex? What would you say that the age where a child is allowed to be the one who decides if they consent to, again, *non-sexual*, *non-romantic*, *non-inappropriate* physical contact is?", "Thanks everyone.  I wish all of you had a neighbor like Jan.  She is fantastic.", "Which would lead to the same outcome. She is 7 not dumb", "> He could have said, \"your mother doesn't think it's appropriate\" instead of literally, \"blame your mother.\"\n\nThose are the same.", "I mean they are definitely having issues", "Yeah that's not better. Mom needs to figure out why she thinks it's wrong. Also, her daughter is literally asking for physical affection. Are we just skipping that entirely?", "A 7 year old would ask what inappropriate means.", "Based on the OP, it may be creepy.", "I was very affectionate with my kids from birth to...well, they're grown now, but I still am. However, it's important to note this is also cultural. In the time and culture in which my mom grew up, babies were hugged and cuddled a lot, but older children were not. Mom said she felt very secure and very loved because her mother showed affection in many other ways. And Mom was affectionate with us kids, but it was deliberate and learned on her part. (And she was a wonderful mom. I miss her daily.)\n\nIt's true that babies need lots of cuddling and physical affection, but there are MANY cultures/countries where babies are cuddled, but children and adults are shown love in ways other than physical affection. It's not abusive, and those kids don't grow up damaged unless they have violent or negligent parents. It's merely a cultural norm. \n\nI agree that solitary confinement is pretty horrific, but that's because of the lack of human interaction, not the lack of physical affection. (It's not like all prisoners who aren't in solitary get hugs and smooches all the time.)", "You’re comparing someone not being hugged that much to SOLITARY CONFIEMENT😳🤯🤦🏾‍♀️.\n\nYou’re going the extreme with it. Obviously she was cared and loved for, but they just weren’t very physically affectionate. There’s more than one way to show love and affection beloved", "So what we have in OP’s post is that he was well aware that his wife did not feel comfortable with the level of physical affection he shared with his daughters. Kate’s daughter then comes to him wanting to experience the kind of affection OP is aware his wife finds discomfiting. He decides not to discuss the request from Kate’s daughter with his wife - the actual parent of Meg, and negotiate what boundaries she might feel comfortable with before engaging physically with Kate’s daughter in a manner he was aware made her uncomfortable. \n\nWhen she told him that she was not comfortable with this level of physical affection being directed to her daughter and asked him to stop, he relayed this to Meg in a way that suggests her mother doesn’t want her to feel loved or equal, and explicitly directed Kate’s daughter to blame Kate for this. \n\nHe then tells Kate that because she was upset at her clear boundaries being stomped all over, and then being set up as the mean, wicked witch stopping Meg from being loved, her own parents didn’t love her. He clearly has no respect whatsoever for his wife or her boundaries.", "https://newsroom.unsw.edu.au/news/social-affairs/new-research-shows-parents-are-major-producers-child-sexual-abuse-material-0", "Except that, by the OP's own admission, he isn't actually her parent. Again, I don't agree with the wife's choice, but it is her right to make that decision.", "Not necessarily? Sometimes people go for the jugular when they feel defensive, even though they don't actually think those things at all. He's a jerk here because he said something he knew would hurt his partner the most.\n\nThe way he speaks of his wife generally suggests he doesn't actually think that way, he was just lashing out because he felt accused of something inappropriate.\n\nAs an example, my brother once told me I was driving our parent into an early grave because of my disability. He doesn't actually think that, he said it because he knew it was what would hurt me the most in the moment. He apologized later because obviously it was a horrible thing to say and he *didn't* think it was the truth at all.", "I think that it's odd that y'all aren't wondering why the wife is so adamant that OP is the weird one. Maybe he is saying that cause she is basically hinting that something is wrong with him.", "OK??? Anger and frustration", "That’s what I always think when people say that the OP was nice or tactful or respectful or kind enough. They expect the OP to be able to come up with the perfect phrasing in the middle of a situation when put on the spot and often with tensions and emotions rising and yet they can’t even come up with an example from the comfort of behind their keyboard with all the time in the world to think it through before posting.", "Plus if he didn’t it would have meant lying to her which is worse. Mom is only mad bc she knows she was wrong and hurt her kid and can’t face it now", "Honestly the most tactful way I can think is to be fully honest and say moms family wasn’t as affectionate and so it makes her uncomfortable. But that’s still gonna put blame on her. The reality is this needed to be a conversation between all parties. Communication!", "Its funny how people are quick to offer their opinions and render judgment, but not many can back up their comment with logic. They probably have no idea how to approach this in practice, only in theory.", "True and I honestly CANT THINK of a rational excuse, especially as I agree that wife needs therapy because her reaction to hugging is just NOT NORMAL. However parenting 101: you don't bad mouth your partner to your kids. This is definitely an ESH situation and I feel really bad for those girls.", "I'm at a total loss", "I didn’t, I don’t know if there’s a tactful way to do this, but I *would* suggest that when op has to revisit this discussion (he will) he replace “so blame her” with “but I still love you just the same,” which will be far more reassuring to the kid than trying to navigate parental blame scenarios.", "Exactly this. She's given her consent for SD when he asked to hug her in a convo that looks like Meg started", "Nice communication skills.", "This 100%, it is the most thoughtful, loving and respectful way. Also if mom feels uncomfortable with the affection then his reaction to her daughter has only made it worse. If she had a werid feeling in her gut about it I'm sure that feeling has now multipled.", "Mom is quite abusive here. He basically have to tell the little girl that I am going to treat you differently because of \"respect\" of mom's abusive behaviour...So she gets respect and his daughters get the cuddles. Pretty shitty scenario.", "You can't adopt your stepchild if both birth parents are still in the child's life. The other parent would have to terminate their parental rights first. But you should still absolutely consider your stepchild family.", "Bye the wife is not being abusive dial it way back", "Not remotely. But as I've said elsewhere, as a person who gets asked by children for hugs all the time (grade 2 teacher), giving physical affection to a child whose parent hasn't consented to it is a BAD idea. Especially since his wife already (though wrongly), has already said that she thinks it's weird. His wife is in the wrong, but if he keeps pushing he could end up on the bad side of a divorce and a sex offender registry. He needs to be very careful here.\n\nAnd I'm not getting into the age thing because Meg is SEVEN. He needs to go to therapy with his wife so that they can get this all sorted out looooooong before Meg gets close to teenage-hood.", "Have you heard of being polite?", "So now he should tell her that what he was doing was inappropriate, which is not the case. Because then his affection with his daughter is inappropriate. He shouldn't lie to the kid to make mom feel better.", "The mom needs to get help, but literally telling a child, \"blame your mother\" is a great way to make any situation worse.", "At that point he can say, \"ask your mother.\" Using the literal word blame doesn't do anything good for anyone.", "It's kind of weird to blame this on Reddit in general when that person is heavily downvoted and almost no one agrees with them.", "True but touch starvation is a real thing. During the pandemic I lost my mind for lack of touch.", "I think his wife also has no respect for his relationship with his daughters, which she does by directly saying it's \"weird\" & implying it's sexual. Kate needs therapy, on her own, to unpack that.", "But just because that's how your family is doesn't mean everyone else has to be that way, and that's what the wife is all about, \"be like me or you're weird\"", "I think you missed the part where he got snippy and nasty with the mother instead of just telling her that. From *her* perspective (and literally any responsible adult without that piece of information) what he was doing looked sketchy. Especially because of the attitude and telling the child to literally blame her mother.", "*Meg* is not weird. This grown man's behavior around her is weird. He got *way* too defensive for someone who only has good intentions. You do not ignore an adult suddenly getting physical with a child after 3 years of living with them and *not* being physical. The mom was literally just being a responsible adult in checking into it.", "They've been married for 3 years, likely dating for a couple years before that.  He's been a parental figure in her life since she was a toddler and probably doesn't even remember a time before step-dad was in her life... He's not a biological parent, but he is in a parenting role.", "Yeah but he's a step parent, a trustworthy adult, not just some random guy in the street", "I mean I absolutely can understand him, everybody has to think about what his wife implied. Everybody would be defensive if someone accuses you of something that creepy and disgusting", "Lol wow, thanks for coming, bye 👋", "I think there’s room to say that someone was an AH while acknowledging that it would have been very hard to do better. I don’t know what OP should have said, but he still is an AH for it and should apologize. \n\nI want to be clear, I can’t think of a way for OP not to have been an AH here and that does suck. I don’t blame him at all but that doesn’t mean he shouldn’t apologize.", "Well apparently there is in that family. He's not allowed to treat his stepdaughter the same as his bio daughters.", "Apparently there are or he could keep hugging the little girl regardless of mom’s opinion.", "That's because the blame is on her.", "> Or he could have said, \"so you need to talk to her.\"\n\nThat is not functionally different from \"blame her\". There is no way he could somehow mention her as the cause for it without blaming her.", "But the mother did say that he couldn't hug her, so why lie?", "The mother did say that he can't do that... And the AH is op cause he was being truthful!?", "Oh I agree that the rule is not good! And if it is to be enforced it should've been explained by her preemptively. I was just answering the question as to how to explain it better without making her feel unloved on top of everything else.\n\nBut yes, there are worse things to teach a girl that that her mother can tell grown man not to touch her and they have to respect it.", "This should be stickied on the front of the sub.", "I am not sure what else to call a person who tries to control and criticise the amount of affection someone shows his own kids and the kids he cares for.\n\nThis is why I say borderline.  I am not sure.  What I do know is that trying to control and make someone feel bad for caring for and showing affection for their kids is disgusting.", "Mom should have handled it. She put dad in a bad spot.", "https://newsroom.unsw.edu.au/news/social-affairs/new-research-shows-parents-are-major-producers-child-sexual-abuse-material-0", "I've never seen a social media platform in which the members hate each other as much as Reddit lol", "Yeah exactly. This sub is usually about 98% assumptions most of the time. Drives me a little nuts.", "Where did she imply that it’s sexual?", "happy cake day!", "I didn’t miss that part and I agree he’s the a-hole for how he communicated about it. But it’s not “weird af” for him to cuddle with his 7 yo step-daughter who he has known since she was a toddler and who asked him for snuggles. The mom is also an a-hole for how she communicated (apparently by not talking to her daughter about it at all)", "It's normal for a man to snuggle with a child he is raising. And yes the mom should check into it and make sure the child is comfortable and not being pressured into it. But that's not what she did, she forbade it despite it being Meg's request. She then got unreasonably mad at OP for telling Meg the truth, so while not preferable, it's most certainly not weird that OP responded in kind.", "OP doesn’t even say that. He just said that he and Meg developed a relationship which could’ve developed over the years.", "I'm aware, I read the post too. I've also made it pretty clear that that I disagree with the wife's choice. However, Meg is her daughter and it is her choice. I think it's an unfortunate one that will lead to resentment between the whole family. But it is still his wife's choice to make, not his. He is a parental figure but he is still not actually Meg's parent.", "She's still made it pretty clear that she doesn't want him to treat Meg like he treats his daughters. Which is her right to do so.", "I grew up in a family that verbally says?", "Yup. Here is a guy that loves his step daughter and is willing to treat her the same way as his bio daughters but that isn't good enough for the wife because it's \"weird\" to show affection. She needs therapy before she loses the best thing to happen for her daughter.", "It is functionally different. One is suggesting talking, the other is suggesting blaming.", "But actually saying \"blame her\" is worse than saying \"so you should talk to her\".", "\"disgusting\" \n\n\"abusive\"\n\nAre you serious? Or just addicted to hyperbole?", "Yes, that is terrible, but OP went too far when he told Meg to \"blame\" her mother, and when he told his wife that her parents didn't love her. Hence ESH.", "> That this parent equates love to physical acts is concerning.\n\nWhat an incredibly sad statement.", "Why is it her right tho? Isn't Meg her own person?", "yeah.  in this case somewhat hyperbolic.\n\nThe reason is that blending families is  hard.  In this case she has hit the jackpot and she is ruining it for her partner and daughter.\n\nBut yeah. its absolutely hyperbole here to make a point about how so many kids dont have stable or loving lives.  It is even worse when parents separate or blend families.  In this case the daughter and the mom could have a great situation but she is ruining it.\n\nYou are right though.  Its hyperbole.  It isnt reasonable to call her abusive just yet, but I think if she ruins this situation, she is an idiot.", "In fact, preventing her from having a loving father figure who shows her *good* masculinity may mean she gets into relationships with men who treat her badly. It's setting her up to have disaster relationships in the future.", "Sounds like the only reasonable thing to do is send em to a foster home then", "> Of course hugging and kissing is one way. OP believes it is the only way.\n\nNothing written here indicates that \"OP believes it is the only way\"."]}