{"id": 14307, "submission_id": "12fuf7o", "title": "AITA for not going to my younger daughter’s dance recital to take care of my oldest daughter", "selftext": "I (m39) have a daughter (f15) with my ex girlfriend. She passed away when out daughter was 10 so she lives with me full time.\n\nI have been with my wife (f37)  for 9 years (married for 5) we have boy/ girl twins who are 4.  Both of the twins are really attached to me they love to follow me around and just spend time with me. \n\nOkay, so my oldest has a chronic \n autoimmune disease that affects several parts of her body including her joints. She plays soccer despite her joint pain (is recommended by her doctors to stay active). But sometimes she deals with a flair-up after working out or playing soccer. Yesterday after she had soccer practice I could tell something was off she looked like she was in a lot of pain. It got to the point she was having a difficult time even walking despite using things we have to help manage her pain. My younger daughter had a dance recital that night and my oldest was still in a lot of pain and having a hard time walking. So I made the choice to stay home with my oldest to make sure she was okay. I later got a text from my wife calling me an AH for not coming to my youngest dance recital and when she realize I wasn't there she didn't want to dance anymore and my oldest is old enough and knows her pain well enough I could have came instead of staying home. My wife is so upset she's staying at her mom’s so AITA?", "created_utc": 1680978843, "permalink": "/r/AmItheAsshole/comments/12fuf7o/aita_for_not_going_to_my_younger_daughters_dance/", "score": 1206, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I'm the asshole for not going to my youngest daughter's dance recital\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta...sometimes there are no right answers or the perfect choice. But that doesn't mske you the asshole.", "NTA. Even though your daughter is 15 and used to it, doesn't mean she won't need help doing something. Speaking as the oldest child who is often left alone when sick as early as 9 because my parents were working, it sucks handling it by myself lol.\n\nWhat's your wife doing during all that commotion? Did she not explain to your other daughter?", "NTA, your older daughter was in severe pain. She needed her parent. The younger child had a parent there to support her. I think your wife is insensitive to your older daughter's condition and shouldn't try to guilt trip you for being a good father. Severe pain because of a medical condition, trumps a 4 year old's dance recital with one parent there to support that child.", "Tough one.\n\nI feel like this is a lose lose situation. Either choice you made would've left you TA in someone's eyes. Leaving one child at home alone in severe pain or missing a dance recital leaving another child disappointed.\n\nIt's hard being a parent when you're left having to make difficult choices like this between multiple children.\n\nPersonally, I'm going with NTA. Although your younger daughter was obviously upset and disappointed you weren't there, your wife was there. The alternative would have left a child (even at 15, still a child) alone to cope in pain.", "NTA \n\nYour oldest needed you. What if she had collapsed on the floor in pain, hit her head, passed out, didn't have her phone with her or something? \n\nFour year olds don't understand a lot of things yet. I'm wondering how your wife explained your absence. Are you sure she told the youngest the truth in a nice way? Maybe it all stemmed from what she told them.\n\nEDIT:  Your wife is overreacting, imho. Sounds like there's other issues at play in your marriage. Could she be jealous of you giving your older daughter attention or accusing you of giving your daughter more attention than the twins?", "Info needed: how frequently does this happen and do you routinely stay with your teenager and skip the younger kids activities when she has non-hospitalization-requiring flares?\n\nIf this is a consistent pattern of behavior, I can see how this one event could be the proverbial straw that broke the camels back for your wife. Having a child with a chronic illness is incredibly challenging on the siblings and if your teen daughter is capable of self-managing pain flares it is important to split your time.\n\nIf this basically never happens, then NTA.", "NTA. A medical concern will trump over even a special event. You mentioned that she had difficulty walking and was still in pain despite trying things you used to do to manage pain. \n\nJust a question though, have there been similar instances wherein you have to miss your younger children’s events for your older one?", "NTA. Your baby (even though a teen) genuinely needed you. \nYour younger daughter’s “I don’t want to dance anymore” is 100% from shit your current wife has said to her.", "NTA - as a disabled person one of the worst things you can hear from someone who is supposed to care about you is \"you should be old enough/have lived with this long enough that it isn't that big of a deal to be by yourself.\" That's soul crushing, and it isn't how disability works. Sometimes you need to have someone there to make it through the flare ups. You're not an asshole for being by your girl's side. Your wife absolutely is.", "Honestly I don’t think anyone is the ass in my opinion. \nDo I think maybe your wife is overreacting a little yes but at the same time when your child is upset and crying because daddy didn’t show up when he said he would and your dealing with a hurt child it can bring out what I call mama bear my mom had it and if anyone hurt me oh she would be pissed. And they don’t really think rationally when wanting to protect their child from being hurt . The main issue I see here is that you said to your wife not your daughter that you might not be able to go but you never let her or your daughter know that you weren’t coming. You just didn’t show up. That’s not ok you didn’t even text her so that is also probably part of it. \n\nNow no you are not an ass for staying with your daughter who was in pain that is never going to make you the ass. But I do wonder if this happens more frequently like you not showing up to things for your other kids because of your daughter and that is where I’m not sure because for her to have this extreme of a reaction then either this happens more frequently then your are letting on and you hurt and disappoint your twins over your daughter more. But I don’t know cause I don’t know you I only know this small snippet of info and because it’s such a small snippet it also makes me wonder if your leaving alot out to make yourself look good. I see that all the time on Reddit. \n\nBut if it’s truly a non frequent occurrence and you don’t regularly ditch on your other kids for your oldest and this is the one of the only incidents like this in the 4 years since your twins were born then maybe something is wrong with your wife or she’s jealous of a kid or she’s just like off her rocker idk cause while yes typically a 15 year old in a small amount of pain is ok to leave home for a couple hours I don’t think a 15 with a medical condition whose in sever Pain and can barely walk should be left home alone. \n\nThere’s just a lot of factors I don’t know so based on the little info your definitely not the ass but I can’t say if your wife is fully without knowing the other info. I mean how is her relationship with your daughter? Also do you typically kinda keep them separate like the kids or something? ( not that you would again I don’t know you or her) but I have read on Reddit and just in general of people who have lost spouses or something can sometimes go to extremes like trying to either blend the family and make it like the deceased never existed and then there is the opposite where they try to persevere the memory so much that they keep a divide between the half siblings and the new spouse. \nThen there is the more in the middle which is preserving the memory and not forcing things on the kids. \nThere could be an irrational fear in her that you will always choose your eldest over her kids and that might be something she needs to work on in therapy idk my suggestion is to maybe once she’s calmed down try and have a talk with her cause if this is the first time she’s reacted like this she might be already feeling dumb about it and she might have just overreacted in the moment due to the youngest crying and refusing to preform since dad didn’t show up and so she just needed to cool down and then once she did maybe she realized how stupid it was and just is trying to figure out how to make it up to you or maybe she’s doubling down because she doesn’t want to admit that she was overreacting. \nWhatever the case may be I hope it works out for the best whatever that may be. \n\nAlso disclaimer my thought and opinions are based on my perspective and the info at hand. If provided new info or new perspectives then my advice thoughts and opinions are subject to change based on that new info.", "NTA Your older daughter was in so much pain she needed your full time help. Your wife should have understood that. But instead of understanding she wanted you to choose your younger daughter (her daughter) and the hell with the one who needed you more. Shame on her.", "NAH. \n\nA medical condition always trumps a dance recital. \n\nSometimes as a parent, you’ll have to make hard decisions and one of your children will inevitably end up upset. What matters here is making up for it and balancing - so, your eldest needs you often, but surely you and wife can alternate between who goes to support who and where from time to time. \n\nThe biggest issue here is your wife. How involved is she with your eldest and what is their relationship ?", "NTA - OP states that this was something not of the usual pain. What if 15yo tried to move and fell and broke something? I’m sure OP would have severe guilt if he had left her alone. Unfortunately 4yo had hurt feelings but it doesn’t mean OP can’t go to the next event. OP’s wife is being unfair with this situation.", "NTA. The older child needs support from a parent. She wants to feel loved and supported when she is not feeling well.\n\nI have another question that I think is related to this issue- What is the relationship between your oldest daughter and your wife? She is not her biological daughter. Any resentment there? If she felt the need to leave town, this seems to be a bigger issue than missing a recital.", "NTA, you have a child with an autoimmune disorder who needed care. Everyone with a smart phone is able to take photos l, record, and you could have FaceTimed when the youngest was doing her dance.", "NTA. That was a hard situation for you but I think you made the right choice.  I'm aideeyeing your wife though... how does she usually act towards your 15 year old? I'd be taking a second look because she seems to have no empathy towards here.", "NTA. The reality is when you have two kids with conflicting events/recitals/games or whatever, both parents can’t always be there. You’re not choosing one daughter over the other, but I have a feeling that’s how your wife sees it.", " NTA - You’re a Great dad, but you can’t cut yourself in 2 pieces. Yes, she knows the pain. But she’s still in pain, she needs help or just someone to be there so she doesn’t feel alone. And let’s be honest, when you’re 15 and your siblings are 4, it’s not that you’re pretty much always have to suck things up bc the younger ones come first. But you can’t just leave her alone at home in severe pain, who knows what could happen. And not just will she always be your child, but with fifteen she’s literally still a child. She needs her daddy in hard situations, just bc she’s much older doesn’t mean it’s ok to set her on last place to take care of.", "NTA\n\nA medical concern is more important than a dance recital. I would also say, if this isn't something that happens frequently, then your oldest will appreciate that you cared enough to stay with her whereas your younger won't remember \"that one time you missed a dance recital when she was 4\". Besides, your wife still went to the dance recital so your younger daughter still had someone there cheering her on. Oh also, she's overreacting massively.", "NTA- Holy macaroni, you wife is being a jerk! Your younger children have two parents available to them, your oldest has one. Medical issues should always take priority over extracurriculars. If the situation was flipped, would your wife have encouraged you to go to your oldest daughters soccer game while your younger children were in horrible physical pain and struggled to even walk? What if your daughter had fallen while trying to make it to the bathroom? Your wife’s reaction makes me concerned for how she treats your daughter when you aren’t around.", "NTA your older daughter is in severe pain and needs help to move around also your young daughter might forget about this or if she doesn’t she will understand it in time you could also make it up to her with a gift of some sort", "NTA. You oldest needed you, and your younger daughter had her mother with her. Your older daughter would have had no one. You did the best you could in the circumstances. A 15 year old girl is not old enough to be left alone when she is suffering from severe pain and unable to walk. You can make up missing a recital to a kid, you can’t make up for abandoning them when they’re in pain. Especially considering the 4 year old wasn’t alone, she had her mom. It’s kind of crazy your wife is pissed you didn’t leave a 15 year suffering an autoimmune flare up completely alone and thinks 15 is “old enough” to not need her parent. Missing a recital isn’t great, but ultimately is not the action that would have done the most harm in this situation.", "nta really no one is besides your wife in this instance because she didn’t explain or help your lil daughter and also belittled your older daughters illness", "NAH - there isn’t going to be a right answer here.\n\nBut at this point, your littlest daughter just knows that her events don’t warrant dad showing up, **and she’s too little to fully understand the why.** I don’t know how you fix/make that up, but surely that should be the focus.", "INFO: Is in a common occurrence that wife demands that you sacrifice stuff for 15 for the twins? Or is this a one time thing?", "NTA - this was one of those mostly lose/lose situations. And sure, your older daughter might have been okay on her own, but what if something out of the ordinary happened, and even if it doesn’t, she’d still probably rather have someone there. \n\nI do wonder how your wife explained to your younger daughter that you couldn’t come. Maybe have your younger daughter do the dance(s) for you at home and hype up how special you feel to get your own private show.", "NTA. Your wife was there gor your younger daughter. It would be inappropriate to leave 15 alone in that much pain. She doesn't have another patent to care for her.", "NTA \n\nI know a lot of people already said the same thing but I'll add my two cents anyway. Your daughter is 4. They get upset easily but the good thing is it's easy to make it up. Vs, like some people have brought up, the possibility of your eldest daughter getting herself hurt trying to get up to do something. It's a lose lose situation but I feel like choosing your 4 year old over the eldest would have been the worse choice. A teen will remember the only parent they have leaving them while they were at their worst vs a 4year old that still has another parent to be there at  a special event. Her childhood is just beginning. You'll have plenty of years to spend with her and hopefully more events to go to in the future. It was just bad timing. Your wife is TA here.", "Info: is this the first or just latest time you’ve missed out on family/kid events bc of your eldest? I’m curious bc your youngest daughter had a very strong reaction to you not being present…so it makes me wonder if this is not a first time thing to be put second. That they twins also follow you around makes me wonder if you don’t give them much attention so they try to make you give it. I just don’t know bc for me there’s not enough info about your family dynamics.", "A lot of people on here seem to think that the recital was completely inconsequential. Dancers work for months to prepare for them, and there is usually only a single performance. Several months is a pretty long time to a 4 year old. I’m not saying that a health crisis isn’t more important, but it’s unfair to downplay just how hurt the younger one is by having her dad not show to a very important (to her) event. No judgment, because the situation sucks, but please don’t dismiss feelings just because they come from a young person.", "NTA.", "info: does your daughter typically need help during a flair-up these days? was she still mobile despite the pain?", "Info: Did you talk to your oldest about if she feels she needs the help? It seems like you decided for her.", "Perhaps plan more effectively, could anyone have watched over her while you attended the recital.\n\nYou must watch the Mikhalia Peterson TedTalk video, your daughter sounds like she has something similar.\n\nAll the best.", "Yes, YTA.\n\nThe 15 year old is used to this issue enough, despite the pain, that she could have survived an hour or two by herself so you could show some support for her sister.\n\nIt's clear who the favourite is and your younger kids know it.\n\nIf they don't, it's not gonna be long before they catch on.", "YTA. Your daughter still plays soccer even through she has a disease that affect her. She is old enough to know that this will effect her and she is old enough to take care of herself. I feel bad for the little girl.", "YTA", "YTA. The oldest has dealt with this pain before. You could have made sure she was ok, let her know she could call you, and gone to the dance recital.", "YTA - your 15 year old daughter is old enough to be home alone for a handful of hours. Set her up on the couch with a drink, blankets and her painkillers and go be a parent to your other kids too.", "NAH\n\nBoth of them needed you.  Your youngest daughter will remember that you weren't there. I remember people not showing up at my dance recitals. It is like not going to a championship game. It hurt, and that was just extended family. \n\nYou need to find a balance because this will happen again and again. You are going to have to be there for your other daughter, or she will end up hating both of you.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (m39) have a daughter (f15) with my ex girlfriend. She passed away when out daughter was 10 so she lives with me full time.\n\nI have been with my wife (f37)  for 9 years (married for 5) we have boy/ girl twins who are 4.  Both of the twins are really attached to me they love to follow me around and just spend time with me. \n\nOkay, so my oldest has a chronic \n autoimmune disease that affects several parts of her body including her joints. She plays soccer despite her joint pain (is recommended by her doctors to stay active). But sometimes she deals with a flair-up after working out or playing soccer. Yesterday after she had soccer practice I could tell something was off she looked like she was in a lot of pain. It got to the point she was having a difficult time even walking despite using things we have to help manage her pain. My younger daughter had a dance recital that night and my oldest was still in a lot of pain and having a hard time walking. So I made the choice to stay home with my oldest to make sure she was okay. I later got a text from my wife calling me an AH for not coming to my youngest dance recital and when she realize I wasn't there she didn't want to dance anymore and my oldest is old enough and knows her pain well enough I could have came instead of staying home. My wife is so upset she's staying at her mom’s so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA! You had a kid struggling to walk. What happens if she collapses on the way to the bathroom and smacks her head on the way down? As you said, it's been 8 months since her last flare up. This is not normal circumstances. Sure she's 15, but even an adult who is unstable on their feet is supposed to have someone with them.", "Chronic pain is the kind of thing that people easily overlook. They forget the pain exists for the person in pain. They assume they're used to it. But no one wants to be left alone and in pain while everyone else goes on with their lives. That kind of isolation leaves people in pain PLUS lonely and depressed.\n\nGood for you for staying with your child. Your wife needs to understand that your daughter needs to be put first. \n\nNTA\n\nA question... do you think your wife created a situation where your younger kid didn't want to dance? I hope not. I hope she took a video, too. I mean, I would have told my younger kid that I'll be taking a video to show daddy after but that he's at home bc Older Kid is in pain.\n\nThat's how kids learn empathy and compassion. I have to say, I don't think your wife has shown enough of either.", "INFO: Did you inform your wife and by extension your younger daughter that you weren't going? It reads to me like you didn't, which for me pushes this closer to an uncool move.", "NTA", "If I had an award, it'd go to you, but here's my poor woman's gold. 🏅", "I don't know what she told my younger daughter, I did explain though earlier in through the day when I noticed my oldest wasn't feeling better at all I might not be able to go and I explained its because of oldest not feeling well", "This. I have 2 sisters, and we’re close enough in age that it was never feasible to have both parents at every game or performance for all of us. But we always had one of them there. That’s life as a sibling, and because your youngest is a twin, there are going to be LOTS of these instances in the future. Your youngest had her mother’s support, but your oldest needed you and needed support too. Everyone who needed a parent present had one, and that’s the best you can do.", "They rarely happen I think the last time this happened was around 8 months ago... She's frequently in pain but not this severe to the point she's having a hard time walking", "The older child is 15. And a **child** with a chronic condition. Even if she was 17, or 22, if her pain was high enough that she 1) needs help with her basic needs, 2) needs comfort from a parent, thats still going to be more important than a dance recital.\n\nEven if it is regular, you have to have different accommodations in that case.\n\nDo you really think it would be better to leave someone with a chronic illness home to suffer in pain alone???", "\"Big sister was sick and needed someone to take care of her. Remember when you were sick last month and Mommy stayed home to take care of you? You were probably really glad to have her taking care of you. Big sister was really glad to have Daddy taking care of her because she felt really bad.\"\n\nHard.", "My and my daughter mom’s parents all live far away it would have been short notice to ask a friend", "Oh? How often do these flare ups happen, since you know them personally?", "You mean the other children who actually already had a parent there so there was somebody to watch them, where as the 15 year old would of been home alone in agony and unable to walk", "She doesn't just have juvinal arthritis it's a lot more than that so don't just assume just because she has joint pain...it was a pain to the point she could barely walk she will be fine if it's her normal aches and pains but it was more serious then just that", "As someone with an autoimmune disorder causing pain, it's possible the reason your daughter is having flare-ups after exercising is that she's overdoing it a little bit. You may need to start tracking what she's doing at practices and workouts and when she's having flare-ups to see if there's a particular activity that's causing flare-ups or if there is a particular intensity causing flare-ups. You also could track things outside of practice because it may be something like she's okay with practice and working out when there's not other factors but when something else is in play like maybe the weather or allergies or lack of sleep or whatever else it is, that then causes a flare-up.\n\nI think NTA Just because I also was around that age when things got really bad for me with my health and I hated to be home alone unless all I could do was sleep, because when you're that age and you're in pain and you cannot fix it it's difficult to be alone.", "Explain to your wife or daughter? Regardless, sometimes 4 year olds are inconsolable no matter what you do. Maybe make up to her later?", "Does your wife care about your oldest daughter? Resent her? Do you think she'd have treated her own kid with the disregard she expects you to treat your child? This whole story reflects pretty poorly on your wife as a step-parent honestly.\n\nAll that said, for your 4 year old try to make it up to them. Explain that you really wanted to come but couldn't beacuse another kid was sick and you had to take care of them. And while you love to do the fun stuff like see your kids dance (so fun!) your number one job as a parent is to make sure your kids are safe and healthy. So taking care of a sick kid comes before other things you *want* to do like see a recital or even other things you need to do like go to work. And if four year old is ever hurt or sick, you and Mom will be there for them too. As parents you split the job and Mom got to go and you had to stay home, beacuse one parent needed to take care of \\[older daughter\\] so she wasn't alone. \n\nThen maybe set up a chance for her to dance for you in the living room? Make a little flyer with her, a background (can just be a sheet hung up or something), set up some chairs, play music and watch.\n\nThough honestly again, if one of your twins was in horrible pain I doubt your wife would be upset you'd cared for them. I'm very suspcious of your marriage at this point and I feel bad for your older daughter she has such a bad step-mom.", "[deleted]", "You should have explained it to her when you couldn’t.", "Yeah definitely not the AH then.", "I'm 30 with several chronic pain conditions. When I have bad flare-ups I still feel better when my mom comforts me and in general I can't stand having people around when I'm ill. Lately I developed a shit ton of neurological issues and am really glad for my mom comforting me. Now that MS is on the table I asked for hugs twice today. And I say that as someone who moved out at 18 and has been a latch key child. A 15 year old absolutely needs a parent, especially during a flare up of the severity that occurs only once or twice a year.", "It doesn't matter how often they happen.\n\nThe young kids are going to develop core memories of being ignored by their dad in favour of their sister. Their sister who is fifteen and needs to not be waited on hand and foot every second of every flare up. \n\nIt's not like they started 20 minutes before the dance recital. It's an auto-immune condition, it's obviously longterm.", "OP said in another comment she hasn't had a flare up in like 8 months. Probably just a bad day.", "Younger daughter had a parent at her recital. Older daughter also needed a parent, and wasnt well enough to go to a recital. Both chidren had needs, those needs conflicted, but there are two parents so you do the best you can.\n\nWhat is your suggestion that you think would have been better? \n\nOr do you think the disabled daughter should just deal on her own? Because you think its fine to let disabled folks struggle without their needs being met?", "I mean this situation isn't black and white as you knight think", "I'm not even convinced a 4 year old would remember 8 months ago. https://www.reddit.com/r/AmItheAsshole/comments/12fuf7o/comment/jfhgvc1/?utm\\_source=reddit&utm\\_medium=web2x&context=3", "It does, actually, when OP said the last flare was 8 months ago.\n\nSo like. Twice a year, at most, the older sister gets prioritized when she's in so much pain she can't walk? That's them constantly being ignored?\n\nI think perhaps you're being dramatic.", "Oh yeah if it's been 8 months absolutely! The way he worded it made it seem more often", "I didn't say op did anything wrong", "Never said it was I'm just saying I'm sure the daughter is used to this", "You're implying OP regularly puts his eldest ahead of his other children. You're implying he is in the wrong generally without any proof.", "So, I suspect is the oldest one. I had the auto-immune disease at same age and a flare up was pain and fever. But the step-mother felt she was old enough to cope with it on own. What else does she cope with when her father not around? The little girl is 4. Looks like she will always have at least one parent at her events. Can't say the same for the eldest.", "Nta.\n\nWould it be different if it was the twin sick? You need to get clarity from your wife. It is giving evil stepmother", "NTA\n\nI was dx with a chronic autoimmune disease that leaves me with a lot of pain in my early 20s. I'm now 42. Yes, I \"know\" my pain and am old enough to deal alone. But it's still nice to get support from family and friends when things are at their worst. I can't imagine anyone thinking 15 is \"old enough to deal\".", "YTA, if this story was from the other girls perspective everyone would be calling you out. Clearly this happens to your eldest a lot and there is not much you can really do about it, just give her some snacks and help her in front of the TV or computer or bed, whatever she likes, and be there for your youngest for once.", "What were you actually doing for your older daughter to comfort her?\n\nIf you just happened to be in the same house playing on your Xbox while your older daughter watched TV in her room, then you most certainly are the asshole (for using your daughter as an excuse to stay home and skip out on the dance recital)\n\nIf your Xbox remained powered off and you spent the entire time with your older daughter rubbing her aching joints, then you're not (a bad father or) an asshole.\n\nSo you tell us OP, are you the asshole?", "YTA. You could have been there for both girls. Your wife could have switched with you or grandma could have come and stayed with 15 for an hour while you showed up for your devastated 4 year old. \nAs a former gymnast and dancer living a lifelong battle with rheumatoid arthritis and Lupus, coping with violent flareups often and the mother of 2 girls, you absolutely could have done better here. This wasn't a violent flu or a car accident. This was chronic pain that you're both used to managing. I can't count how many recitals I couldn't stay for due to chronic pain but I always showed up for both my kids. You only showed up for one. If your wife was angry enough to stay at her mother's over this, that tells me you put the older first all the time. At 15, if I heard my 4 year old sister was refusing to dance, I would have insisted dad go for a short time. Compromise, not sacrifice.", "S5", "[deleted]", "Did you tell your wife and kid you weren’t going?\nCause you’re definitely not an arsehole for looking after your daughter.\n\nIf you didn’t say you weren’t going it was a bad call, but definitely not enough for your wife to have to stay away, that sounds like she has a different issue", "NTA When you have children you are often forced to prioritize. More than one child parents “divide and conquer”. You chose to stay with the child you felt needed you most.", "NTA. It’s one of those lose/lose situations. Ultimately it’s a 4 year olds dance recital vs a medical issue. My kid did dance. I remember what the recitals are like at that age. It’s not exactly swan lake… and yes your oldest is familiar with her condition but it doesn’t make it less painful or scary for her. You made the right call. Imagine had you left her home alone and she needed to use the washroom but was in too much pain? Your wife is being really cold towards your oldest.", "NTA.", "NTA; but your wife and other children feel emotionally neglected. I'd suggest some TLC for your personal relationships,", "NTA, she had issues walking.  It sounds like your wife is using your younger daughter as pawn to pull you away from your older daughter.  Unless there was just a handful of people in the audience there is no way she would not know you were not in the audience.  Most dance recitals are for multiple classes in an auditorium that the audience area is dimly lit.  You wife most likely made a few unkind comments about you not being there.  Talk with your older daughter, really talk.  As about how her stepmother treats her and her condition when you are not around.", "Nta she's 4. I would bet money I don't have that she would be thrilled to do her dance for you in the living room and then go out for ice cream.", "NTA\n OP mentions this kind of flare up only happens a couple times a year.", "NTA!! Wow! Where do I start? Your wife is out of line. She's TA. She needs to grow up!!\n\nYou did the right thing by staying with your daughter in case she needed anything. \n\nYour wife is acting very selfish and immature by \"going to mommies house to pout!\n\nSo sorry your oldest has such a nasty health problem!  hope she feels better!", "NTA.  Your younger daughter had a parent there to watch her recital and celebrate her. Being part of a family with multiple children mean you have to make tough choices. Thank you for taking care of your daughter when she was in such pain.", "NTA, it's a shame you couldn't go to the rehearsal, but looking after your other daughter with an autoimmune disorder is important and your wife was at the dance rehearsal, so it's not like the youngest had no one, and you can't slice yourself in 2 to be in both places", "NTA - but did your oldest ask you to stay with her? If she didn't and/or assured you that she would be fine then you should have gone to see your youngest dance, even if you only stayed just long enough to watch.", "NTA. You’re in a situation without a perfect solution. But your younger kid is 4, she’ll move on. I think you made the eighth choice helping your kid that is in pain, especially since you can do things like bring her food, water, etc. to help out. And your wife was with the youngest", "You're NTA, but your wife is. Her reaction to you not coming to the recital is disgusting to dismiss your older daughter needs. I feel like you did what was right to be there and support your oldest.", "NTA- your wife is over reacting", "NTA. That’s a tough one. You can’t be in two places at once.", "NTA\n\nYou can’t realistically be expected to leave one child to suffer severe pain alone (and if she was struggling to move as a result, possibly needing practical help as well) just to avoid disappointing another child. I’m sure you’d have loved to be there and hate disappointing your 4yo but it was a dance recital, not her college graduation or wedding, and you missed it for a good reason. \n\nSo often when someone has a chronic illness/chronic pain the people around them start treating their suffering as though it doesn’t matter because it’s frequent - like your wife did “she knows it well enough”. I don’t get why a person’s pain (let alone a child’s) is supposed to matter less because they suffer it a lot. \n\nI also wonder if it was one of the twins that was suffering this way, on a day when your eldest had a football match on, whether your wife would have a different perspective or would she say you should go and watch the match?", "This would be a great time to teach little sister that you cannot be at every single event.  Sometimes just Mom will be there, other times it may be just Dad.  Your youngest cannot always be the center of everything.", "NTA. You had two bad choices and picked the child who wouldn’t have otherwise had a parent at all.", "NTA, your oldest needed you and your youngest will have more recitals/events you can go to. Maybe take her out as an apology if you want to.", "I’m 37 and if had a medical issue my mom would still be there whether there’s anything else important going on or not. Since this isn’t a habit from your oldest daughter I say absolutely NTA. I do think your wife may be TA though. It sounds like she wants you to care about your children with her more than you care for your daughter from your ex.", "NTA for now, but if it keeps going you will be TA.\n\nHere on reddit we can reed a lot of histories where we can see the point of view of the child (that were abandoned) where the parents always have to take care of the sibling that have a health problem while they forgot about this child events (like sports events, recitals, etc).\n\nEverybody alredy knows the end, where the child that have been abandoned don't trust or wants to have a relationship with the parents, and the parents that thinks they did nothing wrong.\n\nPlease don't let it happen to you", "NTA. There wasn't a perfect answer or option here, but I applaud you for staying with your daughter, who was in pain and needed help. Maybe ask your youngest to do a personal performance for both you and your oldest daughter. Make a huge deal about it, maybe even get some cheap flowers to toss at her or a bouquet to give her after the \"finale.\" That way, both daughters are involved and receiving support and adoration.", "Dude even if you know your pain and know how to manage it it's so so lonely. Props to you for supporting your daughter when she's unwell because this is teaching her what to look for in relationships in the future. \n\nIt's really hard to live with a pain disorder and it's even harder when people around you make you feel like a burden. OR act like you should be ok missing out on everything and being left by yourself just BECAUSE you're in PAIN. Like now not only are you hurting but you specifically got left out and left behind because of the pain. No one looks after you because it starts to be expected. And it sucks because it doesn't make it any easier and quite often these types of disorders only get worse and harder to manage on your own. \n\nGood job. NTA", "Please try to fix this with your daughter and find a way to consistently show her that she is a priority.\n\nI'm the 2nd of 7 kids, and I was 4 when I internalized that I couldn't really rely on my mom. That there would always be someone else with a more urgent problem butting in on any time I had with her. One day, the last straw fell, and I guess our relationship was never the same again.\n\nPlease try not to let this happen.", "NTA. I’m alarmed by your wife’s attitude toward your eldest.", "NTA, it's still a \"lose lose\" situation whatever you chose, but your wife is definitely overreacting. \n\nAs someone with chronic health/autoimmune issues, including pain, staying with your oldest was the best decision. If she's having trouble walking, she needed someone there who knew how to help her, especially if she fell and got hurt. \n\nYou did the best thing possible, don't let your wife or anyone tell you so. You can patch things with your youngest, she will understand eventually. There's other recitals and I know you hated to miss it. Your wife could've recorded it if possible. \n\nNever stop helping your oldest.", "I was diagnosed with Rheumatoid Arthritis when I was 16, symptoms started when I was 14. It's absolutely miserable. I was recommended light exercise and was told to stop jogging. I'm shocked this young girls drs think football (soccer) is okay, but I understand that she will want to feel 'normal'.\n\nMy heart goes out to this girl & I think OP's wife is being very insensitive. She needed her Dad, and his youngest had her mum at the recital. I understand the little girls disappointment, but needs must. If OP was going to miss her recital for ANY reason, caring for his other daughter is a good one. NTA.", "NTA, your older daughter was in severe pain. She needed her parent.", "OP couldn’t do anything for his oldest daughter.  Her having a “hard time walking” isn’t a valid reason for OP to miss his youngest child’s dance recital.   \n\nOP is showing clear favoritism towards his eldest daughter.  YTA.", "This is what I want to know too. OP said in another reply that he let his wife know earlier in the day that he might not be able to go, but that's not the same as calling his wife and daughter before the show starts, apologizing for not being there, and wishing her the best of luck before she goes on. There's really no excuse for him to not have done at least that much.", "The wife is TA for being angry at him! If it had been one of the twins who was sick a parent would have to stay if one of the siblings, half or full, had an event.\n\nShe's mad because he had to miss the recital to stay with HIS daughter!", "OP mentioned this is the first really bad flare up in 8 months. Given that, I personally feel the mom was over reacting. The timing sucks but sometimes things happen.", "You think he should’ve texted his 4 year old daughter explaining? My lip gloss phone at 4 didn’t usually receive those texts", "Her doctor recommends the activity, she’s not purposefully doing something that’s making her condition worse. Her last flare up was 8 months ago and she needs her dad too just like her little sister. \n\nMedical condition trumps a recital always. \n\nOP is NTA.", "Didn't you read the post? It's not juvenile arthritis, all knowing Reddit doc. She has an autoimmune disease that also causes joint pain. The mom was at the recital so he could, rightfully, help the daughter that was in severe pain. Not everything happens the way it happened to you. NTA, and don't listen to the trolls", "[removed]", "It doesn't say she has arthritis does it? Just that it's an auto immune condition. It could be Ehlers-Danlos syndrome or something else.", "I was diagnosed at 14 too, with an auto immune, and was told to quit cross country, and take on swimming more frequently", "No. But you definitely are. Wow.", "You forgot the /s. Or you're a total AH/so much in that you can't be more in the wrong. Don't know, but I'd prefer first option.", "OP NTA. I thank you for consoling your daughter and being there for her. Shes *still* 15 and dealing with chronic pain. Your wife really needs some empathy. It's understandable the four year old freaked out because well they are four. But when they calm down try to explain it to them in terms they can understand, like when they themselves are sick they don't want to be alone, afterall they already had a parent there. Your wife hiwever should absolutely kniw better. Next time explain beforehand to the 4 year old and say the mom is filming so you can all see it together later. She could have even done a videocall pherhaps? \n\nIt sounds like ypur daughter has spondylitis. Solidarity.", "Your younger daughter had another parent there with her.. your older daughter does not have another parent… your wife is insensitive and kind of a B", "Absolutely this- my twins graduated from two different colleges on the same day.  The schools were two hours apart with no traffic so there was no way we could all be at both graduations.  We had them decide who they wanted to attend their ceremonies.", "If you had stayed home with your sick son, would your wife still have been mad, or is she only angry because your oldest isn't hers?", "NTA", "That’s exactly the point - for regularly occurring events, you have to have different accommodations to ensure you aren’t consistently robbing Peter to pay Paul. That’s why I asked the question. For one-offs, Peter would understand.", "Yes a flare up of her condition that’s what he mentioned I saw that but that doesn’t mean he hasn’t chosen her over the twins for other reasons in the past. He could pick going over to her soccer games over going to the twins dance recitals or other activities or just in the home the twins could want to play with dad but he’s to busy hanging out with the oldest or something like that which is why I say without knowing the specifics of things it’s hard to come to a judgment. Also because he specifically was talking about her medical condition and not if he favors her over the twins like the question asked I believe so to me that’s a bit suspicious but it also could just be he misunderstood the question or something like that. Or I could be over analyzing.", "No he should have texted his wife is what I was saying. Since he didn’t do that all he said was earlier in the day he said he might not be able to go then just didn’t show up and so the wife texted him. I said he should have told his daughter that he might not be able to go and then he should have before they left said he’s not coming or if he didn’t know at that point then he should have texted his wife before it started letting her know so she could explain it to her.", "That’s exactly what I mean. The teenage is perfectly able to be left alone with the things she needs to keep her comfortable. Leave her with the remote control, her pain meds, some snacks and a cell phone.", "Absolutely- my 4 year old requested hot chocolate so I made some & she said it wasn’t hot it was just warm chocolate. So I microwaved it, now it was to hot - it was hot-hot chocolate. So I put an ice cube in it, now it was ruined & she cried. \n\nLiterally no winning.", "I am a grown assed adult with Ehlers Danlos and when I'm in extra pain (rather than my usual daily pain), I totally want someone I love to be there for me. It doesn't matter that I've dealt with it for 51 years, it makes a difference to have someone nearby when the pain flares.", "No he doesn't say arthritis, but I also experienced severe joint pain at her age, that was my point. I was not saying she has arthritis. My heart still goes out to her though.", "I have EDS and soccer was the first thing my doctors told me to stop playing. Softball came next.", "[deleted]", "[removed]", "EDS isn't autoimmune (unless there's a subtype I'm unaware of)", "I went back and reread it and yeah I guess OP doesn’t specifically state that he told his wife he wasn’t going. I hope he did, but if not I understand her reaction and hope she came around once she learned the situation and he apologizes for not communicating that.", "And what happens if the pain gets worse and she’s unable to take herself to the bathroom? Just soil herself because of a FOUR YEAR OLDS dance recital…", "I don't have kids but I was a nanny for 7 years. Sometimes kids are just feeling a feeling for the first time and it's a really big feeling that they just have to experience", "I meant that soccer might be an entirely okay sport for her condition as it may not be arthritis.", "EDS is such a coin flip with doctors. I think exercise can help until a point. The worse I’ve gotten from exercise (over 100k in physio and chiro isn’t an exaggeration) the more they told me to do it. I was a semi pro ballet dancer who kept going as long as I can and my latest doctor told me I’m doing worse because I’m not doing tai chi.", "/u/Amazing_Spinac is a scammer!  **Do not click any links they share or reply to**.  Please downvote their comment and click the `report` button, selecting `Spam` then `Harmful bots`.  \n\nWith enough reports, the reddit algorithm will suspend this scammer.\n\n---\n>!^(If this message seems out of context, it may be because Amazing_Spinac is copying content to farm karma, and deletes their scam activity when called out - Read the pins on my profile for more information.)!<", "Possibly! I was recommended light weights but more of them, rather than a high-impact sport. If this girl's autoimmune disease has bad joints as a side effect, rather than actual damage to her joints then I guess it could be okay for her. I'm not a medical professional however.", "Never heard of EDS, but I'm going to read about it now. I'm sorry you both suffer from it ♡", "Thank you! It needs more awareness and funding. It mostly affects women so doctors write it off as mental. The pain is unbelievable for so many affected (esp as you get older)", "I can imagine :(", "INFO: how often are you missing things for your other kids? How often does your wife have to pick up the slack with the twins because of your oldest? How often have you missed things of your oldest daughter for the twins? How often do you explain to you younger kids why \"dad\" wasn't thier?\n\n\nI will let you know your younger kids will never forget everything you miss due to your oldest. They may grow to understand, maybe fake that they understand or be hurt and angry with you. But they will not forget. \n\nI am 32 and still remember all  things both my parents they went to for my bother 33 while I can count on 1 hand all the things of mine they came to. All because", "NTA. You have a chronically ill, motherless child who needed her father to help her. If she couldn't walk, how was she supposed to get to the bathroom to relieve herself? Get a glass of water? Acquire dinner? She needed someone there to assist her. \n\nYour 4 year old daughter was upset, and that is understandable at her age. I would suggest apologizing for the hurt feelings (not for helping your older child) and explaining the situation in a way that does not place blame on your older daughter. Maybe ask her to do her dance for you and your older daughter at home.\n\nAnd explain to your wife that that your daughter, who she has known since she was 6 years old, is still your daughter and still needs you, sometimes more than your younger kids, because she has a chronic illness and you are her ONLY parent.", "Sometimes there are no good options. I would question your equating \"recommended to stay active\" with intense team sports, but hopefully you've had a more in-depth discussion with her medical team about that.\n\nAs much as your older daughter needed you, your younger daughter is 4, and she's not going to get it. And your wife wants to protect her daughter and was the one left to deal with that disappointment, which can be difficult at that age. NAH", "YTA", "Very soft YTA - you have multiple children so you need to balance all needs. Was this the first recital of your daughter? Will there be any more this year. Some recitals are only once a year. \n\nOldest is 15 and should be able to manage the paid for a few hours if you left her home. I get it is painful and not fun at all. Could someone else have come and stayed with her while you went to the recital to celebrate other daughter’s accomplishment?\n\nThink of it this way every time daughter has a flair up do you take off work and sit by her side or do you go to work and set her up at home to make her comfortable and allow her to text you when needed. \n\nI feel for all but missing events for your other children when there were probably other options as well is not the right answer.", "NAH sometimes there are no right answers, you seem like a good dad :)", "There's no video? Why didn't mom take video so you could admire your daughter's dance over and over? \n\nNAH", "Depends on how often it happens.  If this was a frequent event that makes your daughter side-eye you when you promise to be to something, then yes.  If this happens less than once a year offer to take her to ice cream to apologize and plan for next time.", "NTA.   Sorry your wife is a drama queen.", "NTA and this is not choosing one child over another. OP needs  to talk to wife and get on the same page so is not only OP staying with oddest daughters when these things happen.", "NTA.  Your 4 year old daughter will not remember you missing this and mom can record it to show you. But 15 year old daughter would definitely remember you ditching her while functionally incapacities and in pain to go to a dance recital for a baby. You made the right call here, your wife needs to not sweat the small stuff.", "NTA. I have 3 kids and I try to make appearances when things conflict, but the reality is there's only one of me and I can only be in one place at once. To me, if ONE parent makes it that's just as good given whatever circumstances. I understand the 4 year old being upset but your wife calling you TA is way over the top.", "NTA this is why there are 2 parents when 2 need you in 2 places 1 parents goes with 1 and the other goes with the other.", "NTA\n\nYour older daughter needed you and your younger daughter still had a parent at the recital. Your 4 year old got upset and that’s ok, she’s allowed to be upset and your wife was there to help her through those big emotions. There will be more recitals and you’ll attend the next one. One missed 4 year old’s recital isn’t that big a deal in the big picture, not being there when your child is in so much pain she can barely walk ***that*** would be a big deal.\n\nIt sounds like your wife may not see your daughter as being equal to her kids in your family.", "NTA.  A flare up is exhausting.  Breathing is effort.  Forget trying to go to the bathroom.  She needed some one there even if all she did was sleep or lie on the couch binge watching whatever show teenagers are binge watching these days.  \n\nDad can easily make it up to younger daughter by spending one on one time with her.  I suggest a fancy tea party at a restaurant.  Dress up in your best clothes.", "OP, do you think your wife would react with the same anger had it been your other child you stayed home for because he was in a lot of pain? You know, her biological child?", "NTA- as a kid with chronic pain thank you for caring for her. I just know it meant the world to her to have you stay with her", "NTA - Your wife is a stone cold AH! Think about it this way if your youngest had chronic autoimmune disease with an intense flare up & your her go to parent for comport & eldest had a dance recital...well your wife would expect you to look after the poorly daughter. You did the 110% right thing as a parent, your wife didn't as she should have been teaching your younger daughter empathy for her older sister is pain!", "NTA.  Thank you for sticking with your ailing child.  Your wife, needs to tone it down. There's dance recitals all too frequently and most likely you can get a copy from the 200 people filming in the audience. \nThen, as a family,  you can all enjoy it together tomorrow. \n\nYour younger kids, if she really did pitch a fit,  need to learn empathy. And not from their mother.", "NTA.\n\nAnd I'd talk to your oldest a bit to make sure your wife is not being a stepmonster behind your back. Her response here is extremely worrying.", "NTA. Your wife's response is very concerning.", "NTA Honestly as a parent you can’t make all the kids happy she’s only 4 so probably won’t really resent you, I would also be concerned about the woman you married she seems to not care about her stepchild at all, and that’s alarming especially because it’s an autoimmune disease, my mother was immune compromised she passed early. One of my best friends has one as well and she suffers some days. It’s not like the common cold and that’s how your wife is treating it!", "NTA. You stayed home to take care of your sick child. I’m sure the have been or will be times when you miss your eldest’s stuff due to a sick child. And honestly it’s a 4 year old’s recital that she very well may not even remember. Your 16 year old will remember you staying home to take care of her. And if you tell your 4 year old that your sorry you missed it but you had to stay and take care of her sister because she was sick then point out that when she (4 year old) is sick she really needs someone to take care of her, right?  Then she’ll probably understand you, forgive you, and learn a lot about empathy. I wouldn’t count on her mother to teach her empathy since she thinks the 16 year old who was having trouble getting around should have been able to tough it out alone.", "NTA. Your younger daughter is 4. There will be plenty of other dances.. your wife sounds jealous. I would watch how she treats your oldest compared to “her” kids.", "I am so sorry that your daughter is dealing with chronic pain (and I very much hope you have her hooked up with an excellent, university-based pain clinic that takes her pain seriously).  \n\nI am also sorry that you're married to a woman whose stance in the face of your daughter's pain is so utterly heartless and insensitive.  \n\nYou made the right choice.  It was sad for your four year old, who may be too young to understand.  Your wife, of course, could have explained to her, face timed you to say nice things to your daughter, and could have taken video of the recital, which you could have played on the family tv and all watched together while cheering.  \n\nBut instead, she chose to take the low road.  The very low road where HER child's having you at her recital was more important than this unimportant15 year old who isn't her child having a loving parent by her side during an acute pain flare-up.\n\nI shudder to think how your wife treats your daughter when she's in pain and you're not home.\n\nLet her stay at her mother's, possibly forever.  \n\nNTA, but you're certainly married to one.", "NTA. Your older daughter needed you. Your younger daughter had her mom.  You did the right thing, but it is apparent that wife favors her children.", "NTA. Even if your daughter is used to the pain, she is still a child who was having a difficult time with her illness and needed the support of her only parent.\n\nYour wife is not at fault for being feeling annoyed since your other daughter wanted to see you but is in the wrong when she could have explained to your daughter what was going on and that dad would be there next time. Your wife unfortunately is not understanding how much could an illness affect someone who is young. Heck, even someone older have some really hard time managing a constant illness.\n\nIts not like you skipped the recital for some mediocre reason. She should learn more about the illness and be more emphatic towards your older daughter. This way, a situation like this could be avoided.", "NTA she could barely walk she could have gotten seriously hurt if she was alone with Dad there if she needs anything dad could get it", "NTA. Not everything is fair in life and we do the best we can. In the moment, both 4 and 15 yr olds needed parental support. 4yr old had a parent there to support her. 15yr old also had a parent there to support her while going through intense pain. Would the mom have stayed home with the 15yr old if 4yr old wanted OP there so bad?? Sounds unlikely based off her reaction. Both kids needed a parent there for support and it sounds like OP made the right call in that moment for a child who needed her dad while the mom was with the other child who also needed a parent there.", "Nta", "Is there a reason your wife refuses to come home. I mean I get she is mad but she choose the nuclear option.", "INFO: What did you actually do to help her when you got home? If she literally needed help getting to the bathroom for example, I could understand. But if you're just hovering around then youre TA", "I think if the older daughter was having trouble walking, there was a right choice and OP made it.", "This.", ">Sounds like there's other issues at play in your marriage. Could she be jealous of you giving your older daughter attention or accusing you of giving your daughter more attention than the twins?\n\nIt's probably this. She knew he was a parent to another kid... when they got pregnant,  she probably assumed the other kid would be a weekend only one with weekdays reserved for the twins... except mom died, and now she's pregnant with twins with a full time 10 yr old immunocompromised who's grieving and dad/husband has to try to make it work for everyone in a very hard and complicated balance.\n\nNta. But maybe get the kids to perform a private dance recital at home so dad and big sis can enjoy it. Maybe hide a few flowers to throw at them/ on the \"stage\" when the performance is done.", "Do you have an autoimmune disease or chronic illness? Most flares can never end up putting you in a hospital, but it doesn't mean it doesn't get so bad you can barely get out of bed, or need help moving around so you dont fall and injure yourself, ESPECIALLY with joint pain. Besides that, there isn't anything a hospital can do to assist with crippling joint pain besides charging you an arm and a leg for going. Unless you injure yourself from falling, or dislocated something, there's no reason to go to a hospital. And do you have any idea how hard it is for a CHILD to have an autoimmune disease or chronic illness? No offense but if the siblings don't have one, they don't get a say on when the person that does needs help. Nothing trumps needing to help someone who's in so much pain they can't function without help, and while the siblings are far too young to understand this, they can he taught to. Even if a person, let alone a child, knows how to self manage pain on good days, it doesn't mean they don't need help and support on the bad ones.", "Yeah, scheduling is my personal hell.  No one is an AH simply b/c they can't be in two places at once.", "This sounds like a great opportunity for her parents to stage a big show at home and make a big deal of it. But OP is still NTA. And his wife likely could’ve made the little one feel confident and excited to perform without OP there but seems like she didn’t.\n\nEdit: typo", "Absolutely! OP can’t go back in time to go to the recital, but he can do something else to make his 4 year old daughter feel special and appreciated too. I grew up in a house where I had to suck it up bc my brother was sick a lot, and while I understand a lot of my parents’ decisions in hindsight, it didn’t make them hurt less in the moment (especially when I was young.)\n\nNTA for missing the recital, but please carve out time to do something special for your other daughter when you can.", "This. I (most likely) have a chronic autoimmune disorder and I have had symptoms since my late teens (getting an official diagnosis was a long, long process and we aren't officially there but we are finally close). I am almost 40 and I now know my limits and what I need to do to manage a flare but when I was a teenager, I did not have those tools. Even now I often rely on my husband or bff when the pain is too bad.", "No, don’t make it up with a gift. That will just spoil the little more. Take her to a park alone. Let her pick dinner. Adjustments have to be made when living with the chronically ill and kid needs to learn that. Of course, she can’t get pushed aside for just anything, but if her sick sibling is too sick to take care of herself, even at four, the kid doesn’t need a damned present for a missed show that the mom and twin made it to.", "There is an in-between and that is being there to get his daughter water/pain meds or anything else she needs so she doesn't have to move around and be in more pain.", "How is the wife not an AH for shitting on OP for being stuck between a rock and a hard place?", "Yeah, the child is 4. It isn't the end of the world. The 15 year old is in severe pain. This rarely happens. Why wasn't mom enough? One parent on each child is plenty compromise. \n\nAlso how do you know distance and time to rotate wasn't a barrier?", "On tonight's episode of \"Why the husband is always the AH on AITA...\"\n\n> Take turns with another parent, get a trusted friend for an hour or two, pay for a nurse.\n\nThere was no other option according to OP. And anyway, the eldest wanted her father next to her. It's not like this is a daily thing, it last happened 8 months ago. You re acting like he is ignoring the youngest and being the eldest's servant or smth.", "we’re close enough in age that it was never feasible to have both parents at every game or performance for all of us.", "I was 5.  I absolutely did not get told to play sports.  In fact, they stuck me in a WC until I was almost ten, and went to physical therapy three times a week instead( gotta say I loved days where I got to sit in the heated jet spa).   But a flare up means your hair hurts, so I definitely empathize with OPs elder daughter.", "Michelle Akers, one of the stars of the US Women's\nNational (soccer) Team in the 90s, haas chronic fatigue syndrome\nThe USWNT documentary Dare to Dream mentioned it, and Wiki cites Lisman SR; Dougherty K (2007). Chronic Fatigue Syndrome For Dummies when listing her amongst famous people with the condition; some others on the list are also athletes", "Bring her food if she's hungry so she doesn't have to walk? Help her to the bathroom? Make sure she dosen't fall while walking? Just keep an eye on her because she's in severe pain and with mobility issues at the moment", "Are...you the wife? While he may not have been able to magic the pain away, even teenagers benefit from having their parent near when they are in pain. If she was having a hard time walking, she may have needed assistance in getting food or beverage, medication or even getting to the restroom. You have no details of her diagnosis. A 15 yr old is still a child and still benefits from having a caring adult nearby when they aren't well. The 4 yr old, while their feelings are valid, will have plenty of activities for their dad to attend in their lifetime", "Having a parent there to support you through severe pain is at least as memorable and significant as having a parent there to support you through a dance recital.", "NTA and I hope your wife isn’t resentful towards your 15 year old. Leaving the house is a pretty intense reaction to you missing your 4 year old’s dance recital. It sounds like there may be more going on here", "Op i just want to say I don't think you are an AH, but kids won't understand the full context here, the only thing she will see for a few years is how you favour one kid over the other if you keep doing this, again I don't blame you, but try to think about a long term solution that won't brew resentment between your youngest and you and your oldest.", "What an amazing and beautiful idea!! That's the perfect solution!", "Awww that is such a sweet idea. Reminds me of the movie Finding Neverland but way less sad. If you know you know.", "It’s also incredibly disheartening to go to the hospital with pain from a chronic condition only to be told it’s not that bad and that you’re drug seeking. That is not the reputation you want to get with your local doctors if you have chronic pain.", "Because she is heartbroken that her daughter is heartbroken. She is dealing with the fallout. He didn't even have the guts to tell the youngest himself, but he made his wife do it.", "That is probably how the youngest feels, was my point. Unfortunately, four years olds aren't rarional. And I thought the OP was the mom, I actually got the genders switched. LoL. It's okay for me to not agree with everyone. And I often agree with men. Assuming that's the only reason I said *soft* YTA is short sighted and more likely telling about how YOU feel about women. Also, I wasn't acting like that at all - just made a few suggestions that sometimes people don't think about, thinking outside the box can be helpful. Or you can just decide that I'm on some imaginary war path, if you wanna.", "He specified autoimmune, though, and EDS is connective tissue. Then again, I've known many a zebra to get misdiagnosed with autoimmune disorders even it's actually a CT disorder. Connective tissue and autoimmune disorders present so similarly in many cases they're easily confused... Regardless, I can't believe she's playing soccer. I was a swimmer myself alongside EDS and I tell other zebras that zero impact sports like swimming is GREAT.", "Yes, the Dr said she was meant to be active - but a high-impact sport is surprising! However, I realise that isn't the point of the post and we don't know what her disease is.", "Yes, swimming was highly recommended too :)", "The dance recital wasn’t a week long affair.  It was only a couple of hours.  OP’s eldest was completely able to be left alone for a few hours.", "A dance recital isn’t a week long affair.  It’s just a couple of hours.  These pain events had happening previously.  The eldest daughter survived them with no ill effects.  She was in zero danger if she were left alone for a few hours.  Undoubtedly she had the ability to phone OP if she needed him while he was at the recital.  \n\nAs far the claim on out having me details goes, that claim is false.  OP provided sufficient details for him seeking judgment.  Those details are her being “in a lot of pain and having a hard time walking.”  That doesn’t mean “bedridden.”", "This, 100%, \"We are a family. Your sister needed help and she was hurting so she needed Daddy.\n I know you're disappointed I couldn't be at your recital. How can I make it up to you?\"\n\nThe wife is totally TA though.", "how? sounds like they were already apart. does the 4 year old have a phone to text?", "Exactly. I was told right to my face once that my pain wasn't as bad as I was saying, and that I should go to basically a boot camp to \"power through it and see it's not as bad as I think it is.\" I was also told by a doctor I had never seen before that he \"doesn't think I have the chronic illness I have,\"  when I was literally genetically tested for it. If a person doesn't have a chronic condition they just can't fully understand what a person who does goes through.", "Does that excuse her behaviour?", "Nothing you suggested in the original comment was useful or relevant. He did balance his time 99% of the time (8 months ago was the last time he stayed with daughter due to health reasons) and this time it was unavoidable. He didn't have backup.\n\nThe sibling isn't sick all the time. And its funny you are ignoring the crappy behaviour from the wife shitting on OP for being in the impossible decision situation. Surely she is more of an AH than he is.\n\n&#x200B;\n\n>That is probably how the youngest feels, was my point.\n\nYou didn't mention that anywhere in the original comment.\n\nUnfortunately hard decisions need to be made sometimes. You can't always do everything a 4 year old wants.\n\n>And I thought the OP was the mom, I actually got the genders switched.\n\nSure\n\n&#x200B;\n\nEdit: Lmao got accused of mansplaining and blocked for pointing out suggestions that have no relevance besides serving to undermine the husband. Average day on AITA", "I’m sorry anyone has to go through Ehlers Danlos.  I have a few patients that have EDS and POTS.  They try so hard to be positive but I can see how hard it is on them.  I hope you all have someone to give you loves when you’re hurting.", "Just hot diagnosed at 47.  It’s shit.  I’m still trying to come to terms with it.  I’m the opposite though.  The more pain I’m in, the more I want to be alone.", "Why are people speculating on this child’s condition. Not sharing a minor’s medical information on the internet to strangers is what a responsible parent does", "Zebra? I thought it was a typo but you wrote it twice. Is it a term to do with EDS or something?", "And the youngest is 4 and still had a parent there to watch her. She should be completely fine to have her father miss a single dance recital at a young age.", "It only takes \"a couple of hours\" when you're having a mobility issue to fall and injure yourself. The OP did the right thing. \n\nAnd I sincerely hope no one is ever in your care.", "It doesn't seem like you understand the severity of an autoimmune disease, that a flare up could of joint pain could leave you basically useless for hours if not days, and it's not just physical but also emotional, i wouldn't want to be alone, when i have a flare-up i call my mom or my cousin or one of my friends to be with me because i can't even walk down the stairs on my own or go to the bathroom, it sound dumb but i have to take my pants down and sit and is very painful with help, much more without it.", "you don't think 4 year olds have memories?", "Ya same. But also even without that I feel like we are missing something because to me this extreme of a reaction of going to her moms and being so upset. But also sometimes people just have extreme reactions for weird reasons so it’s hard", "Mostly. But there is no excuse for him not telling his youngest himself. So I think it is more NAH than E S H .", "You are the kind of person there's no point in talking to. I made a point to flesh out my comment so it didn't seem harsh, cuz it was a bit harsh on her; I typed in a rush. But that was more to assist the OP with her crappy situation that's she's in with the yelling impatient ex than giving a rat's ass about whst you think. \n\nThis is a perfect example of \"closed minded and stubborn\". It's cool to agree to disagree. I've been through the situation and know what it's like to feel like you're being pulled in a billion directions and came up with some creative solutions, is all. \n\nI don't need any more of your mansplaining. I don't like wasting time on someone who can't see past the end of their nose. It's a sign of maturity to be able to have your mind changed, or to admit that you misspoke. Try it sometime, you might like it.", "I have Ehlers-Danlos Syndrome and find there’s a lot of misinformation out there about it. A ton of people in the comments were responding like the child had EDS. I don’t know what the child has, nor do I want to know. I never speculated on the child’s condition. I just wanted to correct the misconception that a lot of commenters had that it was EDS. It can’t be since EDS is not an autoimmune condition. I added EDS and soccer are not a good combo as many people don’t know this and I think the general public having more knowledge about EDS is a good thing.", "I was not trying to get OP to tell me what his daughter has, I was saying I had joint pain at her age due to my arthritis, so I can sympathise with her. I never speculated that she had arthritis, I was just saying I can understand why the daughter wanted her dad.", "I know after 8 months, most 4 year olds forget many minor things.", "It’s not necessarily you specifically, this whole part of the thread where people are speculating about a minor’s medical condition gives me the ick.", "Ya, I got told to take some anti depressants because obviously all these dislocations and breaks were all in my head and I must merely be a hysterical woman. 🙄", "The war on pain just makes no sense.", "Without more context, NAH. Your younger daughter is only 4, but will notice if you continue to miss important events in priority of your older daughter. You are parent to both children, make sure you aren't prioritising the needs of one over the other.", "NTA.  Your older daughter was in pain and needed you. Your wife was there for you younger daughter and could have recorded at least part of the recital on her phone so you could see it instead of having a tantrum", "That’s a damned if you do damned if you don’t scenario unfortunately", "15 is still really young. it probably means more to her than either of you realize for you to be supportive like this.", "NTA\n\nThis is something that just happens in families with more than one child. Two or more children need a parent at the same time. \n\nOne parent going with one kid and the other parent staying home with the other kiddos pretty much how most families handle this.", "NTA except for the part where you married this woman and had children with her. \n             \nI do not have a chronic and painful illness attacking my joints, but despite that, I can understand that there are people who do, and I even believe that these things hurt, and that not all pain can be managed at all times.   \n        \nI am 1000% certain your older daughter would have loved to have felt well enough to go to a vanity dance recital for the four year-old, but unfortunately, she could not walk comfortably, let alone sit in a chair for the duration of the \"performance.\"", "NTA, I have a daughter with chronic joint pain and migraines. There have been times that even with our regular pain management methods, I've had to take her to the emergency room for an IV drip for pain. What would your wife have had her do if she couldn't manage her pain? Just because she's used to the pain doesn't mean she doesn't need support.", "A health issue will always take precedence over something like a dance recital if there is no one else able to care for the kid that is sick. If your daughter can’t even walk she needs someone to stay with her, period. It’s not like it was a minor cold or migraine", "NTA. Congratulations on being a great dad. Shame in your wife for not stepping up and supporting your oldest. She is the only AH is the situation.", "NTA- tell your wife that you have three children, not two. Being injured or in pain trumps a fun activity. Ask her if it would be okay with her if you ignored your four year old being ill to go to your older child’s soccer game.", "I am not going to pass judgment because it all sucks! All of it. BUT do read about glass children and make sure you aren't doing this to the non - twin, non - oldest.", "NTA - I have 2 disabled children and 2 Neuro-typical children, my oldest child was a football player and a wrestler. I went to every weekend wrestling tournament and most of the weekday meets as well as all of his football home games and any others that were in town. - I - I - meaning his father DID NOT. He stayed home with our other children for the weekend meets (all day tournaments were too much for the other kids) and most of his football games (we did bring the other kids to a few but it was very difficult for all of us) and we would BOTH go only if everything lined up for it. My son knew I arranged things the best I could but that we couldn't usually BOTH be there. Unless you only have ONE child and nothing ever goes wrong in your life - e.g. flat tire, car accident, work emergency, etc., there will be times that BOTH parents just can't make it. Four is a little young to understand that but it was your wife's job to explain that to your daughter in a way she could understand (if she knows her sister is sick, it shouldn't have been hard) and promise her that she'd record it for you to see when they got home. That's what I did. I recorded all my sons wrestling matches and sent them to his dad.", "NTA. I’m thinking, if the situation was opposite, if your younger daughter were really sick, and your older daughter had like a soccer game, you probably wouldn’t go watch the game to take care of your daughter. Of even your wife wouldn’t to take care of the daughter.\nI think, as an adult, and mother, your wife should understand that there are tough choices to make in order to take care of your daughter’s health. Try talking to her again.", "You won’t win any prizes.", "NTA for staying home with your sick daughter, but I think you could have handled it a bit better with your younger. Next time have her mom put her on the phone so you can tell her yourself, and assure her you'll be on video call watching and cheering for her even though you can't physically be there.\n\nI've had an autoimmune condition that affects my joints among other things since I was in my teens, I think people (including your wife) can underestimate just how severe a kid's \"normal\" day-to-day pain can be because some kids can and will just power through it. That can mean they equate severe flare-ups with the severity that would put them on their ass for the day, which tends to be miles from coming close to just how bad a truly bad day can be.", "YTA", "You just taught your youngest daughter that she is not important to you.", "NAH. But... this is a slippery slope to not being there enough for your other kids so, you may want to take into consideration if this is a pattern of behavior.", "Chronic pain from childhood sufferer here. \n\nFirst of all, soccer is a high impact sport, so I feel surprised this is what the doctor had in mind. But, hey, we all have to balance our need to be normal with our need to be pain free.\n\nSecondly, you staying at home isn't the only option here. A 4 year old's dance recital is only an hour, tops. That's like half a movie. Stocking up a tray of snacks and making sure your daughter is comfy would be fine. Or, better, have one of her close friends over for a couple of hours. I had a few of mine come hang out with me to make sure I'm safe while my parents ran errands when I wasn't doing great and it was a lot of fun. \n\nYou guys need to find something that works because the twins are getting older and they're going to start noticing your absence from their important things. \n\nAlso, OP had plenty of time to let her and his daughter know BEFORE the recital was about to start that he wasn't going to make it. Waiting until the last second, and the wife to text, is what moves this into asshole territory. It isn't like older daughter had an emergency. This was something that OP knew the night before might be a possibility and did not communicate until the very last second. So, yeah, I'm leaning towards YTA. But only slightly. Like, I think if this isn't a pattern, and it had been communicated well, I would say no assholes here. But, with the terrible communication... That's bad.", "Nta, I'm sorry you're dealing with this. You need to have a SERIOUS talk with your wife. Just because big girl is not her biological daughter, or because she's older does NOT mean that she doesn't deserve the love and compassion of her dad. Furthermore, just because it's a chronic illness doesn't mean that it doesn't absolutely suck when it gets bad. And if your CHILD can barely walk, that's really bad. Yes, she needs to get used to it. But.... considering that she still plays soccer while dealing with her immune system, deciding her joints are the enemy.... sounds like she's pretty fucking good at handling it.\n\nYea, sucks you missed LOs dance recital. But having my own munchkins, if you simply explain that big sister was hurting bad and needed her daddy, guess what? Most minis, if being properly prepared to be compassionate tiny humans will not only understand but actively try to help. Maybe it's trying to make a snack, giving a teddy bear, or trying to kiss boo-boos. \n\nYour wife needs a fucking reality check on raising a disabled (step)daughter. You don't just fucking abandon her for a dance recital. Sorry, you'll catch the next one.", "Of course NTA", "And it’s not as if OP just didn’t want to go.  I hope wife recorded it for him - my nieces and nephews love to sit and watch their own performances and do play-by-play for my brother when he has to miss something.  Kids know when their parents skip everything and show no interest, but they can also understand when something comes up and do a makeup date.  I swear half the time kids are “traumatized” it’s an adult reaction that is egging them on.", "It was more than pain flares. She was having difficulty walking. She deserved and needed a parent to be there with her in case she needed assistance.", ">I'm shocked this young girls drs think football (soccer) is okay,\n\nI would have thought swimming would be a better sport for her.\n\nSports aside, OP NTA, your eldest only has you, your younger children have both parents. It sucks that the little dancer was upset, but what if something had happened and your eldest daughter needed to go to the hospital. You could have come home after the recital to her screaming in pain. \n\nI'm not trying to go doomsday. Just point out that you made the responsible decision to make sure your eldest was safe.", "And shouldn't they explain to the little girl her older sister's situation and why her dad couldn't be there so she doesn't just think her dad decided he didn't wanna go or, if she heard her parents' fight, that her dad was taking care of the older sister even though she is \"mature enough\"? (overhearing it from mom can give her that idea) It might not be a big deal now but this could potentially cause her to view the older sister differently or, if it happens more often in the future, that dad has a favorite.", "You just reveal your own ignorance.", "Sounds like JRA to me.", "Stuck you in a water closet? What?", "As someone who just went through the testing for MS (in the clear luckily) I wish you luck.", "Been lifting for almost a decade.\n\nI have EDS & my doctor said to absolutely not stop lifting weights & gave me multiple supplements suggestions & brace/tape techniques to combat the instability in my joints to lower the injury risk. She said the best thing I could do is to continue my weight lifting routines to keep the muscles surrounding my joints strong. \n\nShe's on to something too, because the times I have the most joint injuries (sprains/tears) are when I stop lifting weights for a while.\n\nI also played softball from age 5 to 18.", "Could it possible be Lupus ?  \n\n\n[https://www.mayoclinic.org/diseases-conditions/lupus/symptoms-causes/syc-20365789](https://www.mayoclinic.org/diseases-conditions/lupus/symptoms-causes/syc-20365789)", "Wheelchair.", "A child doesn't have to be...and shouldn't need to be...bedridden to have a parent caring for them. The 4 yr old had a parent at their recital. And their father had already explained to them that his not attending was a possibility. The child at home has only one parent as an option to care for them.", "Why does your opinion of this matter?", "\"When you hear hoof beats, think horses not zebras\" is a common phrase in medicine/diagnostics. It's a reminder to not go looking for medical mysteries/rare diseases, because most cases WONT be that but people get excited about finding rare conditions (human flaw) and you have other biases/heuristics that can impact your judgement too\n\nHowever, some people are indeed zebras. Rare conditions are rare, not non-existent.", "I'm not the one who judged the OPs choice to have them in soccer.", "I think they are just talking about EDS and clearing up misconceptions. I personally have never heard of it before, so I'm glad someone mentioned it so I can learn more.", "NTA. I'm 35 with fibromyalgia and chronic fatigue syndrome. There are times I need my parents or sister to do almost everything for me. Age is irrelevant. What *is* relevant is how your daughter feels and whether or not she will need help.", "NTA\n\nI have a butt ton of auto immune conditions, that include joint pain. I am a 31 year old grown woman, and bad days my husband has to help me get up the stairs to bed. \n\nSome really bad days, he has to help me undress and physically get in to bed. \n\nYour CHILD was in incredible pain any time she moved (and even when she didn't) there is no way, in any universe, it was more important to go to a dance recital (regardless of hurt feelings) to leave another child home alone, in horrible pain. \n\nObviously it's not your twins fault they are upset, in any way. But your wife...oh man. She is a grown ass person, and I really hope that attitude doesn't seep over into her interactions with your oldest. I worry from that alone if she tries to downplay your daughter's pain, and make her feel guilty about it.", "NTA. Your youngest had a parent there, your oldest was in pain, and that can be scary. Your wife could’ve found a better way to handle/coax your youngest to perform, ice cream works wonders for 4yr olds. This sounds more like a wide issue than kid issue (probably embarrassment cause she couldn’t handle the 4yr old when OP could’ve).", "NTA. If your wife is willing to burn down your marriage because you chose to help your eldest with her health condition rather than watch your youngest dance you need to run now. People fight but the act of withdrawing commitment as a weapon to get your way is unconscionable.", "NTA, unfortunate timing but one child is in pain and not feeling well, that is more important than a dance recital, even though obviously it would be nice to be there to show support.", "YTA. You leaving out important information. \n\nWhat did your older daughter say when you asked her to stay or go?\n\nBesides getting her stuff what can you do for her?  Get her comfortable and then go to recital. \n\nShe has no friends that could come over?", "INFO: Did you tell anyone you weren’t going? Or did your wife as well as your daughter have to find out you weren’t there by you not showing up? If you told your wife than N T A because your oldest needed you, but if you didn’t tell them Y T A for not giving your wife a heads up so she could also talk to your other daughter. You for sure were right to stay home but if you didn’t communicate what was up that’s lame.", "NTA, your oldest's medical needs trump a dance recital. Your wife is T A for caring more about her bio kids then the crippling pain her stepdaughter was in.", "Sorry, what does your wife expect you to do? Leave your eldest by herself?? Sometimes we have to make choices that are not easy but that are right.", "Nta but I feel bad for the younger daughter", "I also have an autoimmune disease that affects my joints. Mine is very mild and I still require a cane for walking assistance and have to stay home sometimes because of how bad it is. NTA. Your other daughter is 4, there will be plenty of other things you can still show up for.", "NTA\n\nyour wife is the A. Her behavior will affect how the twins see their stepsister.", "NTA. My childhood friend's mother had rheumatoid arthritis. She was in so much pain, even when she was a young mother. She eventually succumbed to it in her late 40's.", "Did you communicate with your wife that you wouldn't be attending? What a shame your younger daughter didn't want to perform if you weren't there. I wonder if it was the way in which that information was presented to her?", "NTA It’s not like u didn’t go because u wanted to just be lazy. U had a legitimate reason. I think it makes u a great parent", "NTA op. Had your oldest been your wife’s biological daughter and your youngest not would she have said the same thing? Unfortunately many step parents are one eyed when it comes to their step children.", "Yes, this is the comment I was looking for. OP is definitely NTA and it sounds like his wife is being an AH. \n\nOP, as you navigate this complicated family dynamic, it will be really really important for you to make sure that your younger children don't perceive you as putting the older child first, either because she's older, because her mother died, because she's from another marriage, or because she has an illness. Those things can all be true and yet you need to make your kids feel like they are all equally loved and all equally important to you. It's not going to be easy to navigate, but it's good that you're thinking so carefully about it. I really hope that your wife doesn't always have this attitude of putting the younger kids first. If she does, you've got a bigger problem that might never go away.", "Yep fellow hEDS/POTS sufferer here with suspected MCAS.  On my bad days I have no balance and fall down stairs or flail trying to open a bottle of orange juice with those stupid pull tabs or even texting something longer than a few sentences.  If my wife or someone isn't able to aid me, I just stay in bed and try to conserve water because one bottle is all I have for the next day or so unless I want to risk a trip to the kitchen.  And yes the doctors recommend I try and stay active to maintain muscles to stablize my busted ass skeleton.", "Thank you. I'm glad you're clear!"]}