{"id": 14329, "submission_id": "12g5ktm", "title": "AITA for calling my son ridiculous for asking me to uphold a promise I made more than 20 years ago?", "selftext": "Not from the US.\n\nI have two sons: Jake (30m) and Carlos (30m). Carlos is technically my stepson but he's my son, I adopted him.\n\nI have a ranch.  It's only 2 hours away from the city so I used to go every week with my son Jake when he was little. In one of this trips to the ranch I off handedly promised him that one day, the ranch would be his. \n\nI met Carlos's dad when Jake and Carlos were 6. I married him a year later. Both Jake and Carlos used to go with me almost every week with me to the ranch, depending if they were busy. When they were both 16, Jake picked up football pretty seriously, so he couldn't go to the ranch so much anymore. Carlos continued to go with me until 18, when he went to college and and studied engineering in agronomy (don't know if this is the correct translation). Jake got a degree in finance. \n\nAfter college, Carlos asked me if he could move to the ranch to work there full time. Of course I agreed. That was 8 years ago. Since then, he has made great improvements and I can confidently say he is the biggest reason as to why the ranch is thriving. He also now has a wife and a little girl who live there full time. On the other hand, Jake didn't really show any interest towards the ranch, he maybe goes once every four months. \n\nI was having dinner with Jake the other day. We were reminiscing a dear family friend who recently passed away without a will and how his family is now looking towards a long process of litigation because they couldn't agree about how to split his stuff. I said \"good thing that I already decided mine\". Jake was surprised, and asked me how I'm going to split my net worth. I told him that the stuff from her mom was going to him, and the ranch was to be split between Carlos and him and the house will stay with my husband.  \n\nJake then asked me If I remembered the promise I made to him when he was 6. I said I did. Then he asked me why I'm not honoring that promise. I was shocked. I asked him if he was being serious and he said yes. Then I said \"It's insane that you are expecting me to do that. You're being ridiculous\".  He was not happy. We finished dinner quickly after that, and when I told him goodbye he said to me to not contact him for a while because he had to sort out his feelings about this. \n\nThat was a week ago and he hasn't returned any of my calls. Carlos is also mad at me because Jake is basically his best friend and hasn't talked to him either. My husband is staying out of all of this.", "created_utc": 1681005807, "permalink": "/r/AmItheAsshole/comments/12g5ktm/aita_for_calling_my_son_ridiculous_for_asking_me/", "score": 1065, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Maybe I'm the asshole because I promised my son something when he was little and never told him that I changed my mind. Also, instead of staying calm I called him ridiculous.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  Carlos has sweat equity in the ranch, at this point.  You would be justified in leaving the ranch to Carlos alone.   But you are splitting the ranch so Jake gets half of it.  That's fair, and it's not breaking a promise.  If Jake wants the entire ranch, he can buy out Carlos' half, which Carlos has EARNED.", "OP, make sure your attorney has an airtight will with your wants clear as crystal. \n\nNTA", "Does Jake want to get nothing? Because this is how he gets nothing.\n\nNTA", "NTA. when you had another son he should have realized then that things would be different.", "NTA. Not sure if the people calling Y T A have kids, cause it’s weird for them to be saying you should be keeping the promise to give a whole ranch to a 6 yr old child (You we’re obviously being sweet in the moment). Not to mention you didn’t have two kids at the time.", "ESH - you handled the conversation very badly. You should sit down and talk to both of your sons and try to clear the air now. \n\nHaving said that,  you are free to distribute your estate how you choose and both your sons need to understand that.  You made a stupid, shortsighted promise when you shouldn't have but circumstances are different now and you have two sons.", "You hear stories like this a lot. Ranch gets passed down. 1 child gave up their lives to work it the other ran off to the city. When the parents die the ranch ends up split and then it’s bought by a developer and turned into subdivisions. Corb lund has an amazing song about it. “S lazy h”. So basically. You give it to both of them. Jake will cash out Carlos will have to sell to pay it off and the ranch is gone. Jake forfeit any claim when he abandoned it. You need to ask yourself where you want the ranch to be in 50 years. With your grand kids or turned into a cookie cutter subdivision.", "NTA - you made that promise when you had 1 son. Now you have 2 sons.\n\nDoes the ranch make profit? Is it a business?", "NTA because Carlos exists in your life and he has taken care of the ranch. He has a right to it. HOWEVER, you could have worded it better. I think it would be good if you apologized how you came across and explained your reasons: you have another son, Carlos is taking care of the ranch, and he has a right because he lives there and obviously loves the ranch.\n\nKeep your distance, though, because it is obvious he is hurt. If you want, write a letter to explain this. But dismissing his hurt as a \"this is ridiculous\" is not the way to talk about this.", "Nta, it is insane to think a promise someone made to you at 6 will be lifelong. Especially if he just sees the ranch as an asset and your other child sees it as a livelihood. Quite immature of Jake imo.", "NTA. The ranch would still be Jake's, he'd just have to split it with his brother -- who, based on what you have said, has put more effort into it than him. Also he's a grown ass person and has shown significantly much less interest in the ranch, according to you. I'm sure he can get over being told the truth (that he's being ridiculous).", "NTA. Rather than saying it's insane of him to expect you to honour the promise you should've told him that he has displayed zero interest in the ranch so your promise is null and void. He should be happy you aren't giving the ranch completely to Carlos.", "YTA *for calling your son ridiculous and saying that him wanting you to honor your promise is insane*\n\nYou are N T A for deciding to split the property between both your sons considering the promise was made before your second son entered the family.", "NTA first, he is still getting the ranch- he will have shared ownership. Second, circumstances change; you have two sons now, one of whom put a lot of sweat equity into the ranch.", "NTA. Remember it’s your ranch. Him raking that up is a cheap trick. Maybe you won’t even own it when you pass. It’s all utter nonsense.", "Yes YTA for calling your son ridiculous for expecting you to keep your promise. \n\nYou could have discussed it and made your case as to why you felt it was okay to break your promise, but nope, you just called him ridiculous for having believed you would keep your word.", "A bit YTA-  you changed your mind without talking about it to the kids. It sounds like Carlos has put a lot of sweat equity into the ranch. Is he being paid for that, or is it assumed to be part of his inheritance?  \n\nJake hasn’t put in that work, and he still assumes he gets everything. \n\nYou need to absolutely sort this out now or it’s gonna be a fight when you die. Be honest with everyone-  because the lies are the cruelest part.", "In answer to your actual question YTA. NTA for dividing the will fairly, but Ahole territory for belittling him like that.  Would he have expected this promise to be upheld if you had birthed other children as opposed to adoption? Seems to me he considers Carlos less than for this reason. Hopefully with time he may come around but don't push it. Give him space for now.", "YTA. You made a promise that meant a lot to him, and when for good reason reneging on it, you called him insane and ridiculous. An explanation was warranted, not name-calling and belittling.\n\nYou’re not TA for how you want to divide your assets, just the way you handled this conversation.", "NTA, but it’s close - Jake hasn’t been interested in the ranch since he was a teenager. In the meantime, Carlos has joined the family, gotten a degree related to running the ranch, has been improving the ranch for the last 8 years, and it’s his family home now. \n\nJake had no business asking you how you were splitting your net worth and you shouldn’t have answered him. But the way you answered him was unacceptable and of course he’s angry at being called names but he has no reason to be angry at Carlos or to be avoiding him. Personally, I think you’re doing a huge disservice to Carlos by splitting ownership between he and Jake. Talk to Jake and ask him what he planned to do with the ranch if you gave it to him and see what he says - but first apologize for the way you responded to him. Carlos deserves full ownership of the ranch at this point. It’s his home, his family’s home, and possibly his full-time job? Redo your inheritance documents and don’t tell them how you’re dividing your assets.", "INFO - Are Jake and Carlos getting aprox. equal dollar value proportions of the estate.", "Soft YTA. You are in your right to decide where your property goes, but you should sit him down and explain why it’s going somewhere different than where you promised it would go", "YTA for discounting your son's feelings about a promise that was clearly important enough to him that he remembered it over 20 years later. You have every right to split the property how you want, but you owe him an apology for calling him ridiculous and not understanding how much weight he put on the promise.", "Wait, why is Carlos is mad? Are we missing something????\n\n\nI want to say NTA.  \n\n\nAnd those calling you the A-hole need to stop.  You’re not like that woman who made her twelve year old to pay off the swimming pool once the daughter got a job.  You can’t make a verbal agreement with a child unless they shown interest through their life.  Jake show no interested on the ranch and might sell it off for profit.", "YTA I know at the time you were thinking you wouldn't have another kid so it wouldn't be a problem, but time changed things. Since the boys are best friends you could have broached this as \"I was intending on splitting it between the two of you how do you feel about that?\" He might have been ok with it if you had an actual conversation with him about it, and heard him out. But instead you blindsided him then belittled him! \n\nI don't know what your solution is since now you've done the damage. How does your husband feel about it?", "Personally YTA. I have a friend who “bought” her parent’s house for a dollar when she was a young kid. Her parents have it in their will that she gets the house and her sisters don’t have legal entitlement to that property. Currently one of her sisters lives in the house and before she makes any changes to the property she has to ask their parents, and my friend. \n\nDon’t make promises to kids you don’t intend to keep, kids will always remember.", "YTA you broke a promise, and more than just that, you've done so in as brazen and hurtful a way as you could. \n\n\nYou remember the deal you made, but you just decided you dont have to actually live up to what you promised your child and told him that directly.", "YTA. A promise is a promise. Why would you even consider breaking it?", "YTA\n\nthats why you dont make promises to children, they ALWAYS remember that shit. You set yourself up 20 years ago, now don't run from it", "ESH he should have realized as an adult that things were different as you have 2 sons now BUT why on earth did you wait til he was 30 to tell him. And clearly your words when he was 6yo were taken seriously by him so you were out of line to call it ridiculous!", "YTA for how you handled it. Its understandable that you would change your mind given that Carlos asked to move to the ranch and all and has been clearly involved while Jake hasn’t. You’re not the AH for that. I agree with that decision and I think you are actually still being generous to still spilt the ranch when Jake seemingly has done no work and Carols has. To just respond to Jake that he’s insane for thinking its the same though is really…wow. Explaining the fact that Carols has been very involved when he hasn’t I think would have gone a long way.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNot from the US.\n\nI have two sons: Jake (30m) and Carlos (30m). Carlos is technically my stepson but he's my son, I adopted him.\n\nI have a ranch.  It's only 2 hours away from the city so I used to go every week with my son Jake when he was little. In one of this trips to the ranch I off handedly promised him that one day, the ranch would be his. \n\nI met Carlos's dad when Jake and Carlos were 6. I married him a year later. Both Jake and Carlos used to go with me almost every week with me to the ranch, depending if they were busy. When they were both 16, Jake picked up football pretty seriously, so he couldn't go to the ranch so much anymore. Carlos continued to go with me until 18, when he went to college and and studied engineering in agronomy (don't know if this is the correct translation). Jake got a degree in finance. \n\nAfter college, Carlos asked me if he could move to the ranch to work there full time. Of course I agreed. That was 8 years ago. Since then, he has made great improvements and I can confidently say he is the biggest reason as to why the ranch is thriving. He also now has a wife and a little girl who live there full time. On the other hand, Jake didn't really show any interest towards the ranch, he maybe goes once every four months. \n\nI was having dinner with Jake the other day. We were reminiscing a dear family friend who recently passed away without a will and how his family is now looking towards a long process of litigation because they couldn't agree about how to split his stuff. I said \"good thing that I already decided mine\". Jake was surprised, and asked me how I'm going to split my net worth. I told him that the stuff from her mom was going to him, and the ranch was to be split between Carlos and him and the house will stay with my husband.  \n\nJake then asked me If I remembered the promise I made to him when he was 6. I said I did. Then he asked me why I'm not honoring that promise. I was shocked. I asked him if he was being serious and he said yes. Then I said \"It's insane that you are expecting me to do that. You're being ridiculous\".  He was not happy. We finished dinner quickly after that, and when I told him goodbye he said to me to not contact him for a while because he had to sort out his feelings about this. \n\nThat was a week ago and he hasn't returned any of my calls. Carlos is also mad at me because Jake is basically his best friend and hasn't talked to him either. My husband is staying out of all of this.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Does Carlos think you should give it to Jake?", "Well I have to ask WTF Op didn't explain it to Jake just like they explained it to the internet. Instead of saying \"I don't uphold my word\". Something along the lines of I think Carlos deserves something because he works on the ranch and you have ignored it for years.\n\nCommunicate FFS.", "I wouldn't even split it 50/50. I would take the value of the ranch before Carlos started improving it, and split that 50/50. Jake inherits that value, Carlos additionally gets everything he's built.", "^ NTA", "If anything Jake is an asshole for not giving a damn about Carlos.", "At least OP is not like the mother who hold a promise for 5 years her twelve year old daughter to pay off a pool they desperately wanted.  Now **that** was an A-hole.", "My thoughts exactly", "20 years ago it was more of a passion project that generated enough profit to support itself. Since Carlos took over the ranch we started to see profits and now it is a successful business.", "When a parent tells a child \"one day, this will be yours,\" that means something. The child will build their life around that axiom. They have been told their destiny. Like Simba and Mufasa. It's not for everybody to be a rancher, easy to imagine the kid might bail on that. But they won't ever forget, and it certainly won't be insane to think the promise will be kept.\n\nAll promises are lifelong. That's what promise means.", "Yes, I agree that the way I went about it was horrible. I will do everything in my power to apologize to Jake.\r  \nI really don't think Jake sees Carlos as less than. He was very happy when I decided to adopt Carlos. I think he was just caught off guard by the fact that I decided to split up the ranch.\r  \nI'll take your advice and give Jake some space. He is my everything. I hope I didn't do too much damage to the relationship.", "I agree with this completely. YTA\n\nYou could have even pointed out that his half of a thriving ranch is worth an awful lot more than full ownership of a ranch that he does not pay much attention to. Jake is lucky to have his brother as a business partner if his brother is truly invested in the venture and is lucky to have half of what you and then Carlos have worked so hard on. I was honestly surprised when I read you were still giving him half. That's more than fair.\n\nIf you had explained it with even that much compassion then the conversation would have been different. You instead chose to act baffled as to why he was surprised the plan has changed. He sees his mom's word as infallible and you mocked him for it. You owe your son an apology for that. Definitely not for your plans to split it with him and Carlos though. Your reasoning is rock solid and they both benefit whether Jake sees it immediately or not.", "@RealTalkFastWalk: This is the winning answer. I just wish I had an award to give you.", "Carlos is mad because he thinks I should have talked to Jake in a calm manner instead of calling him names. He agrees with spliting the ranch, but he's concerned it's going to impact his relationship with his brother. They have been best friends since they were both 8.", "\"You can't make a verbal agreement with a child.....\" -- That is exactly what she did.", "Because the circumstances are vastly different now? It was a stupid promise to make tbh.", "This promise was made before she knew she would eventually have another son.\n\nAlso, Jake is still being promised ownership of the ranch. Shared ownership doesn’t mean its not ownership.", "Because she has another son who has worked to improve the ranch.", "My exact thought", "Wait, what? Link, please?", "I remember that one!", "You should definitely review this more deeply with an attorney. Leaving 50% of a business to someone who doesn’t have experience in the business isn’t wise. \n\nYou should review with an attorney to see if there is a way to leave Jake equity, but leave carlos as CEO and majority owner of the business. \n\nOr if there is a way to make a 50/50 split of your estate, but leave control of the business to Carlos. \n\nA property is one thing. A business is a whole different thing.", "Maybe you should if discussed everything Carlos put into the ranch or before he did it.", "…but he is still getting the ranch. Its still going to be his. He will still have ownership. 50% ownership is still ownership.", "I hope you work it out. Unfortunately I've seen a family whom I thought were very close splinter apart for this exact reason. An adopted child versus blood born children who thought they deserved more because they were birthed by their parents, never mind the adopted child who was with them since she was born. I'm a hundred percent sure their mother had assumed as you had too before she died.", ">Then he asked me why I'm not honoring that promise\n\nYes, u/BigsleazyG and u/RealTalkFastWalk have it exactly right!  Jake asked the above and you refused to answer the question and instead insulted him.  That was your big chance to explain.", "Oh yeah, you’re the butt hole for calling him names (I think I miss read that at my first read through) but a promise to a child should not be held.  Hell my husband just reminded me that my dad got huffy when I didn’t name my son with my maiden name cause I promised I was going to name my first son to pass the line…… I was 8…..", "At the heart touching moment when he was young!  Did OP took their child to the court house and put their son down as owner of the house?", "But, she did promise. So, she should honor it.", "She said it would be his one day. She can't go back on a promise to her son just because she had another son. Give the other son something else. Her first son relied on that promise. I think it's more that she is playing favorites, which hurt his feelings. But, she should honor her promise. The way she said it was so nasty, too. It was unecessary.", "https://www.reddit.com/r/AmItheAsshole/comments/zj2ep6/aita_for_asking_my_daughter_to_uphold_her_end_of/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "I'm not passing judgement on the thread, I'm just replying to Raindripdrop there who thinks promises made to children shouldn't count and aren't lifelong.", "Have you heard of a Reddit telling that her twelve year old promise to pay the in ground pool (which was 20,000) once she got the job and after 5 years later, the daughter got a job and that OP (from that Reddit) send her a bill to pay it off?  Cause she promised.", "It *is* going to be his some day. She is leaving it to him and his brother.\n\nLeaving the ranch 50/50 to the brothers is quite literally the *opposite* of “playing favorites”.", "going slightly against the grain on this one, but I'm going with YTA.\n\nPersonally, I don't think promises have a timeline on being kept, but everyone's entitled to look at it their own way, and i do concede that altering promises is valid and up to the individuals. \nI do feel that there should have been a conversation explaining the reasoning to your son because, as far as he knew, it was still the promised way. I see your reasoning is quite valid that you had made the promise years ago prior to having major life changes and growing the family. Most people would agree that changes like this will affect inheritances and thus alter promises. I also think your sons feelings are valid for perfectly good reasons.\n\nTL:DR: Now let me explain the reason why I can agree with your reasoning but still lean towards YTA. \n\n>I asked him if he was being serious and he said yes. Then I said \"It's insane that you are expecting me to do that. You're being ridiculous\".\n\nThis interaction right here, your son was communicating their feelings on the broken promise, and rather than having an adult discussion explaining your perfectly valid reasoning to your son, you decided to essentially Gaslight them. That's not how family should act with each other, and for this reason, YTA.", "ONE WEEK!  That is no time at all. You are so hurt that he can't return your calls. He asked for time! Why are you not giving him time? He is not asking for anything but TIME TO ADJUST!  Give it to him. \n\nYTA for not even giving him a week without nagging him.", "YTA for the way you answered Jake’s question. Jake asked you a serious question, & instead of giving him a serious answer, you mocked him & called him ridiculous.  Why didn’t you give him an actual answer & explain why you changed your mind? Your son is an adult, and you should talk to him like he’s 30, not like he’s still that 6 year old child.", "Yta for promising. A promise is a promise. Don't make promises, especially to kids, if your not going to keep them. You should never have said it.", "NTA. If he wanted the ranch he should have put the work in. He probably only want to sell it, there’s no other reason I can think of for him to insist you give him full control of a ranch that he hasn’t done a thing for since high school and that his brother alone has worked at, built up, lives at, and genuinely cares about. He hasn’t contributed to or cared about it. Plus, any promises of inheritance are generally changed once you have more siblings. If my parents promised me their house and then had another kid I would assume it would be split, not that the entire house would solely be mine based on a “promise” made before that sibling existed.", "NTA. He’s getting it isn’t he? You said “this will be yours” you never said “this will 100% be yours and you’ll never share it with Anyone”", "Im withholding judgement and just saying you need to have a family conversation about what will happen to the ranch. You need to hear what they were thinking would happen, you know, what they were planning for. You need to explain your plans and motivations. And probably talk about what you want to happen when they do own it one day.", "Every thread like this makes me certain that so many people on reddit are completely unhinged.\n\nWhen I was 6 my dad promised we'll travel to Jupiter because I kept insisting about it, I don't plan to uphold him on it. You didn't even have more kids back then.\n\nOP - you NTA, if Jake really thinks this way because of a promise that was made to him when he was 6 he needs to grow the fuck up.\nIf he thinks this way because Carlos isn't your biological son then this is something that needs to be addressed at a family therapy session since Carlos is your son (you adopted him) and has been so for pretty much all of his life.", "situations change and Carlos has put the effort to make the farm thrive, sounds like Jake only wants a steady paycheck from the farm or sell the land and pocket the money.\n\nNTA, better get your estate in order.", "Based on the information provided, I would say that you're NTA in this situation. While it's understandable that Jake may be disappointed that the promise made to him as a kid isn't being fulfilled, it's important to consider the current circumstances. Carlos has been working at the ranch for eight years and has contributed greatly to its success, while Jake hasn't shown the same level of interest or involvement. It's also worth noting that the you aren't leaving Jake with nothing. He'll still get an inheritance from his mother's estate. Ultimately, the decision to split the ranch between Carlos and Jake seems fair and more than reasonable.", "NTA. I would probably give it all to Carlos after this display. Jake wants everything for himself with no regard to the labor and value of his brothers work and the changes that have happened in your family since he was six. I think you’re being too generous with Jake.", "YTA. You shouldn't promise things off handedly. Most people know that. Now you've driven a wedge between him, yourself, and his brother. You didn't have to sat what you said, so idk why tf you did if you weren't planning on following through.\n\nLet me make this clear, my vote isn't for deciding the ranch goes to Carlos. It's for making a promise you had no intention of taking seriously. I don't care who a promise is to or what age they are. They're not something you should just say.", "NTA, although I'm not sure why Jake feels entitled to any of the ranch. He hasn't put an ounce of work into it and only visits about 3x a year? Carlos built it to what it is now. That's his home now, where his family lives. I would not be ripping that away from him. \n\nI definitely feel like your son deserves something, but not the ranch. He would basically be profiting from the 8 years Carlos has spent building it up. Doesn't seem right.", "YTA, but not for failing to follow through on this careless promise. It *would* be ridiculous to leave Jake the ranch, given the situation. The reason YTA is that it’s not cool to make frivolous promises like this to your children when you don’t truly mean it. Clearly, they might remember such promises and form certain expectations in their mind, which will absolutely crush them when they find out the promise wasn’t real.", "NTA,\n\nYou are fulfilling the promise, he is getting the ranch along with his brother.", "NAH. You can't be expected to keep a promise you made when he was 6 and actually interested in your ranch whilst Carlos has worked hard to revive it. But did you even tell your son that this was your reason for splitting it? From what you've said here, you just called him ridiculous. How is that supposed to solve anything? You may owe him an explanation", "Ik I’m going against the grain, but ESH. Instead of telling Jake, “It’s insane that you are expecting me to do that. You’re being ridiculous,” you could have explained how Carlos has clearly worked hard and has provided massive improvements for the ranch whereas Jake hasn’t shown any interest towards it until now.", "YTA, not for your decision but for how you put it to your son. Why call him insane, when you could have explained?", "ESH - except Carlos. Jake should have more understanding, and you shouldn't have made an \"off-hand promise.\" Especially to a child. A promise is a promise.", "YTA not for your decision, but for how you responded to Jake and basically didn't communicate with him at all. Both he and you remember it as a promise to him - he obviously feels betrayed by you reneging on that. Go apologize and explain your decision in a mature, adult way.", "YTA for making a promise to a 6 year old child, you had no intention in keeping.\n\nSo Jake isn't getting anything? I can see why he is annoyed, I would be too. What's he getting? Debt because he will have to buy his own house and find his own place to live since he is getting nothing.\n\nThat conversation when he was 6 meant a lot to him and very little to you. He feels betrayed. From his eyes he is thinking, my mom loves her husband and step son more than me. And since you are giving your new family everything over your son, he has good reason to think so.", "YTA. You should not make promises that you won’t keep. While Carlos certainly has earned half of the ranch, Jake has a right to feel hurt. You promised him something and are acting as if he’s crazy for trusting your promise.", "N T A for the decision itself, but light YTA for how you responded to him (which is the question you're actually asking here). I think you could have handled this a lot better. You didn't have Carlos in your life when you made the promise, right? And everything that happened thereafter with Jake and Carlson's respective relationships with the ranch hasn't happened yet either. You could have explained to Jake why your thinking changed, and said you didn't realize it still mattered to him because he hasn't shown much interest in the ranch or brought up that promise in the intervening years.\n\nPromises like that, even made offhand, can be very powerful to a small child. He's grown now, of course, but I don't think it's completely shocking that his lingering 6-year-old certainty about it might have meant he hadn't really considered it practically, or even as a question at all. I think splitting the ranch between him and Carlos is more than fair to him, but going straight to \"you're being ridiculous\" was not a great way to go about the reality check.", "An explanation of what was promised would help determine if you’re NTA/YTA?? The promise that Jake would get the farm 100?", "Maybe Jake thinks he couldn’t really go to the ranch that much because he’d get in the way of Carlos and his family and might not be fully welcome? Does Carlos pay rent and/or get paid? Are you giving one son free housing and/or other benefits? Maybe Jake feels pushed out, like you might prefer Carlos to him?\n\nWas this discussed with Carlos? If so, he didn’t think giving his brother/best friend a heads up? Did Carlos know about the promise? Did he plan to work the ranch with the hope the promise would be broken?\n\nWill there be restrictions on dividing the property? Jake will have an asset he won’t feel comfortable using, especially now that Carlos definitely owns half? But Jake will still be liable for taxes and other liabilities? What if expenses need to be paid? Jake has to pay? Will he receive income from the ranch?  What if Carlos is hostile to Jake when he comes to the ranch? What if Carlos and Jake disagree about how to run the ranch?\n\nDid Jake make any plans about his future, thinking he would inherit the ranch? Did he plan that to be his kids’ education fund? \n\nYou can’t make a promise, let people make significant decisions based on that promise, then act shocked when they are justifiably angry when the promise was meaningless. \n\nThis is a mess and you’ve set your kids up to argue and possibly ruin their relationship, whether now or after you’re gone. All of this should have been discussed with both sons, but probably with Jake first because of the promise. You guys could have come to an agreement amicably and saved this animosity. \n\nYTA", "Lets be honest. Jake is just greedy.", "Children remember important things for ever. A promise made to a young child matters.", "🎯This. This. This.", "“You made that promise when you had 1 son. Now you have 2 sons.” That is what OP should have said. Instead they called Jake names & offended both Carlos & Jake.", "Sometimes you have to call a spade a spade. his son IS ridiculous for expecting to get the ranch at this point.", "Has Carlos been living there rent free?  I think that’s something to take into consideration.", "It’s not mind changing or lies though… the ranch will still be Jake’s, along with his brother.  For him to watch his brother work his ass off for years secretly expecting it’ll one day be solely his is the AH move in this story.", "If it meant a lot to him how come he barely ever went to the ranch and didn’t put any work into it?", "OP is still honouring the promise though… the promise to Jake was “this ranch will be yours one day” which is true.., OP IS leaving the ranch to J and his brother. It’ll still be half his! But I agree OP handled the conversation badly…", "Jake is being insane and ridiculous. Belittling is appropriate for this. \n\nHe’s a grown man. Trying to hold his parent to a promise when he was 6. He should, in fact, know better.", "> It's for making a promise you had no intention of taking seriously.\n\nexactly. A promise of that magnitude to a child  - they carry it through their lives.", "But OP is leaving the ranch to Jake. OP said the ranch would be his and it will be just not solely Jakes.\n\nSaying \"one day this will be yours\" or \"i will leave the ranch to you\" does not mean sole/exclusive ownership. \n\nSo OP is still fulfilling their promise, because thw ranch will be left to Jake and he will own it, just with someone else.", "That is a very good point!", "Yes. It’s very unlikely that Carlos has been getting a competitive salary for the work he’s put in, so he’s owed a lot. And that would also give him control, which is important since he’s the one who’ll know how to run it.\n\nJake isn’t a good friend to Carlos if he wants to take away what Carlos has earned. Nor is he a good brother if he doesn’t recognize that OP has two sons now, not just the one son that the long-ago promise was made to.", "She adopted Carlos - 1/2 is totally fair. Even if there was no formal adoption, she can leave her property to whomever she wants.", "I'll second that.", "These are promises you can make to a 6-year-old: I will always love you. I will always protect you. Issues about how you plan to distribute your estate? Not so much. \n\nAnd if you break a promise to a six-year-old, while they are still six, sure. that can be a big deal. But this a thirty year old man who doesn't seem to understand how the world works.", "If mom had blood birthed a little brother, would that kid be closed out of inheriting the ranch? No.\n\nBio-son is the AH. Even grimy hedgefund bros are someone's disappointing kid.", "Seemingly only when it's money related.\n\nAlso I wouldn't call something a promise without it explicitly being stated it's a promise and not is it an absolute guarantee that it will come to fruition.\n\nIf anything it's ridiculous he's getting a share at all, after all the work put in Carlos should have full ownership.", "I'm no expert on your life, but does your son feel somewhat not special to you, to want something to himself from you? This could be a reach, but the reaction to not getting the ranch could be a confirmation in his mind that he is not special to you. Could be worth exploring in conversation?", "why did carlos go into agronomy? did ou promise him the ranch too?", "You should also bring up that the ranch 20 years ago is very different to the ranch of today, that a self-sustaining piece of property was one thing, but it is now a profitable business. The business is in large part due to Carlos, and giving it solely to Jake would be shitty\n\nMaybe write him an email so you can get it all down but he doesn’t have to interact with it or you until he wants to - that way it will be up to him", "I would seriously ask Carlos if he wants the ranch.\nIt sounds like it's solely because of him it's now profitable.\nI think you should figure out a way to get Carlos the ranch and split the rest.", "1) he still gets half the ranch, his brother gets the other half\n2) he has no real interest in the ranch and pursued a completely different path in life\n3) his brother had turned said ranch into a profitable business, and absolutely deserves part of that ranch (if not all)\n\nOP is NTA, but the dude in finance thinking lion king rules apply and he can cut out his brother certainly is.", "Lion King? Really? Okay. Simba was the heir apparent to a kingdom. \n\nJake didn’t build his life around the ranch. He didn’t care about it and got a degree in finance.\n\nNot all promises are lifelong. Some promises aren’t even real when they are made. Inane promises made to a child are not real.", "So let's talk pragmatically. This is Carlos place of residence and business. Carlos can do whatever he wants on the ranch. \n\nCan Jake do the same? Say he wanted to keep a car collection or wanted to build a house on the property or wanted to add a coy pond. I assume the ranch has a house, what if you wanted to move into it?\n\nHow much can Jake actually do on the property?", "It's a little weird that he went into soil management and crop production. It's almost like he had his eyes on the ranch or was told he would be getting it by the OP\n\nEDIT: agronomy is the science of soil management and crop production", "You might be misinterpreting what I'm saying. What I'm saying is that lets say the ranch was worth $200k before Carlos took over. After his years of building it up, it's worth $400k. Jake gets to split the $200k that it was originally worth before Carlos put in the work. Carlos inherits half the original value plus everything he's built since he took over.", "Yes. Especially since, despite him having counted on that long-ago promise, Jake may really be seeing dollar signs not sentimental attachment.", "Yeah, sure, I've heard S Lazy H, Carlos is cool, half is fine, I'm talking to the person I replied to. Keep your promises to your children. And all promises are forever.\n\nI mean, I guess if I have to address it- They should have talked to Josh first, they should have said \"we know it was yours, we said that when we had only one son, look at how Carlos has loved that ranch, we're passing it on, but you still get a fair share.\" He wants to nab it all, he's an asshole. But OP is definitely an asshole for thinking its \"ridiculous\" that he would remember or expect that promise to be upheld. It was a promise of a home in posterity to a child of your blood. That's like- the whole point of human society up to this point.", "\"This, our property, real estate, will one day be given to you to live in\" is not an inane promise made to a child, its the original point of property. It's the whole thing we've been doing as a species for 6000 years since we invented it, working, making homes, giving those homes to our children. Until the 20th century, anyway. But still a pretty big part of the whole thing.\n\nAgain, agreeing Carlos should get the ranch and its perfectly reasonable to expect that him taking it over and Jake ignoring it, as well as the natural compromises that come with adoption, significantly alter the circumstances of that promise in ways that are perfectly fair. But don't make inane promises, and keep your promises to your children. If any promise isn't real, to you, no promise is real, from you. They will learn.\n\nEDIT: The point of mentioning the Lion King is that a 6-year old understands what \"This will all be yours someday\" is and means, because they have seen the Lion King. They understand that promise has weight, it is the circle of life, the inheritance of parent to child, their land, their place. When they said that to Josh, he almost surely thought of Mufasa and Simba and \"everything the light touches,\" 6-year old boy that he was, and that meant something to him.", "Exactly…. I Have 3 children and I could say to any one of them “this property will be yours one day” and it’s true. It’ll be split 3 ways and all three can claim ownership of it. That’s not a failed promise.", "Seriously?\n\nLook, some promises are stupid. Some promises are short-sighted and ultimately not reasonable to keep. (Frankly some promises should never have been made, but I can understand why OP made the promise they did if they hadn’t expected to have additional children. And since Carlos is adopted, he IS her additional child.)\n\nKeeping a promise made when she only had one child but now has two, and means the one child who has put in YEARS of work and turned it into a successful business now gets no part of it would be cruel.\n\nThe fact that one son has watched his brother work for years to make it successful all while believing that brother would get nothing is pretty damn fucked up.", "So she should give what is likely the vast majority of her estate to one son due to an ill-advised, spur of the moment promise to a 6 year old even though she now has another son,  one who haa put years of sweat equity into it and greatly increased the value of the business through his efforts? And she's supposed to just conjure up \"something else\" of similar value to give her other son out of thin air?\n\nPart of maturing into an adult is learning to not view things as black and white like children do. Her son needs to do this.  Circumstances change and people make mistakes. Does he expect couples to not ever divorce too, since they made a promise to love each other until death?\n\nExpecting his brother to be basically left out of the will just cuz  he wasn't around when the promise was made is totally unfair.", "Koi is the fish. Coy is pretending to be shy to make yourself look more attractive.", "Or, I don’t know, he developed an interest in that area after going to the ranch for years.", "He's been going to the ranch every weekend since he was 7 and you think it's a 'little weird' he developed and pursued an interest in farming?", "Or maybe he saw the ranch and wanted to learn more about how to make it better. Kinda like how kids learn the family business.", "MY HERO", "Given his degree in finance, I wouldn't be surprised.\n\nYes, fiance would be of some benefit to a business, but Carlos's degree is more beneficial to the business since Jake wouldn't know what the ranch needs to have brought so it can make the money Jake wants/needs.", "Any lifelong promise made to a 6 year old is inane. They are by definition not real. \n\nWe also tell them Santa is real.", "I’m not buying that.  Carlos wanted to live on the ranch and probably has been living there rent free. The way OP dismissed her son’s feeling is an asshole move.  And if Carlos has been living there rent free, and supporting his family off the ranch, I have a problem with giving him so much credit.  YTA.", ">and ultimately not reasonable to keep.\n\n not the important ones. \"I promise we will go to the park this weekend\" is unreasonable to keep if there is a tornado outside. Inheritance promises is around family unit and mutual responsibilities - reneging on them needs a damn good reason.", "Auto correct my friend.", "It's possible.", ">If any promise isn't real, to you, no promise is real, from you. They will learn.\n\nMy parents never made me a promise they didn't keep. If yours did, I'm sorry. If you make promises you don't keep to your children, I'm *really* sorry.", "You don’t want to give credit to someone for doing the work because their parent didn’t charge them rent?\n\nWhich you don’t even know, you’re guessing.\n\nAnd yeah, sometimes feelings are shitty.\n\nJealousy, entitlement, possessiveness - just because it’s a feeling doesn’t suddenly mean it’s right.\n\nI do think OP handled it badly, but I don’t think she was wrong.\n\nWhen a parent has two children it is ridiculous to expect that one will be cut out from an inheritance, especially based on a promise made before the second child was born or adopted.", "Adding a second child to the family by birth or adoption is a damn good reason.", "Not when made to a six year old. \n\nNot when a new son has been added to the family. \n\nYou’re acting like OP made the promise to a 30 year old. She made it to a small child.", "This is why YTA", "Curses. What a dastardly enemy.", "Here’s a normal promise you make to your child. \n\n“Don’t worry about the monster under your bed, I’ll always be there to protect you”\n\nBecause the point is to make them feel better in the moment because you will, in fact, not be always there to protect them.", "Reddit, man.\n\nSometimes the responses can be fantastic and empathetic, thoughtful and not holding back.\n\nAnd sometimes they are completely disconnected from any reality of how to treat people.\n\nAs if being a promise means it’s always ethical.", "\\>\\_> From the monster under his bed? Surely he'll be sleeping in the same house as one of you for at least as long as he believes there's a monster under there. That one feels... real easy to keep. If you ever didn't come in when he was scared of the monster, and check (or at least, remind him monsters don't exist and he doesn't have to be afraid), that would surely be hurtful to him and he'd feel betrayed, right? So the monster may not be real, but the promise is, and you mean to keep it, presumably? And likewise, you would hopefully be there to protect your child, such as you might, for your own entire life, though the definition of protect may vary wildly across that life.", "NTA. It’s still gonna be his, just not *all* his. Besides, is he expecting to just oust the son who actually worked the ranch and cares about it? Or is he planning to move in and be Carlos’s boss? Either is pretty presumptuous.", "Info: have you considered how Jake would get the value of his half of the ranch from Carlos? Would Carlos have to sell it to pay Jake?", "YTA", "YTA not for splitting it equally but for not explaining all you said is your word doesn't mean anything and left it at that that's an AH move", "YTA \n\nbut a mild one.\n\nyou made a promise, you should uphold it, or at least have a discussion, an adult discussion about changing it. changing it unilaterally, whether warranted or not, is never going to come across as honourable", "ESH. Jake for assuming he can waltz into a big inheritance that he hasn't shown any interest in for literal decades, and you for being so dismissive about a) his feelings and b) a promise you freely made, instead of actually talking about the situation properly. \n\nWould it have killed you to take Jake seriously? You could have told him that you thought he'd lost interest in the ranch, given his lack of attention to it since college, and that you thought his friendship with his brother and their combined talents would both be valuable in providing continuity for the ranch after you pass.", "So he had lil or no interest in it growing up or as an adult. So he just wanted the money after you die... nta. Give it tothe stepkid actually working it, putting in time, makin it better and EARNING it.", "My grandmother promised me the diamond from her wedding ring when I was 3. She meant it then and it means a whole lot she means it now - on a good day through dementia-\n\nYTA", "Maybe it's just me, but I think there \\*might\\* just maybe, have been a more diplomatic and empathetic way to tell your son that you had changed your mind about the promise, other than \"**It's insane that you are expecting me to do that. You're being ridiculous\".**", "I have a feeling that there's probably more going on here, with the short sentence, Jake got a degree in finance.\n\n Your post oozes proudness of Carlos but not Jake. Carlos runs the ranch, he's got a gf, Jake doesn't, he only goes to the ranch every few months. Sounds like Carlos is the golden child.\n\nDoes Jake even live close to the ranch to be able to go more than that?\n\nIt's definitely your decision to do with your property as you wish, but you certainly shouldn't have called your son ridiculous for something he remembered and had no idea had changed. You should have explained your reasoning as above, which is quite understandable but you belittled him in his moment of surprise.\n\nWas Carlos also unaware of your decision or did he know your plans? Because if he did know and Jake didn't then that would most definitely make you TA.\n\nMaybe Jake doesn't view Carlos as a brother!?\n\nAlso you're leaving your house to your husband, what are his plans for when he dies? Is it going to be split between Carlos and Jake or will it go just to Carlos?\n\nETA, changing my ruling to ESH because I think y t a for how you treated your son but he is for being upset that you'd treat Carlos differently, but we also don't know the family dynamics between you all.", "Carlos has based his life around that ranch, Jake would probably just sell it. NTA. As others have said, split the ranch 50/50 before Carlos put his blood sweat and tears into it. Give Carlos everything he has put in, and then some. Let jake have the shed out back.", "NTA. Things have changed. And your son is a AH. He wants to cut his \"best friend\", your adopted son totally out of the asset he has built up and keep it all for himself. Your son just sees dollar signs and ranch would be sold the day he got it.", "NTA. He's greedy.", "NTA!! why on earth does jake think he should be entitled to full ownership of something he's put next to no work in to?? that's foolishness, selfish and extreme greed. \"hey bro, i know y'all put your life into this place but if you could kindly just fuck off now\"....that's insanity. he should be thankful you'll give him split ownership of it for how little he does to help out carlos.", "NTA, Jake has showed zero interest in the ranch. He’s showing entitlement and grew up thinking “oh it was promised to me when I was 6, so I don’t have to do any work whatsoever and it’ll be all mine”. Well that’s not how the real world works and at 30 he should know this. Carlos honestly deserves more than half and you’re being very fair by splitting it equally. Tell Jake if he wanted it so badly he should’ve put in the effort when it mattered.", "YTA. You are only as good as your word…your promise meant nothing.", "> I have a ranch. It's only 2 hours away from the city so I used to go every week with my son Jake when he was little. In one of this trips to the ranch I off handedly promised him that one day, the ranch would be his.\n\nI get that he was 6, but he took you seriously and now it's caused a rift.  AH or not you created a problem that your husband doesn't want to get involved in.\n\nESH works.  Don't be shocked if Jake makes a large change in his life.", "ESH - not because of the lack of keeping a promise you made 20 years ago, but if you had explained to Jake the way you explained to us, you would be NTA. All your reasons are valid. \n\ninstead you told him he was ridiculous with no explanation.", "leaning to YTA  \nyou said the ranch would be his, and you say that it would be split now because he doesn't spend much time there anyway, but how exactly would he? since you let your step son take over the place and move in with his family? that doesn't really condone him going up to the ranch for a weekend and being the odd one out does it? maybe you should have thought it over a little more than just agreeing that your step son could move in without consideration to your own son in the matter", "NTA . Time has passed. Change can occur in a split second so why is it invalid for change when decades have passed? Have a conversation with him, and Carlos and let him realize he is only thinking about his 6 year old self and not the present nor the future.", "One you are overreacting about \"Jake\" wanting to be left alone to sort out his feelings.  This was a blow to him. Not speaking or talking to others for a week, is not unreasonable.\n\nYou re not unreasonable either.  Carlos clearly has an interest in the ranch as he lives and works there.  You state that Carlos is the reason the ranch is thriving.\n\nJake and Carlos are both your sons.  You are trying to treat them equally, as most people would expect you too. \n\nNTA, but maybe this should have been talked about earlier, when the boys were younger.", "NTA, Jake showed little interest in it, and is now using emotional blackmail to get you to honor the promise.  On top of it, the circumstances changed.  I am assuming here that you made the promise before carlos showed up in your life.  It would be silly for Jake to selfishly want nothing to have changed then.", "Generally NTA but YTA for your phrasing. Instead of explaining why you basically just said “you expect me to keep promises to you? You’re crazy.”", "nah\n\nyou’re fine for deciding what you think makes sense in light of 24 years of behavior and information \n\nit makes total sense that he needs time to adjust to the information you shared", "This is crazy! It’s your ranch, you can decide to do what you want with it - you’re son who doesn’t sound like he cares about the ranch at all is still getting half because he’s your son (which is still keeping your word). The reality is he’ll probably sell his half first chance he gets given he has no interest in it. He’s just upset because he was thinking he was going to inherit some $X amount and now he’s realizing he won’t. You’re definitely NTA, your son needs to get over himself.", "YTA children trust adults and believe every word they say. They believe promises made to them and absolutely trust an adult's word. My parents broke every promise made to me. I was finished with my dad by the age of 12 because he never kept his word and I was sick of him looking me in the eye speaking sincerely to me and then breaking my heart. When I had my two kids I was incredibly careful with the way I worded things and never used the word promise. My kids are either side of 30 now and I still make sure I follow through on everything agreed. You had time over the years to point out to make about the work Carlos was putting in. Time to talk to him about how he might think it was fair for Carlos to have a share with the work he is putting in. There was time to ease him into it and make him feel that he had a say in altering the promise. But you just completely blindsided him.. You just tossed it out there. But maybe you are someone who just constantly makes promises and has never really cared about keeping their word and caring about whether your own children trust, or have faith in you as an honest person.", "I'm not sure that pinky promises are admissible on a court of law.\nNTA.", "NTA, but man you could have communicated better. \n\nTelling your 6-year-old only child that they will one day inherit the family home is hardly a promise, it's a statement of how the law works in most jurisdictions.\n\n\"Daddy, what will happen to the ranch when you die?\"\n\"It'll be yours, son.\"\n\"Wow, really?!\"\n\"Yes son. It's called inheritance. It'll be all yours.\"\n\"I really get to own it?! Promise?!\"\n\"Yes, you really get to own it! I promise.\"\n\nIf a year later you had another bio kid, then no reasonable person would be entitled to assume that things wouldn't have changed just a tiny bit in the 23 years since they were a six-year-old only child. Your son just didn't see an adopted kid as your 'real' kid so didn't bother to question it in his mind. \n\nIf you had repeatedly confirmed the promise over the years, and he had relied on the promise to significantly shape his life/decisions then it may be different. But this ain't that.", "NTA. things change. Carlos has earned the ranch and jake has no interest in it. \n\ni may be out of place to suggest this but if i were you i’d leave it entirely to carlos because if jake has half he has the power to make Carlos’ life miserable over it, and it sounds like Jake is pretty resentful so no telling how it may go once you’re gone. you’re already getting a preview of jake’s overall attitude about it.\n\nseen it play out too many times that a well-intentioned provision in a will gets twisted out of shape because some family member got angry and lawyered up. when money is involved people lose their minds and become cannibals, even if they don’t deserve it or aren’t entitled to it - they don’t care, they see it and they want it.", "What if OP had another biological child, rather than adopting their stepson? I don’t think many people would say they should still leave the ranch only to their oldest. No difference, imo, especially since Jake has essentially ignored it, while Carlos lives and works there. Where does Jake get off taking what Carlos has improved & saying he isn’t entitled to any of it? Heck, would Jake tell OP that they couldn’t sell it because they offhandedly said it would be theirs when they were six? Bet he would. NTA, but Jake sure is!", "You did make a promise to a 6 year old kid who to this day wants you to hold up your end of it and just because you have a step son you now want to renege on the promise. no wonder your son wants time to himself what type of mother makes a promise like this then years later breaks it. you are loosing your son for breaking your promise", "This. I would be giving Carlos the entire ranch, but if there was unused property, that could go to Jake, along with the rest of his inheritance. Jake will likely make Carlos buy him out, and if Carlos can't, Jake will likely force him to sell and that will be the end of the ranch being in the family.", "This. If she leaves the ranch to both of them, the ranch will almost certainly be sold off. Jake gets more money. Carlos will have to use his share to get a new place to house his family. He will have to get a different job, and all his hard work will be gone. The ranch will be gone. I would ask the OP to think about whether that's what she really wants before she makes that will.", "I think I also land on ESH. Jake does not exactly come out of this smelling like roses, but OP’s reaction boils down to “You actually expect me to keep a promise to my child?!”\n\nReminds me of the guy who promised his classic car to one son but later gave it to another, but honestly this OP comes off as more of an asshole to me.", "That is a good suggestion. Then you can also see how he acts in front of his Brother", "Yeah, I'd put solid odds on that response being the main reason Jake isn't talking to anyone, especially since it's only been a week. Sometimes it's not that you didn't do something big and expensive it's that you didn't do something small and free, like explaining your reasoning or giving someone a sec to be upset.", "It's completely ridiculous to expect this kind of promise made when the other person was 6 to be upheld over 20 years later. Things change. \n\nOP could have to sell or foreclose the property due to bad circumstances so then that promise is already broken so then what? Expect OP to buy it back somehow before they die so Jake gets his promised property?\n\nOr what if OP had another bio child after the promise was made? Guess that means that hypothetical child will never get a share of that property because it was promised to Jake.", "I think OP’s first, instinctive reaction says a lot about them.", "Unless OP promised Jake he wouldn't have to share the ranch with anyone, the promise has been kept.  He will own the ranch together with his brother.", "I totally agree with your comment. I was unable to communicate in a rational and calm manner. I'm the asshole for that.I guess at the time I didn't think to explain my reasoning because it's pretty self-explanatory, at least to me; When I promised Jake the ranch, neither Carlos nor my husband were in the photo. And after the unfortunate death of my first wife, I wasn't even thinking about falling in love, let alone falling in love with a man who already had a child, so it made sense for me to promise him that.But now I have two children, whom I love equally. That's why it's self-explanatory, but I can see why Jack is hurt and upset with me. I will apologize and learn to communicate without resorting to name calling.Thanks you for your input.", "How do you know that Jake is not aware that Carlos has invested a lot of time and effort on the ranch given that they are close? OPs do not need to explain anything.", "i think it’s possible that op might not be op—the writer slips up and refers to “her” instead of “me” at the end", "You can be right and have no relationship with your kid if you want, or you can be right and talk it out with your kid. This isn't a black and white thing. OP doesn't have to say, \"You're right, here's the deed to the ranch.\" They just have to back off on the harsh language and *talk to their adult child*.", "It will be his.  OP didn't say, \"One day, this will be yours and you won't have to share it with anyone.\"", "I'd agree if it was Jake who got a degree in Agriculture. As it is now, it's Carlos who has built his life around the ranch, and may see his brother get half of what he has made to ranch to be over many years, but converted into dollars.", "   Six years old, only child at the time, no real passion for the ranch in later life vs adopted brother who made the ranch his livelihood over the last two decades, improving it in the process. Mom definitely expressed herself terribly and Jake's right to be upset because of her manner. \n\n   That said, as a now thirty year old finance guy, he's either put zero thought into the changed situation and feels entitled to shaft his best friend and brother, or is creating an environment that will allow him to contest the will and shaft his best friend and brother. His inner six year old is not justified in spitting the dummy and blowing up both families lives. \n\n   They may still be able to resolve this without going that far, but I am not sanguine.", "I would think that Carlos's work to improve the property and increase its value, and making the ranch profitable would make up for him not paying rent, if in fact he isn't.", "Carlos turned it into a profitable business according to op.", "As things are now, one day Jake will own the ranch together with his brother.  Unless OP said, \"It will be yours and only yours and you don't have to share it with anyone,\" the promise has been kept.", "Some friend if your son wants the entirity of your estate though. And to benefit from any sweat equity Carlos has built up. Doesn't seem like he sees him as a brother.", "And it will you are pitting them against each other, you are showing him no matter what your words don’t mean anything and he can’t trust you. Some other son came in and stole everything from him his parent and his ranch. Don’t make promises you don’t intend to keep", "That’s a cop out. By that rationale OP could promise the ranch “will be yours” to a million people and give them each a square inch of it like they used to sell deeds to land in the Yukon. Your argument reminds me of the dad who promised his son any car he wanted but gave him a toy model and was so proud of himself.", "If you are a 6 year old who has until recently been an only child, “yours” most certainly does mean sole ownership. I’m not a Jake supporter here, but it’s fair to acknowledge he didn’t think of joint ownership… though it should have crossed his mind within the last decade. \n\nAnd if i were expecting someone to remember a decades-old promise, I’d at least mention it occasionally.", "no, saying \"this will be yours\" means just that, not 1/2 of this will be yours", "Jake is being petty, and I’m sure he knows it.  If you had a another child by birth, obviously that would change inheritance.  Do the argument for a stepchild is the same.  Situations in regards to inheritance change with additional children…that’s just the way it is.  NTA.", "Thanks for the upvotes - but also read on - I agree Carlos should be compensated for the value he’s added to the ranch in improving it…", "Not only lacks experience but not even be wanting to do anything with the property as a farm but take in a whole either direction OP may not want for it. Like selling it to developers. For him it would probably even be easier to buy our Carlos of his share since now everything is split in half. So not only is the property being used for something OP may not have wanted but Carlos and his family are now homeless and he has to find work for his specific degree which may mean moving far away.", "He probably developed an interest in the subject after spending so much time at the ranch while he was growing up.", "Nah this is Reddit. Everything is black and white and we burn bridges whenever we can. Being legally and technically correct is the only thing that matters.", "Considering Jake has never showed interest and stopped going with OP and Carlos to work on it very young and would only go to visit Carlos once every 4 months then his interest in it is probably only financial gain.", "Until recently? Op met her current husband when the boys were 6, they are currently THIRTY. They've been step siblings for the last 23 years.", "Not agreed.  If Jake had a brother or sister by birth (half sibling) or step sibling/ that changes inheritance- a 6 year old doesn’t know that but a 30 year old dies.", "Absolutely this.\nThe circumstances changed therefore the outcome should too.  It’s somewhat disingenuous of Jake to not realise this.", "I don't understand what you're trying to imply. My two sons know that as long as I live, they will always have a place with me on the ranch. Carlos decided to dedicate himself to agronomy because he likes it, for no ulterior motives, but of course it was helpful to know that he already had a guaranteed job in the ranch. Jake went into finance because working under the sun every single day wasn't for him, and I respect that.", "Yes, you are right.. take Carlos’ sweat equity into consideration. (I also was probably trying to reply to a different comment- sorry).  It might also be worth dividing the property and paying Carlos to manage Jakes half. I wonder if he is being compensated for running the ranch now.", "that was so much worse than I expected lol", "It's possible.", "At least I have my upvotes to keep me warm at night.", "Maybe he literally meant a “shy pond”? s/", "I'm implying that Carlos received a gentle nudge, which he did. Being guaranteed employment, on property you say you plan on splitting 50/50\nAs long as you live. How about after? What happens if Carlos decides he doesn't want Jake there. How is the property being divided. Jake may not have wanted to be a farmer, but he probably wanted to be a land owner or own some property.", "You’re proving your step kid means more by breaking a promise to your first son. It doesn’t matter that I was a promise before you got another son you made a promise stick to it or don’t be shocked when you only have the son you care about around.", "And this is why I believe in not attacking someone when they respond with something that seems a bit off. Your response was strange enough that I assumed there was some sort of miscommunication. I hope you have a great day!", "Rent free? Carlos is literally putting in the work and has actually made it profitable. OP admits it wasn't profitable until Carlos moved onto the property and again put in the work. Jake on the other hand has only visited once every 4 months.", "It's likely.", "You do realize by your logic if OP had another bio child after that promise was made that means that hypothetical child would get no share of the farm because it was all promised to Jake.", "In fairness it could be a coy pond too lol", "No, that's your logic, you're using it right now. *I* said \"Again, agreeing Carlos should get the ranch and its perfectly reasonable to expect that him taking it over and Jake ignoring it, as well as the natural compromises that come with adoption, significantly alter the circumstances of that promise in ways that are perfectly fair. \"\n\nObviously biological siblings come with similar if not greater natural compromises.", "Koi can be quite coy as well.", "Nta  if carlos was born to you this wouldn't even be an issue. Your son does not see Carlos as a real brother. Contrary to what he might say actions speak louder than words. Your property should be split evenly between both your sons.", "I’m gonna go with YTA. Parents constantly think children aren’t going to remember promises when things like that will always incentivize them.\n\nWe ALWAYS remember because they’ve just become extremely Important.\n\nDon’t make any promise if you’re just going to not keep it, no matter how much you think “they’ll never remember this”.", "YTA for ignoring the no-contact request, that's for sure. And probably also for not explaining your reasoning better as to why you changed your mind.", "If your husband is going to leave half his assets for your son than perhaps it is fair .. not saying SS does not deserve the ranch but everything has to be fair from both parents. I can’t vote either way unless we know your husbands side of things", "YTA. Property owned before marriage should go to your biological children at the time. Any assets after that should be divided as you and your current husband see fit.", "NTA, Carlos has made it thrive - he’s earned half more than jake has anyway", "Reddit can be odd. She made a promise to her only child when he was six without considering future children. In the case she legally adopted Carlos who became her child. If she had a child of her own blood, would there even be this much discussion regarding the promise made to a then six year old? \n\nI think she needs to have a discussion with her son and explain her viewpoint regarding the distribution of her reasoning on the division of the ranch. He seems to be focused too much his piece of the pie. Death tends to bring out the worst in people and OP isn’t even dead yet. Unless they can resolve the issue now, it doesn’t bode well for relationship between the sons after the eventual deaths of the parents.", "Jake wants a cut because he is seeing $$ but he did nothing to create the $$, thats no good.  He has no interest in it except for cash, thats greed.\n\nIf Carlos put in the work, it should go to him.", "have you explained all of this to jake? i assume the promise took place before you adopted carlos. in my opinion it's the same as if you gave birth to a second child - my assumption as a sibling would be that any assets left to us would now be split between us. \n\nit sounds like although he's not A Ranch Guy, jake has always had his heart set on having this ranch. maybe when you get the chance to explain your reasoning, he can explain what's so important about inheriting the ranch to you, and you can compromise. obviously it would be The Antagonist In A Horse Movie shit to take it away from carlos and his family now lol, but maybe it's just that having this part of his childhood as a beloved property bestowed upon him made him feel valued and like he matters in the family. i would be dubious if you told me this property is literally the only beloved heirloom you have. \n\ni'm sure he knows he's being kind of irrational, but he's also been counting on this promise for twenty-five years and you sort of sprung the change on him, not realizing he remembered and cared about it. \n\nmaybe assure him that this is something you've considered very seriously, not that you simply don't care about him or any promises you've made to him, and that you've not removed him from your will or stopped valuing him. he will be fine. \n\nand carlos is free to be upset and disappointed in you if that's how he feels, but i don't think it's his conflict. this is a conversation between you and jake, and as hurt as he is, jake should put on his big boy pants and have that conversation. \n\nmy best friend worked in a law office that specialized in inheritance and wills and shit for a long time, and she said that she was surprised at first by how contentious disagreements about inheritance can get. families will already be grieving, and then neither sibling can figure out why the other won't just see it their way! or why dad wrote it like this! etc. (i made up my mind years ago to expect nothing but my gramma's wedding dress - because i promised her i would keep it safe - and this pretty stained glass pear she's had in her kitchen window for going on fifty years now.) so i promise this isn't like a huge, unusual, terrible conflict to be having. and you haven't shattered the family and destroyed your legacy as a parent or whatever. it's a sad moment for sure, but not one that can't be fixed. \n\nespecially since you've got plenty of time. god willing, this won't come to fruition for many, many years yet. \n\neven though i think jake becoming a tragic hermit who can't even text his brother back is unhelpful and an overreaction, my vote is still NAH. \n\nside note. i feel like i read a cowboy themed romance novel with almost this exact plot once. like there was a ranch and everything.", "Smart husband.", "INFO - Will you husband leave anything to Jake when he dies? \n\nYou have a solid relationship with Carlos. Does your husband have a relationship like this with Jake?", "INFO: Is this something you and your son spoke about regularly, or did he just bring it up for the first time in forever? If it’s the latter, NTA. If he talked about it all the time growing up and you changed your mind, more so ESH because it is your property but YTA in his mind and might ruin his relationships with his brother 😕💔", "YTA but not for the obvious reason. \n\nYou’ve allowed Carlos to live and work on the ranch. It’s now his family home. He has invested time, most likely money, and most importantly his blood sweat and tears into making the ranch a successful operation. \n\nNow you’re going to give half of it to Jake, who isn’t really interested in it. \n\nYou should be working out a way of leaving the ranch to Carlos and leaving other items of equal value to Jake. Maybe leave him the house but in trust so that your husband can continue living in it until chooses to move, or passes away.", "NTA. Jake is a whiney entitled brat. Carlos has done more work to deserve that property than Jake ever did", "Nta\n\nYou may have explained the reason why you made this decision the wrong way. You are keeping the promise you made 20 years but added another person as your family grew.", "NTA and ur not breaking ur promise. He’s getting the ranch just not the whole thing. Sounds like that promise is the reason he put zero effort into it, assuming it would just be handed to him. Carlos is ur child too & deserves his half. He clearly cares more about it & put his blood sweat & tears in. Don’t let Jake’s immature entitled behavior make you change ur decision as it’s what’s right & best.", "No judgement, but an object lesson in making promises you can't deliver, especially to children. You made a promise to a child during the formative years of their life. Young children, for the most part, trust their parents. That child probably grew up treating that promise as gospel truth and integrated it into his self identity. Of course his world is shattered when 20 years later you reveal that you didn't really mean it.", "Info who will your husband be leaving the house to?", "Nah. But you need to divide the property before you die in a way that they both understand and feel good about. Both will inherit their half", "I'm gonna say YTA, not because I think you should give him the ranch, but definitely because ***you should have explained your reasoning.*** You came off like someone who's word don't mean shit and who doesn't care, when the actual reason you're giving the ranch to Carlos is because he is invested in it, unlike Josh.", "NTA, you are keeping your promise as half of it will be his.  You would only be an a h if you left it 100% to Carlos.  Why hasn't Jake invested in the ranch in the way that Carlos has?", "Just my opinion I’m not saying you are either one here. But Jake & Carlos may be best friends & have grown up together going to the ranch since they were 6. & that’s awesome they are still close but did  you ever think jake stopped going cause that was y’all’s special place & you brought Carlos into it. & that hurt him. But he swallowed it all & just stepped aside by playing ball instead of causing issues. But always had it in his heart he’d get back the place he cherished deep down that was just y’all’s. So NTA but yet TA. If you haven’t looked at it from that side too. Kids even once grown who have shared a life with step siblings after knowing a life without them (meaning a parent to themselves for a while) have had to adjust in ways a lot don’t understand & the turmoil inside them is rough. It’s always a tug on them emotionally even if they don’t show it or say it. It’s not necessarily jealousy but that’s how anyone they talk to would take it so they don’t say anything. Just my thoughts though.", "NTA but I can understand both points of view. Carlos has worked hard for the ranch and if you feel that he deserves it that is you prerogative. Jake however is you son. And as someone who has step siblings I do not feel any attachment to them or feel that they are my family. If my mother would cut me out of the will to premier any of my step siblings there would be no more family relationship. And I see both choices as perfectly valid an not asshole moves they are just consequences of each other and you can’t have everything you want.", "INFO\n\nWhy does Jake want the ranch so badly? Did you inherit the ranch so it has a family history? Or does he only see it as a cash-cow now when Carlos has made the place profitable?\n\nI find it surprising that Jake remembers a conversation that happened over 20 years ago when he was 6, especially when he's also not shown any interest in the ranch for the past 10 years. And **Jake will technically still own the ranch, just not by himself**.\n\n\\--\n\nNTA for splitting the ranch equally between your sons. It would've even been understandable had you given the ranch to Carlos solely, considering that he works and lives there, whereas Jake has not shown any interest in ranching. You were a bit of an AH though in how you responded to Jake, you should've just explained that he'll still inherit the ranch but that he will not have sole ownership as you now have two sons.", "People are allowed to change their minds.", "ESH. You are definitely NTA for who you want to leave it too. The only thing that really makes this ESH is how you communicated it. That part left a lot to be desired. I hope you all can patch things up, just try to explain your reasoning a bit better next time.", "NAH It's your property to do with as you please, but in the future, try not to make promises you can't keep. If I was your child and you promised me the ranch 20 years ago, I would expect you to keep that promise (as I don't take promises lightly), but would understand why you came to the desision you did had you explained it to me as you did in this post.", " If you’re really going to give each a share, be sure to give Carlos 51% so he can make all decisions about operating the ranch.", "NAH\n\nI think your splitting sounds fair and reasonable. \n\nBut given Jake was given a promise 20years ago and wasn't aware of you having changed your mind *and* you remembering the promise, I see why he needs some time to process. He didn't scream at you or anything, he said he needed some time to think about it. I also recommend you to explain your reasoning the way you explained to us.", "NTA.\n\nYou're rewarding hard work to improve the asset with an interest in the asset.\n\nIf the person presuming a free ride is bothered, that's too bad.", "NTA. The situation changed, and no reasonable person would think an offhand comment about such a impactful decision would be ironclad 20+ years later. Would he still be expecting full ownership if Carlos was instead your biological child?", "Yes and no?\n\nPromises and statements at that age form who a person is. Spending upon Jake, and who he is - it could mean a lot. \n\nImagine if Carlos never entered your life. Or any other child. The ranch would belong entirely to Jake. \n\nSo, he likely feels cheated. \n\nHowever, if Jake would screw over Carlos? Well.. Why allow temptation? \n\nAlso, Carlos is equally your child. Carlos needs to be allowed something of equal value for fairness.", "This isn’t going to be popular but firstly do I think you are right to split yes. Do I think you are an AH for making a promise to your son that you aren’t going to keep. Yes. I know we all promise dumb shit when kids are little but this clearly stuck with him whether it be from a sentimental reason or (as I suspect) financial reason and if you aren’t willing to keep a promise then don’t make it.\n\nOne thing I’m curious about - is u to our husband leaving anything to Jake in his will?", "Well it's still his just shared is all. \nNta", "I'm all for keeping your word but holding people to promises they made 20 years ago to an excitable 6 year old is a little childish and isn't fair on Carlos.", "Idk what logic he's following outside of being selfish to think he should stay with it all. I mean did he expect to be the sole beneficiary if OP had another biological kid?", "I get your point and agree with op. But at the same time, you don't make promise if you're unsure you can follow up with them. Op is NTA for changing her mind and splitting the ranch between her children. But a promise is a promise and I can do understand why her son is mad. \nMaybe, with a bit of time and lots of communication it will sort itself out.", "While I don’t think OP is an asshole i definitely don’t think you should make promises you don’t keep just to be sweet. A promise is a promise and if you can’t keep them you are untrustworthy.", "Carlos is already living at the ranch and has been for almost a decade now.\n\nWhen OP eventually dies, is the will going to say “Okay Carlos! You’ve spent X years running this ranch, helping it thrive and living here. Now you have 30 days to move out so Jake can move in”?\n\nOP said she is leaving the boys the ranch 50/50. Yeah, it sucks that she didn’t talk to them about it prior, but I feel like it’s safe to assume she’s got another couple decades of natural life left (barring sudden illness or an accident) and that should be plenty of time to talk logistics about it and for Jake to figure things out.", "OP has stated that the brothers are best friends, there's NO way Jake doesn't already know the amount of work Carlos has been putting into the ranch all these years, it seems disingenuous for him to be surprised that OP wants to give him back his life's work. Seems more like he expected a bigger payout from the work his brother was doing and had the rug pulled from under him. I agree with other commenters saying OP should be more concerned about Jake wanting to sell out and causing issues for Carlos and their company down the line.", "What happens to the house when the husband dies? It should be split by both kids, too.", "Or even \"I got an other child since then,\" so I split it between the two of you.", "OP explained it to the internet because internet wasn’t there to see Carlos take care of the ranch. Jake, Carlos and OP were all there to see Carlos work on the ranch. It doesn’t take a genius to understand the same. Jake’s reaction shows how he believes since the ranch was there before Carlos was adopted, he has the right to it. If he really considered Carlos to be his brother and was logically rational, he would be okay with the split. \nIn my opinion, Jake should get something else or maybe get 25% of the ranch.", "He is in finance", "Of course her will isn't going to say that. I'm saying that she needed to have conversations with them once she decided to gift Carlos half the property. Jake was living his life under the assumption that it was his, especially since the op told him it was his. \nJake will own half of a profitable business without shouldering any of the cost or burden. That is something Carlos may not be okay with. Simultaneously Jake may not be okay with Carlos preventing him from using part of the property however he chooses. The OP has unintentionally set the boys on a collusion course.", "Of course NTA, but let’s not play semantics, she didnt fulfill the original promise BUT things change ( like suddenly having a stepbrother that also is your friend) in life and she could have offered an explanation and communicate to him that his brother and best friend is always there he deserves half of it. She acted like she was guilty of something when she wasn’t. But yeah communicate better with him.", "Yes was my thought too, to say it will be his doesn't exclude a possible co-owner.", "Tomato potato", "Tomato potato", "Tomato potato", "If your husband dies will be be leaving half of his assets for your son?  If so, yeah.  I get what he means, he thought because he's\"yours\" and the ranch preceeded the marriage you would keep  exclusive to him and split post marriage assets which I dare say is more common in the states at least. Fact remains it is still your property to do with as you please the question is do you and your sons want this piece of property to be the end of your relationship? One seems to think so.", "Will your husband will also be splitting his property with both. If yes then inform that to Jake, that he's just going to get a replacement inheritance instead of ranch.\n\nIf he's only going to give it to Carlos, then you just lost your Son.", "I am confused what Jake intended to do about Carlos and his family should he inherit the ranch outright. I'm sure you raised a good son, though perhaps a little shortsighted considering how close he is to Carlos. I would be curious how he did not think of Carlos' well-being in any way with this line of thought.", "I stand by what I said earlier. Assets before marriage should go to your biological children Let's not forget your lost husband contributed to that farm or you wouldn't have it.\nAny assets afterwards should be split as you and your new husband decide.\nYour son gave up a career to take care of that farm and made it as profitable as possible. He's made it his life.\nHe could have went on with his engineering career and been successful, living in a subdivision somewhere. BMW in the driveway, whatever.", "It might be translation issues and the gendered terms aren't coming through right. \n\nI think OP is female, her husband passed away, she met her new husband when the boys were both 6.", "Just because Carlos is more invested in the ranch doesn’t mean OP’s other son doesn’t deserve a part of his parent’s passion project. It would be cruel to cut Jake out. \n\nWe had a ranch in my family and some relatives didn’t visit for years, I didn’t go for over a decade. We still cared about it. But the relatives who visited multiple times a year were the ones we considered very attached. Jake goes every four months - sounds like an attachment to me.", "Oh yeah, I do completely agree with you there.\n\nWe can only guess OP thought this would be implied since Carlos has been living there and maintaining the property this whole time and it wouldn’t have needed to be said. That does make OP YTA in this case, especially with the way she responded to him at dinner.\n\nSorry for being a bit combative there. I’m a little crabby trying to fix my sleep schedule so I can start working graveyard in a couple days. 💀", "On the flip side, what if Jake wants to sell it? Then Carlos loses his home and he only gets half of the reward for all the effort he put in to improving the ranch and the value he added. Whereas Jake, who isn’t very engaged, gets all that benefit with no input.", "Let's not forget he gave up his career in engineering and has been living on the farm and taking care of the farm. \nHis mother owned the farm before meeting her present husband.", "I totally agree. If your husband would be leaving his assets (and that includes the house you're leaving to him) only to his bio child, then I would never speak to you again.\n\nDoes Carlos and his family pay rent to live on the ranch? If not, then you've already been favoring him financially. You going to give extra to Jake to make up for free rent for however many years (if that's the case)? If he does live rent free, I hope you see that's in no way fair.\n\nThe only way it would be ok is if you paid him a salary that deducts the fair market value of where they are living on the ranch or if he was taking no salary at all for the room and board of him and his family.\n\nI'm kind of not surprised Jake thought the ranch would be just his. It's a pre-marital asset, which shouldn't go to your husband bc he could very easily just give it ALL to Carlos if you die before he does. You would be dead and never know.\n\nSince it's a pre-marital asset, and to him that promise you made was serious, and Carlos isn't his biological sibling, I don't think it's completely out of the realm of his reality to think it would be his \\*most especially if this was a family ranch passed down to you.\\*", "Nope.\n\nCarlos has either been paid for the work he's done, and/or he and his family have got to live free or cheaply in return for his labor.\n\nHe's an employee of the ranch. It shouldn't matter any more than any other person being hired who did a good job and made the ranch worth more.", "really? why is it not possible that jake sees the ranch as his parent’s love rather than just dollar signs? \n\nthere are many stories on Reddit where op’s one daughter is a legit millionaire and the other middle class/ working class and when op divides the inheritance unequitably, giving the poorer one more and then op gets bashed. It’s cause the parents love is measured by the inheritance that they get ( at least by op’s kids)", "It's cool bro. Good luck with the graveyard shift.", "Unless Carlos buys out the other half? Granted that's still dependant on whether or not Jake would sell it to him, but it wouldn't make sense to not if that were the case, even if Jake is still bitter about the whole thing.", "What the hell did you read? Carlos took a degree in 'engineering in agronomy' (agronomy is the science of soil management and crop production), and then *when he finished his degree* worked on the ranch, making use of his qualifications and knowledge to improve the ranch. Nowhere does it say he (Carlos) gave up his engineering career to work on the farm.", "I’m describing his state of mind and comprehension at age 6. That’s why I also added that it should have crossed his mind sometime in the last decade (that his initial expectation of sole ownership may not be realistic).", "No reason for Jake to sell anyway. He owns 50 percent of a profitable business. Why sell?", "In which case OP should leave Carlos enough money to be able to afford that. If Carlos has to fund it himself, and Jake still gets other inheritance, it’s still uneven.", "So if OP had had a second biological child you would still expect the first son to inherit everything?", "Who knows, just a hypothetical.", "True, but then the inheritance is uneven if Carlos is left more money in order to do that, because what if Jake doesn't sell?\n\nIt's a bitch of a situation."]}