{"id": 1434, "submission_id": "ymdy0e", "title": "AITA for not contacting my mom when her father suffered a stroke?", "selftext": "i [15f] currently live with my dad. my parents divorced when i was around 5 years old and they had joint custody. i was with my dad on weekdays and my mom on weekends. \nmy mom has been an alcoholic all my life. she also struggles with severe depression and she is not recieving therapy or medication. sometimes, when i'd go to her house, she would have mental breakdowns over something very miniscule and she'd take all her frustrations out on me. \n\n\none particular day, she had a mental breakdown that was caused by me forgetting when her birthday was. she sat there screaming at me and crying, i was just so fed up and i told her i was so done dealing with her. she asked me if i never wanted to see her again, and i told her yes. i called my dad while she sat there and tried to guilt trip me some more, my dad picked me up and i havent seen her since then. that was 2 years ago. she didnt try to contact me since then.\n\nmy parents still keep in contact because she still has parental rights and she still has to pay child support. two months ago, my mom told my dad that her dad suffered a stroke and she went back to her hometown to take care of him. she said she wanted to talk to me. i thought it was weird because she never tried to contact me in those 2 years and i certainly wanted nothing to do with her. my dad told me i should at least tell her im sorry about her father.\n\ni tried to contact her just to talk about her dad, but i couldnt bring myself to do it. i began to panic just looking at her contact in my phone. i ended up not talking to her at all. as a result, i think she got mad at me because she ended up not paying child support for two months before things went back to \"normal\" and she started paying again. \n\ni feel bad about not being there for her as she doesnt really have any other support but im a bit angry that this is the only time she tried to contact me after i havent seen her. AITA?", "created_utc": 1667604791, "permalink": "/r/AmItheAsshole/comments/ymdy0e/aita_for_not_contacting_my_mom_when_her_father/", "score": 2, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i might be the asshole because i did not contact my estranged mother when she went through something serious. this might make me the asshole because i was not there for her when i could have been.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nWould it help if you and your Dad, sat together to talk to her on the phone (have her on loud speaker)?  At least this way, your Dad can step in and take over if need be.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\ni [15f] currently live with my dad. my parents divorced when i was around 5 years old and they had joint custody. i was with my dad on weekdays and my mom on weekends. \nmy mom has been an alcoholic all my life. she also struggles with severe depression and she is not recieving therapy or medication. sometimes, when i'd go to her house, she would have mental breakdowns over something very miniscule and she'd take all her frustrations out on me. \n\n\none particular day, she had a mental breakdown that was caused by me forgetting when her birthday was. she sat there screaming at me and crying, i was just so fed up and i told her i was so done dealing with her. she asked me if i never wanted to see her again, and i told her yes. i called my dad while she sat there and tried to guilt trip me some more, my dad picked me up and i havent seen her since then. that was 2 years ago. she didnt try to contact me since then.\n\nmy parents still keep in contact because she still has parental rights and she still has to pay child support. two months ago, my mom told my dad that her dad suffered a stroke and she went back to her hometown to take care of him. she said she wanted to talk to me. i thought it was weird because she never tried to contact me in those 2 years and i certainly wanted nothing to do with her. my dad told me i should at least tell her im sorry about her father.\n\ni tried to contact her just to talk about her dad, but i couldnt bring myself to do it. i began to panic just looking at her contact in my phone. i ended up not talking to her at all. as a result, i think she got mad at me because she ended up not paying child support for two months before things went back to \"normal\" and she started paying again. \n\ni feel bad about not being there for her as she doesnt really have any other support but im a bit angry that this is the only time she tried to contact me after i havent seen her. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nI want you to say this out loud to yourself:\n\n\"My feelings are valid.\"", "NTA\n\nOthers people grief is not your responsibility. It is not your job to console your abuser. You have no priority here other than yourself. \n\nPlease read that again - *your only obligation is towards yourself*. \n\nShe burned a bridge, and didn’t even try to repair it until *SHE* was directly impacted by a substantial life event and realized she had no support system. It is not your job to make your abuser feel better about their crappy life, regardless of the circumstances. \n\nI’m so sorry you went through this experience, and I wish you nothing but the best on your healing journey and future endeavors.", "NTA whatever you decide.\n\nTalk to your dad. You could send a card if that would help you connect / express sympathy without putting yourself in a vulnerable position.", "NTA. \n\nShe mentally and emotionally abused you and you have every right to stay no contact.", "NTA - I am a recovering alcoholic, it took me to nearly lose a relationship with my gf to wake up and get help. If she's going to choose alcohol over her relationship with you it is completely selfish and unreasonable for her to demand your support. That's her role as a parent, which she's clearly reneged on.\n\nAlso alcohol is a depressant. I'm 2 weeks into recovery and while I have good days and bad, my depression has never reached the levels it did while I was drinking.", "NTA. She's been terrible enough you PANICKED at the thought of talking to her. She's an adult, she chose to be untreated for her alcoholism and mental illness despite having a child depending on her. You were barely even a teenager when she decided not to contact you again.  NO  judgment from me for not opening yourself up to more abuse from her. Go get her a card from the store, a nice generic sympathy card. Tell her you are sorry to hear about her father and she has your condolences, mail it, and then go on with your life. She doesn't get to expect sympathy from a child she treated so poorly. Take care of your mental health and keep healing.", "NTA.  What your mother did is a form of abuse, and you’re reacting as someone dealing with trauma.  Contacting her would be detrimental to you.  Don’t do it, and don’t feel bad about putting your needs first for a mother who couldn’t be bothered to contact you for years.", "nta. it is not the responsibility of the child to emotionally support the parent, especially when you’re a minor, and especially when your mother has not been emotionally connected or supportive to you. a kind way to express that to her and your dad might be something like “i am sorry for what you’re going through, but i am not able to be there for you emotionally in this situation, and i am not ready to have a relationship with you again.”"]}