{"id": 14374, "submission_id": "12gkvbx", "title": "AITA for laughing when my moms boyfriend hit his head after teasing me about my height?", "selftext": "So my mom and her boyfriend are both taller than me, he teases me about it all the time saying how embarrassing it must be for a man to be shorter than his own mother, especially when she wears heels he really rubs it in.\n\nSo last night we were eating diner and my mom told me to grab the napkins, she said they’re in the cabinet above the refrigerator. I tried to reach them but it was a little too high up for me.. When they realized I couldn’t reach it they started laughing and her boyfriend came over to help. He easily reached them and said “you’re too small for this house little guy”, then we went back to the dinning room and he hit his head on the doorway.. I started laughing and he called me an asshole!", "created_utc": 1681050217, "permalink": "/r/AmItheAsshole/comments/12gkvbx/aita_for_laughing_when_my_moms_boyfriend_hit_his/", "score": 720, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My moms boyfriend hit his head and I laughed at him. He called me an asshole BUT he teased me first.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA How embarrassing it must be for a grown man to be so insecure he has to tear someone else down to feel bigger. As a short person myself, I like to remind people that it's best not to piss off someone with easy access to their knees.", "NTA, he is allowed to make fun of your height, but you can't about his?", "NTA.  If he can give it, he should be prepared to take it.   Karma is a bitch sometimes. \n\nI would have said ‘you’re too big for this house big guy’ but I’m petty.", "NTA That's hilarious it's a shame that he's too tall that he forgets to duck when going into a room.", "NTA. They obviously can't see (or respect) the difference between emotional/physical hurt, and you're more laughing at the irony--that you have an ounce of schadenfreude mixed in doesn't make you TA.", "NTA and IMO, the doorway agreed ;)", "NTA dude this is FUNNY. That is HUMOR. He is TA", "NTA\nSounds like he can dish it out, but can’t take it. People come in all shapes and sizes. Unfortunately, your mom’s boyfriend sounds like a toxic fellow and now he transferred some of that to your mother. She should have some empathy for you and how this makes you feel.", "NTA!!!", "NTA, but he sure is.", "NTA. It's easier to be a short woman, but I reply to such comments with my advantages of being short. It's good to be short because I fit under the desk during and earthquake and I will never get deep vein thrombosis from sitting on a plane too long because I can stand up under the overhead storage. Admittedly it's a short list, but it makes me laugh.", "NTA. This is karma at its finest.", "You're NTA. Your mother, whose genes contributed to her height, is an even bigger A-H than her immature boyfriend. She is allowing him to belittle you for something that is out of your control. That goes against every normal mother's maternal instinct.\n\nHer boyfriend is also a royal A-H for his constant,  tiresome comments about your height. They both have a lot of maturing to do, but at least they're perfect for each other.", "Dont dish it if you cant take it. This is the definition of karma. NTA", "NTA, great karma there", "NTA 100%. Although, as a short woman engaged to a short guy, I think your mom's bf is a total AH (and your mom as well for laughing at you and if she enables the teasing). People who make fun of others for things they legit cannot help are insufferable.", "NTA but mom's BF sure is.  He's not joking around, he's being a nasty prick who seems to really want to hurt your feelings.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my mom and her boyfriend are both taller than me, he teases me about it all the time saying how embarrassing it must be for a man to be shorter than his own mother, especially when she wears heels he really rubs it in.\n\nSo last night we were eating diner and my mom told me to grab the napkins, she said they’re in the cabinet above the refrigerator. I tried to reach them but it was a little too high up for me.. When they realized I couldn’t reach it they started laughing and her boyfriend came over to help. He easily reached them and said “you’re too small for this house little guy”, then we went back to the dinning room and he hit his head on the doorway.. I started laughing and he called me an asshole!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and it was hilarious.", "Or...other parts.", "Probably lack of oxygen from the altitude.", "Yeah she’s no better sometimes! Once she was in heels and she was like “omg you look so small right now next to us”.. Like what am I supposed to do lol", "She does enable it! Once she was in heels and she was like “omg you look so small right now next to us”.. Like what am I supposed to do lol", "Ask her what kind of power trip she gets from being verbally abusive to her son? Then walk away.", "NTA. As a tall guy I would never disrespect a short person like that. Short people have their uses too, like fighting goblins in narrow tunnels.", "NTA - as my grandmother used to say, \"The Lord pays debts without money.\"", "NTA.", "NTA. Silly idea: every time he comments on your height respond with some cliche line like “how’s the weather up there” even if it’s completely irrelevant to the conversation and just leave", "NTA for laughing, that's pretty much instant karma 🤣", "NTA.  Tell your mom your growth was stunted in utero due to her giant body needing all the nutrients.", "NTA - if he can't take it , he shouldn't dish it out !!", "NTA— this is hilarious! Karma’s a bitch", "NTA I am a tall man myself and have had to deal with comments about my height since I can remember. I never comment on someone's height. I have friends that are short and when they start joking about their height I either ignore it or say straight up that I don't care about height. That has stopped the comments from them about my height and theirs. We're closer for it I think. I think short men sometimes feel self conscious because of society. I tell people I hate being so tall and I get the shock face. Hitting your head is something I deal with a lot too. Rant over. Thanks for listening!", "I’m honestly still giggling about this.  I need a life 😆 \n\nMaybe he’ll think twice next time he’s tempted to be an AH to someone for something they have no control over.", "NTA. This also gives you ammo to shut down future teasing too. Next time either of them mock you for your height, you can now reply \"oh, idk, I kinda prefer being shorter. I'd hate to hit my head on doorframe, yknow\"", "NTA, everyone is different and him picking on you about your height wasn't cool. Alsooooo what did he expect you to do? Honestly it would make me laugh too when after teasing me like that they hit their head on the doorway...", "He can dish it out, but he can’t take it.", "NTA\n\nWalk out to a street corner with him and tell him to use his height to give you traffic updates.", "NTA.", "NTA- Sounds like he's too big for the house. Seriously though, that's the epitome of don't dish it if you can't take it. He was being a dick to you and then gets all butthurt when you laugh at him for something. It was also perfect karma for him to hit his head after making fun of you for being short.", "NTA.\n\n“How’s the ceiling taste, Stretch?”", "NTA. That’s really embarrassing for him to make you feel bad. Probably from the lack of air he gets from oh so high up. Get away from there!!", "No, that's called Karma", "Kick him in his fucking shins and when he is howling on the ground ask him how it feels. NTA.", "NTA, height has it's advantages, but also has disadvantages.", "NTA delicious, glorious, timely karma. Yum!", "As a 6' 5\" man who routinely worries about and/or actual does hit their head on things, NTA.\n\nIt's actually pretty funny and happened as recently as 2 hours ago.", "Yeah feel like people are giving the mother a pass on this which is messed up. \n\nI'm a guy who never ended up taller than his mother (dad is 5.6, mum is 5.10 and I ended up 5 8) and when I was insecure about my height growing up my mother was wonderfully supportive about it. One of the reasons I grew into an adult who's not insecure about his height is thanks to her. \n\nParents should be trying to help their kids grow into well adjusted adults, not reinforcing insecurity and making it worse. \n\nNta", "And you can cross your legs all over the place on planes! I never realized this was a problem for tall people until I flew with a tall friend who was jealous about my ability to wiggle around and find different leg positions.", "NTA.  I guess when your head is that big it’s inevitable you’ll start banging into doorways. Sweet karma.", "NTA\nThe only way this would be better is if you responded \"You're too big for this house giant man\"", "Karma was watching.\n\nBetter by far to be short than an asshole. NTA for laughing. He asked for it.", "NTA - what a sexist person", "NTA and this is coming from a tall person(almost 190cm/6'3). Being tall comes with advantages and disadvantages and so does being short.", "NTA it was instant karma", "NTA \n\nThat’s funny.", "Missed opportunity to tell him he was too tall for the house, but otherwise NTA", "NTA. I'd suggest you starr mocking their height every time they do it to you. \"Jeez, you're giants! Go climb up a beanstalk!\". \"imagine being so shallow that you think your manhood is determined by your height.\" \"Watch out, the ceiling might get you!\" \n\nI'm a short girl and I literally don't care about height at all. It's really easy to be taller than me. I once dated a man my height. I teased him once, and he said, \"You're only taller than me until I bend you over.\" First of all, hot. Second of all,  that's confidence. \n\nYour mom and her bf are shallow assholes.", "Nta good old saying of what comes around goes around.", "NTA.\n\nI’m 5’0. At least I get leg room on planes.", "Threatening violence doesn't exactly make you the bigger person but you're not the one who asked I suppose 🫡.  Carry on", "Chronically ill short guy here! (5'1\") If I feel dizzy and need to find the floor quickly, I don't have too far to go 😅", "I said nothing about being the bigger person. Why should I tolerate being mocked for something I have zero control over? It's always been said with a smile as playful banter to family and friends. So I WILL carry on, and now with your permission, my life shall feel more complete.", "That's not just enabling, that is active participation.", "I'm glad I was able to help. 🥲🫡 You're so welcome", "I helped too! ...with your Karma.", "👌Internet points aren't my source of confidence.  Hope you have a good one", "NTA. I would laugh too", "NTA. Your mom and bf must not be getting enough oxygen at their altitude to have such a petty and immature attitude.", "NTA. Next time tell him \"size doesn't matter...*you* should know\".", "I would have lost my mind laughing. Like my o2 levels would drop becuase I wouldn't be able to breath. Nta", "NTA \n\nIf bf can't take a height joke on him, he shouldn't make them about you.\n\nAnyway, I don't mind being short (OK, 5'8\"). I rarely bang my head, I can drive a sports car, some people think it's cute, I can always find trousers to fit me.", "NTA, this is called KARMA!", "Cue bite marks to the scrotum.......", "Violence is all we have. Us little people need to fight back........", "Your mother is a bully. Easy as that.", "are emojis?", "Clearly they are", "Nah, I think his thing is feeling superior to random people on the internet.", "Definitely use them a ton but no, they don't heighten my self-confidence either, nah.", "Nta if he can laugh about your height and struggles you can laugh about him hitting his head", "NTA if it wasnt a super serious injury, instant karma really.", "NTA \n\nIf they make fun of your height, “Yeah I may be short but at least I’m not a jackass.”  “Look at you, you giraffe gangly jackass! Can’t even walk through a doorframe!”\nMaybe not the best advice but I’m big on fighting fire with fire.", "Had a guy like that at my old dojo. He stopped talking so much crap after multiple submissions from shorter folks (I witnessed a knee lock and heard about a few ankle locks).", "Classic bully behavior. He can dish it out, but he can't take it.\n\nNTA.", "Yep!  Mom is an AH.  No way some guy is going to insult my kid and get away with it.  And sounds like she actually participates in the insults.", "Now everytime the bf passes under a doorway, OP can yell out \"don't forget to duck\"", "As a tall woman engaged to a shorter man, it means nothing. Personality is always a winner.", "Is that a wet spot in your crotch?", "\"Be the bigger person\" = \"don't make other people uncomfortable by complaining about how you're being relentlessly bullied.\"", "Turn it around in her \n\n\"Why did you make me this size?\"\n\"It's all your fault for not giving me the right genes.\"", "Violence is always the answer with family. /s Just not anyone else.  You can choose your friends, not your family (at least until you leave the house)\n\nBut really, you don't like your friends, don't have them be your friends", "I never mentioned violence.  Not sure why you are?", "Because my comment you replied to was about \nviolent actions in response to this \"height\" bullying.  I've just been attacked about this by what I assume is the Tiny army, coming for my internet blood", "Emojis make you look stupid. That applies to everyone", "Again, I didn't mention violence.  Don't try to ascribe violence to me when it isn't there.", "I'll continue to look like the dumbest motherfucker on the side of this rock 👉🤓👉", "Just edited a bit.  Either way \"being the bigger person\" isn't tolerating the behaviour, it's walking away and finding better friends.  Hence the comment about fam", "No.  Being the bigger person is 100% about allowing others to remain comfortable about the bullying that you endure.  Bullies are never told to be the bigger person.  Only victims are.  The solution to bullying is not telling the victim to \"be the bigger person,\" it's to impose some consequences on the bully so that the behavior stops.\n\n> it's walking away and finding better friends\n\nClearly you've never been bullied.", "Lmao 🤣 that's pretty funny.  I didn't say it always worked.\n\nI fought back one time (actually about the stupidest issue, who gets to go through the door first).  I lost but it is what it is.  I surely wasn't relentlessly bullied because I didn't act out or give them a reaction (cool headed AF I like to say).  That's NOT to say nothing bothers me but not people so much.  Maybe I'm too boring to be an amusing mark.\n\nEndured other stuff too.  The one that stands out in my mind, I was a bigger kid (not THE bigger kid) at the time, my GFs friend told me \"you got bigger tits than I do\".  Still think about that one.  But yeah, that relationship didn't last long after that."]}