{"id": 14410, "submission_id": "12gvdn1", "title": "AITA forbtelling my family I had to make sacrifices due to my fathers military career?", "selftext": "My (20F) father has been a soldier for 24 years. He deployed before I was born, so growing up we never had to leave overseas. We still moved quite a bit, three times by the time I was 12, and then another six times before I was 18. I think it did have an affect on me, not an entirely good one, which my family disagrees with.\n\nAs a teen, I was always aware that I probably wouldn't be around long, and so increasingly avoided making close friendships, since I'd just have to move anyway. I didn't keep much in my room, since it made moving easier, and refused to settle in fully. Things were still ok until I was 14 and in my freshman year of high school.\n\nWe'd moved to that area a month before school started, and had been living there four months when I met this boy. We went on our first date ever together, he was great, then two days later my dad told us we had to move again. This isn't all about a teen crush, it was just another bad thing.\n\nthe issue is my parents and siblings (18F, 16M) act like it was objectively great. They say it taught them to accept change and make friends quickly, me? I gave up on friends and was living out of a duffle bag by 15. I moved into college at 18, and still have some some feeling like it'll all disappear someday.\n\nI told my parents when they asked me if I had fun settling into one of our locations, that no I did not. I knew we'd have to move again soon, and didn't bother getting attached. They said I'm acting like I actually sacrificed for our country like dad did, and I said I did. Now nobody in the family is speaking to me and I feel like shit.", "created_utc": 1681073546, "permalink": "/r/AmItheAsshole/comments/12gvdn1/aita_forbtelling_my_family_i_had_to_make/", "score": 116, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) For what I told my family \n2) I might be being selfish and spoiled.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. There's a reason why people like to plant roots, so to speak. People need a place to call home, and you were denied that by constantly having it removed.", "NTA\n\nThey're not entitled to invalidate your experience. Just because your feelings on it don't line up with what theirs do doesn't make yours wrong. \n\nI guess he must have glossed over every Commander's Call (or whatever they would be referred to in the Army, I served in a different branch), where (in my experience) the commander typically would remind his folks to thank their families when they left the briefing, that families are the unsung/unseen heroes of the military, and that they make many sacrifices on their end that are simply overlooked because they're not wearing the uniform. Sure, some of that is absolutely \"feel good\" commander speak, but that doesn't invalidate the actual message behind it. \n\nDid you \"serve?\" No. But did you make sacrifices? Absolutely, and there are many who served/are serving that would attest to that.", "NTA   \n\n\nYou did sacrifice a lot. Your experience is different from your siblings because you are a different person. It's hard settling into new places and if you're not going to stay anywhere long I can imagine not wanting to try and build new relationships every time. It's taken its toll on you. People tend to want lasting relationships, even with 'just' friends. Honestly it sounds exhausting  \n\n\nI'm glad you've moved to college and hopefully you won't have to move around without your own say so anymore. Besides, you are entitled to *your* feelings. No matter what someone else might think about those. Of course they are also entitled to theirs, but that doesn't make yours any less valid.", "NTA\n\nYou didn't sacrifice like your father, but you DID sacrifice a large portion of your childhood. Please seek therapy to help you with your feelings of losing what you have.", "NTA\n\nThe rest of your family are way too comfortable in not rooting themselves to call home. Sure you can call home anywhere but just because you grew up with that doesn’t mean the people you want serious relationships want that. A good question for your siblings is: do they think their significant others should sacrifice their lives for your siblings careers (if it involves constant travel)?", "NTA. It sucks when you can't put roots down, especially because of others decisions. \n\nMost of my teen years I couch surfed a lot. So while I never had to go to a new school I never stayed in one place for long. It made things hard because I couldn't have friends over because I didn't always know where I would end up that night and when I got older and got a place of my own I had anxiety that it was going to be taken from me. I even slept on the couch a lot because that's what I was used to despite having a bed.", "NTA for sure. Your family is coping with the chaos, disruption, and interrupted relationships of military moves by looking at the positives. I'm not sure this is a healthy way of coping with all of this but there were some positives, at least for them. They are going to cling to this point of view because they have to. This is how they are coping with their trauma. They are doing the best they can to cope and they NEED to cope. Everyone needs to cope. When you express an alternate point of view, it threatens their coping. You cannot look to your family for validation of your experience. I'm sorry. It's hard to not be seen. I hope you can find therapist and/or a group of people with whom to process your experiences and their consequences.  I looked online and there are a number of scholarly studies on the effects of military life on children of active duty service members. Clearly this is a thing!  Whether or not your family can or will except that such a lifestyle is a challenge, the fact that there are multiple studies makes clear that it absolutely is a challenge for many, many people. Consider yourself validated - at least with as much validation as my online self can provide!\n\nHere are some links to studies. I gave them only a cursory read so I'm not endorsing them. I find that even when I read something I disagree with, it helps me clarify my thoughts so I hope this will be helpful in some way. Hugs and hugs and hugs!\n\n[https://www.proquest.com/openview/f728d247701e4654f617d4aa98e24189/1?pq-origsite=gscholar&cbl=18750&diss=y](https://www.proquest.com/openview/f728d247701e4654f617d4aa98e24189/1?pq-origsite=gscholar&cbl=18750&diss=y)\n\n[https://www.researchgate.net/publication/263772393\\_Beyond\\_adolescence\\_The\\_experiences\\_of\\_adult\\_children\\_of\\_military\\_parents](https://www.researchgate.net/publication/263772393_Beyond_adolescence_The_experiences_of_adult_children_of_military_parents)\n\n[https://www.nccp.org/publication/trauma-faced-by-children-of-military-families/](https://www.nccp.org/publication/trauma-faced-by-children-of-military-families/)", "NTA - there is a reason we are called Military BRATS, we are born, raised and trapped into a situation we can't control. I was lucky to have a dad that went Reserves when I was young and grow up in one place, but there were still some disruptive elements because of the military. Moves, while expected, are disruptive to your ability to feel settled. If you happen to be an introvert it can be even harder. And everyone reacts to change differently. They asked your opinion and didn't get the response they expected. They need to now accept that it wasn't a perfect life as they remember it and that it did create issues for you.", "NTA\n\nI was an Army brat. It took me decades to figure out how to be friends with someone for more than two years. Because growing up, we moved every year or two and I had to make all new friends.\n\nTo some extent, your parents don’t want to hear that military life affected you badly. That reflects on them as parents and it makes them feel bad.\n\nBut I think they need to hear it.\n\nYou can acknowledge the benefits of military life—learning to make friends easily, travel and exposure to different cultures, exposure to different ways of thinking—while at the same time acknowledging the downsides—no long term friendships, no roots, the utter inability to answer the question, “Where are you from?” without having to clarify, “Do you mean where I just moved from or where I was born or someplace in between?”\n\nAs an introvert, I’m pretty sure I would have done better living in one place and having a steady group of friends over a long period of time. By the time I was 10 or 11, I didn’t try hard to make friends because we were just going to move again, I was going to be forced into a new group of strangers again, a new school again, a new Girl Scout troop again. \n\nAnd my parents worried that I spent all my time in my room reading. It was a lot safer than constantly putting myself on the line trying to make friends and then having someone be mean to me.\n\nI was not allowed to do anything to my room. We were going to move again so there was no point in spending money to make the room look nice. I had to pick a bedspread that could work with any color of walls because heaven forbid we try to coordinate with the paint color. Don’t even think of painting—we’re moving in two years! Nothing on the walls so we could pass inspection when we moved out. No curtains because they would not fit the windows in whatever new house we moved to. When every other teen or pre-teen in the US was taping posters to their walls, I had to worry about my bookcase making a mark on the wall that could cause problems when we moved out.\n\nI hear you, OP. Military families do make sacrifices. My oldest brother went to a different  high school every year. I went to three different high schools. That can affect your education. I did not attend a single prom. Back then, you had to go as a couple and no one knew me well enough to ask me.\n\nI was bullied for talking “funny.” The Boston accent I got from my parents sounded odd in Pittsburgh and the South. \n\nI didn’t know local customs and got laughed at for that. I hated going to local schools because of that and loved it when there was a school on base.\n\nThere were benefits to military life. But it messed up my relationships for years and years. It probably made me more introverted than I would have been. I still, 40 years on, don’t have a good answer to “Where are you from?”", "NTA\nKids need a place that they can call home. And making friends is one thing, losing them all the time is another. Your parents chose this life, you didn't. I am sorry for you and I hope, you'll find some persons that will stay in your life.", "NTA. Not only were you treated badly, you're now expected to lie so that they feel better about it.", "Your feelings are entirely valid \n\nI moved my kids around quite a bit due to my mental health , lack of support and other reasons when they were young and to this day I’m so fucking sorry for it \n\nI know the situations aren’t the same because the reasons are different but it equates to the same thing .. kids need stability and the ability to be able to develop and grow relationships throughout their childhood and those things aren’t there if you’re moved around a lot \n\nIt’s great for them that your siblings seem to have been able to cope with it better than you but that doesn’t make how YOU feel any less valid at all and being honest with everyone about how you feel is the right thing to do \n\nNTA", "NTA. You're absolutely right, and I have to say, nobody considers the families of military personnel and their feelings. The fact is, military personnel do cause their kids to have mostly absent parents, instability due to moving often and anxieties due to the safety risks that job brings. Whilst there are many military heroes out there who have fought for their countries who deserve hero status... it doesn't change the fact that their kids never chose that life and are likely to be negatively impacted. You are entitled to tell your family how you feel, and not be invalidated. I wish you a happy, secure and permanent home going forward, with the stability you need.", "NTA. Your feelings; the desire for stability and meaningful connections are relatable and understandable. Although you didn't \"sacrifice\" like your dad did, you still gave up a great deal for your country, more than the average individual. Your sense of community and belonging; your deep emotional connections to individuals, were your sacrifice.", "NTA. I did 24 years in the Army, we were dual military for awhile. We were able to settle down when our oldest was in 4th grade and twins were in first grade. Moving is hard, I didn't like it. My Wife was an Air Force Brat, she was always ready to move. That carried over into her career where she would get restless, job hop, and wear out her welcome in a place.", "I'm sorry they invalidated your experience like that. I had a similar experience myself, in terms of unfortunate childhood scenarios that everyone around me seemed just hunky dory about. It can be really alienating.   \n\n\nRemember that your perspective is valid, and fair, and you don't have any reason to beat yourself up about it.   \n\n\nFeel free to send me a DM if you need someone to talk to.", "Your situation is exactly why I left active duty and joined the reserves. I wanted kids, but did not want them to be uprooted constantly. NTA and definitely seek therapy, soon you'll be able to plant yourself somewhere. Good luck and I do appreciate your sacrifices, I'm just sorry it hurt so much.", "NTA.  I was a military brat, too, and I felt the exact same way.  I still have difficulties making close friends.  My siblings loved moving all of the time, but I struggled making friends, struggled keeping my grades up, struggled fitting in, and after a while I just retreated and stopped trying.  So - I really feel for you, OP.  You’re not wrong to feel that way, there are lots of military brats that feel like us. The trick is to find ways to create your own sense of community.  Volunteering helps if you have time for it.", "NTA, I know plenty of veterans who act like they sacrificed for their country and family without accepting that their family suffered as a result. Failed marriages are because the spouse wasn't supportive enough, children with behavior issues are because they were looking for attention and not beaten enough... \n\nMeanwhile what war in our generation has been about protecting America? The military is just a job or career, it isn't some sacred calling. Leaving the service to do right by your family needs to be looked on more favorably.", "I'm super confused. I was also a military brat that moved alot as a kid. The things OP is dicussing were commonly talked about \"collateral damage\" of having a military parent that other adults would talk about all the time. The extra steps you had to take to help your children feel secure moving so often, a working military spouse having to find new jobs, everyone getting new friends, etc. These were discussed so often it was a bonding experience at parties. Hell, the uncertainty of these situations is an actual trope in movies and books.\n\nIt sounds like OPs parents are in denial about how they failed their child and are taking out their feelings on said on OP when it's being brought to their attention. \n\nNTA", "NTA you didn’t sacrifice no. You Were sacrificed. \n\nBecause he Chose his career, and it was Forced upon you to commit to His lifestyle. Nobody asked they just dictated and decided. \n\nWhen you chose to bring kids into this world you accept that you are now living to ensure that They get what They need.\nIf you aren’t prepared to put your children First, then you aren’t prepared to have children.\n\nYou chose to have children, they do Not chose to be born.", "INFO: Did you father ever deployed in active war zone?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (20F) father has been a soldier for 24 years. He deployed before I was born, so growing up we never had to leave overseas. We still moved quite a bit, three times by the time I was 12, and then another six times before I was 18. I think it did have an affect on me, not an entirely good one, which my family disagrees with.\n\nAs a teen, I was always aware that I probably wouldn't be around long, and so increasingly avoided making close friendships, since I'd just have to move anyway. I didn't keep much in my room, since it made moving easier, and refused to settle in fully. Things were still ok until I was 14 and in my freshman year of high school.\n\nWe'd moved to that area a month before school started, and had been living there four months when I met this boy. We went on our first date ever together, he was great, then two days later my dad told us we had to move again. This isn't all about a teen crush, it was just another bad thing.\n\nthe issue is my parents and siblings (18F, 16M) act like it was objectively great. They say it taught them to accept change and make friends quickly, me? I gave up on friends and was living out of a duffle bag by 15. I moved into college at 18, and still have some some feeling like it'll all disappear someday.\n\nI told my parents when they asked me if I had fun settling into one of our locations, that no I did not. I knew we'd have to move again soon, and didn't bother getting attached. They said I'm acting like I actually sacrificed for our country like dad did, and I said I did. Now nobody in the family is speaking to me and I feel like shit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You did sacrifice for your family. NTA.", "NTA moving around a lot is hard.", "NTA Your feelings are your own. And understandable. But their feelings about the experiences they had are also valid. Neither one of the set of feelings is wrong or right, they just are. Any way you can get some therapy to process your feelings/get more secure in your life?", "Not military, but I grew up with a lifestyle where we didn't stay in one place for more than a month at a time. It messes you up in a way that doesn't really go away easily, when you're not allowed to form normal long-term social relationships as a child. \n\nNTA.", "NTA if they like being rootless, good for them. They don't sound like people actually capable of forming lasting attachments.", "NTA. Your mother and father choose to be a military family but you didn’t. I’m prior service and my husband is still currently in with at least 1-2 more moves ahead of us before he’s retired. I have to change jobs every time we PCS and I don’t really have long term friends. It’s okay because it’s our choice but we didn’t bring kids into this either because that wouldn’t be fair. I’m sorry your family doesn’t consider your sacrifice important, because it absolutely was.❤️", "op=NTA\n\nYou have a right to your emotions/inculcated reactions.  I do think that some therapy might help you deal with the \"it'll all disappear\" feeling. \n\nYour family have the right to their \"experience\" but so do you.  I say accept theirs(there is no indication you try to convince them that their feelings are wrong, but I say this to be clear).  And they should accept yours.", "NTA at all. I'm not from a military family, but I moved 11 times throughout my school career(?) And attended 9 different schools in total. I gave up on friends entirely, and kept all my favorite things together in a lunchbox just so none of it would get lost during the next inevitable move. I still have issues with feeling secure or \"at home\" even today, and I'm 36 now. My siblings were younger and handled it way better, so maybe it's something younger kids can just shake off?", "I’m a Military Spouse and my kiddos are in your same boat. Your experience is VALID. I can not tell you how many sleepless nights I’ve had worrying about my children who have moved 10 times already and still have a few more to go. Their Mental Health is a constant worry for my husband and I. \n\nThankfully, because of the internet and phones, they have been able to maintain some friendships now that they are teens.  But both of them are very confident, pretty self contained, and self Motivated. When we move to a new place we make it a point to tighten our ranks and try to experience all of the new things and visit all of the sights, so that it’s an adventure not just a move. As a result, we are a very tight family unit.\n\nAll of that being said, I fully expect to pay for years of therapy for their inability to settle in one place and maintain relationships. They have talked about the difficulties and their life experiences are so much harder than mine were. Military families are the unpaid service members that get “voluntold” where and what to be.  \n\nJust know you are not alone in your feelings.", "This. You’re NTA OP. Find a therapist to talk with about this situation. Thanks to your father for his service, and thank you as well. Military doesn’t only affect the ones that serve.", "There is actually an agrument that military families serve, too, just in a different way.", "I grew up an Army brat. I am firmly in the \"I loved every move\" camp. My sister, on the other hand, couldn't settle fast enough. Even with my forever wanderlust, I agree with OP. Military families make so many sacrifices that are often overlooked. I have been in the same place for 15 yrs now and still have difficulty building friendships because the desire to move on is in the back of my mind. NTA OP", "And the crucial difference is that dad CHOSE to sacrifice. OP did not. It was forced upon them.", "That's absolute horse pucky. And by 'that' I mean this: 'nobody considers the families of military personnel and their feelings.' I've had many years experience with the military, some enlisted, some as a family member and there are lots of resources for family members. Some bases are better at getting the word out. Some military members are not going to like it some of the resources are used (due to some misguided sense of machismo or something.) Operational concerns will always come first, of course, but to say that 'nobody considers the families...' isn't true.", "How would that help clarify if she's an asshole regarding her initial question? Moving where you live as constantly as an army family sucks no matter what extenuating circumstances there are.", "To clarify, as I think you misinterpreted what I said... I wasn't referring to the military itself as not considering families. I mean the general public. People like me, who have zero military links. When we hear about the military, we think of the military personnel and forget about their loved ones and their lives. OP and their post has opened up my eyes and I am sure many agree.", "I agree. However, if her father deployed in active war zone comparing her moving around to being at war does not work. I realise that she may not meant to say that her sacrifice is equal but that how it sounded...", "Yes, I did misinterpret. Thanks for clarifying. :)", "Where is that comparison made?", ">\"They said I'm acting like I actually sacrificed for our country like dad did, and I said I did\".    \n>  \n>  \n>  \n>She said that she sacrificed like her dad did... Thus my question...", "Her Dad Volunteered. OP was Drafted."]}