{"id": 14446, "submission_id": "12hfrdc", "title": "WIBTA for refusing to pack my husband’s lunch?", "selftext": "My husband (35M) and I (28F) have 2 beautiful children (5M, 3F) and I am currently pregnant with my third child.\n\nRecently, my MIL has fallen onto hard times and lost her apartment. My husband invited her to live with us, which I wasn’t originally happy about because with the little one on the way I wanted time to focus on our family, but I ultimately understood that it’s a special circumstance.\n\nThe problem is that MIL has really changed since she got here. We used to have a relatively good relationship, but she’s increasingly been demanding and unreasonable. I know it’s a hard time, so I’ve tried to be accommodating, but it’s all getting to be too much.\n\nFor example, she’s been asking that we buy specific brands when getting groceries, which would be fine if they were just for her, but she’s been insisting that the cereal brand we feed my kids isn’t healthy and they have to eat a different brand. The one we buy is the one they like and it’s not particularly unhealthy as far as cereals go. She’s also been moving our furniture around, primarily the guest room that she’s staying in but recently she had my husband swap the couch and the armchair in the living room while I was out running errands.\n\nAll this is fine, I love my husband and my MIL and can understand what she’s going through, so I can deal with it.\n\nIt all finally came to a boiling point last night.\n\nMy husband and I have been having a disagreement lately. Usually, my husband makes his own lunch to take with him to work. However, since I’ve recently quit my job to become a stay at home mom, he thinks I should start making his lunch along with the children’s lunches. My husband goes to work an hour and a half before the children go to daycare. I currently wake up around the time he leaves for work and have plenty of time to get the kids ready and make their lunches. If I were to make his lunch, I would have to get up way earlier. We’re at an impasse on this issue right now.\n\nApparently, he complained to his mother about it, because she confronted me last night about being a bad wife. In her words, I’m “not good enough” for her son if I can’t even “make this one sacrifice to make him happy”.\n\nBeing confronted like this just made me so mad and I don’t even know why. I snapped and yelled back at her and said some things I regret.\n\nNow my husband expects me to give my MIL an apology and start packing his lunch, and neither of them are talking to me until then.\n\nMy husband and I have never had problems like this before. He’s always been so good to me. I’m worried that I’m overreacting and making and already difficult time even harder. I’ve never snapped like that before but I just feel so overwhelmed and I don’t have anyone in real life to talk to about this because my family doesn’t understand my relationship with my husband and don’t support us.\n\nReddit, WIBTA if I held my ground?", "created_utc": 1681125673, "permalink": "/r/AmItheAsshole/comments/12hfrdc/wibta_for_refusing_to_pack_my_husbands_lunch/", "score": 3154, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m TA because my MIL is really suffering and my husband is generally good to me. I should suck it up to temporarily keep the peace.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nIt sounds like you need to get the MIL out of your apartment asap. She's inserting herself into your business, disrupting your marriage, and making your husband even more selfish and inconsiderate than he was before.", "Nta. A grown ass man who can't even make his own lunch is pathetic.", "NTA   \n\nYou and husband need to have a discussion so that both of you are on the same page on things. With his mother in the house he HAS to be 100% with you on anything that involves your team.   \nHe sounds as if he is going to run to mommy with everything and this must be stopped or her living there is going to ruin your marriage.  \n\nThe two of you and your children are the family unit here and you and your husband are the TEAM in charge of things.  \nMIL is an additional player- not running the house and not making demands.   \nShe lives there because of the team's generosity and anything she does to disrupt that TEAM is unacceptable.  \n\nBut until you get your husband to feel the same way there is going to be friction.  \n\nThis is not about packing lunches.   \nThis is about your husband taking sides and being influenced by his mom.  \n\n>Apparently, he complained to his mother about it, because she confronted me last night about being a bad wife.      \n\nHusband 100% in the wrong here and it needs to stop.    \n\n**This is your problem.**     \n\nHusband needs to understand what TEAM he plays for and not be complaining to his mommy OR allowing her to speak to his wife this way.  \n\nAnd clearly, you guys need to start making other arrangements for mommy- this is very likely only going to get worse.", ">Now my husband expects me to give my MIL an apology and start packing his lunch, and neither of them are talking to me until then.\n\nSo your husband recruited his mommy to his side over a minor disagreement, which piled onto a build up of a lot of tension his controlling mommy is causing in your home. You reached a breaking point and finally snapped. Now they're punishing you with the silent treatment. \n\nYou're absolutely NTA. Enjoy the silence as much as you can.\n\nETA: let his mommy make his lunch if she's so concerned about him and so intent on disrupting and controlling things in your home", "NTA. He's a grown ass man. I'm a SAHM with one kid who is in school full time and I still don't pack my husband's lunch. Because he is a grown up and not my child. And it's gross that he and MIL are apparently having these discussions about you.", "NTA. He’s 35, definitely old enough to make his own lunch. If you decide to make it, give him a kids meal - peanut butter sandwich, a cheese stick, and one cookie. If he’s going to act like a little kid, he can eat like one. \n\n\nAs for MIL, she needs to be reminded that she’s a guest in your home not a permanent resident.", "NTA\n\nSounds like MIL needs to get out of your house. \n\nWhatever’s happened to change her circumstances isn’t your problem, and her redirecting that frustration to managing your household isn’t ok.\n\nAnd your husband should be backing you on this", "NTA.\n\n> he complained to his mother about it,\n\nSo he has become a momma's boy?   Something that goes wrong that he doesn't like he is running a mama.\n\nIf you were making everyone's lunches the night before and they just had to pull them out of the refrigerator then I would say go ahead and do it.\n\nbut trying to  force you, while you're pregnant with his third child, forcing you up earlier just to make his lunch cuz he's too bunch of a baby to make his own lunch?!?   Hell to the no.\n\nIf he wants to be such a mama's boy his mother can make his lunch...\n\nOr better yet she can get out of your house.... Does he have any other siblings that can take her in??", "NTA. Sounds like there is a reason your family doesn't like your husband. It also sounds like YOU are doing all the sacrificing and compromising in this relationship from what I can read. Don't pack his lunch, stop catering to his mother, and tell them both that they are welcome to leave if they aren't happy with it. You already have two children and another on the way, you don't need two more at home giving you headaches over petty issues.", "NTA-  Since it's so important to his mother, she can pack his lunch everyday.  Problem solved!", "You are literally growing a human inside of you and he wants to take away your sleep. That level of laziness is so unappealing. NTA", "NTA. MIL has got to go. Your husband is an adult who, like many other adults, can make his own lunch. \n\nYour husband should be loyal to you, not his mother. Can he not see that she's now causing problems in your marriage? Do not apologise and do not start making his lunch.", "NTA, however it might be a good idea to have a talk where you clarify what exactly your job as homemaker entails. Otherwise, it is a risk that task will continue being pushed to you that you feel isn't your job. This needn't be more than just vocalizing your existing consensus.\n\nBut if MIL continues whispering in ears, having had a frank conversation means you can go \"we talked about it, and agreed that wasn't my job. Do you want to swap chores?\"\n\nAlternatively, I like \"am I takling with you or your mother right now\" as a response.", "Absolutely NTA. You're a stay at home mum, not his mum. And if he wants his mum to pack his lunches, then (luckily- for only him) his mum lives there now too!", "YWNBTA. Why is this grown ass man insisting you make his lunch for him? Seems like having his mother around has resorted to him acting like a child and she’s enabling that.", "YWNBTA - There is no reason why you should be packing your husband's lunch. He's an adult who is perfectly capable of doing it himself, and has time to do so. That is reason enough to stand your ground.\n\nYou also need to set some boundaries with your MIL. She is living in your house, but that doesn't mean that she can dictate what you buy and feed your kids, whether you make lunch for your husband etc. If you back down on this, it will be harder to set these boundaries which you clearly desperately need.\n\nIt was unacceptable of your MIL to say that you 'weren't good enough' for your husband. That's completely out of order. You don't need to apologise for being angry in response per se. However, depending on what you said in response and how you said it, there might possibly be a slight reason to apologise for those words in particular (you say that there was something that you regret saying), but be careful to make sure that it doesn't sound like you're saying \"I'm sorry I was angry\" or \"you're right, I wasn't being good enough\", as that is both untrue (you are good enough) and doesn't need apologising for (it was reasonable to be angry).\n\nCould you talk to your husband and say that you will apologise for saying those particular words that you regret only (but not apologise for being angry etc), but only if you can both set some boundaries for your MIL while she is staying in your house, and that you will not be making his lunch? I get the impression that this is not just whether or not you make your husband's lunch, and more about the way that your MIL treats you and the lack of boundaries.", "NTA\n\nhe is being an arse and then running to mummy who he has conveniently moved in.\n\nHis attitude is awful...you are pregnant and taking care of 2 kids...why should you baby him?", "NTA. Your MIL being on hard times isn't an excuse for her to overstep in your home and your marriage, all the more when she's benefitting off of your kindness by living under your roof. \n\nYour husband's demand is ridiculous in my opinion, I'd just laugh nonstop if my husband ever asked me to get up earlier than I need in order to make HIS lunch. I know the reasoning is that he is going to work while you stay home... but you stay home to take care of your (and in, yours and his) children, he's not providing you with a free ride through life. You don't owe him anything, just as he doesn't owe you anything. This is the agreement you guys decided would be best for your growing family. You being his PA isn't part of that. \n\nSnapping at your MIL might have been wrong (don't know exactly what you said to her but if you regret it, I guess you know you went too far), but being mad at her for sticking her nose in your marriage was justified. \n\nApologizing to her for snapping and saying hurtful things would be ok. But your husband and her expecting you to cave into the packing lunch argument as part of the apology is manipulative and ridiculous. \n\nIf your husband has always been a good partner, it's almost a given that the presence of his toxic mother in your home is causing him to deviate from his usual behavior. I would try and have a conversation with him about this and see if there is a way to help his mother out without having her there. Or a way for him to see the real issue and set firm boundaries with her. \n\nBut I would not start packing the lunches. Hell no.", "THey are both AHs so big. The two of them are a deadly combination. You are NOT overreacting, that is a big deal. Good for you that you held your ground.", "NTA for not making the lunch. but what did you say that you regret? And why don’t your family understand your relationship with your husband?", "NTA. Sounds like your husband wants to have two mommies in his life instead of a wife. Tell him to grow up.", "NTA. Why the hell can't his mommy make his lunch the night before? I'm sure she knows how he likes his sandwiches cut.", "NTA. But why do the lunches in the morning, I do mine in the evening. Nothing worse than rushing in the morning.", "NTA and he should be asking his mommy to make his lunch for him since she’s right there.", "‘I’m sorry I didn’t consider compromise. MIL from now on you will pack husbands lunch. You can make mine too and I’ve some addition chores for you since you want to stay in my house. Husband, I’m sorry you confused me as the mother of your children with mother of you.’\n\nNTA. They can go kick rocks. But seriously you need to have separate conversations with both around boundaries, respect and your MIL sticking her nose where it does not belong and interfering in your marriage. \nHusband needs a massive kick up the ass. If he wants his lunch packed and ready to go then he should be making his lunch the night before.", "WNBTA\n\nTell MIL she can earn her keep and pack her son’s lunch. \n\nTell hubby he has to discuss a move out date for MIL. \n\nMIL being in your house is causing relationship problems. Mummy dearest thinks her son deserves everything and is convincing him that you aren’t doing your “job”.", "NTA\n\nIt's interesting that your family do not support your relationship can I ask why?  Have they witnessed something in your relationship that's concerning?\n\nI will say if you concede on this issue with H/MIL there will be numerous others that they will tag team you in until you concede. \n\nTake care of you and your children and try to find someone that you can confide in.", "NTA.\n\nHowever, I suggest a little bit of malicious compliance. You now have 3 kids, so you pack 3 kids lunches. He can have exactly what they are having. You could even start writing loving notes about your special little boy, and put happy little faces on a cupcake. Don't forget the juicebox.", "NTA. Imagine asking your pregnant wife to lose more sleep. Your husband isn’t your 4th child, he’s a grown ass man and can pack his own lunch.", "r/justnomil", "NTA the lot of you are on a slippery slope with MIL in the house. She should not interfere in any way and be grateful she can stay in your house. Your hubs should stop running to mommy to get his way.\n\nPossible unrequested solution: make his lunch the night before. Not saying you should make his lunch, just offering an alternative solution to this issue.", "Info: What were the things you said that you regret? MIL and husband are clearly AHs but you arent for not making the lunch but you could be for what you said.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband (35M) and I (28F) have 2 beautiful children (5M, 3F) and I am currently pregnant with my third child.\n\nRecently, my MIL has fallen onto hard times and lost her apartment. My husband invited her to live with us, which I wasn’t originally happy about because with the little one on the way I wanted time to focus on our family, but I ultimately understood that it’s a special circumstance.\n\nThe problem is that MIL has really changed since she got here. We used to have a relatively good relationship, but she’s increasingly been demanding and unreasonable. I know it’s a hard time, so I’ve tried to be accommodating, but it’s all getting to be too much.\n\nFor example, she’s been asking that we buy specific brands when getting groceries, which would be fine if they were just for her, but she’s been insisting that the cereal brand we feed my kids isn’t healthy and they have to eat a different brand. The one we buy is the one they like and it’s not particularly unhealthy as far as cereals go. She’s also been moving our furniture around, primarily the guest room that she’s staying in but recently she had my husband swap the couch and the armchair in the living room while I was out running errands.\n\nAll this is fine, I love my husband and my MIL and can understand what she’s going through, so I can deal with it.\n\nIt all finally came to a boiling point last night.\n\nMy husband and I have been having a disagreement lately. Usually, my husband makes his own lunch to take with him to work. However, since I’ve recently quit my job to become a stay at home mom, he thinks I should start making his lunch along with the children’s lunches. My husband goes to work an hour and a half before the children go to daycare. I currently wake up around the time he leaves for work and have plenty of time to get the kids ready and make their lunches. If I were to make his lunch, I would have to get up way earlier. We’re at an impasse on this issue right now.\n\nApparently, he complained to his mother about it, because she confronted me last night about being a bad wife. In her words, I’m “not good enough” for her son if I can’t even “make this one sacrifice to make him happy”.\n\nBeing confronted like this just made me so mad and I don’t even know why. I snapped and yelled back at her and said some things I regret.\n\nNow my husband expects me to give my MIL an apology and start packing his lunch, and neither of them are talking to me until then.\n\nMy husband and I have never had problems like this before. He’s always been so good to me. I’m worried that I’m overreacting and making and already difficult time even harder. I’ve never snapped like that beofre but I just feel so overwhelmed and I don’t have anyone in real life to talk to about this because my family doesn’t understand my relationship with my husband and don’t support us.\n\nReddit, WIBTA if I held my ground?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Firstly, your mother in law getting involved in a discussion that pertains only to you two as a married couple is massively overstepping boundaries, and based on other context re: her behaviour in the post I'm guessing that is what your husband wanted by telling her, so that makes them both huge AHs\n\nSecondly, the entire point of you taking on more responsibility after quitting your job is that you have more free time. In my opinion, asking you to wake up earlier doesn't fall under that umbrella and doesn't seem like a fair change to ask based solely on the fact that you quit your job, so NTA there either\n\nThe one thing I don't understand - if you have more free time during the day now, why don't you just meal prep and keep lunches in tupperwares for them? Most food will last up to 3-4 days in the fridge. If I weren't working and my wife were, I would definitely be using at least some of that free time to cook, saving her time and both of us money. Seems like a fairly easy solution\n\nNTA and I don't think you owe an apology for what was a clear overstepping of boundaries (I guess it might depend on how nasty the things you said were), but it does seem like this \"conflict\" with your husband can be easily resolved, assuming you don't mind using your free time to make him lunch in general\n\nETA if pregnancy is preventing you from being on your feet making food then that would obviously be an entirely different discussion, but that doesn't seem like the case based on the context provided", "NTA.\n\nBut start packing everyone's lunches the night before and leave them in the fridge. Problem solved.", "I'm not saying she should. I'm asking why she shouldn't.", "NTA.  Compromise might be good though.  Have you thought about packing his lunch the night before?", "Why can't you make his lunch before you go to bed?", "Do you think he's not also overwhelmed? Now he's going to work to provide for all y'all.\n\nEveryone knows that when you're making multiple sandwiches, one more isn't taking more than a minute.\n\nIs he not worth one extra minute in the morning?", "NTA but your MIL needs to move out. She's going to wreck your marriage and your husband will let her.", "NTA Hold your ground. Your husband is a grown man and can either pack his own damn lunch, eat out or go hungry. As far as MIL tell her to mind her own business or move the f*** out.", "I'd hold your ground. I guess you have a couple of options for which battle you fight - one would be whether you try to get MIL out of your flat, and another is whether you ask her to do more to support the household. For instance, helping with the kids and/or making your husband's lunches? Or working to bring in more money to the household?", "You are not living under her roof, she is living under yours. Hold your ground. NTA", "NTA - he is a grown up… and when he was reminded of this (by being told he would need to continue making his own lunch), he ran and cried to his mother about it. Pathetic.", "NTA , The mother can make more sacrifices for her son , the only way to handle silent treatment is to give it back .", "YWNBTA\n\n&#x200B;\n\nYou should demand for MIL to move out, or get a divorce.", "NTA if your MIL thinks her son should not have to make his own lunch, she should make it for him. The one question I have is why you and your husbands don't make the lunches at night? Make an extra portion of the super he can bring as leftovers and prepare whatever it is you make for the kids in advance.", "NTA, they’re ganging up on you while you’re pregnant, he can absolutely prepare his own lunch or have mommy dearest get up earlier for him if she thinks a 35yo needs that kind of support, you are doing *her* a favour by letting her stay. And the fact that you’re isolated from your family and apparently don’t have any friends either is an additional red flag. I’m worried for you.", "NTA Sounds like you need to reconsider both being a SAHM and having this man as your husband. You should definitely be pushing for her to move out at minimum", "NTA. Mommy can make his lunch and pack it in his he-man lunchbox.  Then she would actually be contributing something to the household.  You can tell her I said that.\n\nDid he really just move Mommy in with no input from you?  If so, HUGE AH.", "NTA he can pack his own lunch or his mommy can do it for him. As for the groceries she chips is, buys her own name brands, or shuts up & eats what is provided for her. Personally I would go back to work, save your money & plan for a way out.", "NTA but I wonder about your MIL’s motives.", "NTA. it’s not the 60s anymore a man can pack his own lunch if he cares that much and honestly it seems like he only has an issue with it because his mom thinks it’s a problem. she’s come into your life telling you how to parent your kids and now how to parent your own husband. she just wants to make you feel bad otherwise she’d just do it herself.", "NTA.  Your husband is an adult and can make his own f#cking lunch!   It's time for MIL to go, she is going to cause the end of your marriage if you don't address it very soon.", "NTA\nHe can make his own lunches", "Nta. This would be a hill I would die on. Because for me it wouldn't be about the lunches. It's about the fact that his mom is in his ear, and then when he doesn't get his way, he goes whining to her. I would want her out of my house immediately. He can sleep in her room and she can make his lunch. But she needs to be on her way out the door or else I would be.", "NTA. He has two hands. He can make his own lunch. And I fear your MIL will never leave, so you need to talk to your husband about the end date for her stay. And if she cares so much, she can pack his lunch.", "NTA. What is mil bringing to the table to help out? She needs to move out.  She can go stay with other family but she has worn out her welcome with y'alls.\n\nHubby needs to get on board with you and stop running to his mommy.  Why isn't your family on board with your marriage", "Agreed.\n\nSilent treatment from the MIL honestly sounds like a blessing. Helping her is a wonderful thing you did but she needs to now help herself, move out and get on with her life. \n\nAlso it’s incredibly selfish of your husband to demand that you wake up just to make him lunch when he’s capable of doing it himself. It’s a shame that people don’t give stay at home mothers the respect they deserve.", "And goes crying to mummy?? Pathetic is putting it mildly.", "This", "Right? I'm not a SAHM right now but I stopped working when my son was a baby for a while, and I sure as hell never packed lunch for my husband. I can only imagine how long I would've laughed if he ever asked. But once I'd stopped, I'd ask him when did he stop being a functional adult...", "And pack his lunch the night before. No need to lose sleep.", "Yeaaa. What is the timeline for her leaving? Is there a plan? There should be a *plan*. NTA", "Lunchables.", "Food flasks etc are pretty popular at the moment where you include hot food in the lunch, not a kid but I really like a pasta salad that goes soggy if made too far in advance and sometimes frozen banana 'ice cream'.", "> If I were to make his lunch, I would have to get up way earlier. \n\nThe answer is in the post.", "Why can’t he?", "She might be tired from working at home taking care of a kindergartener and a toddler all day while pregnant.", "One minute to make a sandwich? That's BS. Also she said she would have to wake up much earlier to do it. Did you even read the post?", "How can you side with those 2 assholes? If he can run to mommy he can ask her to make the damn sandwiches.\n\nOp is ABSOLUTELY NOT the AH in this situation!", "OP stated that she would have to get up way earlier to make his lunch too. She has 2 kids and one on the way. She needs all the sleep she can get. That in itself is just as full time a job as his.  Sounds like he's running to Mummy to get his own way around the house. Also MIL needs to accept that she is a guest in their house. That doesn't entitle her to rearrange furniture and interfere in their marriage.\nDefinitely NTA if she doesn't want to get up earlier to make a sandwich he could quite easily continue to make for himself.", "That would be a reasonable argument if she could make it the same time as the kids.  But he leaves earlier so it sounds like she'd be getting up at least an hour earlier solely to make his lunch.  This isn't a reasonable ask of him on a pregnant woman.", "They both can.  Sometimes asking your partner to do something like pack your lunch makes you feel really seen and cared for.  Though I don't see any reason he can't and shouldn't pack it himself.\n\nMy issue is she said she didn't want to pack it because* she'd have to wake up early.  If that's really the issue, packing it at night would solve her problem.  If that's not her issue, she should state her actual issue.", "Making sandwiches is not that time consuming. Especially when you're already making them.", "who said OP was TA? not me.", "Do you think husband cares about any of these reasons when hes breaking his back a work and has go eat some crappy McDonald's as a reward?", "It's not *that* time consuming... But it's also not a minute! And she's not already making them. She makes them after he's left for work.", "> Usually, my husband makes his own lunch to take with him to work.\n\nNot McDonald's, the guy literally makes his own lunch. \n\nYou really only read \"he wants lunch, I said no\" and ignored everything else in the post, eh? LOL\n\nAlso, do you think OP cares about his reasons when she's breaking her back taking care of the home, the kids, and growing a third in her body... all while putting up with his asshole of a mother that he brought to live with them? \n\nYou're a joke. This guy isn't a victim no matter how hard you try to paint him as one.", "when I make one sandwich, it takes about 4 minutes. When I make two sandwiches, it takes 5.\n\nObviously y'all need to get smarter about how you're making those sandwiches.", "Completely ignoring his contributions.", "But, again, she's not making the sandwiches then. So she'd still have to wake up earlier to accommodate making his sandwiches (like he's a lickle baby). So it isn't the effort of 1 minute, is it? You're ignoring the real issue.\n\nAlso, do you know that he has the same sandwiches as the kids?", "Not ignoring them. They're the same. He's not an asshole for not making lunch for her. She's not an asshole for not making lunch for him. They each do their part for the family they decided to build.", "I work long hours and can make my own meals just fine, thank you :) Just like ANY adult with common sense can", "Respectfully, I believe you're ignoring the real problem: we have a hard working man in need of lunches.", "Hahahahahahahahaha. Oh yes, because a hard working man isn't capable of spending 1 minute on something in the morning? (As you're hell bent on thinking it only takes a minute). Should someone be making sandwiches for the hard working woman too? Or is it the penis that prevents him from putting fillings in bread?", "Respectfully, he is expecting a hard-working woman who is looking after a kindergartener and a toddler all day, and also pregnant, to get up two hours earlier than needed in order to make him lunch. \n\nWhen he has been doing it himself up until now. \n\nHe's perfectly capable of making his own damn lunch and go to work, just like he's been doing. He just thinks he's now entitled to have his wife cater to him because she quit her job to stay home and raise the children HE HAS WITH HER.", "Obviously he can make his own sandwiches. That's not the issue.\n\nEhy doesn't a hard working man, bringing home the bacon, deserve a little BLT?", "She's perfectly capable as well.", "He may deserve a BLT. But he doesn't need his wife to act like his mummy and make it for him. If he wants his mummy to do it, she lives there now too. What is she doing to help them while she mooches off them and gets in the wife's way?\n\nIf you just don't consider childcare work, why not just say it?", "So is the neighbor. Should she make this guy's lunch, then? \n\nShe has no obligation nor need to make a grown ass man his lunch. It's his lunch, he can make it. Like every other functional adult does.", "NTA\n\nIf your MIL has nothing better to do with her life than to make your pregnancy harder then she can make her precious baby boy his lunch every day. She can stop being lazy and be a parent!", "NTA. Tell your husband MIL leaves or you leave. Period.  MIL is a cancer creating havok in your family unit. She won’t rest until you’re done. Literally. Stand up for yourself. Be strong you have the power to do so. If he doesn’t kick her out, then you move out with your family. Take the children with you. Even if family lives out of state do it.  This calls for a nuclear option.", "NTA. This is the hill to die on. Demands like this should never be accommodated or accepted. Mommy make make his lunch. And op she should be leaving soon. It’s only going to get more ridiculous with her around.", "First, quit trying to be accommodating.  Second insist that NO furniture should be moved without you giving the okay.   Tell Mil she can eat the brands YOU buy or do without.  Tell husband to make HIS own lunch or do without.  ALL of this is NOT fine.  Talk to your husband ASAP and tell him that you will NOT tolerate this behavior from him or MIL.  You are nta, and if you give in, get used to a life with MIL making decisions and living in YOUR (and husband's) home.", "NTA. Time for her to go.", "NTA. Your MIL crossed some major lines and there should be a date set for not too long in the future where she is out if your house.", "Nta - this needs to stop now! \n\nI might be petty enough to tell MIL \"I'm sorry you were such a failure as a mother that your 35 year old son can't manage to make his own lunch! But since you are here you have plenty of time to train him on how to adult\"!", "Info: did you guys speak about how long she would be staying? It kinda seems like he just moved her in without your opinion. And no she’s rubbing off on him and now they’re both making demands of you. Is this something that you’re handled to deal with long term? Because if there’s no definite end and he’s already running to her over a disagreement between you two, it’s not gonna be any better once you have the baby.", "Are your sure you married an adult? NTA", "Info \n\nWhy doesn't your family support your marriage ?\n\nDo you not have any kind of support ?", "why can't she pack his lunch if she's so mad about it. he's HER son after all", "NTA. Kick out the mom, have a serious discussion w your husband", "NTA. \n\nHow are you fine with all the other stuff she has pulled on you? Her true colours came right out when moved in, didn’t they? I hope for you she’s gone soon. \n\nAnd your husband is a grown man, he can make his own lunch. His request is unreasonable. \n\nYou are taking care for your family, but who is taking care of you?\n\nAlso, them not talking to you to make you oblige is such a red flag. Please stand your ground. \n\nAnd another idea: maybe MIL can get up early to pack his lunch since that is a mother’s job, not a wife’s.", "NTA\n\nTell him you stopped work to be a stay at home parent….and he’s not your child.\n\nAnd mil is rearranging *your* home to how *she* likes. She has no intention of ever moving out.", "NTA Get back to work so you can kick both of 'em out and get some child support.", "NTA \n\nHe’s been making his own lunch with no issue up until recently. If nothing has specifically changed for *his* schedule, there’s no reason why he can’t *continue* making his own lunch.", "Let him make his own lunch. If you were way out of line apologize for what you said, if not don’t even do that.", "INFO\n\nDid y'all discuss role changes before you quit your job?", "NTA. You are a SAHM to your children. Since his mother is staying at your home, I'd say she's the one who should be making lunch for HER child.", "ESH.  What about one of you, including MIL, simply making lunch the night before and storing it in the fridge?  That’s a completely normal solution.  You all seem stressed by normal things with simple solutions.  Seems like the house is a bit of a pressure cooker at the moment.  This is a non-problem, a mountain out of a mole hill.  So, take a step back, look for easy solutions and try and get a perspective.", "[removed]", "[removed]", "NTA and you’re outnumbered.", "Get a job and a separate bank account bc I cannot see this going well if he can’t stand up to his mom and just adopt her opinions", "At first I was thinking, come on woman. Your husband enables you to be a SAHM, would it kill you to make him lunch? If he leaves too early in the morning for this to be practical,  just make it the night before and leave it in the fridge. No biggie.\n\nThen I read on about dear mommy’s input and I snapped along with you. That catapults you straight over to NTA territory. Husband needs to polish his cojones and stand up for you against meddling mom - though your comment that your family doesn’t understand/support your relationship rang a bit of a warning bell. What’s that all about, then?", "NTA - sounds like you and hubby need to have a conversation about boundaries. Hopefully you two can get on the same page before baby #3 arrives.\nAs far as the apology - you could apologize for what you described as saying \"things I regret\" but do NOT apologize for sticking to your boundaries. There is also the classic non-apology \"I'm sorry you felt...\"", " I still don't pack my husband's lunch.", "a date set for not too long in the future where she is out if your house.", "NTA, hold your ground and point out to your husband this is your home and you have accepted all the changes your MIL (a guest) has made, but that stops now. Best of luck to you.", "NTA. If dearest mummy is so concerned she can pack his lunch.", "Nta. How hard is it for him to put leftovers or a sandwich in a bag? To make you wake up earlier to do that for him is ridiculous. He can pack it at night if he doesn’t want to do it in the morning.", "NTA\n\nI think you need to check into a hotel until the MiL leaves.", "How are you a SAHM, but yet send your kids to daycare?  As a SAHM, what do you do?  Why can't you make his lunch the night before instead of getting up early in the morning?", "NTA Oh this is a terrible mess. He needs to be reminded that he made his vows, to you, his wife. That you are not his mother and will not mother him. He is your partner and needs to step up as your partner. That means sharing the labour and chores of the home. Therefore, he needs to make his own lunch. You do not have the time to be the mother to him as well as your children, the children need a father, not another sibling. That his mother's presence is now having a severe negative impact on your marriage and you need to work out a time line for her to go.", "NTA\n\nHonestly, I would go on the offensive here. Stop being on the defensive. \n\nTell your MIL that this is your home, and you do not need her input with regards to your children, or the relationship with your husband.\n\nTell MIL that she has not been a good guest with her meddling. Her son cannot have two wives -- either you stay and she will have to go, or she stays and you will have to go.", "NTA. \n\nRemind yourself and everyone else, that HE IS A GROWN ASS MAN. he can make his own lunches or starve. \n\nBut honestly, if this is the way that he's going to treat you because mommy is talking in his ear, and he's going to allow his mother to disrespect you like this. Then I'd be rethinking the relationship. \n\nI'd get a job and get a divorce, then move closer to my own family and friends. \n\nI wouldn't make lunch for him and id be seriously considering divorce if husband doesn't get a spine, get bis head on straight and get mil out of the house.", "NTA. \n\nA real partner doesn't go crying to mommy because her advice and her tantrum didn't work on the wife. \n\nHe's a grown as man and can make his own lunch. He's been perfectly capable of doing it all this time before mommy moved in, so he can do it now.", "I understand the frustration but isn’t there a compromise. What does he take for lunch. Can’t either of you pack it the night before or something? PS- NTA and I’m sorry your MIL is being difficult.", "NTA \n\nYour MIL has to leave. This will not get better.", "Why don’t you just make his lunch the night before? \n\nNTA though. Silent treatment and involving a third party in an issue between me and my husband would both be deal breakers for me.", "NTA And I don't care if you ever pack his lunch, but did you consider packing lunches in the evening instead of the morning?", "NTA. But if you wanted to make his lunch with your kids' lunches you could just make them all the night before. Or why cant your MIL make them all? It doesn't sound like she's contributing much.", "NTA. It’s beyond pathetic that a grown man can’t make his own lunch. Since it matters sooo much to Mommy Dearest, she can do it herself.", "i guess we just learned why he wasn't dating women his age. at 30 this would have been an unattractive trait and as you near that age you are seeing this still dependent on his mom more clearly.\n\ntime to have MIL move out\n\nNTA", "NTA. You’re making lunch for your kids. Maybe mommy can make lunch for her kid if it’s so important. \n\nSAHM = Stay at home MOM. Not stay at home chef on demand. Not stay at home maid. Stay at home MOM. Your duty is to the kids. \n\nAnd the whole running to tattle to mom? Nah that does not fly.", "honestly it sounds like your third wheeling to him and his mom. i don’t think his apron strings ever got cut. NTA", "If your decision to leave your job didn’t impose any new time constraints or requirements on him, NTA for not making his lunch.", "Why can't you make his lunch the night before and put it in the fridge?", "NTA, he can make his own fucking lunches.", "NTA if he continues to bring up making his lunch I would tell him this is no longer up for discussion, you are not making his lunch and that’s it. He and your MIL both sound insufferable.", "Get a job and a divorce. MIL can make lunch for him.", "[deleted]", "NTA\n\nBut why is MIL still living with you? I wouldn't put up with any of it.\n\nThe way I see it... If things keep going the way they are you will end up falling out of love with him and going NC with your MIL. There is no way around it.\n\nSo things can change now or you can leave or you can suffer for a couple of years first until everyone hates each other, and then leave.", "This is going to get worse.", "And the MIL really.tries to say she's not doing enough and isn't good enough for her son. She's just pregnant with their third child, taking care of the household and being a great partner. It's outrageous that he would expect her to get up early to make his sandwich.", "This is really all that needs to be said.  NTA, OP.", "> Usually, my husband makes his own lunch to take with him to work. \n\nI mean, we can at least *try* to read the post.", "There’s nothing inherently wrong with packing a lunch for your partner, it’s not inherently childish like you’re suggesting, it’s just another chore. Many relationships could be perfectly amicable and have one partner doing it for another. The problem here is basically everything that the husband and MIL are doing, rather than the base concept.", "There’s nothing wrong with one spouse making lunches for another. I work from home and my wife doesn’t, so I make her lunch every day.\n\nHowever,  d it because it falls in our schedule so that it is a lot easier for me to do than her. I certainly wouldn’t wake up an hour early just so I can get her lunch made.", "She could make the lunch the night/day before. I don't think it's asking too much considering all the financial burden is now on husband's shoulders, and if the kids are at daycare during the day then she's not exactly working full time at home as a stay at home mom.", "I'm the same. I make it the day before & grab it out of the fridge. I don't want to have to get up even earlier (I already get up early to walk on the treadmill).", "r/justnoso", "I don't know why everyone is downvoting you. This is an acceptable compromise. \n\nIt will allow OP to focus on removing her MIL from her home. And OP should absolutely get rid of MIL. It's disgusting the way she is meddling in OP's marriage and child rearing.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "And time for mummy no to leave their house asap. NTA op", "That’s the thing that pisses me off more than the lunch thing - running to mommy.  No way in any universe would I put up with that.  She would have to go and husband and I would have a huge come-to-Jesus about it.", "And this.", "[removed]", "This exactly. The camel's back has been broken, evident when OP snapped. Things need to change now, not eventually, now.\n\nThis situation is untenable, nothing good will come from allowing it to continue.", "[removed]", "For her to wake up early because he feels like it's owed to him is definitely childish. It's not like preparing a meal for the household or doing something for the household. It's packing him food because he doesn't feel like he should have to do it himself.", "The packing a lunch thing is so spicy.", "No mate fuck that lol I have six alarms to get me awake. I don't have time for morning exercise lol", "If he works on a site, flasks are amazing. Soup, pasta, hot drinks etc", "[removed]", "Bot", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA, but two questions. \n\n1-What do you do all day when your kids are at daycare? I suggest setting aside time to prep meals during this down time. I’m a part-time stay at home parent, and on the days I only work 8-12, I do a lot of cooking and cleaning before I pick up the kids at 3-4. \n\n2-What did you say to MiL?\n\nEdit: MiL needs to go and your husband is being a turd, but if you have a lot of free time during the day I’d say it’s reasonable to expect something productive done during that time.", "NTA,\n\nI wouldn't even accept MIL to do the things to your furniture and the demanding stuff with your groceries.\n\nAnd if MIL thinks her baby boy needs his lunch packed, why doesn't she do it herself? I doubt her special circumstances are her being disabled.", "You have a way bigger problem than his lunch and that’s your MIL.\nShe is putting a wedge between you and your husband.  \n\nYou and he have to sit down and discuss boundaries with her.  He cannot go to mommy and complain about you.  If she will be a permanent resident at your house this should be resolved", "Info: why are the kids going to daycare if you're becoming a SAHM?\n\nI'm wondering if the reason your husband is running to his mom is because he doesn't feel heard and wants you to pick up more if you aren't working or watching kids. In that case, even if MIL is a problem (and she is!) the bigger issue would be between you and your husband,  and it won't go away by kicking MIL out.", "NTA. With his mother living there he has reverted to being her child and not your husband. It's a dynamic shift that your marriage will not survive. She needs to go now. You are pregnant with a third child. You already take care of two children. You don't need another one. When your baby is born, she will try and take over there as well, subverting your parenting choices. The writing is on the walls.", "Buy a box of the frozen peanut butter and jelly sandwiches for his lunch and toss an apple 🍎 in the lunchbox", "I have a question totally unrelated. If you have quit your job to be a SAHM why are your kids going to daycare?  I have a DIL that hasn’t worked for 4 years and her son went to daycare everyday (except Covid shutdown) and when he started school goes to camps everyday during the summer and on school breaks.", "Nta 1: he is a grown ass man and can make his own lunches. I've had people pack a lunch for me before and it was nice.  But I'd never demand my other half pack my lunch. 2: You're pregnant? Shouldn't they be like, oh I don't know,  keep your list of chores lower and make sure you get plenty of rest. Not make you have to wake up early for bull shit reasons.\n\nI don't know maybe this is one of those pick your battles kind of thing. Maybe just make his lunch the night before. And whatever you make for the kids is exactly what you make for him. He wants to act like a child then he gets a meal ment for a child. Hope he likes peanut butter and jelly.", "NTA. Maybe mummy can get up nice and early to make her little boy his lunch.", "What did you yell at her that you \"now regret?\" Knowing might change some opinions. However, why can't his lunch be packed the night before? That's when I used to pack my Dad's lunch. (Dad worked two full-time jobs. No one made me pack a lunch for him...I just worried he wasn't taking care of himself.) \n\nI think the husband made a lousy move whining to Mommy about his (pregnant) wife. I think MIL needs to keep her nose out of your marriage, especially as a guest in your home. And I think if you are so inclined, you could probably accommodate your husband in some fashion...but it should have been a discussion between the two of you.\n\nNTA...unless what you said to her was clearly horrible and crossed a line.", "INFO: What do you mean by “my family doesn’t understand my relationship with my husband and don’t support us”?", "NTA. You have three problems here: \n\nOne is MIL needs to move out. Now. Period.\n\nTwo: Husband needs to decide if he wants to put his mom first or his wife and children. In this case, there seems to be no compromise.  If he decides his Mom is the one he is choosing, then he can move out and get an apartment with Mom. \n\nThree: Husband can pack his own lunch the night before.  No way should you need to wake up 90 minutes early to pack his lunch. He can get together a sandwich and put the \"wet\" ingredients in a baggie so the bread doesn't get soggy. The other stuff (chips, soda, cheese, etc.) can all be put in his Sesame Street lunchbox the night before so all he has to do is grab it and go.", "Why doesn't his mommy pack his lunch?\n\nNta", ">\tmy family doesn’t understand my relationship with my husband and don’t support us\n\nI wonder why…\n\nNTA.", "Apparently, his mom has replaced you as wife. Tell her to make his lunch, or she's a bad mom. The cord reattached itself. Nta", "NTA mommy can pack his lunch", "NTA", "NTA. I understand your MIL is from a slightly different generation, where this misogynistic nonsense may be acceptable, but your husband should know better. I mean, even if you weren't pregnant this would be a ridiculous request, but he should be encouraging and enabling you to get as much rest as possible.", "NTA - but since I am an A, I'd recommend one of 2 compromises: 1 mommy makes him lunch or 2 you make him lunch the night before and all he gets are tuna salad sandwiches (so they get all soggy overnight)", "YTA You quit your job to be a SAHM and your kids are still in daycare? Pack his lunch the night before. Or stop using daycare and he can use the savings to buy lunch.", "NTA - But time for couples counseling....  This will only get worse without going for help.", "YTA: You're not working. What's the issue with making your husband a lunch?", "NTA\n\nI have to admit I started out with a feeling, if she makes lunch for the kids, and she's a SAHM, maybe she can make his lunch.  And then I was wondering what all this stuff with your MIL was about, and then I finished.  A grown man can't make his lunch and cried to his mom, not talk to his wife, or the most reasonable thing, make you own damn lunch, no he cried to his mother.  Wow", "If he wants a mom to make his lunch, HIS MOM IS THERE TO MAKE HIS LUNCH. NTA. \n\nBecoming a sahm means you take care of the kids. Your husband is not a child, you are under no obligation to take care of him like one. \n\nYour MIL (and your husband) needs to realize that this is not her house, these are not her kids. Your husband gets a say, she does not. You sound very overwhelmed, I think your blow up is very forgivable. \n\nYou need to line things out with your husband, I think that’s the root of the problem here. He needs to understand that you are pregnant & already taking care of two kids (how much does he help with that btw? Ask yourself honestly). You have way too much stress going on, it can’t be healthy. I would say try to take a week away if you can, just you. \n\nBest of luck, I hope things get better!", "NTA, assuming that the decision for you to become a SAHM was done democratically in the first place.  And why doesn't his Mommy make lunches for everyone?  She is probably up before all of youl.", "He \"expects\" you to make his lunch? He's a grown ass man. He knows how to make his lunch. He canmake it the night before. Besides working full time, what is he doing for you. No man should ever \"expect\" their wife to make their lunch or do their laundry or anything else they're perfectly capable of doing. A marriage is a partnership. Do you do more housework since you're a SAHM? Sure but that doesn't mean he should EXPECT you to do anything above and beyond. You do those things b/c you want to and it'll make your husbands life easier. Does he think you're living in the 50's now? DO NOT fix your husbands lunch. Maybe apologize to your mother if you called her harsh names but that's it. \n\nNTA", "Maybe MIL should get up and pack his lunch, if she thinks someone should be doing it for him.", "I don’t really want to make a judgment here, because I think the lunch packing is a secondary issue.\n\nThe primary issue is that MIL is making herself head of the house. And your husband is supporting this.\n\nY’all need therapy to figure out boundaries and to enforce them.\n\nAs for making his lunch, I would say soft YTA without his mother in the mix and justifiable YTA with her influence on the situation.There‘s no reason why you have to pack his lunch in the morning. You can meal prep, all he has to do is assemble before he goes out the door. If you’re the SAHP and doing the bulk of the cooking already, it really shouldn’t be a big deal. Especially since you get “off time” while the kids are in care/school. Of course the baby will revise the balance and I think him packing his own lunches will be a good way for him to pick up some slack when the baby is here. And I do think you are fully justified in digging in your heels until boundaries are enforced with MIL.", ">I (28F) have 3 beautiful children (35M, 5M, 3F) and I am currently pregnant with my fourth child.\n\nFTFY. Definitely NTA.", "Your husband is regressing with his mom there and your MIL is showing her dominance and trying to let you know who’s boss. It’s time to pull out the bitch card.", "NTA tell your husband he has a choice to make: he can either be an adult, husband and father. Or he can be his mommy’s little snookums. \n\nAnd remind him his choice dictates where and with whom he spends the rest of his life.", "NTA. The worst thing you could do is roll over and allow them to believe this behavior is acceptable. We teach people how to treat us. Your husband and MIL need to learn they cannot get away with treating you this way. If your husband thinks he can chose his mom over you, his pregnant wife, who has tolerated a major imposition…well then how he’s treated you in the past should be a lot less relevant to how he’s treating you now. Hold your ground. You have every right to have boundaries and they are not being respected.", "NTA. The worst thing you could do is roll over and allow them to believe this behavior is acceptable. We teach people how to treat us. Your husband and MIL need to learn they cannot get away with treating you this way. If your husband thinks he can chose his mom over you, his pregnant wife, who has tolerated a major imposition…well then how he’s treated you in the past should be a lot less relevant to how he’s treating you now. Hold your ground. You have every right to have boundaries and they are not being respected.", "First of all, NTA. He's a grownass man who can manage to pack his own lunch.\n\nAlso, more is going on here. You've clearly been isolated from your family over this relationship, which is not a great sign. Often, when a family doesn't support a relationship, there are good reasons for that. What exactly is it that they are so unhappy with, and why do you feel they don't understand? I think this is the key to a lot of things here.", "Nta. You already have a job and it doesn't include being his slave. My husband would never ask me to wake up early just to make him lunch. Clearly your husband has no idea how much it takes to run a house and take care of kids. Have you even gone out by yourself for yourself since having kids?", "NTA a grown man can make is own damn lunch. It ridiculous to ask you to get up early to make him a lunch. You could just make his the night before and leave it in the fridge for him. You can still get up at your normal time.", "NTA. I don't have children but I used to do everything for my husband. I worked just as much, sometimes more, than he did and still managed to cook, clean, meal prep, etc. I was the breadwinner in our relationship as well. I started to get tired of treating him like a child because I never wanted kids, but I was taking care of a grown one. Long story short, we're divorced now, and I feel like if I had babied him less earlier on in our relationship, things might have been different. Stand your ground!", "NTA  Your husband doesn't have to deal with the kids in the morning.  In exchange he can make his own lunch.  Or if it's that important to have it made for him, his mommy can wake up early and pack him a lunch.  Asking a pregnant mother of 2 young children to get up half an hour earlier than needed is ridiculous.\n\nEnjoy the silence of them not speaking to you.", "NTA.  Why can't your husband make his lunch the night before?", "NTA\n\nIf your MIL feels so strongly about it she can get her ass out of bed and make his lunch.", "NTA - give them a taste of their own medicine.. love your kids and live your best life.", "NTA. You are a stay at home mom for your children. Your husband is not your child. Maybe his own mommy should make his lunch. Is it possible since his mom moved in with you he's started to revert back into a more child-like mindset of needing to be taken care of? it doesn't matter if he has, he's wrong and needs to grow up.", "NTA.\n\nHe’s old enough to make his own lunch. Or if his mom is so worried, she can make it.\n\nThe woman is homeless and unable to support herself, but wants to tell you how to live, in your own home? Absolutely not.", "NTA but I feel like if your MIL continues living there it’ll lead to the end of your marriage.", "Info: who is decision? Was it for you to become a stay at home mom?  How has the division of labor changed since then?", "NTA, and WTF? If your husband wants someone to get up early to make his lunch, why doesn’t he get your freeloading MIL do it?\n\n(Posted by a guy who made his own lunch, and his kid’s lunches on a daily basis when they were in grade school).", "NTA \nIf getting up early is the issue, Why don’t you make his lunch the night before? But honestly I wouldn’t make lunch for someone who told his mommy on me", "NTA..... I'm so sorry you have to go through all of that bull crap especially when you're pregnant. This is a stressor that is totally uncalled for and could of been avoided if he learned how to make his own damn lunch! Honestly if it's such a big deal then his Mommy can make him his lunch since she's living with your family, I assume probably rent free as well.\n\nThey both sound extremely childish and entitled! He is not entitled to have you make up his lunch for him just because your a SAHM or because he says so. However, if he acted better (aka didn't run to his Mommy like a 5 year old) then you could of met him in the middle occasionally if you had the time to make it for him. My mom would make my step dad's lunch for him the night before but if he was being an ass or if he felt like she should do something then she just wouldn't do it. You always knew when he pissed her off (which wasn't often because he is a good man but just lacks empathy sometimes) because you would see him making his own lunch or washing his work clothes lol.\n\nI don't want to judge but it sounds like there might be other issues as well since you made the comment about your family not agreeing with your marriage. I would not let either one of them walk all over you and quite frankly I'd be telling my husband his mom needs to move out. The common denominator of your issues is her, so my advice would be to send her on her way packing. This way you don't have to tip toe in your own home or have stressors that are not good to constantly have while pregnant.\n\nGood luck hun, I hope it all gets better for you. Remember that is your home (your safe space), it's not your MIL home so therefore she has no say or reign over it.", "Make his lunch for the next day when you are making your kids lunch today. Put it in the fridge til tomorrow morrow.", "NTA\n\nMIL needs to go. Is there a plan for her to get back onto her feet or is the plan for her to live out her days here. Because it’s not working the way it is. \n\nHusband sucks because he seems to be catering to his mother and not considering that you made a huge sacrifice having MIL come live with your family.\n\nI don’t like that it seems he’s demanding that you make his lunch but is there any compromise where you could make his lunch the night before so you don’t need to change your sleep habits? My thoughts are that as long as your needs are also being met what’s the harm in doing something nice for your husband. Maybe the compromise here is you could make his lunch while he puts kids to bed.", "NtAH but your husband and MIL are.  You are a stay-at-home mom - not a stay-at-home maid.  Your focus will be providing the baby with care which for the first year will pretty much be around the clock.  You will also be caring for the other two when they are not at their day school.  Plus, housework.  I don't know who pays the bills but keeping up with those are work too.  \n\nHe is a grown man - he should be able to pack his own lunch.  There is no reason he cannot do this for himself.  Some peeps think that stay at home means you get to do all the work \"to make up for loss of income\" but your income would be cut due to childcare costs - and you will be providing the actual childcare.  \n\nYour mil does not get a say in it either way - so go ahead and tell her to butt out and stay out.  Moving your furniture is also a big fat NO.  That is not her home, she is moving stuff around - as in she seems content to stay and she needs to move back out - gonna assume this was a temporary thing - well it seems they are trying to make it permanent.  Don't allow it unless you want worse to come.", "Nta...and she needs to move out. Yesterday. Counselling next", "NTA but you could solve your problem by making his lunch the day before, when you make the kid's lunches. Put his in the fridge for the next morning. Do not interrupt your sleep schedule for such an idiotic request. And don't apologize to mil, she needs to stay the f in her own lane, and remember she's a guest in your home, one who doesn't get a vote in things unless she is asked by both of you for her opinion.", "NTA\n\nMIL needs to go. If not, your husband has to advocate for you to his mother. She is to remember she's a guest in your house and has no say in the running of it including her unwelcome opinions on the cereal brand and division of labor in your household.\n\nIf your husband refuses to do the above, both he and his mommy dearest need to go. \"He's good to you\" does you no good if he's better to his mom.", "NTA. You are in a three way relationship now. A grown man can feed himself. Looks like he wants a mommy not a wife. He could ask you nicely, but it’s your decision to do it or not. Put aside the main question. How they are treating you is not ok. It’s going to get worse. If mil doesn’t leave you’ll end up leaving because of her. Get rid of her asap!\n\nhttps://www.thehotline.org/identify-abuse/power-and-control/", "SAHM usually means the caretaker but your kids are in daycare ? You are a stay at home with free days and yet you can't even make your husband a lunch? Make all the lunches the night before or at least his. He provides the money, you provide the caregiving. YTA", "YWNBTA!\n\nHold your ground. You have enough to deal with right now.", "INFO: Why is your family against your relationship?", "[removed]", "NTA whatsoever.\n\nYour adult husband told his mom on you, and now she is fighting his battles for him and putting you in a terrible position. He's supposed to be on your side. It's a major, major red flag that he is siding with his mommy on this. Clearly a man who would rather avoid a conflict with his mom, so he instead creates one with his wife.\n\nWhat a child.", "Have his mother make his lunch since she insisted on being in on the discussion.", "May I suggest a cat shit sandwich? NTA", "NTA.  I mean, yelling isn't great, but it was completely inappropriate for your husband to bring this up with his mother and for her to than being it to you. This is triangulation and it's really messed up.  Opt out. \"This is an issue between spouses.  I will not discuss it with you.\"", "NTA. But I have a question: Why do you punish yourself with a morning rush instead of making the lunches the previous night and have a more relaxed morning?", "NTA. Let his mommy make his lunch since he's her special boy. You need out of this situation. It is only going to get worse when the baby gets there. Personally, I'd tell your husband either mommy goes or I do and then take your kids and run.", "> my family doesn’t understand my relationship with my husband and don’t support us\n\nYour family seems to be onto something here. \n\nNTA, but you really need to overthink this relationship.", "NTA - but your husband has changed due to having his mother at home and is probably getting mummy's boy treatment from her. I don't mean that in a rude way about him, but it is physical, emotional and mental dynamic shift. The reason why you had a good relationship with MIL in the past was due to the fact that you had your own space to go home to after being around her. Now that she is in your space all the time, it grates on you and wears you down.\n\nMIL is absolutely wrong to say that about you being a bad wife, and husband is being unreasonable to demand you get up earlier to make his lunch. He is an adult and that is something he can handle himself. \n\nImportant note here... you need to talk to your husband about this ASAP OP. This is not a healthy change in your home dynamic and if it does not get addressed, it will only get worse.", "Make his lunch for tomorrow when you make the kids' lunches today; then put his in the fridge.\n\nFind someone to talk with.", "NTA.  But he is.", "NTA.  Let her pack his damn lunch and enjoy not having to talk to either of them.", "ESH\n\nYou, the husband, the MIL\n\nShe needs to stay in her lane\n\nHe needs to get a spine and not jump every time mommy wants something.\n\nYou need to control your temper. And considering your kids are in daycare and you're not working, packing your husband's lunch is hardly slavery especially if done The night before.", "NTA - you are pregnant , dealing with small children and then he invited HIS MOTHER to comment on whether you should make his lunch?!  I would never again make it on principal!!!\n\nIts time for that woman to leave and make enemies elsewhere.  She thinks her arrival means there are 3 people in your marriage , because 'she gave birth to him' and she gets a vote!?!?!?!\n\nBuy her a bus ticket and show her the road.  This sin't getting anybetter", "INFO: why doesn’t your family support your relationship? Whose idea was it for you to be a SAHM? Do you have full access to his earnings?", "Nta. If you weren't pregnant I'd say you were. But you need your rest. Your mil is trying to split ya'll up. But really, would it be a big deal to make his lunch", "NTA waking up unnecessarily early when you have two children and are pregnant is not a reasonable accommodation. He can make his own lunch and your MIL can butt out of your marriage and parenting or she can leave", "NTA. Given this scenario, regardless of the MIL problem, as your husband gets up so early, he should be packing his and the kids' lunches! MIL has nothing to do with the running of your home. Your husband should be backing your desires and not running to mommy. Stay firm. If anything, MIL can make the kids' lunches since she seems to want to insert herself into your lives to more than an acceptable degree.", "NTA, I am on maternity leave and I don't pack my husband's lunch. He's a grown adult, he can do it himself. I will only do it if I'm making something already and have the time. When I go back to work he will get a packed lunch because I'll be making mine anyway... He will not be getting one on the weekends he goes to work for 6am...", "NTA. Your husband is a grown man. If your MIL comes at you again, tell her she can do everything for him if she's so concerned with his well-being. She's living with you rent-free and not chipping in. If she keeps it up, have a long, hard talk with your husband. Provide an ultimatum if you have to and include the kids in it. She sounds like she could squat and never leave. You might want to nip that in the butt early.", "NTA and I would die on that hill because if you give in to this bullying over the lunch, you're setting a precedent that all they have to do is gang up to get you to comply to other rules in the future. \n\nMIL is a bad influence in your husbands ear, especially if you were both happy before she moved in. She needs to move out before baby number three arrives as it will only get worse.", "NTA. Maybe his mommy can make him lunch since he apperently can no longer do it himself.", "[removed]", "NTA- throw a PB&J in the fridge the night before and tell him you did it, if he wants better lunches him or his mom can make it.", "NTA, but maybe a compromise would be to pack his lunch at night sometime. waking up way earlier is unreasonable for sure.", "INFO:  **However, since I’ve recently quit my job to become a stay at home mom,** Was this a mutual decision that he was onboard with?  Why do your kids go to daycare if you're a SAHM?", "NTA\n\nLet them keep not talking and enjoy the silence. \n\nOr mommy can get up early and make his lunch if he's so helpless.", "NTA.  He should be taking care of his pregnant wife, not expecting her to get up extra early to pack his lunch.  For that matter, he should be making his children's lunch.  What is wrong with MIL?  Why can't she help out with pitching in and packing lunches? You are supporting her.  Too bad you have already spawned with this poor excuse of a man.", "Mummy dearest can make his lunch since he’s still attached to the umbilical cord. NTA", "NTA. \n\nDon’t make his lunch. He’s a grown ass man. He can make his own lunch. Why does he presume you, pregnant, need to get up earlier than normal to cater to his needs. What about yours? Wow. The audacity. \n\nBut worse, crying to his mom. WTF?  I don’t get how I read about so many men on this sub who go crying to their mommy about their spouses. Those aren’t men, they are little whiny boys. I have never, and would never, go to my mom about issues my spouse and I are having because I’m a grown up and deal with my issues directly. \n\nAnd your MIL. Tell her to grow the f up and stay out of others’ relationships. You are accommodating her too much, set up some boundaries.", "NTA \n\nMaybe MIL should make the lunch for her Sonny Boy since she knows all the healthy food to pack and doesn’t seem to have much else to do. \n\nThis situation sounds intolerable. OP should look for work a couple of months after the new baby comes so she can start saving towards getting away from the Power Couple", "NTA, You have been usurped in your own home by your manipulative MIL. You have no adult in the house to take your side, as your husband agrees with his mommy. Tell them she can get her ass out of bed and make her baby boy his lunchie is she so desires. You need to get her out of your house if you are going to have a successful marriage.", "nta,  but you have a husband problem.  I'm concerned this situation will only escalate if your MIL continues to    live there.   Do you have a place you can go to live with your children?   \n\nUnless you are able to negotiate from a place of strength (moving out until your MIL does) this “ganging” up on you will continue.   It doesn’t seem as if you can rely on your husband to back you on your MIL leaving, or her staying out of your marriage.  They may even bring your children in on this.  This is a situation that has escalated and will escalate into more issues.  \n\nYou are expecting and having 3 young children is very difficult (I did it - so experience speaking. Ended up in the hospital twice in the months after my 3rd was born).  \n\nBTW as an aside, why is your MIL not getting up to make her baby son’s lunch if this is so important to her?", "NTA time to boot MIL out and have a serious discussion with husband about pulling his weight or he can leave with MIL.", "NTA, lunch packing aside, it wasn't her place.\n\nBut I will say having parents live with you puts a whole different strain on your relationship. My husband and I did it before we had kids and it was such a shitty time in our life we are still trying to fix our relationship. Please work with your husband to get mil into her own place asap. My husband and I charged his parents Rent then saved it and put it towards the money they needed to secure an apartment rental and first months rent. Yes we had to pay into it too, but it was worth it.", "NTA because your husband is acting like a massive baby, however! \n\nInfo: you quit your job to be a sahm and your kids go to daycare? So what do you do? Asking as a sahm myself. When my husband worked local, I’d totally help him get his lunches ready, it wasn’t a huge deal. But he never asked, I offered. I just think if you aren’t working, making him a lunch shouldn’t be a huge deal, especially since you aren’t even taking care of any kids all day.", "NTA. He can pack his own lunch the night before. I do it all the time. And his mom can mind her own business if she wants to remain there.", "INFO. Why are your kids in daycare if you are a SAHM?", "You don’t work and the children go to daycare… what do you do during the daytime?\n\nYTA for not making your husbands lunch.\n\nYour husband is TA for running to his mother.\n\nThe MIL is TA because it’s nothing to do with her.\n\nI agree with your husband though, if you quit your job and the kids are at daycare, why can’t you make his lunch? Honestly, how long does it take to make a couple of sandwiches and put it in a Tupperware with some fruit.\n\nI do things for my wife all the time, not because I have too or I owe it to her, it’s because I want to make her life easier and better.", "NTA - Maybe it's a good thing they aren't talking to you, you'll get a break from the constant nonsense.\n\nI think you need to have a serious talk with your husband. Either the MIL fixes her behavior or you will stay somewhere else. You are not supposed to be this stressed when you're pregnant.\n\nHe needs you to get up early and make his lunch when you're pregnant, have 2 small kids and a MIL to take care of? H\\*ll no!\n\nPS\n\nI think the lunch thing is a control thing, and she's convincing him to be like this so when she decides to get worse after the baby is born, she can act even worse and she can get him to support her.", "NTA. A grown man can make his own lunch and not cry to his mother about it.", "NTA.  Why can't mommy make his lunch since she's such a great mother?", "NTA, but this isn't really the problem.  The problem is your MIL living with you and you both choosing to fight over lunches instead of over MIL.", "NTA. Hold your ground. And put everything back to the way it was.  Go back to work if you can. This may be groundbreaking if your husband doesn’t wake up and realize his mom is toxic. Just be prepared.", "NTA. \nI don’t think it’s reasonable for him to insist you make lunch for him and It’s definitely not okay for a grown man to go running to his mother after a minor disagreement with his wife.", "NTA.\n\nMake his lunch the night before.\n\nThere's no reason to make a pregnant mother of two get up earlier. His mother shoukd make his lunch.", "ESH\n\nI am venturing a guess that the current issue regarding lunches is the by product of his mom's influence on him.  That needs to be addressed.\n\nThe compromise would be meal prep.  If your kids go to daycare, use some time while they are there to meal prep for your husband.  And have it stacked in the fridge for him to toss into his lunch bag in the mornings.  \n\nAs far as MIL is involved.  Is she contributing?  And if not, that needs to change.\n\nAnd yeah, you should probably apologize for losing your temper.  But do have a sit down with your husband and discuss boundaries, especially when it comes to his mother.", "Info: what does your family not understand about your relationship with with your husband and support you? \n\nIt seems like there is some info missing. \n\nNTA - But it sounds like your family may see red flags you don't", "Info: what did you actually say?", "Mother in law out. Husband to follow if he doesn’t get his act together.", "NTA.  You really need r/justnomil This is a two card approach.  One card is for a couples therapist. The other card is for a divorce attorney. Personally I’d be telling him either his mother moves out or he AND his mother move out. This is not as stainable. I’d stop making dinner for him too. As far as grocery shopping I wouldn’t buy any food for the MIL.", "NTA - MIL should pack his lunch.  Just like you pack your kids lunches, his mommy should pack his lunch.", "If you don’t mind me asking OP, what exactly about your relationship  doesn’t your family understand and why don’t they support you? Could it be they are seeing some red flags (the same that other commenters are seeing)?", "NTA, he can have mummy pack is lunch if he's gonna run and cry to her about your marital issues \n\nPersonally, if MIL is gonna stay MIL better start making herself useful to the family unit or this just ain't gonna work, she's not the matriarch, you are and you have enough on your plate. She needs to focus on her own \"duties\" as a mother and grandmother instead of telling you how to do your job", "So your family doesn’t like him, and he runs to his mommy when you won’t make his lunch. I’m left with a pretty good idea why. Nta, but I’m not sure if he’s a good as you say", "I would go back to work and start putting money away.  Clearly he doesn’t respect you.  He moved his mother in without your consent. She can make his lunch if he wants to act like a baby. NTA", "This sounds like the beginning of financial abuse. NTA.", "I gotta say, OP, I don’t understand your relationship with your husband either. I’m not surprised your family doesn’t love him. NTA", "He is a grown ass adult who can pack is own lunch.\n\n….BUT if he wants to act like a child who needs someone to prepare his lunch everyday, he should try asking his MOM.\n\nPretty bold of MIL to call you a bad wife when you could easily call her a “bad mom” for the same reason. MIL can step up and pack her little boy’s lunch, you have your own kids to take care of. \n\nNTA", "NTA. Although its not like lunches cant be made the night prior? Why is it that you HAVE to wake up early to make a lunch? Can he do it himself, sure. But you said \"He’s always been so good to me.\" maybe making his lunch and the kids the night before wouldnt be the end of the world.", "“The one sacrifice I’ve made is allowing you to live here. This is OUR home, not your son’s house.\n\nYou’re re-arranging furniture in OUR house. You’re a GUEST. You don’t get to make demands, and your bad attitude isn’t welcome.”\n\nNTA", "No. You need sleep. You are the primary caregiver so if the kids are sick you most likely have to deal with it. Talk to your husband, write him a letter if he won't talk. It is not her house. Find her an apartment. She may have to work 2 jobs but she ruined your welcome. If you want, when you pack the kids lunches, they are in day care/ kindergarten, pack his. BUT for the next day. My mom had to do that and cook breakfast for him to take to work. She had to get up at 4 or 4:30. He wants lunch that bad, eat it 24 hours later. How lazy. Ugh, poor you. I hope you have a FU account already started. Would he feel better moving in with his mom while you divorce him?? Just because you are pregnant doesn't mean you cannot leave a selfish person. If he loves you he will rethink the stupidity and madness. Good Luck!!", "NTA. All these expectations are fed by ur MIL in his mind. Kick her out soon or show her if she wants to stay she can't play all these mind games here. Its urs and ur husband house. She can stay but not play games to end ur marriage. If she is so adamant about having u make his lunch why she can't she do it herself. He is still a baby following her mother's words that why not be the baby he was asking everything from his mother.", "INFO what where the things you said that you regret? N T A for not making his lunch but it’s impossible to say if you owe an apology without knowing what you said.", "NTA. Your husband does not need you to make his lunch. This is none of MIL’s business. Sheesh. If you give into this, it will only lead to more “requests”. \nYour work time starts when you get up to get your kids ready. Making lunch for husband is not in the position description.", "NTA\n\nYour MIL is inserting herself into your marriage and your husband is letting her do it. She isn’t different, it’s just that you had limited contact with her. Living with someone is very different than visiting. It looks like you married someone who has an unhealthy attachment to his mom. \n\nAnd frankly, if he wants someone to make his lunches, have his mommy do it.", "NTA. I’d request your MIL and husband leave. For a grown man he is behaving terribly", "NTA and your husband is reverting back into a baby with his mom around.....", "NTA.  He can make his own lunch.  My wife will occasionally make mine (usually we’re both taking in the same left overs), but I damn well can make my own sandwiches same as OP’s husband can.", "You get to be a SAHM and you can’t find a way to make the lunch? Absolutely you should make the lunch. Maybe you can do it the night before.\n\nMIL had no business speaking to you about the conflict between you and YOUR HUSBAND. No apology for her and ESH", "A stay-at-home mom should be able and happy to make her husband's lunch. He is providing for the family so she should make the house a home. She chose to quit her job. I would assume it was to take care of her family. And for those that say being a stay-at-home mom is taxing it maybe,  but without him making enough to give you that opportunity there would not be a home to take care of. He should not have let his mom move the furniture but you should make your husband a sandwich.", "I don't think this is the right way to go about getting what he wants, and it doesn't sound compatible with the situation you two have.\n\nThis is the type of stuff two people agree upon, not enforce on each other, and him using his mom to outnumber you in your own home is a shitty tactic to apply guilt.  \n\nAlso, I just went back and reread, you are also pregnant?  Kinda feels especially wrong to throw more shit on a pregnant woman.  I am not even against the idea of him asking you to make a lunch and you agreeing, just the idea that he would strong arm a pregnant woman into it is kinda extreme.", "It’s rich that they call it one little sacrifice when you’ve just been asked to share your home with a new and increasingly demanding fulltime family member. It may be the best decision for her to be there, but your husband isn’t respecting how big of a change this is, especially for you who is home with her more. \n\nAs for being a stay at home parent, it is still a job, most often way more ‘full-time’ than anyone’s 9-5. He doesn’t just get to pile more of his own things onto your plate, especially with a 3rd baby on the way. I also hope he’s still helping with the kids when he gets home. You’ve both put in a full workday by the time he gets home, so it shouldn’t be your responsibility any more than his.", "NTA. His mother came make his lunch if she is so concerned about it.", "NTA. MIL needs to be out of the house, now. I'm sorry she lost her apartment but **if she stays you are going to lose your marriage and your husband**. If she's able to work and doesn't have a job, she needs to get one. Maybe if she works, she'll be too tired to be stir shit and she can save some money and gtfo of your house. If you are feeling petty, throw him a Lunchable and a juice in his lunchbox and call it a day. \n\nAlso, giving you the silent treatment is emotional abuse. I saw this online somewhere, I don't remember where, but it seems to fit: \n\n*The Silent Treatment is all about punishment, power, and control. People who use it don’t want space for themselves to calm down and regroup, and they certainly don’t want you to have that space and grace! No, they want you to feel wrong and bad, become obsessed with them, and be so consumed with the fear and pain of losing their love that in future the mere prospect of them being mildly upset will be enough to make you give them anything they want. Which, if what they wanted was the same as what’s good for you, they wouldn’t need fear, obligation, or guilt to extract it*", "NTA you don’t have to make his lunch\n\nBut did it really escalate that far without either of you thinking about preparing the lunch the night before", "NTA. Why isn’t MIL making her son’s lunches? Is she contributing to the household in any other way? If it’s so important to her, she could certainly wake up to make his lunch before work.\n\nAlternatively, you could make your husband’s lunch the day before (when you’re doing your kids’ lunches for that day). Let him have old food for a while and see if he wants to continue. Or just make abysmal lunches to begin with. (This is mostly in jest. I wouldn’t recommend it if you want to keep your marriage in a good place.)\n\nBut really, you shouldn’t be sacrificing your sleep for this. He can put his own goddamned food together.", "NTA. Your husband needs to take your side and mother in law need to shut up or leave.", "I’d be packing the kids up and staying elsewhere until MIL left or learned she doesn’t get an opinion about things that don’t involve her and apologized to you and thanked you for letting her stay by waking up and making her own son his lunchbox since she’s fine with him not doing it. NTA.", "NTA\n\nThere was toxicity even before this when he moved her in without getting your input and full blessing on this. I get that sudden homelessness is an emergency situation, but he of all people should be the one to set firm boundaries and work with her on a plan to help her regain her independence.  \n\nIf I were her I’d be getting my ass out of the house looking for a job or doing some kind of volunteer work to give you all some space.   \n\nThere’s nothing inherently wrong with multi generational living arrangements. But it requires the elders to respect and recognize the adult children have authority over their own children.  Some people are good at navigating all of this. My own grandma was because it’s set up in her culture to do that. The roles and boundaries are well defined and established by tradition.  \n\nYou all are flying blind on this.  She’s absolutely over the line and your husband is beyond pathetic crying to mommy to tell on you. \n\nYou’re pregnant and need the extra sleep. You’re going to need it even more when the baby comes.  He can make his own lunch or have his mom step up.  \n\nI wish you hadn’t quit your job. This puts you in a vulnerable position.  I wish you luck and hope people have good advice for you.  I hope you can give us an update whenever this gets resolved.\n\nBut you most definitely aren’t TA.", "NTA. but I would probably make his lunch for him, but I would do it the night before.  If he wants fresh packed, he can do it himself.", "I don't even need to read it. NTA", "Why can’t your husband make his own lunch the night before? NTA", "NTA. Pack up the kids and go to your mom's.\n\nHis mom can baby him and make his lunch if it is so important.", "NTA it honestly sounds like your husband is having sound sort of associative regression/revertigo trip with his mom living with you guys. Your mother in law is messing with your home’s ecosystem and you’re the only one that seems to have their head on straight. Like not making his lunch means that you don’t love your husband and you’re not good enough for him? That’s just sounds ridiculous. Things from this post just sound like it’s going to start getting more toxic as time goes on if things aren’t settled.", "Nta mil needs to go or u and the kids go stay with your fam", "NTA he’s an adult he is more than capable of making his own lunch. Fair enough if you were up and making lunches at that time but you’re not. If your MIL is that concerned about him making lunch for himself then she should get up and make it!! I would have snapped at the moving furniture around. You’ve been more than accommodating. Stand your ground", "NTA. You keep enough people alive already. He is a grown ass man.", "I was wondering the same.", "Well shiiit, why is mommy dearest making his lunch then if she's got a problem with it.", "NTA. Do NOT apologize, because if you do that woman will make your life hell. Forever.", "NTA. Asking for a regular change in your sleep schedule isn't a simple ask like he makes it out to be. The only non-disruptive compromise I can see there is if it's made the night before -- i.e. make extra for dinner and the extra will be his lunch next day. Whether you pack it or he packs it is irrelevant at that point. \n\nImo MIL is trying to run your household and consciously or unconsciously competing with you over who husband sides with more. She probably told your husband you can stand to do more for him, too. Your husband is regressing to being a brat, and this is unfortunately at a time when you're vulnerable with no independent source of income and a baby on the way.", "NTA.  You’re already responsible for 2 children and pregnant with a 3rd.  Tell your MIL that if she’s so worried about her son, she can pack his lunch for him, or he can be a grown up and do it himself.", "If she's so concerned, she can get up early or *gasps* MAKE HIM LUNCH BEFORE BED AND PUT IT IN THE FRIDGE.\n\nNTA.", "NTA. There’s no reason he can’t make his own lunch. It’s not the 1950’s.", "NTA.  He lost as soon as he brought his mom into it.  However, lunches can easily be packed the night before so if you did want to make his lunch ever, you wouldn’t need to get up and do it early.  (I did this all the time with my husband’s lunch. And before people ask: I packed his lunch for him because I actually packed both of our lunches the night before since I do the meal planning and know what we are eating on particular days.)", "If you're not working right now and the kids are in daycare why can't you help him with packing his lunch? You don't have to do it in the morning you can do it at night. I don't get why people are like that with their spouses? Yta", "INFO: why doesn't your family approve of your husband/relationship? what do your friends think?", "NTA. Your husband may have been good to you before but he is not being good to you now. This is a husband issue. If your MIL can’t behave herself in another persons home it might be time for your husband to apply boundaries on your behalf, since it’s his mother.", "Maybe not the correct way to handle the situation, but NTA. \n\nMIL gotta go, if she is causing issues she can leave, its not her house, she can learn to keep her thoughts to herself. You and your husband NEED to get on the same page on these issues. Especially that neither of you are to talk about issues that are between you to other people, at least until they are resolved.", "NTA… if someone moved my furniture around without consulting me I’d be fuming! Make his lunch the night before and then it’s in the fridge for when he leaves. If you want to! If you feel like it. Being a stay at home mum is a full time job without pay or perks. Your husband needs to understand this. I’m sorry you’re having to deal with two brats (your husband and MIL). Take it easy 🤗", "'it's not an act of love if you make her.\" \n   -Paris Paloma \n\n\nnta, at all.", "NTA, buy your man some Lunchables.", "ESH kinda you and MIL. Unpopular opinion but if the children are in day care your not working, why can’t you make him lunch? Packing one the night before isn’t too time consuming. Also, this sounds more like your annoyed with having MIL in your space because you’re home during the day. Blowing up probably where you lost the battle. At this point, you could sit down with husband first and explain how she’s making you feel incompetent in your own home and the energy she’s exuding is stressful. MIL shouldn’t have said that and if you are going to apologize, you would also expect an apology.", "Apologize to MIL for yelling if you must but don’t get up an hour early to make his lunch. You’re a stay at home mother to your children, not servant. \n\nNTA", "Here's the thing, your issue with your husband and his lunches is a separate issue from your issue with your husband and his mother.\n\nSince you're asking about the lunches, Y-T-A. Your husband is asking for something specific and small that will make his day easier. Find a way to compromise: make it the night before, cook food with enough leftovers to pack for lunch, get up 15 minutes earlier to make it, buy prepackaged items that are grab-and-go for him. Doing that will go a long way towards a more peaceful home. Digging in your heels in this just makes you the AH and exacerbates the second issue.\n\nAs far as the second issue, N-T-A. Your husband and MIL should not be ganging up on you. Your MIL likely feels powerless and resents needing to live with your family after losing her own place. I'm guessing she's grieving a loss of independence and wants to assert control however she can. On the petty side, cue moving furniture and complaining about cereal. More seriously, it's driving a wedge in your marriage.\n\nNo matter what is going on with her, your husband is the AH, though. He is triangulating by talking to her about your problems. You need to talk to your husband and find a way to get on the same side (like making his lunches!), so that this doesn't cause a major rift. Maybe this will cause some inconvenience for you, but tying your life to another person is inconvenient. Marriage is about serving one another, meeting each other's needs, and taking into account another person's preferences and dreams.", "NTA. Nagging husband and MIL threaten not to talk to me? Don't threaten me with a good time! Seriously though, you and hubby need to sit down and talk about this - if his behavior has changed due to having mom in the house, it's time to find other accommodations, or hubby has to recognize his behavior has changed.\n\nI'm also really impressed you didn't mind her moving the furniture.", "NTA. However, things might get worse.  I have to as,  is it to late to get your job back? Do you really want to be a stay at home mother if his mother is living with you.   I'm sorry you're in this position. \n\nI think you should tell your husband you want couples counseling. That way, you can try and get on the same page that decisions are made by you as a couple, not with the input of a guest.   \n\nIf you do decide to make his lunch, make it at night so you don't have to wake up earlier.  If that's not good enough, it sounds like he can wake up early.", "NTA. Your husband can make his own lunch.", "NTA. I would explain to your husband it's better if she moves out and if she doesn't I would move out. Leave them to it and she can make his packed lunch for him. If you're not there yet then joint therapy to prevent it getting to that but the number one priority right now is moving her somewhere else. \n\nNever, ever allow your husband and mil to gang up on you, your husband should not be complaining to her about you, it never ends well and he needs to grow up. Let him know that the pregnancy and 3rd child is work, your still working and that he's harming your relationship with his words and actions because he isn't getting his own way. \n\nA compromise would be to make up his lunch in the evening (you could do kids at this time too) but I wouldn't be offering anything like that until he and she have apologised and husband is agreeable to her moving out and she actually goes!", "NTA although I really feel like this whole thing has little to do with the lunch and everything to do with your MIL staying there and changing everything.\n\nINFO: Does she work? Does she contribute to anything at the house? It really seems like she just walked in and is trying to change things which isn't right.\n\nAlso the fact that she says \"you aren't good enough\" over lunch is so extremely wrong it's crazy. Forget your argument over who should pack the lunch. It's trivial. Your MIL just shit on your entire persona over it.\n\nI think your husband needs to take a good look at what it means to be married. Just saying.\n\nIf the mom has such a strong opinion about making her son's lunch... maybe she should do it since you guys are doing what you can to keep her from being homeless.", "NTA.  If mommy is that worried about her baby getting a lunch, she can get her happy ass up and make it herself.\n\nHonestly, OP, it's time to sit him down and tell him mommy needs to go.", "It's time for his Mommy to GTFO of your home, you're pregnant and you don't need the stress they are both putting on you. NTA he's a grown ass man if he wants to act like a child get his Mommy to pack his lunch.", "ah, the classic mother of the husband triangulation, run!", "“Fish and house guests start to smell after 3 days” - the farmer’s almanac- Jonny Cash. NTA.", "NTA, but in our house (we both work ft) we pack lunch after dinner is made to make sure we both have lunch. I dont think y t a but i think it can be done the night before. If anything recommend this and he can do it himself. Also, hope MIL isnt staying too long.", "NTA your husband can pack his own lunch with that attitude. Running to mommy is a bigger violation on his part. His mom is deliberately trying to create problems in your marriage so her son will give all his attention to her. She will destroy your marriage if your husband allows it which he appears to be doing. \n\nIf you’d like to escalate for the ‘fun’ of it try malicious compliance. Pack him a lunch but make it the same as you’d feed your toddler children and in child size portions as well. \n:-)", "NTA. So they aren't talking to you until then? Amazing. Enjoy the peace, OP! Play stupid games and win stupid prizes. \n\nHe can pack his own lunch. It's starting with this unreasonable request but will be even more demanding if you don't stand up for yourself", "NTA Tell your husband you do not consent to be in marriage with three people. He wants a relationship mommy controls? Then you are done. You need to pack up the kids and leave. Explain to him he needs to get MIL out of the house and pack his own lunch or you are filing for divorce in X days. Tell him even if she leaves and he agrees to be your partner not your boss, marriage counseling for his abusive and controlling behaviors is mandatory.", "Husband is married to his mother, wife is actually the staff and baby incubator.\n\nNo apology, and she needs to leave.", "I’d kick my own mother out if she pulled that with my wife.", "Half a sandwich.  Little kids don’t have big appetites.", "Nah, he doesn't deserve a cookie. He gets unsweetened applesauce.", "You are a better person than me. I was thinking one raw egg, one rutabaga, an entire 50% off sheet cake from Costco that says Happy Easter.", "OMG OP- *please* do this 😆", "If you break now you’ll be their housekeeper. You need to tell your husband you need his mom out of the house. Clearly he is regressing in maturity with his mother around. This.   Can. Get. Worse. Nta \nTell him she goes or you go because I am telling you now… you are being demoted", "The thing is, he can and does make his own lunch. He just doesn't want to. And I'm thinking that his mum has something to do with this. There's a whole list of things here that OP needs to get a handle on quick. For instance, the MIL needs to be put in her place. Hard. And then made it known that she needs to move out at the earliest possible time. The husband needs a sharp wake up call as well. \n\nFinally, OP needs to be more assertive in expressing herself. To both the MIL and husband. The fact that the husband just unilaterally made the decision to move his mother in with no discussion is rather telling. Also, the MIL straight up telling OP that she is a bad wife is pretty damn toxic. What the hell did the husband say to this is what I would like to know. How can he defend that?\n\nAt the end of it all the only person who can decide to do anything about this is OP. She either does nothing and endure everything, put up a fight and get outnumbered in her own home or she makes a credible threat that it is either her and the kids or the MIL. If that threat is made she should be prepared to follow through. An empty threat is no threat and will just leave her in an even worse position with even less respect afforded to her by everyone.", "Or if MIL has a problem with it, she can get up at the crack of dawn and pack it. NTA and I would be packing alright - packing MIL’s bags.", "Ugh total mamas boy can't stand them", "Exactly and now he has his Mommy there for backup.  It also sounds like she's taking over OP's home and that needs to stop.  If OP really loves her husband and wants this relationship to work, she needs to have a long talk with him alone and tell him that his mother has to go and he has to stop being a jerk.", "Of course she should pack his lunch. And she shouldn't forget to change his diaper before tucking him to bed.\n/s", "Why doesn’t mommy wake up at the crack of dawn to make his lunch if he’s so deserving of it?", "while I totally agree, still, I wonder about the amount of time it takes to make a lunch.  Doesn't strike me as enough that it means waking up far earlier.\n\nI don't mean she should do it, because it's pretty simple that he could do it, I just don't think the time factor is that big a deal.\n\nMind you - that's based on me making a lunch.  Grab a drink, fruit, a dessert, 5 minutes to make a sandwich or two, done.  Or fill Tupperware with leftovers, done.", "While his wife is PREGNANT!", "How do these people exist? Have they just jumped through relationships their whole life? So many people seem to have avoided ever doing basic ass shit for themselves.", "I think OP should make his lunch.  I'm sure he would just love brussel sprouts and fried liver slices on a sandwich.  On the next day he could have tofu and potted meat.", "I agree with all this- except she quit her job to be a stay at home mom for two kids who go to day care. She probably should be doing all the food prep.", "Hope OP shows him this", "lol and you’re proud of that?", "I have no problem making my own lunch and never expect my wife to do it (we’re both adults).  Only time she makes my lunch is when we have leftovers and she puts it into 2 containers (one for me and one for her).", "Well this is reddit so existing is the job, any expectation from him is sexist and childish.", "This whole family relationship is weird. OP's NTA, but why is she a SAHM if the kids are still going to daycare? Do OP and MIL just hang out at home all day? I can see how resentment could start growing in all parties here. OP and wife need a plan for their home life that keeps everyone contributing and productive or small issues like this will keep popping up everywhere.", "I am perplexed as to why the kids are going to daycare if OP is a SAHM.  Isn't that extra money down the drain at a time when they're down to one income, and are stuck with the MIL?\n\n(I mean, the MIL is a gaping AH, for sure.)", "If it’s sandwiches the bread can get soggy.", "Well she sends her kids to daycare so she kind of had all day to sleep until the baby comes", "This. Kind of weird a stay at home wife is angry about packing a lunch… but husband and his mom sound exhausting. Sounds like a complete train wreck of a living situation", "This is probably the best advice.", "That’s where I’m landing. Husband obviously handling this like an AH, but if op is sahm, meal prep isn’t that hard… but why isn’t MIL doing any of this either? I doubt she is paying rent. She can do the lunchea", "I'm assuming it's because she has a baby on the way, so they can get used to going to daycare now.", "Pregnant and taking care of 2 other children….. losing 5 hours of sleep a week to get up an hour early to make a lunch? \n\nHave you had 2 small kids and been pregnant with the 3rd?   I have and was hospitalized from exhaustion.  OP’s first responsibly is to the child she is carrying.  Not to cater to a grown ass man who is letting his mother boss around his wife (food, furniture, marriage responsibilities).  \n\nAnd then to give his wife the silent treatment when she speaks up?   \n\nYes we can all see why OP’s family doesn’t like her husband.", "Has he?", "Because he is a grown man who can make his own lunches.", "Or....a grown ass man can make his own lunches.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yep. She's just there to make babies for Grandma and her husband. Grandma needs to get out, and wife needs to not become financially dependent on someone who doesn't have her back or respect her. You're absolutely right. Leaving is best before Grandma and her sonsband file for custody.", "OP needs to take a long and hard look at what her life has become.  Have a serious chat with her husband, and if the MIL isn't out very soon and husband apologizing, she's facing a difficult decision on if she wants the rest of her life to be what she's experiencing right now, because it's sure looking like both husband and MIL expect this to be her new reality.", "NTA. Time for her to go.", "I'm not sure if he ran to mummy or if mummy is the instigator of the drama. I mean, OP said that he used to pack his lunch (by himself like a big boy) and that they never had big issues with this. I'm pretty sure the MIL spend a little time with her son explaining to him what he should demand. Tbh, I love my MIL but if she is in need of a place to stay, I rather sell myself on the streets to pay her an appartment than letting her stay at my house.", "Get his mom to make his lunch for him of she's sooooo concerned about it!", "And why doesn’t his mother make his lunch?  Problem solved.", "This is one of those posts that has me getting worried. The argument started after she quit her job to stay at home (so is now closer to being completely financially dependent), he's making decisions without consulting her, they are giving the silent treatment until she bows to their whims, and crowning jewel of the post her last sentences. She has no one in real life to talk to about this because her family doesn't \"understand\" and support the relationship she has with her husband. OP is isolated and has recently lost her independent income. And the two other adults in the house have decided it is their home, and she's just there to serve.", "That's exactly what I'm thinking. \n\nThat's why I can be a total b**** sometimes. I would have stopped her right when she started to talk about the groceries. I would have marked my territory like a freaking dog. No way she would have feel comfortable enough to move the couch, much less to tell me to get up earlier to make lunch for a grown ass man.\n\nPeople tend to be nice, to let it go, to not create drama. But 90% of the time, the drama still comes, but later and in a more explosive way.", "Yeah, if I were OP, I would be making a plan to go back to work ASAP.  If he thinks the balance of power has changed because she stopped work, then they need to talk about it.  OP's spouse may be thinking that her staying at home may mean she does more tasks for him too.   They need to agree to that now before resentment gets worse and then they need to understand the role his mother will play in the home while she is there and how long that will last.  Either way, OP and her husband need to talk and not argue.", "It’s not about the time to make the lunch. He leaves for work much earlier than the kids leave for school.\n\nHe wants a pregnant mother of two small children, who needs her rest, to awaken two hours earlier to put leftovers in a Tupperware or make sandwiches. \n\nI think it could be done the night before and left in the fridge. (Unless his mother thinks it needs to be freshly packed in the morning /s)\n\nMIL needs to go.", "You sound like you would be a shitty SAHM so I'm glad it's temporary. What is inherently wrong about packing a lunch for the person sustaining the household?", "Considering how many adult man act like overgrown children,she should be proud of the fact her and her husband act like mature,responsible adults.", "Right. There's a whole lotta people here thinking this is about making lunch when it really has nothing to do with it. \n\nBut also, maybe it's because I go to work so early, but I have almost exclusively just made lunch the night before.", "Since OP was working until recently, I assume the kids were enrolled in daycare for that reason. \n\nNot sure if they plan on keeping them in daycare, but if OP is pregnant and uses the time the kids are there to take care of other chores that are harder to do with two small kids in tow, I don't think it's that unreasonable. If they can afford it, of course.", "I put mine in an airtight container and don't have any problem", "They are getting downvotes because the solution isn’t to acquiescence to the husband and MIL’s demands. \n\nPersonally this feels like a slippery slope type of situation. Pretty soon her husband is doing nothing and she is doing everything while her MIL critiques her. Sounds awful. I think she should hold her ground on this.", "or… the unemployed person can take care of the home responsibilities, since they literally quit their job for the sole purpose of taking care of the home and family", "I can almost guarantee that she never plans on leaving.", "I'm confused please help me. She quit her job to be a stay at home mom but the kids go to day care.\nIf mom wants to make sure her son has a packed lunch, she should do it.\nBut I'm confused if she is a SAHM and the kids go to daycare what is she doing at home, when there are no kids to mother.", "The MIL needs to stay in her lane. House guests do not need to weigh in on the substance of a marriage.", "This.  NTA", ">She has no one in real life to talk to about this because her family doesn't \"understand\" and support the relationship she has with her husband.\n\nPotentially for good reason. Their oldest is 5. Five years ago she was 23 and he was 30. When did they get together?", "LMAO I've been back to work years ago. Now I've hired a CEO for my business so I don't have to go in anymore, but don't you worry, I'm still not a SAHM. \n\nNothing is wrong, I simply don't pack lunch for grown adults who can do it themselves. I also don't expect my husband to ever pack my lunch, nor would I ever ask him to. \n\nAnd for the record, he never sustained our household, I brought in as much income and assets as he did into our marriage, and my income continued to be influx into our shared accounts during the time I didn't actively work. \n\nWhat is inherently wrong is you assuming that a SAHM isn't contributing to the household financially.", "Seriously why do people hate their spouses so much? I work full time and do it for my husband because I like to. I can't believe all these people are so selfish and act like it's the worst offense ever. Like yeah the MIL is a problem but that's not what the question was about", "MIL may have put that into his head.", "She could do it at night. She does not need to wake up to do it", "Make sense.  I was just thinking that with the two kids out of the house all day, OP's job as SAHM is considerably easier than it would be otherwise, and I can see why the husband might think packing a lunch every day isn't a big deal.\n\nGetting up hella early to pack a lunch for my partner would definitely be a non-starter for me, pregnancy or no.  Maybe the night before, but I guess then the lunch would be getting oldish by noon.", "I used to just roll out of bed, but started doing this in May 2020 & have just stuck with it.", "Yeah, the issue would be flasks of food don't stay hot crazy long.  With a normal meal I generally find it's only fully hot around 5-6 hours (6 is if you get the flask hot before adding the food).  Which if that's why she does morning lunches would still mean having to get up over an hour earlier.  Something purely liquid will stay hot longer though.", "She is a SAHM, it's not like she is sitting around twiddling her thumbs. It was a decision they likely made together with a third child, they both chose to bring into the world, on the way. She is pregnant and runs around after small children all day. He can make his lunch, he isn't broken. Her \"job\" is to take care of the children they made together during the day, not coddle her husband.", "u/Cheesczxz is a bot.", "Not unless her son tells her, too, which isn't likely.", "She's currently pregnant. She's probably planning to take care of baby. The pregnancy also takes it's toll on the body so I can imagine she is in pain and stuff", "Only until she has the baby, then she'll be looking after a newborn.", "I went back to see the ages of the kids - they’re 3 and 5 and I didn’t see her use the words daycare specifically (I may have missed it though). At those ages, they are likely in Kindergarten and preschool and preschool is often only half days or at least shorter than when they get to “real” school. It’s not like she’s just sending them to play at daycare for 10 hours a day for funsies and it’s not uncommon for SAHMs to stay SAHMs during the early preschool/elementary days because there’s still a lot of housework from young kids and they are home to take care of them during school breaks, illnesses, etc rather then having to coordinate extra childcare, etc. SAHMs with kids starting school aren’t doing nothing.", "Outside of being pregnant and having to take care of a toddler soon enough, there is a ton of stuff having to be done for a house not to become a complete mess with 2 little children living there.", "> because I like to\n\nNot liking to pack lunches for other adults doesn't imply we hate them. We simply don't like it and we don't do it. \n\nDo you feel that your husband hates you if he doesn't pack your lunch?", "I get more than enough exercise at work lol so when I get home I only need to do pushups and situps lol", "I do my flask in the morning, so it's not a problem. All the cold food is done the night before.", "5 year olds are in school so 1 kid..", "But she isn't chasing the kids around all day, she drops them off at daycare. Husband shouldn't be bringing their arguments to his mommy but the lunch argument does seem odd to me all things considered.", "I have a job sitting at a desk so unfortunately I don't get much.", "NTA\nYou're a Sray At Home MOM, nt a Stay At Hime Husband Caretaker. He's grown up, he can make his own lunch. He can ask his mom as she's staying with you and if mom object I'd just reply that she's a bad mom for not caring for her child....", ">neither of them are talking to me\n\nSounds like a win-win situation to me. NTA.", "NTA. The household's power dynamic has been altered with your MIL moving in. She has assumed a role of control and entitlement in your house. Moving furniture and dictating what you purchase are her way of assuming control over you.\n\nDoes MIL work every day? Is she paying you rent? How long is she planning on staying with your family? These are the kinds of things that you and your partner need to be on the same page about. Her being there cannot be a long-term solution in a healthy relationship.\n\nYour husband has shown a level of immaturity running to \"mommy\" when he is not happy with you. This is not okay and should not be acceptable to you. It feels bad because it is.\n\nI recommend you set some boundaries with MIL and have a serious discussion with your husband about this. If he values your relationship, he will make you and your children his priority.\n\nIf they continue to gaslight and gang up on you, you should seriously think about divorcing him. I'd much rather be alone with my children than live my day-to-day life like that.", "NTA, I get my ass up and make my own lunch every day.   My wife makes the kids lunches,  she doesn't need to do mine too.\n\nAlso my mom would likely tell me to make my own lunch,  but she went your mil things her son is still a child.", "NTA. make that fool pack his own lunches. good luck, dude......you are in for a wild ride with MIL there and you will need all the luck you can get.", "NTA as a STAM who does pack her husband’s lunch you are still not in the wrong here. Being the at home parent does not make you a servant to your spouse. There was nothing wrong with him asking but nothing wrong with you saying you don’t have time. Household chores still need to be decided fairly. It sounds like your MIL needs to go and you and your husband need a chat about roles and responsibilities now that you are home and agree on who does what.", "Your husband has to stop to play power games immediately and also leave his mother outbid any issues concerning the two of you. Does your husband take care of the kids in the evening and at night so you are well rested in the morning? Does he also grow another baby in his womb??? If not, he can make his own food or else starve. And your MIL needs to leave yesterday if she cannot respect you in your own home. Stand your ground or this will only get worse!", "ESH. You MIL should not meddle and your husband should not be a crybaby mama’s boy. You could make your husbands lunch the night before so you don’t have to get up early.", "ESH - assuming he is the sole provider of the house and only income I don't think it's unreasonable to ask you to pack his lunches, you could make them the night before and have them ready in the fridge for him in the morning.  I don't think I need so explain why everyone else sucks too.", "YTA. I feel like the MIL and lunch problems are separate. He supports you and you quit your job. He is at work before you even wake up. You can't find 30 minutes in the day to pack all the lunches at once? You're already making multiple. It's not like it can't sit in the fridge overnight. I'd be irritated. Should he get up even earlier? I'd start going out for lunch everyday he's the one paying anyways.", "INFO are people really making decisions in the morning time…? My breakfast and lunch is fully prepped in the afternoon/during dinner time and I lay out EVERYTHING I need the night before. Clothes, makeup on the counter, face stuff, all of it. My parents taught me when I was little that we were not morning people (literally none of us enjoy the AM) and that you have to prepare your life around that fact, by setting your stuff up at night. \n\nI am just amazed that there are people who get up and don’t know what they’re packing for lunch that day! That just seems otherworldly to me!", "ESH. Your husband shouldn't have demanded you make his lunch. But as a stay at home mom, you technically could. Or at the very least do it the night before. If he's so adamant he gets lunch, why not have his mommy do it? \n\nHis mommy needs her own place and the furniture changing needs to stop. It's your home, not her's.", "INFO: how long are the kids at daycare for?\n\nSounds like OP is a stay at home mom to 2 kids who are not even home all day.  Not understanding why it’s a hill to die on and she can’t make the man a pb&j?", "Yeah, I can not DREAM of my husband asking me to wake up 30-45 minutes early so I could pack him a lunch...  just no, not at all, he would consider that an incredibly inappropriate ask and would never do it.\n\nI can't help but presume the MIL is influencing a request like that...\n\nwhen OP said her husband wants her to pack his lunch, all I can think is how about she packs his bags instead.\n\nSounds like he thinks, with OP leaving her job, that he finally has her trapped and can start making ridiculous demands because she can't leave anymore.  She needs to prove that assumption wrong.", "I was going to say... why doesn't mommy make baby boy's lunch in the mornings?", "Exactly! Why is she not helping take the load off of OP?! I assume she’s staying there rent-free.", "Love this idea.", "I definitely think her husband is the asshole, but the idea it would take away her sleep? Come on. I make my wife's and my lunch every morning, and I leave for work before she does. And at least two mornings a week she is at the gym, so I also have to get our 5 and 2 year-olds dressed and fed. All before I get myself ready for work. The whole process takes me less than 30 minutes. \n\nAnd by the way, I make her a fresh sandwich, wrap, or salad every morning. Rarely is it leftovers.", "I caught that as well. Her family now supporting the relationship has me questioning everything. NTA", "Bc she was young with a large age gap in between and probably a financial gap if they can afford to put 2 kids in daycare while she's  a \"SAHM\"", "Was my immediate thought like why make them in the morning the night before is far more convenient", "This was my first thought. Her family is likely onto something.", "Do we know they're in full time daycare?", "She only just quit her job, so they may have been in daycare already. We also dont know if they're full time or part time in daycare (the 3 year old is likely in part time). It is recommended to put your kids in daycare for their socialisation. And she has a baby on the way, which will be a full time job too!", "I'm honestly surprised by the number of people who don't understand just how many days kids have off between summer, holidays, and sickness. Not to mention before and after school care as well. And OP will have a newborn soon! You basically get the kids out of the house 6 hours a day, leaving some time for cleaning, dog walking, errands, exercise and some relaxing before they come home.\n\nI had to switch from being a trial atty to SAHM when my husband got a promotion because he could no longer cover sick days and when our babysitter couldn't make it. My schedule just had too little flexibility. I was burnt out and he loves his job, so it works. Most ppl just can't afford it, but ppl who don't work also have value. It's much easier than working and parenting, but that's fine.\n\nAlso - if this is a priority for husband he needs to talk to OP to make it work for both of them.", "She is pregnant... I know the US is fucked up, in normal countries pregnant woman are entitled to all sorts of rights because they grow a human inside, like maternal leave, easier work before that, extra breaks, etc.", "Daycare is recommended for the socialization of children. Many SAHMs use the few hours their kids are at daycare to do laundry, wash dishes, tidy up toys, clean the house, prep dinner, run errands (with tiny people requiring your attention). OP is also pregnant, so will soon have a baby at home.", "She has compromised enough by allowing his mother to live with them and disrespect her", "And why can't he do it himself? Is his job so hard that he can't even pack himself a lunch?", "Ok, but no one needs to wake up early! Pack lunches the night before. You can do that for the kids, too. This whole thing is ridiculous; no one needs to get up early to make lunch, and there's no way it would take anyone more than 10 mins.", "So you value 30-45 minutes of sleep more than you value a small request that could make your husband happier and his life easier?  \nThis is to the above commentor not OP", "OP this is awful fucking advice and you should not take it. Jesus Christ why is every recommendation on here after a disagreement to immediately get a divorce and put yourself and your children through something like that when it can first be addressed with a conversation with your spouse? You people need to shut the fuck up and quit giving people awful advice that amounts to “don’t have a conversation with the love of your life and father of your children, divorce him, bring the courts into it, raise your children in a broken home and light everyone on fire.” \n\nYou have no idea what you’re talking about and you have no room to give anyone advice on anything.", "Thank you! That's me silliest part of this whole thing. You can make sandwiches for kids and husband (I say take turns who makes them) the night before. It will take 10 mins. Throw in a piece of fruit, a drink, maybe a small snack of nuts. Seriously, it's easy as pie.", "With the crusts cut off", "I think he might be awful enough to deserve one slightly damp, fun sized box of raisins, left over from Halloween.", "I think it's a combination of things. Her life has become infinitely more difficult. She has two children and her body is working full time at building a baby. She's probably doing the housework she's able to. *AND* on top of that her husband has tossed his mother into this mix.\n\nNo way I'd be making his lunch. I'd need every possible second of sleep I could get. Let Mommy make it.", "I think you've got the first bit right,  but it has to be something both parties are willing to do/ manage/ balance. \n\nIf my partner told me to start packing a lunch in the morning,  I would laugh in their face. If they asked,  and had a viable reason other than just not wanting to,  and they were willing to help in other ways to free up my  time to do that,  of course I'd say yes.", "Yeah and I'm proud of him for recognizing the household division of labor that we both take on and for deciding he can make his own lunch.", "Day care is recommended for the socialization of children. And, if they're in the UK, you get 15 free hours of daycare a week.", "Often small kids go for a few hours a day for a few days a week or so. It's recommended for socialization. It may slowly increase til when it's time to go to kindergarten full time it's not as hard a transition (hopefully).", "Been packing my fiancé’s sandwiches for him the night before for 1.5 years and he’s never had a soggy one yet!", "Especially a stay at mom whose kids go to daycare. What is she doing all day everyday that she can't find time for lunch prep", "I mean, she drops them off at day care in the morning. I can’t imagine it’s less than 3-4 hours or otherwise I don’t see the point.", "Pregnant and with two small children?  Fuck, yes, I’d value sleep more.\n\nHe’s a grown man.  He can make his own damn lunch.  Or his mother can get up early to make it for him.", "I would put money on MIL being the instigator of this whole conflict from the beginning.", "She needs to be talking to a divorce lawyer", "Once he has her making his lunch he will wait awhile before bringing up yet another one of his tasks he wants her to takeover. Rinse and repeat until she is now doing all the labor.", "Oh, I agree.  OP just said that it would mean getting up earlier to make time to do it.", "So he becomes incapable of doing his own tasks for himself because she is not working outside the home? You think a pregnant woman should get 2 hours less sleep to make a grown man lunch? SAHM doesn’t mean you do things for people they are able to do themselves. You pack children lunches until they are old enough to pack their own. SAHM do things to run the household, not cater to grown ups and do things they can do for themselves. He’s not a child. SAHM means stay at home MOM, she’s not his mother.", "lmfao and what exactly is it that you take on “watching” to a kid who is out of the house the majority of the day ?", "Wow, I didn't know about the 15 hours.  Wish I lived in a country that was as concerned with the well-being of babies.  Around here, we only care about life until they are born.  After that, they're pretty much on their own.", "Not even with mayo? Mayo is my downfall.", "Ok, so if they're there for 3-4 hours, she has to get there and back, clean the whole house, prep dinner, do the laundry, maybe run errands. She is also pregnant, so will soon have a newborn to parent during those hours. I'm not seeing where it's apparent that she's just wasting that time.", "Why is he the only one that deserves to be \"really seen and cared for\"? He is a fully grown adult man with no physical issues, she is a woman taking care of the entire household, but for some reason a lot of you seem to think she needs to be the one making all the compromises for shitty people.", "That’s exactly what my grandmother did. Moved in “to help with the kids” and then didn’t leave until she was forced into a nursing home because she became very Ill. Took almost 20 years and my parents regret ever letting her move in and that they didn’t have the ability to make her leave.", "I am starting to wonder if MIL really needs to live with them or if this is just an excuse on her part to try, with her son's blessing, to teach OP how to be a \"proper\" SAHM now that OP has quit her job.", "She said she *recently* quit her job.  That is clearly because she is pregnant with their third.  She would have been headed into maternity leave (very likely unpaid), and then will have an infant at home full time, not yet old enough for daycare.\n\nHer kids are at preschool age.  That's a few hours a day.  Great to have some childfree hours, but NEVER even close to lining up with work hours.  No doubt they ran the math on paying for 3 kids in full day childcare, and realized it was cheaper to stay home.", "I'm a SAHM and I put my kids in Pre School for the sake of Social interaction. \nSome Psychologist say that Social interaction is very important for kids under 6 years old and if you miss that there is no Reajusting in the Future, that time is just gone.", "She's pregnant. Depending on how far along she is, she might not be able to comfortably do a job like retail or something that requires her to stand, and if she was going to quit after the baby was born anyways, they might have decided to do this a little early.", "As well as the current pregnancy, I can tell you from experience that it's a LOT easier to get the washing up, tidying, laundry, food prep done while there aren't multiple young children wanting to be played with/talked to/generally parented!", "I’m with you, mom should be making the sons lunch. Sounds like she doesn’t work and obviously doesn’t contribute in any way to her new household.", "Husband also needs to stay in his lane. Marital problems are not a family discussion. If he wants to vent about his marital problems, he can go see a therapist.", "Especially not with the \"you're not good enough crap,\" that didn't just come up for this incident that is how she's felt all along! I do want to know what OP said that she regrets BUT she was provoked and ganged up on.", "This is why I hate it when women become stay at home parents.  Not because they shouldn't do it but because inevitably it leads to an imbalance of power in which the stay at home partner is taken advantage of.", "I'm not sure why you're attempting to bring up th CEO thing, I don't give a fuck. Trying to impress people online is pretty sad.", "Does your husband pack your lunch? If he doesn’t, does that mean he hates you? By your logic, it does.", "Seems like you should want to do it. I enjoy cooking for others, and I certainly don't think they aren't an adult because I cook a meal for them, god damn.", "My suspicion too. She turns up and he wants packed lunch all of a sudden. Then she wades in with a \"punishment\" when wife isn't prepared to play that game. I think she's a trouble starter.", "Maybe the idea originated with mil, but hubby should have recognized how his demands are going to impact the relationship.", "Or he could throw some supper into containers to take to work the next day while he's helping his pregnant wife clean up after dinner. Like almost every grown up I know who takes a packed lunch to work. If my kids could handle packing their lunches the night before school after they turned 10, I know for a fact that this married father in his 30s can too.", "He’s a grown up who is capable of packing his own lunch. Why would he expect someone else to pack his lunch for him? Maybe next he’ll be asking her to wipe his butt for him.", "But why can’t he do it himself?", "Today I got her breakfast and lunch made and took her to school, went to the grocery store, came home and started laundry, sorted the recycling and took it to the landfill, came home and finished laundry, cleaned up from yesterday and made my husband dinner since he's on a weird shift and came home at 230. Now I'm going to go exercise before picking her up after her play practice, then I'm going to bring her home, get her dinner going and do homework with her and practice her lines a bit. We will probably play a couple games of Pokémon. My Dad is also recovering from a month long hospital stay so I've been caring for him and driving him to appointments and helping him while my mom is at work. \n\nI also make sure all the bills are paid, holidays are planned, vacations are planned, house is clean, family never needs for anything because I make sure it's there. When the school needs a volunteer or my husband needs something brought to work or a family member needs me, I'm there. Just because I don't pack my dude a lunch doesn't mean I'm worthless.", "We don't know if they go to daycare full time. Taking care of other tasks while the children are away is easier, but it still work. \n\nI wouldn't pack a lunch for my adult husband at any hour, regardless of my work schedule, all the more if he demanded it and if he was entitled to it. \n\nIf he ever has dead time at work, I doubt he uses it to make his wife lunch.", "Aah, sounds like you're in America!", "You don’t know how she spends her schedule or how much cleaning she does. You don’t know it’s 3-4 hours. And I never said it’s apparent, I asked what she was doing during that time. \n\nYou can put the pitchfork down, I’m also a stay at home parent and your tone makes me lol.", "No no it's going to be \"forces his own mother out to live on the street\"\n\nMakes you wonder if \"lost her apartment\" was really entirely involuntary... they did have that convenient guest room...", "Husband sounds like a mummy's boy. He was a bad idea to move her in, she has already started to drive a wedge between OP and her husband. I bet the sandwich idea was his mothers. OP you need to get that woman out of your house ASAP! Even it it means put down the deposit to a flat for her and claiming for social security benefits on he behalf! Just get her out of your house. NTA", "My 3 year old goes to preschool about 3 hours a day, 4 days a week for social skills and to give me a 3 hour breather cuz he's otherwise up my butt. Next year he'll go 5 days a week 3 hour days. When he's 5 he's going to pre-kindie (he's slightly delayed with a late birthday so we want to give him more time to catch up before real school) for 4.5 hour days, and then in our district he'll start kindergarten at 6 for a full day of school and ride the bus.", "Thank you I missed the part about her being pregnant.  It makes sense now.", "When I was pregnant I was working 13 hours shift as a midwife, nights included, until 39 weeks. She’s bringing the kids to daycare and preparing lunch? 😂", "Yes I missed the part of her being pregnant as I commented below. Thank you.", "And MIL will be helping OP by providing tips on how to properly take care of newborn since she would be doing it wrong.", "AND a mother in law!", "LOL what's impressive about a CEO? All companies have one. I mentioned that I already got back to work but since my business got successful enough for me to hire someone to run it for me, I am not \"going to work\". Yet I'm not a SAHM. \n\nThe point is you wanted to make me some sort of evil gold digger who didn't work and refused to make lunch for \"the one sustaining the household\". And that's so far from the fact that it needed to be pointed out. \n\nI'd say trying to bring strangers down for their achievements is pretty sad... but that's me.", "You certainly don't seem to like your husband.", "It's so frustrating to me that you have to outline your entire day to some rando on Reddit just to prove that being a SAHP doesn't mean sitting around doing nothing all day.", "I know you're also a SAHM, I read your comment. You are a SAHM who listed all the things that a SAHM could be doing while her kids are at daycare to another SAHM, as if she didn't already know those things. So it's quite amusing to me that, when the same is done to you, you consider it an attack.", "You are probably right!", "The part about OP not having anyone to talk to about this because her family \"doesn't understand my relationship with my husband and doesn't support us....\" like what's that about? That's a little concerning, in addition to everything else in the post.", "Even if she was not pregnant, i would not expect my wife to get up 3h earlier to cook breakfast/lunch for me and my two kids, if she could wake up later and cook just for the kids. I am a grown up, i can make something for myself, kids cant, it would already be a good work from my wife that i can just take care of myself and not the kids so early in the morning.", "Sure is! But I think it's important to point the stuff out to people who are unaware of the invisible/unpaid labor situation for a lot of SAHPs, not to mention (primarily) women who work AND have to take on a lot of this stuff that people tend to ignore. \n\nNot too upset about it though, because my family appreciates me.", "No, I did not say she had to do those things. You are stretching to make this some kind of lame attack. And no, I’m not a SAHM. \n\n0/2 for assumptions. Just stop digging.", "This is a huge red flag OP just dropped on her way out the door.", "But could she pack his lunch the night before. I do that. I pack my lunch from the left over from dinner that night. I'm not saying she has to but could she so she wouldn't need to pack his lunch in the morning.", ">No, I did not say she had to do those things. \n\nAnd I didn't say that you said that. \n\n>And no, I’m not a SAHM.\n\nApologies for the error, but your gender makes no difference to the point I made.", "You didn’t make a point. You made a statement that didn’t reflect what I said and are now going in circles. Did you have anything to add to the discussion or are you just being the turd in the pudding?", "ESH stop having kids", "You would NTA. But think about this, your husband wants you to do something relatively small for him. How hard would it be to say \"I love you and I'll serve you in this way.\"? You're not required to make his lunches, but marriage is about serving each other, not finding every chance you can to stand your ground or one up him.", "ESH. You’re a SAHM but your kids go to day care? And you can’t be bothered to make an extra lunch? What? \n\nWhy can’t you make lunches the night before? Or during the day while your kids and husband are all gone?\n\nYour husband shouldn’t bring his mother into your marital issues. So he is also the AH. \n\nYour MIL is also an AH, trying to tell you what to feed your kids and where to put your couch. \n\nMake lunches the night before, get MIL out of your house, and tell your hubs to stop running to mommy when he doesn’t get his way.", "NTA. His mommy can pack his lunch in their new place. 😑", "If his mother is so worried about her precious capable son, maybe she should make his lunch. \nA guest in your home shouldn’t be picky, MIL or not. This isn’t her home. She doesn’t get a say. Moving the furniture around! Like who are you lady. Who goes into someone’s home and decides they know how to make the house a home better than the owners!", "NTA.  If his mother is so concerned about her baby, she can pack his lunch.\n\nSAHP doesn’t mean the other person abdicates all of their responsibilities and are waited on hand and foot. Yes, the domestic duties are skewed a bit more towards the SAHP because they have the flexibility to do more.  Does he think all he has to do is go to work and come home? And if not, why can he not make his lunch? Or is there a reason why it cannot be prepped the night before by you so that he can put it together in the morning quickly? There are so many options here, and none of them should include you waking up earlier. I honestly cannot imagine a grown man is complaining about his pregnant wife not getting up to make…a sandwich.", "There’s more to this than lunches! This conversation should have happened the second MIL moved in (actually sooner).  \n\nYour spouse should never EVER confide in your private decisions. And he’s made it a marital decision so that’s even worse. MIL is not part of your marriage, period. \n\nSecondly, she should not be making ANY decisions for your home. If the two of you were sitting at the kitchen table talking about the flow of your living room, then fine, switch out the furniture. But otherwise, this isn’t her job. \n\nIn fact, she’s acting like a full fledged member of the family with MORE rights than you. That’s plain wrong. \n\nThe 2 of you (husband and you) need to sit down away from everyone and discuss this b/c when the baby comes, she’s going to want to raise baby HER way. (By the way, this is natural. I did the same thing and I got told immediately that this wasn’t my place. Lol)\n\nYour living in a triad which is a well known difficult situation. Eventually, you’ll agree with her and it’ll become 2 against 1. Or, the dynamic will just change to be you as the odd one out. \n\nAs far as lunch goes, I want to say she could make lunch for him. I’m betting she’s already up. Lol. But, instead, why not compromise and make his lunch the night before. But! That comes after a serious discussion with your spouse of being an unbreakable team. He needs to support you every.single.time. \n\nOnce you’ve ironed that out, you’ll need to establish some ground rules for MIL. You will do that as a united front. If she has a problem with it, your spouse must be the one to make these ground rules clear. \n\nThis is a tough situation and your husband needs to understand it or I see a lot more of these conflicts in your future.", "You have a job taking care of the children and the house. He has a job taking care of himself and working outside the home. His lunch falls under his responsibilities. NTA\n\nIs his MIL contributing to the household at all? If she’s so particular about groceries, does she do the shopping? If she thinks your husband should have his lunch made, why can’t she do it?", "NTA\n\nSend him PBJ (can be made the night before) and get his mother out of your house.\n\nYou do not have  MIL problem, you have a husband problem.", "NTA,  but also an A$$****    I'm wondering  Why Your kids are going to daycare when you said you quit your job to be a stay-at-home mom. So now husband Goes to work full time to bring in the money while you get to stay at home with the kids and you can't make him lunch? Not saying you have to but it seems like You get to stay at home, And also put the kids in daycare that i'm sure he has to pay for because you are not working, And while they're in daycare you're not taking care of children. Not something you have to do but it's pretty selfish not to", "Also OP notice the timing of all this.\n\nYou are pregnant with your third child and just quit your job.\n\nSomething is up.\n\nI would be on the phone with my job and see if you can get it back.\n\nSomething is very fishy here.", "What is a stay at home mom who takes her kids to daycare?", "This was my thought. She is in no way obligated to make his lunch, but making lunches the night before removes the 'having to get up early issue'.", "He's asking his PREGNANT wife to get up earlier, when his mummy could just as well get up early and make his lunch.\n\n\nAnd cut off the crust, too, while she's at it!", "My ex used to bring me coffee in bed in the morning when he had to get up early.", "Dramatic much?", "Or the morning before. Lunches are made once a day and that time is not going to be before you wakeup.", "A normal person would offer to help out while they're a grateful guest in someone else's home. Especially, a pregnant DIL with two very young children.   \n\n\nMIL isn't grateful or intending for this to be temporary. She wants to take over and put DIL to work for she and her son.", "Exactly, OP is being a good mother and making lunch for her children, MIL can follow this excellent example if she's so damn keen to mother him.", "I believe she would need to wake up far earlier because her husband leaves for work far earlier than her kids need to be out the door.", "Why should she be doing all the food prep? She is raising 2 children and growing a 3rd. A grown man can make his own lunch.", "She literally said she would have to wake up way earlier. Do you know how hard it already is to get a good nights rest when you’re pregnant?", "> My husband goes to work an hour and a half before the children go to daycare. I currently wake up around the time he leaves for work and have plenty of time to get the kids ready and make their lunches. If I were to make his lunch, I would have to get up way earlier.", "Exactly. My mom used to get up and iron my dad’s shirt in the morning when she was a SAHM. When she started working again, he started ironing his own shirts. It was just something nice she did for him when she had extra time. I’m fairly positive none of my grandparents weighed in on the situation either way, and my dad never thought it was beneath him to iron his own shirt.", "What kind of sandwiches are yall making that are so dry you can let them sit for 12+ hours and not get soggy?", "Tell me, why is MIL not making these lunches? NTA\nEdit clarification", ">That’s the thing that pisses me off more than the lunch thing - running to mommy.  No way in any universe would I put up with that.  She would have to go and husband and I would have a huge come-to-Jesus about it.\n\nI bet that's not how it actually happened. Mommy dearest has been filling hubby's ears with complaints about how OP is failing to fulfill her wifely duties.  Hubby is starting to agree (or did from the beginning), and mummy knew he was going to ask OP to make his lunch before it even happened. \n\nEither mum's attitude has to STOP and she has to start actually contributing to this home, or she has to get out. \n\nBut I doubt hubby agrees.", "Come-to-Jesus? Better make it come to Hecate.", "This. This. This.\n\nShe's being isolated, financially abused, and boundary stomped. It gets worse from here, OP. The more you give in, them more they're going to demand. You won't recognize yourself. I would get in contact with family and friends, ASAP. Have a plan. Then confront your husband. Either he backs you, his wife, or he backs MIL. If he backs MIL, you know where you stand. Get control of this, FAST.\n\nAnd, FYI, moving furniture around without consulting you first may sound like a small thing, but it's not. Your MIL is staking a claim, and subtly bullying you, and your husband is cheering her on. That's bonkers. Insulting you to your face for not making your husbands' sandwiches on demand, and again, being cheered on by your husband, is EVEN MORE BONKERS. MIL should have NO SAY in your relationship or childcare choices. That's not her business. But she's making it her business, which is super gross. And your husband is encouraging this behavior, which is ALSO super gross. And he's using it as a means to emotionally manipulate you to do whatever he wants. None of this is okay. I'm so sorry this is happening.\n\nEdit: Pregnancy is a dangerous time for women, in more ways than one. Abusive behavior often starts/escalates during pregnancy. Stay safe, OP.", "OK, that actually makes sense.", "Because he is working all day and the kids are in daycare. She isn’t off work because of the pregnancy so she can do most of the household chores including food prep.", "Was commenting to the commenter not OP", "Anything without mayo. \n\nPB&J is ok, anything with mustard won't be too soggy either. My fave sandwiches are mostly cheese and lettuce. 🤷🏻‍♀️", "Don't put the condiments on. Toss a pack of mayo and mustard in the lunch box", "Too right - she stopped wanting to leave the moment she started moving furniture around in the ‘guest’ room!!!!!!", "Agree, his \"Mommy\" should make his lunch if she's so concerned.  His wife is pregnant & has 2 small ones to care for.  Husband is a grown man, but is acting like a 6 yr. old.  He can make his own lunch if his Mummy can't & cut his wife a break.  She's pregnant & likely very tired.   Uuuugh", "Someone is still keeping the standards of the 1950’s housewife. Would you make every meal for everyone in your household that can make their own? Would you do all their laundry and wipe their butts too?", "And you realize that he is also home when he expects his lunch to be packed. He’s not at work when it’s time to pack his lunch.", "> What is inherently wrong is you assuming that a SAHM isn't contributing to the household financially.\n\nWhile I don't agree with the dude you are responding to, that is what a SAHM means/implies. You may be the exception, but that doesn't make the rule.", "Because she’s not his mother and he’s grown. We do things for children until they are old enough to learn to do them independently themselves. Running a household doesn’t mean someone has to cater to and do things for another person who can do them for themselves. He is demanding that she pack his lunch, it’s not something she is being given the OPTION to do because she wants to or likes to. It’s not the same thing as you liking to pack your spouse’s lunch so you do it. If you didn’t like doing something and they expected you to how would you feel about it? Probably wouldn’t like it so much. It turns it into something you do as a nice gesture to something you don’t have a choice but to do.", "I use salad cream mate but just a little lol I usually put it between the meat and cheese", "Who said he was the only one that deserves to be seen and cared for?", "Okay.  I’m married with a 9-year-old.  I wouldn’t give up my sleep time to make my husband’s lunch, either.  There are dozens of situations where this is a ridiculous ask, if the other person doesn’t want to.\n\nWhy in the world would his happiness and ease of life have to come at the expense of hers?", "I'm the commentor you were replying to and I endorse AnneMarie's comment...  as I also have 2 small children (though I'm not pregnant).\n\nMy husband's a big boy.  He can spend 5 mins grabbing something rather than making me wake up.  I do most of the grocery shopping because I work part-time (those pesky small children!  He used to be the one working less, but job changes make it so I'm the one working less now)  And I make sure to buy him various things he likes that he can easily prepare at work (because he's a bit of a snob about left overs).  He appreciates that I keep his lunch needs in mind while shopping, he doesn't need me to also place them in a bag for him each morning.", "The husband usually makes his own lunch. He needs to continue to do so instead of expecting his pregnant wife to get up 1.5 early. Jeez, is he a capable adult or a child? If mommy does, it sets an expectation that the wife will take over after mom moves out.", "He likes packing my lunch when I'm busy too. Works both ways🫶", "He does actually. We both help each other out because we like to. That's why I'm saying I don't see why she wouldn't help him since he's the only one working and her kids are in daycare so she can't use that excuse that she's busy all day", "Hubby is oblivious tho.", "i never said worthless, but it’s pretty ridiculous to claim you’re a sham when you’re quite literally NOT parenting the majority of that time. you just described everything a working parent does. your child is gone the large majority of the day..", "Ah yeah I’m the idiot who puts mayo on the bread.  I like how that tastes but it’s stupid!", "Get OUT of my head! I thought - while writing my initial response - that this is exactly what is going on. \n\nI hate to say it, but it sounds like this is a *\"I bring home the bacon, she does everything else\"* kind of guy.\n\nThese guys complain the loudest when their wives have enough and leave them too... \n\nGrown-ass man can't make his own lunch and is asking his pregnant wife to do it because she's only taking care of a 3 and a 5 year old.", "And I'm sure your grandma went right back out to dig up turnips after labor. Not everyone is the same, you know. Not everyone's body reacts the same to being pregnant.\n\nWho knows, daycare could even be for the social aspect of it.", "I didn't say it was impressive, I said it was the type of comment self conscious people tend to make to try to impress others. Especially on Reddit, I will never understand the need for reddit Internet points.", "Hahahaha funnily enough, a post of mine blew up on this sub... because apparently, I like him too much :D \n\nAnyway, if not packing his lunch makes it seem like I don't like him, so be it. Because I won't ever do that LOL.", "You really have a warped view of what it means to like or love your partner.", "I don't think he is. I think it was an intentional choice on his part to try to get his way. OP is now in a pretty vulnerable state, without income and pregnant and dependent on him to get by. Given her family's disapproval of him, I can't help but wonder if this is hubby taking advantage of changed circumstances to his own benefit.", "Sure. But surely she is not bedbound and can still prepare lunch?", "You just seem like a shitty partner. You also seem to love embellishing so responses from reddit through your narration doesn't mean jack shit. So cool.", "Especially after saying that he was a good husband and they have never had problems before…if that’s the case, then what exactly does her family not support about them? Families don’t typically not support a relationship for no reason whatsoever. Something else is going on here, or has in the past, for OP family to not be speaking to her.", "I am a man, together with my wife for 15 years, i have never asked or tought i am entitled for her to make me breakfast/lunch/dinner even when i had a job were i work 12h a day. Sje is not a real stay at home wife, she isnt working only because she is pregnant. Relationships are different, i understand that, but they work out only when everybody are on the same page. For example my workday know (work+commute) is about 10h, my wifes about 12h, and because of this i am almost always the one cooking dinner and shopping, but my wife does not ask that from me, and if ii would stop, she would be ok with that, plus not me nor her would ever \"run\" to our parents to complain. I think the biggest problem in this post is, that they didn't/don't talk about their issues and come to a solution together.", "Haha well as long as he doesn't think so, we're all good :D \n\nGotta love when people decide that if someone they dislike isn't miserable or unsuccessful, then they must be altering the truth. \n\nThe mental gymnastic is pretty funny to read. \n\nHave a nice day, I'll be over here embellishing my comments for Redditors to read. Heheh", "Yeah she stuck that tidbit in the last sentence LOL", "No I agree, been with my wife 30 years this Nov. Has she pack me a lunch sure. Have I asked her once or twice. Like you said they need to talk to each other. And he's a little funny running to mommy. That would be a deal breaker for me.", ">I suggest setting aside time to prep meals during this down time. I’m a part-time stay at home parent, and on the days I only work 8-12, I do a lot of cooking and cleaning before I pick up the kids at 3-4. \n\nYou suggested that she should set aside time for meal prep, and then told her that lots of cooking and cleaning can get done in a few hours. \n\nIt sounded patronising. Something that it seems like you understand, based on your reaction to me listing things that she could be using that time for.", "Nta. So not only do you have to grow this 3rd child of his in your body. You also need to treat him like a 4th child. It's time your mil found other accomodations. And if they don't talk to you that's their loss.", "Easier said than done. She lost her apartment. Presumably this was because she has no money. OP's husband is not going to kick her out.\n\nMIL should be contributing to the house by doing chores, looking after kids while pregnant mom gets off her feet, taking kids to daycare, etc. Looking after 2 young children while being hugely pregnant is difficult and exhausting. If she has to stay, she should be earning her keep. \n\nMy husband and I both loved it when my mother visited. Even though she was a much older than normal grandmother, she loved keeping busy and feeling needed. Our floors sparkled, we ate well, and she never interfered with our decisions. \n\nI feel so bad for OP. She does not have the support of her husband, she now has no income, and MIL is probably here to stay. A pity she can't leave the kids with MIL to look after and go home to her mother telling her husband she will be back when his interfering mother is gone. That is a dream. She is likely a loving mother who would never do this to her kids.", "Stay at home means you have no job, you can literally make food the night before for your significant other who you supposedly love. 10 minutes when you have no job, is not that difficult", "If these situations were reversed, would you say why is this grown ass woman insisting her stay at home husband doesn’t make lunch for him? Why doesn’t she just make lunch night before?", "Yeah, if she regrets them it must be bad.  OP is really skirting by this.", "Agree - I'm always suspicious when posters give tons of detail and context about a situation, and then it comes to the actual moment of conflict and they are suddenly mysteriously vague about what they said and yadda yadda their actions away with \"I said some things in the heat of the moment\" or \"I said some things I regret\" or \"I told her what I think of her\". They don't even describe the thing that people are upset with them about and hope that commenters won't notice because of all the surrounding detail. \n\nNot only is it not possible to judge without that information, but it also shows the poster isn't interested in giving a fair representation about their role in whatever went down. I only ever assume that the information would have been included if it made OP look good, because they included all the background they thought would do so.", "Yes. She needs to get control of her marriage and her household back. This is not three roommates jostling for position - this is a MIL sticking her nose in a married couple's home. Worse yet, this is a mom with a newborn on the way. If anyone should be acting as boss right now it's HER. This time is about HER needs, the new baby's needs and the other 2 children's needs.\n\nHis LUNCH? LOL. I would have been embarrassed just for having that thought.\n\nYou don't pile extra chores on your wife when she's about to have a baby. You figure out how to reduce her stress and workload so she can FOCUS on baby.\n\nThis guy (and his MIL) have their priorities all wrong and are treating this woman like some kind of live-in servant. This is seriously effed up. \n\nHe's putting his marriage in jeopardy, without question.\n\nI would tell him to calculate how much child support is on three kids their ages and rethink his strategy here. It's going to go that way eventually anyways...", "Yeah, it would literally be the exact same situation. He’s flipped his standards and gotten his mummy to gang up on her over a lunch he’s perfectly capable of making.", "Women have been having babies for millions of years, it's not a debilitating illness (in most cases).  The children are in daycare and she doesn't work.  She can make a sandwich for the man putting a roof over her head.", ">no way it would take anyone more than 10 mins\n\nIf she normally wakes up right as her husband is leaving for work, then it's not just the time it takes to pack the lunch...  she would need to wake up in time to get up, go to the bathroom, put some clothes on, and then go downstairs to pack the lunch.  If the lunch needs to be ready when he's walking out the door, that's about 30 minutes ahead of when he's walking out the door.\n\nI might be biased, because I live in an old house, but the quirks in the heating mean the upstairs is way warmer at night than the downstairs, so I'm usually dressed very lightly while I sleep.  If I'm then going to get out of my warm bed, as well as be dressed to tolerate the decreased temperatures in the kitchen, I need to do more than just throw on a house coat/dressing gown.  However, if right after he leaves I'm going to have to get dressed for the day anyway to take the kids to school, then I don't want to get dressed twice in 45 mins, so when I wake up I'm going to want to get dressed for the day, which is going to take a few extra minutes.\n\nAlso - packing lunches the night before ignores if you have both room temperature items and cold, or even frozen items, to pack together.  Salads and cut fruit don't sit as well all night, and I often throw in bread products all by themselves, because they don't need extra plastic if it's just going to be a few hours before it's eaten, but if I leave that croissant unwrapped all night it will be too stale for my 7yo to eat by lunch the next day.", "Notice how all this happened *after* OP quit her job?", "This is almost certainly the case.\n\nOP needs to go to r/JustnoMil.  People there have dealt with situations like this.  \n\nThat being said, I expect MIL to \"help\" after the baby arrives by holding the baby while OP waits on her.", "I scrolled WAY too far down to find this. Perhaps her family doesn't 'understand' because she was very young when he became involved with her. I was 19 dating a 25 year old and he had me convinced I was so 'mature' for my age blah blah blah. \nSo he has isolated her from her family and she has 2 almost 3 small children and is now dependent on him for everything. She doesn't realize what she's in.", "OP needs to polish that resume and get back to work about 6 months after giving birth. And continue her exit plan", "Thank you for this I was also so confused with the Im a stay at home mom but my kids are in daycare. I was like then go back to work if you don’t want to take care of the house???", "I would expect a sahm to clean even if they hate it.", "Every person is different. Every pregnancy is different. Are you asserting, as a midwife, that every pregnant person can work until 39 weeks?", "I used to be a chef mate, so little things like that come easier to me when preparing food.", "No. But from there to being so terribly that she can’t prepare lunch…", "Was this for me? You can think that if you want but I agreed with you.\n\nEdit: nope this was my fuckup I thought you were someone else but I don't care enough to remove the comment.", "I’m sure part of it is the 7 year age difference. She doesn’t say how long they’ve been together, but her oldest is 5. So at the very least, she was pregnant at 22 or 23 while he was 30.", "HE could also pack his own lunch the night before, after dinner.", "I make my husband a lunch the night before.  He goes to work before I get up (I work from home, still fulltime). I would not be getting up early to do so. However,  this was something he asked of me and I AGREED to when he took this job since he didn't have a lot of close by options and a relatively short lunch period.  I'm not pregnant, child is off at college, and my MIL is in another country.  He also doesn't get to complain about what I pack him, lol.", "Or her husband's non-pregnant ass could do it, or the MIL if she's so concerned about it 🤷🏻‍♀️ Plus people are different, I literally worked a full day on my due date with my son and had him later that night lol, but my youngest sister's due date is this week and everything was going pretty well for her until she suddenly developed severe pain from kidney stones last night. She was originally going to work this week right up until her due date,  but in light of what happened she changed her mind. Between the fact that she's still in pain and could technically go into labor any time I don't blame her.", "He sure could.", "NTA. Stay at home moms are not servants. Far too many husbands and MILs seem to forget that. Tell him to cut the apron stings and make his own damn lunch.", "Tell him if he's going to be like that,  you're going back to work. \n\nA SAHM isn't a maid/housekkeper/chef for the convenience of the working parent. They are choosing to stay home to help manage the family in a more effective way.  It's as hard as a traditional \"job,\" but it doesn't come with pay or time off. The SAHP dosen't get regular brain breaks,  adult conversation ( I DGAF what anyone says, talking about widgets with another adult is still adult conversation), bathroom breaks (who hasn't gone to \"poo\" for 10 minutes to just sit on the pot and scroll reddit), and more.  \n\nOP, it's time to have a very serious conversation about what a SAHP means to him.  Listen to his expectations first- I'm betting he thinks you're now going to have tons of time to make all the home-cooked meals, do all the shopping,  take care of all the laundry, clean the house regularly, take his mom to appointments and outings, and take care of all the kid stuff (daycare,  schools stuff,  appointments, extracurricular activities,  family event planning), and he's going to get mad if you ask him to pick up takeout/ help with chores.\n\nWhat do you expect life as a SAHP to look like? How do you plan to have the division of labor. All this needs to be fully discussed and planned before you leave your job,  if possible.  If he's not looking at this as a joint effort,  don't leave your job!! \n\nI agree 100% that you and your partner should be a TEAM. You need to be together on this all the way and present a united front to your MIL. I sincerely hope your husband is just having a strange moment of thoughtlessness, and you both can work together to make this awesome. Good luck!", "YTA. So what do you bring to the table? Are you just gonna stay home and do nothing?", "YTAbut only because you can easily make his lunch the night before but he needs to stop getting his mommy to hang up on you and she needs to realize that you are the woman of the house and any changes to the house need to be approved by both of you. Being a SAHM does mean you take on more of the domestic duties but not talking to you and continuing to talk about this I really childish of him and you and mil need to apologize to each other. You could have handled things better, blame th hormones but she needs to understand that commenting on your marriage and calling you  and wife over stepped bounds that she had no business doing and she needs to understand that she is in your home now and should act accordingly and you need to let hubby know that as well. All that said be careful sometimes men make you a SAHM just so they can bully you because they are the bread winner but your job is just as important and even more difficult make sure he doesn’t forget that or you.", "NTA.  You should apologize to your MIL and explain that you’ve been finding it difficult having her in your house but that is no excuse for rudeness. Also suggest that she would feel better with some useful responsibilities in the house- like making her son lunch every day before work- especially because it has special meaning for both of them but not you. Tell your husband privately that the next time he wants to complain about you to his mother he needs to do it in the guest room because that’s where he’ll be staying- with his mommy", "Husband doesn’t go complaining to his mother if his wife is supportive. All the bs about mil is to hide the fact that she expect him to work his ass off and present her with a mound of gold while she stay home. Make him his lunch sweetheart.", "Sounds like MIL can make Sons sandwhiches", "NTA. OP, I would text your husband, \"I did not want your mom living here, but I allowed it because I could empathize with her. However, we tried this out, and it's not working. We need to give her a date that she has to move out by, so she has time to figure out her situation. As for me making your lunch, I'm either your wife or your mother. Which one do you prefer? I had assumed that a grown man could make his own lunch, but if that's not the case, please let me know, and I'll begin to treat you like a child instead of a husband.\"\n\nIf he says he wants you to make his lunch, make it like it's for a young kid. Put a bag of fruit snacks in it with a peanut butter and jelly sandwich. Maybe include a toy, stickers, and plastic utensils, along with cut-up apples. And don't sleep with him. Remind him that you gave him a choice of being his wife or his mom, and he chose his mom.\n\nAs for his actual mom, seriously, get her out. They seem to be ganging up on you. After you have that baby, you're going to get even more overwhelmed, and you won't want to be dealing with all of this. If he won't have her leave, sit her down and tell her on X date she needs to be out. If they ignore you, I'd pack up all her stuff that day and put it in a storage unit and then change the locks.", "Oh god I feel the downvotes coming already… But here’s where I disagree: It’s not that he’s incapable of doing it; he’s been doing that all along. We’re only looking at this from her perspective… and sure she doesn’t want to get up super early… and sure that sounds sucky… But he’s been getting up super early all along. If you’re splitting bills and chores, have an agreement, etc, I get that this would seem ludicrous. Why should she care about his lunch? But this guy is supporting the whole dang house. \n\nWhen you’re the stay at home parent/spouse, that’s part of the gig; you do more chores. You support the team. You’re the healer, not the tank. I get that getting up earlier sounds terrible, I would do nearly anything to sleep an extra ten minutes in the morning, but that’s what time your team gets up. That’s just the team she’s on, an early morning team.  \n\nGranted there should be healthy boundaries and communication but she’s the stay at home spouse, and she should do everything within reason to support her partner… I hate chores, but if I was in this arrangement, you better believe I’d be hustling through every chore on the list, including lunch. The only problem I have is that it sounds like he is not even willing to have a conversation. In my mind these sort of relationships only work with lots of communication, fair and healthy boundaries, and love. I would reopen the conversation with him without the mom present and lay out your thoughts/feelings.", "A grown ass women who stay home that don’t make lunch for her husband who is making all the money in the household is pathetic.", "A SAHM that can’t pack lunch is pathetic. Especially if they have a live-in MIL to pull their weight.", "Yeah, this whole comment section is surprising. Is the guy still an asshole for other reasons? Yes, but like damn, she really can't just make his lunch the night before when she's a SAHM and he's the only one working?\n\nI make my partner her lunch everyday and we both work full time, people in this thread are acting like it's a gruelling chore that takes 5 hours to do. I think it's fairly reasonable for him to ask her to make his lunch the night before while she's making the kids lunches anyway when he's the only one who is working.\n\nI mean people in this comment section act so transactional and demanding about relationships, you ***can*** just do something nice for your partner to make their life a little easier.", "And does all this while his wife is pregnant and the MIL is homeless. \n\nMIL & son are exactly the same abhorrent people.", "She can get up and make her sons lunch if she feels so strongly about it. Her very *existence in their home* was a major compromise/sacrifice OP has made for her husband. Let alone putting up with her rearranging furniture and demanding specific food", "Tell me you don’t realise what stay at home parents do without telling me. She’s literally pregnant, would have to get up earlier to make this man lunch and then he’s gotten his mummy to come and abuse his pregnant wife because he wants his lunch made like a child.", "I agree. These posts frighten me how people are two and a half kids deep and can't depend on each other.", "Mil deciding to come sideways at OP alone is worth a gtfo. She’s pregnant with her third child with hubby and that isn’t sacrifice enough?\n\nShe needs to gtfo, and hubby can stand there and watch cause the only reason Mil got in the door to begin with was cause they both agreed\n\nPlus if Mil got upset at he baby boy being told no, then she’s gonna hate the discussion about to happen about how welcome she’s about to become in the house after all of the meddling", "Yeah this is so on point. If the roles were reversed I have no doubt they would be saying he should be making some lunch for the wife who is earning the resources for the family.\n\nThis is typical gender bias bullshit.", "OP? Are you sure now is the right time not to have your own income? Because this is not about the lunch.", "Or hubby packing it the night before cuz that is possible too.", "Lots of SAHM/Ds still send their kids to daycare, so they can socialize with other children. Many daycare offer half-days, too, especially for younger children.", "Daycare isn’t just somewhere to send your kids while you work. It also offers a great opportunity for kids to learn how to socialize before they begin school.", "You cant just stop daycare. You have to pay even if the kids are ill, and not attending. If you pull them out because you are home for a few months while waiting for baby 3, you WILL lose your place and go back on the waiting list which might be a year or more. It's very hard to get daycare. Better to keep them there, use the time to prepare for number 3 and  look after yourself a bit. Moms dont get much time off and 'me' time doesnt really exist. Dont u know, moms dont get sick either.", "HE let HIS mother into THEIR house and let HER start bossing his WIFE around.\n\nThis is 100% on the husband. And he is the one who needs to keep his mother in line and explain that she's a guest, this is a favor, and she is not running the show.\n\nThis sounds like a steaming pile of \"I know how to mommy better than you do\".\n\nNot a good look for this husband at all.\n\nHe looks like a boy running to his mommy.", "I think MIL should get up early and make lunch for her precious boy. \n\nIt really sucks when you feel crappy and people gang up on you. OP needs that extra rest because she's pregnant. And that's not an easy thing to be. I vote NTA because it's OP's house and because she could use extra help while she's pregnant.", "I agree.  I think that personal interaction is very important in the toddler/preschooler stage.  I sometimes wonder if that's not a huge underlying issue with most of the problems in this world today.  Good job, mom!", "I am referring specifically to the lunchbox disagreement, in that I strongly suspect that MIL is the one who had the idea that OP should be doing it in the first place. \n\nThis does not absolve the husband of his own steamrolling and failures to be a grown adult in a marriage. He’s a huge AH for all of that too.", "Going outside the marriage to ANYONE, even the MIL herself, is a very toxic thing to do in a marriage. It makes her feel undermined, as if she 'went over her head to some boss'. \n\nIt's bad if a man still goes to his mother for input or to complain when he's a grown man.\n\nIt's 10x worse when he's a MARRIED man.\n\nIt's hugely disrespectful to the spouse and erodes trust faster than oven cleaner.", "Amazingly I did realize he doesn’t live at the office.", "That’s how it should be done. But for this ass hat extra Mayo and a big slice of tomato on the bread side of the meat. He will make his own after that.", "Totally.\n\nThing is though, no matter how badly someone outside of the couple is behaving - even MIL - it's the husbands duty to defend his wife in their home. Yeah, this stinks to high heaven.", "Yep.  I have questions.   OP what about your relationship with your husband is not understood by your family?  Why don't they support your marriage?  You are NTA for refusing to make a grown man's lunch.  But I think there's missing information here.  Also, you do realize your MIL is there to stay, right?  And that your husband will always put her before you and take her side.  If this isn't what you want, you'll have to start planning an exit route, because it's very unlikely that dynamic will change.", "She should and she should package it up like it’s for a 5 yr old boy.  Print his name on the bag and put kiddie stickers on it and have kiddie containers wet in it.", "I mean, just to play devil's advocate... It *could* simply be an age gap thing. It's not huge at their ages *now* but six years ago when she got pregnant and was 23 dating a man in his thirties? That's pretty significant, not to mention how long they had been dating before that..\n\nLike. Probably more than that, but maybe not.", "Seriously. I am a sahm, and I will pack up dinner leftovers in a single-serve storage container for my husband’s lunch if I’m the one doing dinner cleanup, but it would literally never occur to either of us that I would regularly pack his lunch under other circumstances. He also *gasp* frequently packs out kids’ school lunches.", "I also go NTA, but my question is. If it's never been a problem before, what's the likelihood that MIL put the thought about her doing his lunch and stuff in his head?", "Literally I would think he was joking.\n\nLike it's the kind of thing my partner and I might joke about, 'Oh I wanna sleep in tomorrow can you just make me lunch like I'm one of the kids', but never actually seriously request 😳", "Yep - what are the details around her losing her apartment? Id want to know what actually happened here because I get the feeling she just didnt renew her lease", "I wonder if MIL is pulling her weight in the household as thanks for letting them stay with her (although my worry is even if she did housework, she's use it to find fault with OP and change things to \\*her\\* way of doing things). IMHO if you stay longer than a month you're not just a guest anymore and you're gonna get chores.", "Day care isnt all day (often half days) and im sure OP has a heap to do running a household of 5 people on top of being pregnant. SAHM who pop their kids in daycare arent sitting around drinking coffees and socialising all day.", "Yeah real silly how people are seemingly getting gender norms triggers in this thread. If the man is going out to work and spending the bulk of the income on the family and making the wife happy, I don't see why she wouldn't return the favour", "You’re not understanding the point that he expects her to get up before her children get up to pack him a lunch. Her husband leaves hours before anyone needs to be up in the morning. That’s not cooking him a meal, that’s him expecting her to wake up earlier than she normally would need to to pack him a lunch while he waits to leave for work. How does that make any sense? He has been packing his own lunch but he and his mother decided she’s not good enough for him because she doesn’t do this. That’s not a mutually respectful relationship, that’s expecting someone to serve you.", "Agreed…or make his lunch the night before", "There are plenty of SAHM who also have a cleaning service to clean their homes.", "You can get washable side containers! I’d MUCH rather do an extra tiny dish than wake up early 😂 but I’m NOT a morning person at all", "Also, her parents don't support the relationship. Me thinks they saw him for what he is.", "I hate those posts that are just such an EASY \n\nhold your ground, kick your MIL out, and your husband makes his own lunch, OR, take the kids and divorce him......but damn. \n\nOP NTA and i'm sorry the obvious answer is that your husband is being downright awful to you.", "Good suggestion, thanks!  I have learned so much useful information on AITA.  I come here as much for the lifestyle hints and help as I do to ride up on my high horse and pronounce people assholes. 🤣", "I don't think she has noticed how he isolated her.  A friend of mine married a man who was so great at manipulation that it took years for her to catch on. He would do things like surprise her with  tickets to Europe, and oops, they're nonrefundable and just  happened  to be the same weekend as her parent's anniversary party! \n\nBooking a super fancy hotel far away, knowing bad weather was predicted, and then she missed Christmas with her family bc it wasn't safe to drive. \n\nSomehow, something magically prevented her from spending any time with friends or family until they were all fed up. But he convinced her it was all complete coincidences", "Thank you!", "What's wrong with helping a spouse out? People are so selfish nowadays.  God forbid she fix her husband's lunch. She's home all day not working while her husband provides for the family. Her making the lunch the night before cost her nothing.", "NTA you need to find a time to calmly talk to your husband about how allowing your MIL to live with you is a huge sacrifice that has made your workload MUCH harder, and he needs to be finding ways to support you and take stress off your shoulders during this pregnancy (and your mother's living time with you) not keep adding to it.\n\nHe is a husband and a father and he needs to step up. Now is not the time for him to be pushing you back into the 1950s.", "Ur husband is not a child. He can use his delicate hands to make a sandwich for lunch, he's being dramatic af. Especially crying to mummy about it holy shit. NTA", "NTA. His mommy can pack his lunch if she’s so worried about it.", "Make his lunch the night before. If your husband affords you the luxury of being a SAH mum, then it is reasonable that he gets his lunch made.  But do tell MiL to fuck right off and hubby to stop involving  his mother in your marriage. Two people in a marriage not three.", "Exactly. That last line struck me that there is more going on here with the husband. This sounds like tip of the iceberg.", "I'd pack him a tomato sandwich the night before so it's nice and soggy and gross for him.", "Glad you posted this. I was kind of wondering why everyone was going so hard at the husband…. the mother in law situation seems awful, no doubt, but we don’t really know if they’ve had conversations about the new dynamic and expectations. \n\nAlso, is he working longer hours to accommodate the new baby or the extra family member? Maybe he’s not doing well with the new changes, is feeling additionally stressed and need extra support? His feelings should be recognized as well (but we don’t know with the given post and that’s okay- i hope they sort it out), but I do not agree that he should have confided in his mom before his wife.", "I really was looking out for this comment!", "He can pack his own lunch the night before.", "Kind of telling that OP never commented on this post…", "Triangles too, just how he likes them!", "I have never once seen a situation where a mil moving in has worked out well. And I'm no spring chicken. \n\nThe furniture moving already shows that she doesn't respect OP'S boundaries. \n\nOP, do what you can to get her out. She needs to go.\n\nAnd has the husband not heard of Lean Cuisine?", "So if your significant other asked you to make them lunch while you stay at home, your response would be why is this grown ass man/woman asking me to make him/her lunch? I sincerely doubt it.", "Is the MIL working? Or is OP in the house with her during the day? I assume MIL is living there rent free? If so, she needs to start chipping in for groceries and bills and pulling her weight in relation to housework and making her baby boy's samwitches with the crusty wustys cut off.", "You’re deliberately not understanding the issue. He has never asked her to make his lunch, has now flipped that standard and is expecting her to get up earlier to make his lunch and then again, has gotten HIS MOTHER to try and bully her into it. Everyone saying “just make it the night before” has no idea about this woman’s nighttime routine, she has two kids under 5, and is making wild assumptions about the labour she does during the day (which stay at home parents do a TONNE of invisible and unpaid labour). Not to mention, she’s PREGNANT. \n\nSo to answer your question, if my significant other asked me to make lunch in this situation, I’d tell him absolutely the fuck not.", "She literally says she just quit job and is staying at home which is why he has now asked to make his lunch. He didn’t say mother in law told me you should make my lunches, he just went to complain to her after she said no. \n\nIf I can easily help my significant other by preparing a sandwich and snacks in a bag, I just think I’d gladly do it without even thinking cause why wouldn’t I want to make their life a little easier?", "As if she's ever moving out", "Did you miss the part where she’s pregnant or do you just like to consume information that suits your argument? Most people have to quit their job later in the pregnancy. \n\nYou can go and complain to your mother all you want but her involvement goes way beyond this. \n\nCongrats on knowing making your significant others lunch would work for you, but it clearly doesn’t for her.", "Yes she’s pregnant, has children, doesn’t have a job, and is incapable of making a lunch lol I got it", "Yeah I don't know how some of these guys stay married TBH.", "Don't forget that those children still go to daycare, so she isn't even looking after them during the day!", "It could be as simple as she's white and he's black.  Or he's Jewish and she's Muslim. Or he didn't make the amount of money they think a husband should make. So many reasons a family doesn't like a spouse that have nothing to do with the spouse.", "Lol the women on this. \n\nThe \"grown ass man\" made his own lunches when wifey was at work, no one address that. \n\nNow wifey has stopped working so husband asks if wifey could assist \n\nThe timing of not working anymore and the MIL moving in is unfortunate,  I wonder what it would be like if no MIL was there?  Or , wifey can go back to work for the household and hubby can stay home and snag the lunches? \n\nHave the conversation as you both need to be on the same team .\n\n\n\n\"Grown ass man\"\n\nGrown ass woman complaining about a MIL nahhh only the man", "Yeah i’d say shes made plenty of sacrifices already. \n\nShes given up her career and everything that comes with it. Financial freedom & independence. Career progression. Social interactions. \n\nShes sacrificed her body to build their family. Pregnancy can cause so many weird and wild side effects that can change womens bodies forever. Plus the actual giving birth part. \n\nAnd now she’s sacrificed her home to accommodate her mother in law. Shes let someone else dictate the food and the position of furniture in her own house.", "Bruh she is growing a human inside of her, it’s not like to quit her job out of laziness lol she is equally contributing to the household already by raising young children and doing the housework. He’s a grown ass man, he can make his lunch the night before.", "If OP wants to pack lunches for her husband, it should be her choice, not his demand. It's not okay for a grown man to demand that his wife gets up an hour and a half earlier to pack his lunch, because they agreed on OP quitting her job to become a SAHM to take care of their (soon to be) three children. It seems that OP's husband is very confused and thinks the M in SAHM stand for his personal Maid.\r  \n\r  \nJoking aside, I'm very concerned about OP being cornered in a position she doesn't want to be in. It's very worrying that he chooses his mother over his wife. His sudden prehistoric ideas about what a wife should be and do are also concerning. Suspiciously, it all arose after OP quit her job and lost (part of) her financial independence as a result...\n\nMaybe I'm seeing ghosts, but something just doesn't feel right to me.", "My MIL stayed at our house when we had to go out of state for a family emergency.  When we came back, she had ripped out my husband's garden - that he'd been working on for several years - and replaced it with potted plants that she liked. She also threw most of our food away and replaced it with things she liked. We were gone less than a week. She's not even set foot in my home since.", "Hey there's a good idea.", "My wife is a stay at home mum and I’m the primary income earner.  \n\nI didn’t marry my Mum, nor is my wife subservient. I make my own damn lunches, thanks.  \n\nYour husband needs to get his priorities straight, starting with sorting out his Mummy. That entire arrangement is fucked.", "Tell him to make it the night before.\nNot real hard.", "Stay-at-home parent literally means you dedicate your time to stay home and parent. It doesn't mean you have no income or no money of your own, that you don't contribute it to the household. \n\nI don't know about exception to the rule, but I know that there is a wild misconception that not going to a workplace every day means you are not generating income...", "Yeah she's got free houseroom, what's SHE doing to earn her keep?"]}