{"id": 14440, "submission_id": "12hahfa", "title": "WIBTA if I didn't help out my former friend after they \"canceled\" me?", "selftext": "*I  have to be light on the details because this touches a few hot topics, though I'm sure people will read between the lines. I just ask that you not throw too much personal baggage at me. The Pied Piper sucks but it doesn't mean his whole group does.*\n\nAnyway, back in the day, my friends and I (Early 20's at the time, 30 now) were part of an online collaborative group where we were working on a shared universe for creative purposes. We all knew each other online but communicated through chat channels and proto-zoom basically from 8-5, 7  days a week. This was a serious venture and we had raised some cash for it. The girl who I thought was my best friend (F20's at the time 30 now), who was part of the group, stayed at my place a few times even  though she lived out of state. We shared everything.\n\nThen came a guy I'll call the Pied Piper (M 30's at the time). He came into our space as a friend of a friend, and with a whole heap of sob stories that everyone else in the group ate up like it was the last dinner they'd ever have. Soon he was in the creative group trying to change  things his way according to his personal worldview. Not tiny changes,  either. Not “Let’s have characters which represents X”. It was an entire rebranding around the Pied Piper’s personal struggles, but in fictionalized form. He would be the hero, of course.\n\nI don't know how everyone else bought what he was selling. He seemed mentally unstable, but everyone loved him. Especially BFF.\n\nWhen I finally had enough and said I wasn't comfortable with the changes the Pied Piper was making -- it changed the entire tone of the media we were looking to release and alienate the markets we were looking to target -- they all turned on me. Any criticism was seen as hate toward  the Pied Piper's discriminated-against group. That was completely asinine as I used to be somewhat of an activist… but it didn’t matter.\n\nThey turned on me in way I can only describe like getting in a car accident: One second my life was fine with maybe some trouble ahead, and the next  second the car (my life) was T-boned from the side and I was flying off a cliff.\n\nThis was a year or so before the Me Too movement, but they did their best to cancel me. (To be clear: Canceling wasn't a buzz word back then but that's basically what they did.)\n\nThe fall out was bad and my family’s hardware store were contacted by \"concerned anonymous  people\" to tell them what kind of horrible Nazi I suddenly was. It was so extreme and so crazy, and I know that was BFF’s doing because she stayed at my house a few times, and was introduced to my family including the local store my parents owned.\n\nI  cut ties completely with the group even though I was part of the legal Corp. I just left it all, and over the years I went pro on my own: But it affected me greatly. I no longer consider myself an activist. I only work under pen names, sometimes of a different gender. I have no professional internet footprint. I require my publishers do not show my picture.\n\nI’m not afraid of them coming at me again with old grudges. (The group's project went nowhere  because of course it did). I just I learned how fast “internet friends”  turn and how quickly your own name can become a liability.\n\nFast forward to yesterday: I got an email from my old BFF (that inbox is set to forward to my new). I guess she eventually moved in with the Pied Piper and started a relationship. But of course now he's cheating on her and verbally/emotionally abusive, and she needs shelter + and a safe place, and funds to undo some changes she made to fit his lifestyle,  which will be incredibly costly. It's a train wreck.\n\nI don't know what to do. She was under the sway of a predator, I have no doubt. But she also did her best to destroy me, and now she's asking for  help and money years later? WTF. I'd like to think she's clueless, but  she might be that desperate.\n\nBut  I'm not a young idealist anymore. I have a career. I have two employees.  Yes, I could throw a small donation her way toward a gofundme and maybe send a list of shelters, but if she needs a place to stay... I can't  risk everything I've built up in case she turns on me again. Maybe she'll go back to the Pied Piper and decide I'm a bigot again. I dunno.\n\nIt  feels so clear on paper that I shouldn't reach back, but inside I'm twisted up.  It feels like I’m back at the carwreck that was my life and I don’t know if my anger for that moment is coloring everything else. Would I be the asshole if I was like, “Not my circus, not my monkeys”?", "created_utc": 1681110789, "permalink": "/r/AmItheAsshole/comments/12hahfa/wibta_if_i_didnt_help_out_my_former_friend_after/", "score": 39, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because a former friend is in dire need and I care more about my career than helping her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "#READ THIS CAREFULLY BECAUSE WE WILL PERMANENTLY BAN YOU FOR VIOLATIONS\n\n\nYour post was removed because it exceeds the 3,000 character limit.\n\nPlease consider resubmitting a briefer post. You are **not allowed** to continue your post in the comments or another thread. **You will need to post it again**, we cannot approve the removed post if you edit it. \n\nLimit 3,000 characters (including the title). https://www.lettercount.com/\n\nDo not attempt to circumvent this requirement, you will be banned. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*"]}