{"id": 14461, "submission_id": "12hll0h", "title": "AITA for letting my son go hunting?", "selftext": "My son (16) was invited on a hunting trip, and I let him go and gave him money to reimburse the other parent for food and ammunition. He said he had a good time with his friend. His mom, my ex, is very angry that I didn't consult her before allowing this. She said she doesn't want him to go hunting again.\n\nI told her she has no say over what happens when our son is at my house. We got into a big fight over it. She said as long as he is under 18 we have to co-parent and make decisions together. The thing is, since he turned sixteen and can go back and forth between homes on his own, there's absolutely no need for us to interact with each other anymore. I told her as much.\n\nShe said I'm an asshole, and that I need to respect her as the mother of my child and make decisions with her. I said no. Our relationship is over. We make separate independent choices now, and we no longer need to consult each other. My girlfriend says I need to make nice with my ex, because it will be better in the long run, which is making me wonder if I was unreasonable.\n\nWas I an asshole for letting my son go on a trip without consulting his mom?", "created_utc": 1681139286, "permalink": "/r/AmItheAsshole/comments/12hll0h/aita_for_letting_my_son_go_hunting/", "score": 1026, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I let my son go on a hunting trip without consulting his mother. She says as his mother she has a right to a say.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Technically, NTA for letting him go hunting. HOWEVER, the whole \"we have no reason to interact anymore, she gets no say at my house\" is absolute bullshit. You are BOTH parents of a child, TOGETHER. A safe trip with another family is not a huge deal but she does have a right to know, what if he had an accident and got injured, and she had no idea why he was around firearms? there are plenty of situations that do still need to be discussed.", "I personally am not into hunting, I target shoot.  But, there are people who enjoy it, and as long as he has a license, it is a legal activity.  I do have to ask if he has taken a firearms safety course and a first aid course.  I assume you send him with, or someone has a satellite phone if in an area with no coverage.  As long as he is prepared, I see no problem, and wonder if she is just trying to annoy you.  In less than 2 years, the kid can make his own decisions.  \n\n\nWhy does she object?  Do they use the meat?  I have no patience for \"sport\" hunting, but using the meat is a different issue.  Does she dislike guns?  This is where a firearms safety course could come in to play.   Some people know only what they hear on the news and think every kid who can shoot will turn into a mass murderer.  Would she object if you went too?    \n\n\nYour girlfriend is right, however.  You do have to have some communication.  What if he were in a car wreck and decisions needed to be made?  Only the parent whose days are custody days makes the decision?  Try to find out her objections, and meet them, but I don't understand her drama.", "I don’t think you’re necessarily wrong for letting him go, but you are wrong for your outlook on parenting your son with her. You guys are absolutely partners who both play a role in raising your son. Treat her with respect, she is important to your son regardless of your feelings about her. Love him enough to be nice and considerate to her. If you let him go knowing it would bother her, that was the wrong decision.", "I‘m struggling here: If I had kids, I wouldn’t want someone to take them hunting (or operating a firearm under different circumstances) behind my back.\n\nBut I’m also aware that there is a huge cultural component to this. I am European, giving a minor access to a Gun is also wildly illegal here.\n\nI, one the other hand, would give my 16 year old kid access to beer and wine, which probably outrages half of the (American) comment section.\n\nIt really depends on how „normal“ hunting and firearms are. From your attitude towards it, I’m guessing: very normal.\n\nHence, NTA", "YTA \n\nUntil your son is an adult, you AND his mother are co-parents. \n\nHunting isn’t the core issue here. The real issue is that you undercut the other parent. You’re creating an environment where the child can now play the parents against each other. \n\nThe rules and boundaries need to be consistent between the parents, and consistently enforced. Where you disagree on an issue, you should work it out and get on the same page before allowing or restricting something for the kid. \n\nAgain, hunting isn’t the issue. It is your complete disregard for co-parenting effectively. Like it or not, at least until he’s an adult you ARE still connected to his mother.", "NTA.\n\nBased just on what you've told us, there's not good reason to not allow your child to go on a hunting trip.  I'm from a family of hunters that live in a rural area so MOST families around here hunt during one season or another, so I may be biased. But, realistically, as long as you know that he's prepared enough to handle a weapon, will be safe, and trust the people he was with to have good hunting/safety practices then there's absolutely nothing wrong with letting him go. Regardless of your ex's opinion.", "NTA\\*\n\n\\*As long as all laws were obeyed and all necessary precautions were taken, you have done nothing wrong.\n\nIf not, your ex can (and maybe should) use this as evidence against you in a custody hearing. In that case, YWBTA.", "NTA. This is the equivalent of going on a team football trip or even a band trip. It happens to be a hobby she doesn't approve of; so the issue lies there with her not liking hunting, while you're fine with it. \n\nYou should let her know when he leaves for Emergency contact purposes. That's different than saying he can/can't go. I would say the same of a band trip or any other extracurricular that spans multiple nights. \n\nUltimately, all decisions come down to; what's best for the child? I assume this was in the child's best interest and something the kid wanted to do.", "NTA.  You need to leave opinions about guns and hunting out of it and understand this is a common and legal activity.  A 16 year old is old enough to agree to it.", "I grew up in a town where it was normal to have guns and go hunting. For most people, gun safety was a part of life. You learned the basics as a small child. You also learned that you couldn’t go hunting with just anyone. There were those that didn’t follow the rules and would even get drunk af while hunting. Then drive home. \n\nBased on my personal experience, this is something you definitely should have cleared with him mom, after vetting the family, learning about their rules around hunting and handling firearms, and explaining what you learned to your wife. And you should have made sure your son knew what he was doing and how to conduct himself on a hunting trip. You don’t mention doing any of that. YTA", "INFO: Were you (and your son) both aware that your ex objected to the idea of hunting, or was her reaction a surprise?", "Nta He  wanted to go", "YTA but not for the reason you think.\n\nAs a hunter in Canada, we take gun safety extremely serious and we do our upmost to uphold good practices and maintain a constant respect for federal, provincial, & municipal laws concerning weapons & hunting here in Canada.  I don't think YTA for taking your 16 year old son hunting, however:\n\nAs a co-parent, if your ex-wife had done something that you thought was potentially dangerous for your kid, would you not react similarly as your ex-wife did?\n\nYour ex-wife reacted to news where she understands your shared child might have been in a dangerous situation.  Instead of alleviating her fears and explaining that your son was in a safe situation, you shut down communication with her and told her off.\n\nyour girlfriend is right, you should maintain a better co-parenting relationship with your ex-wife.  You should also consult with your son's mother on any potentially dangerous activity and hunting certainly falls under that category despite all the safety precautions that exist.", "Info: What does your custody agreement say on first right of refusal? Because that changes a lot of the ruling, 16 or not.", "NTA.\n\nYour son *wanted* to go, it was with his friends family, one that is clearly trustworthy enough to bring weapons around your kid without endangering him.", "I find it disheartening how many comments I see attacking OP as if he did this intentionally to spite his ex. The son *wanted* to go on this trip, which should count a lot here. OP just did what he thought was best for his son. I certainly can't speak from personal experience, but it doesn't seem reasonable to expect every decision to be made together. It seems to me in OP's head this trip was a trivial decision and not some big decision, which is why he didn't feel the need to notify his ex. NTA", "Soft YTA. He was in fact NOT in your house/care during the hunting trip (so my house, my rules doesn’t apply). He’s still a minor and you are still coparenting, so you have to work together and dismissing her completely and portraying yourself as the “cool” dad that let’s your kid do whatever he wants without his mother’s approval is asshole territory.\n\nFinally, while I don’t hunt, but don’t think is terrible either (as long as it is not sport hunting for endangered species); I can imagine she’s worried about his safety. Even the best hunters can have accidents and it would have been a lot better if she wasn’t caught blind-sided if something had happened.", "Eek this is difficult for me. Mum doesn’t know whether this family have safe conduct around weapons, have shown your son how to be safe around weapons and hasn’t been told that he’s on an excursion where weapons were involved and if there had been an incident, that would have been the first time she had knowledge of it. \n\nMy questions, do you know what training these people have had using weapons and whether they do it safely and have you personally ensured that they/your child have the right knowledge and training in the use of the weapons?", "Nta. He's 16 she can get over it", "NTA. A 16 year is old enough to communicate his plans to his Mother. It's obvious why he didn't want to tell her.", "YTA. I say this as someone raised in a community that does lots of hunting, hunt without a firearm myself, and am married to a waterfowl hunter. I know my future children will go out hunting with my husband and his family and encourage it. I also know that there are possible dangers associated with it, especially with guns. I know that my husband and father in law are extremely cautious with gun safety, and the understanding is that they will be present whenever are children are using firearms because I don’t trust just anyone to enforce proper gun safety. Your ex is valid in being angry about not being consulted about your son going hunting. No matter how careful you are out hunting there is always risk, and she most likely doesn’t even know the people he is out with. In my opinion, having children going out hunting needs to be a two yes situation because of the risks. I understand it would be very disappointing for your son to miss out on these experiences, but your ex is still his mother so she has a say.", "YTA. Yes you DO need to coparent especially when it comes to an underage child who is hanging out with strangers (strangers to your exwife) with guns. This isn’t your ex wife making a fuss about him playing board games or something. A riskier activity def warrants two yeses", "YTA  \n\n\nWhile he is a minor, you both absolutely have a say and a sincere interest in what goes on in one another's households as it relates to your child. Try to imagine your feelings if your ex let people who were strangers to you take your son on an activity that you felt was too adult or too dangerous.  \n\n\nYou also say that there is no need for you to interact together. Sorry to be the bearer of bad news, but you two will have to interact with one another as long as your son is walking this earth. Interaction will decrease as your son ages, but it will definitely happen, especially in times of celebration and crisis.  \n\n\nCo-parenting is really hard. Try to keep your focus on your kid, and what's best for him today and in the future.", "YTA It's not the hunting so much as your attitude towards her. this isn't co-parenting it is you declaring my house my rules boo-sucks to you.", "Nta but at least communicate a little bit more", "NTA in most cases your son is old enough to decide which parent he wants to live with full time. It isn’t like you let him go with someone you don’t trust. Your son wanted to go on the trip and what were you supposed to do be the bad guy when your ex decided he couldn’t go? Your son enjoyed his time on the trip and that’s what matters here. You did something to foster joy in your child and that is what parents should do.", "YTA.\n\nSending your minor child on a trip with other people means you tell the other parent about it. Add in the element of the activity he’s doing being extremely dangerous, and you should *definitely* tell the other parent about it.\n\nYour hatred of your ex is getting in the way of you being a good parent.", "NTA for the hunting trip, but YWBTA if you actually cut off contact with his mother and don’t at least try to coparent. As a child of divorced parents and a stepparent to four kids, this just puts your child uncomfortably in the middle, in a toxic game of telephone between the parents. And it will affect relationships with your son’s spouse and any children they may have down the line if you and his mother can’t get along.", "NTA.\n\nHe's 16, it was during your custody time. I don't see the issue here.", "YTA- she is his mother and regardless of your feelings towards her, you owe it to your son to have a civil co-parenting relationship with her. She should have been consulted.", "I have seen a lot of both sides here, but I'm gonna go with NTA. It's a hunting trip. She's acting like you sent him to the military. Hes 16. Hes 100% responsible enough to go hunting. Your ex is acting like a baby.", "ESH:\n\nYou deciding he can go is fine.  But this is the sort of thing that's worth sharing with her, to let her know.", "NTA", "NTA", "NTA", "soft YTA because allowing your child to do something potentially dangerous should always be discussed first. sure, he's 16 and it's legal, and maybe the other parent and friend were super safe and thankfully, he didn't get hurt and had fun. but if she could sign off on letting him do another dangerous activity without your permission, are you saying you wouldn't care? i'm not saying you need her permission, and the fact that your son wanted to go should definitely carry some weight, but communication in co-parenting is important. if you didn't want to talk to her, it would've been easy to tell your son to mention it to her.", "YTA.\nYou are coparents, and him getting to choose where he stays is irrelevant. You made a unilateral decision to allow the child you share to use firearms and be around them. That is absolutely uncool and should have been a shared decision. You sound like a difficult person to have a child with.", "Nta, tell ex this is not the hill to die on.  Son could have lied, and just asked for a sleepover. She needs to keep open channels for her son, her hysterics are going to shut him down.  \n\nEg... I was born anti-gun, just learned daughter fired an ak47 once in her 20's at a shooting range, just to try it.  Shocked, but she did look safe. Now I think about all of my 'lectures', and how many other things, good or bad, I missed in my kid's lives", "NTA given his age and own preferences.", "NTA, your son is old enough to make his own decisions and he enjoyed it, your ex just wants to be mad at you", "YTA. Parents should agree on boundaries and rules together.", "YTA If you were there on this hunting trip, I would say you are totally in the right. If this was your father or brother who you knew personally that they were experienced hunters and were comfortable teaching your son I would still be ok with it. \n\nThe fact that you let your son go on a hunting trip with your son's friend's parents who you don't say that you know personally and have first hand knowledge of their expertise with hunting or guns is the problem.\n\nFor me the problem is not the guns, or hunting. It is you entrusted your son's safety to someone you don't actually have first hand knowledge of their competence. If you do have first hand knowledge of their expertise I will change my vote.", "YTA for your whole stance. You are still two parents who need to communicate.", "YTA - Your minor child was under the care of someone else who is not you or your wife. Your wife should have been given a heads up.", "YTA. You’re wrong about parenting your kid, especially when a decision like this needs to be made. I’m sorry you’re big baby mad at your ex, but her wanting to be involved in decisions related to your child going to hang out with other teenagers with guns is responsible, unlike your petty behavior. Your logic doesn’t make any sense. Sure, your son is old enough to drive himself, but he’s still a minor, and your legal responsibilities to jointly care for him are still there.", "NTA. At 16, he's old enough to start making some decisions for himself, and one of those is whether or not he wants to go hunting. If I had to guess, your ex's idea of \"making decisions together,\" at least in this instance, means she gets to say \"no\" and you have to go along with it. It's not like you told him he could go hitchhike across the country or something ridiculous like that. If he was 12, I would say it's a different story, but in a lot of the country, it would be perfectly legal for him to go do that by himself without either parents consent. You could have been more civil when discussing this with your ex, but I don't think you're the bad guy for letting him go. Out of curiosity, what are your ex's reasons for not wanting to let him hunt?", "I am not anti hunting.  But I am a parent and my ex did things that put the kids at risk.\n\nYTA.\n\nWhy? You do not explain in your post, did the Mum know the people your son went hunting with?\n\nDid you confirm that they hold appropriate licenses for both the guns and the game?\n\nThe Mum did not know where the son was.  Do you have any idea how terrifying it is to get a call that your child has had an emergency in a place you had no idea they were?", "Personally I think anything with guns should be agreed upon by both parents.", "INFO: What is her objection to him going hunting?", "NAH both parties have legitimate concerns. Don’t shut out the mother, but the kid should have went after the mother was informed.", "YTA. \nYou are parents. She will always be in your life, just deal with it. \n\nHow would you feel if :\nThey went abroad without telling you?\nKid had a surgery without being consulted?\nKid had an accident and you were not informed?\nKid was expelled and no one informed you?\n\nI hope none of those will ever happened.", "YTA.\nBased on your reasoning. She can move him abroad for a year and you get no say because \"you guys don't need to interact\"", "YTA. Your son will be the one who suffers the most from two parents who can't communicate. My dad and my husband both hunt so I know my husband will want to take our child hunting when they are older. However, it is not even a question if we would ever let our minor child go hunting without my husband or my dad there too. I don't care how 'safe' the other parent thinks they are, the only person I would trust to supervise my child with a firearm is their father or mine.", "YTA because you don’t believe that you have to make decisions about your child with your ex. I don’t think it was wrong of you to let him go hunting, especially if you didn’t know that was going to upset her. But things still need to be discussed between the parents", "My son goes hunting with his dad and great uncle. We are divorced. I always know when he is going. My son took a hunters safety course before going out. Did your son take a safety course before going?  \n\nI am in the US. Going with YTA just for the fact that you do not want to communicate with the mother of your child.", "YTA. It was your time with your kid and you didn't spend it with him. Sorry, if it's your time with your kid and you aren't going to be there then the other parent should be made aware that you aren't going to be there.", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son (16) was invited on a hunting trip, and I let him go and gave him money to reimburse the other parent for food and ammunition. He said he had a good time with his friend. His mom, my ex, is very angry that I didn't consult her before allowing this. She said she doesn't want him to go hunting again.\n\nI told her she has no say over what happens when our son is at my house. We got into a big fight over it. She said as long as he is under 18 we have to co-parent and make decisions together. The thing is, since he turned sixteen and can go back and forth between homes on his own, there's absolutely no need for us to interact with each other anymore. I told her as much.\n\nShe said I'm an asshole, and that I need to respect her as the mother of my child and make decisions with her. I said no. Our relationship is over. We make separate independent choices now, and we no longer need to consult each other. My girlfriend says I need to make nice with my ex, because it will be better in the long run, which is making me wonder if I was unreasonable.\n\nWas I an asshole for letting my son go on a trip without consulting his mom?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but you should be aware that your ex will likely now use this precedent to circumvent any rule you have that she disagrees with and she also won’t be an asshole for doing so", "YTA  your ex wife’s concerns may not be solely safety ones. She may have a moral objection in which case, the trip should be discussed. OP is responsible for the child for the weekend, however, the mother would probably like to know where her son is and who he is with, if he is overnight somewhere without his father.", "Your ex should have been informed if your son is going on a trip anywhere that's not just a simple sleepover at a friend's house in the neighborhood. (Or even so, she has a right to know who her son's friend's parents are if he's staying the night somewhere) just has a courtesy.\n\nWell I do agree your son can make his own decisions and make a lot of his own decisions for himself, your reason for not telling her was a power play and not because you legitimately trusted your son to make his own decisions", "Anyone who hunts for sport is an AH who I hope meets a karmic end. YTA.", "YTA, he is a minor child Mom has the right to approve of any trips. end of story", "NTA. Mommy wants to control her teen son... and probably ly her ex as well. Let go mommy he is growing up regardless of your opinion.", "Yta", "Question: Do you  ex call you  and ask if he can go any outings, parties, sleep over  or trips  he does at her  place? \n\nIF  Yes,  YTA,\n\nIF No,  NTA:", "Her idea of co parenting is that  she decides if he can go hunting. What do other parents do when they aren't in agreement with each other?\nI say NTA as he is 16.", "YTA\n\nLet me fix your title \"AITA for telling my coparent that I don't have to talk to them about our kid?\"", "NTA people are saying you need to communicate etc. which is probably true she should know where her kid is but in terms of the activity you said okay and it was on your time. Clearly telling her would have made no difference because she would have said no and you would have let him go anyway so you just saved your son a lot of headache and allowed him to enjoy his trip.", "INFO: is there a reason you didn’t text your ex just to say you’re sending kiddo off with another family? \n\nPersonally, the activity itself is the least concerning thing. If I had a kid I would absolutely want to know if they were going off with another family somewhere, regardless of what the activity was. \n\nKnowing the location of your kid isn’t a big ask.", "I agree with everything but the judgment. Because of all these reasons you described, this falls in to AH territory, in my opinion.", "As a child that has divorced parents, its OP's house, OP's rules. (god I just said OP I hate everything)", "Assuming proper safety protocols are followed, this would be viewed as nbd for a parent to allow their minor kid to hunt, in rural America.", "What the fuck is European supposed to mean? In many parts of europe, hunting using firearms under the age of 18 is both legal and completely normal, provided you have the necessary training and licenses…", "I got my first rifle at 15. So I could join the rifle team at school. I took it to school every day.", "I was given access to a gun at the age of ten, this is a different culture.", "The kid is 16.  He's old enough to decide things like this for himself.\n\nTake the hunting aspect out of it for a second.  What if the son wanted to go  skateboarding? Or skiing?  Or on an overnight camping trip?\n\nDoes mom get to veto anything SHE regards as even remotely risky?  FUCK no.  He's 16.\n\nIf Dad's OK with it and there is no undue risk, she should have no say.\n\nNow, if you're talking about an abnormally risky activity - let's say, motorcycle riding, hang gliding or skydiving - then yes, I think Mom needs to be on board.\n\nBut giving mom veto power over every fun thing Dad wants to do is just going to lead to Mom using that power vindictively to keep dad from doing anything fun with his son, and that makes Mom the asshole.\n\n&#x200B;\n\nNTA, for sure.", "To an extent, I agree with you. The parents should try and communicate and be on the same page. That is what is best for the kids. The problem is that doesn't always work. Sometimes one parent doesn't ever want to give in and just wants their rules upheld at both houses. I think if you have given it all you can but you can't agree, you end up where OP is at.\n\nGiven what he has said, he is the AH because he hasn't tried to make it work, but if he had, I would be on his side.", "You're disregarding what a 16 year old wants to do with his own life, he isn't a 3 year old. There are things he wants to do that can be done safely and if mother tries to veto then mother will damage the relationship she has with her son", "This times a million. Obviously the decisions that a 16yo can reasonably make on his own are a lot broader than a 3yo, but that doesn't mean that they just get free reign to do whatever they want. There's still a parental role to be played, which means both parents need to be playing that role together. YTA.", "While agree that saying they have no reason to have contact is a significant overstatement, expecting divorced parents to communicate and co-operate better than most married parents is totally unreasonable. \n\nOP cannot expect to continue to be controlled by their ex. \n\nNTA", "The kid is 16. At this point he can choose to live where he wants. There will be no custody hearings unless there is reckless child endangerment. Which is not the case here.", "That really shouldn't matter. At 16 a person is old enough in some states to go hunting alone if they've had a hunter safety course and, in the rest, their old enough to go, regardless of if they've taken a course, if they're with a licensed adult. The mother's opinion on hunting is just that, her opinion, and regardless of it, the kid was old enough to make his own choice here. He had the blessing of the parent, whose custody he was in at the time.", "I'm not really up to date on her opinions. She gets mad at everything I say and do, so I wouldn't say I was surprised, exactly. She does eat meat though, so I'm not sure what her objection was, exactly.", "ROFR is not to prevent a child from doing activities with friends. OP was available to watch his son.", "That doesn't make any sense at all. So, when the kid is staying at his mom's, she should inform the dad every time he goes to hang out with his friends? That's ridiculous.", "Guess every parent that let's their kids go to sleepovers is an asshole", "This is wrong on so many levels. It wasn't just going out with other teens to play with guns. It was a hunting trip with another family and 16 is old enough to legally go hunting with any licensed adult.", "Most of your examples require notification by law, hunting does not.", "Those things are wildly different than letting their kid go hunting with his friend's family.", "NTA\n\nHunting is not a life altering decision, nor is it the first step twords an international kidnapping. Ex is just being a control freak. The fact that father no longer interacts with her and let's son do traveling is indicative of that.", "That is completely different than allowing their son to go on out on a hunting trip.", "What a ridiculous response.  Just because it was the kid's time at his dad's house doesn't mean that they'll always spend every waking moment together. The kid is 16, he's obviously going to spend time with his friends. duh.", "What? You make it sound like OP went on the trip and left his kid at home.", "Child of divorce here too. And the fact that my parents did that to each other made them get SUPER toxic. If you create a human with someone, you DO have to communicate with them about that human. It's their kid too", "I agree, but it does hang on 'if proper safety protocols are followed'. I joined hunts at 16, nothing wrong with that, but I am forever grateful that I had some very good teachers and didn't learn, say, crappy gun safety or other bad habits that'd be hard to train out. I received a good and thorough education and I'm very lucky in that.\n\nIf I had a 16 year old, I would not mind it if they went hunting. I wouldn't necessarily mind it if their first hunting trip were without me, either. But, if they expressed interest in hunting, you BET I would make ABSOLUTELY SURE they got shooting classes at a range first, and understood what is or isn't risky, and I'd sit down and talk to them about ethics and all those things. Once I knew they were good on stuff like that and wouldn't pick up any crappy habits or something, them going hunting with their friends wouldn't be an issue. But their first taste of hunting, and it's with some random people I'd never met? I don't think I would be ok with that, and the problem would not be the hunting part. Some people shouldn't be allowed to hunt in my opinion, and I would be absolutely pissed if the wrong person taught my kid the basics on guns, hunting, hunting ethics, and gun safety.\n\nThe kids mother was not given the chance to give her son that education or make sure he had the minimum aceptable knowledge (and it doesn't sound like OP made sure to provide that either, he just let him go hunting with some friends parents), and hence, OP is YTA.", "My brother started hunting with my uncles when he was 9 or 10.  My dad hates hunting but he went and sat in a deer stand  with my brother to make sure he could do it safely.  I've sat in a deer stand with my brother.  Really, it is just sitting in nature as the sun rises or sun sets.  It is kind of nice.  Not a lot of shooting.", "It often seems that Europeans have an even more skewed idea of their own gun laws than Americans do.", "The children I've seen with guns have been very responsible.", "the problem isnt the activity. op is intentionally causing a divide. he is making his kid think he is more fun, and mums the buzzkil and thats not fair. ESH at best, YTA at worst. TLDRs bolded\n\nits not allowing her veto power, shes asking to communicate. if she didnt like it they can be adults and discuss it. theres a difference between veto and discussion. after the discussion, then they can decide what they want to do (including letting him go anyway), but this is taking her choice out of it entirely.\n\n**by forcing no discussion, op is vetoing mums choice. how is that any better? he is doing exactly that and using it in a way that is just as vindictive. if they cant respect each other, they shouldnt use the kid as ammo for their shit.**\n\nop isnt doing a fun activity with his son, he is letting him go with friends. and tbh most of those activities i would personally say are safer than a teen with a gun, but thats my own opinion not shared by all. \n\nas everyone says, until he is a legal adult, they are his guardians. teens dont make the best choices, so its their job to do so. **people give teens both too much, and too little credit. teens can make choices for themselves, but those choices are impacted by the parents**. \n\nwe also dont know if safety protocols will be followed, and while many will trust those who do this regularly, teens are well known for poor decision making and joking around in ways that get them hurt. you cant always stop them from doing it. there are endless videos we see online that show this isnt too rare. \n\n**what if mum wanted to know their experience levels to ease her mind before letting the kid go? how well do they know this friend/family? will the kid be hunting anything big? what guns will be used? has the kid ever used them? op is being childish in not allowing this conversation and is outright refusing to have it because of spite. thats not right.** even without the gun argument, id want to know if my kid was camping. they could get hurt and i wouldnt know until they either came home or are in hospital. \n\nex says \"you need to respect me as a parent\". op said no. literally. i dont see this as any different to badmouthing the other parent. idc if theyre kids or adults, its outright disrespect.", "Thank God someone with sense is commenting. Hunting is just a hobby like any other she doesn’t have to be in the middle of every aspect of his life. Also everyone is saying he should be consulting his wife and valuing her opinion but she was totally fine with immediately saying she didn’t want him to go again. She didn’t “consult” or “try to talk it out” with OP she just said she didn’t want him going any more and made no attempt to reasonably approach the situation. She just jumped straight to being mad and telling him that he shouldn’t take him anymore.", "Listen when you're sending your underage kid off to use firearms in the supervision of another unknown adult - its a two parent convo. They don't know if the other parent is responsible or follows appropriate safety protocols. A 16 year old\nMay not care about safety and proper firearm usage.", "Agree. That’s pretty much what I was talking about.", "Legality is hardly the only consideration in matters of coparenting, come on.\n\nPurposely doing something your ex vehemently objects to, \"because you *legally* can\" could definitely be asshole behaviour.", "Thats probably because you … dont communicate", "And your son had not mentioned the possibility of the trip to her? The situation sounds like a \"I know Mom wouldn't allow this but Dad will\" kind of thing, and that's not good.\n\nESH, Everybody Sucks Here.  You're right you don't need her permission for events on your custody time.  But your son should have let her know in advance about this, and if he purposely did not then you're both making a contentious parenting relationship worse.", "So you allowed it mostly because you wanted to piss her off. Got it.\n\nStop using your son as a way to get back at his mother.", "For day activities, maybe but this is full on staying over with others. \"If there's a right of first refusal clause in a child custody order, this essentially means if your ex is not going to be with your child, you have the first shot at being there. Before they call a babysitter, daycare, or other childcare option, they must offer it to you.\"  \nIt doesn't say available or not, it says if the other parent isn't going to be there with the child.", "If its an overnight trip or involves some type of travel, yes.  \n\nThey are both parents and just because the kid is a little older doesnt mean they stop being co-parents. OP saying “we no longer need to consult each other” is way out of line.", "So youre ignoring the second sentence in my judgment so you can be argumentative?  \n\nYes, both parents should know if a kid is at a sleepover. Do you think they shouldnt?", "Okay and? Your pedantic comment about my intentionally flippant comments aside, OP is still TA.", "Depends on the country though which op did not mention.", "He did say \"we make separate independant choices\". This is just one instance. I am pretty sure he is the kind of people to push ot further.", "Then laws in your countries differ from mine. You not only need to be licensed to hunt but it was/is illegal to do it that young. Hence why the mother should have been informed and he is a jerk not to. There are way to many hunting accidents as it is.\n\nMaybe you are ok with giving a 16 yo firearms but it should not be.", "I agree. But based on him saying that they don't need to communicate, it doesn't matter on the situation.", "If the Dad had gone with him, different story.  He entrusted his welfare to another adult.  Common courtesy to let the mom know", "if you mean me too for hating the term OP, then i would suggest clarifying that, because tbh i thought you agreed with their comment then said the opposite lol\n\nim just an idiot, but im sure i cant be the only one who thought that lol\n\nedit: they fixed it lol", "i dont think thats it, i think it depends where in europe they are, because people always argue about it; suggesting there are different laws in different places of europe\n\nedit: above comment also says \"in many places in europe theyre legal\" which kinda proves its regional.", "And I know children who have shot other children to death, so that’s definitely case dependent.", "In many states just for a 16 year old to get a hunting license you need to have taken a hunting and fire arm safety course. It's likely the son did.\n\nI shot my first deer at 13", "He didn't send his kid off with some stranger no one had ever heard of. It's his friend's family.", "You're pretending that the OP deliberately sent his son on a hunting trip specifically to make his ex mad. That' is not even remotely what happened.", "I don't think OP sent his son hunting just to piss off his ex. His friend invited him on a trip, and OP let him go. Totally different thing.", "Right - all OP had to do was send a text to the ex and say kid is going here with these people. Problem solved.", "How tf do read \"I'm not up to date on her opinions\" and come to the conclusion \"You just did it to piss her off then\"?", "This is clearly not a quote from a court order though. That’s one persons interpretation. A well written order should make it clear that ROFR is relevant when one parent *needs* to outsource care of the child.", "She would just be wasting her money if she tried to drag OP into court for contempt over right of first refusal for a trip a 16yo wanted to go on.", "It's not though. 16 is old enough to make a lot of choices on their own. That kid can legally drop out school and essentially strike out on his own if he really wanted to. And the OP didn't say it was an overnight trip, just a hunting trip, which could have been as short as an afternoon/evening. \n\nRegardless of the Ex's opinion, the kid had the permission of the custodial parent at the time.", "I don't think it matters when the kid is of legal driving age and very capable of making some decisions for themselves. The son in this story *wanted* to go, and has apparently built up enough trust with his father and the other family to be trusted around weapons, as well as the other family building up enough trust to be trusted around the son with weapons. \n\nThere is a clear level of trust between the son and father, one which was proven justified due to the hunting trip going well, and it seems more of a poor reflection on the mothers part that that same trust hasn't been built between her and her son.\n\n\nBesides, the permission was given during the father's time of custody, meaning she has no say, because it's his week/weekend with the kid", "On her time she can know. Otherwise no that's not how split custody works", "Yeah... No. The kid is old enough, and mature enough that his parent trusts him on a hunting trip. This is something that is different with every kid. If this teen is responsible around firearms there's absolutely nothing wrong with it. Dad's get to make independent decisions regardless of what she wants, if she wants something that's on her time", "Okay and you're wrong. That's the point. OP is NTA and I wasn't being pedantic, I as just being correct.", "Where do you think a 16 year old can legally hunt?  Come one, you know it is the USA.", "A lot of parents in families, both together and separated, make independent choices. And you're assuming he's the kind the person to push it further, but you don't know that and, regardless, it has absolutely nothing to do with the instance at hand.", "It's not common courtesy if they're not close enough to actively stay in communication about small stuff. Sending your kid out of state on a trip for a few days or taking them on an international vacation or something like that, then yes, absolutely. Something as minor as a hunting trip, that's not anything to flip out over.", "But if you're being taken on a trip with an unknown adult the parents have a right to be concerned about whether the other people observe appropriate safety protocols even if they have taken a course they may not give a shit . And there's zero indication the kid had followed the appropriate regulatory guidelines in order to procure his license but even if he has he may not care about how safe others around him are the same way his parents will. So saying it's his choice alone is not appropriate in this situation.", "In many states 10 is the minimum age for a hunting license, and as you said he needed to pass a test administered by the state fish and wildlife department, unless he’s hunting on private farmland at the behest of the owners, then it get murky. But 16 is more than old enough to understand firearm and hunting safety.", "How well acquainted they are with the friend's family is nowhere in this post. How much they know about how safely or not that family is around firearms also nowhere. Whether they even know the parents also nowhere to be found. And whether that family is safe to send your child with around firearms is totally a two parent decision", "OP is taking every chance he can get to take shots at his ex. This isn’t about the son - it’s about pissing off his ex.", "16 is not an adult.", "So its now Mom’s fault that OP didnt tell her the son went on this trip?", "As someone who works in child welfare yes it is how it works actually lol", "EXACTLY. I cannot fathom how some of the people in these comments aren't getting this.", "One of his parents trusts him. The other wasn’t consulted. Hence the entire problem.", "No, just being smarmy. OP needs to discuss things like this with the mom, and suggesting he doesn’t have to do it at all makes him TA.", "Letting an UNDERAGE kid use a firearm is that normal where you come from? It is not where I am from and should definitly be a co parental decision.", "It really depends, custody wise there's a thing called first right of refusal, and if a parent has that then they have to be the first asked if the other parent isn't going to be the one actively caring for the child(and yes teens count). Things like being baby sat and sleepovers where other people'd be keeping an eye on the child count towards that.", "I disagree that hunting is something so minor.  For someone who does this regularly it’s minor.  For someone who hasn’t ever hunted it’s not so minor.  It’s all perspective.", "You could be right you could be wrong. You're working off of assumptions.\n\nOnly way to know is for OP to answer these questions. It could be just as likely he did complete all safety courses and went with responsible people. It could be possible the wife even knows and trusts these people, she's just unhappy not being told.\n\nWe can make up any assumptions we want", "You're making a lot of assumptions to justify your snap judgement on this.", "Lot's of people hate their ex's. You're jumping to conclusions about the rest.", "You're right, 16 is not an adult. That doesn't change any of my argument.", "Nice strawman, but I didn't say that at all. I simply pondered on why the mother doesn't have the same trust built up as the father does, which may or may not be her fault. \n\nBesides, the majority of custody cases give fathers a significantly shorter amount of time with their own kid than the mothers get, so you know damn well that the mother has no business or say in what happens in that timeframe, short of obvious child abuse", "I disagree entirely. I don't think there would have been any issue with sending over a quick text or something, to be clear, but I don't think it was a requirement by any stretch of the imagination. Going hunting with his friends family was a minor thing and the ex here has no business freaking out about it or saying that he can't ever go hunting again. That's ridiculous.", "Well, underaged kids where I'm from are required to take rather in-depth hunter safety courses that teach them how to safely handle firearms, hunt ethically and the laws surrounding both hunting and tools used there-in. \n\nIf the OP is in the US, then literally EVERY SINGLE STATE requires adults to be fully licensed hunters.", "Well, we don't know what the status of their agreement is but if the child is old enough that they're allowed to freely move between parents then it points to being custodial parent discretionary.", "It is minor, regardless of if it's something they do a lot or if it's the first time. Hunting isn't really any more dangerous than letting your kid go to a lake or go camping, but if the OP was talking about his son going on a day trip to a lake, no one would be batting an eye.", "All I'm saying is that there are further considerations than does the kid want to go does the father care. That's all. We don't know and I'm making no assumptions", "And lots of people are shitty parents because hating their ex is more important to them.", "You seem to have a lot of argument on this post. The lady doth protest too much.", "Ahh you didnt say it you just *pondered* it. \n\nSo now youre *pondering* that since OP is a male he can do what he wants? \n\nThe misogyny is starting to come out…", "Obviously the ex didn’t think it was a minor thing. Even if not together, parenting is supposed to be a two yes, one no system of decision making. She’s not right to say “never again,” OP is wrong across the board to suggest he doesn’t need to discuss anything with her. Just because you think this is something completely fine and normal to send your teenager to do doesn’t mean everyone else does, which is why OP’s ex is somewhat justified in her response. Hell, if the kid knows what he’s doing and OP could vouch that his son has been properly trained and educated about using and being around guns, this would be fine! But he didn’t. He decided some other family could take care of that, and didn’t even warn the son’s mother. Be realistic.", "I’m so glad you are so authoritative.    Everyone now is set to your standard.", "Hopefully OP will answer some of these questions to clear it up", "We don't have enough information here to know if OP is shitty parent, as a whole. We just know he hates his ex, they don't communicate well, and, separately from that, let his son go hunting with his friend's family. The last point, providing the laws were followed, he was in the right for.", "The lady? And I do, because these types of arguments are near and dear to me. Having gone through so many custody issues, it makes it angry when so many people completely ignore the actual issue at the expense of the kid. The Ex in this case is being overbearing and picking a fight where there doesn't need to be one, at the expense of the child.", "Name calling is the sign of someone losing an argument, I see no misogyny.  Just you losing an argument.  Be a good sport.", "Two yes, one no system is bullshit, and you know it. Discussions can be had, when necessary, in most situations but in most split households that's not always how it works. Depending on their custody agreement, he might literally not have to speak to her at all if he doesn't want to. We're not privy to that information. I don't know where these people live, but if they're in the US, then legally speaking hunting IS a minor thing as long as the laws were followed, regardless of the mom's opinion. If the mom declared that driving was too dangerous and forbade him from getting a license, but dad took him to take the test anyway, well then tough shit for mom because the kid is legally old enough to make that choice himself.", "You have to take a hunter's safety course in order to obtain a license to hunt. It is almost entirely firearm safety, and covers some stuff like basic navigation and survival skills like how to start a fire or find shelter. So his son was properly trained and educated on how to use a firearm.", "I literally couldn’t care less about legality, either you’re right or wrong about it. You can do something legally and still be an asshole.\n\nHe sent his son on a hunting trip with another family and intentionally didn’t tell his ex because 1) he knew she didn’t approve and 2) he knew it’d piss her off. That’s enough to make a judgment.", "Its a quote…\n\nAnywho. Yes, you clearly have a personal bias. The take home for me is, as with most topics in this sub, a little communication would have prevented the entire issue.", "If dad took him to get the test taken then at least the test would have been taken, you’re insane if you think you can just chuck a gun at a teenager and they’ll know exactly how to be safe with it. But I guess you’re not reading my comments to have good faith discussions lol", "You're right about the first part. I agree that you can be in the legal right and still be an asshole. I don't think that's what happened here. OP allowed his son to do something and didn't know his ex didn't approve until afterwards when she found out about it and flipped out. OP didn't tell her beforehand because he didn't have to. THAT'S enough to make judgement.", "I don't disagree with that. My stance is solely based on - Dad didn't do anything wrong and isn't TA, even if it wasn't necessarily the 'best' way to move forward, based only on what we know from the post.", "Now you're changing the discussion to gun safety. That isn't the topic at hand. We don't know the specifics of his kid's gun education, but regardless of that I DO know that the friend's family COULD NOT be going hunting without being licensed hunters. It's literally not legal in ANY state and I doubt the OP would post on the internet about sending his kid poaching.", "Nihlys won, teratodentata lost.  That is my final ruling.", "YTA. I don’t particularly care about the hunting aspect, but your attitude towards co-parenting is toxic. And frankly, someone with your aggressive attitude is the exact person I don’t want around my kids when it comes to guns.\n\nI grew up around guns and hunting, and would be very put off if someone took my kid without notifying me. Guns in the woods are a big deal even if hunting is a normal hobby.\n\nEdit: Looking forward to your post in 2 years: “my Ex wife and ex girlfriend are now best friends and both hate me. AITA?”", "NTA, he's at the age where unless he's making a bad decision, his voice counts the most. She can have opinions on his hobbies, diet, dating, etc and she can express those opinions to him. She doesn't get to dictate to you what he does or doesn't get to do while at your home unless you are being irresponsible and then she can go to court.", "YTA Seriously, I don't like how you talk about your ex or how you handled this situation. Deliberately creating a rift too, it seems.", "Yeah.....YTA.\n\nCommon sense and decency should prevail here, and there are a bunch of activities that are dangerous enough that it is very uncool to not consult with the other parent.  Hunting, skydiving, scuba, hang gliding, whitewater kayaking, race car driving.....thinking you have the prerogative to be the sole decision-maker here is definitely an AH move.", "YTA", "NTA. \n\nPersonally, I am opposed to hunting/gun usage, however as someone who has co parented I knew I had to accept that whilst our child was with the other parent, as long as what they chose to do was both safe and legal, that that is their time together and I cannot control or dictate that, the same way as they cannot control or dictate what happens when our child was with me.", "NTA... but...\n\nYour relationship is about 50\nyears from being over. You will have graduations, weddings, grandchildren and their events, all shared. You will run across each other for the next several decades unless one of you dies or peaces out entirely. There was nothing more uncomfortable than my son's high school graduation during which his divorced and non-cooperative grandparents sat on opposite sides of the gym, making him make a choice of which group to go to once the ceremony was done. We nipped that in the bud for my daughter's graduation.\n\nThat said... You are correct no cooperation is *required*. And in rural areas going hunting is just another day of life, not a big deal. But the failure to have at least a modicum of cooperation may bite you in the butt at some of the future events.", "NTA for letting your son go and not consulting her. But you should do a better job of communicating with her for your sons sake. She's not going away, that's his mother. He is old enough to know if he wants to hunt, but you shouldn't burn the house down because the mouse is annoying.", "YTA - he’s still a minor and was not in your care if he’s going hunting with friends. You should have spoken to her before you gave consent.\n\nIf your son knows that neither of you is talking to the other, what stops him from selectively asking the parent he knows is more likely to say yes to his requests?\n\nCan you think of no situations where you would want your ex to check with you before giving her consent to your son’s outings/activities?", "YTA for your attitude with your ex. He’s under 18 so you can’t go NC with your ex, regardless of your feelings towards her or the situation.", ">>> Our relationship is over. We make separate independent choices now, and we no longer need to consult each other.\n\nWrong. It’s true that your romantic relationship is over, that your marriage is over and your friendship is over. But your most important relationship is not over; you are parents of the same child and always will be. When it comes to important decisions involving your child, you still need to consult each other. Sorry, if you don’t want to be connected to someone for your entire life, don’t have a child together. YTA.", "I would say NTA for letting your son join the hunting trip. But YTA for thinking \"our relationship is over\". As a child of divorced parents; your relationship will never be over! One way or the other you are both your son's parents. Due to the co-parenting relationship of the past, I assume you both have  somewhat equal roles in his life and he will probably want that to continue.", "YTA nothing wrong with going hunting if that's what he wants to do but seriously, you need to co-parent with your ex for the sake of your son", "Totally depends on the morals of your partner. Hunting is something which many are passionately for or against, if you knew that your ex was really against it but you decided to deliberately ignore that then YTA", "YTA for allowing him to kill", "YTA", "YTA sounds like the parents are divorced for a good reason - chances are OP knew his ex didn’t approve of hunting so he purposely didn’t say anything. I don’t really care for OP’s attitude towards co-parenting either and the kids age is irrelevant in my opinion. If an accident was to happen and they can’t get ahold of dad, does the friend’s family have moms contact information! 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️", "YTA because you're  making his mom to be the enemy. We don't have enough information, but the attitude you're showing her may be why she divorced you and why she's against him hunting. \n\nHere's another scenario; what if your son got a motorcycle license and didn't wear a helmet and she didn't tell you? Would you be as worried or as angry as your ex wife?", "NTA. One parent often will think every decision needs to joint, or have their approval, and it doesn’t have to be. Good for you for giving your son some survival skills.", "YTA for refusing to discuss this at all with your ex. Until your son is 18, you and your ex are both co-parents and should have conversations about this kind of stuff. \n\nHunting is a dangerous activity, the goal is literally to successfully kill something. Your ex has a right to know that her son is not only going along, but also actively participating. \n\nShe has a right to know that he has been properly trained on gun safety, that there is a responsible, properly trained adult with him, that the other participants have been properly trained. \n\nYou are an adult. You should be able to have a conversation about the child you both created and are responsible for.", "INFO: Do you get a say in what your son does at her house? Because the answer to that question alone will determine my verdict. \n\nAs it stands right now, I’m going with NTA.", "NTA, but possibly also in violation of the custody agreement for your minor son. Your ex may consult a lawyer to find out if that is the case, so the safe choice would be to give that legal paperwork another look.", "So does the kid have a hunting license? I would think that if the kid wants to do something that requires a license and training, the parents need to agree. So YTA", "YTA. If you didn’t want to deal with her, whatever. I think you’re wrong for this, I have seen first hand what happens when parents don’t communicate (I.e. nobody knows where the kid is and he is in danger) \n\nBut at the VERY LEAST, the mom should have known about the trip and been given the other parents’ phone numbers to discuss the trip before he went.", "NTA 16 is old enough to make that decision on his own. Parents should make the decision if the other parents are good people.", "NTA. Your son is 16 what discussions need to be had? He can choose to live with whatever parent he wants in some states. Does she tell you every little thing he does while he is at hers?", "YTA for thinking you don’t need to co-parent your minor child. Communication doesn’t end when a kid goes back and forth on their own.", "YTA on this one.  Not for letting him go hunting, but for not coparenting responsibly.\n\nUntil he’s on his own, 18+, you do indeed have to work together to parent him.\n\nAnd you should probably consult each other before giving him access to guns / letting him go and kill something with his friend’s family… who you hopefully know and trust?\n\nLike yes, it’s just hunting.  But it can indeed be a powerful, positive or negative, moment in a young person’s life:  Taking the life of another.\n\nThat should probably be something both parents are on the same page on and know about.", "I know in your telling you’ve liked skewed the story in your favor but the good news is you only have to deal with her for 2 more years.  \n\nNTA.  Your son is at an age where his independence is key to his becoming a full adult.  Probably best in the future to communicate even if it’s “just a heads up I gave our son permission to do/participate in X.  There will be no discussion.  Best regards.”  \n\nHang in there man only two more years!", "Nta", "YTA you could easily send her a text about it \"just giving you a heads up, kid is going on a hunting trip with friend this weekend\".", "NTA. Doubt she involves you in any decision making when he is at her place. At least you only have 2 more years left.", "Most states require hunter education to get a hunting license. The course includes information regarding safe handling, and often some live fire. If they went to a range, things are tightly controlled regarding firearms.\n\nOverall, NTA. Your attitude sorta sucks, though.", "NTA\n\n\"as he is under 18 we have to co-parent and make decisions together.\" In this specific case sounds a lot more like her (only) getting a veto whenever she wants.\nIDK, what does the custody arrangement say?", "NTA, but YWBTA if you didnt consult her if he gets invited to another hunting trip since she's raised a concern.", "NTA- assuming that your son is known to be a calm and responsible teenager who can be trusted around guns with live ammo. \n\nPersonally I disagree with civilians in western countries with easy access to meat supplies hunting animals for food or fun. I assume that your son's mother may have similar attitudes or safety concerns about going hunting with guns that can kill. \n\nHowever your son is 16 and old enough to be able to decide whether he wants to go hunting with friends or not.  Presumably he asked your permission to accept the invite, told you that he was keen to attend and you agreed. He may have come to you knowing that his mother would never have agreed. \n\nAssuming that your son's mother is not a vegetarian or anti-hunt activist, it is good manners to consult her about trips that require parental consent until he is 18. If she is such an activist or has an animal rights motivated 'vegetarianism is best' attitude that she imposes on other people, there's no point even botherng to discuss differences of opinion over these issues.", "YTA - not for the hunting but how you handled it.\n\nYour literally and legally are co parents, you literally have to consult with each other, until your son turns 18.  His brain is still developing and he is not an adult yet, you are supposed to be the adult.\n\nThis was involving fire arms, she should’ve been informed.  If she strongly disagreed with it b it the kid was blunt he wanted to go and was honest and transparent to the mom I would understand still letting him go.  But that’s not what happened.  Your creating a toxic environment where the son is learning to play you off of each other.  You need to coordinate and be civil.", "YTA, I agree at the end of the day he is still a minor and if something happens to him while he is hunting are you go to tell a judge well I dont have to consult with her . I wish you would", "ESH. You are right that your ex doesn't get to veto things happening at your house. But your ex DOES need to know if her kid is off on a trip somewhere in case something happens. A quick call to your lawyer should clear up rights and responsibilities.", "Hunting is a dangerous activity, and yeah, if she doesn't want him to, she should be able to Blick him. At least until he's 18. And it doesn't matter if you 2 are not forced to talk, this is still your son, like it or not you're going to see her in the future. \n\nI'm not saying I agree, but that's how it should work. \n\nI guess a YTA is my answer.", "No Judgement\n\nDude you are right in a sense.  I get your point, its your house your decision, and from her reaction I am under the assumption that she hates guns and/or hunting, and that might be coloring her reaction.  But this might have been something you mention and discuss with her.  If you were with him, I am on your side, but you weren't.  Your kid was with someone else, and God Forbid if something had happened, could you imagine the Sh\\*t storm then?  While I get your reasoning there is nothing wrong with a heads up, not permission not debate, just an update on the fact that your child is with someone else.", "NTA for letting him go, but YTA for not communicating with the other parent, just because he can drive/choose between doesn't mean you get to exclude them from decisions like this and should have atleast talked about it.", "YTA. Views on guns are extremely polarizing and as his mom, your ex should have been involved in making the decision to send her kid off with a family for the express purpose of shooting. Just because your kid can choose which house to go to doesn’t mean your ex stops being involved with her child based on where he is located. \n\nHave you gone shooting with this family? How can you be sure they handle guns safely? Personally, I would not leave my kid alone with others I didn’t know I could trust with firearms. All it takes is one mistake.", "Info: Did you and mom discuss how he would learn to drive a car?", "YTA. Anytime your child is going on a potentially dangerous activity that the other parent is not aware of, you should consult.\n\nSo until he is 18, you are co-parents and should consult, and especially in this case where you are not accompanying him and deadly instrumentality is involved.", "YTA for not closing the loop with your son's other parent. He's 16, not 18, and even if you disagree with her, she has an interest in the child's well being and should be informed and consulted. \n\nFor instance, she might wonder who these friends are or what their experience with hunting is. As someone whose family hunts, I'd want to know more about the parents and how responsible they are before agreeing to let a kid go along. Even if you did that work, you didn't help her understand beforehand that you did that work. You didn't allay her concerns *as a parent*.", "ESH except your kid. Both you and his mother need to stop weaponizing your child to poke at each other. He does not deserve that.  Teenagers vote with their feet, and if you and his mom keep putting him in the middle of your disdain for a each other he will walk away from you both.", "N-T-A for the hunting thing in a general sense. Even if you talked to her and she said she wasn’t comfortable with it, I don’t necessarily think you’d be TA for letting him go anyway, because at least you would have consulted with her.\n\nBut YTA for thinking you don’t need to coparent at all. Your son is a minor. Until he turns 18 you are a CO-PARENT, and while you may not legally need her approval for all parenting decisions, you absolutely should be consulting her and listening to her opinion.", "YTA, your son is still a minor therefore his mother deserves to know where he's at, especially when doing something potentially dangerous like handling firearms. Put yourself in her place for 1 minute. You weren't even with him so even more reason to warn her. you hate her too much to send a simple text with a heads-up? too fucking bad, its not about you, its about your son. all i see in your OP is how much you hate your ex.", "YTA.\n\nUntil he turns 18, you should be co-parenting with his mother. Did he cross state lines to go hunting? If that’s the case, you are probably in violation of your custody agreement by allowing him to go. Your ex has every right to know where your son is and who he’s with, just as you would expect her to let you know if the situation were reversed. Whether or not you get along with your ex, there is no reason not to be civil and co-parent when it comes to your son. Think of how you would want your ex to treat you when it comes to your son, then treat her that way. Your son’s age has nothing to do with it - he is a minor until he turns 18.", "NTA. He’s old enough to go hunting and your ex has no standing to stop you from giving him permission.", "Nta", "I'm gonna go with ESH. 16 is old enough to get his own hunting license, not hunt under another's here. So, technically, he could without either of you. You do need to still parent WITH her because again, this is an age where there's alot he can do without both of you but still needs guidance. I say you suck, because if you are going to allow him to hunt, and use and be around firearms, he is still of an age to need supervision, and in agreeing he could do it, as his parent, that is YOUR place. You supervise, verify he is learning safe and appropriate ways. I only think she sucks because she wants to stop his hunting, and you did not give valid reasons why she felt so, that would bring up probabilities of concerns for responsibility and safety.", "Unless your son has passed a hunter safety course and you and your ex are both aware that he has, YTA. It's not hard to pass, but the education is essential. There are just too many mistakes that can be made around firearms to be like, \"oh, he'll be fine.\" You not only have to be aware of your own firearm and safety, you have to be aware of everyone around you in case one of them is acting irresponsibly. \n\nPlease, please take this seriously. Nobody thinks it's going to happen to them. In the home of the man who taught my hunter safety course, someone else picked up a pistol in his living room, didn't check the chamber, pointed it at a wall and fired, sending a bullet directly over the toilet in the next room. If a guy had been relieving himself in there he would have had a bullet in his chest. (I don't remember the part of the story explaining why the pistol was loaded; the point is that you should treat all firearms as if they are loaded and always keep them pointed in a safe direction.)\n\nPeople do stupid, careless things all the time, and your son needs to know how to stay as safe as he can before he adds firearms to the mix. Not to mention the rough terrain and obstacles that you often have to navigate while hunting. Not to mention other hunters in the area that aren't even with your group that you have to stay aware of. \n\nYour wife was absolutely right to be concerned if your son wasn't properly prepared before letting him go. \n\nSource: NRA Life Member (obtained before it became a lobbying shit show), former international-level competitor in shooting sports.", "At which point is the 16 yr old gonna be responsible for what he wants to do ? \nThey could’ve just as easily told their dad they were going on a road trip to the beach and could’ve gotten the same outcome from the dad. \n\n\nWhile I understand the mothers frustration in the dad not wanting to coparent, \nThe kid is not a child anymore. Obviously he’s not an adult so he can’t make all his choices. \nBut at that age you can’t really decide what a kids gonna do because if they really want to they’ll do it, no matter who says what.", "NTA. Co-parenting or not, not every single decision and event needs to be approved by the other parent. Only the major ones do or ones that will affect custodial time. Major decisions being, where do they attend school, which Dr do they see, which city to live  in, overseas and out of state trips. Stuff affecting custodial time like partipating in sports or boy/girl scouts etc as it may impinge on the other parent's parenting time.  Allowing the child to go on a trip during your time with his friend, that you have vetted during your visiting time is NOT a major life decision. Just like what you eat, who the parent dates, what clothes they wear etc are none of the other parents business until it is abuse or neglect. Expecting anything else is absurd.", "NTA.\n\nAnd tell your son - make sure he knows what his mom is trying to do.\n\nThen when he blows up at her and stops going to stay with her anymore she knows it is the consequences of her actions.", "ESH. You have a child together you both need to grow up and stop being petty. Just think of how great of a life your son could have had with out all the backstabbing and sniping? Be the people your child deserves not the person you think your ex deserves.", "YTA - she absolutely has a say", "NAH.  Mom has legit strong beliefs about whether her kid should kill animals/go out in the wilderness with ghod only knows what kind of supervision/handle guns/be with other youths handling guns.  OTOH, you legit trust your son, his friends, and his friends' parents to handle weapons responsibly, not do stupid things, and have all the proper licenses as needed.  Both are valid viewpoints.  Sadly, they are completely opposite, so there's bound to be a conflict.  \n\n\nBut be careful what you sow here, because you may just reap it later.  Are you really happy with saying you and your ex have NO more need to communicate about son?  You're willing to shut up and accept anything she does with your son when it's on \"Her time,\" without consulting you?  What if she decides to move to Spain?  Or enter him into an arranged marriage?  OK, these are kind of zany examples, but do you see the point?  You wouldn't like it if she did something extreme on her watch, and I bet you wouldn't just quietly accept it--just like she didn't quietly accept this hunting trip.  \n\n\nFinal thought:  Shared custody=he has time with Mom and he has time with Dad.  You took your time and sent him off with other people.   And didn't tell Mom.  Check the optics on that.", "NTA ; Hunting doesn't require a signed  permission slip from both parties , as long as they were safe about it and followed all rules  sounds like she didnt want  him messing with guns", "NTA, but you aren't doing yourself any favors.  Yes, assuming all laws were followed, and assuming there wasn't some specific clause in your shared parenting plan that forbade hunting, you were within your rights as a parent to allow your son to go on the hunting trip.  You seem to forget that being a co-parent goes both ways, and that there are some things to fight for and others to gain consensus.  You don't go into any details as to why his mother objected which may be relevant to whether or not you should be the asshole, though.", "I’m VERY pro hunting. \n\nYou should co-parent as best you can. How you treat your son’s mother is a blueprint for his future interactions. \n\nDoesn’t mean you need to agree or cave on every disagreement but you can have respectful dialogue. \n\nNTA for letting him go hunting.", "you are a legal guardian, you have oversight on your time. NTA", "Don't quote me, but I'm pretty sure as long as one person has the proper licensing. It's all good. So the parents. More than likely. And assuming gun hunting. Don't need a license for bow here. You do need the proper tags or what not though. \n Edit. He's 16 if he wants to shoot guns who cares. He's probably already driving a 2 ton murder mobile anyways.", "NTA", "NTA. You each can allow what you want during your parenting time, unless your court order stipulates otherwise", "It doesn’t matter if you were or weren’t the asshole, if your coparent is throwing down a hard boundary you need to discuss it constructively with her, and see why she’s averse to hunting and if you can reach a compromise. If you maintain you “don’t need to interact” you’re going to damage your sons relationship with one or both of you, and make your drama his problem. No judgement on if you’re the asshole because now is a time for compromise and collaboration….at least if you love your son.", "NTA. If she's like this over a young man doing a typical young man activity, then there's clearly a good reason you two are no longer together. \n\nTo oversimply things: There are 3 people involved here. Mother, father, and son. Son wants to hunt. Father says its OK. Son is also rated at OK by default, since he's the one who wants to go.  Mother does not want son to go, so not given an OK.   \n\n\nThat's two OK's vs one non-OK. Majority wins, sorry about your luck lady.", "NTA. Hes 16. If he wants to go hunting with friends then whats the big deal? You should have let his mother know just in the event something happens (not saying it would but just for the sake of her sanity and such). But so long as he has the right gun safety knowledge and is careful and has a good idea what hes doing it shouldnt matter that he went. The mother is being far too unreasonable.", "ESH ... Hear me out.\n\nI shoot paper, but live semi-rural with a lot of hunters.\n\nThe bottom line of the whole argument is this ... He's 16 years old.  In Canada, this gives you certain privileges under the law.\n\nThe primary one being the ability to drive a car.\n\nSafety?  Comparing a hunting trip to driving a car ... I won't bother to cite this because it's a no brainier that a 16 year old is far more likely to be killed in traffic than on a responsible hunting trip.  \n\nIn Canada, a hunting license requires a safety course and hunting course completed, and 16 is the base age.  It is not specific in the post either way, for this kid.\n\nParental control?  He's 16 and eligible for emancipation.  Yes, two years until age of majority, but close enough to be making his own decisions, within the law.\n\nSo ... Mom doesn't get veto over the kid's activities. What she does get, when he comes home, is the ability to influence his attitudes such that they are more in compliance with her own.  And, if it were Dad who wanted him to not hunt, he'd be in the same boat. 16 year olds aren't \"controlled\" (unless unreasonably) so much as talking them into something that is a value you share.  Sometimes consequences of other behaviors are required to correct behavior, but don't kid yourself.  In less than two years, they can walk out your door and never come back.  Pick your battles and how you fight them, carefully.\n\nHaving said this ... Dad's attitude of no-contact with Mom isn't healthy for raising a kid.  Especially at this age.  Teamwork to help with an assortment of issues will make everyone's life easier, and best benefit the child.", "YTA. You need to show a better example to your son that you can communicate with his mother and that you have a stable relationship. Lots of assumptions are being made however, I don’t think that it should be debatable that you tell her he’s hunting with friends and using a firearm. Not telling her is antagonistic and that’s even without your passive aggressive comments about her. You’re an unreliable narrator so I’m certain that you knew not telling her was going to cause conflict. Do better for your son.", "My divorced in laws have this outlook as well and you know what that means? They weren’t invited to my partners graduation. We eloped without either of them there. In future they will not be inviting them to baby showers, children’s birthdays, etc. All because they think that they don’t have to interact with one another. Smh", "Exactly thoughts.", "Driving is infinitely more dangerous than almost anything he will do his in life.\n\nSo that's a pointless concern.", "There are some things that can't be worked out (see the state of their former marriage as exhibit A).  Being a co-parent does not mean that every decision is a two yes/one no type of situation.  Some things the parent who has parenting time gets the final (and only) say.  This is not the hill I would have died on, and I don't think OP was wise in his decision or execution, but we can't say that everything must be solved by unanimous consent.", "The problem is, the mother of the child could have wildly different views on gun use and safety, especially when handled by a 16 year old child. With the prevalence of school shootings and mass shootings in the US right now, the country is sadly incredibly divided on gun rights. I am an American woman and if I had a child, I would not want them hunting, especially without my consent or knowledge. This would feel like a massive violation and betrayal of trust and safety.", "So if he did ask her first, and she said “no!” Hysterically, would he have to heed her opinion? It’s still ultimately HIS call during HIS time with his son. Like she could have been notified, yeah, but how can she actually affect the decision? It’s not her time, they are divorced. They are DIVORCED, IT’S OVER. If she had full custody, he wouldn’t be hunting. She didn’t get full custody, and they’re divorced. She cannot veto his decisions. If they were still together, ofc she could, but that is not available anymore. They are not 1 family anymore.", " Not really.  Portions of the custody agreements which state that parents need to be in agreement are for things like schooling and medical decisions, not with day to say activities or trips with their friends during the parents custody time.", "And this is why I'm voting YTA. You can't just send your kid out into the wild with strangers and no idea if anyone on the trip has gun safety training.", "Laws can be extremely lax in some places though and inadeqaute IMO. \n\nFor instance, in Texas a 17+ y/o can get licensed with just a 3 hour online training class. With the license, they would be legally able to lead 9-16 year olds without any further training and licensing. \n\nEven though it's perfectly legal, if I were the parent, I would be required a much higher proof of competency with firearm and safety before I'll let my child go on the hunt.", "Incorrect.  The ex does not have the right to veto activities of the child during the other’s custody time.  Veto rights only extend to medical and educational decisions.", "Even if it's overnight at a friend's house? That would be taking things too far. That would be pretty ridiculous and tedious for both parents.", "Custody rulings generally only require joint agreement for educational and/or medical decisions.  Everything else is for the parent that has custody at that time.", "No violation, as custody agreements don’t require that sort of thing beyond school and medical decisions.\n\nSo unless she (or her lawyer) went out of the way to ban hunting, there is no violation.", "You’d be surprised.  At 16 a kid only needs the permission of 1 parent when getting a passport (I had to provide a notarized permission form for my ex to get our youngest a passport, but not the oldest who had turned 16).  Same thing with the oldest’s drivers license, I didn’t need her sign off for it (I was the one that took him for the test).", "Why? it was his custody time.  I doubt she gave the father a headsup or phone numbers whenever there son went to a friends house during her time).", "Why should he?  It’s during his custody time.  Do you really think she told him everytime there kid went over to a friend’s house during her time?", "If the child wasn't 16 you'd have a point, but 16 is old enough to choose who you want to live with in most places. Could even get himself emancipated if he really wanted to.", "But to be fair the question is are they an ah for letting him go in the first place.", "It sounds like the child is legally able to make their own decisions about what they want, now, so what the parents want doesn't really factor in. This is not true in every state, but it is essentially true in some.", "I mean….call me crazy but yeah I would want to to be asked if my son could go on an overnight camping trip with someone else. Remember dad isn’t supervising, someone else is. I might let my son go hunting with his dad, but if I don’t know the people he’s going with? That’s probably gonna be a no from me.", "If that skateboard fired bullets, mom should probably be given a heads up.", "Both parents should absolutely have veto power on their child using guns. I can’t believe that’s even remotely up for debate.", "Not wanting your kid to be accidentally shot by his moronic peers isn't 'vindictive'.", "The mom wasn’t informed, that’s a large part of the issue.\n\nAnd those are very different things.  With hunting, a fire arm is typically involved, it’s very reasonable to want to be informed your child is shooting guns with people who know how to properly handle guns.  With skiing, it’s really easy to break your leg or get a concussion.  I have skied since my teenage years, my parents were separated and I was in the same situation with my mom not wanting to.  I was honest with her and after I presented my case I was able to the next season(was too late that season).  Was a bit angry but looking back I get it, you can get seriously injured and making me take the time to pause and consider the \n\nThe Mom isn’t vetoing, she wasn’t even given the chance to veto.  There was no discussion and there should’ve been.  A 16 year old can think for themselves, but does that make them qualified to vet gun safety? To understand the dangerous of skiing and how to ski safely?\n\nYour their parent, not their friend.\n\nHe c", "Exactly", "Can the kid legally buy a skateboard or skis?\n\nYes, he can. \n\nCan he buy a hunting rifle?\n\nNo. \n\nAs to a camping trip, his parents ABSOLUTELY should have say over it. \n\nAnd saying the father is the only one who needs to ok it…no. A hunting trip is fundamentally different from skateboarding down the street. \n\nThe kid is…a kid. His parents (both of them) are responsible for him. For something like overnight camping, hunting, or other significant activities, especially with neither parent going, both parents should be aware and have “veto” power. \n\nIt’s not going to cramp the kid’s life. If he wants to hunt that much, he can do all the hunting (or whatever other activities one of his parents objects to) he wants in two years when he’s an adult.", "I’m a mom.  I’m not a fan of hunting or any activity with firearms.  And I wouldn’t think I had veto power. In this situation.  But I’d want to know where my kid was and who he was with and what safety precautions they were taking with any of those activities.  If he’s skateboarding or skiing, where are they going?  Are they going to wear the appropriate safety equipment?  Does he HAVE the appropriate safety equipment?  Does he know which ski runs are safe for beginners?  Do they know how they need to store food safely to avoid attracting bears?  Is there an experienced adult along who his father has reason to trust?  Are they going to leave their intended itinerary with someone who knows when they are expected back and can alert authorities if they disappear on a hike?", "You are not free to do whatever you want when you’re 16. \n\nIf his mother doesn’t agree, he shouldn’t go. Period. In two years, he can do whatever he wants, but until then he is the responsibility of his parents. \n\nConsider this; he makes a horrible mistake and shoots/kills someone. Who will be legally responsible?  At 16, he will hear more responsibility than if he was 6, but his parents will still be responsible, as well. \n\nWhy?  \n\nBecause legally he is a MINOR. He can’t legally purchase the gun, for one thing. \n\nEven at 17, he can’t just do what he wants. \n\nSay he wants to join the military; until 18, he has to have parents permission. I could list dozens of things that fall into this category. \n\nBottom line: both parents have equal say, or should. Hunting is just the present issue, the overall issue is the parents and them not working together to parent this child.", "That is a reasonable expectation (communication and cooperation regarding co-parenting), though I concede it doesn’t happen often. \n\nI don’t see it as his ex controlling him, she’s controlling what her child is allowed to do (which is perfectly reasonable for a parent), and her request to not have her child hunting is well within the boundaries of what a parent can dictate to a child. \n\nIf the other parent disagrees, married or otherwise, they should be adults and work out the differences before allowing/not allowing the child to do whatever.", "Some areas of Europe -- the UK for instance after the Dunblane school shooting -- have pretty tight gun control. It is conceivable to me that my kid would go hunting with friends. My husband grew up in the countryside and used guns, but it's nothing like as common as in other areas of Europe, or the US.", "Yes, but my point is, nobody is required to care about your “much higher proof.”", "Yeah I think the Y T As are missing that the mom has less than 2 years max of having any say in what this kid does. When he's 18 he can leave her house and never go back. He's at the age where if the dad petitioned for a change in custody because the son wanted it, it'd very likely be granted. \n\nSon should have some gun safety classes if he is going hunting but the mom is waging a losing war here the closer he gets to 18.\n\nAlso telling a teenager he can \"never go hunting again\" is just fanning the rebellion flames lol.", "Well we **are** talking about killing for sport, so *everyone* involved is going to be an AH.", "that's the way OP phrased the question to us, yes.\n\nBut his wife didn't fall him an asshole for that, she called him the AH for not informing her.", "It’s 14 in my State.  And based in the OP’s post it’s at 16 (or less) in his.", "Communication is one thing asking for the ex-spouses blessing is an over reach from Mom though.\n\nDivorced parents obviously don’t have to agree on everything and every way to raise a kid. \n\nOP is NTA because ex-wife isn’t just communicating, but demanding things are her way.", "The options for compromises are very slim, either he goes hunting or he doesn’t. Considering she doesn’t want him to go hunting at all anymore, she is going out of her way to try to exercise “veto”", "The mom could be just saying this to cause more conflict though. If it was a more a more dangerous activity I would see why the mom would bring it up.", "[deleted]", "Right?! Bloody hell, it’s not the same thing. Guns should not be a hobby. So twisted. Skateboarding etc carries risk…but, more than guns?! Mmhmm.", "A 16 year old is old enough to hunt. I can't believe THATS even remotely up for debate.", "The kid went with adults. Jesus Christ he’s probably more likely to die on the ride to the trip than the trip.", "You have to attend a hunting safety course, and you can't get a hunting license without showing proof you've completed it.", "Would you make him discuss if he wanted to get a ride home from school from another parent? Because he's more likely to get seriously injured in a car crash than a hunting trip.", "Why should he tell he ex about every little thing that he lets his son do during his custody time?  I very much doubt she told him about every single sleep over their son went on.", "When two people are co-parenting, they should care about what the other person thinks on a lot of issues. \n\nThere are a multitude of things that are legal with consent of one parent, but I think should still require both parents to agree or at the least, be aware of. Such things could include:\n\nDrinking \n\nSmoking \n\nAccess to personal cell phone \n\nAccess to firearm\n\nLeaving the child in care of someone else for an extended amount of time\n\nTattoos\n\nMedical procedures like abortions or gender affirming care\n\nExtended travels", "There is a difference between an adult keeping control of a firearm, and allowing a minor to use it in a controlled situation (like hunting).\n\nAnd gifting them one and letting them have free access to one. \n\nThe former teaches respect, the latter is asking for trouble. \n\nCultural and legal situations vary, but from the context of story this is likely the US in an area where forearm ownership is normalised. The way presented the EX was more concerned about not having control of this decision then an abhorence of firearms.", "You make the mother sound like a controlling monster but she's just found out her child went to a location she had no idea about, with people she possibly never met and in a potentially dangerous environment, she has ever right to freak about not knowing anything about this.  It would've been very simple to sit down, tell her he wants to go, he'll have his phone, keep it charged and let her know if anything happens", "Probably most of the Y T A people saw \"hunting\" and couldn't type the letters fast enough.", "I'm not trying to be argumentative, what you say seems valid. The thing is, we've made the ecosystem so wildly unbalanced that without hunting- keeping say, the deer population at a certain level they *all* risk starvation.\n\nI forget what year here in PA animal rights folks won something ( I forget exactly how it worked ) about numbers. It was beyond tragic. Dead deer, starving deer stripping bark to eat, killing trees and dying anyway. Never saw anything like it and hope I never do again.\n\nOverpopulation is insanely cruel. We've already screwed up the natural balance in a dozen different ways. Hunting keeps it inside a limit where they can live and thrive.\n\nAgain. I'm genuinely not being combative or a jerk. There's just a lot more to it than killing for sport", "I've never hunted in my life and most likely never will, but assuming that they eat what they kill and hunt responsibly in the proper season, they are putting animals through less trauma than purchasing meat through the factory farm industry, and may actually be doing a service to cull populations that could otherwise get out of hand and cause negative environmental repercussions (i.e., keeping deer populations low enough that they, as a whole, have adequate food and aren't overgrazing, or culling wild hogs that can cause lots of problems otherwise).", "Not necessarily. They could compromise on kid having a gun safety course first before going, or discussing gun safety, etc. Communicating about their stance on guns and why. All things that could be good input prior to hunting.", "yeah in terms of the decision sure, but the fact of not discussing it is the issue. there was no say. like i said, they can discuss it and choose what to do after - including sending him anyway.\n\nhe could ease her concerns and answer questions. i personally would want to know who my kid is going with, how long/where they were going, what will be hunted, and their experience levels with said guns.\n\nif i didnt know these people or how good their safety is, i wouldnt want them going. if i knew they are going to a place where they can quickly(ish) get help and they know the family well, id be more likely to let them go without a fight.\n\neither way, whatever op does will affect how she treats him too. if he takes her choice out of the matter then any consequences he will have to tolerate. he seems to already not care, so why ask on here if thats the case? \n\nremoving her choice on something she feels strongly about isnt exactly going to make her an easy coparent. if he already is annoyed by this, he will be annoyed further and he will have to deal with the consequence of his actions, including if he got hurt. he wouldnt hear the end of it", "That's not really true. I think requiring the son to go through a well-regarded gun safety course first would be a completely reasonable compromise. I also think talking to the family hosting and requesting the son not be out of sight of an adult while holding a firearm is also a reasonable compromise. I think only allowing some kinds of firearms but not others could also be a compromise option. That's three different compromise ideas I came up with right away but I bet there's even more options I haven't thought of. Oh, just thought of another - have the son text her every time the firearms are brought out for use (including how long they're expecting to have them out) and again each time they've been put away safely.", "Also, say ‘he can go with Mr. Bob Psmith, who I know is a responsible gun owner, but not Uncle Roger, who is an irresponsible drunk’.", "she could, but he isnt much better.\n\ni dont think its all that safe personally, especially with no other details about who he is going with. i would want to know before he went.", "Hunting is a dangerous activity. This isn't bowling", "As a person that's spent years of my life doing both, you're right. You're VASTLY more likely to get hurt on a skateboard than out hunting.", "Ive never hurt myself with a gun but have gotten hurt on a skateboard. Guns can be dangerous but treated with respect and care there shouldnt be an issue. You just are not used to them so they are scary but there are a number of guns that id say are pretty safe for a sixteen yearold to learn to use. \n\nI could say that cars shouldnt be given to sixteen yearolds because that seems a lot more dangerous to me than a 22 or a 12 guage.", "I think shooting can be a hobby.  Going to the range and shooting, et cetera.  I’ve done it.\n\nI think hunting as a hobby would be sort of fucked up.  Hunt for food, solemnly, not for some weird joy of killing and taking pictures and trophies.  \n\nBUT… I think in either case, shooting range or hunting, it is a very dangerous activity that needs to be handled with care and responsibility.  In the same category as the other activities the previous comment listed:  motorcycle riding, hang gliding, skydiving, I’d add scuba diving into the mix.\n\nThose are fun activities that people do every day without issue.  99% of the time, everything goes fine.  BUT there are big risks present, just like any activity that involves a loaded gun.  And therefore training, care, and responsibility are involved.\n\nHe’s 16, he’s old enough to hunt.  He’s also old enough to drive a car or even go on a trip alone with his friends.  But these are big steps that require responsibility and care going into… so these are just the sort of things both parents should be on the same page about.\n\nIt’s not the activity that’s wrong, it’s the lack of communication.", "If both parents are good with that, absolutely", "Neither of us know if, or how well, she knew the adults, or how involved they were going to be or whether or not the adults were also morons.\n\nBeing cautious about your kid's safety is a parent's job and if you don't like a person's boundaries over those matters then don't make a baby with them then cry when they parent that baby as they see fit.", "I'm curious, where do you live that you need to go hunting?", "And there are a lot of places that adults take kids on hunting trips without the license or know the person who issues them and get it rubber stamped. \n\nAnd the kid might be taught the safety lessons, and then be with adults that don't enforce them.", "Europe's far more urban and centralized than the US is so I'm sure that plays a role in the average perception. Urban Americans aren't exactly known for being into guns either.", "Of course it depends on the country. I'm talking about the tendency for Europeans to not have the first clue about their own gun laws and honestly believe civilain-owned guns just don't exist in their country. And this is essentially never true. Even the countries with the strictest firearm control on earth permit specific shotguns and rifles because, as hard as this is for most people today to understand, people who live rurally and need to defend themselves and livestock from predators still exist.", "Yeah, my family is from Oklahoma and are all super into guns, but my cousin and his friend were hanging in the woods as kids with air rifles and my cousin took a pellet to the eye and lost that eye. It's honestly BS for people to assume that kids who grow up in gun culture are going to be safe, they need to be supervised. Kids have poor impulse control generally, which is normal developmentally.", "Especially since the part of custody agreements that require the parents be in agreement are for schooling and medical decisions, not day to day activities during a parents custody time.", "No there are more than one country where this is possible. Too many actually. The world does not revolve around the USA.", "She should have been told, certainly, but forbidding a 16yo from going on any future trips of the sort when the dad doesn't agree is a recipe for failure.", "That's what happens when you kill all the predators because you loose a cow or chicken every now and again...", "Show me a hunter who hates doing it, and only tearfully picks up his weapon for the good of the ecosystem.", "i didnt think of that, thats a pretty fair compromise imo.", "You have to take a firearms safety course before you can get a hunting license under 18 in the majority of states. Just an FYI.", "If he is hunting under the age of 18 [most states required both a firearms safety and a hunting etiquette course](https://gothunts.com/hunting-age-requirements/) so it’s likely already done", "At 16, OP’s son is required to have a hunting license, which generally already requires a hunting safety course.  If that requirement was fulfilled then there is no issue in him allowing his son to go on the trip.", "If he is hunting under the age of 18 [most states required both a firearms safety and a hunting etiquette course](https://gothunts.com/hunting-age-requirements/) so it’s likely already done", "Thats some absolute nonsense....", "It's not though. Hunting is statistically much safer than a lot of other activities that no one would even bat an eye over. People are just touchy with anything gun related and that's all this is. Hunting is aggressively regulated, very little actual shooting happens and very, VERY few game animals are dangerous to hunt.", "I think that is beyond just the likelihood of getting hurt and more the severity of injuries. Sure, you may fall more on skateboarding, but that primarily leads to scrapes and bruises, with fractures occurring less so. With a helmet, head injuries should be minimized, which is the greatest danger. The more serious injuries often come from doing more difficult tricks, so most injuries in a normal course of skateboarding aren't life-threatening. \n\nHunting, however, may have fewer injuries, but if there is an accident with a gun, you are much more likely to need serious treatment and a higher chance of injuries that could be life-threatening. Both have risks, but just because there are fewer incidents doesn't speak to the overall risk of danger. There are sports that have more injuries in terms of amount than (American) football, but people will focus more on injuries in football since the injuries they do have will often involve the head or neck, which makes them more serious and dangerous than a twisted ankle, for example.", "And what are the nature and level if injuries? And who are the adults present that can provide safety, or first aid? How close are you to emergency services when hunting compared to skateboarding? \n\nI support hunting and even teenagers hunting, but from your comments I would never trust you with a kid hunting because you lack respect for the risks involved.", "And both parents should be involved in the conversation about what risks a kid should face. If the mom does not know or does not trust the adults the kid went on their first hunting trip with, that is a big deal. The mom was not allowed to be a part of the conversation on how to make the situation safer.", "I'm not against the discussion, particularly if they're still together or on good terms with each other. But that's not always the case and clearly isn't here. The kid was 16 and OP had custody.", "By that logic he can't take an Uber without asking for her permission since she doesn't know the driver and has no clue what kind of driver he is.", ">And there's zero indication the kid had followed the appropriate regulatory guidelines in order to procure his license\n\nMany states require showing your hunters safety course certificate in order to even get the hunting license if you're under a certain age.", "Nowhere where hunting is a need, but the upper Midwest", "Absolutely. Though I'll assume op is a hunter and knows these people well and how to screen.", "youre not wrong, but i also think the area also depends in the US too lol. most arent known for it, but some areas are xD\n\ndefinitely makes a pretty big impact though, youre right.", "i hear ya and what you mean, but this person seems to know that its super illegal where they are and their laws.\n\ngenerally you may be right, but specifically, i dont know if thats the case here. theyre saying about giving them to a teen for hunting, not civilians (mostly adults) protecting themselves.", "And it sounds like this isn’t even a kid who grew up in gun culture either! I’m sorry to hear about your cousin, btw.", "You made a false comparison that was not valid and now you are reaching to justify it.  Very weakly.", "That's assuming they get a hunting license. I'm from a big hunting state. Trust me... Especially in the backwoods; not everyone does. OP makes no mention if his son did, so we can't assume that.", "multiple people have said this, but what if they didnt include the kid on that? like for example requiring a fishing license for yourself and bringing extras along? some people do that kind of thing with guns too.\n\ngreat to know, but sadly may not be great in practise if they are in certain areas.", "What part do you think is nonsense? Which suggestion, in particular, is a bad one and why?", "I'm not saying to not hunt, but to pretend like it isn't dangerous violates the very rules of gun safety and means you should not be allowed around a gun", "That's fine. You don't know anything about me so you're allowed to have any wrong opinion you want. But the objective fact is that in a lot of instances, you're not really THAT far from some kind of emergency services when you're hunting unless you're on a trip that specifically goes way off the beaten path. And we don't know that that was the case here. Where I live, most hunters aren't that far from either a town or at least some farm houses. And you can assume that because a gun is involved then that means automatically the dangers are worse but that's not true across the board. A lot of skateboarding injuries aren't severe, likewise, fatal hunting accidents are statistically rare. Much more so than major breaks, concussions, paralizations from skateboarding.", "Co-parenting requires communication, shocking isn't it?\n\nI think if my ex thought putting our kid in an Uber was exactly the same as sending her out into the woods with strangers and a rifle I'd probably lean towards making all the parenting decisions myself too.\n\nLuckily he's not an imbecile, so it's never come up.", "In fact Uber requires riders who are under 18 to be accompanies by an adult.", "Uh, the midwest of where haha \n\nIf you don't need to hunt, why would you do it? How is it legal?\n\nWhere I live there is like, some culling done of some species I think, and farmers have some rights to protect livestock. But there are laws about numbers and how the animals can be killed and disposed of. \n\nAlso it would be very illegal for a child to have a firearm here, even if they grew up on working land. The idea seems very alien to me so I hope you don't mind me randomly asking!", "Its wild to respond to someone saying we don't know a bunch of info, is making the assumptions", "No I'm saying those are all valid questions and reasons why it shouldn't be up to only the 16 year old and why it's a valid concern for the mom to expect to be consulted . All I said is that this info isn't included anywhere that's not making any assumptions thats literally saying there isn't enough info", "And not both parents need to co sign those trainings? If op had similar requirements then he probably broke the law as no such training was mentioned.", "No one is pretending that there aren't ANY dangers involved. But you're pretending that hunting is this crazy thing with bullets flying everywhere. You obviously know absolutely nothing about hunting or safety because vitually every single hunter course talks about how import it is for children to taught the proper etiquette and safety.", "And yet you're vastly more likely to get hurt riding in a car than you are while hunting.", ">Uh, the midwest of where haha. \n\nSorry, the United States lol. \n\n\n>If you don't need to hunt, why would you do it? How is it legal?\n\nFor sport and good, fresh food. And in some cases where there are no natural predators, population control. \n\n>Where I live there is like, some culling done of some species I think, and farmers have some rights to protect livestock. But there are laws about numbers and how the animals can be killed and disposed of. \n\nThere are here also. Depends on the location. Every state has different laws. \n\n>Also it would be very illegal for a child to have a firearm here, even if they grew up on working land. The idea seems very alien to me so I hope you don't mind me randomly asking!\n\nYou probably know already how core guns are to rural culture in the United States. \n\nBut yeah you can't just give a child a gun here also. Every state has different laws. In my state you can hunt deer at 12 and 13 only if you have taken safety classes and are with an adult. You can go without one starting at 14, but it's super uncommon. You need a vehicle to transport your kill and you need to be 16 to drive. \n\nAll of this is strictly licensed and regulated. You can only hunt in certain locations at certain times of the year etc.", "No, it's not required for both parents to give permission. And OP didn't mention going hunting, so regardless of whether or not he had gone through the courses, he hasn't broken any laws here.", "Don't change the subject, you are downplaying thr danger. I never once said it was crazy dangerous, your mentality of downplaying it makes it more dangerous. Treat, never, keep, keep are the cornerstone of safety for guns.", "same goes for most other activities listed. you can protect yourself, and the more common injuries are pretty minor.", "Certainly by numbers more people are injured in car crashes. But then more people drive than go hunting with children.\n\nTypical gunshot injuries are far worse than the typical injuries of a crash in a modern car (mild whiplash, bruises).\n\nBut also, it only matters if your co-parent has the same attitude as you do. If they were paralysed in a car accident as a teen or lost a sibling to a shooting accident, they might not have a completely numbers-based approach to those matters when it comes to safety. \n\nI've been a co-parent for 17 years so I feel confident in saying that this is absolutely a matter that needed discussion, as evidenced by her having an issue with it. We all make mistakes, he could've just apologised and agreed to consult her in future. But no, he's on fucking Reddit of all places, crying about it. He can whine all he likes. If he doesn't like it he should've kept his dick dry.", "One of those 2 things is necessary, one of those two things isnt.", "It doesn't matter if he does or not for my point - that the mom wanting to have a say and be consulted beforehand is reasonable . Regardless of the answers - her wanting to be in the convo os reasonable", "I see the point as OP needed to clear all that up with the kid's mother beforehand, not with us random redditors after the fact.", "\"All of this is strictly licensed and regulated. You can only hunt in certain locations at certain times of the year etc.\"\n\nThat part is so important. A lot of people don't understand how heavily regulated hunting is.", "You said the course is mandatory for the kid and they went on a hunting trip with ammunitions being refunded. Why else wohld they need ammunitions? \n\nSo how could it be mandatory without breaking the law?", "Unless it’s stated outside of the original post, there is no evidence to indicate that the kid had this license.", "I'm not downplaying it, but I refuse to let you overblow it. We're not talking about little kids playing with guns. We're talking about a 16 year old going with his friend's family. If you're even remotely versed in hunting then you know damn well that, depending on what they were hunting, they might not have even fire a shot the whole time they were out there.", "No one would bat an eye at the kid going swimming with the his friend's family but he'd be much more likely to drown doing that, than he is to get hurt going hunting.", "You sound like you are arguing just to win the argument at this point", "Hunting is still proportionately safer than riding in a car.", "Neither are necessary.\n\nI get that hunting can seem risky to people who have never had any experience with it, but it really is safe. You can't even buy a hunting license in the US without providing proof you've completed a hunter safety course.", "Depends on their relationship and legal coparenting agreement, she could easily say no just to spite him.", "Definitely, should be more regulated imo, but that's another conversation haha", "It's mandatory anyone to who wants to get a hunting license to go through a state certified hunter safety and training course. Regardless of your age, you have to have gone through one to get a license. That being said, children don't HAVE to have completed it to go hunting, as long as they're A: 16 or under **AND** B: accompanied by a licensed adult.", "And there's no evidence that he doesn't. Call me crazy, but there's generally not a lot of groups of people going hunting without licenses.", "YTA. You sent her MINOR son off with people she doesn't know, to a location she doesn't know, with firearms....in what world is that ok? Hunting accidents are often fatal, and he is a CHILD. While he is a child she has EVERY right to veto an activity like that, and to know about it in the first place. What the actual hell were you thinking?", "YTA. The women are right here. \n\nNo matter the age of the child, you still need to coparent.", "NAH for the trip, assuming your son has had training and understands gun and hunting safety.\n\nBut I would say you're both acting like AHs for not co-parenting and your comments to that point.  Having two completely different rule sets between homes is not good for your kid.  There should be a set of basic rules that you both respect and enforce.", "YTA, slightly. \n\nThe kid still needs both parents making good decisions for him. A 16-year old will make bad decisions if he's allowed to (drinking, racing cars, getting into trouble, etc.). \n\nAnd if the kid has not been around guns before, he really could hurt himself or hurt someone else. At least one parent is needed to understand the situation and make a decision.", "NTA", "YTA. She’s always going to be the mother of your child. Until he’s an adult, you both have equal say over decisions about anything that could potentially be dangerous. Whose house he’s at in the moment is actually irrelevant.", "YTA. Don’t send your minor child on a trip you are not on, with fucking guns, without consulting the other parent. And your response to his mother is also weird and unpleasant. You are both LEGALLY responsible for him, until he’s 18. The fact he can drive or pick where he crashes doesn’t change that. \n\nSo yeah, if he was being irresponsible and shot someone on that trip? That’s both your asses in court, getting sued.\n\nGrow up and co-parent your child.", "YTA", "YTA for refusing to have a conversation with your child’s other parent before letting them go off on a trip to the woods. How experienced is your son in the woods, how experienced is the other family? How well do any of them know the area they were hunting in? Has everyone that went taken a hunters safety course? Did everyone know first aid? Did anyone know first aid? What was they safety plan if something happened? How well do you know the other family? Did you have contact numbers for them? Have you met them? Where did they go? What if someone went missing? \n\nThe guns and the hunting aren’t the only dangers of a hunting trip. Other injuries can and do happen.  \n\nAs a parent it’s your job to think in worst case scenario and mitigate that risk. You balance the risks with your kids learning independence and having new experiences. You communicate with the other parent when those risks can involve your child going missing or being hurt. Your kid isn’t grown you don’t get to just ignore that they have another parent who loves them and worries about them. There are going to be times you need to communicate with them. Overnight trips away with friends are one of those times.", " YTA\n\nPerhaps a heads up when her child is going to kill things might be a good idea.", "She sounds like a controlling nightmare. Good job for leaving, NTA", "Jfc the sub should be called\ngroup therapy Corner.", "You know, divorced folks rarely understand that even tho the romantic relationship between you and your spouse is over… you’re still tied to each other for life if you have kids. Don’t put the kid in the middle. You want to be there for weddings, grandkids and holidays. You might be pissed at her but like, your kid doesn’t need to deal with that. YTA for not discussing it with her, and for acting brand new.", "YTA consult the mother of your child before he takes part in an activity involving loaded guns", "YTA for not letting your child's other parent (who sounds like they're still involved in your son's life) know that your shared child was going out of town so that they could be aware of where your shared child is when the child is not with them or you.", "YTA.  People actually get shot, and occasionally die, while hunting.  It's very possible that the reason your ex doesn't want your son hunting is because she's terrified of that happening to him.  A quick convo in advance could have sniffed out and quelled your ex's fears and your son would still have been off hunting safely.  Your GF is right - make nice.  Your kid is 16 - it's still VERY important to co-parent.  Teenagers are really good at sniffing out and exploiting weaknesses in the adults in their lives and can get themselves into a LOT of trouble in the process of just trying to get some freedom.  Don't think for a split second that he won't use this to his advantage to do things YOU don't want him to do when he's with his mom.  You two need to get on the same page and stay there until he's an adult.", "Info: what has your child been taught about gun safety?? Did this hunting trip include a class??", "YTA \n\nMy husband and his ex-wife have two kids (1mid 20’s and 1 early 30’s) and they do a better job of co-parenting than you are now.  They will always be your kids and when they turn 18, you will still be parents.  I hope your gf runs for the hills now that she’s seen a preview of how you will eventually treat her.", "Nta. It's call parallel parenting. You do what you want at your house, I do what I want at mine. As long as there is no abuse it is a perfectly valid parenting style. \n\nAlso, kids start hunting here around 5 or 6.", "YTA she's also his parent and should have at least been told he was going on this trip. Believe it or not, whether your together with your wife or not you do have to co-parent.", "NTA.  At 16 the kid should he able to start making his own decisions.   Moms is treating this kid like he's a child.  If he's not drinking, drugging, impregnating or hurting anyone, then he should be given the freedom to grow up with yall there to help.  I think you could have come up with a better way of saying the whole custody thing but you're right that your separate entities now.  But GF is also right that it'd be better to just apologize and promise to consult her in the future, even if you don't mean it.", "Experienced hunter here. She may be worried about safety. Hunting is actually one of the safest sports with a very low injury rate. If I had children, I'd rather have my children go hunting than play football. Just make sure that your son is knowledgeable about proper gun safety and that the people around him are safe. You can find statistics on Google for the injury rate of hunting vs. other sports. It may put her mind at ease if you show her this.", "NTA \n\nYour son wanted this trip. He'll be an adult in less than two years, and it's good to show him that you trust him and will let him be happy before he has to go off and do adult stuff. It sounds like everyone was safe. Your ex won't gain anything by spitefully trying to block your son from doing something fun.", "INFO: What firearms safety training has your son done prior to this? Are they familiar around handling firearms? Have they taken hunter training courses? \n\nI’m leaning a bit more towards a soft Y-T-A, because while she doesn’t get to dictate what happens on your time, there is a risk that comes with hunting. Accidents happen, people can be stupid/careless, and things can go awry quickly. Had the worst happened, and your son was hurt and rushed to the ER, that’s not something that should be a surprise. A simple “Hey, son is going hunting with XYZ family just so you know.” Would’ve gone a long ways. \n\nAdditionally, how familiar are you with this family and how they treat firearms? I always hope people are responsible owners, but that’s not the case. I know quite a few folks I avoid interacting with when guns are involved, as they treat them recklessly.", "If these gender roles were revesed, Mom letting son go, dad being mad.. I believe this would be overwhelmingly NTA. But Reddit is so set on backing the woman in everything. \n\nAs a Mom who Co-Parents with my ex... you need to co-parent. you should have spoken with her. \n\nAs his Dad... you are his parent too. you can make decisions too. You are not the asshole for letting him go.. you are the AH for \"here's absolutely no need for us to interact with each other anymore. I told her as much\". guess what.. he is not an adult till 18.. you still have to coparent. dont be a JA.", "YTA. Hunting can be a dangerous activity for a person of any age, let alone a teenager. Even though this decision happened “in your house”, it’s essential that you communicate with the mother of your child before potentially putting your child in a dangerous situation. Also, guns/hunting can be a pretty controversial activity so checking in with the mother is mandatory imo.", "Title is misleading. You’re not the asshole for letting him go hunting, it’s 100% how you dealt with it afterwards. Totally a dick move. YTA", "I think it's the kids choice for if he wants to tell her or not he has the right to choose. Op you should have just told her that your son is going hunting", "YTA \n\nI think both parents should get to weigh in on an activity that involves guns. Accidents happen while hunting and it would be a nightmare to find out something happened to your kid when you didn’t even  know he was hunting. \n\nAlso, you do need to communicate with your ex because you are coparents. You only have two more years of this, suck it up.", "NTAH, tell your ex to let your son grow up and cut the apron strings.  Hunting is a great experience for some kids.", "NTA\n\nI don't come from gun culture, like, at all, but this to me is a no-brainer. It's not a big deal. Your ex is being a shrieking harpy. It was your time he went on the trip. Done deal. There were responsible adults on the trip. I consider it to be no more of a thing than going camping. And again - I'm not part of gun culture at all. Your son is in far more danger riding in a car than he is going hunting with his friend and his parents.", "You know, my husband was given a .22 at the age of 8, and spent all day out on his horse hunting, by himself, cooking up his own meals on fires he built by himself, seasoning his meals with a pouch he carried and with wild onions and greens...I was also safely handling a rifle by the time I was 10. It's a very different scenario if this 16 year old had no hunting experience, and if the dad and 16 yr old had never hunted with the family that the 16 year old went with - because, honestly, there are some people I wouldn't want to hunt with, and its importantto know that before sending your kid off with them. Op doesn't really give that info...", "YTA. And I'm not saying this because I'm anti-hunting. You and your ex are going to disagree on some things, but you should try to act like a grownup and put up a united front for your son. \n\nLet me ask you this. Suppose your ex had no problem with a teen smoking pot recreationally. You have a big problem with it. Should she be allowed to let her son smoke during the time he's with her? No? Then you should understand why YTA.", "YTA, not for letting him go originally, but for saying that you and your wife no longer need to make decisions together regarding your minor child. He'll be a legal adult in two years, but until then, you and your ex do still have to have some sort of relationship. (And, if he goes to college, the two of you will both be considered for financial aid purposes, and you will need to work out how to pay for his schooling together.)", "YTA. You are co-parents, you still need to talk things over.", "I will not judge since I feel there are a lot of cultural differences between me and op. Any other activity I would say NTA. But giving firearms to a child and have the child kill a living being is a huge deal and I understand if the mother feels she needs to have a say in that decision. Yes the child is nearly an adult, but using a deadly weapon is not a trivial thing and both parents should agree on it or the kid is not allowed to do it till they are old enough to buy the gun themselves.", "N.T.A. for letting him go hunting, or for not asking the ex first (I personally don't view hunting as a activity that requires preconfirmation of permission from both parents, but that may just me), but your response was what made YTA. I would say maybe you should have asked her why she didn't want him hunting and have a reasonable conversation rather than saying she has no say when he's at your house. That's just not true. If she let him get unnecessary cosmetic surgery without asking you because he was at her house would you be okay with it?", "NTA technically but your girlfriend is right. Just because your son is older that doesn't mean you don't have to be civil and cooperate with your ex anymore. Like it or not, as long as your son lives every holiday and life event for him will include his mom. So if you want to be a part of things like a wedding or grandkids and Christmas or other holidays in his future you have to grow up and learn to cooperate with your ex.\n\n Otherwise you're shooting yourself in the foot because eventually your son will get tired of the bickering and will have more important priorities than dealing with this nonsense.", "Probably unpopular, but NTA.", "NTA. Your ex wants to deny your son the agency to make his own decision to be a hunter. You should make clear to ex that this is your son's decision and neither parent has much of a say in the matter.", "NTA but should have given her a heads up.", "NTA, your ex is just mad she doesn't have the same level of control she used to. At 16 he is definitely old enough to decide himself whether he wants to go on a hunting trip or not. It's your custody time, not hers. She can enforce her own rules on her own time.", "YTA  \nNot for just letting you son go hunting but for not talking about something THAT big with his mother. Even if you guys are not together anymore you are co-parenting them until he is 18 PERIOD! And I would bet if she let him do something at HER house that you didn't approve of you would s\\*\\*t bricks.", "NAH \n\nThe mother just worried about her lad, but he aint a little boy anymore and he can go hunting. It's good for him to get from fresh air and time in the wilderness.\n\nI mean you could have told her first, but a boy should have the right to go on a hunting trip without mommy writing a permission slip so long as dad is on board.\n\nI'm sure he will have a great time. Maybe communicate a little better in the future about this sort of thing, but I'm not gonna go with anyone being an asshole here. Just a bit of miscommunication and a mother being a little over protective.", "NTA. It sounds like he had a good time with his friend, he's 16, not a small child. I have fond memories of going camping and hunting and on other adventures with my friend and his family when I was around that age. When your kid is under your supervision it is your choice what they do.", "NTA, mom is.", "He is 16 for pity’s sake! She sure is uptight. You’re NTA on that count. But your girlfriend is right. Do try to make nice with your ex.", "YTA for the way you treat the mother of your child. You absolutely should be a unit when it comes to parenting as you SHARE A KID. God, you sound like a nightmare.\n\nN.T.A. for letting him go hunting. But absolutely the asshole for not at least discussing it with your ex or even letting them know.\n\nTry co-parenting better. You sound bitter.", "Eh. I actually agree. Unless it’s something illegal going on, my ex does with the kids at his and he can stay the fuck out of my business when they are with me.\n\nI interact only when necessary…especially at the point when they are a teen. \n\nI’ll update him on big things or school things, but my kids are old enough now that they can communicate things to their dad they want him to know.\n\n It’s important to me for my kids to know that their dad’s feelings/actions are NOT my issue nor responsibility.\n\nI have boundaries and they are old enough to understand that", "I’d say the fact that it’s hunting is part of the issue. There’s travel, he’s likely out somewhere remote, it can be dangerous (both because of environmental things AND because there are guns present), etc.\n\nSmaller stuff? Fine, whichever house he’s at gives permission. But bigger and riskier things should have both on board. \n\nYTA", "As a divorced parent who had to try and co-parent with a vindictive narcissist, No. Just no.\n\nHe tried to monitor every decision I made at my house with just this sort of 'consistency' bs and the judge shut him down hard - because I had to GET a damn judge to get him to stop. My house, my rules. his house can have his own rules. We exchanged info on appointments and other parental-involved dates, but that's it.\n\nAnd that means that, no, he didn't ask me before taking my kids hunting. But my kids let me know they were going and I made sure they had all the safety preparation I could get them. Did I like it? No. But his house, his rules. And I had to trust that I had done MY job of preparing them well enough to counteract their father's bad decisions (of which, taking them hunting when he did was not even the worst of them).", "I’m an American. I didn’t big game hunt, because I hate outside/being cold/early mornings. But I did get my first BB gun at age 7 and used to shoot grackles (big asshole birds) in the yard.\n\nMy dad was a deer hunter every year. And my parents would have never let me go with anyone they didn’t personally know and had seen exhibit good gun safety, or talked with about their philosophy and precautions with guns.\n\nGuns are like heavy machinery. They’re a dangerous tool, but a useful (and expensive) one. You don’t deal with them lightly.", "Also european with very strict gun laws. My son started shooting at 10 with the army cadets, by 15, he was a qualified level 2 rifle instructor. He was trained by qualified and knowledgeable people and I had no problem with him and his friend shooting pigeons, rats and rabbits on his friend's farm. He also taught my daughter to shoot bb rifles at cans in the garden. \n\nIf he was going hunting, as his mother, I would still want to know the safety precautions in place and that he would be with responsible gun owners and users.  As long as the potential catastrophic dangers were mitigated then absolutely he could go. \n\nThis may not be about depriving the kid of an experience, but more about his Mother being worried for his safety.  \n\nOP needs to be an adult, and have that conversation with her.", "American here. I had my first gun lesson at 16. That's definitely normal in certain parts of the country (typically rural areas).", "🙄 you do not have to tell the other parent if you child is going with friends while on your time LMAO.", "Agreed, and I’m sure there could be compromise to be found like getting him proper safety training with firearms. If she took their son to do something he considered dangerous without telling him, he’d react the same.", "Lol nah. She has a say at her home not her exes. The kid is 16 and doesn't need to see if mommy is ok with it.", "So does OP have to tell his ex when the teen showers, eats, goes to sleep, walks around, gets on the phone.....", "What is wrong with you?", "TIL band trips with trombones and triangles have the same level of safety equivalent to hormonal teenagers handling deathly weapons\n\n...\n\n..........\n\n¯\\_(ツ)_/¯", "Incorrect if it's not in mom's home she doesn't have a say.", "This is exactly my question! Does the ex let HIM know what son is doing while in her care or is this an “I’m the mother so I’m the only parent that matters” situation?", "...so because driving is highly unsafe we should ignore all other safety concerns from handling real guns with live rounds?  I fail to understand your logic on why its a pointless concern when there's potential danger involved.\n\nJust so we're clear I'm not against the kid hunting as explained in my previous post, I'm against the OP sending his kid hunting unsupervised by OP and not telling the mother that he participated in something that was potentially dangerous (i.e. handling guns) surrounded by people she might not know or trust.\n\nAlso if you think that handling guns isn't dangerous simply because the odds of you getting into a car accident are greater than the odds of you getting shot, then there's no point in you replying, because we'll never come to an agreement on this.  the first thing we get taught in our gun handling course in Canada is that the #1 cause of gun deaths in Canada are self inflicted (accidental or otherwise).\n\nThe mother has a right to know and objectifiy to activities that present clear direct and/or indirect dangers to her child.  Its her right as a parent.  Regardless of how you feel about the activity this kid participated in and the odds of an incident occuring; if there is a potential for danger, any parent has the right to know and objectify if they believe there is an issue.", "What if the parents were still married and living together? Does the dad still get to decide unilaterally what's an \"abnormally risky activity\" and what's not?", "My dude. Hunting is risky. Because of the guns.", "Exactly my ex did this to me to gain control of me. He asked that we move our child to the school district in-between our two towns and said if I didn't he would take me to court to get it more fair. I agreed then he moved to my town and when I asked to move him to the school in town I was told No, I got my way so you have to deal with it. So op is NTA.", "I’m not going to agree or disagree on the judgement, but come on… you’re talking about an abnormal,y risky activity, but the kid is going shooting - a mistake somewhere and he could quite easily be dead. Pretty risky. This logic undermines your whole argument in my mind.", "OP was foolish for not being willing to work with the mother. \n\nAnd no, not every decision needs to be by both. \n\nHowever, something like an overnight hunting trip I definitely believe should be one that gets both parents buy-in.", "I live in a mountanous area in Europe, you probably can't get more \"culturally acquainted with hunting and guns\" than that in Europe, and it's still definitely not an activity that you would allow your teenage son to participate in, nor is it something that's as widely common or practiced freely as it seems to be in the US. Probably bc nowadays there are quite strict rules to protect the wildlife and repopulate certain species, as well as for public safety, gun control etc. I don't even personally know anyone who owns a gun. And again I live in a rural mountanous area where hunting is definitely practiced.\n\n In my experience it goes by family, if you're not a family of hunters it's very unlikely you're gonna be exposed to it or have an interest in it. Hunters here are also quite protective over their \"secrets\" and usually unwilling to share knowledge or invite outsiders to participate (it's the same with mushroom gatherers, it's a whole thing lol). \n\nIn general you don't really see a fascination with guns at all where I am. Unless you're someone who needs guns, like a hunter or a farmer, people will definitely look at you sideways if you own a gun. And even if you're a hunter/farmer having an extensive collection of guns or carrying guns in public when it's not needed (when you're not out hunting or in the wilderness) will draw some weird looks and I'm not even sure it would be legal. It's like, if there aren't any deer or wolves to shoot around what are you trying to do with that? It seems to me it's definitely a mentality that's rooted in necessity and practicality rather than passion. It's more like carrying a spade or driving a tractor.", "You also don’t “have” to be good at co-parenting, so here we are", "this isn’t something so mundane the 16 year old is operating a gun you talk to the other parent about that", "Nothing.\n\nBut why should OP hide this from the son?\n\nThe son is in most places in the world old enough to decide where they want to live. \nOPs ex obviously doesn’t care about that, and just wants to make trouble.\n\nSo the son deserves to know what his mom has said and done so he can make an informed decision about where and with whom he lives with.", "That’s a valid point. States are so varied it’s insane. Same with a CCP/CWL. In Virginia, $20 and a 2 hour video can get it for you. And that permit is valid in numerous states.", "A known and trusted friend? Okay. But what if the son had, say, a friend who is 4 or 5 years older, maybe not a model citizen, yeah, I’d want to know. Or if he wanted to stay at his church leader’s house? Or a female friend’s place? Best to make sure both parents know.", "I've done both. \n\nI remember a band trip with kids  jumping outside balconies in hotels; hormones are dangerous. \n\nThe sooner you teach kids safety, before hormones and reaching adulthood, the safer they will be. \n\nWould you rather the kid learn at 18 from his friends? those are the people that make headlines.", "You don’t know that and my point is she should have to and so should he. My nephew was shot (not hunting related) because he was able to play his parents against each other KNOWING they wouldn’t speak to each other and nobody knew where he was. The only reason he is alive is because the kid who shot him freaked out and dropped him at a fire station. He was 16 years old when this happened. \n\nIf two people decide to have a child, the child and his/her safety is number one priority. And if that means BASIC INTERACTION between two people then get over yourselves.", ">...so because driving is highly unsafe we should ignore all other safety concerns from handling real guns with live rounds?\n\nNice hyperbole. Man, the people on this sub will move heaven and earth to defend women when they are in the wrong.\n\nNo, if you trust your son with driving, you should trust that he can go on a hunting trip with his friend's family. It's not like he's out by himself.", ">Can he buy a hunting rifle?\n\nHalf the USA, which I assume op is from, doesn't have minimum age requirements for buying long guns from private sellers. Federal law is 18 years for long guns, but says nothing about private sellers afaik.\n\nThe other half, which does have restrictions, often still allows minors to legally possess long guns, just not purchase them. \n\nBoth should have a say, but you trying to bring legality into it is both irrelevant and incorrect.\n\nEdit: 30 seconds of google will tell you I'm right, wtf are y'all downvoting over?", "He doesn't have to communicate his every move because his ex thinks she still has control.", "I know. The wife sucks. Hopefully she works on her control issues.", "You’re encouraging to actively cause trouble in the family because you’ve made an assumption from one point of view. OPs post is obviously in bad faith, but because you either hate your mother or women in general you’ve jumped at the chance to stick your oar in. Resolution and civility should ALWAYS be priority for coparent families because despite what you think, it’s best for the child. Grow up.", "i'd rather we teach kids firearms are incredibly dangerous and not to minimise it to a 'hobby'. spin it all you want, but a gun will never be the same as playing a sport or an instrument", "It seems pretty clear to me that her objection has more to do with her son doing something she doesn't approve of, rather than a technical objection to not being informed prior to the activity. She doesn't want him to go again, she thinks this is a decision that should have been made jointly, etc. \n\nThe kid is 16, this is a decision he can and should be making for himself. I can see an argument that OP should have informed her that the kid was going hunting, but... honestly I disagree. If the kid wanted mom to know, **he** would have informed her. He didn't. \n\n16's the age where I think the kid's opinion should basically only be overruled by a consensus veto from both parents. It's his life to live.", "dude you want to talk about hyperboles and exagerations this was your reply to a mother's valid concerns about her child handling a weapon without her consent or knowledge:\n\n>Driving is infinitely more dangerous than almost anything he will do his in life.  \n>  \n>So that's a pointless concern\n\nHandling guns with live rounds can be dangerous - no matter what the odds of harm are.  Its a statement of fact, backed up with historical evidence and statistical odds. There's no way you can ever suggest to me that hunting does not have elements of danger.  You can minimize those elements but you can never truly eliminate them.\n\nAnd just because I can trust my son to handle a gun, doesn't mean I trust the other people who are supervising him to handle their weapons.  And even if I trust them enough to let my hypothetical child hunt with them, my hypothetical ex-wife would have to trust them aswell before I'm ok sending my kid off to hunt with other people outside my supervision.", "if she is punishing him, then how tf is this any better? she literally asked him for mutual respect, and he said no. i dont think she is the problem.\n\ni disagree on the danger argument. its not the same, and not comparable.\n\neven if the kid wasnt going out with guns, id want to know. if my kid was camping where they could get ticks, lost, or hurt by wild animals. its just mutual respect to let the parent know.", "I mean, the former Vice President of the United States shot a friend in a hunting accident. Adults make errors with firearms, too.", "Not as reassuring as you might think.", "Federal law is indeed 18. As far as private sellers, I believe it should be the same, but don’t know for sure. \n\nMy point with legality is that an activity that the kid can’t even legally obtain the equipment for is definitely one that both parents should be unanimous in approval of. It’s dangerous enough for federal law to regulate it, it follows that the responsible parents (plural) should both have a say.", " No evidence of the ex wife having control issues. OP having anger issues in regards to his ex, maybe.", "Doesn’t seem like either is interested in “co-parenting.” Unfortunately common for many divorces. \n\nShould OP have said something in advance? Maybe, but I don’t think it would have changed the ex’s response, and I think he’d have let the son go on the hunting trip, anyway. \n\nIt was a no-win situation for OP, and it sounds like he knew it. NTA", "the mother wasnt upset that they hadnt told her, she was upset because she didnt want him to go in the first place", "Hunting is a safe activity. To get a hunting license in most states, you have to have a hunter's safety card, which shows that you know how to handle a firearm safely. Also consider the fact that at 16 he can drive to locations she has no idea about to see people she's never met in a potentially dangerous environment. If she freaks out, its her problem and I can't blame the ex for not accommodating her hysterical and paranoid demands. NTA.", "My YTA sentiment comes from the fact that firearms and other potentially lethal activities need consent from both parents. Whether that be hunting or just target shooting.\n\nThe only reason my dad is alive today is because when my uncle was cleaning his gun (with a round in the chamber wtf?????????) while they were both laying down on the floor watching TV was that my uncle literally shot himself in the foot and that stopped the bullet from going into my dad's head.\n\n\"Good luck god speed, here's some cash\" is not an acceptable way to handle an introduction to firearms.", "If the adults and the kids are good gun stewards, the odds of anything going wrong are low.\n\nIf they’re fucking idiots? The odds are a lot higher.\n\nWhich is why you need to tell the other parent.", "I agree with most of it except for the texting idea.  That's helicopter parenting.  Also, what if there's no cell signal?", ">I believe it should be the same\n\nThe law only applies to licensed sellers, as in those with FFL. Some places definitely restrict the sale of guns by individuals without an FFL, but plenty do not. \n\n>My point with legality is that an activity that the kid can’t even legally obtain the equipment for is definitely one that both parents should be unanimous in approval of.\n\nBut again, they can.\n\nThe parents should still have a say, but the kid can legally purchase a long gun in about half of the USA. Whether that in and of itself should be changed or not is a separate discussion", "Ex wife saying son is not going hunting again with no qualifier is a control issue.", "Depending on the state, she may have zero legal say, given his age. Several states use the 16+ cutoff for hunting. Should he have firearms and hunter safety training? Absolutely. However, if the kid is in a state that allows mentored hunts, or just has a blanket 16+ license policy, she doesn't have a legal leg to stand on, and OP is correct. Worth noting, most states also allow a non-hunting person to join a hunter, no license needed for the non-hunter.", "So OP needs to inform his ex-wife every time the kid gets in a car?  Lots more kids are killed in cars than killed hunting.\n\nYour uncle is an idiot.  There is no indication that there was any lack of firearm safety training.", "just because the are doing it for the ecosystem doesnt mean that they have to hate hunting", "Well it's a lot more comprehensive though. Developers infringe on more and more habitats. Add some absolute acts of insanity like clear cutting, the ' accidental ' ( it was albeit unbelievably careless ) introduction of myriad insects causing trees to die- Dutch Elm, Ash, Hemlock ( it looks like a giant tornado through parts of our state ) and there goes yet more natural habitat. \n\nWildlife get pushed into smaller and smaller areas completing for the same resources. Our area is currently getting overrun by porcupine. So the geniuses at the state bring in Fishers, only animal that will go for porcupine. BUT there go turkey and other ground animals. Count on a future Fisher overpopulation and here we go again. \n\nHunting is way more nuanced and not like we tend to think.", "Yeah but around here almost all the kids hunt and none of them have licenses. Licenses for the young are a joke here.", "Most likey not. Most kids around my state dont get their licenses despite it being a law.", "I wouldn’t put my kid in an Uber.", "Something she said as reported by her hateful ex after finding out her minor son was put into a dangerous situation without her knowledge.\n\nI’d take that quote with a very large grain of salt.", "Yes. OP and his ex both need to be aware of the decision to start training their son on a 2 ton death machine. And to claim that that means a heads up every time he gets into a car is a ~~straw man~~ false equivalence at best.\n\nEdit: Straw man requires intentional deception. False equivalence is simply apples/oranges without malice. Edited to remove the accusation.", "Right. But **_liking_** killing things is the part that makes you the asshole.", " \\^ I know people who hunt without a license, I don't live in the US but it is funny to assume people who live in the middle of nowhere care about such things", "I think the bigger assumption to make is that they are illegally hunting without a license which will result in at least a hefty fine and being placed on a list that forbids them from hunting. If that’s true than OP has bigger problems. But the vast majority of hunters follow the regulations in obtaining licenses, so that should be the assumption unless otherwise indicated", "Where I grew up we all took firearm safety at 11 years old it's very likely the kid has had firearm classes", "My argument applies to other driving services like taxis. The perceived risk with hunting isn't supported by the data.", "Lots of people are also shitty parents by thinking their opinion matters in someone else's home", "I take your conjecture and quote of “very dangerous situation” with a large grain of salt.  Hunting is not inherently very dangerous just because a gun is involved.  I’d love to see some stats to back up how dangerous it is.  A simple google search claims hunting is statistically less dangerous than football and soccer.\n\nWould you be all over OP for not giving his ex a heads up he went to play soccer?\n\nI’d argue it’s an ESH for not giving her a heads up at least, but it also very much depends on the son’s training and the training and professionalism of all involved.  If the son very much wants to do it and is trained properly, at 16, it really doesn’t matter what the ex says.", "Ah so since Reddit doesn't like men OP is obviously lying 🙄", "Other potentially lethal activities.  Riding in a vehicle is a potentially lethal activity.  Nothing false about the equivalency. \n\n What is false, is the idea that ex has veto power.", "I went to high school with so many people who could and would hunt, but definitely did not bother getting a license. It's really eye-opening to see how many people think that just because something is technically legally required, doesn't mean everyone does it.", "I mean, not really?? Assuming this is in the US, hunting licenses is a massive shit show. The F&WL own national database is a complete disaster relying on outdated, incomplete numbers.\n\nAnd each state has drastically different laws depending on what requires a license and what doesn't. In Maine, you don't need a license to hunt on your own land if you own more than ten acres. But that doesn't apply in other states.\n\nThere are way more people illegally hunting than you think.\n\nWe can only assume based on the facts given to us, and OP has not given any indication that their child has any proper training or license to go hunting.", "That very much depends on where you grew up and your family. Hunting is huge where I'm from and I absolutely did not have firearm classes as a child. The only person who taught me safety was my grandpa, and he tools it deadly seriously. \n\nAnd plenty of people I knew in middle and high school went hunting without a license and certainly didn't treat guns with respect. Dude that goes \"have fun, here's some cash\" doesn't scream \"I taught my son how to respect guns and how serious it can be to accidentally shoot someone\"", "That’s a weird takeaway from my comment.", "Stop being obtuse. She clearly has already given her consent for him to drive. She should have a say in whether he can use a gun as well", "No. There is a difference between passenger/passive observer vs operator.\n\nThere needs to be consensus on training your child on lethal activities.", "[Vast majority of states require firearms training and hunting etiquette for both those who require a license or those who are under the age to get a license](https://gothunts.com/hunting-age-requirements/)\n\nIf you know people who hunt without a license, please report them instead of letting them do so illegally", "Not really. OP didn't do anything wrong but mommy is mad so obviously he's wrong.", "NTA not at all", "Ur~ Tough call. NTA. Your son is 16 and needs to be able to make his own decisions. Veto Power should be reserved for avoiding dangerous situations and not because you or his mother thinks an activity is amoral (within reason, obviously). Co-Parenting should be waning now that he is older and making more of his own decisions. If the decision involved surgery or an extended trip somewhere or something along those lines then yes the two of you should get your heads together.", "NTA. You're only the bad guy here because it's hunting. If he wanted to wear a dress and your ex was mad you allowed it people would praise you. He's 16, he can basically do what he wants.", "NTA.... Hunting is a fantastic activity...puts food on the table, teaches kids about gun safety and nature and supports countless environmental efforts and open space preservation across the US. More power to you and hope your son has a lot of fun hunting in the future...", "NTA- sounds more like a control issue. You are correct you don’t need to co-parent as much anymore but there is still a need for civility", "NTA he’s old enough to make his own decisions and what he wants to do in life.", "YTA", "YTA, and a big one", "Yes, YTA. His mother is right about joint consensus until he is 18.", "YTA\n\nDoes she know that your son hunts? Do you hunt? Who taught your son how to hunt? Do you know if the others he was going to be with know how to safely not shoot each other while hunting? How well do you know these people? If not and no to any of these, then this is where the problem started. I don't hunt but my ex and his family do and I've always known this. I know that my son was taught how to properly use guns and bows. I own weapons and know how to use them and made a point to know that my son was also taught how to safely use them. Because there were conversations and adults actually being adults, well we avoided easily avoided arguments where there shouldn't be.\n\nShe's his mother and while this is your house, this is that grey area where if heaven forbid something went bad on this hunting trip that she didn't even know about, not too many people would feel bad for your demise. I hope you understand that part. You still at the very least owe each other conversations when your son is doing something that can get him hurt.", "YTA. It’s definitely best to make nice with your ex and at least try to get along, instead of being very rude to her and making the naïve assumption you just don’t have to talk to her anymore. Even after he’s grown, there will be many big life events in the future where he will want both his parents present, and being a jerk now just makes things more uncomfortable and complicated for him. It sounds like you’re hoping he’ll choose you over her as he gets older, but that’s honestly not a gamble you should be wanting to take. As far as making decisions together, that’s a given, and I’m sure you would feel differently if she was letting him do something you absolutely didn’t approve of. It at least would have been reasonable to tell her he was going on that trip instead of letting her find out later.", "Yta - I’m a hunter and in my opinion, the mother is overreacting. However, I can also understand *why* she’s overreacting. Her son was either using or was at least in the presence of a firearm, and that may make a parent feel worried for the safety of their child. She has the right to know where her kid is, and therefore, you should’ve told her. \n\nAlso, your girlfriend is right. You should try to keep peace with your kid’s mother, as constantly fighting with her will negatively impact her life, your life, and most importantly, your son’s life.", "You have to interact until one of you dies honestly.\n\nBirthdays.\n\nChristmas.\n\nEaster.\n\nDeaths.\n\nMarriges.\n\nBirths.\n\nGrandchildren.\n\nYou may not have to talk on a day to day basis, but you still have to have contact every now and then. Maybe you should grow up and look at that.\n\nJust saying. YTA.", "YTA- there are plenty of horror stories about people being shot while on hunting trips, she’s not being dramatic asking for your permission. And your son is BOTH of your responsibility until he turns 18. If you want what is best for your kid (especially in a situation where both parents are active in his life), suck it the fuck up. Things go a lot smother when the parents work together, stop antagonizing her and apologize. It’ll save you on therapy costs down the road.", "100%.  I am perfectly okay with HUNTING guns when used responsibly and and with hunting.  And I still would not allow my spawnlet to go hunting with anyone I had not fully vetted on their gun safety knowledge and been hunting with myself at least 3 or 4 times to know for sure they knew how to properly handle the firearms.\n\nListen to your GF.  She's right.  Whatever your ex's reasons are in this scenario, she absolutely gets a say in what happens to HER child.  Take L here and apologize and open an adult conversation with her.  And not just about this, either.  If you two are this far apart on one issue, we know this is not the only one.", "The problem is, their relationship in general seems to be antagonistic. And unless OP is leaving stuff out, she too is making unilateral decisions and any \"compromise/co-parenting\" boils down to her getitng her way.", "Yeah, bow or gun, I would want to know if my child knows how to handle the weapon safely and will be around people with the same skill. If that's the mother's concern, I'm on her side.\n\nBut if she has a moral issue with hunting, as an ecologist, I'm on OPs side.\n\nBut OP, YTA for your views on co parenting. Hope your season is good and you bag whatever it is you're going after.", "I agree. Canadian as welll living in a high hunting area.\n\nIf my kid had no prior experience with guns or had no certificate etc. there’d be no way I’d let him go off with others, especially other teens, that I didn’t know. \n\nIts like people forget that guns for hunting are made for killing. \n\nIf your kid isn’t experienced and you don’t know the people they are going with?!?!? That’s crazy. \n\nIt would be a different story if my kid was an experienced hunter with all his proper certifications and whatnot, as well as going with a family that I knew and trusted to be likewise responsible gun owners. \n\nPeople that argue about kids and cars also maybe forget that they need to be licensed to drive a vehicle as well. A 16y old isn’t just given free reign with a car with their teen friends with no experience and no license. The argument is ridiculous.", "Hard disagree, yeah OP was kind of a DB in explaining it to his ex, but what he said was true. Especially if 2 people have opposite views on something like going hunting. The kid is 16 and at the appropriate age to make some of his decisions on his own like this. NTA", "Horseshit. The rules are never the same between two different households nor should they be. Allowing your ex to overrule your judgment in your own home, during your time with your child, is absurd.", ">He’s still a minor and you are still coparenting, so you have to work   \ntogether and dismissing her completely and portraying yourself as the   \n“cool” dad that let’s your kid do whatever he wants without his mother’s  \n approval is asshole territory.v\n\nYou're acting like the only reason OP allowed the trip was because the big bad evil husband wanted to spite his poor little ex wife.", "I wouldn’t say the activity was *extremely* dangerous, but it was definitely dangerous. And although I think the mother was overreacting, OP definitely should’ve told her about the trip beforehand. She has the right to know where her son is.", "Its AITA. Anything a husband does here must be either abusive or intentionally trying to spite his wife. /s", "Too be fair. It’s more likely to drown in a pool than die hunting. If the kid is at his moms and wants to go to the pool does she need to ask OPs opinion?", "The kid is 16. By the time anything is changed he’ll be 18 and there won’t be a custody agreement.", "Again that's too much, and I highly doubt a judge would go for it. Also this is made up by you. I'm sure his dad's smart enough to handle making an appropriate decision.", "There's nothing in OP's post to indicate his son has a hunting license or is trained in hunting safety.", "No, she does not. He does not have to inform his ex any time his kid wants to go out with friends. She also has no right to try and say that the kid isn't allowed to go hunting anymore. He is old enough to decide what hobbies he wants to involve himself in", "Being a divorced parent once they get to this age when they are with the other parent unless what they are doing is illegal or terribly dangerous , you really don’t get a say.  I mean you can say something but chances are your being over ruled.", "Maybe if the son and mom talked more she would know about the hunting trip. If I was going on a trip soon that is 100% something that would come up in conversation naturally", "Or they saw that OP was a man and had to paint him as an abusive husband or smth", ">She doesn't want him to go again, she thinks this is a decision that should have been made jointly, etc.\n\nThe issue with this, which many are missing. For her making a decision \"jointly\" appears to be one where she gets to decide and the others get to jointly go along with it.", "> keeping say, the deer population at a certain level they all risk starvation\n\nIf only there was a way for nature to balance things put naturally.\n\nOh wait, there is, starvation one year reduces the population leading to a self correcting amount, until theres another food shortage / food surplus which changes the numbers again.\n\nThe 'but we have to be the ones to balance nature' is hunter bs", "You realize the two things aren't mutually exclusive right? You can hunt as a hobby for the food. And her 'communication ' was trying to say he couldn't go again. It seems to me like in her mind co-parenting is only co-parenting if she has the final say on the matter.", "We don't know what state this is in or if they're following the law. It's probably a reasonable assumption they're following the law but we don't know what state or even country they're in.", "The kid could have also just been simply tagging along for the trip. I’ve probably been on around 30 hunting trips with friends and family, and have not fired a firearm on a single one of them it was more hair camping and hiking for me. I can’t remember the laws in my state but I’ve had my basic hunters safety since I was 10 and I went through the course with my younger sister and cousin at the time.", "What you are talking about is called poaching... not hunting...", "Then they were poachers. Poaching will lose you the right to hunt and own firearms.", "It's just as likely his son has had firearms classes and has gone hunting with dad and his friends family before so dad wasn't worried. Without more info we can't say for sure either way."]}