{"id": 14485, "submission_id": "12hkdwb", "title": "WIBTA if I asked my partner to try and lose weight?", "selftext": "I (23M) have been dating this woman (27F) for a few months. I really like her; she is a great person, we have similar interests and get along well. \n\nThe one issue is that she is very overweight, when we first met, I was very overweight as well. I have made huge changes in my life to be more physically and mentally healthy, and now I have lost 60+ pounds.\n\nI look and feel a lot different than when we first met and I really want my partner to do the same. She recognizes that she is overweight but I feel like she may need some push and motivation to turn her physical health around.\n\nWIBTA if I sat down with her and had a talk to encourage her to go to the gym and diet with me?", "created_utc": 1681136743, "permalink": "/r/AmItheAsshole/comments/12hkdwb/wibta_if_i_asked_my_partner_to_try_and_lose_weight/", "score": 263, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1)The action I would potentially make that might be judged is sitting down with my partner and talking to her about losing weight.\n\n(2)That action might make me look like and asshole because it could be seen as me being shallow in regards to my partners physical appearance.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This is an awesome way to become single.", "INFO: You've lost 60+ pounds in the \"few months\" that you've been dating her?", "You can express the benefits you found from getting healthier. YWBTA if you demand she looses weight. After having a discussion, you may find your lifestyles no longer align and it might be time to go separate ways. You can’t force anyone to loose weight.", "YWBTA. When she wants your help, she will ask for it.", "YWBTA… I am quite physically fit, have been my entire life, been training for over 20 years(weights, running, boxing etc).\n\nI can honestly say there is nothing more insufferable than someone who has lived a life of laziness who then gets fit and sees themself as a fitness preacher who must convert everyone they know to their new religion.\n\nYou were allowed to tread your own path, let your girlfriend do the same.", "I am going to answer this honestly and in good faith. \n\nI have been married for 13 years, and with my spouse for 16. \n\nIn that time, our weights have gone all over the place. Some of it was in our control, some was not. \n\nMy point is if you asked me what has kept me with my spouse, his or my weight wouldn’t even come up in the discussion. \n\nIf she initiates a conversation about it and wants it for herself, you should support her. But you should never think it’s a good idea to change someone. \n\nAnd if weight is a criteria for you in a relationship, I would ask you to re-evaluate what you are looking for and be honest with yourself and her about it.", "Honestly? Yes, YWBTA. Does SHE want to lose weight? If not, how is that any of your business? You don't get to decide what your partner does with her body. \nIt shouldn't be about losing weight anyway, it should be about leading a healthy lifestyle. If that's what you want, ask her if she'd like to join you in practicing healthy habits instead.", "You lost sixty pounds in just a few months and now you're not only an expert but want to bully your new gf about *her* weight?\n\nYWBTA.", "YWBTA, You didn't care about her weight earlier, why now? She knows she is unhealthy and she doesn’t need  you to ask her to lose weight. Even if the circumstances were switched and you were the overweight one and she asked you to loseweoght and you'd be ok with that then, doesnt mean she'd be ok with you asking now. I think you don't really care about her health. I think you want someone skinny now that youre skinny", "YWBTA. When you started dating her, she looked just like she does now, and she was good enough for you then. Now you feel like you deserve an upgrade. You literally *just* lost this weight--you don't even know if you're going to stick with this and keep it off. But now you want her to change...and on your schedule.\n\nBreak up, say something vague like \"it's not you, it's me,\" and go get a skinny girl if you think you can.", "YWBTA-it's very unlikely this would go over well.", "You lost 60+ pounds in a \"few months?\"", "YTA. You can’t change people.  She was overweight when you met, so you don’t have the right to expect anything different.", "INFO: How long did it take you to loose that weight because you say you were overweight when you started dating which you say is a few months ago, loosing over 60lbs in that time seem very unrealistic.", "YWBTA\n\nWhile I agree it will be good for her health, there is simply no way you can have this conversation with her without insulting her. \n\nYou will cause her huge pain, and possibly the end of your relationship. You need to decide if her weight is a deal breaker for you.", "YWBTA.\n\nThere's nothing wrong with wanting to be with someone you're attracted to. However,  it'd be rude to basically tell her you're not attracted to her by encouraging her to diet and exercise. Even if what you tell her is you care about her health (I'm sure you do), she's going to think you're telling her you find her unappealing. Either get over it and accept her the way she is, keep eating healthy and exercising, and maybe she'll join in if she wants to.  Otherwise, move on and find someone who shares those interests with you already.", "YWBTA. Has she even expressed interest in losing weight or do you assume all fat people are as miserable as you were?", "YTA. You either love her or you don’t. \n\nSpoiler: only loving her when she is a certain size isn’t love. You are trying to change her now that you’ve lost weight and feel differently about yourself and your options. \n\nHow she feels about her body is the only thing that matters and you should support her, not try to force her to conform to a standard you’ve created. You loved her as she was and now you’re trying to move the goalposts. That’s an asshole move.", "Yes, YWBTA\n\nShe knows she's overweight. Sitting here down and telling her like this will likely just make her feel bad/self conscious about her weight. \n\nMaybe if you want to help encourage her, just ask her if she wants to come to the gym with you, without any mention of her weight. And if she says no, just leave it.", "INFO:. do you plan to stay with her if she doesn't lose the weight?", "YWBTA - she was the same size when y'all started dating. You made health and life changes *for you*, and congrats on your fitness journey!\n\nBut this has overtones of \"I look better and I want a mate that looks better too\". If this were coming from a place of wanting to share a hobby like exercise or cooking, I'd lean towards N T A.\n\nIf you don't make it about weight and instead make it about lifestyle, then you're not an AH. You changed your lifestyle and it's assumed you want to share in that lifestyle with your partner. They can choose to adopt your new habits with you, or not. Then it's up to you to decide if \"not\" is a deal breaker. But if it's just about the numbers on a scale or size of pants.... Kinda gross, again because you chose her the way she is.", "YWBTA. As the saying goes, what she eats don't make you shit. How would you feel if she converted to a new religion tomorrow and a month later was expecting you to join, too? You might think, hey... this isn't what I signed up for...", "You would be a massive asshole, and probably a soon-to-be-single asshole.", "YWBTA. It’s her body not yours. It’s as simple as that. She can come to you if she wants to be healthier. Then you can help her. \n\nThe only way you wouldn’t be is if a doctor says she’s having medical problems due to her weight.", "YWBTA. Just like you, if she wanted to really lose weight, she'd work out more and eat healthier with you.", "YWBTA.\n\nwhy do you suddenly care now when you didn't before? is this for selfish reasons? i think you need to really think about why you want this for her. \n\nif you really think exercising and eating healthier is something that made you feel happier and improved your way of life, then i guess it makes sense you'd want to share that? maybe just ask her \"want to go to the gym with me?\" and leave it at that though. if she says no, she says no. you can put the ball in her court, but don't be an ass about it. don't insult her or make her feel lesser if she doesn't want to partake in your new lifestyle.", "YWBTA its up to her if she wants to make the change\n\nYou were fine with her as she was when you stated dating. Now it suddenlly matters?", "YTA. But besides that, I’m concerned about you losing 60+ pounds in a “few” months…", "Oh boy. This isn’t going to end well for you buddy.", "YTA. You knew she was overweight when you met her. You're letting your weight loss go to your head; it's made you arrogant. She knows she's overweight. So she's not going to lose weight just because you tell her too. All you'll succeed in doing is making her feel bad.", "I’m gonna go against the grain a bit here. And before y’all kill me just hear me out. I completely agree. If you demand it OP or try to force it YTA. HOWEVER I don’t think your intentions are malicious based off of reading this. I may be wrong but that’s not the impression I’m getting. I (25m) am overweight as well and am in a relationship with someone (30f) who isn’t. My amazing gf has always made me feel comfortable and confident with myself. Im very bear-ish and she has expressed that she likes it very much. We have however had open discussions and communications about having a more “fit” lifestyle together. Let me make it clear she has never demanded it from me. And that’s something I have always appreciated and valued. I agreed to make the changes because I love her and want to be the best possible man I can be for her. Now in your situation I’m happy you made a life choice that has affected you in such a positive way however moving forward your actions will speak to the kind of person you are. I believe open discourse and discussion in a relationship is necessary and healthy and your case is no different but there is a right way and wrong way to do it. And if you end up finding you don’t share the same values anymore then that’s perfectly fine. It just means you’re not compatible anymore.", "Soft YWBTA. I don’t think there is any harm or disrespect in trying to involve your partner in healthy activities that can contribute to weight loss (gym, outdoor activities, meal planning/cooking together etc). What crosses into YTA territory is if you come across as demanding or word things in such a way that it makes her feel insecure or bad about herself. Ultimately it’s her choice what she does with her body and lifestyle. She is aware of the fact she’s overweight so she doesn’t need a sit down condescending “come to Jesus” type conversation about it. If she doesn’t have the desire to make significant changes to her lifestyle then you might just need to accept you aren’t as compatible as you once were and move on.", "YWBTA.  If she expresses to you that she wants to lose weight and asks for advice, then go ahead. Until then, don't say anything to her about it. The other option would be to leave the relationship, and honestly sounds like she may be better off without you.", "YWBTA. \n\nShe was this size when you met her, so there's no reason to bring up her weight in terms of attraction/her changing. \n\nShe has seen you lose weight, so if she wanted your advice to lose weight herself, she would ask about it. \n\nIf because you have changed, you are no longer interested in a relationship with her, then break up with her. As an overweight person myself who lost a significant amount of weight I get that if your lifestyles are no longer compatible (aka you are very active and she isn't interested/able to do the same things as you) you don't want to stay with her. \n\nAnd also as an overweight person, knowing you were as well, I have to say - come on dude. Fat people know we are fat. We try and fail at multiple diets, some things help, a lot doesn't. If your girlfriend was interested in replicating your success, she would ASK for your help. It would be remarkably cruel for you to now tell your partner, who is the same person she was a \"few months ago\" when you started dating that she should lose weight. And you know that, but you can't help yourself because now you see yourself in a new way and think she would just be better too, and that's not how life works. \n\nThe only thing you can do is if SHE raises something about wanting to lose weight, you could then offer your help and advice. If she says \"the doctor said X, I really need to lose weight\" then you can say \"well you know my journey, and I'd be happy to go to the gym with you/meal prep/support\" but any unsolicited conversation about how you can help her is an AH move.", "Obviously YWBTA .\n\nIf you don't like her as she is you're under no duress to stay with her.", "You mentioned the word look before feel which leads me to believe that this is simply a physical attraction thing?\nAm I right?\n\nBut yes YWBTA, if she asks you then you are good. But any conversation you start makes you definitely TA", "You would probably push her away from you if you push this too hard.  You first need to find out how she feels about her weight.  No one wants to be overweight, but for many this is a lifelong pursuit to lose weight and many just don't know how to attack it.   Let her come to the  conclusion and then you can offer suggestions but it's a tricky conversation to have.", "YTA she looked like that when you started dating and now you want to change her", "YWBTA. The only way you lost that much weight is if you were taking Ozempic or a doctor prescribed weightless drug. OR it was water weight. Alot of obese people have hard time losing weight for various reasons but one is that the fat holds too much insulin (why they are sometimes diabetic) {my Doctor told me that btw}\n\nBefore you tell her anything, remind yourself how you would feel if someone told YOU what YOU needed to do with your health. You aren't her doctor, don't know her diagnosis etc. You sound like a shallow AH\n\n>I (23M) have been dating this woman (27F) for a few months. I really like her; she is a great person, we have similar interests and get along well.\r  \n\r  \nThe one issue is that she is very overweight,\n\nBeing overweight is not the issue. Being not astheticly pleasing to you or societies standards  because you are shallow is the issue.\n\nI hope she a new BF- one who will treat her right.", "After reading your posts and comments, I think YWBTA. \n\nApparently, you two have only been dating for 4 months. From the start, both of you were overweight, and you knew exactly that she was overweight as well. Within the 4 months, you lose over 60 lbs which is incredibly fast (and imo unmaintainable once you go off your current diet) and your opinion of your gf changes because you changed. Your gf is still the same person. Your weight loss and ego changed you. You now say that if your gf doesn’t try to lose the weight, you’ll consider breaking up with her? I’m sure there were other reasons why you liked her besides her weight/size. \n\nI would be upset if I had a SO tell me that I was too overweight for them and that I either had to lose weight to keep them or they’ll leave and I stay the same. \n\nI think you should decide whether or not you want to stay with her asap to not waste her time. \n\nIf you choose to stay with her, you can see what activities she’s interested in that you may be as well and plan dates around that ex. walk/talk in the park, hiking/sightseeing, kayaking/swimming, visiting a museum, etc with a picnic/lunch with healthy foods and a special treat you both enjoy. These are fun ways for ppl to be active as well as enjoy each others company (for most ppl …I think). \n\nDo NOT sit her down and tell her she should go to the gym with you and start dieting.", "YWBTA. She knows she's overweight. She doesn't need you to tell her. You'll just be letting her know that you don't love her unconditionally.", "YTA. Unless you are her doctor (which would be unethical, since you are dating), you have no business telling someone to lose weight.", "YTA. You have stated you might leave if she doesn't want to lose the weight, and are obviously planning on manipulating her into wanting to. Take a long hard look in the mirror and realize how much of your self worth and compassion you sacrificed to a crash diet.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23M) have been dating this woman (27F) for a few months. I really like her; she is a great person, we have similar interests and get along well. \n\nThe one issue is that she is very overweight, when we first met, I was very overweight as well. I have made huge changes in my life to be more physically and mentally healthy, and now I have lost 60+ pounds.\n\nI look and feel a lot different than when we first met and I really want my partner to do the same. She recognizes that she is overweight but I feel like she may need some push and motivation to turn her physical health around.\n\nWIBTA if I sat down with her and had a talk to encourage her to go to the gym and diet with me?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "So she has been at this weight the entire time you’ve been dating and all of a sudden you have an issue with it? I can’t imagine what you’re expecting to come out of asking her to lose weight, and it’s really unfair of you to suddenly decide you want her to look different when you knew what to expect entering this relationship. I don’t know her or her doctor, so I don’t know whether her weight has a negative impact on her health — sometimes it does and sometimes it doesn’t. But the only person who can make her want to lose weight is her. And no matter how much you say it’s about health, if she’s been overweight for years then for years she’s heard comments from people who claim to be worried about her health, but are actually just offended that she’s existing in public while fat. And I guarantee you that that’s what she’s going to hear in a conversation like this.", "YWBTA and make her feel like you want to change her, she's not good enough for you now, and that you aren't attracted to her anymore.\n\nIf she approaches you for help, great (though I think you lost way too much too fast) but please do not offer unsolicited advice or ask her to lose weight.", "Hahahahahah yes, YTA if you do that.", "you're going to lose a lot more weight than you intended if you do this - YWBTA", "INFO: how did you lose over 60 pounds in a few months?", "Make sure to update if (when) she dumps you.", "So you think dating a person for a few months means they should change to please you? Gross.", "YTA\n\nThis is not a conversation you should be having only a few months into a new relationship. She was overweight when you started going out - it's not like she woke up one morning and had gained 100lbs.\n\nAnd how do you plan on motivating her? Get healthy or you'll break up? Dude, just break up with her if you've going to turn into that guy.", "LMAO ywbta. I'm so glad my partner and I have already discussed this exact scenario. I would understand maybe wanting to talk about weight management if she started to gain weight and you two were committed to keeping the relationship going, but this is absurd.", "Enjoy the conversational minefield my friend.", "Nah, you wouldn't be. You made a rather drastic change to your lifestyle and want to be healthier. But now you want that in other aspects of your life, including your partner. I'd just make sure you are being honest with your intentions here. I don't really buy into the \"big is beautiful\" crap. Yah, it's healthy to have a lil bit of chonk, but excess weight is unattractive and detrimental to health. And there are a LOT of factors that go into weight gain and it can be extremely difficult, mentally and physically, for people to lose that weight.\n\nWhy do you want her to lose weight, really? And does she WANT to? Is she even capable of it?\n\nMaybe it's just because you're a lot physically healthier now, and you want a physically healthier partner that's more physically attractive.\n\nMaybe you are healthier and want her to be healthy too because there are more benefits to health if you are in a healthy weight range.\n\nMaybe you are just not attracted to her anymore or think you can do better. Maybe you want this for you. \n\nWhatever the intentions, if you need her to lose weight to be happy, approach the conversation humbly and cautiously, without any kind of judgement. You were just obese yourself, after all. If it's because you aren't attracted to her anymore, tell her that. Be honest. It's better than lying and breaking up later down the road. If it's because you want to do more healthy activities and you want her to be a part of that, tell her that. Be honest. Tell her you want a long and happy life with her and you want to help her get her weight down.\n\nBut if she doesn't want to lose weight, will you still be happy with her? Or will you resent her for it? Better to just end it then, but DO NOT degrade her or make her feel like she's at fault here. YOU were the one that changed and YOU are responsible for the relationship failing, if this is the case. Don't you DARE blame it on HER weight, when it's you who changed the rules of the game.", "YWBTA, it’s great that you feel better in your body and mind now that you’ve gone on this fitness journey. But it’s not your call if your gf should do it. If you want to encourage more activity, maybe just ask her if she wants to go on a walk with you, or try cooking healthy meals on occasion. There’s no need to bring up weight with her, if she wants to lose weight, she’ll make that choice.", "Yeah, you lost 60 lbs in 3 months. Okay.", "YWBTA \n\nMaybe an indirect approach such as inviting her to do things with you? Walk, light hike, bike ride, certain meals?", "If you do it from a place of love, YWNBTA. But...it's a tricky situation. This nonsense of 'controlling' or 'body shaming' is out of control. Good luck to you anon", "Remember, its always a bad idea to have a chat about healthier lifestyle.", "NTA. Obesity is a huge health epidemic", "I am getting the feeling that there are a lot of overweight people in this thread getting offended by OP", "YWNBTA - it's going to be a hard conversation, though. There's a huge spectrum of reasons for someones body type - my wife, for example who had gained her weight from a combination of medications that set her up for failure, but these medications were saving her life. \n\nI never had the heart to say anything, but it killed our physical relationship, and eventually our emotional relationship.  I've internalized everyting constantly tellilng myself it's not her fault, even as her mental health deteriorated and she failed over and over again to balance things out.  I tried to be supportive, loving, patient,but failed.\n\nOur own relationship is over. Sometimes partners become so divergent in their needs nothing can be done. I'll blame myself for a long time. You'll have to take that leap, and figure it out, but there's no guarantee of success, and there will be hurt feelings. Good luck.", "Yeah everyone is going to whine about fat shaming, but it's okay to want your partner to live a healthy life with you. If you approach it as in \"hey I don't want you to have a heart attack when you're 30 because I love you\" it might go over better.", "Okay imma keep it a buck you want her to try and lose weight okay go ahead and ask she’ll probably get offended but go right ahead and ask I mean technically ywnbta but also you gotta find a way to say can you please lose some weight in a nice not ah way now you see the problem here that’ll be real difficult", "YWBTA if you asked your partner to fundamentally change how she lives her life to suit your preferences. Especially with how you're boiling your partner down to \"she's big\" and that's it. Shit, you've only been together for a few months and You've also been losing weight at a dangerous pace for a few months. Did you only start dating her because she made you feel better about yourself by comparison?\n\n\nYou're not an asshole for having preferences in a partner. If your dream life is running 5Ks on the weekends with your best friend and you're trying to work towards that, good for you. But it's an asshole move to try and force someone who entered the relationship under mutual preferences to shift to suit *your* new preferences.\n\n\nThe non-asshole thing to do here is recognize the fundamental incapability and end the relationship while you're still in the early stage. You are the one changing the terms, not her, and trying to pressure or guilt someone over it is a fast track to hurting people.", "I love seeing how sexist reddit is.", "I can’t believe any of these questions are real. Anyone with even the most cursory experience on Reddit would know exactly how this would go…", "It’s always the dudes who were ones FAT that lose weight who think they have the right to tell their partner to lose weight imagine that", "I recently lost 60 lbs really fast also….I feel like shit. I feel worse now than when I was overweight. My wife saw my progress and joined in but I don’t even want to anymore. But I’m going with her to for support since she asked. I never mentioned anything to her about her weight or anything. Me feeling like shit might be I lost too much too fast and neglected my vitamins and stuff like that which I will get checked on by a doctor soon to see what I need to do to feel better.", "Hmm I think it depends how you say it and on the person. I know people who talked to their partner who was overweight and they worked together to hell him lose weight, no one took it badly because it was for the sake of health and it's normal for partner to worry about their partner's health. Being overweight does come with a lot of problems or possible problems, however, losing weight really quickly is also pretty bad. \n\nI'm not sure how your partner would take it so I can't really say. Even if you say it in the most delicate way it could still hurt her but only you know your partner well enough. Does she have any medical conditions? I know some can cause weight gain or make it difficult to lose weight.", "YWBTA she knows how big she is. If she wants to do something about it she will, but doing this just gives off \"I'm not attracted to you and I'm making that your problem\" vibes. You knew how big she was when you got with her. Maybe she's happy at her current weight.", "YWBTA. If she wants your help, she will ask for it.", "YWBTA You need to remember the 5-second rule of commenting: if something about a person's appearance can't be fixed in 5 seconds, keep your mouth shut. Tag sticking out? Comment. Acne? Don't. Food in teeth? Comment. Weight? DON'T. The only time it's ok to give advice about weight is if you are a medical professional or a parent worried about their child (and then it's should be about health, not weight.)", "Depends on phrasing and actual weight. If you say it because you're worried then N t a but if you just want to bang someone 60lbs lighter then y t a. Also don't ask these types of questions on this sub unless you leave out genders.", "She has to want it. If you say something to her it will just be a blow to her self esteem. That’s the last thing you want to do. Just continue to become more healthy and hopefully it will grow on her and she will begin to focus on her health also.", "So we're you attracted to her before and now you aren't anymore? What changed your view on attraction? \n\nIf you're no longer attracted to her because you went on an extreme diet and weight loss program, I feel like your fat phobia might have always been there but you were uncomfortable voicing it until you went extreme and lost it. Extremely fast weight loss is known for coming back, so maybe don't be so quick to judge. 60+ lbs in 4 months isn't healthy, anyone who cares about you would tell you so including professionals, so don't try to pretend that you are healthy and she is not. \n\nAlso if you're no longer attracted to her, you should just let her know so that she can find someone else, rather than try to fat shame her and make her do what you did. She might be comfortable with her weight and body. \n\nIf you ARE still attracted to her, just let her be her and pipe down about your extreme and unhealthy weight loss.\n\nEdit for typo", "You lost 60+ pounds in a few MONTHS?! B.S. I’ve only seen that on my 600 lb life.", "YTA. \n\nFirst of all, if she wants your help she will ask for it. There is nothing more frustrating than unsolicited commentary. \n\nSecondly, you claim you only care about her health but what you have done is far from healthy. By your own account you lost 60lb in four months, eating mostly lean meat and veggies. Let’s crunch some numbers. A recommended healthy weight loss target is a maximum of 1-2lb per week. There’s about 17-18 weeks in four months, meaning a healthy rate of weight loss would have been around 20-30lb, 40 at the absolute maximum. So you’ve doubled the rate vs what is considered healthy. You did so through a highly restrictive diet, which has been shown over and over to be unsustainable for the majority of people. Those who lose weight rapidly through highly restricted eating habits and very low calorie diets are very likely to gain it back and more besides. Slow adjustments to diet and lifestyle are far more sustainable in the long term. \n\nMaybe what you did works for you. Maybe you’ll be an outlier and keep the weight off. But four months of personal journey does NOT qualify you to be giving weight loss advice to anyone else. \n\nWhether your girlfriend continues to make weight loss progress slowly and steadily, or decides to can the whole thing altogether, is none of your business. If she asks for your input you can give it, but you have no qualifications and no right to be acting like her personal trainer or nutritionist. Keep your comments to yourself until she actively requests them.", "I like that you’ve only been dating for a few months and you think it’s ok to push your partner to lose weight.\n\nLike, good for you. I lost 80 pounds in a year myself. It felt great. But, I’d never push my SO to do it too. \n\nThere’s a lot of stories about people losing a bunch of weight and they start cheating and becoming insufferable assholes. Don’t be like that. IF she wants to lose weight, she will. If she doesn’t, she won’t. Period. If she asks you for help or expresses interest, sure, but otherwise you saying “hey, you should lose some weight. I can help you” is basically telling you “hey, you’re fatter than I like. Let me help”. At least, that’s all she’ll hear.", "YWBTA I gained 30 lbs in the pandemic and if my partner had that talk with me our sex lives would have been ruined. He treated me the same because he loves me for who I am and not just what I look like. I've lost some of it now but have done it because I want to, not because he suggested it.", "IDK - YNTA for caring about her health but this might not be received well.  I guarantee you, she already knows what needs to be done to lose weight and get healthier so you would not be pointing out anything new.  I would really only bring it up if her weight is a dealbreaker for you - especially only after a few months of dating.", "YWBTA obviously. But question - whats her height and weight? Because I swear everytime I see posts like this, the woman is never overweight.", "YTA. 100. This isn’t a case of her having steadily gained weight over a long term relationship and becoming a vastly different person from who you fell in love with. You’ve only dated for a few months and you were presumably attracted to and interested in her as she was.\n\nJust because a switch flipped for you and you’ve decided to drastically alter your lifestyle doesn’t make it okay for you to pressure her to follow suit. \n\nIf this is really a problem that she doesn’t live like the new you, I’d just end it and continue on your journey while seeking a partner who shares your new values.\n\nPressuring her to be like you when she’s not ready to do it for herself will cause her harm.", "YWBTA for sure.\n\nWhat you CAN do is to invite her on walks, plan active dates, cook healthy meals, choose restaurants that have healthy options. In AA they have something about attraction and not promotion. This means that you should model healthy lifestyle behavior around her and be open to answering questions. It also means you need to keep your mouth shut and your opinion to yourself. If she isn't ready, nothing you say or do will mean anything.", "How to lose a partner in ten syllables or less. YWBTA.\n\nEither you love her or not, package and all. When SHE says she wants your help to lose weight, then you can speak up. Not that she wants to lose weight, she can do that on her own, don't even say anything other than \"you got this!\" But when she asks for your help.\n\nOtherwise, keep your mouth shut if you want to keep her.", "YWBTA. \n\nYou were asked in another comment if you plan to stay with her if she doesn’t lose the weight and your response was: \n\nIf she didn't try to make any effort to become healthier, than yes, I'm not sure I could stay with her.\n\nIf she at least tries to be healthier (ie. exercise 3x a week, eat cleaner) then I would absolutely stay with her.\n\nThe thing is, she was good enough to start dating in the first place. And loving someone isn’t as shallow as basing things on their looks. \n\nI might sound harsh here, but so be it: you sound about as deep as a puddle. And the best thing she can do to lose weight easily, is to dump you.", "So she was good enough for you when you were also overweight…but now that you’ve lost 60lbs. She’s no longer good enough for you?\n\nYTA", "LMAO. YTA. Shouldn't have started dating her if you weren't attracted to her. This is a you problem.", "oooof, you are NAH but coming from personal experience there is no good way to phrase this situation.  You can paint it as you care enough about her to want her to be healthy.  Cause body positivity is fine and all but there is a line in the sand.  Being fat IS unhealthy.\n\n&#x200B;\n\nHowever you do have the right to be in a relationship with someone you are attracted to, you don't need to explain that to anyone so best get an exit plan ready.", "So it was okay when you were fat too, but now she too fat to be with you?", "The amount of YWBTA's I'm seeing here is absolutely pathetic. YWNBTA. You would be telling her tips to improve her lifestyle. How in God's name does that make you an AH.", "YWBTA. Just keep doing what you're doing. She will ask for support when / if she is ready. When or if she comes to you, just be ready to fully be there and support her to the best of your ability. That will mean more to her than sitting her down like a misbehaving teen. \n\nI'm starting to make changes myself. Eventually, my partner got tired of being overweight and now we are doing it, well, doing our best, together. I didn't push, I didn't do anything except work on myself. My parter came around when ready. \n\nI totally get it about not minding the extra weight, it's just for health reasons. I'm the same way. I will never abandon my partner just because of weight. Just want their health to be good.\n\nIf this is a deal breaker for you, however (the part where if she decides she doesn't want to lose weight), you should talk to her now and not waste each other's time any longer.", "Congrats on the weight loss. However YWBTA if you just suddenly brought up that you want your gf of a few months to lose weight. Weight loss is an extremely individualistic choice, no one is going to lose weight just because you want them to, they have to want it as well. If this is a deal breaker then let her know. If it's not, just keep modeling the healthy behaviors, invite her to join you in physical activities, make healthy meals for both of you, etc. It does feel really great to lose weight and have less health issues so I don't blame you for being excited and wanting to 'help' in your own way, but it won't come across as help. \n\nKeep up the healthy habits and don't listen to the people screaming that you'll gain it all back asap. You only gain it all back if you go back to the same behaviors that made you gain the excess weight.", "I think you should go ahead and tell her so that she can get out now. She was there for you when you weighed more and you are ready to drop her for not jumping on your over the top bandwagon. \nJust tell her and let her leave you. YTA.", "This is 100% the wrong place to ask this. The fat positivity is strong in this subreddit, everyone here loves to forget that being severely overweight has massive negative impacts on ones health. Her being overweight will impact your lifestyle if you choose to stay with her. She won’t be able to do all of the same things that you would be. Honestly, it’s up to you and where you draw the lines in your relationship. If you want to stay with her, you should be prepared for her to not lose the weight. If you decide that her being that weight is a red line you can choose to end the relationship.", "I’m only going to say YWBTA because you’ve only been dating a few months. You can genuinely discuss this seriously with a long term partner when your health is on the line and you’ve spent years building a future together; kids you want to both be around for, a retirement you want to share, etc. At this stage I think you could ask “hey would you like to go on the diet with me? I could use the support and it could be fun to do together” same with exercise “you should come to the gym with me! I can show you x y z it will be fun to do together”. The way you’ve described it though, getting them to lose weight for your benefit rather than as an activity to share together, is not right. \n\nThe way you suggested going though… you’re going to create some serious resentment and damage your relationship.", "Know what? Break up with her. You clearly don’t love her or you wouldn’t have posted this. \nShe deserves better than your pompous ass. \nNot only are you the AH, I think you know it", "YTA. Love isn’t conditional. Sounds like she can lose 200lbs by dumping you.", "She's obviously noticed the changes in you, and has made no effort to participate. (I don't know if you've ever asked if she wanted to join you at the gym or even go for a walk or if she's expressed even the slightest interest.) Therefore, apparently she doesn't want to, and you would be foolish to bring it up. But, if it's a barrier to your further relationship, you might want to go separate ways.", "YTA.  Yes.  You would absolutely be the asshole.\n\n1. I think this post is BS because you say you've only been with this person for a few months, but have also apparently lost more than 60lbs in the same time.  If this is actually true, you should see a doctor because losing weight that quickly is not healthy.\n2. No amount of \"hey, can you lose weight?\" in all of history has ever been effective.  In fact, it is more likely to have the opposite effect.  If you actually want to help her lose weight, invite her to do things with you that get her active.  Make her healthy meals when she comes to your place.  Recommend healthy snacks in a way that does not communicate that you think she needs to lose weight.  Do things that actually result in weight loss, rather than telling her to do it.\n3. If you can't accept her for who she is now, move on.  You chose an overweight person to be with.  It is unfair to suddenly ask her to be someone different.  If that's going to be a deal breaker, then end it sooner than later so that she doesn't suffer.", "I like how everybody who is actually giving advice on this post is getting down voted and the people being belligerent, mean, bitter assholes are getting top comments. He asked a legitimate question. He wanted an answer He got it. Stop berating him.", "YWBTA- You started dating her when she was the weight she is and you clearly liked her just fine. If she expresses an interest in losing weight and asks you for help, by all means give advice but don’t give unwarranted advice that’s a AH move", "YTA\n\nHelp her lose a whole bunch of dead weight. Break up with her. She deserves better than you.", "YWBTA.  Break up with her if you don't want to date her any more. Don't try to turn her into a project to be fixed. Trust me, as a fat woman, your gf knows full well how society sees her. She's not in denial and doesn't need you to \"push\" and \"motivate\" her.", "NTA", "Yes you be a YTA on this group. Just because you decided to do it for yourself doesn’t mean you can now ask her to as well. \n\nShe is still the person you first met, if she chooses to lose weight then great but you can’t ask her to.", "**Date someone for who they are right now, not for who you hope they might turn into one day.** Most people don’t make major changes in lifestyle, personality, morals/values/beliefs, or behavior. They certainly don’t change just because someone else wants them to, not even a significant other. People *only* change because they genuinely want to make a change for themselves. ...But chances are that who they are now is fairly close to who they’ll always be. **TL;DR: Date someone who is already an ideal life partner personality-wise, behavior-wise, and lifestyle-wise. Don’t date a project, because you can’t make people change and most people don’t!**\n\nYes, YWBTA. She was overweight when you started dating her, and as far as you know she has no interest in loosing weight. If she wants to loose weight she will let you know. If she wants your help doing so *she will ask you for it*. If she doesn’t bring it up *then leave it alone*.\n\nIf you don’t want to date an overweight person then you need to move on from this relationship. If you want to be with her then you need to accept her body.", "Telling your gf you want her to lose weight is extremely tricky. Telling her you're concerned about her health is fine, encouraging her to eat right and exercise is fine but the line you have to walk to get this across without body shaming or tieing her worth to her looks is like walking a tight rope across the grand canyon. Anything could make you fall off that line, and if she's not ready to receive your message, it will be impossible.\n\nGood luck\n\nETA: Personally I think YWNBTA but it's really how she feels that matters", "I think it's more likely you'll catch the eye of a more attractive fit woman and you'll end up leaving to explore the better options you've opened to yourself buy getting in shape.\n\nYour partner will need to decide for herself how much effort to put into her health and appearance.  In my experience the effort required usually exceeds the desire to be fit and healthy in most people.", "Some really naive ass takes in this thread. You are absolutely allowed to ask your partner to consider making lifestyle changes in order for you remain in the relationship. Nobody is trying to take care of morbid ass people in their love lives, let’s keep it 100.", "YTA If you want to go hiking together, cool, but you just lost a ton of weight by crash dieting. If your girlfriend wants to make changes, she can. If she doesn’t, butt out.", "I think you could say it in every nice way you could but she can still get offended. I think asking her if she’d like to come to the gym with you, and maybe cooking her a healthy meal might be nice. But I wouldn’t expect her to receive it really well. Even if she agrees she needs to loose weight it can still be hurtful. I hope she is open and accepts your help", "I feel seen and I am now wondering  if this was posted by my bf.", "Please don't sit her down and talk to her. Try to do things that are more outdoorsy. Like picnic's where you have to walk to get to park. Bike rides to brunch. Hikes with great views.  Shears inviter to do those things. Understand she might not always say yes. Slowly she will start enjoying those outdoor times more and more. Good luck.", "id say NTA, he was overweight which severely limited his dating pool and now he presumably looks a lot better to a large amount of women and in theory is out of her league. maybe he just wants her to be on the same level as him", "Yes YWBTA. You’ve only been dating for a few months and you already want to ask her to lose weight? Just dump her for Christ’s sake", "NAH but think about it this way: if she had asked you to lose weight for your health, how would you take it? You can encourage her to join you in your activities or try out healthier foods you enjoy, but if she isn't motivated to lose weight on her own, you can't motivate her to do so.\n\nIf you no longer enjoy doing the same things and eating the same things, maybe you've grown apart.", "Sixty pounds in only a couple of months? You'll be gaining those back. Also, yes, YWBTA.", "YWBTA. You can ask her on active dates, like a nature walk or just walking around the mall. You can ask if she wants to join you at the gym. You can recommend your nutritionist because you love them so much. You can slowly recommend changes like drinking more water, having a proper sleep schedule. But definitely not all at once. Could you really have changed before you were ready?", "As someone who lost 30+kg myselfe I see the whole why would he care now that he lost some weight and not when they met bs. in a totally diffrent light. When I was nearly up to 100kg  I never would have thought to tell someone to loos weight and live helthier because how the fuck am I entitled to do that shit when I'm not doing it myselfe. I was also not sure if I would have the comittmemt to loos weight so why expect it from someone els. Then I pulled through. It took me three years to do it, gradually loosing weight to the point I'm at now. I know I'm helthier now, and now I feel like I can tell people to loos weight, to be more healthy, to push through even if it's hard because I went through it too, it's not impossible and it improveres your live expactency and your life qualety in the long run, you might not feel it now, in your twenties, but your joints, your heart and a lot of other things will thank you, if you loos weight now.", "These sort of things are never appreciated. If her looks repulse you then I suggest you break up. Otherwise give encouragement when she makes positive steps.", "Would you be offended if she suggest you get penile enlargement?", "Yes, ywbta. You should focus on yourself and just be a healthy example and influence. You are clearly judging her if you choose to push your newfound lifestyle on her and would completely be TA", "What will be great is when she starts losing and you start gaining. She starts talking about the guys at the gym. Good luck bub.\n\nYWBTA!!", "NTA, there is nothing wrong with you asking.\nAssuming you do it politely and considerately.", "Ugh just let her know you're wasting her time and go find yourself a \"healthy\" woman.\n\nDating a few months and ready to dictate her lifestyle, WOW. YTA.", "That’s brilliant!", "And a super easy way for her to lose 150+ pounds in one go!", "I'm a little torn about this, but i think YWBTA. \n\nOn the one hand, as someone who lacks the motivation to eat healthier and exercise more, I would love it if my hypothetical partner did that.\n\nOn the other hand, you've only been dating a few months. Encouraging her to lose weight, regardless of your true intentions, would certainly come off as rude and shallow.  \n\nI guess it really depends on your relationship dynamic but I would only do that IF she has expressed interest in it.", "This is the way, to do that 👍", "Correct, it took me 4 months total to drop 60 lbs, I started losing weight around the same time we started dating. I can see a lot of people are surprised, my friends and family were very surprised as well. \n\nYou're probably wondering how I did it, and honestly, it wasn't that tough. I basically just ate nothing but lean meats/vegetables for 3 meals a day and stopped snacking late at night.", "Losing sixty pounds in three months is **not** \"getting healthier\".", "Yup.  This.\n\nI'm in the same situation. I lost 60 pounds.  My husband has about 150 pounds to lose.  I have not said a word to him.  I have, however, supported him in whatever way he asks. While we have mostly healthy foods in the house, I stopped buying nuts and cheese when he asked me to because he has trouble limiting his portion sizes.  When I cook, I stick to healthy options, he can eat more of the Good Thing if he's hungry for more than a single portion.  I give him time and space to do his own exercises that interest him and would never ask him to work out with me.", "*If she wants his help", "Fitness preacher! Lmao perfect\n\nOP, YWBTA", "It seemed like you would want more INFO on this.\n\nShe has expressed she wants to lose weight and has made very small changes to attempt it, but to me, it seems like she doesn't really know where to start or what to do. I'd like to think I could be a catalyst for improving her health. \n\nI was at a big risk for heart disease when I was bigger, but now that I have made some improvements in my life I have immensely reduced that risk. \n\nI've realized that I want to grow old and live a long, healthy life with my partner. If that isn't what she wants either then maybe we arent meant to be.", "If you lost 60 pounds in a couple months, you'll probably be welcoming them back to the fold soon enough, because odds are you didn't do it in a sustainable manner.", "Nobody said anything about bullying her. It's just that he's encouraging her to get healthy.", "I wouldn't say an \"expert\" but I'd like to think I learned a lot about losing weight in the last few months.\n\nI certainly don't want to bully my gf about her weight. It just concerns me when she said that her doctor told her that her blood pressure is higher than it should be or when she gets exhausted while taking a 25min walk in the park.\n\nIt's not necessarily about the weight, to a certain degree, I kinda like bigger women. It's more about heightening the quality and longevity of her life.", "What is your bases for assuming that it’s not out of concern for her health? If anything, he would just leave her and find someone skinnier. He’s only been with her for a few months; so, there is not a lot invested. \n\nI think he’s wrong for trying to push her to lose weight, but he seems to genuinely care about her.", "Correct, it wasn't that complicated either. I wish I did this years ago.", "It took me 4 months total, major component to my weight loss is being in a calorie deficit with prioritizing lean meats and fresh vegtables for all my meals. I also do alot of cardio and weight trainning 6x a week.", "Right, and while losing weight can change who's attracted to you, it doesn't really change what *you're* attracted to. So either he's still attracted to her and just cares about his image and who he's seen with, or he never was attracted to her in the first place but thought she was the best he could get, and neither is a good look for him.", "She has expressed interest, I don't assume all fat people are as miserable as me. But one thing I can be certain of is that I never want to be my old weight again. I feel way better and have immensely more energy throughout my day. I wish I made healthier choices years ago.", "If she didn't try to make any effort to become healthier, than yes, I'm not sure I could stay with her.\n\nIf she at least tries to be healthier (ie. exercise 3x a week, eat cleaner) then I would absolutely stay with her.", "This is actually such a healthy mindset. You and your partner are very lucky to have each other.", "Keeping myself in a moderate calorie deficit and regular activity/exercise. My diet consists of lean meats and vegetables. I don't snack on anything other than some fruit, I don't drink alcohol and I don't drink any soda.", "4 months, I wish I built these habits years ago.", "This was actually some great advice, thank you soo much.", "If OP was 600lbs then he very well could have lost 60lbs in 4 months. The amount of calories needed to sustain 60lbs is a lot and to go down to a normal amount of calories could mean an extreme amount of weight loss. It takes (I think) about 3500 calories OVER your daily caloric intake to gain 1lb of weight. So if OP went from eating 5000 calories a day to a more usual amount around 2,000, it would be perfectly normal to lose that amount of weight.", "Maybe...OP Never gave us HIS weight. It's probably \"personal\", or \"I care more about BMI than weight\"", "Hey, I have borderline, too! 40M", "I wasn't wondering lol. I just wanted to verify if I'd read right.", "It’s a lot harder for women to lose weight. And if you’re expecting her to be able to do it like you, you don’t know as much as you think. There’s different hormones, cycles, and menstruation. All make it harder and different. If she want advice, she will come to you.", "This was my big takeaway - the math on \"we've been dating a few months\" and \"I was overweight when we started dating but am now down 60lbs\" says to me that he used crash dieting to lose a lot of weight more quickly than is healthy, and is in no position to advise anyone else on weight loss.", "I would agree I went a little extreme with the diet and exercise for a bit. But I have never felt better and my doctor says I have made a tremendous leap forward in terms of my cardiovascular health. It may not work for everybody but it worked for me.", "My husband loved when I started my diet. I changed the foods that I cooked and stopped buying snacks. I lost 20lbs, he lost 40lbs.", "Given that you lost weight at about twice the pace generally considered to be healthy, I don't know that I trust you perception of what a \"very small\" change is. That kind of caloric deficit can be very damaging to your heart. Regardless, you've only been datimg her for a few months and you haven't maintained your current weight very long. You're not by any metric qualified to give her advice on this.", ">She has expressed she wants to lose weight and has made very small changes to attempt it, but to me, it seems like she doesn't really know where to start or what to do.  \n\nHas she asked you for help?", "Thanks for the clarification! You're right, if you have different priorities maybe you aren't meant to be. Just ask her if she wants you to help her get started. Yes - you both get a work out buddy, no - you might want to ask yourself what you want in the long run. \nWill you still love her if she doesn't lose weight? Or do you want a partner who has the same priorities (and body) as you? \nYou don't have to answer me, that's just something you might need to bring up during the conversation.", "If she's like me and many other fat women, I'm sure she knows what doesn't work for losing weight for her. The last time I was able to lose weight, I was on extreme calorie restriction and taking prescription diet pills. My health has decreased drastically since then, not in relation to my weight. I now have POTS positional orthostatic tachycardia syndrome which means that my heart races when I'm upright or standing. So phentermine isn't an option anymore. I've recovered enough from the POTS that I can now get out of bed and continue breathing so I've started the very carefully designed cardio program for people with POTS. My weight stayed in the same 5 lb range the entire time I was bedridden even with no activity and not watching my diet. \n\nI am sure that she deals with enough fatphobia from everyone else in her life, including her doctors ignoring any concerns she has and saying that it's just because she's fat. Don't be the person adding to that and making her feel that she has to be skinny in order to have value.", "Except… OP isn’t healthy himself. Losing 60 pounds in 90 days is literally insanity, and a major red flag that OP severely restricted his calorie intake to a dangerously low and unsustainable level, and exercised on top of that. Now, simply not eating is effective enough on its own to shed pounds fast (recovered anorexic here), and that is very clearly what happened here. Unless OP was originally 400+ pounds, a healthy diet and exercise routine would not come close to taking off 60 pounds in that short amount of time. And the fact that 60 pounds is all OP needed to lose for their goal, he likely wasn’t 400 pounds. When he can’t maintain eating literally nothing anymore, he’s gonna be shocked to see that weight come back. \n\nHe wants to encourage his GF to crash diet with him. That is so beyond harmful physically and mentally. Skinny and healthy are not synonymous, but people with no understanding of actual health and well-being (OP for example) seem to be unable to grasp that.", "If you lost 60 pounds in 3 months you may have learned a lot about disordered eating. That is a much higher weight loss than is generally recommended (1-2 pounds per week is what most healthcare providers would recommend). Now if you were hundreds of pounds overweight then a very quick drop in weight like that might be routine, but if 60lbs was the total of what you needed to drop, I'd have a hard time being convinced that a loss of 60lbs in 90 days was a healthy thing to do mentally.", "As someone who works in the field, I would argue that *you know nothing about weight loss for other people*. \n\nYou know what has worked for you, in the short term. It may work for you long term, but you don't even know that yet.\n\nThe obstacles you have overcome and the strategies you have used may not be in any way related to what would help anyone else.\n\nWeight loss is mostly about the psychology of behavior change. While food is the same, *the function food plays in people's lives* is drastically different from person to person. Similarly, while one person might lose weight with a fairly straightforward approach, many people will have to work through the complexities of their relationships with their body, their emotions, rewards, relaxation, procrastination, and so on. That's before we even get into the basic physiology of hunger and fullness.\n\nHere's a look at the complexity of obesity: [https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment\\_data/file/296290/obesity-map-full-hi-res.pdf](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/296290/obesity-map-full-hi-res.pdf)\n\nOf the dozens of factors that show up in the above obesity systems map, most people really only need to focus on a few. But you can't automatically assume that the 3 or 4 that you had to deal with are the same 3 or 4 that someone else would have to deal with.", ">wouldn't say an \"expert\" but I'd like to think I learned a lot about losing weight in the last few months.\n\nYou learned about crash dieting. You learned nothing about health or healthy weight loss.", "You haven't learnt shag all until you can keep the weight off. \n\nYou need to re think all of this, or you're just going to upset her. \n\nYTA", "Losing that much weight in just a few months doesn’t sound healthy. There’s a good chance you’ll gain it all back over the next year or so… are you working with a doctor or nutritionist or something to help avoid that?", "Please educate yourself on the Dunning Kruger effect and take a massive seat, thanks\n\nhttps://www.verywellmind.com/an-overview-of-the-dunning-kruger-effect-4160740", "Women lose weight a lot differently and it's way harder than for men as well. You are such an AH sit down.", "She’s 27 years old. She’s lived her whole life in that body. She has a doctor. If she wants health advice, she has the intelligence and capability as a full grown adult to speak to her doctor about any concerns or actions she wants to take. She doesn’t need someone who lost a large amount of weight in a very short time recently who hasn’t even shown their weight loss is sustainable or long term. \n\nYou are high on your own success in your own goals that you made for yourself. Don’t you think she’s capable & competent to create her own goals & to manage her own healthcare?", "Then don’t bring up weight AT ALL. Encourage healthy behavior because you want it to be a part of your lives together. Recognize that it may or may not result in your gf losing any weight, but that eating healthfully and exercising will benefit her in the ways that matter more, even if she does not lose a pound.", "She could make healthy changes to her lifestyle that improve her blood pressure and increase her energy and endurance, and those healthy changes may or may not result in her losing weight. But you didn't come here to ask if you would be the asshole for trying to help her get her blood pressure under control or to increase her level of physical activity, so I suspect those aren't actually what you are concerned about.", "Please listen to the podcast ‘Maintenance Phase’. It will unpack why talking to her will only make her feel worthless.", "Bro learned what an extreme calorie deficit is and became a registered dietitian and personal trainer over night. You know nothing about weight loss or health generally, because you have no real experience or education in the field or on the subject matter. \n\nThe one person who is qualified to speak to your girlfriend about her weight and potential weight loss plans is her doctor. \n\nYou are a major AH 1. For thinking your crash diet is a health improvement. News flash, when you can’t maintain whatever diet you’re on, you’ll gain some weight back. And 2. For thinking losing weight fast means you can now give diet and health advice to your gf. \n\nIf she wants your help, she will ask you. She was good enough for you when you got together, but now you clearly think she is physically not good enough because you figured out that eating less= shedding pounds. You would be an ever bigger AH to sit her down and discuss her losing weight unprompted.", "You haven't learned a lot in the last few months of you've lost 60 pounds in that short of a time frame, because if you did, you'd know that losing the weight that fast is remarkably unhealthy. **Doctors** (you know, the actual ones with the medical license) would likely classify that kind of weight loss as a medical concern, because it could be a sign of any number of issues. 1-2 pounds per week is what the standard *healthy* weight loss speed should be, so about 8 pounds a month. You lost a little under three times that amount. \n\nShe may also have conditions that make it harder to lose weight, on top of it already being harder to lose weight because she's a woman. Her body just naturally tries to hold onto fat harder. The weight loss conversation, if she wants one, should be between her and her doctor, not her and her boyfriend of a few months. If you do talk to her about it, she's likely to immediately think you're being snooty about it because \"oh look at me, now that I'm no longer fat, I have opinions about your weight\" is exactly what she's going to hear coming out your mouth. \n\nYTA", "I know a lot of people that have insane high blood pressure but that doesn’t mean it’s their weight.", "he lost 60+ pounds in a few months? idk man something about him suddenly wanting her to lose weight AFTER he lost weight makes me think it isnt just about her health. Either way if he asked, he'd be a dick", "Because they’d only been dating a few months. To think he has access to her health records & her conversations with her doctor is ridiculous. He knows her size. He has no idea what her overall health is. Fat doesn’t necessarily equal unhealthy just like skinny does equal healthy. \n\nShe’s an adult woman who has lived in her own body all her life. \n\nThe whole “but I’m just thinking about your health” is bs and infantilizing.", "Because he wasn't \"concerned for her health\" when they met. And also if someone loses that much weight in that amount of time it's not about \"health\" it's about how they look. It's absolutely dangerous to lose weight at that rate.", "Hahaha oh. You're one of *those*.", "It's easier for men to loose weight compared to women. So no, you're not an expert.", "7kg a month seems really unhealthy", "If you wanted to make a healthy choice you wouldn't have chosen to crash diet. You wanted to lose the weight for looks, otherwise you would have done your research and found out that crash dieting almost never succeeds in the long term. You are in no position to give anybody dieting advice. This would be like a days-clean junkie lecturing the next addict about recovery, my dude. Please come down from your high back to reality.", "I'm going to have to say that YWBTA. Her weight was not a consideration when you started dating because you were fat too. Now you're not, and she's not good enough unless she at least tries to change. \n\nMy fiance fell in love with a 250lb me. I was thrilled to stay with him after I lost 90lbs without ever expecting that he do the same, because he loved me for me. I feel like you might want to revisit your reasons for staying in this relationship and please don't fat shame your girlfriend.  Encouragement is one thing but expectation is fundamentally flawed.", "You’re changing the terms of the relationship. That’s really unfair to her.", "Then just break up with her lmfaooo. You’re gross. Stop wasting her time.", "Out of curiosity, what exactly do you mean by healthy here? I'm considered overweight based on the BMI scale. My latest bloodwork had all of my stuff in very good healthy ranges. I'm fat but my physical health is already decent. Is this about her being healthy or is this about her physical looks? Be honest here.", "15 pounds a month is kind of insane, and you probably crash dieted. Cool, but you shouldn't expect her to do the same. If she wants to follow a \"moderate\" plan, she will probably lose 4 pounds a month.\n\nEdit: My point is, if she wants to lose weight it has to come from her. Because when It's been 4 months, and she's lost probably 10 to 12 pounds ( or less!!), both of you are going to be disappointed because it's taking a lot longer and is more frustrating than she expected.", "*Eating Disorder\n\nYou spelled habits wrong.", "You just gotta remember you probably are gonna have to find a new gf after this but is that a bad thing?", "That’s what I said. I’ve only seen it on that show where we are talking about people weighing 5-700 pounds. But if that were the case, I’m pretty sure it would have earned a notable mention in the story.", "Well cool?\nWhat kind?", "No but don't you understand, OP has what they deem to be valuable knowledge and insight.... OP sounds like one of those obnoxious people who learns something new and acts like a resident expert to anyone in earshot.", "Update us in 6 months. That kind of weight loss is most likely not sustainable.", "Give it a year.", "You don't know yet if it worked for you because you need more time to observe all the changes.", "HAHAHAHAAHAHAHhahahaahahahaahah.haaaaa buddy. You have no idea.", "I mean, you'll be gaining it back shortly most likely, since rapid weight loss like that is never lasting. I wouldn't burn the bridge with the person you're currently using for sex, oops I mean gf.", "61 down votes, all I see is 61 haters who are too lazy to do it for themselves.", "Not to mention that it makes it much more likely you’ll gain all that weight back (probably then some) AND it will be much harder to lose again", "Just wanted to add the women have estrogen and weight loss would look vastly different. On top of that 60 pounds in a few months is INSANE. I don't know what would constitute this much weightloss aside from starvation and an underlying health condition. Doesn't sound good in the long term. Cardiovascular effects can't be accounted for until he has had maintained this lifestyle for at least a year. Yes, being sedentary is bad for your health but any extreme is equally dangerous. Anyone that is sitting here saying fat bad drrrr is likely operating on 0 brain cells. All humans need a certain percentage of fat to function and protect their organs, the distribution of fat varies based on genetics. There are some skinny mfs with poor Cardiovascular health because all that fat is not visible.", "This right here! ^^^", "It also suggests a newfound (of obsessive) awareness of health.  If all he wants is a skinnier chick, he can go find one.", "If you are very overweight you are not healthy. Be who you want to be and live your life, but lets not pretend being overweight is healthy. I don't pretend that its healthy for me to weigh 40-50 lbs more than I should.", "What’s ridiculous is your claim that fat people are healthy.  \n\n“The latest science is quite clear, that excess weight we can carry serious health risks, including heart attack and stroke.”\n\nHarvard physician. \n\nhttps://www.health.harvard.edu/staying-healthy/can-you-be-overweight-and-still-be-fit#:~:text=The%20idea%20that%20someone%20can,and%20stroke%2C%22%20says%20Dr.\n\nI know this post will get downvoted anyway because of emotions lol.\n\nEdit: proving me right! Feelings > Facts😂", "He wasn’t concerned about his own health either. Obviously, his attitude changed and he became more aware of health issues. \n\nAnd I’ve already proven that being overweight is hazardous to your health.", "No one hates fat people quite like a Formerly Fat Person who just lost weight! 🤷", "Right? Like ok cool you're a dude who put in some effort for a few months and got your desired outcome. For a woman, and especially if she's short, she will have to completely change the way she lives her life and obsess over food for probably over a year to lose 60 pounds.", "I don't think is that unhealthy when people are very overweight they loose a lot of weight very fast at first. Because they have a lot. You can't compare it it to you if you are not as overweight as him because is not the same to him to loose some kg than to you to loose the same amount of kg", "OP doesn’t owe anyone a relationship, wtf? OP has recently had a values realignment and is realizing that that may make them incompatible. That would be nobody’s fault if they break up.", "Impulsive.", "You're saying I should wait a year before talking to her about changing her habits to improve her health?", "If his doctor has stated that he’s made cardiovascular progress, we can probably believe it. \n\nMaybe I’m off, but it feels like youre looking for a reason to shit on his success.", "Oh man t_gammatolerans, whom you may know from reddit, knows more than doctors! That’s amazing!", "Surely he has a much better idea now that he’s been laughed at. Nice contribution. Hahahaha aaaaa buddy.", "And that yoyoing weight like that is actually worse for your heart than simply being overweight.", "so youre thinking he might be orthorexic?", "I didn't say being overweight isn't hazardous to your health I said ALSO losing weight at that rate is hazardous to your health. So if it's *really* about health why not do it in the most sustainable, healthy way, along with supervision from a doctor. Any dietitian or doctor would not advocate or support this much weight loss in this amount of time. \n\nHis \"expertise\" or concern on this matter means nothing because he's not a doctor AND because he's doing something that is also hazardous to his health. He will most likely gain this weight back. \n\nin this situation he is the AH because he's acting like he knows about her health or about health at all. *it is not about health* \n\n Also fat shaming people/ pressuring them to lose weight will NOT help re--> [\" fat shaming making people sicker and heavier \"](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6565398/)", "he would basically have to starve himself to do it..i had weight loss surgery and it took me 6 months to lose 70 lbs. unless he started at like 400 lbs this doesn’t seem like he did it in a healthy way.", "Are you responding to the wrong comment? Who said anything about owing someone a relationship? I said it’s unfair to change the terms of the relationship like this. If he doesn’t want to be the relationship with her anymore, he shouldn’t lead her on.", "Emotionel here, with bordeline to depended", "They're likely saying most people gain the weight back after crash dieting like that.", "Also give it a year because an extreme, drastic weight loss regimen is not sustainable long term, and many people will gain back the weight under such circumstances.", "They're saying that so early in your weightloss success you are in no position to advise anyone else. Statistically it's vanishingly unlikely you'll keep the weight off for 5 years. Of course some people defeat the odds and I sincerely hope you're one of them, but it's like being one week sober and thinking you can lead AA. Give it time.", "No. They're saying that unless you keep the weight off for a year you cannot actually say you have made healthy progress. Yoyo-ing up and down because you are no longer following an unsustainable crash diet can be worse for you than not losing weight in the first place.", "Don't listen to this person at all. They may either have no idea what they are talking about, or are a bitter overweight person themselves who hates seeing other people have success.", "Long-term effects of extreme restriction will come along the lines of metabolic and immune system damages. Some people can get away with short bursts of extreme restriction, but [the adaptative thermogenisis](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3673773/) could also cause long-term issues with his health and a regain of his lost weight due to hormonal changes on his appetite queues and slowed metabolism. Health is not a one dimensional metric, so while it's great his heart has improved from no longer carrying additional weight, his heart plus his other health metrics could have been improved or at least not impacted too much with a smart, measured approach to weightloss over crash dieting.\n\nGenerally, people who only know how to lose weight never learn how to actually eat properly when they're not in a restrictive cycle, which contributes to why only 20% of folks who lose weight manage to keep it off over multiple years.", "I think it’s more that for most people extreme calorie restriction for rapid weight loss doesn’t translate to long term weight loss. Studies show it can slow your metabolism which makes it easier to gain the weight back. It’s really premature to say that his method is truly successful. \n\nSustained life changes are required for long term success.", "You're off but that's ok. \n\nI know than not everyone can get the idea of long-term consequences.", "Recovered anorexic here. My cardiovascular health was fairly strong my entire life, I was an athlete before severely injuring myself. I have always been able to exercise without issue, and I can distance bike like nothing. My strong cardiovascular health didn’t save me from anorexia induced GI issues (IBS for the rest of my life), food intolerances and the fact that I became severely anemic due to an insufficient diet. \n\nHis cardio health likely improved in the short term. Basic logic dictates that the less hard your heart has to pump to get blood around your body, the better. But the long term effects of malnutrition and over exercising is heart failure. You don’t immediately get to there. It’s more than likely this improvement will start to take a bad term the longer OP restricts calories to this degree. After years of sustained malnutrition, he might have kept the weight off, but say hello to heart issues and probably type 2 diabetes.", "the science is well known. one doctor making a comment on EXCLUSIVELY his cardiovascular health does not even contradict that.", "It’s not my responsibility to tell a grown ass man that keeping the weight off is harder than losing it in the first place, and this new health spree is most likely going to be short lived.", "You have to crash diet pretty hard to lose it that fast. His changes probably aren't sustainable.\n\n(He's gonna start dating a thin girl, gain back his own weight, and either get a lecture from her or dumped by her for the same reason. You can almost bank on it.)", "You absolutely can change the terms of the relationship, not to coerce her into staying but as an explanation for why he’s leaving. The two obvious outcomes after reading OP’s story are that she will change or he will leave. (I guess there is a third option, that she doesn’t change and he’s okay with it, but that seems unlikely to me.) \n\nYour comment gave me the impression that he’s not allowed to enact either of those first two options and that he has to just suck it up. Since you’ve now said you think it’s fine for him to leave, we have no disagreement.", "Gotta jump on board with this one and say listen to your doctor not random redditors who think they understand your situation based solely on the weight loss timeline. \n\nAs far as the aita goes it sounds like a potential life style clash. I'd try to think long and hard about this OP, how important to you is it that your partner matches your new life style? You have not been dating long at all and frankly that's the best time to say \"I don't think this is working out for us\". Rather than trying to change her you need to ask what you want out of a partner.", "Yeah I’m aware of potential downsides of extreme weight loss. It’s very common in bodybuilding. The point here is that he’s clearly been following up with a medical doctor, and no Wikipedia article is going to supersede the opinion of the attending medical professional.", "Yeah for sure some people just don’t get how to meet their goals. I’ve been bodybuilding for over twenty years now and whenever I help people I try to stress how a diet has to be sustainable to be effective. \n\nIn this case though, I think you’re wrong. Most crash dieters I’ve trained wash out before even a month. Three months is when most people are more or less adjusted, and OP is over four.", "Even if it were your responsibility, you would choose not to help him. You’re just so obviously rooting for him to fail. It’s telling.", "and my only point is just because the doctors happy with his heart results right now doesn't mean that he's immune to the long-term health implications of his choices. Just because he sees a doctor doesn't mean that he's now vaccinated against the scientific effects of poor choices.", "I'm not wrong because all I said was that you can't \"know\" after just four months.\n\nYour \"I think (...) because (...) most people\" proves nothing.", "I wouldn’t call it rooting for him to fail, I would call it laughing at his obvious ignorance and naivety to the situation, and how it’s affected his ego.", "Yeah I don’t disagree that there is a possibility there could be something wrong down the line. And I could have some secret cancer that ends me in a month. It’s all conjecture for us, and most rationale minds would bet on the doctor’s opinion over ours.", "This is boring now. \n\nExactly how many months does it take to know you’re getting healthier? Eight and three quarters? Who would you trust to make this determination? \n\nJust admit you missed the part about the doctor, JFC.", "Well he hasn’t failed yet. As of right now, he’s successfully lost weight. But keep laughing at the person bettering himself. Clearly he’s the person who needs to change, never the girlfriend who has herself expressed wanting to lose weight.", ">This is boring now.\n\nThen why are you still replying?", "INFO: How overweight is she?\n\nIf she's like 20 pounds overweight, then you would be the asshole under all circumstances. \n\nBut if she is 200 pounds overweight, you would be an asshole if didn't say anything but even then you would be on thin ice for how you go about it. Don't frame it as you need to lose weight but encourage things like \"let's go for a walk today\" or \"let's join a martial arts class (or some other physical activity)\" or \"I'll cook dinner for you\" (and then make something healthy). Encourage healthier behaviors rather than putting down her unhealthy ones is probably the best approach.", "Dude, Don't do it.  You're not allowed to say anything about a woman's weight. NO MATTER WHAT.\n\nYou'll ALWAYS be seen as an asshole just for mentioning it. Act like the word isn't even in your vocabulary. Don't believe me, just give it a try and see what happens. You'll learn.", "U guys are all saying he’s the ahole but she will lose him too if she doesn’t change weight \n\nHe’s asking this respectfully and you are all attacking him like he’s the worst\n\nI’m now speaking to the op (I have a feeling many of the commentators on this chat are unhealthy when it comes to their weight and are projecting)- the key to this is respectful communication.\n\nYou never want to to tear down only build up so don’t use words that would imply she’s less than but rather you want to see her even better than she already is. DONT USE THE WORD FAT- game over if you do \n\nSay very respectfully but clearly how you love the time already spent together and you could see this going even further and hope for it to but you have a certain lifestyle and you would love if your partner could try to try out your lifestyle (in the same way I want my partner to be into my Netflix shows I would want her to be into my lifestyle)\n\nYOU GOT THIS- just be respectful and communicate well", "You’re going to think I’m the asshole but I want to say some things that are part of the Canadian best practice for obesity guidelines.\n\nObesity creates changes in your body.\nWeight loss creates changes in your body.\n\nBoth changes are permanent whether the symptoms are evident or not (ie) when you lose weight, you’re still obese and when you regain weight, the changes that happen in weightloss also stay, even though you’ve lost the symptom of weightloss.\n\nThis means that weightloss, while  awesome in many ways, is not benign.\n\nThe odds are very good YOU are going to regain your weight. Like 98% probable, depending on how you lost it.\n\nThe cause of this isn’t slovenly gluttony. It’s homeostasis. Your body, through an intricate combination of hormones and metabolism will push you into gaining weight. You won’t even realize what’s happening, you’ll just think you’re a screw up slob who failed again. \n\nThink if it like a woman ’deciding’ mentally not to have her period. Does that work? No. Obesity is also hormone driven. And that’s why so many people regain.\n\nIt’s probably a better idea to see if a) you can sustain this way of life ( which depending on what you did to get there, maybe not) or to have a conversation about how you want to maintain your health and how you’re hoping to do that. She may want to join you or not, but I’d be conscious that you have a lot to lose if you screw it up.\n\nIt’s not impossible to have a relationship with someone who doesn’t have the same priorities but it helps if you’re both on board. But especially considering you yourself may be in jeopardy of regaining, consider strongly how you’ll feel if it happens to you and you’ve lost HER.\n\nFrom my perspective, when you find someone special, it’s important and life is long in a permanent relationship. You’ll both change sizes ( statistically likely) and the more important thing is can you work together?\n\nIf you want to read the document, you can go to obesity Canada’s site. It was published in 2020 by about sixty doctors who work in the field. This document is being taken on by a lot of countries. Again, it’s a best practice guideline.\n\nI am someone who has been maintaining a large weight loss for a long time but still, even as knowledgeable as I am,  and experienced as I am, I can feel the homeostasis kicking in. It’s not as simple as move more eat less at all.\n\nAlso, I resolved ALL my health problems including type 2 diabetes, hypertension and a whack of getting old body aches. Im doing amazing things in my life, but I am still conscious that it’s a tightrope.I’m VERY motivated and have been for years but am still subject to, you get it, biology.\n\nIm also conscious that for me, a BMI of 38-40 maybe as good as it ever gets after a half century of obesity/weightloss yo-yo.\n\nI don’t actually think you’re an asshole at all, but I do think that you have a lot to think about.", "Lotta people here throwing hissy fits.\n\nIt *is* rude to suggest someone should lose weight. And it is also a comment that can come from a totally loving and supportive place. Unfortunately, your intentions don't change the fact that 99.9% of people are going to be hurt by such an interaction.\n\nWhat this shows is that there *might* be a huge difference in values between you and your girlfriend. If she doesnt end up wanting to lose weight after X number of months (the time limit you give to figuring this out is a personal decision), then she just might not be the right person for you.", "Ywbta.  She is the same as when you met her...just a few months ago.  You're the one who has changed.  If she is no longer what you want, that's one thing...but you don't get to 'push' her into changing for you.", "NTA for talking to her and asking her if she wants to join your journey but understand that she may not be ready. If this is going to be an issue for you, you owe it to be to tell her now and not waste her time.", "NTA.  People change. If this is a deal breaker for you, you need to bring it up.  It’s better than quietly sitting there thinking your partner is fat.  That’s not healthy for either one of you.  The key is to bring it up in a healthy, considerate manner.  That’s probably impossible.", "> with me\n\nFor this reason you are YWNBTA. It is very important that in a relationship both parties are willing to make sacrifices and to put in effort for each other. If you are willing to put in the effort to make yourself more attractive and she is not, the relationship will not work. If neither of you were willing to do anything it would not work. If both parties aren’t willing to do or change anyhthing for the other then you don’t have a recipe for a successful relationship.\n\nAnother way of looking at it:\nyou are clearly not attracted to her right now.\nIf you do nothing:\nyou will remain unattracted to her and the relationship will fail\n\n\nIf you ask her:\nIf she says no:\nmay increase tension, you will remain unattracted to her, the relationship will fail\n\nIf she says yes:\nIf you both work together to solve the problem, and you succeed, you may become attracted to her and the relationship may succeed especially if you are bith willing to put in a similar amount of effort in the future.\n\nThe relationship will almost certainly fail if you do nothing. You need to communicate, speaking with her is the only option. This isn’t even to mention her physical health.\n\nEDIT: just read the part about you losing 60+ pounds in a few months. Depending on how many months is “a few” that may or may not be on the extreme side. (1-2 pounds per week is considered normal). It would definitely not be a good idea to convince her to do something so extreme, but if you are willing to put in that much effort, you are obviously willing to put time and effort into a relationship, and it is not unreasonable to hope for a partenr to\ndo the same for you.", "I think it comes down to how you ask. Just coming out saying “I’d like you to lose weight” is 100% gonna make YTA. However, if you just started inviting her to the gym when you go, like “hey I’m gonna go to the gym, wanna come with?” Then she has full decision making to say yes or no. On top of that, ACCEPT whatever answer she gives. If she says no, that’s that, don’t push her. If she decides to go, don’t flood her with advice and workouts and such. Let her feel out the gym for her self. If she asks questions, then give answers. If she doesn’t, let her feel it out herself. This is a delicate situation that can very easily turn into a YTA situation. Even if your intentions are “good,” wanting her to lose weight simply because you did is an AH move. \n\nAnswer: YWBTA if you just tell her you want her to lose weight. NTA if you offer for her to come with, and accept whatever answer she gives.", "NTA you know what you want for your life, if she doesn't want the same (lose weight, and be healthy) then better for both.\n\nYou won't have to tolerate her behaviour, and she can eat until she dies.", "NTA but it is her right to be as fat as she wants to be..but there is a major cost to her rights.. do you want to pay them ? you have discovered the joy of losing and the benefits.. obiviously, she has not connected the dots..🚩🚩 Time to re-evaluate the relationship.", "YTA let her go so she can find someone else who loves her for her and doesn’t want to change her.", "Yes you’ll be the AH, you can just break up with her rather than trying to build a bride. People change and that’s fine but you can’t force her to change too", "Yes. YWBTA she only needs to lose weight if she wants to.", "YWBTA - I think most people here have covered why you are the AH. But I would like to also point out the women and men have very different hormones and as a result it will always be easier for you to loose weight with just some basic exercise and healthy eating. For her it may well end up being a struggle that will never end and will destroy her confidence trying to obtain standards you wish should could reach.", "YWBTA.  You say that she recognises that she is overweight, but is she complaining about it?  Has she raised the issue and said that she really wants to lose weight?  Because if she hasn’t then you would be an asshole. \n\nYou say that she is a great person and that you have similar interests, and yet that isn’t good enough for you?  She was good enough for you before you lost weight, but now not so much.  So it looks a lot like you don’t want her to lose weight for the benefit of her health, but because you now feel embarrassed or uncomfortable being seen with her and don’t find her as attractive anymore.\n\nYou are 23 years old, but in a decade or two you may realise that being with “a great person who has similar interests with you and who you really like and get along well with”, is an absolute blessing.  But if her weight is now becoming an issue for you, and you want to change her into someone who is worthy of your new found standards, then give her the opportunity to meet someone who will appreciate her the way she is.\n\nAlso, you could lose this lady and at some point regain the weight you lost, get a scar or start going bald.  None of those things are bad, but would you like someone to make a relationship contingent on you fixing those things?  I don’t think so.\n\nIf she brings up wanting to lose weight and specifically requests your advice, then fine.  Otherwise no YWBTA", "YWBTA. I’m not sure how long you’ve been together since you describe it as a few months but you’ve also lost over 60lbs pounds in that same time… regardless, early in the relationship you have no right to start making suggestions on her body. Huge huge huge red flag on your part.", "Yup, YTA. You’ve made a change in your life that you feel is good for you. She knows full well how much she weighs, and that you weigh less, and that you go to the gym and eat differently than she does. If she wanted to do those things with you, she would. Telling her to do those things with you is not going to make her want to do them. \n\nIf her size is now a dealbreaker for you because you’re a different size than when you met, just break up with her so she can date someone who likes her body. You’re going to break up anyway if you tell her she’s too fat for you (which is absolutely what she’ll hear) just means you’ll hurt her feelings unnecessarily before ending the relationship.", "YWBTA. Some people may not be able to lose weight. Some may not have the motivation. Etc. But you don’t ask your partner to lose weight. She will come to you if she wants help losing weight.", "YWBTA.  This will be beyond humiliating and hurtful for her and can create body image issues. I understand wanting her to have a healthy lifestyle but this is not the approach to take.  I think you can certainly invite her to do active things like going for a walk or hike as opposed to inviting her to pizza parties. Or you can invite her over for dinner and cook something healthy and delicious for you both like salmon and a salad.  You can encourage a healthy lifestyle by inviting her to do healthy and fun things but you cannot patrol what she is eating/doing and you cannot shame her for her choices.", "YWBTA.\n\nI'm glad you lost weight in the way you wanted to. However, the person you like doesn't have to want to do what you did.\n\nIf that's not good enough for the \"new you,\" then show yourself the door so she can find someone who likes her for who she is, not who thinks it's okay to do something that will definitely hurt her feelings and her self-confidence.\n\nDo not comment on people's weight. Each person has to decide for themselves if they want change, and if they want help with it.", "YWBTA. \n\nYou think she doesn't know she's overweight? You think she's unaware that if she made some changes, she might be able to lose weight? If she wants your \"push and motivation\", she'll ask for it.", "Absolutely.  YWBTA    You can’t change other people.  She has to be the one to make the decision to lose weight.\n\nYour words will be hurtful and will more than likely cause emotional eating.  If she did lose weight, she would likely be so resentful, she’d dump you.    \n\n\nYou certainly could  ask her if she wants to go for a walk with you.  You could ask her if she would like to go along with you to the gym.  But don’t tell her that she needs to lose weight.", "YTA. Don't do it. That type of change needs to come from one's self. All you're going to do is hurt her feelings. If you really feel that way why did you get involved with her to begin with?", "YWBTA. It's one thing to be heading to the gym or out for a walk and say, \"hey, want to join me?\" It's quite another to sit your fairly recent gf down and say something to the effect of \"I've lost weight and now I think you need to lose weight too.\" The former is a friendly invitation, the latter is judgemental. You obviously found something worthwhile about your gf when you started dating her. Remember that and forget about whatever her number on the scale is. Or let her go and find someone who appreciates her for the person she is now.", "Bro is speedrunning becoming single", "I feel like you WBTA... weight is a very sensitive issue. Its rough", "It sounds like you are worried that her being content with her size is going to hold you back or cause you to back slide. Maybe this isn’t a good match. You can’t change people and YWBTA if you tried to change her", "YWBTA- You can't motivate anyone to make changes. The motivation and desire to change has to come from within.", "YWBTA.  Let her be.  Offer her to come with you to the gym or a hike, but don't force it.  Great for you to do the change but it isn't for everyone and some have their reasons for being overweight.", "You lost 60 lbs in 2 months? I think you need to see a doctor", "It kills me when people feel like there is something wrong with wanting your mate to be healthy.", "Not only would you be TA, already YTA and I'll tell you why:\n\n>The one issue is that she is very overweight\n\nYou don't respect or love your partner, you think you settled for her when you too were fat and now you want your partner to not be fat because you're not fat anymore\n\nYou might have lost the weight, but holy shit did you pick up a crappy personality by doing so", "Unless she asks for help, mind your business. if it’s not working for you anymore you need to end it and not try to change her", "Don’t push. Don’t try to motivate. Ask if she wants to go to the gym with you - you obviously found an accepting place to go. Offer to cook, ask if she wants what you’re having. \nBut make sure she knows you like her however she looks. But don’t say that! It sounds inauthentic. \n\nHonestly? It’s a minefield that’s probably best left alone. My partner is vegan and she doesn’t ask me if I want to stop eating meat, but her example is good enough.\nTalking - just in general - is great. It can cover things naturally without you even having to try to fit them in. Just keep having conversations about stuff you both enjoy, things will change or they won’t. If you care about her size, you may have to get over it. If you don’t, it doesn’t need bringing up.", "Hooooooo buddy. Yeah. You’d would be TA. If she wants help, she’ll ask. My fiancé lost ~30lbs since we started dating and I’ve gained ~15-20. He has not once asked me to change despite the fact that I always complain about feeling/being fat. If he did, even if he sat me down and said it in the nicest way possible, I’d feel *fucking awful*.", "A few months? No my dude just realize you two are different people and find someone who more fits your fitness needs.", "YTA and I hope she finds someone better", "NTA. What’s wrong with encouraging her to go to the gym more, it’s not THAT hard? If it was the opposite situation I think it would be fine too. It also provides a wealth of health benefits.", "\"I look and feel a lot different than when we first met and I really want my partner to do the same.\"\n\nShe isn't your partner. Your dating, and only for a few months at that. This isn't your gf. She was good enough when you were a big boi, but now you feel like you can do better. \n\nIf you want to invite her to active dates, a hike up to a picnic lunch for example, then great! If you want to invite her to work out with you, also great. If she doesn't want to do these things, also great. Her body, her choice. \n\nIf you sit her down and tell her that since you've decided to loose weight now she also needs to loose weight you are absolutely TA.", "YWBTA if you ask her to lose weight\n\nIf you invite her to the gym because it’s a hobby you enjoy and want to see if you can do together then it would be more acceptable \n\nIf you pressure her to change in any way you will be single shortly", "NTA. Depends if she is morbidly obese and you want her to lose weight because of health reasons and not because you are embarrassed of her.", "You can ask but keep in mind that men lose weight easier than women. She may also say no. Are you prepared for that answer? What will your response be then? \n\nShe may have tried to lose the weight. Yo-yo back and forth in size and has finally come to terms with who she is now. If that isn't good enough for you, you may have to walk away. \n\nHow do I know? I've yo-yoed and weigh less than it says on my driver's license. So, yay me.", "Unless she comes to you for help, you either shush and love her for who she is or leave and go find some thin fox if that’s what you’d prefer. Why make it harder than it needs to be? And people lose attraction to their partner all the time. I’d rather be dumped for being fat than be dated out of some convoluted and messed up obligation.", "YTA but also Jesus leave her alone. She deserves better. So deeply arrogant of you, a man who has been in her life for a couple months, to come in and start making demands. Obnoxious.", "Sorry I like you a lot, but now that I've lost some weight your weight is a problem thanks!\n\nYeah man YTA", "You can gently encourage her to eat better and workout with you. However you cannot tell her to loose weight, that’s not your place. You lost weight, good for you but you started a relationship with her even though she’s overweight. Your being incredibly shallow that your only focusing on her appearance now.", "I think it depends on how you do it\n\nDemanding it would make you TA\n\nBut if you said something like “I was hoping you would join me in _____ (whatever gym activities or weight loss things you do) as a sort of couples activity. It would make me really happy if you did”\n\nThat way you’re making it about your relationship and finding something you can both do together as a couple rather than about her weight", "It's giving me very much \"I don't see you as a partner or a person, but a reflection of what I think I deserve, and since I've lost weight, I think I deserve better than a fat girlfriend\"\n\nOP, YTA", "So is heart disease and an early death 🤌", "Not even his gf, just some girl he's been dating a few months.", "I agree with everything you said. Just want to point out she is not his gf or his partner. They have only been dating a few months. He hasn't committed to the relationship yet expects her to commit to a lifestyle change for him.", "The difference is it sounds like your partner focused on health as a whole for you both and not just trying to get you to crash diet for looks or appearances. \n\nIt appears you have an amazing partner in this respect.", "He's not in a relationship tho. He hasn't committed to this girl. She is not his partner or his gf. She is a girl he has been dating for a few months and now is expecting her to change her lifestyle for him.", "This. But I’m mostly concerned with how quickly OP lost the weight. Was the moderate calorie deficit calculated before the exercise and weight lifting? Or after? If before, a moderate calorie deficit at a more sedentary level of exercise becomes a very large calorie deficit when you factor in exercise and weightlifting.", "I agree. Focus on health as a whole, physical, mental, and emotional not just weight. Weight is only part of having a healthy body. OP mentioned something about GF having higher blood pressure than normal. A lot of that is genetic predisposition. Just like weight has a fair amount of genetic components to it. \n\nAs an overweight woman, it wasn’t my partner that encouraged me to work on my health (he was actually a big source of the problem) it was my family, specifically my mom. Instead of constantly commenting on how I could weight, one visit with my parents, it was “let’s go for a walk” to spend time together as well as suggestions on how to help treat some chronic health issues that run in the family.", "Not his gf. Not his partner. \n\nThey have been dating for a few months. He hasn't committed to her but expects her to commit to a drastic lifestyle change for him.", "Tbh this is one of the few reasonable takes on this thread", "There is no relationship. They have only been dating for a few months. \n\nHe hasn't committed to her in any meaningful way, she is not his gf. Yet he expects her to completely change her lifestyle for him. Red flags indeed.", "Maybe you should stop overeating then?", "He is single. They are just 'dating a few months' no relationship here and probably won't be since he wants to change her.", "He might lose the last 200 that’s an issue", "That's the kicker, she isn't even his gf. He hasn't committed to her yet expects her to commit to his weight loss journey. \n\nNot his partner. Not his gf. Just someone he has been dating for a few months and already wants to change. Red flags galore.", "Exactly this.\n\n\nOP, I hope she dumps you.", "So is being unnecessarily judgmental 😊", "Great way to keep him unhealthy.", "\"Health\" =/= \"weight\". She can improve her cardiac resilience and lower her blood pressure and still weigh the same.\n\nOP, MYOB and get over yourself.", "bragging about how short of a time it took, isn’t something to be proud about — meaning the time isn’t as important as making lifestyle choices that will be sustainable for long-term", "So the real truth is that she’s attempting to lose weight in a more healthy manner than you but it’s not at a satisfactory rate for YOU, so you’d rather encourage her to follow the same path and risk her long term health than reassess your newfound biases ?", "Sounds like you want to see yourself as some wise savior, the 'catalyst' to a new future.   You really need to step back and consider what exactly you actually want here.", "'Expressed interest'.  Somehow I doubt she expressed an interest in what you actually want her to do in reality.", "I REALLY hope she reads this. It’s not a case of ‘would you be’ you are the fucking arsehole. By the way - 80% of people who lose weight put it all back on plus extra. Tick tock…", "So she was fine before, and now is not.", "i was engaged in 6 weeks. married as quickly as possible. Almost 40 years ago.  Relationships progress differently. He is looking into the future, and it isn't good. Major limitations and costs. Time to run.", "Judgmental? Obesity isn’t healthy and you will die faster. This is factual, not judging anyone.", "I lost 70 pounds in about 4 months and didn't starve myself. 6 years later and I am the same weight and still in good health. Everyone is different.", "Health does actually equal weight. Please stop pushing this “obesity can be healthy” bullshit. OP is still being a dick", "It isn’t unusually for a woman to retain water around her period. It’s annoying.", "Depends what you mean easier. I hate this excuse that gets thrown around a lot. Men tend to have much bigger appetites and less impulse control making dieting harder for them in those ways. Everyone's different, but don't just say men lose weight easily so they can't say anything to a woman about it.", "I also feel like it was extremely looks orientated, considering now he wants his girlfriend to be skinner too. Her being fat was assumedly not an issue early on in the relationship, since he clearly found her attractive in the first place. Now though, she’s apparently not good enough and needs to aesthetically change to match him. Not a fan", "Yeah, no.\n\nI mean, the OP is the AH, absolutely. The rest of your statement,  no.", "You mean it would take.... effort? That's also just not true obviously everyone is different but aunts, my sister, and my gf have all managed to lose weight without dying.", "People are mad about it 😂 They should put all of that energy into making a lifestyle change rather than  getting overly emotional about facts.", "“I don’t think it’s that unhealthy” bro we are talking about being in a calorie deficit every day for months. That is disordered eating. That is not healthy nor something to push on someone else", "The projection on this thread is crazy, you shouldn't be getting downvoted.", "Sorry but it’s simply just factual. You can’t be obese and healthy. It’s not possible.", "Studies show 1 to 2 lbs of fat a week is a healthy amount and more likely to keep the weight off, but everyone is different. Let's say 15lbs of his 60 was water weight and retention from salt and stuff and he lost 45 lbs of fat in 4 months or around 18 weeks, so less than 3 a week it doesn't sound too bad or ridiculous. Plus people who are much larger the weight comes off faster in the beginning and then you get diminishing returns. I think everyone is being way to critical of his weight loss.", "If you are measuring \"obesity\" by the outdated, racist standard of BMI, yeah, you can.\n\nYou can be \"obese\" and have great cardiac recovery, terrific endurance, flexibility, low blood sugar, low LDL cholesterol, and low blood pressure, among other indicators. You can even be \"obese\" per BMI and have low body fat.\n\n\"Health\" is a very, very wide spectrum. \n\nAnd that's all the energy I'll spend on that topic here.", "Yeah but you’re also not bathing in radiation and then believing your doctor who’s telling you immediately after that you’re fine. And you’re definitely not encouraging anyone else to do it because your skin looks great with a natural, healthy glow. The baseline of both of these false equivalencies is that OP most likely caused himself long term health issues (which the doctor can’t treat because they haven’t showed up yet) and is thinking of encouraging his girlfriend to do the same. For the sake of…. Aesthetic pleasure (?).", "If he continues to act like he does then I will thanks", "That's easy. All you have to remember is: \n\n- If a girl is asking a guy to be or get fit, it's a preference, healthy and she's only doing this for his own good.  \n- If a guy is asking a girl to be or get fit, it's body-shaming, insecure and a red flag \n\nSo yes, YWBTA because hypocrisy", "You've only been dating a few months. YWBTA", "YWBTA\n\nyou don’t get to tell her or anyone what to do with their body. cool you lost weight good for you but you don’t get to push it in her into lose weight just because you lost weight", "How about “I’m going to the gym, wanna come?” “I’m making dinner! Want some?”", "This is a tough one. It would all depend on how the conversation is approached and spoken about.", "YWBTA if your sole purpose of talking to her about this is for her to lose weight. I totally understand why you’d want to be in a relationship with someone who cares about their health (mental AND physical), and a huge part of that is diet/nutrition/exercise (therapy goes a long way too!). I wouldn’t be attracted to someone who just didn’t care at all about their health. But weight is such a sensitive subject and the individual has to want it for themselves. No amount of supporting it will do any good if they don’t want to help themselves. Maybe talk to your partner and let them know how amazing you feel now and how you’d like to share that with them if they’re willing. Maybe you guys can start building some good habits together- take a sports class or find an active activity you can do for a date night once in a while! Make a healthy breakfast together before work and have a coffee to check in before the day begins. Meditate. If your partner isn’t into it, this just may not be the relationship for you anymore.", "YTA. Your “partner” is someone you’ve been seeing for a few months. It’s wildly not your place. If you don’t like her as is, move on.", "I think it depends on how you say it and the reason why you want her to lose weight. \nIf she is overweight to the point it is affecting her health, then losing weight would be more beneficial for her.", "yta\n\nif a thing can be changed in 1 day or less, that's something you can talk about. anything more is sketchy", "YWBTA. You can’t start dating someone as they are then demand they change for you.", "Sorry, but YWBTA. Congrats on improving your health. But not until they ask for help should you offer any. Even if they asked, would thread lightly on providing it. Best thing do is set examples in how you live, but not make a show of it.", "YTA", "YWBTA", "Being a supportive partner is one thing. But she needs to ask for the support. You would be TA if you pushed this on her.", "YTA.   Let's not pretend you are doing this to protect Japenese sensibilities.   This is about you and only about you.   I think you don't want to take her to maybe live out some bachelor in Japan fantasy?   I don't know what your actual intention is to brutally hurt your ~~ex-wife~~ wife, but I know it has nothing to do with maintaining Japans societal mores.", "Ywbta. You’ve only been together for a few months. Sure you’ve changed yourself for the better (for yourself), but by no means are you entitled to ask her to change for you. Until she’s ready and wants to lose weight and make similar changes as you have, there’s no reason to say anything to her about it. Maybe after you’ve been dating for a longer period of time it’d be considered more appropriate but you’ve only been with her a few months. If it’s affecting how you feel your attractiveness to her just end it now as there’s no need to continue a relationship hoping the other will change as it may not come soon if at all", "Listen to these people and just let her be fat. No fat shaming allowed here", "YTA for even considering this as an option.\n\nIf you’re concerned about her health, start by cooking her lots of tasty healthy meals and take her on walks with the goal to do fun stuff together, not with the goal to make her actively lose weight. If she cannot do these fun activities because of fitness issues, she can decide for herself what might be best for her. Just understand that what works for you may not actually work for her at all, so suggesting workout plans or specific meal plans might actually backfire and make her feel like she could never be in a healthier weight range.", "I don't think it is terrible to encourage healthy eating habits and enjoyable exercise, but I do think it is hurtful to try and change the person your dating, especially after only knowing them a few months.\n\nHas she ever expressed wanting to lose weight? Is it normal for you to cook healthy meals for the both of you already? Is she interested in the gym at all?\n\nThe answer changes depending on the answer to these questions. If you don't already cook healthy for both of you when its date night, you could start with that. If the answer to the other two questions is no though, then I would not broach the subject.\n\nYou lost weight because you wanted to and were willing to put in that work, if she isn't interested in doing those things, and hasn't expressed an interest to you then she will not lose weight, and will likely just be hurt.\n\nAlso, do you know her history of her relationship with her weight? Everyone's is different, and there can be a complex history of reasons for her current weight, health related and otherwise.\n\nIt is never a good idea to start a relationship off hoping someone will change something big about themselves, because it will be emotionally hard on both of you to try and change them, and there will be a lot of hurt and disappointment of the changes do not come to fruition.\n\nGiven the information in the post YWBTA", "Invite her for walks, cook her healthy meals, do not, I repeat do not ask her to lose weight.", "Why would you want her to lose weight? You say how wonderful she is. What’s the problem?", "YWBTA if you approached it as “I think you need to lose weight” you can approach her and ask if she’d like to accompany you to the gym, or maybe try a new diet or something with you. But she could not even be interested in losing weight. Why is her weight suddenly something she needs to change about herself just because you decided to lose some ?", "op=YTA\n\nSo you started dating a woman you found attractive(or as attractive as you could get at your THEN appearance) but now she needs to change because your Buff/hotness factor is higher?", "You haven’t lost that much weight in a few months. YTA. You’re toxic.", "YTA you don’t get to tell people how to eat, exercise, feed, or do anything with their body. Butt out.", "YTA. She's not your partner, or even your girlfriend. You only refer to her as someone you've been dating for a few months. So you have absolutely no right to try to change anything about her. Especially since it sounds like she hasn't expressed any interest in losing weight. If you want to date someone slimmer than her, just find someone else. Don't try to change a woman you're not even committed to.", "YTA already.  Not would be.  Are.  Either love her how she is right now or let her find someone else who will.  If she changes for you and not herself it will come with resentment and fear that if she gains it back (she will - you both will.  This is scientifically backed) you won't love her anymore.", "You would not be the asshole if you asked her if she wanted to come to the gym with you, or that kind of thing. You would be if you tell her that she needs to start going to the gym and losing weight.", "You are the asshole . Because why would you acknowledge her weight anyways if you had a problem with it why would you date in the first place.", "Ew. Absolutely YTA.\n\nYou've been dating for *a few months* and you expect her to change her body for you? That's gross and weird. She's not obligated to lose weight or \"be healthier\" just because you decided to lose weight. If you aren't happy with the person she is NOW, then stop dating her.", "A few months?\n\nYTA\n\nUnrealistic expectations is going to make her stay tf away from you", "60 lbs in three months? Bs", "YTA. you liked her well enough when you met but now that you think you look better suddenly she's not good enough? Also a few is like 3. if you lost 60lb in 3 months then it was down by extreme, unhealthy measures and you are in no way qualified to talk to her about being healthy.", "More Information Needed: Has she expressed wanting to lose weight, and is just needing encouragement? Is her weight a detriment to her health?", "YWBTA", "YWBTA\n\nI was friends with this couple who had an interesting pact: If one of them gets bigger than when they met, they’re allowed to have the weight loss conversations. Or even break up.\n\nYou got with her as she was. It’s a dick move to switch it up just since YOU made the choice to change. If she wants to lose weight, she will bring it up. Then, you can offer help.\n\nIf it bothers you that much that it could be a dealbreaker, giving her a heads up would be courteous as opposed to just breaking up with her. But even if you have the conversation, it’s more than likely not going to work out the way you want it to. People lose weight for themselves. If they do it for someone else, it’s either not going to come off or stay off.", "YTA. You're trying to be a fitness expert yet you don't even know how to KEEP your weight off.", "If she doesn’t wanna change don’t make her, although I understand where you’re coming from. YWBTA if you pushed her to do something she didn’t wanna do.", "NAH\n\nA part of being in a relationship is attraction. Another part of a relationship is communication. If you feel you are losing attraction to your partner, you are allowed to discuss it RESPECTFULLY and honestly. If you bring it up and she has no plans to lose weight or doesn’t feel her weight is an issue, be respectful of her answer. Don’t try to convince her to change her mind or do something she doesn’t want to do. That leaves you with the option to date her and deal with it or leave. She doesn’t have to change for you. But part of being an adult in a relationship is communication and being able to have conversations about all parts of that relationship.", "You’re already an asshole for even thinking this may be a good idea", "I'm going with YWBTAH\n\nThe title says, \"ask her to lose weight,\" but the body of the text says, \"invite and encourage.\"  The way you talk about her tells me that you care about her image and not her health or lifestyle. \n\nYou can absolutely invite someone to join you on your path to health. Eat well together, be more active, etc. But with that comes the opportunity to come off as shallow, so be careful. If your desire for her to maintain her health is genuine, great. Cholesterol, blood sugar, bone health, pain levels... they're all decent reasons to eat healthy and be more active. Plus, at a certain point, body type could prevent someone from living a certain lifestyle. If you want to hike and she can't, will you two still have enough other things in common? \n\nThink over your reasons for wanting her to lose weight and be honest with yourself, and with her. Does she have to lose weight just because you did? If she's happy and a good person, Does her physical appearance matter? But if her doctor has said she needs to watch her cholesterol or something, you can help her with that. \n\nWeight and nutrition are important, but you can still care for someone even if they aren't perfect. You can help and guide, but don't make it into a chore, or judgment, or an obsession.", "NTA NTA NTA!\n\nSome people need more motivation, and she's lucky if you feel capable and in the position to do so. Weight gain is important to avoid and if you can make this a bonding experience then all the best for the relationship! \n\nIf it's not conditional for you to love her, which I don't believe it is, it sounds great to me. If it's a deal breaker for the relationship, that's still ok. \n\nI like that you're taking initiative and you truly care about this woman. I'm rooting for you.", "Encouraging people to be healthy and want them to work out doesn't make YTA.\n\nDating someone exclusively and then wanting them to change makes YTA. \n\nLike someone else said, that's a fantastic way to become single.", "Could be an unpopular opinion but NTA. If my partner was overweight I would raise the topic too. Atleast so that they know that being overweight can carry health issues. I am married since 5 years both me and my husband are skinny, I work out everyday and I push my husband every single day to workout as well. I prepare his bowl of fruits and nuts and his vitamins if ever he forgets. I want him to be healthy and fit and there is nothing wrong in asking the people you love to make a beneficial change", "YTA: What you are saying is that you want your partner to fit your image now that you achieved your goal. It’s great you made that choice but if you do talk to your partner about to, it will be like telling her that she isn’t pretty enough for you anymore.", "It's like when someone who used to smoke 3 packs a day quits and starts wrinkling their nose at smokers and launches into a lecture about how unhealthy and disgusting it is every chance they get 🙄", "This is the clincher for me on YWBTA. She didn’t ask for help. I’m happy you feel good about your weight loss OP but that’s you.", "Great suggestions! Also nobody should embark upon a major weight loss program without seeing a doctor first.", "He’s not her fitness coach though, and she didn’t ask him anything. It would be different if she was the one willingly starting this conversation and asking him for help.", "Unsolicited advice is generally not welcome. We don’t even know how overweight she is, or if that’s due to medical reasons. What’s for sure, a 23yo male is not in a position to give constructive advice to a 27yo female, considering hormones and metabolism play a huge role in weight loss and he’s not a medical professional.", "This is such an immature outlook.. really. Granted - we are missing some context here, but it is not unreasonable or unfathomable to want your partner to do better for themselves. \nThe way I see it, \nIf he was a shallow AH like ya'll are pegging him for - he's perfectly capable of dumping her and move on to his shallow choice, but that's not what's going on here. He's asking how to help essentially, that makes him an asshole? \n\nIf she flat out refused, and it was an issue pushed - yes. Asshole.\n\nBut - \n\nop has put in legwork to take better care of himself, now it's kinda naive to think your other half is just gonna hop on whatever bandwagon your on all willy nilly like - But seeing the health benefits of said legwork he sees in himself - you think it is wrong to want that for someone you love & want to invest your life in? \n\nI had a very overweight cousin who had this same issue. He picked up running & lifting, shed the lifelong weight & did great. \nAlso dating his first and only girlfriend (now fiance) who did not have any interest in his new hobbies - but he was terrified if they married, at her rate - she would not live to see their future. It wasn't a vain concept. When you care and love for someone, you want the best for them - period. You can't force it on them by any means. But you can ask\n And that does not make you an asshole.", "100%", "This. I lost 7 stones (I'm English so I don't know what that is in pounds) through grief and anxiety when my partner died during the pandemic. I was eating only once a day and walking 5 miles. 7 stones in 7 months. As soon as my appetite returned so did the weight. I'm now losing it at a much healthier pace to make sure it stays off. But yeah. This guy is very much an asshole.", "It doesnt depend on how big they are - the bigger the person, the more weight they lose especially in the beginning", "You are 0% qualified to give anyone advice about weight loss.", "So in four months you haven't had fruits, dairy, grains, or nuts? How many vitamins and other nutrients are you missing? How is your digestive system still functioning? It's great that you have improved your cardiovascular health, but it sounds like you had to cut out a lot of vital nutrients to lose that weight, and trying to convince someone else to do that would be wrong.\n\nBut I'm not a nutritionist so if anyone can correct me, go ahead.", "For this alone, she needs to break up with you. You are wasting her time, she can find someone who hasn't already decided he gets to decide for her what her life will be like.", "Not just that, he’s wrongly assuming weight loss works in the same way for a 23yo male and a 27yo female. Spoiler, it doesn’t, so he’s not in a position to give her constructive advice, and he’s likely to make things worse for her if she’s actually trying to lose weight.", "He has lost weight himself, so he can give her at least some advice. If that doesnt work, then he could tell her to start going to the gym, eating healthier, etc. Also, just because he isn't a medical professional, doesn't mean he cant give advice. I can give you relationship advice without being a relationship-ist (idk where I was going with that one tbh).", "Exactly, it needs to be sustainable above all else \n\nBtw, 7 stones is 98 pounds for anyone wondering", "Exactly, if he was morbidly obese and super tall, maybe 60 pounds in 3 months wouldn't be extravagant, but if that were the case, he'd still be overweight.", "Or he’s on the crystal", "It feels like this post could turn into an MLM pitch real quick\n  \n\nYou won't believe how quick, easy, and delicious these shakes are!", "He’s not female, and he’s younger, so what works for him may not work for her at all. Weight loss is a lot more complicated than what people think. Also, we don’t even know her current BMI, or medical conditions she might have and which could make her situation completely different.\n\nAt the end of the day, if she wanted advice from him, she would ask directly, especially if he’s lost a lot of weight since they first met. He shouldn’t be the one initiating this conversation as it’s very unlikely to be what she wants if she hasn’t brought up that topic herself.", "are you the GF's doctor? or a doctor in general?", "[deleted]", "If you can find me case studies or doctors that can corroborate your apparent claim that obesity will lead to a longer life span, I will send you $100 🤣", "Are you like 4'11? 100 lbs is already a pretty low weight...", "You should never tell her what to lose weight.  If she asks you for help give it. But it's not up to you.", "You should not be with someone who you want to change...either take her as is or leave her so she can find someone who loves her just the way she is now.", "Ha ha. Yep!", "This isn’t a business contract. It’s a relationship.", "??? just because he improved his cardiovascular health doesn't mean his weight loss was healthy or sustainable."]}