{"id": 14526, "submission_id": "12ifnau", "title": "AITA for telling my friend I would let the baby die?", "selftext": "Polemic title, I know.\n\nMy friend, let's call her Laura (f/29), is currently pregnant with her first child. We were having breakfast yesterday when we got on the topic of traumatic child births. A friend of ours, Anne, nearly died during Covid because of a botched delivery, her baby unfortunately didn't make it. Anne's husband was the one to have to make the decision of whether to save the child or to save his wife and he chose Anne (this is of course a very simplified version of events). They are both still very traumatized by the whole ordeal but when I talked to them at the time, they agreed that her husband had made the right decision.\n\nNow Laura is up in arms about this - she is about to deliver any day now and says Anne's husband made the wrong decision. That she would not be able to live with herself if her husband made the same one, that the child comes first. I asked her if she had talked to her husband about this and she said yes, but that apparently he did not agree with her and that they had fought about this quite a lot. I just told her that if it came down to it, I would want my partner to make the same decision as well, honestly. She said I don't understand because I don't have children. \n\nWe dropped the subject because she was getting really really upset. I told my mum about the discussion and she said I was TA for getting Laura so upset and for saying something so crude (see title). She also agrees with Laura's POV so idk.", "created_utc": 1681209365, "permalink": "/r/AmItheAsshole/comments/12ifnau/aita_for_telling_my_friend_i_would_let_the_baby/", "score": 1087, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1.) I told my friend that I would've also wanted my partner to make the same decision Laura's partner made.\n\n2.) She's heavily pregnant and is probably very scared of her upcoming birth. The topic per se was probably assholish to even discuss.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I don’t know where all these hospitals are that make fathers choose between saving the mother and the baby…\n\nIn reality, we (doctors) will try everything to save the mother’s life. Sometimes this includes delivering the baby earlier than is ideal, but until the baby is delivered, mum is the priority. Once the baby is delivered, it’s an entirely separate team of doctors working on the baby (obstetricians for mum, paediatricians for baby). \n\nThe only exception I can think of is asking a pregnant woman to have a termination to allow for chemotherapy, but that isn’t an emergency decision- it can be talked over for days with various specialists/counsellors etc.", "NTA that's an extremely personal decision. It's okay that Laura has a preference, she knows what choice she would want made and that's okay. What's not okay is for Laura to criticize Anne's husband for choosing differently and claiming that only her choice is the correct choice. She is literally saying that she think's Anne should have died instead, and that's just a sucky thing to say about anyone, let alone morally grandstand. Laura was being cruel with what she was saying even if she never to Anne or her husband her thoughts. \n\nYou're mom is wrong on this, you weren't saying it to be crude, you were being honest to make a point and defend your friend and her husband who went through something terrible", "NTA, besides making a pregnant woman upset, perhaps should have dropped her sooner. \n\nBesides that, your friend has serious issues if she believes an unborn child is more important than a fully grown adult. I might be stating it bluntly, but it’s the truth. \n\nShe “wouldn’t be able to live with herself”, but she’s fine with making her partner a widower and single parent, and her baby an orphan.", "NTA Dude how I hate the you don't have a kid so there's absolutely no way you could have a valid opinion on anything kid-related. When I was in high school I dated an older guy who had a daughter. One day he was explaining to me something about the way she pees, and they were taking her to her pediatrician. I don't remember what I said, I just remember him asking if I had a kid he didn't know about. I was confused, and he said you don't have a daughter, so how would you know? I said dude. You're right, I don't have a kid. But I have a fucking vagina, & I think I have a pretty good understanding of it🤦‍♀️", "NTA. Would be NAH if she wasn't being an AH first towards Anne and her partner, she's pretty much saying \"Anne should have died\" which imo is just as crude if not more than what you said given she's your friend. I absolutely get her choice while I don't share it, and can imagine how upsetting it would feel for her to picture the outcome where she lives, but she doesn't get to shit on Anne and her partner for choosing otherwise. It's about as personal as a choice gets, and the survivors suffer either way so it's nobody's business to comment on someone else's choice.", "NTA. You are entitled to your opinion and decision on this matter as much as Laura is entitled to hers. This is a very personal matter, and there is no right or wrong answer. \n\nI think Laura was already sensitive because her husband not agreeing with her. I do sympathize; it must be really upsetting to know the person who'd likely have to call the shots if you were in that situation won't do what you expect them to do. But that's something they have to work out in private, as it's a private matter. \n\nAgain, Laura is entitled to her views but she's an asshole because \n\n1) She's judging Anne and her husband's decisions and talking about a very sensitive and tragic event in their lives behind their backs. She has no right to decide whether what they did is right or wrong (it was right for them, that's all that matters), and no decent person would be gossiping about a couple who had to choose between the life of the mother and the child, that's just horrible. \n\n2) She brought up the topic expecting an ally, and when she didn't find one in you she proceeded to attack you and discredit your opinion \"because you don't have children\". If she wanted support because of being upset about the disagreement with her husband, she should've expressed herself differently. Antagonizing you for disagreeing with her is shitty, and if this is what she did with her husband I wouldn't be surprised that's what went awry with their discussion. \n\nFor the record, I have children and I agree with you, Anne and her husband. I would choose and expect my husband to choose my life over the unborn child's.", "NTA\n\n> Anne's husband was the one to have to make the decision of whether to save the child or to save his wife and he chose Anne (this is of course a very simplified version of events).\n\nThis isn't even how it works.  Doctors save the mother and the baby either makes it or doesn't.  There's no real choosing.  That's TV drama.  \n\nThey may have given him a choice between two options where the mother's chances were a little lower than the other, but they'd still be geared toward saving her unless this was a religious whackjob hospital that needs investigating.", "NTA. She brought it up and was actually being pretty horrible about Anne and Anne's husband. You're allowed to have your own opinion on this too.", "NTA. You did nothing really wrong, though part of me wanted to say No aholes but the friend comes off as slightly judgemental. But then it is an emotional topic that people have strong opinions of", "NTA. The topic came up, you gave your thoughts on what you would do if you were in that situation. Everyone has their own plan in place for child birth, that's one of the things the doctors discuss with you. Before and during my pregnancy if anything happened, my husband told me he'd choose me over the baby if I was incapacitated for any reason.  It was something we both agreed on, as it's part of your birthing plan.", "Info: Who brought it up?\n\nIt sounds to me as if she may have brought it up looking for backup as her partner disagrees with her?\n\nIf this were the case, then IMO telling the truth, if she asked you outright for your opinion, does not make you an ass.\n\nOn the other hand, if you brought it up for some reason, then YAMDTA.", "NTA. Mature, personal subjects by their nature make people upset, that doesn't shield either of you from the responsibilities of an honest exchange of views.\n\nSo you didn't change her mind. Oh well.", "NAH. This is an extremely difficult topic. I know what choice I would make, I think, but understand why someone may come to the complete opposite conclusion. \n\nHopefully, your friend delivers a happy and healthy baby, and everything goes according to plan.", "NAH I guess. Why even have this conversation?", "NAH, it was just your opinion and your friend just happened to have a different one. It’s ok to have different opinions.", "*raises hands and backs away* nope, not touching this one!", "NAH - you have different opinions, that’s fine", "That kind of decision is completely up to the expecting mother and, if she’s unable to make the decision for some reason, her immediate loved ones (such as her spouse or mom).\n\nNAH", "There's no right answer. But why upset the pregnant lady with hypotheticals.  I had a very scary emergency delivery. I didn't think we would both make it. I made it very clear my son was to be saved if it came down to it. I laid there scared to death and prayed that as long as my child was okay to take me instead. Thankfully we were both okay.", "YTA.\n\nThis is not something a pregnant woman wants to hear.", "I am going with soft YTA. I don't actually know what my partner would have chosen if it had come down to it, but he knows I would have rather died than have to go through losing my child. Mentally, I don't think it is something I could have survived. I do know if it came to it, I wouldn't have blamed him for the choice. What you are asking your husband to do is lose the woman they love to become a widow whilst raising a child alone. It is very hard. The fact that she's so close to giving birth is what pushes the YTA. It was clearly upsetting her, so the conversation should have moved on.", "Soft YTA, really soft. Purely for entertaining the conversation, not for your opinion. Obviously you know what choice you would make in that position. I would've made the same. But you get a lot of these here, where people go \"my wife asked if I'd save her or the dog in a house fire AITA\" - just don't get into hypotheticals. Sympathise that some people you know lost their baby and leave it at that. Hypothetical \"who do you save\" trolley problem convos always end badly no matter what you say", "[deleted]", "I can’t tell you what the right answer is here as of course it’s a very subjective subject. What I can tell you is when I was heavily pregnant with my first (and currently only) my fiancé and I also had this discussion due to my very high risk of preeclampsia. I wanted him to save our son, he wanted to save me and we never agreed. Luckily it wasn’t a problem. However, if this were to be an issue with any future children, I would agree with him, but only because I wouldn’t want my son to grow up without his mum and I know how badly my fiancé would struggle to take care of our son and a newborn whilst grieving for me. So I’m going to judge NAH because everyone had a different perspective and there’s no universal hard and fast right answer.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nPolemic title, I know.\n\nMy friend, let's call her Laura (f/29), is currently pregnant with her first child. We were having breakfast yesterday when we got on the topic of traumatic child births. A friend of ours, Anne, nearly died during Covid because of a botched delivery, her baby unfortunately didn't make it. Anne's husband was the one to have to make the decision of whether to save the child or to save his wife and he chose Anne (this is of course a very simplified version of events). They are both still very traumatized by the whole ordeal but when I talked to them at the time, they agreed that her husband had made the right decision.\n\nNow Laura is up in arms about this - she is about to deliver any day now and says Anne's husband made the wrong decision. That she would not be able to live with herself if her husband made the same one, that the child comes first. I asked her if she had talked to her husband about this and she said yes, but that apparently he did not agree with her and that they had fought about this quite a lot. I just told her that if it came down to it, I would want my partner to make the same decision as well, honestly. She said I don't understand because I don't have children. \n\nWe dropped the subject because she was getting really really upset. I told my mum about the discussion and she said I was TA for getting Laura so upset and for saying something so crude (see title). She also agrees with Laura's POV so idk.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I wonder how long the mods would let this post live, as they might say this calls for a debate, but while I can comment, I’ll say NAH. \n\nI myself am currently expecting, and the others are correct when they say this isn’t an easy topic to discuss especially when pregnant. However, it is necessary to at least talk about it with the spouse/partner, just so the one who might need to make a decision isn’t blindsided. At the end of the day though, the decision is a very personal one which might depend on unforeseen factors, so it’s really difficult to make a definitive choice beforehand. I think you didn’t have any ill intentions, and neither did Laura. I hope she has a safe delivery.", "A subjective choice can’t be judged right or wrong by anyone but the person making the choice. And even then it doesn’t need to be nailed in stone.", "NTA.", "NTA", "Your friend is panicking. She's thinking what happened to Anne will happen to her. This is a topic you can't discuss with a pregnant woman who's about to give birth. So I would recommend just dropping it if it comes up again.\n\nBy the way, I agree with you. Save the mom is the right call. Although I understand this is the kind of decision that will never \"feel right\"\n\nNTA", "NTA, you have your opinion. She's de AH because she makes it seem like her opinion is the only valid opinion since she says that someone else's decision (that did not affect her) was wrong when the only two people involved on it agreed it was the right decision.", "NTA\n\nPregnant or not, mother or not, it isn't for Laura or your mother to attempt to control the public opinion on who should live or die in these situations. Neither Laura, nor your mother, get to tell you whose opinion is right on wrong based on whether they've ever been or currently are pregnant.", "NTA\nYou did nothing wrong", "NTA\nYou’re allowed an opinion that differs from others.", "Lmao she wouldn't be able to live with her self if her husband had to make the same decision. Should someone tell her?", "NTA. There’s not right or wrong decision. It is merely a preference on whether to save the baby or mom. Most people I believe would choose saving the wife too. Whereas the baby hasn’t started their life yet, the wife has. She is a daughter, a wife, a sibling, a friend, a coworker. There’s many people who would be devastated if she died and she would miss out on all the dreams and goals she’s had. You can always try for another baby in the future too. \n\nSome people put the uttermost importance on babies just because they are “new life” however the baby has barely started life and it dying wouldn’t hurt anybody beside the grieving parents. The baby isn’t going to miss out on any dreams or goals it’s had for the last 30 years either because it doesn’t even know what life is yet. \n\nYour friend is allowed to have her opinion but you are equally allowed to have yours. Sounds like it’s a touchy subject for her since it’s already caused fights between her and her partner. She probably took some of that frustration out on you", "right? I honestly never heard of one time that a doctor had to choose between a mother and a child except on House MD. Literally the job of a health worker is to save as much as ppl possible. I can't imagine a doctor deciding what life to save, or husband! This is not like deciding to do a surgery that a patient is not conscious to make a decision about.", "It’s a very common movie/tv trope", "Yeah, I had an emergency c-section at 25 weeks for twins. There were full teams for me and each of my boys. The goal was always to save all of us. If it had been earlier, we could have chosen palliative care for the babies, but that wouldn't have impacted how the team cared for me.", "All the anti-abortion laws that are getting passed make it obvious that pregnant people's health isn't a concern.  Lawmakers are being presented with case after case where women are told, \"Sorry, you're not sick enough to get an abortion despite the fetus being non-viable\" and sent home from the hospital until they get sepsis but they're not rushing through new legislation to fix the problem.  They're fine with women needing to be at the \"risk of imminent death\" stage before doctors help.", "This might have been true in the US before, but now there are a lot of states that will prioritize the fetus over the mothers life. Though they don’t ask the spouse or the pregnant person what they’d want, they just do it. \n\nAssuming OP is in the US state like this or a country with similar policies, it just might be different where she lives.", ">will try everything to save the mother’s life\n\nAn acquaintance of mine's wife was literally bleeding out from hemorrhages in and around her uterus. Rather than perform a radical hysterectomy they **CONTINUED TO TRY AND SAVE THE UTERUS.** 24 units of blood later they finally decided to take it out.\n\nYou need to chill with the royal \"we\" of doctors. Y'all are not all the same.\n\nEdit: They went in and asked my acquaintance if it was OK to take her uterus out. Fucking bonkers.", "They don’t. It’s a movie things, no one is given an option ever and doctors will always strive to save both but if they cannot, the mother is always the first priority and will be the one they save", "I don't think there's anything wrong for a mother to put her child first regardless if the baby is born or not and I think a lot of mothers would agree.", "You were in high school and dated an older dad? Umm", "Lol he was mansplaining how girls peed to a woman?!", "She brought it up. We were talking about Anne, as she's about to visit me next weekend and Laura brought up that she doesn't understand how life just goes on for her after what happened.", "Oh, I just realized it may have come off as me saying I would let HER baby die and I absolutely did not say that. I just said I would want my partner to make the same decision Anne's husband did.", "She asked OP about it, not the other way around. And then she is the one who had an issue with others feeling differently than her. I personally don't think OP did anything because when I was pregnant (2 years ago) I simply wouldn't ask anyone this for this exact reason. At some point we have to stop blaming people who answer honestly and start blaming people who were obviously looking to pick a fight. And it sounds like OPs friend was looking for a fight.", "I think it happened in the Victorian era, C1800s", "Yep- but not a real life occurrence", "I take your point (and absolutely agree those laws are horrific)- but they still don’t put the father in the position of making a decision between two lives. They very much take the decision away from individuals.", "Are you a parent?\n\nA lot of mothers might agree, but that does not change the fact of my statement.", "I agree. I’m not sure what I would do.but I think it’s wrong to say that mothers who would make that choice have “serious issues”. Many would say “who are you to judge?” Re: a mom that made the opposite choice if someone said they had “serious issues”. So we are just as wrong to judge in this case. Downvote me to H@#$. I agree with this.", "People have kids in high school and younger. Being a high school student dating a dad really is not that far-fetched.", "Hopefully Laura won't say that to Anne - that won't help matters!", "Try to keep Laura away from Anne.   \n\nLaura might be insensitive to her.", "I understood that. Still, no pregnant women wants to hear that.", "Controversial subjects have controversial stances. Pregnant friend shouldn't have brought it up at all.", "In modern day Poland, doctors are pressured to save the baby at any cost, even if that cost is mother’s life. So… cheers from Poland!", "Allow me to introduce you to post-Roe America, where a fetus with a heartbeat, even one with deformities incompatible with life, is more important than the woman carrying said fetus.\n\nhttps://www.npr.org/sections/health-shots/2022/07/26/1111280165/because-of-texas-abortion-law-her-wanted-pregnancy-became-a-medical-nightmare\n\nhttps://www.usatoday.com/story/news/nation/2022/10/15/missouri-abortion-ban-pregnancy-complications/10496559002/\n\nhttps://www.tpr.org/bioscience-medicine/2022-11-02/to-protect-her-twin-baby-texas-woman-was-forced-to-seek-abortion-care-out-of-state", "The pregnant woman was the one bringing up the topic, though. And being judgmental of a friend who underwent a tragical and traumatic loss.", "I would if I was pregnant. I've had this discussion with my partner and we're not planning on kids at all BUT there have been a prevalence of old white men making decisions about women's bodies so: if there is a choice, save me. \n\nI think more people should have this as a discussion with their partner before pregnancy as this does happen.", "Catholicism.", "what a sad thing.", "Exactly. I'm also not going to have kids, but my husband and I have had this conversation before just in case. No way in hell I'm letting someone else make that decision for me without knowing what I want them to do. This is important for every couple that may birth children themselves.", "I'm not saying OP's opinion is wrong. I'm saying choosing to continue this conversation with a woman full of hormones is not a good idea.\n\nIt's one thing to have consversations when you're not pregnant, it's another thing when you're actually experencing the pregnancy. \n\nAnd there is a difference between talking to your partner about it and talking to someone else.", "NTA \"The right decision.\" \"The wrong decision.\" It's their personal decision. There's no answer key. What Laura said was insanely condescending and obviously untrue.", "You're NTA for your opinion.  I have children, and while I would certainly die for them now, while pregnant/in childbirth the calculus is different... especially given that in these rare circumstances it's not generally \"dead mom but healthy baby,\" it's much more like, \"Dead mom and probably critically ill or dying baby.\" \n\nThere may be some element of assholery in who started the conversation.  \"Let's talk about   \n all the horrors of childbirth, pregnant woman!\" is an unpleasant conversational tack to take, although since it's usually taken by previously-pregnant women I suspect you are innocent here as well.", ">That she would not be able to live with herself if her husband made the same one, that the child comes first.\n\nShe is going to be an insufferable person whose whole identity is being a mother", "I’m currently pregnant with my first and SUPER early and my partner just recently asked me this question himself. He didn’t actually ask the question but I knew what it was before he even got it out and immediately I told him to save me. \n1) why would I want to leave my partner ALONE with a new baby? Sure he could find someone else but there’s implications with that I won’t get into.\n2) why would I want to bring a child into this would that I would never meet? Never get to raise, hold and love? I’m sorry, I’m just as excited to have my first child too but…I can make another baby. And if something happens and I can’t, we both agreed we could just adopt if having a child is that important to us. \nI’m gonna go with ESH because unless she was asking for everyone’s opinion you probably could have gone without giving yours. Your opinion is valid and much like mine but I guess with some women having a child is their dream and they’ll love an unborn child more than they love themselves. \nIf she believes that strongly that her partner should love their unborn child more than he loves her, maybe she needs a new partner. That’s a decision a couple should be pretty solid on.", "ugh. That's a hard one. I would give you a soft YTA because your friend is much closer to the situation, ie imminently giving birth, whereas for you, this is purely hypothetical. Your friend is probably hopped up on all kinds of hormones and she is already in love with the baby she is carrying. There was no point in digging your heels in and getting your friend upset because the chances that it will also happen to your friend (where her husband has to decide) is so slim. You're messing up your friendship for no reason. But I agree with the husbands and you on that point.", "NTA. \n\ni understand her POV. it’s her baby, she’s grown them from scratch, wants to protect them at all costs. and that’s up to her. \n\ni just had my son a month ago and it nearly came down to me vs. him. i was so close to cardiac arrest and he came out not breathing for a minute. my husband was really have to about to choose between his wife or his son. \n\nluckily, i had a bad feeling that whole pregnancy that something bad was going to happen at some point. it didn’t happen during the actual pregnancy itself so it was bound to happen during delivery. i made sure to make my husband know to choose me, to save me, as we could always adopt or do surrogacy or something to have another baby. and he agreed. \n\nit’s all up to the person who is giving birth. and they may very well change that literally while giving birth.", "Always save the mother! How is this even up for debate?", "In reality I believe your opinion is correct and right HOWEVER you are talking to a woman who is about to give birth and has nurtured this baby for 9 months and has raging hormones running through her body...you could of told her your didn't like her purse and she would be in floods of tears", "Hi mom of 4 here and NTA. My partner has known which each pregnancy that he was to choose me if it ever came to that. I am here, I have a life already and people who depend on me.", "NAH", "NTA my hubby thought he would have to make that choice during my labour. Thankfully he didn't have too but he would have chosen me. I would have chosen my child.", "NTA", "NTA.\n\nI presume this is a religion thing, and one of the first things I learned in life is to avoid discussing religious matters with anyone, even those of your own faith. It's just too personal.", ">She said I don't understand because I don't have children. \n\n\nI hate this argument.\n\nMy friend, a mom of 4, agrees with you.\n\n\nNTA", "NTA \n\nThis isn’t likely to happen BUT in reference to your question - no you are not TA for having an opinion. Neither is Laura for having a different one. \n\nBut what Laura said was unfair as well, she’s a mother to be sure but not quite a mother yet. Because as a mother of multiples - once you have children - you most likely will choose your life over the baby’s because your born children still need their mother.  But most first time mothers would say they’d choose the baby over themselves.  Laura can’t speak to what her decision would be if this was baby #2 or 3 or more.", "NAH-this is a personal decision and no one can be right or wrong. Maybe don’t have these convos with women about to go through something that is still very dangerous and deadly if you aren’t the one who will be making decisions by proxy\n\nMyself and my child both almost died (they actually told our family that we both didn’t make it, then said we did, then that she didn’t make it, oh the baby is alive, nope she’s dead!-it wasn’t until my friend who is a nurse at the hospital showed up and was able to learn we were both alive). I remember talking with a friend years ago-with her first she wanted her husband to save the child, her next 3, save her. Her kids needed their mom. \n\nI told my partner that if he had to make a choice to chose our kiddo. Turns out no one bothered to ask. He was escorted out and we were alone in a very full OR. Now if we were to have a second kid, my heart says save the kid, but my mind knows my current kiddo needs me. But that’s something between my partner and myself, and we have told our parents our wishes as well-so there is no static as it isn’t their choice.", "NTA. Laura's POV is just that, hers. Most husbands desperately want their wife to continue living, and a motherless child with a heartbroken father is not a perfect scenario. Depending on the birth trauma, a heartbroken father of a motherless child with special needs is also problematic.", "[removed]", "NTA bc I agree with you.", "NAH\n\nIt's a personal decision, one that will vary between people and families, as can be seen in your friends own marriage. There is no right answer and there is no wrong answer. \n\nYour friend needs her wishes to be clear to her OB team and no one else. She should also have multiple birth plans, the ideal plan, the urgent plan and the emergency plan.\n\nFor now, just be there for her, she's scared. Making the baby is fun, getting it out is not so much", "ESH\n\nI was in this situation. At 22 weeks I had to choose, me or the baby. The condition I had was an 80% that it would only kill me but the baby would be fine if I decided to go on with the pregnancy. At 24 weeks and 26 weeks they still gave me the option of abortion. I chose to keep the baby. At 28 weeks I went into preterm later and died on the delivery table. They managed to revive me and I was unconscious for 3 days in the ICU. \n\nEveryone is different. In your friends situation, he and his wife didn't have a chance to discuss what they would do if they were forced to make that decision. I'm happy that my baby and I both lived but I wouldn't argue with someone on their feelings. You never know the choice to make until you're put in that situation. Fortunately for me, it was a choice I got to make, my husband didn't have to make it. \n\nYou weren't wrong and neither was Laura.", "My mother was asked that question when I was delivering my oldest. One of us was going to die. It was 50/50 which one of us would; if not both of us. My mother chose me to live. I was fortunate because my son lived too.\n\nI understand all her reasons and feelings. I do. However, I've never forgiven my mother for choosing to allow my child to die. All the reasons and feelings are why *I* don't forgive her. I have them about my own children. \n\nI do believe that no one knows how they will feel unless they are pregnant.", "Purely pragmatic, Laura's choice means her husband will be a grieving widower having to raise a motherless newborn baby on his own.\n\nAnne's husband's choice means the couple are giving each other support in this difficult time to get through it.\n\nNTA", "I didn't know if the choice can ever happen but I have talked to my husband about it and told him I prefer to save my own then my baby if he was forced a choice, If I didn't already have a toddler son who needs me I would have a different choice.\n\nJust like we both talked about a situation if either of us ever had a very unfortunate situation where we are in a vegetative state", "You're NTA for your hypothetical choice, but perhaps you are for the fact that you let this discussion get to that point - and topic.", "NTA and I'm 99.9999999% sure that 'should we let your wife die or the baby' is a question only asked in TV shows and philosophy classes.", "Back in my grandma’s day of childbearing years, she and her peers advised each other to not deliver in Catholic hospitals because they would prioritize the life of the baby/fetus, no matter how nonviable. It’s happening in multiple states now.", "I can't tell you specifics, I'm not a doctor and Laura never told us any details. Only that it was touch and go and that a decision had to be made. If it helps, they live in an easter-European country.", "You may not have heard of it but I have lived it. My husband had to sign paperwork making the choice me or the baby. He chose me. These situations do happen. It completely sucks, but it does happen. I am not the only person I know who has had to do this either.", "The religious alignment of the hospital affects this. Catholic hospitals will prioritize the baby over the mother.", "Out of curiosity, have you worked at any catholic hospitals? That’s the one thing I can think of where that could be a thing, if it’s a hospital that is super strict religiously.", "My sister worked for a Catholic hospital. Their baseline protocol was to save the baby at all costs, unless otherwise specified.", "I mean do you speak for all doctors and hospitals in every country on this planet?", "My friend when going in they realized she would need a CS and they ask her and her husband if it came down to it her or the baby who to save and they both said her.", "> I don’t know where all these hospitals are that make fathers choose between saving the mother and the baby…\n\nIn the wild fantasies of teenagers who fancy themselves as creative writers ... ie 99% of AITA.", "The child would probably be bullied by family too, because had they not existed, the mother would still be alive.", ">One day he was explaining to me something about the way she pees\n\n>I have a fucking vagina, & I think I have a pretty good understanding of it\n\nUh...apparently not.", "This isn't how it works *where*, please? There's an awful lot of blanket statements being made about what is and isn't done *anywhere*, based on folks personal and often out of date experience of hospitals in their state, let alone country, let alone world.", "yeah- my understanding is that it doesn't really happen like this \"we can only save one, you need to pick.\" it's more nuanced- if we do this surgery, it increases the likelihood of X. if we do A, B may happen.\n\nstuff like that.", "It's insane. I just read about how Idaho passed a new law that basically makes it a criminal act to help someone leave the state to obtain an abortion. \n\nAlso looked up how much sales of Plan B went up and some pharmacies noted a 3000% increase in sales. Waiting a few more months to see how the rates of newborn adoptions change.", "My great grandma died at 29 years old because the Catholic hospital would not terminate the pregnancy that was killing her. I believe it was an ectopic pregnancy. Her young children were left without a mother. My great grandfather did remarry to a wonderful woman who accepted his children as her own, but nothing could ever replace their mom.", "Exactly, they are very much not the same. No True Scotsman Fallacy right there.", "Maybe, maybe not. I know a woman who miscarried at 7 months. Only hospital near her was a Catholic one. They refused to do an abortion to remove the dead fetus...UNTIL she actually became septic and was in a critical situation. The life of the DEAD fetus was deemed more important than her own, unless it was actually killing her.", "Tbh, that's a very broad statement to make regarding all the hospitals in the whole world ever. \"Anne\" and her husband were in an Eastern European country. Now, I don't *think* this would be a particularly common occurrence, but I can't swear that *no* hospital would *ever* do it even within the broad line of \"Eastern Europe\", let alone globally.\n\nHaving said that, I would suspect the decision was more \"we can do X, y, z, which might have a worse outcome for the fetus and better outcome for Anne, or (vice versa).\"", "This might be true, but we don’t even need to get to discuss hypotheticals", "A woman who apparently thinks you pee from your vagina, soooo...", "Wow she's being a judgmental ass! Might want to warn Anne in case the topic comes up.", "Aye, absolutely NTA then; she brought up a sensitive subject and got upset because you had a different view to her own, that is not on you at all. \n\nIt also makes no difference whether you have children or not, and while I sincerely hope that neither of you will ever have to experience the situation first hand, your opinion is just as valid as hers. (Though I think ending the conversation as you did rather than attempting to have her accept this was very much the correct course of action).\n\nAs others have said though, if it is possible she will bring it up directly with Anne while she is visiting, you may want to try and keep them apart. I cannot even imagine how painful it would for Anne if Laura attempts to have this discussion with her...", "Because Anne is taking a trip to come and see you, Laura has decided Anne’s life has just moved forward without complications?\n\nNah. She’s so wrong for this.", "Right, but it furthers the belief that the fetus can be picked over the mother.  \"Just have the hospital force the pregnancy to continue in case they're wrong about the fetus being non-viable since the pregnancy isn't absolutely life threatening yet.\"", "Ah, pro lifers - it doesn't matter whether either mother or baby actually survives, just so long as the woman doesn't get a say in what happens to her body.", ">Having said that, I would suspect the decision was more \"we can do X, y, z, which might have a worse outcome for the fetus and better outcome for Anne, or (vice versa).\"\n\nIt was probably along those lines. \n\nDoctors don't usually ask, \"Who do you want us to save?\" but they do present treatment options and risks. \n\nIf we do XYZ, your wife has a better chance at full recovery, but we are likely to lose the baby. \n\nIf we do ABC, the baby has a better chance, but there is no guarantee, and we could lose both of them. \n\nTo a layman, it comes down to the same thing, choosing to prioritize the baby or the wife.", "Where did she say she thinks women pee out of their vaginas?  She didn’t.  She’s just saying she’s got the same basic “plumbing” down there as the guy’s daughter.", "She won't get the opportunity, Laura is driving to her home country to give birth there.", "Ireland was up to recently like this too.\n\n\nBig case about 5-6 years ago because mother died giving birth (can't remember if baby died too) because the law was too messed up.\n\nLife of the child was more important and abortion illegal (except in really restricted cases)", "That feels so mysoginistic on a really deep level.😕", "Utah was also like that, at least through the 90s when I had my kids. But they also had a fantastic NICU and awesome OB/GYNs.", "It happens in the US as well.", "While that is true, as well as horrible and barbaric, I can’t find anything about the spouse being asked to choose who to save, which is the scenario that is being discussed. \n\nNow if you excuse me, I’m gonna go look at some pictures of baby animals. After reading those three links…I need to see something happy", "also totally possible that he thought that, and she was trying to correct him bc she understands her body", "She specifically said she had a vagina when they were talking about urinary issues.", "INFO - what country are we talking about please? Half if not two thirds of the comments are people asserting X, Y and Z with absolute confidence based on their own country (tbh, their own states within one country).", "That was the case that made Ireland change their abortion laws. Meanwhile in Poland two women have died this way (while carrying wanted babies who died from natural causes) since they changed the law in 2020", "Are you talking about the case of Savita Halappanavar?\n\nIn that case she was miscarrying but not allowed an abortion due to fetal heartbeat and died of sepsis.", "Her baby died too. The baby had no chance as soon as the miscarriage started, but there was a foetal heartbeat, so \"this is a Catholic country\". >.<\n\nEdit: 2012 btw. Time flies alright. I'm glad she's not forgotten though. RIP Savita Halappanavar, Sheila Hodgers, Ann Lovett and other girls and women that suffered from stupid religious laws.", "She didn't die giving birth; she died from sepsis as a result of an incomplete miscarriage which doctors refused to surgically clear out because they were scared someone would accuse them of aborting the child.", "Or the case of the mother of 3 who was pregnant and brain-dead, and the family had to go to court to turn off life support, because the 8th amendment had muddied the waters so much. The doctors in charge of her care weren't sure they could legally turn it off without leaving themselves open to persecution, iirc.\n\nThere were arguments made that she should be kept on life support until the baby was far enough along to survive alone. Yes, using a braindead woman as an actual incubator.\n\nThankfully, the high court ruled in favour of the family but the fact that a grieving family even had to do that is just unthinkable.", "[removed]", "Yep. The running “joke” is that if altar boys could get pregnant, abortion would be a sacrament. Although it’s less of a joke and more a sad description of a depressing reality.", "It is a bit the same tho. Someone's decides over the woman herself if either *she* or the baby will die. I mean the question itself, that there even is the question who to save", "Yes, she has a vagina, like the daughter, as opposed to a penis like the dad.  In other words, she has the same basic parts down there, and might have experienced the same issues.  If she had said, “I also have a urethra,” it wouldn’t have made any sense, because dudes have one of those too.  It seems obvious to me she was saying “vagina” as a shorthand for “same parts” as opposed to “I think pee comes out of the vagina.”", "Fucking enrages me every time I read that.", "The same thing is going to happen in US states that have banned abortion after the Roe reversal. Probably happened already.", "Not how I read it 🤷‍♀️", "You can always make a new baby but the mother, on the other hand...\n\nNTA", "NTA.\n\nReality is harsh; no one wants to have to choose between their partner or their newborn child, but picking the mother is the objectively correct choice.\n\nThe truth is often cold and uncaring; the choice is going to be made to save the mother regardless. Saving the child is a movie magic moment that doesn't make logical sense.\n\nIf the mother dies in childbirth, you can't try to have another child with that individual ever again. If the child passes, yes, it's traumatic; in time however, you have the possibility of trying to conceive again.\n\nLaura's POV is not realistic.", "NTA.\n\nThis is one where people are allowed to have different views.\n\nDevout Jews and devout Catholics, for example will take diametrically opposed views on this particular issue.\n\nThe key thing is that everyone needs to realise that the decision *they* feel is best *for them* is not universally applicable to *everyone*.\n\nAnne and her husband made a decision that they can both accept was right for them. You feel in the same situation you would act likewise, as does Laura’s husband.\n\nLaura and your mother disagree.\n\nBut this is one where Laura and her husband need to get on the same page. \n\nLaura has the option to write a legally binding advanced directive to take the decision out of his hands, if she wishes: she can refuse any and all treatment  that is designed to save her life at the expense of her foetus.\n\nIf her husband isn’t willing to prioritise her wishes, she needs legal advice.", "If only one of us could have lived me or my son… I’d pick him - the catch is I probably wouldn’t have said that before becoming a mother and i definitely wouldn’t have understood… hate to say it your Mom is 100% right: 1 not to sound like a smug ‘breeder’ but you cant fathom parenthood until you are one 2 one should do pretty much anything to avoid upsetting someone whose PG  - 3 that definitely includes as few convos / debates about mortality and childbirth as possible.", "That's probably why it is Laura's husband's job to decide and not hers. \n\nArguing with a hormonal pregnant woman is a waste of everyone's time and emotions. \n\nKeep Laura and her opinions well away from  Anne and her husband, they don't need to hear this right now.\n\nESH basically", "YTA for making her upset..  when clearly she was upset and scared. \n\nNTA because your friends husband made the right choice.", "YTA for letting the conversation get that far with a likely hormonal and upset pregnant woman who is literally going to go through labour soon. You humour her and just let her get on with her opinions, keep yours to yourself and keep quiet. NTA for having that opinion though, I agree with you. I’d just never have that conversation with a friend in her position. It’s thoughtless and naive. If she was the one to bring it up, you change the subject or agree with her regardless of your actual opinion for your own sake because going up against a pregnant woman, you’re only going to look like the bad guy.", "Honestly. NTA, my partner and I had the same talk. We both agreed if push came to shove, he'd pick to save me. Why? Because if I passed, that's it. No more babies. I'm gone. And as messed up as this sounds, if our baby had passed. After mourning him, and therapy. We'd be able to try again", "I really don't think anyone is in the wrong here. Her body, her choice after all. It's up to each individual person what they would choose in the scenario. If my wife didnt have an opinion and i had to make the choice l, I'd save her. If i was the pregnant one, i would tell them to save the baby. Everyone is different. On that note, it's not wrong to have your opinion, especially if she asked for it. So NAH", "All she has to do is put her wishes in writing - then she can give it to her provider for delivery.  Then what she wants takes precedence.", "NAH\n\nIt's a sensitive topic. Even if you had agreed with her or just (my recommendation for future) smiled and nodded, she would have still been irritated because her husband is not on board with her thinking.   \n\n\nJust in future, if a pregnant person is talking about this kind of thing (death or disability of baby or mother in childbirth) to you, be mildly supportive since they're most likely not actually looking for your input and just want to vent or talk it out to themselves.", "NTA. Honestly the way I look at it, as unfortunate as it is; it's easier to have another kid in most cases than it is to lose the love of your life.", "There is no right or wrong here, just what the surviving parent could live with. It is a decision every couple has to make for themselves, and no one else has a right to impose their thoughts on this situation. \n\nYour friend is very pregnant very worried, so she's emotional. Just leave it be. \n\nNTA.", "Pregnancy hormones are real and nerves are real. Your friend sounded scared.  It was a terrible topic to even be discussing. I am going NAH as the conversation seems to have evolved organically.  But you might want to read the room and avoid those conversations in the future.  Please apologize to your friend for upsetting her. Then drop this topic.", "NTA - I mean you were talking about a subject and gave your opinion on it. It would have been different if you called her names while doing it like \"OMG You are crazy for that decision I would let the baby die!\" but I don't think that's how it went down. It doesn't make a person an asshole for giving an opinion on how they view a subject in which they are talking about.", "NTA. Laura is free to believe that’s the right option for her but others are free to feel differently. As a pregnant woman myself it’s a discussion my husband and I have had multiple times with the same conclusion as you- mother over child. Laura needs to shut her judgmental mouth and hope she isn’t ever in the position that the choice has to be made.\n\nEdit: corrected name", "YTA.... for making up this whole situation. You may have talked about it, but your friend wasn't given that choice because that's not the way it works. If your friend said it really happened, then he's TA as well for lying to you.", "AITA for thinking i would save the mother & try again?", "NTA. I have 3 kids and my last was a pretty horrible birth experience. We will not be having another mostly because it would be this exact risk next time.\n\nShe thinks you're not thinking logically because you don't have kids, but really most of us that have atleast one kid, and especially those of us who have more would choose ourselves over the new baby. Not because we don't love that new baby, but because we have other children to already put first and think about. Thank God my baby and I both made it, but if we had to choose it would have been me.\n\nIn my opinion there is nothing \"heroic\" about leaving your husband grieving and taking care of a newborn at the same time. You'll also be leaving that child motherless. To each their own, but I could never do it.", "\" That she would not be able to live with herself if her husband made the same one, that the child comes first. \"\n\nThat's her, not Anne and Anne's husband. She doesn't have any right to be mad at them for the decision they made.\n\nI have a child. My husband and I talked about this before I gave birth. I told him to choose me over the child.  I love my son very much. But my life has value too. And my death would affect my friends and family much more.\n\nNTA", "Wtf. I would save my life partner over our baby ANY DAY, EVERY DAY. Nobody says it‘s an easy decision, but it‘s the only logical one to me.", "So in this scenario who then looks after the child? The depressed father or does the child end up in foster care as the dad is probably unable to cope in depression etc", ">Laura is up in arms about this - she is about to deliver any day now and says Anne's husband made the wrong decision.\n\nWhy does she think her opinion about someone else's traumatic birth matters?", "NTA honestly Laura is being irrational and if her husband doesn't want to raise the child without her, choosing the child over her would be the wrong decision for everyone.", "Have you all noticed what’s going on in the US?  The birth of the baby is the most important thing in the world. There are no support services afterwords and we don’t care if that child is abused/neglected.  Just make sure it’s born at all costs.  Mothers do not matter.", "NAH.  My doctor had this talk with us when I was pregnant.  He said all efforts would be to save my life.  My husband agreed, I did not.  The Dr told us it was not our choice but protocol. As a pregnant woman who felt bonded to her baby, I wanted her saved.  As a husband my hubby wanted me saved.  Both are valid points though I was heart broken at the time that my husband felt that way.  The child is an adult now but we both still feel the same way.", "NTA, but perhaps you should have immediately changed the subject and told her that you were not comfortable discussing this topic.  **It is one thing to assume what you would do in a tragic situation, and another thing to have to decide what to do in a tragic situation.**", "Of course YTA. It’s something every mum to be has thought about. Some are firmly in the camp of save me others in the camp of save the baby. You’re not pregnant. It’s not your choice.", "Out of the three main baby hospitals in dublin many moons ago, 2 were avoided If at all possible as they had a reputation of not saving the mother. 1 hospital was known for saving the mother.\n\nNTA\n\nAny partner of mine better choose me if given the choice. No contest. We grieve together after the fact", "NTA. Laura sounds like an uppity bih. But what are the laws and healthcare like in your country cause this sounds like a flat out lie. Either that or Anne and her husband should sue that hospital. People do NOT get to choose whether their spouse or baby dies in situations like this. The baby is delivered and then one team of doctors work on saving the mom while another works with the baby, but the mom is always the priority no matter what the husband says. \n\nThis shit only happens in cheesy soap operas.", "YTA for having this conversation with her and not changing the subject \n\nLaura should tell her midwife and make this part of her birth plan", "You can't make more wives with a baby, but you can make more babies with a wife.\n\nNTA", "Don't know why Laura used \"you don't have children\" card, she is pregnant, she also doesn't have. NTA", "NTA. Laura is an attention seeking drama queen making a big fight out of an unlikely scenario. Her poor kid.", "NTA but also this is completely irrelevant because the first priority of the doctor will be the mother no matter what she wants. If Laura is in this situation they will save her, not the baby.", "I don’t really think this should be an AITA post. That type of scenario is going to be different for everyone. You are not TA for your thought, neither is she. Some women struggle to feel the bond to their baby throughout pregnancy and some feel it right away, very strongly. \n\nEveryone is different.", "Uhh is this hospital in the 1700s \n\nHonestly ESH this is a conversation neither of you should have engaged in.", "Everyone knows that in a emergency where death is near certain doctors will drop everything to give the husband of the dying patient a moral quandary. That’s just logic.\n\nHell if I know what KIND of logic. Maybe crazy drama movie logic.", "I know of a situation where there was DIC from chorioamnionitis, CS would have been too dangerous, IOL taken too long and D&X was the safest option to evacuate the uterus.\n\nIncredibly rare, but genuinely a clinically appropriate life saving 3rd trimester abortion.\n\nEdited to add: I’m a Dr, this is not “something I heard from a friend of a friend”, this is a case I know of.", "My hospital is acutely aware that if they have to make the call they save my child. i have it written down as a directive (i am also a VBAC patient on induction typically so there is a slight risk of uterine rupture or other complication). they know i prioritize getting baby out before my life is saved if it's between getting baby out and saving me. this assumes they only have time to do one though. my husband is aware of this directive. my husband is aware that if he made a different choice he'd find himself divorced.\n\nit's written down on my VBAC consent forms for a reason though. it provides them with legal ass coverage that i had a directive in place. Two VBACs and never came close to an emergency as of yet. And my third TOLAC looks promising too considering my successful VBACs\n\nthis isn't like it happens everyday though. the chances of a hospital needing to make split decision tends to come from a sudden emergency i'd imagine. and often i imagine a lack of space for everyone to do everything at once. like an emergency c-section while trying to stabilize the mom after a severe car accident doesn't sound like a fun time for any doctor who needs to be working in the space that is the human body. we aren't actually that large of a work space i'd imagine.\n\nbut seeing that hospitals prioritize moms is why i make my wishes known and am happy to put it in writing for a hospital if required for their legal protection. and it protects me should they deviate from my written directive.\n\nbut honestly i don't see why laura can't have hers in writing with the hospital she delivers at. sure the hospital may be like this rarely happens but laura can clearly say she knows it does happen.\n\nisn't that the point of ensuring your medical desires is written down. to ensure no one overrides the decision should you become unable to make one?", "First hand experience they don't even make you decide between the baby or chemo. They have different chemos now that don't pass the umbilical cord but then again everyone's cancer treatments can be different so that may be the case for some people. There's is a lot of time given to make a decision too", "[It’s rare but it happens](https://www.statnews.com/2022/08/30/whose-life-do-i-prioritize-a-choice-no-parent-wants-to-make/)", "Thank you! I’m not a doctor but I have had a child. Once the baby was out, another team took over while he tended to me. \n\nPeople watch too much television and confuse it for real life.", "I think it’s maybe purely a covid thing. I never had it with the boys (13 & 8) but with my daughter’s pregnancy I caught covid and ended up admitted on oxygen (they were debating induced coma and ventilator like I wasn’t even in the room) and it was discussed with my husband and not me -again, like I wasn’t even in the room. Emergency c section under GA and woke up three hours later not even knowing if she was alive. Bloody rotten situation but grateful for her anyway.", "why? she's the one gestating the child she can feel however she wants on the personal choice.\n\nmy husband would be divorced if he chose me. end statement. he'd still be a single parent and only 50/50 custody (i don't see why that wouldn't be our arrangement).\n\non my VBAC consent forms i have it written that if it comes down to it the child is primary and i'm secondary. it's highly unlikely to even be an issue tbh. but i feel so strongly about that that i would being calling divorce attorneys before discharge.\n\nmy first pregnancy my medical issues flared so bad a doctor recommended a medical termination. and i have suffered excruciating pain and been dismissed by doctors every pregnancy.\n\ni can not just go on to have another baby without literally compromising my quality of life and i don't think it would be medically wise.\n\ni think the key here is that Anne's husband made the choice anne agreed with so it was the right choice. meanwhile laura's husband doesn't wish to make the same choice as laura which is the issue.\n\nLaura's feelings are valid. but the differ from the person expected to make decisions for her and her body should she be unable to. that's a problem.", "Rubbish.    \n\nIt happens, across the world.    \nPlease do not make blanket statements", "Pregnant woman should have kept her opinion on her friend's **actual** traumatic birth to herself.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", " I believe it was an ectopic pregnancy. Her young children were left without a mother.", "My Nana delivered her first baby at 15 in a Catholic hospital and was in labour for 3 days before they finally did a c-section to \"save the baby\". My Nana lived, but that wasn't their priority.", "Laura? I think you mean Anne. Anne is the one who was in labour, not Laura. I know it can be difficult to keep fictional characters straight sometimes.", "My husband and I both had to file paperwork saying who the priority was if something happened when I had my son. He’s 13, we’re in Virginia. Edit to add that this was a public hospital.", "But would they ask the father to make the decision, or would they just do everything to save the baby even if it kills the mother?", "I'd say it's very unlikely they could have actually saved that baby. A dead mother does not a healthy foetus make. They might have been asking Anne's husband about what choices to make, but I'm sure they advised him of the risks and chances of each outcome. It's likely that the choice was something more like an early induction, where the baby would die, or not enducing and it would be very likely both would die. A foetus needs a living person to carry it after all.", "If you have an existing child, I'm sorry but I'd call you selfish and horrible. If any woman would choose to leave an existing child and leave behind a partner who is now grieving, newborn AND a sibling who has lost a Mother is out of their mind imo.", "Ours was an emergency situation so only my husband had to sign. We are in Washington.", "I’m a parent.  And I’m more pro-choice than pro-life.  And I would dispute that it’s a “fact” that anyone willing to sacrifice themselves to protect a child as it’s being born must have “serious issues”.\n\nSome people feel a strong bond with a child while it’s still in the womb, and some don’t.", "In most non-medical settings, \"vagina\" is kind of used as a catch all term for the collection of all the lady parts, internal and external. Should she have said \"I have a urethra that I urinate out of\"? Because men have those too, so it wouldn't really clear things up. \n\nShe's basically saying, I am female, I pee the same way as your daughter.", "Ugh. Solidarity!\nWhen I was pregnant, I read a little into when and if doctors perform medical procedures (c-section, …) against the mother’s wishes if an emergency occurs. Lo and behold, that’s a very grey area and differs from county to county as well.", "I find that ... Deeply not okay. The mother, the actual living human being should by default be saved. \n\n\"Ask the husband\" literally horrifies me.", "Agreed. And in the aftermath, I have to imagine most laymen people wouldn't even remember the multiple choices, they'd remember the sentiment: baby or wife, so really, it's just a shorthand.", "Using vagina as a catch-all *when discussing anatomy* may give the impression that you're ill-informed and therefore not the best person to give advice on the subject.", "Hello, \n\nhttps://en.m.wikipedia.org/wiki/Death_of_Savita_Halappanavar\n\nHer name was Savita, she was a dentist living in Galway and she was 18 weeks pregnant with her first baby. She died from sepsis in 2012 after her waters broke and Drs waited too long to end the pregnancy because the foetus still had a heartbeat.\n\nHer name will never be forgotten, and her memory was for a revolution.\n\nIreland legalised abortion on request until 12 weeks in 2018 in a huge referendum that was won in a landslide.", "I only wrote about the 3 hospitals myself. I think it was the rotunda that actively chose to save the mother. My neighbour and all her friends avoided the coombe and hollestreet", "It’s a very common movie/tv trope", "If you aren't there already, r/eyebleach is very useful for cuteness", "I did say he chose to save me, as did the other commenter. \n\nI literally could not make the decision at that point, it was a medical emergency and my husband is my next of kin. He is the one that would make that medical decisions of any kind of if I was not capable of it. I was not in this instance. My mom would have had to make that decision had I not been married.", "Sometimes they HAVE yo ask the next of kin.\n\n\nMy husband and I had this conversation, as well.\n\n\nOP, NTA", "Yeah, exactly. I doubt you hear the words so much as absorb this awful idea of a choice.", "I didn't get far in the game, but I swear Death Stranding was like \"yep, we use comatose women to make the fetuses we all strap on because theyre closer to death.\" That's what your comment makes me think of", "Erm...that's my comment word for word!", "Ok... Good for you? Doesn't change the fact that no-one, not your husband, not your mum, should be put in that position at all.\n\nIf there was a choice to make, it meant you could live. Doctors should NOT be allowing a woman to die when she could live. The conversation should never have happened. Until the baby is born YOU are the patient.", "Thsi is actively happening in TX! I have two friends in Houston that had partial miscarriages of wanted babies (baby died but didn’t come out). One had to call 20+ doctors before one would agree to an abortion so she wouldn’t go septic & die in the meantime(took about two weeks) & the other ended up having complications from waiting so had to have a total hysterectomy & can never have children now.", "There was an [article about it in the Washington Post](https://www.washingtonpost.com/politics/2023/04/10/pprom-florida-abortion-ban/)yesterday-- a woman who nearly died in Florida when they wouldn't let her have a needed abortion.", "I downvoted and reported the spam bot for you.", "How do you know the conversation was not had before hand? How do you know that in all these cases the conversation had not been had beforehand? In my situation we didn't have the chance to discuss it but in others they did. I agree with my husband's choice. If we didn't see eye to eye on these things we would not make good life partners, in my opinion.\n\n Yes, you are correct, a woman should absolutely have that choice to make on their own, it should not be up to anyone else.  Unfortunately, there are extenuating circumstances that come up and that can't always happen. There are also many women who want their baby saved over them, which is why this post was created to begin with. I also know women who have said they would prefer their baby saved and women who would prefer they were saved. As much as everyone should have the choice when it comes to their medical decisions, there are unfortunately times where either the discussions had not come up yet or the decision that was made is not feasible.", "And a family in Texas just had to have a funeral on Good Friday for their baby born with anencephaly. They knew at 20 weeks but weren't allowed to terminate so she had to carry the baby, give birth at 33 weeks and then watch it pass away a couple hours later. Absolutely heartbreaking.", "OMG! That is awful.", "Several women in TX with similar experiences are suing TX over the abortion ban as the thing we said would happen is happening.", "This situation does not exist in reality. Doctors don’t make you choose who lives and dies.", "NAH. This is an extremely personal, and extremely emotionally fraught, topic—especially since Laura is currently pregnant. It’s also purely theoretical for both Laura and yourself; since neither of you are actually in that situation, it’s hard to say how your feelings might change if you were.\n\nI don’t think it’s productive to discuss. There’s also no clearly “right” answer. YWBTA if you didn’t drop the conversation as soon as you realized it was making Laura uncomfortable and upset. Pregnant women have enough to deal with emotionally, without piling on theoretical philosophical discussions about whether mother or baby’s life should be the priority.", "I don't believe you. I don't believe there is a scenario in which a woman has a \"botched delivery\" and the doctors waste time asking the father who they should save rather than wheeling the patients down for an emergency c-section. I want details. Or did this happen at a birthing center or something?", "I support putting the baby first,as I am a mom and would never put my life before my children...ever.  But I understand that today's society many people do not value the lives of babies or children. Or they value their own life more than babies. \n\n\nYou have to accept that people have different life priorities and pov. Just disagree and move on.", "My main reason that the mother should be the default choice is....\n\nWho is going to mother all these motherless children?\n\nIdk seems obvious to me, not moral, just logic.", "You both have valid opinions. \n\n My husband and I have talked about this certainly. And we're not of one accord about it either - and my kids are almost grown now. Some things you never really do see eye-to-eye. But, you can stop arguing over the maybe this or maybe that things. That's all that happened.\n\nAnd your mum is forgetting that you didn't force your opinions on Laura. She asked what you thought. It was just an organic conversation that you ultimately ended.\n\nNAH.", "Gonna go against the grain and say ESH. \nas a person who almost died giving birth to my first kid, I absolutely told my husband to save the baby. I also know that's not exactly up to anyone but the medical team.\n\nIn my world there's some things that you don't discuss as casual conversation. No, you don't get it because you've never had children. Laura doesn't get it either because she's never been in that situation. She shouldn't say anything about Anne's husband either. Frankly the entire conversation leaves a bad taste in my mouth and I think you guys shouldn't have brought that topic up at all,let alone argued about it.", "NTA. Laura can go eff herself. She needs to mind her business. Her and her husbands position is the only one she should be concerned with.", "NTA Laura should avoid asking questions if she isn't open to hearing the answers. It's also not her place to judge your friend's husband's decision. There is no universal right or wrong answer. It is entirely up to the couple having the baby. \nImagine being upset because you told your friend she should've just died, and no one agrees with you.", "NTA. If that’s a decision that has to be made (a doctor pointed out in the top comment that it’s isn’t really), it’s a very personal decision and I don’t think there’s a universally right or wrong answer. Laura is TA for judging your other friend’s decision. If I was that friend and someone told me I was wrong to want to save my own life in that scenario, I’d tell them they’re welcome to fuck right off out of my life.", "NTA Sounds like Laura brought up the subject, you expressed your opinion politely, and Laura got upset with you because she disagrees.", "NTA. It's up to every individual how to deal with such a difficult decision. But I completely understand saving the mom and not the baby. And this isn't the wrong decision. None is, as long as both individuals in the relationship eventually agree on the same decision. It's difficult, but you best talk about this before delivering the baby.", "you're NTA, since that is your opinion about yourself and not her. but maybe stray away from such emotional heavy topics while she's pregnant.", "NAH\n\nI think this is up to each person.  There's no right or wrong answer in the moment.\n\nBut getting upset to the point of fighting with your spouse about something that is extremely unlikely to happen is concerning.  I've seen this and similar situations pop up here before.  Where the husband/bf is placed in a lose lose situation and then has to deal with an angry spouse.", "No one's the asshole here.\nLet me explain, your partner loves the baby when it's born, your parents love the baby when it's born.\nBut the mother is the one who loves the baby ever since they knew about their existence. The connection for almost a year is incredible. Giving a life to somebody so beautiful it's like you've been together for an eternity . That's a baby for the mother. Laura is being upset just because of hormonal reasons. You say you would like your partner to choose you as well but yes, if you were in her place you'd do the same. \nOfc any husband will choose the wife because he doesn't have that connection w the baby lol\nSo don't worry it's all hormones xD\n\nBtw don't misunderstand I'm not a mother I'm just 18 I'm studying OBG", "She’s a very pregnant woman who has been nurturing this tiny thing inside her so I understand why she’s upset but I’m going to say NAH. Laura can have another baby, but there isn’t another Laura. And forcing her husband to become a father and widower will be horrible for him as well. \n\nEveryone needs to kind of step back and let the pregnant lady be protective and not push her. But you’re not the AH nor is she.", "NTA- you have the right to your opinion and Laura has the right to hers. \n\nUltimately there is no perfect answer on whose life should take priority that is acceptable to everyone in the world.\n\nThe next of kin often does have to asked to consider making these type of medical decisions.   Some hospitals insist on having these discussions in advance when high risk operations or pregnancies are involved and getting signed authorisation from both people.", "A heartbreaking decision like that can ONLY be made by those forced to make it in a unfathomable traumatic moment and situation.\nYou may think you know what you would do NOW but I truly hope you are never faced with the reality of having to make it. \nMost everyone who gets into these what if’s scenarios believes they have the ability to determine the outcome at the time the question is asked- but the reality is very different in the midst of it- circumstances, variables and complications arise that can greatly change the decision you believe you would make today. \nNOTAH -", "I think everyone in this scenario should be thankful they are not the one having to make this terrible decision. Ann's husband deserves empathy and care not criticism for what he had to do. Poor man. NTA.", "What do hyper pro-life people do in this situation?", "NTA, tell your mom and your friend. The husband made the right decision for HIS family. And if it were you then you and your spouse will decide what is best for yourselves. For someone to say he made the wrong decision is full of Ass Holery.", "NTA!\n\nWhile I get her point of view as a recent first time mom, I rationally knew I should be a priority over the baby (which as other says rarely happens, especially where I am), but I would have wanted the baby to be prioritized because protecting him is all I could think about. \n\nHowever, she was criticizing your friend who went through something traumatic! Which is why I don’t say N A H since you were defending people prioritizing the mother.  Since Roe v. Wade has been overturned in the US, there’s been a tendency to see pregnant women asking to be save if it ever comes to it and I think it is heartbreaking that in some states, they are not, and that states rather have orphans (and some who may be traumatized for those who are not first time moms).\n\nWhile you are childfree, those conversations are becoming even more important with the huge step back abortion rights just take. And once again, you were defending a friend. She prompted the conversation, and as long as you did not say she was stupid for her opinion (which is not the same as being stupid for judging your friend) my judgment stand.", "Gentle YTA because there was no reason to push your point with her. \n\nFWIW, my husband and I had the same discussion, and I was adamant that if anything went wrong, I wanted everything focused on the baby instead of me. I told my OB, too. My husband kept insisting that he would save me, so I put it in writing. (I honestly doubt any hospital looks at the patient birth notes, but whatever.)\n\nI almost died with my second. It was a post-partum hemorrhage 9 days after she was born (which is incredibly rare - it's usually during delivery), so it didn't affect her at all. But I remember thinking, as I was bleeding to death in my bedroom, waiting for the paramedics, that my daughter was just ... perfect. I was so happy that she was there, and if the cosmic tradeoff was my life for hers, I had absolutely no regrets.", "NTA.\n\nThis is a decision that should be discussed prior to delivery and is personal to the parents. \n\nI know that Christian religions typically do not allow the choice to be made, you cannot priotize one over the other. \n\nI know that Christian religions typically do not allow the choice to be made, you cannot prioritize one over the other.", "Anyone who would choose a baby they don't know over ME, their loving partner in life, would be a huge AH imo. I can't even imagine the logic of this choice. There are plenty of humans on earth and a couple can (likely) have another baby. \n\nNTA", "I am sure I will get much shit for this, but I'm a woman, no kids by choice. I understand where women come from when they get angry about this thing since they have held the baby for 9 months, but they need to think about what the significant other will go through, too... SO will have a deceased partner,  most likely have a child that may need much medical attention, and who knows if they would even have the means to take care of the child on their own. There is a burden on the partner if the woman dies, and they are left to work through it. \n\nIt is traumatizing no matter what happens, but yeesh, no one should be given shit for what they deem necessary in this case.", "Doubt this really happened the way OP describes", "NTA. Your friend is judging another couple for making a deeply personal decision that was forced upon them suddenly, needed to be made immediately, and left them with no good outcomes. They made the decision that was right for them. Laura and her husband are free to make the decision that's right for them. In all likelihood, they will take a healthy baby home from the hospital, so she should worry about counting her blessings rather than admonishing a couple that just went through such a nightmare.", "Laura's body and brain are currently hijacked by baby hormones, so she can very much feel that way but you nor Laura's husband aren't wrong for disagreeing.\n\nI wouldn't want to be without my spouse, whom I loved and had committed the remainder of my days to, in favor a new baby whom I now would raise alone. Heck even if I'd already had children, so you want your current family to lose a parent to obtain a sibling? Not unless the birth parent is lost, period paragraph, and the baby can be saved despite that tragedy.\n\nNTA", "NTA people shouldn't ask for opinions they don't actually want the answer to if they need a certain answer.", "NTA\n\nLaura's issue isn't your position. It's that her husband's position isn't her position. She needs to deal with that.", "I am also a physician (not OB, but in a specialty where I see/hear about a lot of OB cases) and I agree, this is mostly a \"dilemma\" manufactured for storytelling purposes. In the vast majority of cases, saving the mother and saving the baby amount to the same thing . . . it might be that only one or the other survives, and those situations are heartbreaking, but that's a matter of luck rather than choice.", "My mom retired from the NICU. And in faith-based hospitals, like the one she worked in - its just hospital policy. I don't think mom ever once mentioned the policy being enforced at her job, though.", "It does happen, albeit rarely. There are many situations where continuing a pregnancy leads to worse outcomes, some of which might develop suddenly; in a subset of these cases, the patient has a compromised capacity to consent, so another party must make or relay decisions. For example one might decide to pursue palliation only vs. aggressive treatment. The point is, objectives can be different when patients are pregnant: although a fetus isn't a child, you do have two interests that might turn conflictual, and in some emergency situations, you might not know which values the person might have held. Discussing ahead is painful as in this vignette, but necessary. People, keep your living will up to date!", "In a story anything can happen, even things that make no logical sense.", "why do people even care? They're making expectations that don't exist. \n\nNo different than having a crush on someone. You don't actually have a relationship, but you are imagining a future that might not even happen.\n\nthe mom and dad can always have another baby", "Being a doctor doesn't mean you know everything. I have a friend who had to have an emergency delivery at 24 weeks because her first pregnancy, for unknown reasons, shut her kidneys down. She almost died, her son almost died several times. They'd been trying to get her to 28 weeks but she would have died.\n\nSecond pregnancy was unremarkable.", "Clearly it’s Targaeryan family hospital, run by Westerosi Maesters", "It’s because this post is very very fake.", "Seriously, if time is critical and they're too short staffed to have a separate team for the baby, no one is going to leave the patient to go ask the spouse philosophical questions.", "I had absolutely no idea that medical practices are 100% the same world wide, and there are never other influencing factors.\n\nWhat you should have said is that in your area/country they don't do that, which is fantastic - but here is a dose of reality for you - not everywhere is like where you live, and many places still have views that seem very antiquated and backwards, as well as factors stemming into the issue.\n\nAlso, shockingly enough, what if it was a home birth and there were not enough hands on board; clearly your massive doctor brain thought of all the possible factors for it and didn't just assume that it was a hospital birth.", "Also if my husband didn’t save me I’d haunt the fuck out of that baby I’d be so pissed", "My uncle had to. But my aunt was hospitalized with a stroke and having other complications. \n\nShe was in the hospital for months after as well. My cousin spent her first few weeks with us as my uncle stayed with my aunt.\n\nI just found out about it a few years ago. My cousin and uncle were joking about it and I was like \"wait, fucking what?!\"", "Get me my fainting couch!", "Yeah, I read it in a Victoria Holt novel set in the 1800s", "They asked my dad who he'd prefer they save, was born in 94", "They did when I was born. Who knows if they would've gone against what he said, but they went out and asked him, me or my mother", "You're really confident about this with no evidence. When my mom delivered my sister they made my dad check off on a form which one to save and sign that he wouldn't sue. The paperwork is literally in my sister's baby book. Yes, it's a flashy thing that gets put in shows but it's also common enough in shitty religious hospitals.", "That's not a no true scotsman fallacy", "Or they made fictional names for their friends for privacy reasons and got them mixed up?", "At 7 months that's a stillborn baby. But unfortunately, things like this do happen now", "How old was said sad and how old were you? Because you could be 18 and dating a guy in his 20's and it's not super illegal. Which is what they were hinting at", ">People have kids in high school and younger\n\nTalk about an idiot.", "then i'm out of my mind. i'd also prioritize my kids over my husband. he knows it, i'm fully honest and he fully agrees.\n\ni can't just \"replace\" my kids without literally suffering. i can always fall in love again, if it suited, but i can't make new kids with ease. unfortunately fertility doesn't mean being blessed with pregnancies with mild discomfort.\n\nnope i've ended up on narcotics or just flat out suffering. i choose that every time i choose to carry to term. i recognize that i will be treated like an incubator by my specialists more often than not. that suffering is for the health of a child.\n\nbut if i had to choose my husband or my kids it's a no brainer for me. he's a grown ass adult who has lived a life they are small humans i put on this planet and have an obligation to as they can't always defend themselves the same way my husband can.\n\ngood thing my husband also admits he'd choose the kids too. i chose a partner who shared my values.", "Catholic hospitals in the US. I would honestly refuse to go near any Christian hospital in the US until menopause.", "Let's not forget they calculate the beginning of the fetus' life as starting before the parents even had sex.  So that the six weeks is actually about 4 weeks.", "Talk about naive🤦‍♀️", "Savita Halappanavar. It was 2012. She died of sepsis following an incomplete miscarriage because her surgeon wouldn't operate while a foetal heartbeat could be detected.", "It is EXTREMELY important nuance, though. Save the baby or the wife is very different from risk the wife to give baby a shot vs. save the wife but baby certainly dies.", "How are they not idiots? Please, do enlighten me", "Mhmm yep you are so right babe, have a blessed day!", "It’s amazing how you have a complete transcript of the conversation you were definitely there for!", "Yep\n\nThat's the one.\nThe law was messed up. Doctors and nurses too afraid to do an abortion and lose their licence / go to prison.\n\nThe poor family. It was devastating for them.", "2012? Jeebus. It doesn't seem that long. So enraging that it happened.\n\nHope something like that never happens again.", "Yes\n\nThank God another familybfoes not have to go through again here", "Oh yes\n\nThat was horrific for everyone", "She was 14 weeks pregnant at that point. I looked up cases of women who were like her. Very few of the pregnancies were carried to term. The ones closer to the end of the pregnancy were more likely to make it. She was not far enough long to carry the fetus to term. Plus, she was oxygen deprived long enough the fetus was too.", "You're saying \"I have a vagina\" translates as \"I have the same basic anatomy as his daughter, which makes me qualified to give advice on her urinary problems\", yes?", "That phrase and \"13 year old man\" (regarding Adam Toledo) are probably the two most enragingly haunting phrases that have stuck with me.", "That's awful. How is that pro-life? How is a dead or certain to die fetus more important than the mother's life, or potential future babies?", "WTH? I'm genuinely confused at what doctors they do too and are they trying to consider a D&C as an abortion now? Once the baby has passed away they're in the clear. It's ridiculous how they're making abortion more than what it is.", "Some of the doctors are super scared in this case. I am thankful that there are few in my area in a highly conservative state that will at least still do them for partial miscarriages.", "A DNC is not an abortion…. I hate that so many people think it is. DNC is done with “incomplete” miscarriages, where not all of the baby was passed/delivered/whatever you want to call it.", "Thank you! I didn't realise it was a bot!", "As I said, in my case I signed the paperwork as well. So often there is a discussion beforehand between the two. With me involved it wasn’t my husband (likely with my mother there, hysterical) making the decision on his own.", "But hey, pro-life, amirite?", "It’s not pro-life. It’s not more important than her life. All of this is about the power to control and punish women.\n\nIf this were about life, we would have rules that made medical sense for these cases, a robust program to protect the mom and fetus during pregnancy, counselors and doctors to help women decide what to do (ie if they would like to adopt the child), streamlined adoption and fostering so kids are properly cared for, and support for kids and moms/parents.", "It does technically fall under an abortion but it is part of a spontaneous incomplete abortion. The medical term for miscarriage is spontaneous abortion.", "My mother would have been hysterical also. We had the conversation for next time after the first for sure, as well as many other conversations."]}