{"id": 14615, "submission_id": "12jqhwh", "title": "AITA for not inviting my “daughter” to my wedding?", "selftext": "I (37M) am getting married this fall and have made the choice to not invite my daughter Bella (16F) due circumstances I will explain in this post. Before people tell me that we should sit down and talk. Or do therapy. Those options have been exhausted and are no longer viable. \n\nMe and my ex wife Theresa (38F) do not have a good relationship. We started dating at 16 and then had Bella at 21. At first everything was awesome. But then my wife started hanging out with a group of women. Just not very good people. I refused to hangout with them. My wife started drinking heavily with this group and going out at night leaving me with our daughter. I didn’t like how she was keeping up our home either as I worked full time and she didn’t. The final straw was when I was forced to come along bar hopping. Theresa got embarrassingly drunk. Then started calling me a loser in front of everyone. This was not the first time she had publicly disrespected me. She had a habit of trying to show off to her friend by belittling me. I filed for divorce the next weekend. \n\nThe original custody agreement was 50/50. Which then changed because I asked for a DNA test on Bella. I had heard rumors and wanted to confirm. My ex blew up and refused to allow a DNA test to be done. Solidifying what I expected. My ex went back and got pretty much full custody because I refused to pay child support without a DNA test. This has been the arrangement for 5 years. I see Bella a few times a month. \n\nI do what I can but I don’t have custody so it’s difficult. I am engaged to one of my best friends Chrissy (33F). We’ve known each other since college. Bella hates her for no reason. Chrissy wasn’t even involved in my life once i got married. Bella for some reason thinks she is terrible. Chrissy has been nothing but nice to Bella. Recently someone showed me Bella’s social media where she blasted us. Saying how she had a deadbeat dad (not true as I paid for her and her mom for 7 years. And still give her money whenever I see her.). And called chrissy a slut in the same post. \n\nI was planning my invites for our wedding and I did not invite Bella. She doesn’t care for us. She called Chrissy a slut. And shamed me on social media lying for attention. I also don’t want drama at my wedding. It should be a fun time. Not another event for Bella to hijack. My ex wife found out about the wedding and asked what Bella’s role would be. I told her she didn’t have one because she isn’t invited. I called Bella and gave her my reasoning. As well as telling her that her post on social media played a factor so she should be more careful what lies she wants to put out there. She tried to apologize and say she would behave at the wedding. I told her that I knew she didn’t like Chrissy, or me that much. So why would she expect an invite. She called me an AH and we haven’t spoken since. AITA?", "created_utc": 1681314873, "permalink": "/r/AmItheAsshole/comments/12jqhwh/aita_for_not_inviting_my_daughter_to_my_wedding/", "score": 201, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I could be looking at this situation from my point of view and not hers. I do not think she fully understands why I don’t want her there even tho I’ve tried to explain why. So maybe the lack of understanding makes me the AH.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: why didn't you have the courts order the DNA test? That's like standard divorce and custody procedure #1. Your ex would have been held in contempt if she refused a court-ordered DNA test. This makes no sense.", "INFO: it's unclear when you decided to dump your daughter.  If you had 50/50 custody for 7 years and then decided to dump your child, then YTA for that and nothing will ever fix it.  She is probably right to hate you.", "From your daughters perspective, you are absolutely a deadbeat dad. You could have gotten the dna test yourself on your custody time, but it’s a lot cheaper to just stop paying child support isn’t it?\n\nGee I wonder why she has so much resentment for the fiancé of the father who basically abandoned her with an alcoholic mother. \n\nWhat a mystery. \n\nThat poor fucking girl…YTA", "\"Daughter\" YTA just for that. Get a court order for a paternity test BEFORE you stop paying child support. You also raised this child, but suddenly she isn't your daughter? That is new depths of assholehood.", "Eh, I wouldn’t go as far as calling you an AH, but don’t expect to be able to salvage any kind of relationship with your daughter in future.\n\nETA: Read again and changed my mind, if you’ve been wanting a DNA test for 5 years, that means Bella was what, 11, when you decided you wanted one? Which tells her that you only consider her your daughter and want 50/50 custody if she’s genetically yours, regardless of the fact that you raised her from childhood. Weird hill to die on if you actually care about her at all, and weird to expect her to want to get along with your fiancé. \n\nYTA.", "You seem determined to destroy your relationship with your daughter.  I would say YTA, but you may be doing her a favor.", "YTA as a parent you have failed Bella. Either she means something to you as your daughter or she doesn’t. Paternity test or not. If you took the test today and she is naturally yours how would you make up all that time of neglect? And if she’s not, would the time you did spend with her mean nothing and your dropped out of her life as such? Can you not see through her lens of life why she dislikes you? To be fair I’m sure her mother had some influence but from what you’ve given us here it doesn’t seem you have been father of the century either. As to your now fiancé, we’ll the troubled girl doesn’t like her, no shock there. Even if she is as perfect as you paint & possibly has her mom in her ear over it, she still represents a new life that your daughter has frustrated emotions over. It’s not right what she’s done, but can you call a 16yo an AH when that’s been her parental influence?", "YTA. \n\nYou could have easily compelled a paternity test in the courts, but you decided it was cheaper and more convenient to abandon your kid. You are a deadbeat dad until proven otherwise.", "> My ex went back and got pretty much full custody because I refused to pay child support without a DNA test. This has been the arrangement for 5 years.\n\n> Saying how she had a deadbeat dad (not true as I paid for her and her mom for 7 years. And still give her money whenever I see her.).\n\nYou're being a deadbeat here, YTA. You acknowledge that you *should* be paying child support because of your history of paying it and because you still give her money when you see her, but are using her as a pawn because it's convenient for your finances if you no longer have to pay. Regardless of the results of the DNA test, you acted as her father for all of her life and then stopped supporting her because it was more convenient.", "YTAH \n\nSorry but \"daughter\" in quotes got me. \n\nDid you ever get the test done or was it just way easier to assume she wasn't yours? I'm sure that it somehow justified you not to pay child support, or even having regular contact, at least in your mind right? \n\nJesus. Are you seriously wondering how she got this way? Your daughter was raised thinking that she was your daughter only to be shut out and neglected. Bad parents raise bad people and both you and your ex are to blame for the way she acts towards you now. You can't just wash your hands of her and then get surprised-Pikachu-face when she calls you out.", "YTA of course. The right thing to do would be to have the DNA test. You’re making an assumption and keeping that assumption to yourself, yet you expect Bella to somehow understand ? How can she understand if you haven’t given her the information. YTA", "YTA - you abandoned you daughter who had known you as her father for 7 years (and you have no proof as of right now you’re not her father) and you’re confused why she bashes your wife?? BECAUSE YOU ABANDONED HER", "It seems like you checked out of the role as her dad as soon as your ex denied a DNA test. You have basically abandoned her and she’s hurt and expressing her feelings in the way she knows how. Social media blasting. \n\nIf you hardly see her and you haven’t paid child support in 5 years, that does make you a deadbeat dad.\n\nYTA", "YTA. You are the father and the adult in this situation. She is a 16 year old girl probably suffering from parent alienation among other issues. \n\nHer behavior may have earned a disinvite to your wedding but there is so much under the surface here and you say even counseling is exhausted?  I don't believe that.  There are years of damage here and that will take a very long time to heal.  \n\nWhether or not she's your blood relation, you are still the only father she's ever known.  Does a relationship with her matter to you? I can tell you that her lashing out is proof that you matter to her.", "YTA. You put daughter in quotes. You are absolutely a deadbeat.", "YTA\n\nIt seems like you are trying to destroy whatever relationship you have left. She apologized for what she said. Kids don't make the best choices, and this is nothing new. Although, if my child was calling me a deadbeat, I would do some investigating and self reflection to figure out why.\n\nCalling her your \"daughter\" just solidifies how much of an AH you are. She isn't some toy that you can sometimes care for and sometimes not. Either she's your *daughter* or stop wasting her time.\n\nEdit: After reading all your replies, you *are* a deadbeat dad. Congrats.", "YTA - you’ve seen her for years, and still never done a test?\n\nAt this point, you’ve failed your child in many ways and somehow place the blame on her for the actions of the adults around her coloring her worldview. \n\nYou’re not a good ‘father’ and you do not get a gold star for caring for her as a parent should for less than 50% of her life.\n\nYou are a deadbeat. She’s not lying.\n\nYou cannot throw children away with relationships. And placing the blame on the child here is the problem.", "YTA\n\nYou are a deadbeat dad. You choose not to pay your share of child support and dipped out when your ex \"wouldn't\" do a DNA test. And that quite frankly is BS because you could have petitioned the court for the DNA test. \n\n\nYou decided not to be a dad as soon as you filed for divorce. Your daughter has every right to her feelings. Here you are on Reddit proving your wish to not be a dad by choosing to not invite your daughter to your wedding. You don't want her there and are making excuses for it", "YTA: Just the fact that you put \"daughter\" in quotation marks proves the deadbeat dad title\n\nEven IF (and that's a big IF) she is not yours biologically, you raised her for 7years. You were the only father she had known. \n\nThat's like an adoptive parent raising a child for 7 years and then going - eh, actually you're not blood-related to me and I want to check out, so goodbye. \n\nYou took on the role of dad regardless of if you were her bio father, and you fucked up that kid because you A) couldn't be bothered to compel the court for a DNA test and B) it was easier to do so.", "OP YTA\n\nYou COULD have gone to court for a dna check if YOU REALLY WANTED ONE.\n\nWhat you really wanted was an excuse to bail, and you used this.\n\nYou're a deadbeat dad. A bad father. Clearly this child knows that you rejected her.  Don't blame her for being hurt for all the years of this sort of treatment.", "How can you just stop paying child support? Do u live in the states. If you wanted a DNA test you could have gotten one when had your daughter on your 50/50.  Anyway my Judgment YTA.", "Man... She's only 16, she might have been disrespectful but obviously she's very traumatic. Her mother is a trauma on her on its own... But you're basicly out of the picture man, your obivously not seeing her as you real daughter, she has right to be mad at you. And since she's with her mother all the time she's filled with her mother's toughts, it's very normal for her to believe her mother at age 16.\n\nYou're not making a good job as a father. If dna is really important you should've ask for it in the court. You and her mother both gave her huge traumas. I feel sorry for the kid. YTA 'cause she even said she was sorry and she would behave.", "YTA\n\nyou dont even know if she's your \"real\" daughter or not. You decided to abandon her, because it suited you and the test costed you money. In that regard her post wasn't really untrue", "YTA (given answer to INFO question).\n\nYou could have gotten a real answer by having the courts order a DNA test, but you decided that not spending the couple hundred dollars on that because you \"have an answer\" (no, you don't) was more important than actually knowing whether your kid was your kid. Also I suspect you really do know she's your kid, and you understand that once the DNA test demonstrated that, you wouldn't have a leg to stand on because you'd be exposed as an obvious deadbeat. \n\nYou rejected her. You believe she's not your daughter because your ex refused a DNA test and you didn't even do the basics to get a real answer. Exactly WHY should Bella have any positive reaction to you or not slam you on social media? Why should Bella have any positive attitude about Chrissy?", "Its though... you re not TA for wanting a stress drama free wedding, and i feel like she would for sure make a scene if she doesnt like your fiance... but shes a kid that mostly knows only what her mom tells her, and might be \"brainwashed\" by her mom...\n\nEdit: Nvm you clearly dont care if she is or isnt your daughter even, you didnt care enough to get a DNA test to be 100% sure cuz it was a \"cheaper\" than going to court! You lived with this girl 11 years and then just abandoned her... YTA.", "YTA,\n\nYou should have talked to her before you made this decision.  Communication is everything, easier said than done, but difficult conversations need to happen, especially with your children. She is young still and needs to be called out and have consequences, but not having her relationship effectively destroyed by her Dad. This will be the end of your relationship for a very long time, if not forever.\n\nYou should have talked to her and drawn some boundaries and said the consequences are being uninvited from the wedding.  Not how you did it. If you can, try and fix it.", "Yta\nYou refused to pay for child support after suspecting from a rumour that you weren't your daughter's bio dad. Yet you claim you're still present in her life when you only see her occasionally and just gives her some money when you see her. To me, that's not being a present dad. So I wouldn't say she lied about that.\nThe way your daughter acted was not great either. She shouldn't have insulted your new gf. \nYou're not obligated to invite her at your wedding. But I think yta here for rejecting the whole blame on your daughter for the bad relationship you have. You didn't seem to want to have a huge place in her life for five years, and it seems easy to reject the blame on her now.", "She is 16, and of course, she is ragging on you on social media. The interesting twist here is that you deserve all the vitriol. You gave up on your daughter, and just the fact that you put that in quotes on the title makes you TA. You are punishing her for what your ex did. \n\nDNA doesn't determine whether you love and care for a child. If you didn't fight for custody, no wonder Bella is angry and hurt. And yes, if you aren't paying to help support Bella now, that makes you a deadbeat dad. I get why you wouldn't want to give the money to the ex, but you can set up a monthly stipend to Bella. \n\nEither you're a father or you're not. You are currently leaning heavily to the latter, so you don't get to be the aggrieved party here. YTA.", "YTA.  Kids don't care about DNA or money,  they care about who is in their lives and want to be there.   You've made your post very clear that you do the bare minimum because you seem to think that you have to.  Either be a real dad to this kid or walk away and be done and let her find a real family.", "I’m going no judgment here because this sounds like a very one-sided presentation of the facts and imagine my thoughts would change if I heard Bella’s side. \n\nIt’s understandable that you don’t want someone who publicly trashed your fiancée and your relationship. That being said, this will tank whatever relationship you have with Bella. If you want to continue seeing her ever or want to have a relationship with her as an adult, this is probably ensured that that will never happen. If you’re okay with that, then you made the right choice. If you expect her to continue seeing you a few times a month or ever get over this, that’s probably not going to happen.", "YTA, you and your ex have put this child through the ringer and two court proceedings because of your disagreements. And then it surprises you that she sides with the parent that provides a home and living for her. If you want a good relationship with her you need to make different choices, but from the post it does not sound like you care much.", "YTA you are a deadbeat dad, you refuse to pay child support over a DNA test and barely see her. You could’ve been the bigger person and just been the father to her, the only father she’s ever known but instead you decided to make a big stink about a DNA test, stop paying child support, and then saw her less. You did abandon her, just the fact that you put daughter in quotations in your title shows you’re a jerk that doesn’t see how shitty it is to abandon a girl who’s only ever known you as a father", "YTA, not about the wedding. Just in general.", "ESH for so many reasons.   Withholding child support  for one.\n\nYeaH, You should be able to get a DNA test, and your daughter hasn't given your fiancee a chance, but it sounds like you  aren't  much of a father. \n\nKiddsoften hate the new spouse, and they SHOULD give them a shot, but you need to deal with it.\n\nYou and your ex sound like bitter, vindictive people.", "Of course yta", "So you don't know if Bella is your daughter or not, but you were her dad since she was born and you abandoned her. She's just a kid who is acting out to get your attention. Why doesn't she like your future wife? Because she does get the attention your daughter is craving so much.\n\nAnd now you don't invite her to your wedding.\n\nA whole new level of abandoning your daughter..\n\nAnd if the DNA test was so important, why couldn't you have taken it yourself? You saw your daughter regularly since you left her mum.\n\nYTA a really big one.", "Whether she is biologically yours or not, you were raising her as your daughter. Many places would hold you responsible for child support regardless of the outcome of a paternity test. Quit holding her mother's behavior against your daughter. She only knows you as her father, and from her perspective you have abandoned her. YTA.", "Wow. YTA. You failed your daughter. Therapy and talking doesn’t work because you decided she wasn’t your child. You chose to not have her in your life, and now you’re acting like she’s insane for being upset about it. You are a deadbeat dad. Kids don’t give a shit about money, they care if you show up. \n\nYou decided on your own that was no longer your daughter, you can’t be surprised when she reacts accordingly. Honestly if that’s how little you value your daughter, I don’t blame your ex for partying and drinking so much.", "YTA\n\n\nYou got out \"cheap\" no child support so of course you didn't need a DNA test that could have cemented your financial responsibility for Bella. \n\nWhat it meant for Bella that her Dad was gone, that was just a nuisance to you.\n\nA nuisance that now bites your ass as she isn't shy to call you out on it.", "YTA.  You had 50/50 custody.   You could have had Bella do a cheek swab at literally anytime you had her.  Its clearly not about the test,  its about you being a deadbeat.", "YTA- despite your comments saying you care for Bella and want her to grow up and succeed you have for sure done everything in your power essentially to make it that much harder for her to do so but go off and beat the deadbeat dad drums where the crazy ex is the perfect reason for you abandon your kids you never truly cared for", "YTA\n\npurely because it really, really seems like that seed of doubt in ur mind regarding her paternity is what's led you to be so detached to her, allll these years \n\nas far as i'm aware, during the time you had 50/50 custody you would've been able to do a DNA test without her mother's permission. please correct me if i'm wrong but, assuming this is true, it means you failed to put your own fears at ease \n\nas soon as you lost custody you also lost the right to do that test. i mean this doesn't seem all that real b/c it doesn't make sense that someone wouldn't do the test themselves, if they really cared. \n\nbe honest. did you never get the test while you had the chance because you wanted an easy out? it's not unheard of, you guys had her fairly young. otherwise IDK why you didn't fight at all. there isn't rlly an excuse\n\nof course what she said wasn't acceptable. but calling her your \"daughter\", with the quotes, really?\n\ni don't doubt that her mother has perhaps put things in her head about you.\n\nbut the one thing that she DIDN'T have to tell her is that you gave up on your daughter. that is plain for anyone to see... if she truly wasn't your daughter then you could've found that out, but as of now you are half-in half-out, and you can't do that to a kid.", "One of you is a child and the other is an adult.  Act like it.  She’s lashing out on social media because you’ve hurt her.  Sounds like you’ve already chosen the relationship you want with her going forward. Man Chrissy sure picked a winner.", "YTA\n\nIt isn't that hard to just get a DNA test, just do it already", "YTA", "Oof. YTA. Your post reeks of toxic sludge, so you excluding Bella from your life might actually be good for her.", "YTA for letting the fight with your wife spill over and affect your relationship with your daughter. You never got a test done so you abandoned a girl who viewed you as her father ***regardless of what happened.***", "YTA. \n\nBella is your daughter. You have no evidence as to otherwise and refusing to pay child support in absence of evidence makes you a deadbeat. \n\nWhat you pulled on her when she was 11, punishing her by withholding child support from her, told her that you did not care about her as a person and you were the one to begin destroying your relationship then. \n\n> not true as I paid for her and her mom for 7 years. And still give her money whenever I see her\n\nINFO: What about the 5 years since then? Have you been paying the agreed upon child support for Bella since then? If no, then you are a deadbeat. \n\nYou have no one to blame for Bella hating you or Chrissy but yourself.", "YTA.\n\nOK first of all 0P I have to say this, I feel really bad for your daughter, for one she’s losing both her parents, she’s losing her mom because she just sounds like she’s flying off the handlebars and turning more and more to alcohol, next, she’s losing you, because you’re set on destroying your relationship with her, I don’t know if you’ve noticed, but being a good parent means being there for your child when one parent is losing their marbles, be prepared for your daughter to hate you when she turns 18, OP you get 3.5/5 asshole points, I would say, try to start and repair a relationship with your daughter, but I think it’s already too late, your ex wife gets 4/5 asshole points for being a straight up, drunk and choosing alcohol over her daughter,", "SUCH an AH. You know you don't need to rely on your ex for a DNA test, right? Did you petition the court? No, of course not. Because you don't want to pay for your daughter. You'd rather do this whole \"I'm not sure I'm the father thing\" to avoid paying child support. How are you not in jail for not paying child support, BTW? \n\nYou and possibly your ex are treating Bella like crap. YTA, a thousand times over.", "YTA for not forcing the issue and getting a court ordered DNA test on your daughter. YTA for not paying child support. YTA for abandoning any responsibility and thinking the money you give her a few times a month make up for your lousy parenting. YTA for not resolving these issues and selfishly marrying someone who your daughter hates. YTA for being a lousy father. And yes YTA for not including your daughter in your wedding plans.", "NAH. Maybe this will be unpopular but while I understand what your daughter has said has hurt you (and of course you should only invite who you want to your wedding) this girl has also felt immense hurt. Shes young, her mother is hardly a role model, and you pulled away after suspicions over her parentage. None of that is her fault. If she wants to speak badly of you and your wife, so be it, she has to live with those consequences. But try to understand how tumultuous her life must be.", "I guess I’m not understanding why the paternity test wasn’t done during the divorce and custody settlements? It fairly easy to get that established as a requirement of custody and child support proceedings. Choosing not to pay when ordered than losing custody over it seems like the worst way to go about this, you could have just gotten a paternity order, ex would have been legally required to comply, and changed the course of all of this. \n\nSince what’s done is done, NAH I guess as I get not inviting her if she truly just does not care for either of you and might make a scene, but she’s not an asshole for her feelings around how all of this went down and the distance she feels from you that could have been prevented long ago. It’s just sad, this could have all been different with a few extra minutes on paperwork, that does make you a huge AH overall.", "NTA but this is a losing situation, 1st because of your paternity and 2nd because your ex-wife has full control of your daughter.  \n\nSide questions: Why didn't you sue your ex-wife for a paternity test and possibly force a withdrawal of your paternity. Not paying child support just made you look like a bad dad and highly incompetent to the courts.", "NAH. In her eyes, her father is a deadbeat as your not around. However, given the circumstances and her likely not being your child, I get it. Either way, Bella needs some therapy or at least a conclusion on paternity. That would help you both move on.", "Yta.  Bella saw you as her dad", "If your ex would rather no longer accept child support the rest of the child's life than have a DNA test, then she's not your daughter.  Your ex calls you a weak loser when she's drunk because she chumped you out and you were taking care of another man's child.\n\nI agree, given Bella and her mother's history of behavior, that having either of them at your wedding is simply too risky.  NTA.", "NTA She played stupid games and won stupid prizes. I mean, honestly, she's old enough to think things through, what did she expect to happen?", "NTA. Relationships work both ways. The one thing I’ll say though is that Bella is most likely being fed lies by your ex and probably given a distorted view of things.", "NTA.\n\nGet that paternity test if possible now. Although if Bella turns out to be your kid, I am not sure how you are going to explain your years of doubt about her parentage.", "NTA for minimising the stress on your wedding day, but this will be unrecoverable. On top of all the unrecoverable that's gone before. Between you and your ex Bella's been a pawn, and that she'll always remember.", "Technically NTA. Weddings are for people who want to celebrate the happy couple and it sounds like your daughter doesn't.\n\nThat said, this will likely be the nail in the coffin of any relationship between the two. \n\nI do have a lot of sympathy for the girl whose dad basically walked out after over a decade because he wasn't certain she was his. Her biology is out of her control and it's shitty to punish her for something her mother may have done. Especially given that it sounds as though your ex may have struggled with addiction prior to the divorce which your daughter likely had to bear the brunt of.\n\nIt's also pretty common for kids to struggle to accept step-parents. I'm not at all condoning Bella's behaviour especially given that you mentioned therapy but I'm not sure how much grace you actually gave her in coming to terms with everything. \n\nSo I'd suspect you were probably a shittier dad than you realize or are willing to admit and this is the inevitable outcome.", "NTA. Hurt people, hurt people, and I'd wager that your daughter is hurting from how your ex is. She probably also knows about how you might not be her father and that could be stressing her out no matter if she's happy you might not be or if she's dreading that. However, since you say that therapy and talking it out has failed thus far, the most you can do now is choose to leave the door open for the future. You cannot be expected to just let people, even if they're your child, treat you badly just because of her relation to you. She may come around at some point or she may just be who she is, but for your wedding, you don't need to risk anything on the hope that she's coming around now.", "NTA\n\nRegardless of who she is, you don't need someone at your wedding who isn't on team OP and Chrissy.", "NTA - however (as I read in another reply) it really sounds like Bella has had a sht ride so far .. pls don’t burn that bridge?", "NTA \\~  I can understand this behaviour/mental issue of Bella and her mother Theresa will have a domino effect on you and your partner, and the people who will be at the wedding.   \nMake a choice, get the DNA test, cause you already lost ''your'' daughter, but this decision will certainly destroy whatever is left.", "No. You manned up and put your foot down. Toxic is always toxic and unfortunately it seeps to future generations. But. Whether she's biologically yours or not you've been there since birth and raised her as your own. Keep being her father. The daddy she needs. Be the leading male role model in her life. Don't let her mothers toxic life have influence over her. Just my opinion, to each his own..", "NTA, your x is a walking train wreck.", "NTA\n\nthis girl needs to know that every action has a consequence.", "NTA, your wedding your choice and if you don't want someone who's going to cause trouble, you don't have to invite them, whoever they might be.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (37M) am getting married this fall and have made the choice to not invite my daughter Bella (16F) due circumstances I will explain in this post. Before people tell me that we should sit down and talk. Or do therapy. Those options have been exhausted and are no longer viable. \n\nMe and my ex wife Theresa (38F) do not have a good relationship. We started dating at 16 and then had Bella at 21. At first everything was awesome. But then my wife started hanging out with a group of women. Just not very good people. I refused to hangout with them. My wife started drinking heavily with this group and going out at night leaving me with our daughter. I didn’t like how she was keeping up our home either as I worked full time and she didn’t. The final straw was when I was forced to come along bar hopping. Theresa got embarrassingly drunk. Then started calling me a loser in front of everyone. This was not the first time she had publicly disrespected me. She had a habit of trying to show off to her friend by belittling me. I filed for divorce the next weekend. \n\nThe original custody agreement was 50/50. Which then changed because I asked for a DNA test on Bella. I had heard rumors and wanted to confirm. My ex blew up and refused to allow a DNA test to be done. Solidifying what I expected. My ex went back and got pretty much full custody because I refused to pay child support without a DNA test. This has been the arrangement for 5 years. I see Bella a few times a month. \n\nI do what I can but I don’t have custody so it’s difficult. I am engaged to one of my best friends Chrissy (33F). We’ve known each other since college. Bella hates her for no reason. Chrissy wasn’t even involved in my life once i got married. Bella for some reason thinks she is terrible. Chrissy has been nothing but nice to Bella. Recently someone showed me Bella’s social media where she blasted us. Saying how she had a deadbeat dad (not true as I paid for her and her mom for 7 years. And still give her money whenever I see her.). And called chrissy a slut in the same post. \n\nI was planning my invites for our wedding and I did not invite Bella. She doesn’t care for us. She called Chrissy a slut. And shamed me on social media lying for attention. I also don’t want drama at my wedding. It should be a fun time. Not another event for Bella to hijack. My ex wife found out about the wedding and asked what Bella’s role would be. I told her she didn’t have one because she isn’t invited. I called Bella and gave her my reasoning. As well as telling her that her post on social media played a factor so she should be more careful what lies she wants to put out there. She tried to apologize and say she would behave at the wedding. I told her that I knew she didn’t like Chrissy, or me that much. So why would she expect an invite. She called me an AH and we haven’t spoken since. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH. You do for not inviting your daughter to your wedding, your daughter for lying and airing her dirty laundry on social media, and the mum for just 'assuming' your daughter can say whatever she wants to.", "Info- what would you do in the event that a paternity test proved Bella is indeed your daughter and not your “daughter”.", "INFO: Is there a reason you couldn't have just done the DNA test yourself? If the test had come back positive, no one would have to know and you would've had 50% custody. If it had come back negative then you would be in the same boat as you are now, except you would have a convincing reason to give Bella for being a \"deadbeat dad.\" \n\nI guess I am just wondering why you seem to care but also not care for Bella - you refused to support her without a DNA test but you have her every month, you plan to marry Chrissy regardless of what Bella thinks of her but you also want Bella to like her. What do you really want your relationship with Bella to look like?", "YTA\n\nWhat really gets me here is that you dont even know that she isnt yours. Her mom didnt want a DNA test, you didnt even bother to push for one, desided she wasnt yours, and just walked out of her life after 11 years. For all intent and purposes, you are punishing a teenager, that might actually be your biological child for all you know, because of what her mom did. You're holding a then child and now teen to a higher moral standard than yourself, and feel justified doing so, because her mom hurt you. That is AH behaviour.", "NTA for not wanting a liar who hates you and your wife to be at your wedding.\n\nYTA for assuming the kid isn't yours without proof. You raised her, she was yours, but it appears you lost her some time ago. You're a Super AH for putting daughter in quotes.", "YTA.\n\nYou gave up on your daughter because it was exhausting and uncomfortable and your feelings were hurt that your were called a loser. She was a child when you made assumptions, and she's still a child now when you're putting your own comfort over doing the right thing. \n\nTry acting like an adult, like the father you claimed to be in the comments. The mental gymnastics you're going to to reconcile the cognitive dissonance within you must be exhausting. Grow up.", "ESH\n\nYour ex wife sounds awful, you shouldn't have to put up with being belittled by your own spouse for clout amongst her cronies. Divorce seems like it was the right move there. \n\nI will say though, 11 years is a long while to wait for a DNA test. I also kinda feel like throwing away a relationship with your \"daughter\" based on a strong suspicion is kinda shitty. If you are willing to challenge that, go all the way with it, you could probably get it ordered by the court. A lot of people would say that it doesn't matter, you're the one that raised her, does it matter who her bio father is? IMO yeah it does kinda matter, and I think that's something any individual in this situation has to decide for themselves, there's no wrong answer. It sucks for the kid for sure when you choose to break that relationship, but that's not your problem. However, if you're going to to blow this whole thing up, be sure and get a DNA test. \n\nGiven the question in a vacuum, yeah I'd say N T A for not wanting someone at your wedding that doesn't support your marriage and whom you've decided to break ties with. But you're not blameless, and it sounds like she still considers you her dad, so you have clearly left a mess in your wake.", "Not for the wedding per se. But you have a weird arrangement. You should have absolutely done the DNA test!.. her not wanting to have it done is absolutely no proof. As any faithful woman could react that way too.\nyou don't believe she is your bio daughter, stopped paying for her support but still you see her few times a month? So how that makes a good relationship? Either you consider yourself a father and you should have taken on the responsibility for it,.or not... You are a half baked dad.\nNot to mention, her mother has alcohol issues! And you left that girl in her full custody last 5 years, instead of offering at least 50% stability to her life. What if you or her in the future do a DNA test and she is your bio daughter after all?!... will you be happy with yourself? Do you think sorry I didn't think you are, will be enough? I can tell you it will never be enough and you are acting very immaturely. Actually for you those money you saved on child support is probably more important.", "YTA", "YTA. Show me where Bella is wrong to call you a deadbeat; you barely see her and don't care about her or like her enough to invite her to your wedding. Your bad blood with your ex and lack of dna test is not her issue, but you've made her feel it nonetheless.\n\nBella is a 16 year old who lashed out on facebook and instead of, you know, parenting or acting like you care about her, you & Chrissy are like 'yay now we have an excuse not to invite her'.", "NTA...and why didn't you just do the test when she was at your house.", "YTA\n\nYou completely ruined the relationship you had with your daughter (bio or not)  by cutting her off after her mother refused the DNA test. You made it 100% clear that you didn't think she was yours (despite not having proof either way) by refusing to pay child support and not fighting for custody. I am sure your ex has a lot to do with the situation, but it really doesn't seem like you care.\n\nSo are you the asshole overall. YES. Are you the asshole for not inviting your daughter because you are butt hurt over a social media post calling you out for your shitty behavior. No. You don't deserve her at your wedding. You don't deserve any kind of relationship with her.", "God damn YTA. Frankly they are better off without you.", "YTA and a huge one at that.\nYou're a deadbeat dad, giving her money every time you see her, which as you said is only a few times every now and then, doesn't mean you're an involved dad by far. You don't care for or about her at all. The way you're talking about her in this post just shows you don't consider her your daughter which breaks my heart for her.", "Yta for deciding to give up your child over not getting a dna test and then not paying child support until court ordered and then coming onto this sub to whine about it. You clearly don't care.", "YTA for not inviting your \"daughter\" to your wedding. \n\nThe fact you have quotation marks for the word daughter and then trying to say that her calling you a deadbeat is a lie is absolutely laughable.\n\nJust accept it, you are a deadbeat, and you are an AH.", "I don't think I can judge this w/o a DNA test happening.  Maybe a good lawyer could help you secure one?", "YTA.\n\nSo, you married a party girl and had a kid with her.  You don't mention anything about how you raised the kid - all you do is complain about your ex.  You found a way to stop paying for child support when the kid was 11 and went from 50% visitation to \"a few times a month\" but that could be anything from an hour or so to full weekends (I'm guessing the former) because there's a chance she isn't blood related to you.  Your current dilemma doesn't matter.  You're an asshole.  I feel so sorry for that Bella.  Why are you surprised that she doesn't like your fiancee?  She has every reason to believe you're going to have kids with Chrissy and then Bella will go from mostly abandoned to totally discarded.", "YTA\n\nThere are more holes in this than edam.\n\n\\- If you're her parent, her guardian and had 50% custody then why didn't you just get a DNA test?\n\n\\- She was 11 years old and you'd been her dad for 11 years when you decided you wanted a DNA test. If her DNA changes how much you love her at that point, you don't deserve her.\n\n\\- Courts don't award full custody to one parent because the other asked for a DNA test.\n\n\\- Paying for your child for 1/3 of their childhood doesn't mean you can't be a deadbeat.\n\n\\- You dismissed any feelings she had about Chrissy as \"no reason\" (whether she's justified or not, you're mad dismissive).\n\n\\- Your child should come before Chrissy.", "YTA - both you and your ex!\n\nThis post absolutely broke my heart - and in the middle of this mess is a child, now teen.\nI guarantee you Bella was quite aware of all the drama and fights. Besides that, she got given different versions from different people and somewhat tried to make sense of all of that.\n\nYou and your ex abandoned her. I am pretty sure there are ways to get a paternity test done even if your ex refuses, but she literally isn't of any fault if she happens to be an affair child. She didn't make either choice.\n\nShe grew up knowing you as dad. You abandoned her based on a rumour. She is not being an asshole or a brat, she adapted that behaviour from her parents. \n\nBe prepared to lose your daughter forever for your attitude.", "YTA. YTA for so many reasons and this is just the latest. Stop being a little boy and get the test instead of assuming you know. Because without the test you are a deadbeat awful dad who keeps hurting this kid. Be a man and step up. Talk about telling lies on social media. YTA.", "YTA. You *are* a deadbeat dad as far as your daughter can tell. You are the only father she knows, and you rejected & dumped her over something she has no control over.", "ESH in my opinion.", "YTA\n\nHow do you not know that teenagers are famous for outbursts and pushing adults away and being all over the map emotionally? It's your job to not react to that to an extreme.", "Question? How does your fiance feel with the way you view your 'Daughter'? Is she ok with your stance? I would think twice abt the wedding if NY fiance acted this way to someone he raised from birth for 7yrs and refuses to spend $ to confirm anything. What if in the future your fiance acts the same by not giving a direct answer with any situation. Will you mistreat her the same way??\n\nYTA, especially for the 'Daughter' part.", "YTA. You abandoned your daughter. You are a deadbeat dad. Paying child support is nothing. You weren't there to tuck her in at night, take care of her when she's sick, help her with homework.\n\nWhat you did is awful.", "ESH.\nShe is not your genetic daughter and never will be. But that's not her fault and you raised her for a decade and then just took the easiest way out of custody and paying child support. It's like you're happy your highschool sweetheart cheated so you don't have to bother anymore. I really wonder why your ex started going out and drinking and why she hated your now wife you met in college while ypu were already dating and then \"didn't have contact with\" when you got married. Sounds kind of fishy tbh.\nThat said, sure, it's your wedding and you don't have to invide oeoole that disrespect you or your partner no matter if and how they are related to you.", "YTA: your daughter is correct. You are by definition a deadbeat dad.", "Not sure where your from but where I live if you sign the birth certificate paternity has been established.  You can't just say I will not pay child support without a DNA test.  You would be required to pat until test have been done and even if she's not your you could still be required to pay because you signed the birth certificate.  Now my cousin at 18 sued my uncle for child support he never paid and she got it.", "Because her denying one was all I really needed to hear. It was cheaper than paying for one. And she wasn’t chasing child support so I wasn’t gonna go chasing a test which I already got a de facto answer to.", "We split when Bella was 7. It was 50/50 custody at first. Months into that arrangement is when I asked for the DNA test to be done. And entered into the court. My ex fought this over the course of a few months and I eventually dropped it once she said she didn’t want child support. If that meant she got more custody. I didn’t dump Bella. The courts did.", "That occurred to me as well. Why not just test her yourself? It makes no sense.", "This.  OP YTA", ">Because her denying one was all I really needed to hear. It was cheaper than paying for one. And she wasn’t chasing child support so I wasn’t gonna go chasing a test which I already got a de facto answer to.\n\nLook what they answered, they made up their mind and didn't care about the kid anymore...", ">you only consider her your daughter and want 50/50 custody if she’s genetically yours,\n\nand this is absolutely normal", "I mean, do most people consider thier ex's kid with someone else they were cheating on you with to be \"thiers\"? Some people keep in touch with their step kids after a divorce, but plenty don't. I don't think that is a wierd hill to die on", "The courts actually make it cheaper… I was called a loser by my ex. I know what that meant. I’m not paying out of the ass for a kid who isn’t mine. She didn’t chase child support for a reason….", "Sounds more like the mom is crazy as fuck and has made up a massive amount of lies about the father and won't even do a DNA test. He never abandoned her in anyway.", "I mean there's parental alienation, and then there's behavior that alienates your own kid from you, all by yourself.", "I don't think we can fault Bella for not being warm to this fiance. If the fiance is anything like this \"father\" she probably is trash. \n\nThis is a 16 y/o kid. She doesn't have to be mature in this situation. But she's never going to learn maturity from this yahoo of a dad.", "He answered below that it was ‘cheaper and easier’ not to get one so he didn’t have to pay child support, because he decided his ex refusing to get one was ‘all the answer he needed’. Vile.", "He is a bad dad thou", "if he fr cared about her he would've def. got the test himself. parents will sometimes fight for 100% custody & refuse child support out of pride, just to hurt the other parent, even if the kids are biologically from both.\n\nif he genuinely wanted to be out of bellas life if she wasn't his, he shouldn't have been half-in, half-out. u are either someone's father or ur not.. very confusing & damaging for a child", "Like OP was when he tried to deny Bella was his daughter more than ten years after she was born and refused to pay child support without a paternity test?", "She might have expected a father that cares about her", "I don’t think his ex needs to distort his blatant actions he enumerated in his post and comments. Chose not to go ahead with a DNA test since it was cheaper not to do it and lost custody because of it. There is no excuse for that one!", "I don't think he can possibly be considered NTA when he cut his kid off for years because it was convenient instead of getting an answer or *gasp* treating the kid he raised for so long like his daughter regardless.", "Have you considered that the daughter might be hurting from how the OP is? Y'know, given he totally gave up custody of her because of decisions she had no involvement in, and how he doesn't even consider her his daughter anymore?", "He wasn't on her team. He chose to give up custody over all of this nonsense.", "💯💯💯👏🏼👏🏼👏🏼", "Exactly what I tried explaining to her. I only want people on my team to be there. Not those who aren’t on team us.", "Yea she is. She is still going around telling people Chrissy and me were having an affair. Which is ridiculous as we didn’t even reconnect till years after we split. Woman is deranged.", "Why? OP hasn't learned that yet.", "Thank you for responding to the actual question being presented lol.", "Gross. Can't you see how awful that is to Bella, the girl you raised for 10 years? You were happier to drop her like a sack of potatoes than you were to actually sort this out or set aside the issue of biological paternity. When she describes you as a deadbeat, that seems about right.", "Wow, you really are a deadbeat.", "What if the alternative is that she was so offended that you asked/insinuated she lied to you for a decade that, especially after you had already broken up, she didn’t think the request even deserved consideration? That’s probably how I would feel if I’d been with someone that long and they asked me for a DNA test. If I could reasonably afford a child I’d say “fuck your accusation” and let you stop paying child support. \n\nAlso, if you’re convinced Bella isn’t yours why have you been seeing her multiple times a month for the last 5 years as her dad?", "Or she didn't cheat and was upset you'd say that? Congrats on finding yourself an easy out I suppose. Poor Bella.", "Do you realise that you and your wife are weaponizing your (now) teenaged daughter in a fight between the both of you?", "And this is why Bella says she has a deadbeat dad.", "I can't imagine how painful this situation is for Bella. You've declared her not your daughter, but you're still in her life a few times a month preventing her from healing. You don't care about her enough to push for a court ordered DNA test or to pay child support, but you expect her to be respectful and kind about your new relationship. \n\nI don't think you're TA specifically for the wedding, but you're definitely TA for how you are treating an innocent child.", "I would still go through with doing the DNA test. You may think you know the answer, but if you're going to abandon this girl who may or may not be your biological daughter, you should be 100% sure why you're doing it. \n\nBecause if you ARE wrong and she IS your kid, then you absolutely ensured that you won't have any type of relationship with her. If you are treating Bella like you are because you don't believe she's your biological daughter, then you better be damn sure instead of thinking that you have all the answers because of rumours.", "Wow.\n\nNo wonder she hates you. You don't consider her worth the negligible fee you would have to pay.", "Or, she knows she didn’t cheat on you, knows you’re Bella’s father, doesn’t want money from you, and is letting you bury yourself with the choices you’re making. Which you’ve done. Congrats on saving that money though!", "You didn't do this to hurt your wife, you did this to hurt a child.  Feel better?  You hurt a child, dude.  A child you raised for 10 years.  You betrayed her trust and love for you as a father.  No wonder she doesn't like you.  How sad you can't see that.", "Lol, you're a deadbeat dad. You raised her for 11 years but now decided she's definitely not yours without actual proof? After raising her for 11 years is DNA really even relevant? YTA.", "~~She hasnt had a DNA test so she doesnt know 100% either, her refusing only shows that she was likely unfaithful!~~\n\nThere is still a chance Bella IS your daughter! You just dont care about her! Not even enough to be 100% sure... wow...\n\nEdit: Im dumb lol", "The more likely scenario is that she didn't want you to be the confirmed father so she could get out of having you in her life and get full custody lmao. And you were like, amazing, I hate this kid anyways, get out of jail free card for me.", "This is some of the worst \"logic\" I have ever heard.\n\nWhat kind of AH is willing to accept a \"de facto\" answer as to paternity?!? What if she is your biological daughter?!? Obviously there's at least a chance of that. How are you going to feel then?!? How will you live with yourself knowing how you've treated your daughter the past few years?!?\n\nI just don't understand how you would rather potentially save money on child support than know for certain if you have a child or not. That's just not something normal people are willing to have uncertainty about.", "Your awful. I couldn't imagine abandoning my daughter like that.", ">I eventually dropped it once she said she didn’t want child support\n\nNo... you did dump Bella, you rather give up your visiting rights over her child support, without even following through with the DNA test. You're a deadbeat \"dad\".", "But you, **the parent** didn’t fight to get the rest done!\n\n**INFO:** what if a test reveals her to be your child? Then what?\n\nWhy are you so comfortable not getting answers and possibly treating someone who is your flesh and blood this way? You have all of the ability and you’re choosing not to. That’s what makes you a deadbeat.", "This is such an objectively bad take that you have completely unmasked yourself as the asshole. \n\nYou raised this girl for 7 years together and then for some time after. You are her dad regardless of blood status. The only way you could say otherwise is if you don’t believe in adoption at all. YTA #1. \n\nYOU dropped the DNA test when the court could have compelled it. And you could ask your daughter to submit to a test now. But you didn’t because you’d rather not know than take any responsibility. YTA #2.\n\nYou gave up all visitation rights to avoid paying child support for the child you raised. You are the definition of a deadbeat dad. And despite your last sentence you’ve provided 0 evidence or indication that the court is at fault for this. YTA #3.\n\nRegardless, you still don’t know if she is your biological daughter or not and you abandoned her because her mother would not submit to the test. No matter how you slice it, that makes you an objectively bad person based on your own recounting of the story. YTA #4\n\nEnjoy not talking to your adult child, not that you seem to care.", "You dropped it.  The court did nothing but follow your lead.  You could have fought and continued child support. Then nothing would have changed   Grow up and take responsibility.", "YTA. You should have gotten, and still should get, the DNA test. \n\nIn one of your comments, you say:\n\n\"We split when Bella was 7. It was 50/50 custody at first. Months into that arrangement is when I asked for the DNA test to be done. And entered into the court. My ex fought this over the course of a few months and I eventually dropped it once she said she didn’t want child support. If that meant she got more custody. I didn’t dump Bella. The courts did.\"\n\nNo, you dumped her. In your own words, your ex dropped the issue in part to get more custody of Bella. Stop playing games and making assumptions. You are not as clever as you think you are. Get the DNA test already.", "Why do you even see your daughter?", "You asked for a DNA test because you wanted to see if you had to parent this child or not. After seven years, why can’t she just be your daughter? I understand needing to know her genetics, I understand the medical aspects of that, but that should be it. You’re punishing a child you raised for seven years for something she didn’t do. And you expect her to just treat you like a father? Why? You told her a long time ago she was not your daughter anymore.", "I can’t even fathom caring so little about a child you raised, poor Bella.", " \nIt sounds like you've already chosen the relationship you want to move forward with.", "He *raised her for 11 years*, then decided it was cheaper and easier to not get a court-mandated paternity test and not pay for her. He’s a deadbeat, whether she’s biologically his or not.", "If you've raised somebody for 11 years, regardless of the biological paternity it should probably be difficult to cut them off; parenthood isn't just about genetics. The fact OP was willing to cut his daughter out of his life because there's a *chance* she wasn't biologically his kid is absolutely not normal.", "Just because it's normal doesn't mean that it's not a cold way to go about things. He spent 10+ years raising this child and dropped her just like that? That's brutal.", "If you're so certain that she's not your kid, why do you even care about her bad mouthing you on social media, and why do you even consider inviting her to your wedding?\n\nFace it, you connected with this girl for seven years and then decided to yeet her. You served as a father figure and then threw an innocent kid in the trash to spite your ex.\n\nAnd you don't even know if she's not your kid. She certainly considers you her sperm donor. And she feels every inch of that abandonment.\n\nAnd you're here because you feel guilty for that.", "And I suspect it's not the reason you think it to be.\n\nMost moms I know who have given up child support in return for full custody didn't chase child support because they knew that they got the better end of the deal. They didn't have to co-parent with a crappy, hostile ex who likely would have come up with other reasons over the years to not pay child support.", "Even if your ex cheated there still would be a chance she's yours. You must have been sleeping with her at the time to have believed you were the father for 11 years. Even if your ex is acting like she's not sure, you're still a deadbeat for not following through and getting an answer. I'd say your behaviour is that of a loser.", "If she isn't yours and you don't want to pay to support her, have custody of her, nor invite her to your wedding why are you still in her life? I honestly think she'd be better off without your confusing and hurtful presence in her life \nIdk man I'm really confused by the whole situation. Would have been 100% easier and more rational to just get the test done and know for sure. You can't know for sure just based on your ex's reaction. It feels like you made up your mind and acted accordingly based on pretty much nothing.\nEven if she suspected the child not being yours and that's why she refused the test, if she was sexually active with you and another man at the time of conception she can't know for sure either.", "He literally said in the post he stopped paying child support and had her live with her mom full time (instead of 50/50 custody). How is that not abandoning his daughter?", "True. I think I covered that in a non-specific way with the blanket statement \"among other issues\".", "BUT refused to actually do the work to have that paternity test ordered.", "Why would the mother refuse to do the test if Bella is his daughter? If the mother tried to go for child support, she couldn' refuse the test. I wonder why, it's weird.", "I think that cloud of doubt over his daughter’s parentage is a very big issue which stuck on for a long time.", "Yes, but It sounds like that a lot of those things are not directed at her, only at his ex. Though I suppose she's heard it second hand even from his own lips. His description of the events did not have him relinquish rights, just lose them because he refused to pay child support. He also sees her \"a few times\" a month, which I admit can be hard on everyone, unless he's just not trying. \n\nAs is often the case, I can only go with OP's description of the events and I try to not analyze too deeply on the \"hows\" and \"whys\" of things, just the question at hand. I sometimes offer a little life advise to not have this be a dead end, and perhaps I analyzed a little more than I should have here with only half of the story about why his daughter is being mean. \n\nNow, as has happened before, if he comments more and I find out that he's actually told her she's not his and treated her as just his ex-wife's illegitimate kid, then yeah that deeper analysis becomes important and I'll change my vote. He doesn't get a free pass if he's been an AH consistently before and is just now playing victim.", "You haven't been on your daughters team for years.", "Why should she be on your team", "I think that makes perfect sense", "Why should anyone be on your team? You're a complete asshole and I'm certain your fiancee is the same. Your daughter is unfortunately better off without someone like you in her life.", "Not having an affair doesn’t stop you from being a deadbeat.\n\nYou’re a deadbeat because instead of doing the work to confirm with DNA, you took the word of a woman you said you don’t trust and just stopped caring for a child who could possibly be yours!\n\nJust do a test!\n\nBut instead, you stop caring for the kid and wonder why she has a low opinion of you. Your actions make a low opinion pretty much the only option.\n\nTake accountability and stop punishing this kid cause you’re mad at her mom.", "Why is it deranged for her to think that maybe you had an affair with someone who you met in college and reconnected with years later and just hid it from her? Especially when you say this person was your best friend and she already was concerned about your relationship. Even if it’s not true, that sounds like a really normal assumption to make as the ex.", "What’s wrong with wanting a DNA test, paying support anyway, and visiting with the child a few times a month?", "For that being the actual question you really tried hard to let everyone know how much you dislike your ex.\nIf you wanted to ask \"AITA for not inviting someone that insulted me online\" you could have just asked that. You are gezzing the answrrs for the question you *actually* asked :)", "Even if she did cheat, he and Chrissy were apparently still having sex around the time of conception or else he would've figured it out a lot sooner, so it's still possibly his bio kid.\n\nIn my experience, it's not the true motive though. I have two of these in my family, but their children are 100% their bio children (one of them is a spitting image of his father). One of them abandoned two of his sons by two different mothers, conveniently when he moved onto the next woman.\n\nI feel like I've read a similar post before though, because I remember being confused at why an angry teen would beg to be part of a wedding, where they don't like the bride or groom. Even if she was upset about being excluded, teens are typically good at pretending to be flippant about these things and it's not like most weddings are exciting.", "That simply is not happening. I’ve tried to disengage from the whole situation. I do not care about my ex wife in anyway anymore. I’d love it if she left me alone frankly.", "If she never cheated she does know 100%.", "But its not his child.  Sucks big time for the kid, but this is the mother's responsibility.", "I think he chose long ago which relationship he wanted to move forward with. He just expects that because in some vague way he sometimes considers Bella to be something to him (not even a daughter) she's going to keep crawling back for the emotional crumbs he sometimes offers to her.", "The foundation for their relationship was a lie, finding that out destroys the foundation, and a relationship cannot survive without a foundation. The only reason OP loved the child to begin with was because he though she was his, and she isn't. None of the 11 years means anything at all if that initial first minute was a lie.", "He didn't cut her off though did he?", "I think maybe she isn't chasing child support and all to just have full custody so sge won't have to share with a deadbeat toxic ex.\nI personally wouldn't. If he wants to believe she's not his then he won't claim custody so if she went along with his demands then he'd have rights if she was his biological daughter and then he'd probably try to get to his ex through her or something.", "Did you even read it? The mom got full custody because she wouldn't do a DNA test and he doesn't have to pay child support because of that. If anything sounds like the kid isn't even his. \n\nHis biggest mistake was not pushing for a DNA test.", "I unfortunately have seen a lot of cases were parents like this are screaming \"parental alienation\" not because the other parent is really doing anything to actively alienate the child, but because the other parent has stopped protecting the child from the other parent's crazy and neglect and stopped insisting that the child needs to forgive the other parent and excuse the crazy and neglect. That's not alienation, that's consequences.\n\nTeenagers are independent beings, with independent thoughts. Teens have the right to have their own opinions on what has been done to them and what is being done to them.", "Convenient, isn’t it?", "I suspect she refused to do the test without the court's order and then he refused to file the paperwork to have the courts order it. This is pretty standard legal advice--you don't do the test until the court orders the test, because then the test results are officially entered into the legal record.", "Because if you’ve been with someone since you were a teenager and were faithful to them, the accusation that you cheated years later purely based on rumor is offensive. And if she can reasonably afford a child on her own, she doesn’t need to go for child support.\n\nAlso, she might have just refused to do it based on the standard advice to not get one without a court order. Which OP could have done pretty easily if he wanted.", "He could file to have the DNA test ordered tomorrow--he could even likely file the paperwork without a lawyer. He doesn't actually want the results of the test.\n\nI mean, he could even file and have ordered that if Bella turns out not to be his daughter, his ex pay him back for the costs of the test! (This is also pretty standard legal verbiage.) So even his \"it costs too much\" excuse is bullshit. It should only cost him if Bella is his biological daughter.", "He could have had one court ordered, which is a standard legal advice, to get a final answer once and for all. He chose not to. His ex isn’t wrong for not paying for a paternity test without a court order, and it’s not an immediate sign that she’s lying about Bella’s father.", "That doesn't really change anything at all here. If he had doubts, he should have addressed them far earlier, and should have explicitly addressed them with a court ordered paternity test instead of going \"woo, free out!\"", "Maybe he hasn't told her that he doesn't view her as his daughter, and that he willingly relinquished custody on that basis. What she does know is that there was once 50/50 custody, and then, in the best possible version of events, just up and left her life for no apparent reason. She also called him a dead-beat, so she is presumably aware that the OP does not pay child support. And yeah, to be clear, if you abandon your kid because you're not paying child support, that counts as relinquishing your rights. That choice says far more that he doesn't feel she's really his child than any words would. Even just going by the OP's words, and assuming the least information available to the daughter, he is an asshole.", "He doesn’t pay child support and hasn’t for at least 5 years. Where are you getting the impression that he pays?", "He's not paying child support. The DNA test could have been petitioned by the court, going from the post it doesn't sound like OP even tried to petition for it. One could have been done from Walgreens if he wanted. He's doing the absolute bare minimum he can get away with as a parent", "What’s good about it", "Why have you continued to visit Bella over the last five years if you believe that she isn’t your daughter to the degree that you refuse to pay child support?", "The way you describe things she seems to be an asset in a fight that's not hers and she's being crushed by it. Be prepared that the moment she is able to escape the sitution for good she will.", "But this whole situation with Bella is because you started with asking for a DNA test for a child you had been raising for 10 years? One that you cared for and nurtured? The moment you hit adversity and you needed to pay for confirmation (which I’m fine with asking for if you had serious doubts), you chose the cheap way and alienate her all by yourself. \n\nYou are a bad parent. Parents fight for their kids and their well-being. You chose the most convenient route for you and your ex is pissed that you are willing to throw in the towel so easily. You are a deadbeat and your daughter doesn’t need any push from her mom to hate you. This is all on you and your actions. \n\nYour future wife might be the best person in the world, but you sir are rotten at the core. \n\nYTA, easiest verdict to give. Don’t have more kids, for their well-being.", "You have a child who as soon as you thought might not be yours basically checked out.  A kid who loved you like a father.  You don't see how this could hurt her?", "Me forget how wamen work.. mb... ops", "If you do the work of raising a child I can't fathom ever thinking of them as not mine. If by some weird cosmic accident my son wasn't \"mine,\" that would suck but that's my damn child! I did the sleepless nights, the tantrums, the holidays, first steps, first words. That kid is mine!", "That is a disgusting and incorrect mindset.", "What do you call relinquishing all custody and refusing to pay child support, exactly?\n\nHe says he gives her money when he sees her, but since he talks about how much he wants to protect his wallet it's almost certain that's a pittance to save his pride and pretend he's not a deadbeat.", "The mom got full custody because he effectively relinquished full custody over this paternity issue. Nothing was forcing him to give up his daughter. But he did, and all because of some presumed genetic discrepancy with a kid who he'd been raising for like a decade. It's awful.", "Yes, deciding you don’t have to support your daughter when she’s 11 years old isn’t AH behavior at all. /s \n\nThe daughter did nothing wrong and she’s the one who was abandoned by her father. He punished the wrong person and now he’s curious as to why his daughter is mad at him.", "And by not pushing for one, he chose to abandon his daughter. All because it was cheaper than child support. Not winning any dad awards here!", ">I unfortunately have seen a lot of cases were parents like this are screaming \"parental alienation\" not because the other parent is really doing anything to actively alienate the child, but because the other parent has stopped protecting the child from the other parent's crazy and neglect and stopped insisting that the child needs to forgive the other parent and excuse the crazy and neglect.\n\nThat's a very true statement. An angle I hadn't considered.", "What would be the negative part of doing it? Not trying to say anything, I didn't know it was standard advice. If the test is positive, she can go for child support, and I assume he's on the birth certificate anyways. Just asking, I don't know.", "So she's putting her hurt feelings above financial support for her child? Even if she can afford It,  she is robbing her child of more support, that is, if the daughter is OP's child. ESH. \n\nAlso, I didn't know refusing was standard advice. Thank you and the other comment for educating me. Have a nice day!", "Depends on which country he is in though. Not sure if he is in the US. Certain European countries - they cannot force a DNA test.", "OP refused child support until a DNA test he wanted done was taken. As punishment, the mom and court granted the mom full custody and ordered him to pay, which he has been, for 7 years. Also, while mom was out partying and bar-hopping, OP was home “doing the bare minimum.” I don’t know what post you read, but people like you are exactly why the court systems are so fucked against fathers.", "Because I literally raised this girl. I care about her. I want to see her grow and be involved in her life. But financially I’m not willing to bet 30% of my income that she is mine without a test. And I don’t feel the need to pay for the test at this point. Her mothers actions and calling me a “loser” pretty much confirmed what I thought. So I’d love to keep our relationship. That’s why I keep in contact.", "No, it's not. It's the same one shared by all the people who get conned and defrauded into raising a child that's not theirs. People don't love every single child that's born, they mean nothing to you. You love one because either it's yours, or you have chosen it. In this case it's neither.\n\nNot only is OPs reaction perfectly reasonable and acceptable (assuming this kid isn't his, his situation is sketchy hence why I replied to a general comment) but if it's not his not only should his ex be serving jail time for the massive fraud she has committed, she should owe OP every single cent he invested in a child that's not his. People agree to have their baby, not somebody else's and to lie and pull off something like that is what's truly disgusting.", "From what I read he was still seeing her just not in a structured custody arrangement. How else would the daughter know the fiance?", "(US based advice since some people have said \"but what if he's not in the US!\" Also note that in the US, some of the below differs on a state-to-state basis and consult a local family law attorney for real information about what the specific laws are in your jurisdiction.) \n\nSince the OP is the legally presumed father (he was married to the mom at time of birth or if unmarried, signed a affidavit of paternity, aka signed the birth certificate) , and has been the presumed father for more than 24 months, the chances of a DNA test changing anything to begin with at age 7 are pretty slim to begin with.  You pretty much have only two years or less to challenge paternity once you've been legally assigned it or legally accepted it.\n\nA test done without the court's order would mean absolutely nothing. The court wouldn't take it as evidence of anything. The court would order another test if someone wanted the results entered into the court record or used as part of the case. Pretty much he'd end up paying for two tests if he did one without the court order and not via whichever lab the court accepts certified results from.\n\nAnd really, as I said above, even if the test demonstrated he wasn't Bella's biological father, in most states after 7 years of him accepting his legal fatherhood, that would have resulted in the court doing absolutely nothing anyhow. It's very unlikely they're going to terminate his paternal responsibilities, it's too late.", "The court did not punish him, he did that to himself. A comment further down shows that he dropped his petition for a DNA test. He stepped up only until he was able to step out. Don't confuse being there for. Assort time with being a parent full time", "So her mom hurt your feelings, so you’re not obligated to parent or confirm if this child is yours or not?\n\nYou’re willing to mistreat this child, **who you don’t know with certainty isn’t yours,** like a second-class citizen because of the word of her mother who you don’t trust?\n\nIf she is biologically your child, will you not feel awful for the way you’re treating her? And if she is biologically yours, you feel comfortable financially, abandoning her for all this time?\n\n***BECAUSE AGAIN YOU’RE NOT SURE SHES YOUR KID OR NOT!***\n\nYou’re not doing this girl a favor by remaining in her life, and treating her like she is at fault for the circumstances here.", "I don’t think you really love her and want to see her grow if you’re not willing to pay a few hundred dollars to court order a paternity test to determine that she is your child. \n\nWhat you’ve done for the last five years is jerk her around and be a quarter step in her life. She deserves so much better than that. Either all the way in, whether you pay child support or not, or all the way out.", "Even IF she isn't yours, who raised her? Does she have another father figure? Does she call anyone else Dad? NO. You were her dad, the only dad she knew and you treat her like a niece or stepchild instead. \n\nYou need to grow up, you are not mature enough for your grown ass.", "You would love to keep your relationship, but you call her your \"daughter\" and see her like twice a month.\n\nI can't imagine basically dropping a child I've raised her entire life. You really need to wonder why she called you a deadbeat?", "Wow you're a horrible fahter and don't even realize it.", "You care about her but not enough to actually confirm whether she's biologically yours. Yeah, that makes sense, no wonder she calls you a deadbeat. How long after the divorce was Chrissy involved? Are you just projecting? You cheated on your ex so she must have done the same?\n\nYou wholeheartedly suck. You are punishing a young girl because of your opinions on her mother. You won't be involved in her life in the slightest with the way you're acting, but hey at least that'll save you some money since that's your number one priority.", "You can’t say you care for her and want to be in her life while simultaneously denying financial support because you don’t believe she’s actually your daughter. Either she’s your daughter or not, you’re trying to have your cake and eat it too. Shame on you.", "Buddy we can all see through your lies. Just do your \"daughter\" a favor and dip out of her life permanently. It may hurt her now but way better than having a father figure that actively hates her.", "Wow. So you don't even love her 30% of your income.  We definitely see her how much she isn't worth to you, even though you raised her for 7 years, supposedly loved her,  helped her grow up. You're fine without answers as long as you don't actually have to financially emotionally contribute. Y TA", "Question: Say there’s a test tomorrow. She’s yours. What changes - is she invited to the wedding then? Do you pay support then? Do you want half custody?", "you care about her, but not enough for custody - so not a fatherly role.. you want to be involved, but you don't want to pay for her - so not a fatherly role. and yet you expect her to treat you like a dad? you certainly don't \\*act\\* like you'd love to your relationship with her lol", "Bro you need help. Its clear that your ex wife is controlling the narrative to your daughter. I'm an attorney and see your issue come up a lot. Many many moms refuse paternity tests based on principal and many guys like you take that as 100% proof of cheating.   \n\n\nYOu want to know how many times I've seen the judge look at the paternity test results, Tell the father he is in fact the father, and then the father realize how much of a true loser he was in destroying his relationship with his child. YTA.\n\nOF course a 16 yo is going to have issues with divorce. How would you feel if you father didn't fight for you because he \"Knew\" you were his kid because of something the other parent refused. You are acting like a spoiled child yourself and your abandonment of your child when you have ZERO Proof to support your claim is enough for me to see you shouldn't be getting married again in the first place. I sure hope you don't have more kids because its crystal clear you are not equipped for it.", "If you need her to be yours biologically, you don't care about her you care about the decade of time you invested in her and your genetic heritance. I heard only losers think like that.", "It is not shared by everyone in this situation. Not every father ceases to care about his kid upon finding out they have different DNA.", "Do you understand that the fraud is about a child and not an object? A child who had absolutely no say in the circumstances of their birth? \n\nWanting a lying or cheating partner to face consequences for pretending a child is yours when it's not is normal. But to blame the child? To punish or cut off the child? It's not their fault. If you actually love the kid you would not find it easy to just stop loving them if you find out they're not biologically yours. \n\nIf you think it's normal or even acceptable to just stop loving a child you've raised for a decade because you find out they aren't biologically yours, that's a very warped idea of parental love. OP has effectively communicated to Bella that he never actually loved her, that he only cared for her out of obligation due to thinking she was his biological child. That's messed up.", "> From what I read he was still seeing her just not in a structured custody arrangement\n\nYes, he cut her off. He sees her occasionally, because, again, he's too proud to just outright be a deadbeat, but it's clear that he does not care about her and would not see her or give her money except to maintain the self-delusion he didn't abandon his daughter out of convenience.", "If you can't afford things you might need, and you only see your \"dad\" occasionally not on a regular basis, you probably get the idea.", "Unfortunately if I’m not her dad that is a problem for her mother to answer and not me. I shouldn’t be held accountable for the actions her mother made. I was the one with her while her mom was out bar hopping. That isn’t treating someone like a niece. It’s protecting myself and my wallet", "Right... this screams he didn't really want to parent in the first place. Who walks away from fighting for their child because the other parent refused something during a divorce. I mean gosh, what reason on planet earth could a divorcing spouse have to refuse to do anything the other spouse wants, let a lone a paternity test based on nothing but rumors.", "True, but for many finding out your kid isn't your kid(either genetically or chosen) ends that relationship.", ">that's a very warped idea of parental love\n\nParental love is conditional on that child being yours, it always has been. Parents only love their children because they are their children, and wether you like it or not unless you have chosen to adopt that means genetically yours. The child is being punished by the mother because of her actions, the person they thought was their father isn't and they are not beholden to them. OP shouldn't have to play family with children that are not his", "I guess we have different definitions of cutting off.", "That's on thr mother as much as the Dad here. He did not disappear, mum could have child support through the courts if she needed it as much as you claim.", "I think we see the true colors and priorities in the last line of this reply. YTA", "You can't have it both ways. A father both helps raise his child and helps financially provide for his child.\n\nProtecting your wallet means you rejected half of what being a father means. Given up 50/50 custody means you rejected the other half of what being a father means.\n\nParticularly if Bella knows that you don't even consider her your biological child, why do you think she has any reason to allow you to be involved in her life? You are not being a father to her.  But even if she doesn't she can look at what has happened over the past 5-7 years and conclude for herself that you're at least a pretty crappy father. She is perfectly within her rights based on her experience to reject you as a father figure in her life.", "Do you not see the problem with arguing about how you watched your daughter and totally haven't treated her like a niece, and then in the very next sentence saying that cutting her off is just protecting yourself and your wallet?\n\nParents who give a shit about their kids don't think about them in those terms!", "But your post looks like she started partying after she had Bella. Was she partying before too? \n\nEven so, you should have questioned it and pushed for it then.", "Either ypu want to be a father or you want to protect your wallet. You can't pretend to care and be a deadbeat while demaning her to respect you. Respect is earned and you are not earning it like that.", "I really, really hope you don't have children or plan to have children. That's so completely cold.", "Maybe. But none of that means the kid isn't suffering, or doesn't know about it. If poor Bella also has a crappy mom, that doesn't change the fact that she has a cold, deadbeat dad. If he really thought she wasn't his, he could have compelled a paternity test. Or done it less officially, when Bella visited him, it's not hard to get one. He probably didn't want to have the test done because he wasn't SURE that she isn't his biological kid, and tossing out the uncertainty allowed him to stay in her life while not paying."]}