{"id": 14624, "submission_id": "12jodb4", "title": "AITA for saying just because I don’t wear my wedding ring doesn’t mean I am trying to hook up.", "selftext": "Forgive me if I spell something wrong, my buddy said to post my story here due to all the backlash I am getting from a job. I (41m) have 2 jobs, 1 is a full time blue collar job, where I work with cement a lot just for some background. And the other is a small firm another buddy of mines owns as a part time accounting associate.  So at this accounting firm, everyone else knows I am married and has been married for 17 years with 2 kids (14m) and (12F). They hired a new full time accountant let’s call her River. To me she has been a crowd pleaser, due to most of work being virtual, we had a much more lax dress code. For context for my primary job I work 4 10 hour shifts a week and normally Monday to Thursday and Friday and Saturday I work at my buddies firm, basically do reconciliations on a accrual basis. I normally don’t wear my ring, because sometimes I have to go help on a project and have lost many rings in cement without realizing it. So I normal don’t wear it when I am working because everyone already knows that I am a married man. The only thing I talking about is my family, construction and accounting.  Some of the guys at the office were talking about River how she has been dump by her boyfriend and is looking for a new man.  Me being the kind person I am said, I hope she finds a man who would make her happy. Somehow she what I said got to her and she thought that I was hitting on her. She came up to me and tried to tell me a sob story about her man was insecure about her having an Onlyfans. I said that is definitely a deal breaker for most. So I guess she thought I was saying I am an exception so she asked do you want to record some content later and I politely said no I am married. She said why don’t you have a ring on then. I said I don’t wear a ring because they normal get lost in cement. She said you must want to appear single if you don’t wear your ring here. I said just because a don’t where a ring doesn’t mean I want to hook up with some hooker. She screamed and called me a misogynistic pig and said she will get me fire. I laughed and said you selling you body for money, back in my day, they had a name for those, they are hookers. So I ask am I the asshole here.", "created_utc": 1681310559, "permalink": "/r/AmItheAsshole/comments/12jodb4/aita_for_saying_just_because_i_dont_wear_my/", "score": 3401, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Was it right for me to be so rude why rejecting the advances of a female co-worker\n\n2.calling my female working a prostitute\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nEverybody is piling on you for calling her a hooker, and yeah, it wasn't really necessary, but she had *just propositioned you for sex for the purposes of monetary gain*. You may have used slightly imprecise language, and some commenters clearly have a lot of feelings about that, but considering what you were responding to, it seems pretty fair to me.", "She sexually harassed this man because she thought he was hitting on her for an innocent comment not even made to her and got mad when he said he was married after asking him to help her make content he’s most definitely NTA for anything other than the wording she shouldn’t have done this at work at all anyway", "NTA.\n\nWhile you were kind of the AH for insulting her, she was asking for it by doing it first.\n\nIt's weird what people will and won't give a pass for on this sub. There have been so many examples of people retaliating (even body shaming) and people seem to be fine with it. I don't know why the consensus is to draw the line on this insult.", "NTA. If you were a woman and told a man you were not interested in hooking up and he was pressuring you for explanations as she was, you'd be applauded for the rude comment and deemed NTA. You said no, and she did not accept that as an answer. You were rude and honestly probably didn't have to make that comment, but as far as I see, you tried to be polite, and she didn't take no as an answer.\n\nCould you imagine if the genders were reversed, and a guy was asking a female co-worker AT WORK to shoot content with him, then got pissy when she said no?", "You were N T A for the entire post until those last few sentences. Big for your response to her. It was unnecessary and cruel. I bet it made you feel really big though to belittle someone…\n\nEdit: I missed the part where she asked him to make content. Though she just asked him out That’s straight sexual harassment so the harsh response was warranted Switching to NTA", "NTA.\n\nAlso she is admittedly a sex worker who was propositioning to you. What does it makes her?\n\nThe only criticism people can make to you is the wording, but she was the one who started by sexually harassing you at work.\n\nYou should take the initiative and tell your boss before she tries to control the narrative.", "NTA. Lots of professions have people that don't wear their wedding/engagement rings for a variety of reasons. Most doctors/nurses won't wear them at work. Anyone in the trades often takes them off for the same reason you do. You're not 'putting yourself out there' or tricking her in any fashion. You aren't hiding your wife. You told her flat out you're married. How is that being tricky?\n\nYou kind of are the ahole for the last bit of that comment. Even if she does sex work, the stigma around it is toxic and crapping on her for it and calling her a whore makes that pedestal you're on wobble a bit. You could have handled it better. Just a 'no, not interested, I'm married' and then taken the high road. She should be smarter than to share her personal business with someone at work and then get mad when they don't react well.", "[removed]", "NTA.  My husband lost his ring and finger at work.  Rings should never be worn when doing manual labor.  Husband thought he was safe based on what he was doing at the time, but when jumping down from a platform, his ring caught and his finger was pulled off.  There was too much damage for it to be reattached back in 1982.  Many years later, I decided to have his ring welded to my own and I love the look.", "NTA normally I can’t stand when people throw around hooker and shit and you would’ve been TA for saying them. \n\nHowever, she came up to you AT WORK to proposition sex work. If I were you, I would go to HR about that. That is sexual harassment, especially if she didn’t take no for an answer. If the genders were refused, Reddit would be throwing a tantrum", "ESH her for the ring and you for the hooker comment.           *Jesus loves sex workers*", "NTA", "NTA 🤣🤣🤣🤣🤣\n\nYOU ARE NOT WRONG. DON'T LET ANYONE TELL YOU OTHERWISE.\n\nYou called a spade a spade, She wasn't pissed at the time of making money through OF by selling her pics, but is now angry that people openly associate her with her profession.\n\nYou stood your ground man, you are believer in true gender equality. I completely support you", "maybe a controversial NTA\n\nBut I dont think she would have left you alone if you didn't go nuclear and insulting. \n\n>I said just because a don’t where a ring doesn’t mean I want to hook up with some hooker.\n\nTechnically, you DIDN'T call HER one, you just said you had no interest in being with one of those. If she took offense at that, and identified with the label, that's on her really.", "NTA.\nYour reason for not wearing a ring is 100% valid. I worked as a paramedic and firefighter. I have never wore a wedding because I like having all my fingers. During my first year as a paramedic, I responded to a call of a man who degloved his ring finger. His wedding ring got caught on part for the truck he was unloading when he jump off. \n\nWhen we got him to the ER, the orthopedic surgeon said there was no way to save the finger. They removed the bones and sewed it up. \n\nI haven't worn a ring in 31 years of marriage.", "NTA. You have to be blunt with someone that is looking for a new mate so aggressively. You didn't ask her about her life. She offered this info and asked an entirely inappropriate question at work. You could claim sexual harassment.", "NTA If the roles were reversed, half the comments would be clapping for you and begging you to go to HR for their comments towards you.", "NTA- while I strongly disagree with the name calling  , she could have accepted your “I’m married “ and kept going about her day, but she didn’t. \n\nShe didn’t like being rejected so she called you out on not wearing a ring and giving her false hope . \n\nI would still go to HR and mention the incident, her propositioning you,  just to cover your butt .", "NTA!!! THIS WOMAN SEXUALLY HARASSED YOU AT WORK!! I FEEL ASHAMED OF MY GENDER (FEMALE) WHEN I HEAR THIS KIND OF FUCKING BULLSHIT!!\n\nIF THE GENDER ROLES WERE REVERSED, EVERYONE WOULD BE RIPPING YOU A NEW ASSHOLE!\nFUCK DOUBLE STANDARDS!", "NTA - for not wearing your wedding ring.  The last comment was an unnecessary AH comment.  Also, although HR is not your friend You should want on record that she threatened your job over her misunderstanding.", "NTA, everyone getting pissy about your words when you were basically trading insults with someone who sexually harrased you. Switch genders for a moment and everyone would be on your side.", "[deleted]", "NTA for not wearing your ring. Certainly not her business. She's mad that she made assumptions and looks like a fool. I'm not a fan of your reply to her attack but she did attack you and I can't knock you for responding. You just should have stopped at not wanting to hook up. Adding the rest wasn't necessary. My dad never wore his ring. For safety. What if he put it on and forgot about it? Working around machinery, if it gets caught, you could lose your finger. And yes, I've seen it happen", "NOT THE ASSHOLE. PREACH IT BROTHEEERRR\n\nNow, in reality, yes. Hooker=prostitute \n\nDefinition : someone that engages in sexual activities in exchange of payment.\n\nPeople will hate to hear this as we live in sensitively, but that's the reality.\n\nNTA.", "This is an easy ESH.\n\nThere's nothing wrong with not wearing your ring all the time. If other people want to base their assumptions of your availability on the missing wedding ring alone then let them make a fool of themselves. And to be honest, there isn't much about her interactions with you that are even borderline professional. If there was an HR department with your buddies company I would've thought about using it.\n\nThat said, you went full AH by calling the girl a hooker. Everything you did up until then was pretty tame until you, in your infinite wisdom as a 41yr old father of 2, decided it was a good time to make yourself look bad. Be better my dude. Always act like your kids are watching.\n\nJust an added note: I personally think where this happened is a big factor in how OP reacted. This was at work. Professionalism is a thing. The coworker created this situation and OP was doing what anyone would do but resorting to passing judgement and name calling only escalated the situation. I think OP handled it poorly. I can think someone is an idiot and not actually call them an idiot. It's that simple to act like a grown-up.", "NTA/EHS She made the assumption that you’re a cheater you made the assumption she’s a hooker. Both of which are inaccurate and could hurt the other persons feelings. \n\nAnd let’s be honest an Onlyfans girl is only a stones throw away from being a hooker. \nSelling your body is selling your body.", "NTA", "NTA. She sexually harassed you. You should report her to HR", "Well that took a unexpected turn.\n\nESH\n\nHer comments where unprofessional and crossed a line to start with. She started a sexual conversation in the workplace and then made out your attempting to cheat on your wife, based (according to you) on no foundation. \n\nHowever your comments are horrible and unnecessary cruel. And there is no excuse for that. I think you confused construction site communication and office communication. I worked in HR in construction for years, calling someone a whore wouldn't even raise eyebrows with senior managers. I also worked in banking and that comment would get you sacked. It's not right, but it is the truth. \n\nYou need to work with this woman, just accept you went to far and do what you need to do to apologise for that.", "It was very pushy and not sensitive of her to not check for å vibe before asking a person to film her pornographically.\n\n I am a woman and if a woman or man or anyone asked me that at my work place or anywhere without testing the waters first (at least!) I would take that as harassment.\n\nNTA", "NTA", "NTA.\n\nI mean, she, a sex worker, propositioned him. So she's not not a hooker...", "NTA for anything you did or said.", "NTA. report her to HR for sexual harassment", "NTA. \n\nShe was propositioning you for paid sex. Sure, hooker isn't the best term, but a spade's a spade.", "I would report her to HR. OF is not something to bring up in a work setting. NTA", "NTA for not wearing your wedding ring. My Dad worked as a cement Mason and the lye in the concrete ate the gold over time.. Not to mention if you get the ring caught on a form or something.. You could do Maher damage to your hand, which you need to make a living.\n\nHowever you didn't have to be so crass and could have taken a higher road and just told her it none of her business and left it at that...", "NTA everything seems civil until \"I'm married\" and she questions why you don't wear a ring. Her behavior at work was unprofessional and borderline sexual harassment. How many men have gone around stating \"I do OF anyone care to make some content\" while at work. \n\nDocument everything and talk to HR or the owner, you don't want these waves effecting your family", "NTA", "NTA I'm a nurse I have lost 3 wedding rings in clinical waste bins, I'm married to a chef who, for obvious reasons, doesn't wear his ring. Not every married person wants to wear a ring or can. She misread the signals and is pissed she was rejected. That's not your problem. You told her as soon as it was relevant.", "NTA\n\nShe propositioned you to make porn with her at work??? How inappropriate! She should have been suspended or fired for that. Your response was absolutely necessary.", "Umm NTA only because what she asked you to do was a form of sexual harassment. You daid no, and she persisted. I would however file those charges against her before she goes against you. Hr will typically believe the women first so you definitely need to talk to them first and express that it made you uncomfortable", "NTA.\n\nYou probably went a bit too far with the hooker comment, but overall I can't blame you. She took an innocent comment made to your coworkers that somehow got back to her as 'this person wants to get with me' for some reason, and everything that followed on her end was highly inappropriate at best.", "ESH for calling your coworker a hooker. That’s not work appropriate behavior. Her for obvious reasons.", "[deleted]", "ESH for You for calling you a calling her a hooker. Her for  making assumptions about you.", "ESH. Not wearing a ring doesn't mean you're single. Calling her a hooker for expressing interest in you is a bit much.", "[deleted]", "> laughed and said you selling you body for money\n\nYou work in construction. You are literally selling your body for money. Does that make you a  hooker?\n\nESH", "Not the asshole for not wearing a ring. But you are the AH for calling her a hooker. Slut shaming is not cool. Seriously. There is nothing wrong with her having an Onlyfans.", "I don't think this actually happened.\n\nIf it did:\n\nNTA for not wearing the ring. YTA for calling her a hooker.", "NTA--until what you called her\n\ni dont wear my ring bc i barely go out and i dont care to wear jewelry. i told my husband this way in advance and he doesnt care. ill wear it on some occassions bc it makes him happy. this does not mean anything else beyond that, and i agree its silly to think so.\n\nbut you calling her that was uncalled for and its time to get up to date on terminology", "You were doing so good, you were *so* close to not being an asshole, and then you did a hard 180 and just drove right into assholetown by calling her a hooker. \n\nYes, YTA", "I was on your side about the ring stuff but then you started with the misogynistic insults. For that YTA. \n\nI've been married for many years and neither of us wears a ring (lost 'em both).  It's no big deal and I find it bizarre you have people bugging you about it. Most of the married men I've ever known don't wear rings.", "NTA for not wearing a ring. My husband and I mutually agreed they're annoying and only wear them on special occasions. \n\nY T A for calling her a hooker. Really? Were you raised with no manners? You treat everyone with respect, regardless of their job.", "ESH", "Rubber rings, get a pack. I lose rings, my husband loses rings.", "YTA and this isn't about a ring at all. Nice window dressing.\n\nYou called her a hooker and that doesn't even apply to this (or her) situation. \n\nThere is so much wrong with your reply to her and that you don't see it and you are actively trying to justify it, says everything we need to know.\n\nYTA", "ESH. You were in the clear until the “hooker” comment. That was wholly unnecessary.", "Nta for the ring thing, a little bit ? My husband works a manual job, takes his ring off and hangs it in his car, but he puts it back on as soon as the job is done and for any office days.. not sure why you can't do the same. \n\nYta for calling her a hooker.. wtf .. it sounds like you were pissed off to be called out and couldn't take it so you lashed out. So emotional.", "YTA for calling her a whore and a hooker. Not cool, dude.\n\nYou may not agree with her being on OnlyFans and you may have your opinion on the kind of people there. But you should not have called her names.", "NTA for not wearing a ring. Lots of married people don't wear rings for so many reasons.\n\nYTA for the judgment towards her.", "NTA for the wedding ring thing, but YTA for how you spoke to her. If anything, she's a porn star or nude model, not a hooker", "YTA\n\nChrist man, huge L.  You had this then you decided to be an asshole and call her a hooker.  Went from respectable guy to asshole in 2 sentences.  \n\nDoesn't matter if you're married, dating, or single.  Her behaviour was massively inappropriate but you blew her out of the water with your retort.\n\n\"Sorry if you've gotten the wrong impression but I come here to earn money, not hook up.\"", "YTA", "That last few sentences really throw the entire thing off haha..better wear a ring next time dude and be professional talking to your colleagues at work.", "You're a giant asshole.  \nSex work is work.  \n\n\nIt has nothing to do with your wedding ring.  You're an asshole.", "OP you were fine until the so both AH.", "ESH. You were not TA until the very last sentence when you shamed her as \"being a hooker\".\n\nLike you honestly don't have to wear a ring. There are many professions that  require you NOT wearing one (eg. nurse, doctor, etc.). \n\nAnd to be fair, I would rather not wear my fancy wedding ring if the chances are far higher that I will break it or get it dirty (imagine being a nurse and dealing with patient poop and urine - do I want that on my ring? HELLLL no. I don't even want it on me but alas...it is the job); or lose it!", "ESH. \nI was with you all the way until the end. \nFirst off, She never should have talked about her OnlyFans with you, her coworker, at work. That's highly unprofessional and is sexual harassment. She then doubled down on the sexual harassment by asking you to join in and pushing the issue after you said no. Accusing you of trying to cheat, more harassment.\n\nIf you had called her out for sexually harrasing you, reporting that behavior to your friend who runs the firm or to HR, then you'd have been N T A. However, you decided to insult her instead and call her a hooker. That moved you to also be an AH. \n\nNow, I'd say she's more of an AH than you, imo. No one should be sexually harassed at work, and I can understand why you responded the way you did. You were being sexually harrased, and she wasn't taking no for an answer. So your AH response is understandable. But it was still an AH response. \n\nAlso, she should be the one getting fired for sexually harrasing a coworker.", ">I said just because a don’t where a ring doesn’t mean I want to hook up with some hooker.  \n>  \n>I laughed and said you selling you body for money, back in my day, they had a name for those, they are hookers. \n\nThis is why YTA.", "yeah...YTA. Didn't have to say \"no\" like that. You wouldn't be the AH if you stopped at \"I don't wear a ring because..get lost in cement. I'm not trying to hook up.\" The rest...not so good.", "The only behavior here that needs to be reported to HR is you calling her a hooker.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nForgive me if I spell something wrong, my buddy said to post my story here due to all the backlash I am getting from a job. I (41m) have 2 jobs, 1 is a full time blue collar job, where I work with cement a lot just for some background. And the other is a small firm another buddy of mines owns as a part time accounting associate.  So at this accounting firm, everyone else knows I am married and has been married for 17 years with 2 kids (14m) and (12F). They hired a new full time accountant let’s call her River. To me she has been a crowd pleaser, due to most of work being virtual, we had a much more lax dress code. For context for my primary job I work 4 10 hour shifts a week and normally Monday to Thursday and Friday and Saturday I work at my buddies firm, basically do reconciliations on a accrual basis. I normally don’t wear my ring, because sometimes I have to go help on a project and have lost many rings in cement without realizing it. So I normal don’t wear it when I am working because everyone already knows that I am a married man. The only thing I talking about is my family, construction and accounting.  Some of the guys at the office were talking about River how she has been dump by her boyfriend and is looking for a new man.  Me being the kind person I am said, I hope she finds a man who would make her happy. Somehow she what I said got to her and she thought that I was hitting on her. She came up to me and tried to tell me a sob story about her man was insecure about her having an Onlyfans. I said that is definitely a deal breaker for most. So I guess she thought I was saying I am an exception so she asked do you want to record some content later and I politely said no I am married. She said why don’t you have a ring on then. I said I don’t wear a ring because they normal get lost in cement. She said you must want to appear single if you don’t wear your ring here. I said just because a don’t where a ring doesn’t mean I want to hook up with some hooker. She screamed and called me a misogynistic pig and said she will get me fire. I laughed and said you selling you body for money, back in my day, they had a name for those, they are hookers. So I ask am I the asshole here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "No chance this is a real story\n\n“Anyways I noticed you don’t wear a wedding ring, so even though you’ve never shown interest in me before, wana fuck later tonight and film it?” lmfao shut the fuck up", "NTA. All of this is an HR issue. But you won't get into trouble because you weren't the one who initiated anything.", "“AITA for calling a female coworker a hooker?” Fixed your title for you. YTA.", "NTA - I'm married and haven't worn my ring basically since my daughter was born. My husband is also in construction and one of his buddies degloved his ring finger and so my husband wears his ring only on social occasions.", "**NTA**\n\nAt worst it would be ESH, but I honestly think your words were somewhat justified even if harsh. \nShe could've just taken the L and drop it, but instead she tried to make it your fault that she was approaching you.\nI'd like to hear her reasoning for beliving that you would be fired for calling her names rather than the other way around for the fact that she was sexually harassing you at work.\n\nI am also beyond shocked at all the YTAs... google is not that hard to use:\n\n\"a person, who engages in sexual activity for payment.\"\n\nI doubt she does OnlyFans for the sport.", "NTA, stay clear of that one. Report her to personnel. That is harassment.", "NTA at all, she made a proposition and you declined due to your marriage and SHE gets offended? \n\nAnd people answering ESH is wrong.", "NTA but this is word vomit. Google \"paragraphs\"", "The hooker comment was out of line because you’re at work, your feelings were on point but your response to her was not ‘the type of guy’ you describe yourself to be. You did demean her and it’s unnecessary when you’re trying to make a point about professionalism. Now you have two wrongs ESH - her for trying to deflect her rejection as you being promiscuous in your marriage. You for making her personal life (and sexual advance in the workplace) into a demeaning insult (low blow).\n\nShe did not directly solicit for those saying she did, she offered to be co-sex workers I guess…no idea why she thought that’s ok but I guess it’s different to offering sex for money from OP directly.", "NTA. Having a coworker come up to you, talk about their onlyfans, and then proposition you for sex is so beyond what's acceptable at work that I can't believe people on here are calling you the asshole for being rude in response.\n\nI am honestly left speechless by this place sometimes. This person should be fired, blacklisted, and possibly charged with something.", "You had me until you called her a hooker. That makes YTA.", "Of course you were TA.... buuut wasn't that the point thoe? ;D", "NTA dude she propositioned you and then tried to gaslight you by saying because you do not wear a ring you are putting yourself out there aka “asking for it” so gross. I am a woman, was married for 17 years before late husband passed away and never wore my rings except a rare date night or event. I owned my own handy’woman’ 😂business plus I was also a diesel mechanic so no go for both and after that I was running daughter around to her sports and activities which I was, more times than not, an assistant coach. A ring does not make the commitment, the person does and you did just that by shutting her down. You sound like you did it politely until she decided to try to twist it onto you. Besides you would not believe how many people I know who cheat with the ring on full display.", "Nta. I don’t wear my ring only because I’m afraid of losing it. Happily married and would never cheat.", "NTA but I will say the first thing I look for when I see a man or I’m introduced to a man is whether or not he has a wedding ring. If I don’t see one I’ll also assume they were single and fair game.", "NTA - For not wearing the ring but the hook coment was not nice", "You are NTA for not wearing your ring buddy.\n\nYOU ARE TA for being a misogynistic pig.", "NTA you don't need to be polite to people who sexually harass you.", "YTA for calling her a hooker and for having only fans\nSlight e s h because she should have dropped it when you told her you were married. However what you did was WAY WAY WAY more rude and out of line", "NTA - not like, great to call her a hooker in a denigrating way, but I get it. Also if you did want to wear a ring, get a chain!", "YTA for the formatting holy shit", "NTA", "INFO: \n\nOnlyfans link? Lmao", "Yeah, even though she kinda pushed OP into it.\n\nIt's also kinda hilarious that all this is over a wedding ring, I know so many people who don't wear them, women included.\n\nI feel like we need a sub of this sub, kind of an \"Am I the annoying person?\" sub b/c so many posts on here aren't a big enough deal for judging-assholery-energy.", "Nope. A sex worker was propositioning to him and harassing him AT WORK.\n\nWhat he said was basically factual. You may have a problem with the tone, but you can't deny she is (or at least was acting as) a prostitute and deserved to be called out for propositioning.\n\nNow, of you have a problem with prostitutes, that's on you.", "He was being propositioned and sexually harassed at work lol", "It was pretty necessary. She asked a coworker to make pornographic content with her, didn't take no for an answer, and called him a liar and insisted he wanted to appear single. If she's going to be sexual and pushy, she deserves to be insulted. I bet if it was a man doing it to a woman you'd be saying the exact opposite of what you are now", "She is rude and deserve everything he told her..\n\nShe don't have to say anything about his life and deserved when he said about her life..\n\nShe insulted him, she deserves be insulted too.", "And she should have stopped when he said \"I'm married\"\nSwap the genders and I doubt you'd still be saying he the ah", "I mean, she went the sexual harassment route, and he went the hostile work environment route. Really, neither of them should have employment at that firm in short order.", "[removed]", "Had the exact same thought. It was like N.......T........A....... HOLD THE PHONE, yes, YTA.", "harassed*****", "Jesus does. People getting propositioned to shoot a porno by their coworker might not", "Jesus wanted those sex workers to stop, might not be the greatest pro-sex work argument to use", "There's a whole church about it - xxxchurch. Jesus loves porn stars.\n\n😆 y'all religious people are always so salty about what people do on their own time.", "Same! 🤣 If I was there I would have said 'get wrecked' after that line haha! It sounds like he was dishing the same energy she was giving. \n\nBut I agree he should let his supervisor know before she does and this whole thing becomes more unnecessary drama.", "NTA. Fr, but you know the type of response this will get on reddit lmao", "Let's, be honest, it isn't. Everyone in the military and manual workers all sell their bodies, all hookers then?", "But she kinda is one?", "But the coworker asking him to make porn with him is perfectly ok....NTA", "Asking someone if they want to record porn with them is a bit different from expressing interest imo.", "How could he not be? If a male co worker told you they had an onlyfans at work, then asked you to shoot content while at work, I'd wager you'd feel pretty uncomfortable. Then, when you say no, they pressure you for an explanation multiple times. I'd imagine you'd feel pretty angry/upset. Then, in an attempt to shut down the conversation that you've tried to shut down politely at least twice, you make a mean comment. You're telling me you'd expect to be labeled an asshole and not him?", "What's your definition of someone who engages in any sort of sexual activity in exchange of payment? I'm legit curious.", "> Not the asshole for not wearing a ring. But you are the AH for calling her a hooker. Slut shaming is not cool.\n\nIf she feels shame that's on her, not him. Reddit really needs to stop calling any criticism or even factual descriptions \"shaming\".", "You don't think it is wrong, or at least inappropriate at best that she propositioned him for sex that would be filmed and posted on the internet while at work?", "There's nothing wrong with being a hooker", "She sexually harassed him in the work place!  Imagine if a man went up to a woman in the workplace and said \"hey do you want to make some porn later?\"  Get the fuck out of here.", "She quite openly proposed that he have sex with her for money from OF. That's prostitution. Nothing wrong with that in general, but since they are coworkers at their work place and she kept pushing after he declined, it's also sexual harrassment. NTA", "She asked her coworker if he wanted to tape some scenes with her for her OF account. Don’t you think that should be reported? I do and I was in HR for 20+ yrs. They’re both the aholes. Big ones.", "Your comment has been removed because it does not address the OP in good faith.\r\n\r\nIf you suspect a post breaks one of our rules, please report it instead of commenting. **Do not feed trolls**\r\n\r\nContinuing to post comments like this will lead to a ban.\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Anyone who sells nude content in internet is a virtual prostitute...\n\nIts the true and no one can't say its not.", "But she gets paid to have sex.", "Sell your body in the military? Explain sir.", "Eh, I think making a pass at someone ONCE is okay. That straightforward of an ask is definitely reportable, just didn't NEED to be reported, imo. More of a personal call. Calling a work associate a hooker is not a personal call.", "They give you money, you come back with bits missing or not working as well.\n\nYou are paid for actions that can harm your physical wellbeing.", "In that case everyone would  be a hooker no matter what they do for a living.  A hooker performs sex acts in exchange for money. People who use their bodies in other ways in order to earn money are not hookers.", "Some sportspeople are definitely hookers.", "1. If you're retiring from accountancy with the body of a hod carrier you've been doing sums wrong.\n\n2. People who make money by only fans also aren't hookers for that alone, that's my whole point.", "I think this comment could go over most people's heads", "Are any of these stories even real tho", "Esh", "NTA at all. Her response was ridiculous and you responded in kind when she wouldn't drop it. \n\nNearly everyone I work with for years don't wear their wedding rings because they all do jobs where it needs to be taken off, is possibly a hazard/get lost or they don't feel a need to wear it as an symbol of being unavailable. What a weird standard she holds. She's not happy with her bf's insecurity over her OF yet you have to wear a ring to ward off any women and you must want them because you didn't wear it. \n\nAvoid like the plague. Get ahead of this and report it to HR. Sure they might not like your response but she instigated and pushed it including threatening to get you fired. That has to be reported. You can not trust being anywhere near her especially alone now.", "Wow all these comments are missing the point she SEXUALLY HARASSED him. Yes what he said was mean, but if the genders were reversed, you would all be singing praises, but when a MAN is the victim, heaven forbid he acts rude to his harasser. My god people, stop defending harassers just because they're women.", "NTA until the last couple sentences. Now you’re TA.\n\nIt’s not about wearing a ring or not, it’s about how you talk to people.  And I feel like this exchange maybe went a little differently than how you’re describing it.", "Q to OP\n\nYou sound like a good person, but what you do sends a message to others you may not want them to have.  \n\n\nWearing a ring means you honor your wife and your marriage.  Would you be ok with your wife not wearing her ring to work because it could get lost wile she is working?  And she works around men?\n\nYou can wear one of those rubber/synthetic rings.  If they get lost,  buy a new one.  If your ring could get lost in cement then it’s too big on you and you should have it resized.", "Is this whole sub just people posting fake shit?", "This didn't happen so much it made things unhappen that had.\n\nGet therapy for your lying problem.", "And then everyone clapped.", "NTA. And good job setting a sexual harasser in her place. It’s funny how she’s cool to sexually harass you and than she calls YOU a pig for turning it down. Hilarious", "NTA. You can buy cheaper silicone wedding bands so if they get lost in the cement it’s NBD.", "NTA She kept pushing, she basically tried to get you to cheat on your wife. If people are more hung up over what you called her over her willingly knowing you're married and trying to get you with her anyways then they are wrong. That's not only gross but much worse.", "NTA. Please make a complaint before the next r/Trueoffmychest is some delusional chick talking about some guy at work giving her mixed signals because he doesn’t wear his wedding band. Please.", "NTA. my husband can't and wont wear his ring at work, while its tungsten and would shatter under the equipment instead of bend,  hes seen too many guys lose fingers from rings getting caught in the machines and *ripping* both off. Not even silicone alternatives.  His job is Super sweaty and hot so it just causes rashes if he wears one.  \n\nMy dad was also a diesel mechanic,  and he lost 4 rings in oil and stuff before giving up on wearing one.  The second someone says married or in a relationship that's their cue to back off.", "Le sigh. I was all for a N T A until you called her a hooker. So now it's firmly ESH. She should not have propositioned you at work, and you definitely should not be slut shaming her.", "NTA \nDocument everything and stay away from her completely.  Email the boss / HR and tell them you will not be working with her or anyway near her as you don’t want any issues", "NTA\n\nThat being said, when a woman with an OnlyFans account asks you if you want to make \"content\" with her, she actually isn't planning on paying you for the pleasure, nor was she expecting you to pay her. So technically, you should have called her a slut rather than a hooker. I'm not going to rate someone as an asshole for using the wrong technical term for what she was proposing to you. lol", "ESH", "NTA.\n\nWedding rings are not a mandatory accessory for every married person. Just like some people like wearing hats, some people don't, and it doesn't really matter. You're saying you openly talk positively about your spouse and family, if someone else can't gather that you're married from all those context clues. . .a ring on your hand isn't going to help them figure it out either.", "NTA, but I think your response could get you in trouble and you probably shouldn't have said it. \n\nYou don't have to wear a ring. That's your choice and no one else's business. She sexually harassed you at work, you politely declined, and she was angry about it and lashed out. You lashed out back, because you were provoked. You need to report her to HR/your buddy formally because she's definitely reporting you and you need to get ahead of this.", "NTA. Everything you said to her was the truth.", "NTA. Buy some silicone rings so people won't bother you and you won't care if you lose it.", "NTA\n\nYou were harsher than I would have been with your words, but she literally propositioned you for sex (well making porn) at your job when you had already said no.\n\nIt doesn't even matter that you are married TBH. No means no.", "Yta because of the end. Why would you say that? In a workplace? My husband works construction and hasn’t really worn his ring for 8 years. I don’t care. It doesn’t bother me. I also don’t assume that someone who does or doesn’t have a ring is married or not.", "My dad never wore his wedding ring because her worked around machinery. His buddy lost his finger when his ring got caught on a piece of fast-moving  machinery.  NTA.", "ESH.\n\nYour reasons for not wearing a ring are entirely valid, and you don't owe anyone an explanation. Her comments were out of line.\n\nBut using such a derisive insult in response? You're just as out of line as she was.\n\nAs for anyone here trying to say that this ruling would be different if the genders were reversed...no, it really wouldn't.  If you think less of someone for doing any form of SW, **you are an asshole.** Gender ain't relevant in that regard.", "You're both TA.\n\nShe's TA, because she was sexually harassing you in the workplace, and behaving in a completely inappropriate way. You're an AH, because you immediately went to disrespecting sex work, and sex workers as your default response. If you hadn't done that, and just told her off you wouldn't be TA, but the fact that your immediate go to was to use language that specifically degrades sex workers changes that.\n\nSo yes she is absolutely an AH for what she did, and it was completely out of line, and inappropriate, and if you had just told her off, and reported her actions you would have been 100% in the right. However you are always an AH the second you start using something that people are systemically oppressed for, to insult someone. Especially seeing as she seems like a genuinely awful human being, and there are literally a hundred other insults you could have used that wouldn't have been slurs against sex workers.", "Definitely ESH. I sided with you all the way until the end. You were sexually harassed and should report her 💯. Where my issue lies is the generalization of calling her a prostitute. \n\nShe should have backed TF off when you told her you were married. \n\nDamn dude, I’m sorry you had to deal with this.", "ESH not cool on her part total sexual harassment. You were also out of line. She should not have asked but you could have said no firmly without calling her a hooker.", "ESH\n\nYes you are definitely an AH--you went from zero to revolting judgmental insult.\n\nShe absolutely sucks to make her cracks about you wanting to appear single--no one has to wear a ring--esp when it can be a safety risk  BUT 'you may want to appear single\" Does not equal calling someone a \"wh\\*re\".  She also sucks for bringing up OnlyFans at work--NOT professional--but again not Proportional to what you said.\n\nI would have called you AH alone but She doesn't deserve to get off scot free.", "You were doing okay the last few sentences.\nYTA. You're a misogynist jerk.", "ESH\n\nYou *are* a misogynistic pig and need to adjust your views and vocabulary on sex workers. It's archaic and makes you sound like an idiot. Plus, a repeated no would have sufficed.\n\nShe needs to learn to take no for an answer and get over her ego. Some people don't wear rings or wear them differently and don't need to justify it to every curious stranger.", "ESH you’re an AH not for not wearing a ring but for slutshaming a coworker. She was out of line as well and should have kept it work appropriate. The fifties called and they want their sexist and sex negative attitudes back.", "NTA for not wearing your wedding ring.\n\nYTA for calling her a hooker and judging her", "Yta for being incredibly rude, nta for not wearing your ring", "ESH. \n\n**Her** for propositioning you for OF after she heard from someone else that you said you hope she finds someone. Also her for assuming you were single and not taking no as an answer. No explanation is actually needed there; no is an entire sentence. And it’s possibly sexual harassment. So if anything, *you* could report her. \n\n**You** for the misogynistic comment about her being a “hooker”. You could have said so many other things here, but whether intentional or not, you made a comment that denigrates sex workers. \nYou said that you told her *“back in my day, we had a name for those, they are hookers”.* That “back in my day” part suggests that you know that it’s NOT okay to say that word in today’s society.", "She ITA for sexually harassing you at work.\n\nYATA for reacting with insults and shaming her in an attempt to gain power over her by retaliating instead of setting an appropriate boundary. \n\nYou lost your ability to hold her accountable for her behavior the second you reacted by engaging in equally problematic behavior. Two wrongs don't make a right; and most people will attempt to justify or normalize highly problematic behavior when they feel entitled to react instead of respond to conflict. \n\nThis is how dysfunctional conflict resolution cycles are perpetuated.", "ESH, you were fine, but you took it too far", "ESH. Mainly her, but still you OP. She sexually harassed you at work asking you to film pornographic content with her, which is so gross (if we switched the genders around it would be a very clear HR violation, a reminder to think about it as equally severe). However, your response was needlessy unkind. You didn't need to use derogatory language and call her a hooker, you could have rather said that irrespective of whether you're wearing a ring, you are married; and furthermore regardless of that fact, it is sexual harrassment to approach you and make that request. So she's definitely the bigger AH in the situation, but this is definitely not a 'NTA' in my opinion since you were an ass in how you went about dealing with it.", "ESH You crossed a line calling her a derogatory term. Not all sex workers are prostitutes, and even if she were, \"hooker\" isn't exactly a positive term, is it? You said it because you wanted to insult her, don't pretend otherwise. Just keep in mind, you work construction, so you're also selling your body for money and in the long run, you're a lot more likely to wind up with a broken down body because of it.\n\nShe shouldn't have propositioned you at work, but honestly, I don't blame her for asking about the ring. She should've just accepted it when you explained though, but I don't really think she was pressuring you to participate at that point, I think she was just trying to save face once she realized she'd propositioned a married man, trying to shift the blame back onto you. She shouldn't have, and that's why she's also an AH.", "Fake but NTA.", "NTA but I wish you would do some self-searching and think why you feel such contempt for a sex worker. It seems you got offended here because she is a sex worker not because she wanted to have sex with you. Her behavior was extremely inappropriate but you could be less cruel.", "ESH", "ESH she should not have propositioned you so explicitly in the workplace and you should not have called her a hooker. That is considered by many to be a derogatory term.", "NTA\n\nA ring isn’t an indicator of being single. I’ve been married 21 years. My husband has never worn a ring. He’s a mechanic, I don’t want him to lose his finger, and also finds the uncomfortable.\n\nI haven’t worn a ring for 10 years. I have issues with my hand. \n\nIt does not make me less married in anyway.", "NTA.  Neither my nor I wear wedding rings.  Sometimes, it's just a choice and nobody's business.  It certainly doesn't make you a misogynist pig nor does it mean you're looking for extramarital action.", "NTA......also I detect no misogyny....what she did to you was sexual harassment. It's completely inappropriate in a work environment to discuss your only fans account and proposition a co- worker.....\"River\" is a fucking asshole and idiot.", "Ok, so kinda an AH for the hooker comment and then the mansplaining of what a hooker is. BUT she was HIGHLY inappropriate, propositioning you to make CONTENT?! And anyone whose married to a person operating heavy machinery knows that rings can get lost, broken or cause injuries. NTA over all.", "NTA - I've been married for 20 years and neither of us wear a wedding ring. I came very close to losing my finger 10 years ago because of my ring. It's now in pieces in a little baggie after being cut off at the hospital. My husband took his off the same day and we've never worn them since.", "NTA. My dad is a farmer and I do t think I’ve ever seen him wear his ring since the day he married my mom. It’s a safety hazard.", "NTA\n\nShe should have stopped at no, you were (frankly) just being honest. Anyone selling their body is prostituting themselves. I don't find anything wrong with it at all.... until you start propositioning random people at work.\n\nFWIW my father never in his life wore a wedding ring - he is not a jewelry type of guy (aside from his watch that I am pretty sure he still has lol). I guess growing up that way I just assumed that was normal. I don't find an issue with it. People shouldn't have to announce they are married. There are plenty of couples who aren't married that should also be faithful to their relationships - they don't have rings announcing it. What difference does it make? No is a very easy answer.", "NTA for not wearing your wedding rings. If it's fine in your relationship that is no one else's business. Neither me or my husband wear our rings very often and it's a none issue. But calling her a hooker is a bit of an AH move, but definitely not worse than her proposal or her screaming at you.", "NTA at all - I don’t have a problem with your choice of words since she was basically harassing you first. You were just matching her energy 🤷🏻‍♀️", "NTA. People can be single and still not want to hook up with anyone. \"No\" is a complete sentence and no further details are required.", "Hilarious. Well played! NTA", "NTA. Go to HR today and get ahead of this. Tell them she propositioned you at work.", "NTA. My husband doesn't wear his ring at work cos of the dangers. He will wear it on special occasions,  holidays,  etc., everyone knows he's in a relationship with me and doesn't think it's wrong. Propositioning someone at work who's already said they're married is wrong", "NTA. She's sexually harassing you at work and you said what you said to stop it.", "Nta the asshole. A lot of professions don’t wear rings. That doesn’t mean they want to hook up", "NTA, you called her what she is and she didn't like that. \n\nBut i would report this incident to higher ups cause i feel like now her little ego is bruised she might try to do something stupid.", "she asked, he said no, she pressed, he presented a perfectly valid reason(fun fact...first thing they teach you on a jobsite if you're a new higher..DO NOT wear rings..you WILL lose them in cement, source- hgtv, holmes on homes etc...none of those guys wear rings on job sites for this VERY reason)\n\nshe kept pressing with her reasons..he shut her down exactly as hard as she was pushing.\n\nNTA.\n\nOP? I'd advise you to tell your wife ASAP and get ahead of any potential crap stirring this 'lady' may try.", "NTA\n\nA ring isn't like cattle branding, for goodness sake, it's a small symbolic thing that's become way more of a big deal than it should be. \n\nGiven your job(s) it makes total sense that you choose not to bother with a ring and I'm assuming your spouse is good with that.\n\nThis lady is upset she misconstrued your kindness as flirtation and is hitting out to hide her embarrassment.\n\nFor the record, I'm a married female and my husband doesn't wear a ring, he has one, it's too loose given weight change and neither of us think it's a big deal. \n\nIt's not the ring that makes us married, it's our behaviour.", "If it walks like a duck and talks like a duck it's a hooker", "NTA. Been married 30+ years - neither of us wear a ring very often.  It's not obligatory.", "NTA. You're fine on not wearing the ring boss - especially working with your hands. Guy at my job lost a finger bc he fell off of a rack and his ring stuck and degloved his finger. \n\nShe was harassing you. Plain and simple. And while its a derogatory word, technically you aren't wrong calling her that. And I feel had you not been pushed repeatedly, you may not have said such things. But I digress, I wouldn't have handled a situation like that very well either. It's frightening.\n\nWord of advice tho, OP! They make silicone rings that don't break easily or fall off. God forbid you have a situation like this again, or one like I mentioned above, you'll be safe. You also won't have to worry about losing them! Look up Qalo brand, theyre pretty good for whats essentially a thicc o-ring!", "I have to go with NTA. Even with that fantastic come back at the end.", "I hate to break to you dude, but if you are pouring concrete for a living you are definitely selling your body for money\n\nYTA", "Yup. YTA. Nothing wrong with not wearing a ring, but she’s right about you being a misogynist. There’s no need to call somebody names or judge what they do to make money.", "This is hilarious… you ARE the asshole, obviously, for calling your coworker “some hooker” and you know it. \nWho cares about the ring. YTA", "NTA for not wearing your ring or your comments to her. You are an AH for looking down on sex workers. As long as everyone consents and no one is being forced, who cares what people do.", "NTA. I mean, calling her a hooker isn't okay, and that part did actually make you a bit of an asshole, but mostly because of your outdated opinion on it. She's not a \"hooker\" or a \"prostitute\". She's a sex worker, and it's a perfectly fine and acceptable thing to be (If you disagree, that's fine, I literally do not care to any degree about the dissenting opinions of others on this topic) \n\nHowever, her propositioning you to make content, especially in a work environment, isn't okay. That could very well be seen as a form of sexual harassment. I'd be willing to bet she made as much of a stink about your comments partially because it was rude af to call her a hooker, but also because she was likely embarrassed by being turned down. \n\nWork on the \"hooker\" part. That shits not okay.", "Wear your ring and this wouldn’t happen to you.", "NTA So, my husband also doesn't wear a wedding ring. We've been happily married for 16 years. I know some friends who have ring tattoos on their finger instead of physical rings. The presence, or lack of, a ring doesn't prevent outside relationships. Your behavior does. And it seems you are on the right track.", "Kinda rude to call her a hooker, but NTA for not wearing your ring. When I do messy stuff where it can get lost/damaged, I don’t wear mine either. \n\nAnd man she really went from 0-60, in one conversation. Yikes. I’d report her for her asking you to film OF content (ie propositioning you) and then her reaction after.", "NTA except the last bit about being a hooker.  My husband does not find rings comfortable because he has larger knuckles than he does fingers so they don't fit quite right.  He had one but lost it in the first month and it really doesn't matter.  It's nobodies business but yours and your spouse's.", "NTA. She should’ve accepted your no and moved on. Also who runs back to a person and tells them what you said? That’s some middle school stuff right there.", "NTA. The comment was unnecessary, but I'm pretty sure her asking you to make porn with her can be counted as sexual harassment and you should take that to HR before she even goes there. \n\nThere are plenty of people who don't wear a ring to work because of the nature of their job. It can be a hazard and you simply can lose it. You don't owe her any explanations though.", "NTA. It's none of her business and she should learn to accept rejection with more grace. Not to mention, I'm surprised she's willing to bring unprofessional discussion like propositioning you for onlyfans at work when she's just started? She has really painted herself unfavourably here.", "ETH, in a way it really depends on your background and context. Hooker is a derogatory term in most situations. Sex-worker is the appropriate term. However, you may never had heard the term sex-worker. Either way, you knew you were insulting her and getting defensive. Doesn’t mean she wasn’t in the wrong for pushing you.", "NTA - I think they like to be called sex workers now 🤣🤷🏼‍♀️🤦🏼‍♀️. But as long as your wife doesn’t care it’s not any one else’s business (including hookers) 🤣💀", "NTA. Sex work is work, but you don’t just go asking a coworker at your day job if they want to make porn with you, and then get mad that they are married. My husband would have replied the same- he also doesn’t wear a ring due to it being a danger at his job.", "NTA, while calling her a hooker wasn't nice/could've been rephrased, she's TA because not only did she hit on a man she knows is married, but she also kept pushing you after your gave a perfectly reasonable explanation. While I don't think tit for tat insults is usually the way to go, she definitely instigated the insults.", "haha wait which part are you asking if YTA about? not wearing a ring or calling her a hooker? if anything, it would be the hooker part, and that's a stretch given her actions leading up to it.", "Get silicon rings. They come in packs. YTA.", "NTA, wearing a ring or not is your business and if you say you're married, you just are.  you need to be careful what you say to people on the job though.  what she asked you was actually sexual harassment and you definitely need to report her, but you said some things back to her that could also be considered sexual harassment and can get you in trouble as well.  so i hope you do it soon before she has a chance to report you for what you said back to her.  \n\n\nthat aside, you are an AH for shaming her for the type of work she does.   no matter what she does and if you agree with it or not, the context in which the word \"hooker\" was used and the attitude you had towards her was unnecessary.  regardless of what other people say in this thread, she was not \"asking for it\".  classic victim blaming.  she didn't make the words come out of your mouth, you did.  yes, she propositioned you.  doesn't give you grounds to shame or insult her.", "You became the AH at the end. Also, get a silicone band man. That ring should mean more to you given the way you talk about your family.", "NTA. It can be dangerous wearing a ring doing blue collar work since it can get caught stripping the finger or taking the finger off completely. Slightly wrong calling her a hooker (she doesn't have sex), but to the point considering she didn't back off when you stated you were married.", "NTA, but you could have avoided AH territory by not referring to her as a hooker", "ESH. She was harassing you, and you called her a hooker. You’re both the same.", "If you didn’t refer to her as a hooker you wouldn’t be the AH at all in this situation, but guess what champ you did. YTA.", "ESH\n\n\\- She's not a hooker and I can see why she thought you were flirting her based on what you said and how you acted.\n\n\\- From any perspective that isn't psychic, it will have looked like you were going one way and then aggressively in the opposite direction insulting her.\n\n\\- She shouldn't have propositioned you at your place of work.", "YTA you cant just call someone a hooker 🤦‍♂️", "\"Slut shaming\" still isn't okay. You were NTA until the last sentence. Only fans or not you were unnecessarily cruel. You could've told her off in a way that wasn't so cruel. She was also AH for sexually harassing and trying to pressure you into sex in the workplace", "NTA. Kinda AHish but that was just due to escalation and let's say for her benefit so she would understand.  I've been accused for flirting because I was polite before. I kinda feel bad for those girls because you probably been thru some things to confuse politeness with flirting.", "YTA", "what are you 90 years old?", "Man, you really went off the rails there at the end. I was with you until you decided to attack her for being a sex worker. Based on that, ESH. And you well were being misogynistic.", "YTA. Having an Onlyfans is not being a hooker. Only puritanical Americans/Religious busybodies will say otherwise.", "ESH - while I’m against work romance, I don’t think  she was an asshole for flirting/asking you out.  She was for being up only fans… that was really inappropriate… and you weren’t an asshole for not wearing a ring… but you literally called your co worker a hooker… also grossly inappropriate and rude… also having an only fans account doesn’t 100% mean she does adult stuff(tho it’s very likely) and she could’ve just been using it for an excuse, additionally if she was doing adult stuff she would’ve been a stripper, not a hooker, which is a step up and would’ve been more accurate, don’t really view this part was assholish, just pointing out you did make assumptions, and technically stripped would’ve been more accurate(she was interested in you, she didn’t ask for money…)\n\nEither way, your were both inappropriate.  I would apologize and burry the hatchet.  Your probably safe within the company, but if this escalated and she gets punished, having an employee call her a hooker is something I imagine(don’t know) could be used legally as discrimination…. Bury the hatchet and move on, don’t escalate", "YTA. You can tell someone you're not interested in their sexual advances without calling them a degrading name simply because they're a sex worker. \"Hooker\" is such a derogatory term to call someone and is really unnecessary. She was being too pushy for sure, but you can firmly say no without calling someone names.", "YTA, the ring thing is understandable, but calling you’re a coworker a hooker was uncalled for, sexist, misogynistic, and a AH move. After you laughing in her face, bragging about not getting fired, I hope you get fired.\n\nEdit: After seeing people’s POV, I’m going to change my answer to ESH. She shouldn’t have propositioned him and he shouldn’t have called her a hooker.", "YTA. You weren’t one until you called her a hooker.", "1¹1\n\nL", "I didn't like wearing rings either. I find them uncomfortable", "I got my man one of those rubber rings and he still doesn't wear it cause he just doesn't wanna take the chance of loosing it. Big time NTA I too don't wear a ring cause I will lose it and I don't even work construction, the rubber also feels weird to me.", "Defiantly NTA.  Lot’s of people don’t wear their ring because of work.  We’re not allowed to wear rings in our shop floor, so I wear a silicon one whenever I happen to wear one at work.", "NTA.  \nI would like to say you can wear a hair-tie on your ring finger.  \nNot sure if hair-tie was posted before.  Doesn’t matter if you lose it.  Saves your finger from heavy machinery.  \n\nAm a 50 year old woman who has seen many hair ties on mens fingers.  Better safe than sorry….", "I wish I wasn’t so early to this thread cuz I want an update, lmfao. I already commented my rating but damn, dude, I wonder if she stays or if she gets fired.", "NTA \nHonestly, my husband doesn't wear his ring. Just not that kinda guy. But when he does on occasion, you wouldn't believe how many women hit on him. \n\nThe ones out there who try to make themselves feel better. For example, if I can get him to cheat on her, I must be hotter than her. No you're just super slutty and insecure. Not to mention an easy lay.", "NTA over the ring. Husband doesn't wear one because he has a manual job and it's a risk of getting it snagged and ripping a finger off. I didn't wear one for many years for the same reason and now I no longer do that, I have arthritis in my fingers and can't get the ring on anyway.\n\nBut slightly the AH for being rude back. To me, you kind of lose the moral high ground if you descend to their level in that kind of environment. In a bar brawl or in private, sure. But in the workplace I'd stick to being professional and just say 'I find what you're saying is inappropriate/offensive and this conversation stops now.' Then report the behaviour if you feel it necessary.", "YTA for calling her a hooker. But not for not wearing a ring. She read too much into it and into an innocent conversation. But it doesn’t justify your over the top rude response.", "Okay, that last few sentences came out of left field, lol.  You're N T A for not wearing your ring and saying you're not trying to hook up.\n\nBut yeah, you are very much a misogynistic AH for your comments to your coworker.", "Is putting it on a necklace an option?", "NTA but everyone here will say you are because somehow selling your body is cool and acceptable now..so take it worth a grain of salt lol", "Nope, 100% right probably wouldn't have called her a hooker but you weren't wrong about doing that either given she just asked you to have sex with her without knowing you.", "You were so…so close. \n\nYTA, not for the ring, but because you called someone that does OnlyFans a hooker in a derogatory way. Come on man.", "So, uh, I might have said yes, and then showed up with my wife. Not because I'd expect it to go somewhere, but because my wife would find her outrage as funny as I would.\n\nI wouldn't have called her a hooker, because I'm aware that's kind of a slur to some sex workers, but I think a lot of people don't mean anything derogatory by it, it's just the word.\n\nI guess I'll go with NTA, but next time handle the ending a little differently maybe?", "NTA.  She straight asked you to do porn.  You were nicer than you could have been.", "Absolutely NTA, she sexually harassed you and got nasty when you declined her. I’d have said a lot more than just calling her a hooker. This is where you go to HR/your buddy and tell him exactly what happened", "You're going to get grief for calling her a hooker, but people take off their wedding rings for all sorts of reasons, especially when they can get in the way, lost, or damaged while working. You gave her a valid reason, yet she wanted to reject what you said. Her problem, not yours. NTA.", "I think you should’ve took the high road and not said that last bit to her BUT you are def NTA. \n\nI don’t often wear my wedding ring and I love it and my husband very much. But I badly banged up the first one I had after wearing it 24/7 for like 8 years so when he surprised me with a replacement ring, I only wear it when going out or something. So I completely get not wanting to wear it.\n\nAlso her logic makes no sense because there are many people in committed relationships where they don’t wear a ring, and they’re not “trying to appear single.”\n\nGet ahead of this though and tell your boss and wife what happened just in case she tries to go through with her threat.", "ESH and you may have put yourself in a compromising position  where you may lose that job", "NTA, she was being pushy and inappropriate at the workplace", "I also don't wear a ring despite being married because I too work with my hands and it's a major safety issue. Do a google image search for degloving if you wanna see the potential danger it poses. I wouldn't have made the hooker comment myself but I completely support your position. NTA imo.", "Jees\n\nNTA\n\nI was a mechanic. The number of times my wedding ring got caught (trapping my hand) is ridiculous, though when I shorted out a car battery with my ring changed my mind. I even told my wife, \"That not gonna happen again.\" She understood.\n\nThe rings are *your* pledge to *your* wife and *her* pledge to *you*.  I never took it as a flag for other people to back off.\n\nI have my own brand of stupid. It doesn't require other people", "NTA that was an extremely inappropriate thing to ask a coworker, weather you wear a ring or not doesn't give her a pass to make people at work uncomfortable. You could easily file a sexual harassment claim.", "ESH\n\nIt's fine to not wear a ring. Neither my wife nor I wear one.\n\nIt seems to me that she was just embarrassed that she put herself out there and you had to shut her down so she's blaming her feelings on your lack of a ring.\n\nI was going to say, \"No Assholes Here\" but then I read:\n\n>She screamed and called me a misogynistic pig and said she will get me fire\n\nWell, *that's* not cool. She's TA. So then I was writing NTA, but then I read:  \n\n\n>I laughed and said you selling you body for money, back in my day, they had a name for those, they are hookers\n\nJesus Christ. You were doing so well, but then you had to go and keep talking. What an asshole. Everyone sucks here.", "NTA\n\nThere are many reasons not to wear a wedding ring, and if your job involves machinery, like mine, to wear a ring is to lose the ring or finger. She doesn't get to critique your decision there. If it's okay with your partner, it's okay.\n\nI think calling her a hooker was going too far, but she was insulting about the lack of ring, so soft pass on that", "NTA your comment was harsh about her being a \"hooker\" and you WOULD HAVE been TA had u said that under any other circumstance..... \n\n......BUT she literally asked you to make \"CoNtEnT\" at WORK. That is harassment, report that shit to HR. \n\nAnyone in the sex-work industry will tell you that they would NEVER do that in a job setting. They would seek out other people in more appropriate areas and are respectful, as they want to be treated respectfully as well. So yeah, you are NTA because what she said was incredibly unprofessional. Your response may have been rude but it was acceptable given that she asked you to literally film a video out of the blue AT WORK.", "Kerb crawlers get done without physical contact so that’s obviously not the “line”. They should say the payment is for sexual counselling and the sex is free pity sex.", "NTA ,\nTbh honest nah man she should have understood when you said no for the content for her OF and should have not tried to verbally force you to \"hook up\" so yeah you're good", "ESH - Hooker is a derogatory and misogynistic term for sex workers. There shouldn't be any shame in sex work for any gender. She's an AH for making assumptions about your relationship status, making assumptions about your comfort with sex work, and threatening to get you fired. She should have explained that the term hooker is out-dated and offensive. If you kept on being an ignorant bigot after that, then you'd be even more of an AH than just a possibility ignorant one.", "YTA. Your clear implication that you’ve enjoyed staring at her during virtual meetings and calling her a hooker are just gross dude.", "ESH. Her invitation was totally out of line for a work environment. Her opinions about you not wearing a ring were irrelevant and should have been kept to herself; it's none of her business. Your comments about her only fans were inexcusable.", "NTA. My husband never wears his wedding band unless it’s a special date, and even then it’s 50% because he forgets.", "My folks were highschool sweethearts and are getting pretty close to 50 years... I don't think either one of then knows where their wedding rings are nor cares but they are still going strong.", "NTA about the ring thing but BIG-TIME YTA for the way you spoke to that woman. Sheesh...", "NTA, and I agree with you, the truth hurts.", "NTA, but get some silicone wedding bands. They are relatively cheap and easy to replace. I stopped wearing my engagement ring and wedding band while pregnant because of swelling, and I still don’t wear them most of the time because I don’t want to cut my babies. I have a thin silicone ring that looks similar to metallic gold. \n\nMy husband has been wearing a silicone wedding band for years because he renovated our house on his own and didn’t want to get his finger cut or pinched off.", "NTA", "NTA. You were being sexually harassed by a co-worker and responded harshly. It was a little over the top calling her a hooker. I would suggest getting ahead of the game by going to HR. She came to you, attempted to get you to engage in sexual activity, then got pissed when you turned her down. She's already threatened to get you fired and you should take that seriously.", "Wow, you floored that accelerator in the last act. YTA.", "NTA. Maybe you should not  have called her hooker, but other than that, not an AH. Not wearing a ring means nothing if it's open, has a reason and you are talking about your family and tell that you are married. This woman shouldn't have said anything after you refused and told her you are married. That should've been clear enough a message that you definitely are not trying to hook up with her.", "ESH you did take it to a misogynistic place but she was also incredibly inappropriate. \nMaybe it's time to consider a tattoo ring.", "Well if you think about it, it is exactly what she does. Selling her body for money. She may not sleep with (every) man there, but essentialy she is a hooker without the sex. I'm not saying that in a bad way, I have a high respect for everyone who has the courage to do what she does. \n\nAnd you are wildly overlooking the fact that she heard from SOMEONE ELSE that he said that he hopes she finds a good one next and thought it was okay to WALK OVER AND AFTER LIKE TWO SENTENCES ASK IF HE WOULD BE FILMING CONTENT FOR HER OF!! If the roles were reversed everyone would be screaming sexual assult. Even if he wasn't married, thats NEVER a thing you ask in a casual talk AT WORK!! She is the biggest AH here, his response maybe wasn't the best in that situation, but for me he is NTA.", "TIL - \"come back to my place and make content\" is the new \"come back to my place and check out my etchings.\"", "Nope, that makes it an ESH situation. He still could have taken the high road and just brushed her off. She's still a colleague and escalating it like that messes up working relations. That hurts all your colleagues as well.", "Should really be ESH", "Yeah it's not every day someone gets asked to film a porno and then get mad bc they got called a hooker when they didn't back off after the polite rejection. This is wild.", "Generally people will jump to defend behaviors that they themselves participate in. I've been on reddit for too long and too often, I see it over and over. Highly liberal spaces that preach love and acceptance (worthy ideals) but as soon as someone from one of the \"out-groups\" messes up, they all turn into massive hypocrites ie body shaming, racism, sexism, hate speech, etc. Reddit is a very poor representation of the average person.", "So you think that if a gay person (such as myself) hits on someone in an inappropriate way, that it's okay to call them the word that British people use for cigarettes?", "I hope they heed that advice. He is now in a vulnerable place and can not trust her.", "Agreed, get ahead of the game before she goes to HR.", "Is “hooker” some kind of slur? I thought it had basically the same connotations as “prostitute,” just a little less formal.", "I mean, that's exactly why some people are also calling him an AH here: the wording... He was NTA until the last few sentences... then it became an easy ESH...", "100% this, as it is still #BelieveAllWomen", "Safe bet to say she won't get fired either.", ">I laughed and said you selling you body for money, back in my day, they had a name for those, they are hookers.\n\nNot trying to defend her, but he absolutely called her a hooker.", "This is a stupid take", "Theirs this weird double standard on this driven by thirst imo.\n\n\nYes most sex workers dislike the term hooker but that is the colloquial term used by most older Americans when referring to sex workers. But the stereotype of a hooker is a man or woman who proposes another for sex (stereotypically unsolicited but often not) and are extremely persistent when told no. \"River,\" did everything in the book that fits your textbook definition for said older generations. \n\n\nMost importantly Op didn't give a shit till she pushed the issue. if she asked once and backed off but he continued to berate her OP would definitely be TA. But she actively tried to cause problems and got offended when after OP returned fire by informing her that her behavior was just like the lable she detests.\n\nOP while not 100% NTA as he should have just told her to screw off or he'd report her, is still NTA because she decided to provoke the bear, she can't cry when she gets mocked and derided when she instigated", "[removed]", "bro she asked if he wants to film with her, its pretty obviously a proposition for sex, if that wasnt said it would be ESH but since it was there is no way he is the AH", "[removed]", "[removed]", "[removed]", "She was doing sex was she was acting like a prostitute or you entirely missed where she told him to join in a video and what will she get from that video intercourse and money which is basically a job profile of what really \nA prostitute", "Oh shut up. Having an only fans is fine. Randomly asking a coworker who has expressed no interest in you to participate in said onlyfans is unacceptable sexual harassment. Then she didn’t accept his polite no and kept pushing. So how long does he have to be polite for? Would she be expected to show him the same courtesy or would you be chastising a woman just as much for calling a man a disgusting pig?", "For real ESH.Obviouslt what she did was sexual harrassment . At the end of the day calling someone you work with a hooker is inappropriate and unprofessional regardless of the context. Two wrongs don't make a right it's not hard to comprehend.", "Loving then doesnt mean he doesn't want them to repent lol (and all of us)", "Exactly!", "She asked him to make porn with her. While very harsh, he didn't make that comment simply because she has an of.\n\nShe started hitting on him at work. \n\nAnd tried to convince him to do porn with her.\n\nRefused to take no, or even I'm married, as an answer.\n\nThen even threatened to try to get him fired.\n\nExplain to me how op is an ah for not being able to put up with that?", "She is a hooker,  she has sex with people and let's people watch her having sex and doing sexual activities for money. If you go to a red-light district the women and men do the EXACT same activities and get called hookers.... because that's what it is lol Sure I get that her feelings where hurt, but let's be real here, he called a spade a spade, and only after she pushed and wouldn't take no for an answer. Personally I have seen countless women end up being rude or mean to men who can't take no for an answer and not a single person bats an eye.", "Stop this bias, she is a sex worker, who harassed this man at the workplace, if roles were reversed, you wouldn’t find the woman who was offered to star in porn an asshole.", "\\> That’s not work appropriate behavior\n\nSo if someone is sexually harassing you at your place of employment, you're obligated to treat them professionally and politely because it's at your place of employment?\n\nImagine writing this if OP was a woman being harassed by her male colleague. Somehow, you're not even in this story and you're TA. Impressive", "She sexually harassed him! It's ESH at worst.", "So wait. Reverse the roles here. Man walks up to a woman not wearing a ring. Man asks to film porn together. Woman says no i'm married. Man keeps pushing and calling her a liar. \n\nI bet the guy would be insulted for way more than a hooker, no?\n\nIf she doesn't want to take no for an answer, then yes, she's getting insulted. He didn't immediately insult her. He gave her plenty of chances to stop asking him to film porn together.", "If I ask a female coworker to fuck me for money, on camera, AND ignore her saying no.... how is she an asshole for calling me a pig?", ">However your comments are horrible and unnecessary cruel. And there is no excuse for that.\n\nSuuure we must be polite with harrasers, we can hurt their feelings! This guy must apologise! lol", "\\> How could you not be?\n\n\"You were just being sexually harassed by a coworker, why weren't you more polite?\"\n\nLet's see, what's worse:\n\n* sexual harassment, not taking no for an answer\n* saying something rude to your harasser\n\nPeople who answer ESH are humungous misandrists unable to hold women to task for their morality. Somehow, you jumped that bar and wrote \"YTA\", which must make you completely incapable of reasoning.", "Because of this bit right here:\n\n> she asked do you want to record some content later", "You getting down voted for this reminds me of that meme, \"they hated Jesus because He told them the truth\"", "> \"back in my day\"? I'm older than you and I know this is bullshit.\n\nYou're right, people who have sex for money are still called that today. The \"back in my day\" wasn't needed", "She asked him to make porn. Did you miss that part?", "She tried to get him to make friggin porn with her.", "And she should not have sexually harassed him at work, much less so after he stated he was married.\n\nOP is NTA; rude words do not outweigh blatant sexual harassment.", "She sexually harassed him.", "“AITA for calling a female coworker a hooker after she sexually harassed me?” Fixed the title for you. NTA", "So sexual harassment is okay in the workplace?", "Did you skip this part:\n\n> she asked do you want to record some content later", "She *asked him to make porn*.", "Sexual harassment is sexual harassment.", "yeah honestly calling her a hooker is basically what she was to OP. She wanted to have sex with him in order to get paid, even if it wasn't by OP.", "She also deserves to be F I R E D, for the sexual harassment.", "I disagree. She's heartbroken, and people do all sorts of stupid things when they're heart broken. They're not thinking straight. But sure, let's call it sexual harassment for sake of argument here. And be real guys, it's far less threatening when it's a woman. \n\nHe's still TA for shaming sex work. \"Some hooker.\" Yes, she does make money the way she makes it, but let's not be naive, we all know he meant it in a derogatory way. Also, \"Yeah that would be a deal breaker for me...\" Not the right time to say it, man. Go back to your loving family and stfu.  \n\n\np.s: I am not one.", ">What he said was basically factual. \n\nNo it wasn't.", "And he harassed her back. What she did was absolutely wrong, but his way of shutting it down was not appropriate for a workplace, either.", "The appropriate response is not to escalate the situation.", "she should stop when he said \"no\". No explanation necessary.", "Actually regardless of gender her behaviour was completely unacceptable, and inappropriate. However that doesn't change the fact that the second you start using slurs that are used to degrade an oppressed community, you are an AH. \n\nLike for example if I were to do something inappropriate at work, and someone else called me out for it, they'd 100% be in the right. However if they also started attacking me for being queer, or mixed race, instead of just saying my behavior was unacceptable, and reporting it, then they are also doing something that is unacceptable.\n\nThere are a million ways to insult people who deserve it. Using slurs that are attributed to marginalization of an oppressed demographic is never acceptable no matter what someone has done, and yes sex workers are all extremely marginalized, exploited, and oppressed demographic.", "She simply asked why he wasn’t wearing a ring. She didn’t tell him he needed to have sex with her because he wasn’t wearing a ring", ">She insulted him, she deserves be insulted too.\n\nHalf agree.\n\nI agree that she acted very rudely and should face the consequences.\n\nBut I don't agree that insults are an appropriate way to respond because a) they fail to actually address the crux of the problem b) they expose the OP to potential accusations of discrimination.\n\nThe high road is to say \"no\" and then take whatever steps are necessary to protect your boundaries such a reporting the incident to HR.\n\nThe less-high road is to insult her for things that are actually worthy of disdain ie. \"You are so insecure that you can't handle a guy rejecting you. Even if I was single I wouldn't be interested because of your shit personality.\"\n\nInstead the OP chose to insult her for being a sex worker. By choosing to use \"hooker\" as an insult the OP isn't just insulting his co-worker (who might deserve it). He is also supporting the notion that being a sex worker is something shameful and contemptful in general. His choice of insult attacks *every* sex worker, not just the person who was rude to him.\n\nOne person being an AH does not make it okay to insult an entire group:\n\n* If a fat person is rude to you that doesn't make it okay to call them a pig\n* If a woman says something mean to you don't get a free pass to say she belongs in the kitchen\n* If a gay guy is being a dick and you call him the F-word then you are *also* an AH", "So, you're saying 2 wrongs do make a right.", "Yes.. he’s definitely NTA and really should try to report her for sexual harassment to the HR", ">Selling her body for money. She may not sleep with (every man but essentialy she is a hooker without the sex.\n\nThe same could be said of someone pouring concrete for a living", "Yeah just say no thanks and take that shit as a compliment.", "She went the sexual harassment route and then she went the hostile work environment route and then he responded in kind. Miss me with this bullshit. It got hostile the second she wouldn’t take no for an answer and then attacked him for not wearing a ring", "Yeah, reading the title I thought this was gonna be about his partner being upset that he isn’t wearing it, but it was a coworker who wrongly assumed and then got offended when they were rejected.", "And if you do get hit on because you aren't wearing a ring, 99% of people will just say \"Oh, sorry!\" or something similar (\"Ope\" if you're in the midwest lol) and that's the end of it.", "How dare you criticize sex work! Everyone doing sex work gets 10 free passes a day to be a piece of trash! My obvious overcorrection towards covering up my own bias towards this type of person is irrelevant and YOU'RE THE BAD PERSON, NOT ME!  \n\n\nThere, I brought the Average Reddit Response to you so you didn't have to wait :)", "no, only did so after being called a misogynist pig. She took offence first, clearly identifying as such. She should have backed off at the first no.\n\nAttempt to mess with a married man and she found out to leave him alone.", "[removed]", "So you also think it's okay to call LGBTQIA2S people like myself, the word that the Brits use for cigarettes?", "All the weirdo redditors came out for this post oh me oh my lmao", "Yeah exactly,  people love to say this, he loved them as people but wanted them to change their path 😅", "Only conscious person in this thread, 😙🤌.", "Sickening. Love the sinner not the sin. Jesus loves EVERYONE but it doesn’t mean he loves what they are doing. The Bible is plenty clear about this kind of stuff", "Especially concrete labor, Jesus that fucks up your back and knees", "Roles reversed, both AHs", ">So if someone is sexually harassing you at your place of employment, you're obligated to treat them professionally and politely because it's at your place of employment?\n\nYes. You go to HR. You don't harrass them back.", "Professionally, yes. Politely, no. You can walk away mid-sentence. It’s not polite but it’s a professional way to handle it.", "Kinda not.", "It's a derogatory term", "So there is a point in a conversation where it is reasonable to become an ass? And just because she was willing to film porn (not my cup of tea, but to each their own) doesn't make her a prostitute.", "Ok, first, nowhere in this post was anything about anyone getting paid. Second, she asked what may have been pushy questions, all very true, but he turned vicious and nasty.", "Imagine telling a woman who was the victim of sexual harassment she was an asshole for not being polite here.", "Thank you! So much babying going around to support the harasser", "Dude would lose his job before the lady even finished her complaint.", "I wasn't commenting on HER ... she may have thought he was into her -- I didn't get that it would be FILMED AT WORK. If that is the case then ESH. But as I read it, the issues were the ring (NAH) and the fact tht he called her a hooker for being on Onlyfans.", "that's actually the point I'm missing in this discussion. All this pseudo-sex work-positive comments and yet so offended that he called her a sex worker. ok, hooker might be a slur by now but still...", "I keep wondering if she was going to pay him because otherwise it's also exploitation. She specifically said content so she would be making money of his body too.", "Okay, and ? If someone asks me to see a horror movie I can just say “sorry, I don’t do horror movies” without diving into “all horror fans are bloody psychotic idiots”.", "Calling her a hooker is also sexual harassment. After reading the comments and seeing their point of view, I’d say ESH, she shouldn’t have propositioned at the workplace and he still shouldn’t have slut shamed her for it. Two wrongs don’t make a right.", "Nope.", "And then he insulted her and called her a hooker.  \nShe invited him to do something she thought he'd enjoy and he called her names as a result.  \n\n\nNaw, he's an asshole.", "Technically that's doing porn, not being a hooker...", "If a man was heartbroken and harassed a married woman asking to film content together while calling her a liar, he'd be called much worse than a hooker.", "Wow so you can sexually harass someone after a break up? I don't think so. That can get you fired no matter what relationship status you are", "If a dude was heartbroken and asked a woman at work to fuck on camera would you be saying the same thing?", "Lmaoo.\nBeing upset about a breakup isn't a free pass to proposition a coworker to make pornographic content and sell it for money, sorry. I think if someone does that, they've opened the door to be called a hooker", "not being able to control your emotions is not an excuse for sexual harassment…", "\"She's not thinking straight but sure, let's call it sexual harassment\"\n\nHer not thinking straight doesn't mean blatant sexual harassment is not sexual harassment. It's not just sexual harassment for the \"sake of argument\" - it's sexual harassment, period.\n\nYou're doing the thing where you give a woman a pass on bad behaviour simply because the **victim** called her a name.\n\nOP is NTA.", "I’m sorry don’t get me wrong he shouldn’t make fun of her or degrade her for that but at the same time she assumed something and then pushed and when he told her no and his reason she decided to insult him. He should of been the more mature one but he defended himself. If the tables were flipped people would be screaming for him to at the minimum get fired. \n\nNTA", "Not all sex work is prostitution. Prostitution is banned, while stripping is not in a lot of places, for example. The same for making porn, nude/fetish modeling, phone sex etc.\n\nI think the line is sexual PHYSICAL contact.", "So in your eyes, all of the Playboy models and people who appeared in nude magazines have been prostitutes?", "That isn’t true in the slightest. You need to look up what prostitution is.", "If he's pouring concrete for a living he's definitely selling his body for money.", "It's not true. Grow up.", "T H I S", "If someone sexually harasses you, you have every right to insult them. Don't make this some sort of attack on sex workers. He said it to this one woman after she *PROPOSITIONED HIM FOR SEX FOR HER OF*, people need to stop equating insulting 1 person to insulting an entire group unilaterally.", ">\"You are so insecure that you can't handle a guy rejecting you. Even if I was single I wouldn't be interested because of your shit personality.\"\n\n**THIS** ⬆️.  \nwould have been a much better & appropriate response.", "If you don't want to be called a hooker maybe sex work isn't the ideal field for you.", "He don't need to be polite to her.. she insulted him\n\nhe only said he doesn't want to hook up with some hooker, which is specifically telling her is a hooker... and this is actually truth.. she is a virtual hooker..", "Agree completely! Well said. This woman was sexually harassing OP and generally horrible but there was no need to use hooker as an insult.", "Wonder what the hot takes would be if it was a male coworker doing online sex work asking a female coworker to \"film some content\" and not taking no well.", "He was sexually harassed in the work place, not hit on. She asked him to make porn while at work which is completely unacceptable. She is a creep.", "Lol yes. Why is this a hill most these people will die on? So weird", "Agreed. But he did call her a hooker.", "Yeah you can be a victim of sexual harassment and be misogynistic at the same time. But this isn't that, she harassed him and then tried to threaten his job. He was clearly uncomfortable and was nothing but a good person and pleasant until she asked him if he wanted to record some sexual acts with her. He said that he was married and wasn't interested, she said that he was asking for it because he wasn't wearing a ring and then he called her a hooker. It seems that he had a lot of patience in this situation and finally had enough.", "What part of that is misogyny? He was not showing contempt for her because she was a woman. The guy was calling it like it is after being propositioned and declining her request. Also, there are male hookers.", "[removed]", "[removed]", ">repeatedly\n\nMan you're really stretching the definition of that to prove an inaccurate point, eh?", "What did you want him to do? Be nice? It wasn’t misogynistic, he didn’t say anything bad about her or SW until she tried to force it upon him. Being called a hooked should be the least of her worries when she needs to go look for another job", "[removed]", "[removed]", "i don't think it was misogynistic as much as it was shaming and insulting.  which is just as bad, IMO.  using the word hooker wasn't technically wrong, but he meant it as an insult.", "Sex work is a choice.\n\nHow far do you really want to go on this comparison?", "Moving the goalposts, I see. \n\nAgain, she has chosen a career in sex work. Like a hooker. So, it was an accurate phrase to use.\n\nWhy are you equating LGT+ folk to sex workers?", "Well in your example, the slur you’re referring to is not a profession. Terrible example that doesn’t equate at all.", "What chapter and verse did he ask them to stop?", "This church doesn't follow the bible, like many other religions.", "I'm sorry but harassment implies op is going out of his way to shame her. \n\nPeople say shit when people refuse to step off and I'll call bullshit on anyone that tries to claim they've never retaliated by verbally shitting back on someone pissing them off... especially in a case like this.", "She's not willing, she already does film porn. On her only fans. Which people pay money to see? Selling your body for money is literally the definition of prostitution. (I personally do not give a damn if you are or not, i don't judge. You do you) but she is a prostitute.\n\nAnd yes you can become an ass if that's what it takes to make people stop annoying you after giving them multiple outs without being an ass. No matter what gender you are.", "Sh wanted to make content fir her OF. That absolutely means money. She tried to pressure a married person that said no into committing sexual acts. NO MEANS NO. You NEVER ask more than once. Even the first time is a bit pushy with a stranger.", "> ok, hooker might be a slur by now\n\nThat is fully the crux of the issue & the one and only reason he is getting Y T A and E S H responses", "He didn't say that though? What do you call someone who does sexual stuff for money?", "It's okay that she sexually harassed him? Is that what you're saying?", "Same difference. It's having sex in exchange for money. One is filmed the other isn't. Doesn't change the nature of the job.", "Yeah but honestly being a hooker is better than an onlyfans girl that shit is on the internet forever. Better a couple dozen guys vs all of the internet.", "And she proposed that he make content with her which would be crossing that line.", "Technically not! Anyone who *sells* nude content. It appears they're more calling Hugh Heffner a prostitute. And any online retailer that stocks any magazines with nudity in them.\n\nAlso online biology and art courses. Prostitutes, the lot of them. Nude content all over the gaff. For *sale*! \n\nShameful;\n\nhttps://www.posterlounge.ie/p/531296.html?gclid=CjwKCAjwrdmhBhBBEiwA4Hx5g53R1OaLO6pdhCWUoMI4Cm2yuNKpwAuV0nfbJfUj02hX-mRDyLUbVxoC1OAQAvD_BwE", "Yes", "Yes", "Yes", "The literal definition of prostitution is \"the practice or occupation of engaging in sexual activity with someone for payment.\"\n\nSome people differentiate between partnered, non-partnered or actual physical contact but the definition doesn't change.", "Its true..\n\nShe is contributing with a industry that makes people addicted and make a lot of women unhappy with sexual abuse..\n\nThis makes her a virtual prostitute.", "1) This not equivalent because \"accountant\" is not a pejorative with a history steeped in misogyny to dehumanize women and doesnt scale. Youre a math nerd, you should understand this (See what I did there?) 2) Ask yourself Is it rude for someone to call you a \"just a bean counter\" or \"a math nerd\"? (Yes, it fucking is.) Because that is about as close as it gets to dehumanizing your profession in the same way, except maybe calling you a clueless dork or a calculator monkey, but all of them are far less used as a pejorative nor are they as socially charged. So on a scale of 1 to 10, you being called a bean counter is like, a 3 for rudeness, but calling any woman, sex worker or not, a hooker is generally considered about a 7 or 8 for rude/dehumanizing behavior.\n\nI hope I matched your level of condescension and maybe only slightly surpassed it, because your pedantic argument was flawed and you should know better, everyone should know better.", "[deleted]", "[deleted]", "[removed]", "[removed]", "[removed]", "She kept pressuring and judging him. Insults were justified.", "Nope, not moving the goalpost. Just pointing out that the slurs that he used are rooted in misogyny, and systemic oppression, and that if you default to that tactic for ANY reason, with ANY marginalized demographic, then you are an AH.\n\nAs to your question, I'm not equating my community to sex workers. I'm saying that both communities are equally marginalized, and that punching down at ANY marginalized community for ANY reason, makes you 100% an AH.", "So you're telling a queer person that they don't get to say if *their* lived experience applies to an issue of marginalization? 🤣 \n\nThat's a bold strategy I'll give you that. Even if all it does is prove that you have no idea what you're talking about. \n\nThe issue of the marginalization of sex workers isn't an issue of profession sweetie. It's an issue if the systemic marginalization of women, and queer people. As we're the demographic that comprises over 98% of the sex work industry. \n\nMaybe actually educate yourself before you embarrass yourself by weighing in on a conversation about a subject you clearly have no knowledge or understanding of.", "He tells prostitutes \"your sins are forgiven\" \" go and sin no more\" and prostitution is described as a sin in the Bible. Jesus loved all and he didn't discriminate and forgave all who wanted to be forgiven but that does not mean that all those things were not sins as they still are. Plenty of this information on google, type it in there", "Oh I see. I was pretty sure we were talking about the Abrahamic god like all the other replies in this thread", "She asked three questions. Was she being pushy? Yes, but it is equally reasonable to think she was embarrassed to have read the situation incorrectly. He could have done what women have had to do for decades, walk away.", "I agree. She should have accepted the no. I just don't think 3 questions justifys turning nasty.", "I don't agree with you. People are offended that he pointed out she is a sex worker not that he called her a hooker. There are no comments about \"how could you use that word\" (as if he used n-word or other slur), they're calling him misogynistic because he commented on her profession. But if we're sex work-positive then commenting on it is not shameful so nah, I see a bunch of hypocrites.", "A sex worker, an escort or an adult performer. I personally wouldn't call them a borderline slur but that's just me", "It's okay that she asked him out ONCE. The specifics depend on his comfort level.", "Technically not true, he wouldn't be paying her, other people would be paying to watch both of them. It would basically be amateur porn with two actors. I doubt she would share the money with him at all if he he had agreed.", "It wouldn't be prostitution because he wouldn't be her client he would be her costar in the production of pornography", "Yup. This is also where I'm standing.", "So what is the activity you’re engaging in “with” somebody who isn’t anywhere near you? By your interpretation, somebody who writes erotica is a prostitute. A person who works in a factory manufacturing dildos or somebody who sells condoms is a prostitute.", "[removed]", "[removed]", "Even if people don’t agree on the semantics of that term hooker, using that word doesn’t make someone a misogynistic pig.", "[removed]", "[removed]", "[removed]", "[deleted]", "If you read the OP you can tell the intention of the comment from the tone of the OP... Pretty obvious. There is of course a chance that OP actually expressed himself in a non insulting manner, and in that case my guy needs to review literary devices.\nAnd yeah hookers can be any gender... Idk how does that relate to the issue. But thanks tho.", "For any reason? Like being pressured into taking part in a sex tape by a new co worker doesn't justify harsh language?", "Calling people a liar but posing it as a question is not a real question. It's insulting especially if you're telling the truth. \n\nIf someone told me they were married after i assumed they weren't and i was embarrassed, i would say i was sorry. Not call them a liar and question them. Being embarrassed doesn't give you an excuse. And i know quite well how being embarrassed feels. Doesnt mean i get to lash out at people.", "Well, considering the subject matter, and the fact that only ONE NO is needed, I disagree.  And so does pretty much everyone else.\n\nBesides, she is a hooker, so it was true. It's only nasty if SHE thinks so. And if she thinks being called a hooker is nasty, she should stop hooking.\n\nFor the record, I don't think hookers are nasty. But I am single, and a perv.", "So by that logic, it's okay for a dude to ask a lady to make pornography while at work?", "I think an outsized response when a coworker invites you to be a sex work is warranted.", "Well actually it would be co-prostitution because she would get paid with his assistance.", "You got all high and mighty trying to correct someone's take on what constitutes prostitution - you asked for a definition, I gave it. \n\nPer the Encyclopedia Britannica \"prostitution, the practice of engaging in relatively indiscriminate sexual activity, in general with someone who is not a spouse or a friend, in exchange for immediate payment in money or other valuables.\"\n\nLol Factory work, writing and selling commercial products are not sexual activity. Let us consult the dictionary and encyclopedia again...Per the Encyclopedia Britannica \"human sexual activity, any activity—solitary, between two persons, or in a group—that induces sexual arousal.\" Therefore any of the activities you noted as examples do not qualify because for they do not generally include arousal. \n\n100% pornography encompasses the deinfition of both prostitution and sexual activity.", "She is selling adult content to clients.. She is using HER BODY to sell content to other people..\n\nSo yes, she is a prostitute.. She make money using her body to please men.. Don't matter if she doesn't actually do it personally.", "[removed]", "A concrete laborer", "[removed]", "A sex worker.", "[removed]", "A hooker", "Anyone who works, especially a physical job. If you don't think construction workers and athletes aren't selling their bodies for money then you're gonna be super surprised", "There is nothing wrong with being a sex worker, and your right that her propositioning a coworker is unbelievably effed up, unacceptable, inappropriate, and inexcusable. However the words he used are ones that are slurs against sex workers, just like the British word for cigarettes is a slur against LGBTQIA2S people. \n\nThere are a million ways he could have responded to that and literally hundreds of insults, and comments he could have made that aren't rooted in misogyny, and the oppression of sex workers, but he chose to punch down, instead. That makes him an AH, and if you think using systemic slurs against anyone, for any reason is acceptable, then you're an AH too.", "Sure, even if his tone was not good, the point of contention here is that he is being labeled as a misogynist pig. Calling someone a hooker is not misogynistic.", "Was there something about my clearly written English that is confusing you in some way? \n\nYou NEVER have ANY excuse to use prejudicial slurs against ANY marginalized community for ANY reason. \n\nYou never get to call POC racial slurs no matter what they have done.\n\nYou never get to call Trans people transphobic slurs, dead name, or misgender them for any reason no matter what they've done.\n\nYou never get to call queer people homophobic slurs no matter what they've done.\n\nYou never get to resort to body shaming people no matter what they've done. \n\nYou never get to slut shame people no matter what they've done.\n\nYou never get to call people misogynistic slurs no matter what they've done. \n\nYou never get to slut shame, or use degrading slurs against sex workers no matter what they've done.\n\nPeriod.\n\nThere are absolutely zero exceptions to ANY of the aforementioned examples. If you think that there is EVER an excuse to use language, and slurs that are rooted in the systemic oppression of a marginalized community, then you are an AH. Always.", "Lmao", "Construction workers? Farmers?", "I said a couple comments ago that it absolutely can be reported, but only NEEDS to depending on the other person's comfort level. Insulting a coworker by calling them a hooker doesn't have the same potential gray zone. I've been asked to hook up by a coworker and it went fine.", "If you say so. I didn’t ask for a definition. I know what it is. You are obsessed with manipulating and misinterpreting said definition to meet the needs of your bias. \nShow me a legal cases where somebody making pornography has been charged with prostitution. It is WIDELY accepted that performing in pornography is NOT prostitution, which is why creating pornography is legal and selling it is not aiding in prostitution or pimping. Stripping is not considered prostitution. Phone sex is not considered prostitution. \nAnd seriously, you’re now saying that anything a person does that generates sexual stimulation is prostitution? Seeing an rmt might be considered prostitution then. Doctors visits can be sexually stimulating. Some women orgasm during child birth. Haul them away! And let’s not even start of film! My god. Everybody involved in movies like basic instinct, fast times at ridgemont high-all prostitutes!", "Come on. Everybody makes money using their body. The guy pouring concrete does too. All sports professionals do. Acrobats, clowns, dancers. All prostitutes. \nYou don’t respect or like what she does so you’ve labelled her “bad”. You’re wrong.  And equally misogynist. I guarantee you wouldn’t call a chippendales dancer or a make bodybuilder or a firefighter who makes a suggestive calendar a prostitute.", "Being black or gay is not the same as choosing to be a sex worker.", "[removed]", "All of those people do not engage in SEXUAL activity for payment. Just because you don't like what a dictionary says doesn't make anyone wrong. May want to check up your reading comprehension, there are two elements to the definition of prostitution:\n                       1) payment\n                       2) engaging in sexual activity \nChildbirth is not a sexual activity and the woman generally does not receive payment for having her baby. \n\nJust because you can't accept FACTS it doesn't make the world work differently. Most people on this comment thread have already said they agree with the factual definition of prostitution as it extends to porn stars, strippers and yes hookers. Unless you are a lawyer please do not cite legal definition references as legal definition structurings are significantly based on criminal and civil codes and penalties of violation, if you cannot interpret a dictionary you have no business interpreting legal definitions and requesting case citings you won't understand. \n\nNo one in the above comment thread said she was a bad person for being a prostitute, just that she is a prostitute. If you equate prostitutes as bad people then I think that's your own bias coming through.", "[Prostitution definition:](https://www.google.ca/search?q=prostitution+definition&biw=390&bih=664&sxsrf=APwXEdef-73XTv_OWNjR6r4UX5Jlm4pH4w%3A1681337974383&ei=di43ZLD4FvOoptQP0_-MuAE&oq=prostitutio&gs_lcp=ChNtb2JpbGUtZ3dzLXdpei1zZXJwEAEYADINCAAQigUQkQIQRhD5ATIOCAAQigUQsQMQgwEQkQIyCAgAEIoFEJECMggIABCKBRCRAjIFCAAQgAQyBQgAEIAEMgUIABCABDIFCAAQgAQ6CggAEEcQ1gQQsAM6CggAEIoFELADEEM6CQgjECcQRhD5AToHCAAQigUQQzoKCAAQgAQQFBCHAkoECEEYAFCMEliYT2DqWGgBcAB4AIABhgKIAdkMkgEGMC4xMC4xmAEAoAEByAERwAEB&sclient=mobile-gws-wiz-serp) “the practice or occupation of engaging in sexual activity with someone for payment.”\n\n\n[Prostitute definition:](https://www.google.ca/search?q=prostitute+meaning&biw=390&bih=664&sxsrf=APwXEdexJnbW4uT0xSrseOesiFmN08OVTQ%3A1681337987472&ei=gy43ZL-wHO6mptQPwom92AI&oq=prostit&gs_lcp=ChNtb2JpbGUtZ3dzLXdpei1zZXJwEAEYATIJCCMQJxBGEPkBMgQIIxAnMgUIABCABDIKCAAQgAQQFBCHAjIFCAAQgAQyBQgAEIAEOgoIABBHENYEELADOgoIABCKBRCwAxBDOg4IABCKBRCxAxCDARCRAjoICAAQigUQkQJKBAhBGABQmBBYgydg5jJoAXAAeACAAbQBiAHwEJIBBDAuMTaYAQCgAQHIARHAAQE&sclient=mobile-gws-wiz-serp) “a person, in particular a woman, who engages in sexual activity for payment.”\n\nIf looked at both definitions from the dictionary OP didn’t say anything wrong as she clearly wanted him for content.", "NTA, I was married to my husband for 49 years. He never had a wedding ring and I stopped wearing my rings when I got pregnant, they were too small. We BOTH knew we were married,  so stop using the piss-poor excuse that no ring makes you look like your looking for hookups.", "Is the response you’re seeking that you are NOT misogynistic and shitty?\n\nThat would have to be true for you to get that response.\n\nAnd it has nothing to do with the ring, bro bro. You’re well aware you’re shitty.", "NTA for not wearing a wedding ring. If it doesn’t bother you or your spouse then it’s not a big deal. \n\nYTA for the last sentence. All you had to do was tell her no and that talk is inappropriate for work. She should keep her personal life separate from her work life for sure.", "This was so fake I felt like I was reading a wattpad story", "NTA but sex workers don’t like the term hookers and I would refrain from using it in the future so you don’t look like an asshole again.", "NTA, but consider a silicone ring for work. You could've been nicer about it sure, but she propositioned you at work and didn't take no for an answer.\n\nSilicone rings are cheap, replaceable, and get the point across. Alternatively, a ring tattoo could also do the trick.", "NTA- but you can buy a pack of $10-$15 rubber silicone rings on Amazon as a compromise", "lol I can't believe everybody here. At best, ESH. This guy is a total asshole for the way he talks about sex workers.", "YTA\nNot for not wearing your ring but for calling a coworker a hooker", "ESH. you were in the clear until you basically called her a hooker.", "I was with you until you called her a hooker.  the very first time you said the word I judged you as Y T A.\n\nhad you kept it to just the part about not wearing your ring doesn't mean you're looking to hook up - but said in a more polite tone - then she's just a dumbass.  but you had to keep going.  \n\n\nEDIT:  yes she is also an A H for what she did and that needs to be brought to attention.  she's the one that wanted to \"record content\" with you.  she's absolutely the one that needs to be fired, not you.  so I'm changing my vote to ESH.", "I was completely on your side until you called her a hooker.\n\nLoads of people in blue collar industries don't wear rings for safety reasons. Neither my husband nor myself, for example.\n\nBut that last sentence absolutely landed you YTA.", "\nYta. Was absolutely going the other way until the ending. I don't wear my wedding ring, neither does my husband. It started as a work thing (he does construction/operating engineer & i did Healthcare) then became habit. Neither of us wear jewelry (i do if we are going out). I don't think it has anything to do w anyone else, just a preference. I know lots of married ppl who don't wear them, some dont even have any. \n But the comment you made was crude & unnecessary. I get the point your making but completely unnecessary", "YTA for calling her a hooker. NTA for not wearing a ring. I never wear my ring and neither does my husband. It’s not a big deal to either of us.", "YTA for calling her a hooker, but not for not wearing a ring. I’m sure your SO is aware of how many rings you’ve lost and is fine with it. The fact that you told this woman you’re married shows your intentions aren’t nefarious.", "Esh…would have been n t a  until you started throwing insults.\n\nYou say no and leave.\n\nReport to hr if you want to.\n\nBut as soon as you start insulting other people, doesn’t matter how clean you were…you become an asshole.", "You weren't until the hooker thing. That was shitty all around.", "NTA for not wearing a ring and telling someone your reasoning \n\nYTA for calling her a hooker, there's no need to verbally insult someone in order to shut down their advances.", "YTA on so many levels and for so many reasons I don't know where to start. For one, wear your wedding ring!", "Yup YTA- the hooker comment was completely unnecessary and rude. It is possible to say no, without being a dick about it.", "She deserved that comment for going off on him. If you can't take it don't dish it. No wonder her boyfriend left her.", "Still NTA.", "Honestly it was necessary, she was sexually harassing him. It’s be different if she only mentioned she does SW, but asking a coworker to make content together is incredibly inappropriate. Especially with how she keeps pushing that he must want to appear single and unmarried. She was asking for a rude response and I hope she’s fired tbh.", "Way to instantly side with the woman lmao. Her behavior is sexual harassment.\n\nNTA.", "Yeah, considering she sexually harassed him and didn't take no for an answer, then proceeded to insult him, it was warranted. She definitely belongs on r/nicegirls", "I’m sorry, but a hooker is a hooker. She sells her body for money; and that includes “making content” with men to sell. \n\nIf it walks like a duck, looks like a duck, quacks like a duck, it’s a fucking duck. Sex workers like this not wanting to admit what they are is like an escort that swears they aren’t a prostitute - because you pay for their time, not for sex, it’s just guaranteed that you can have sex during that time..", "Thirst... Reddit has this really hard time separating sex work from AH actions I find", "[deleted]", "It is about the wording and the way it was said. \"Some hooker\" is belittling and shaming.", "If a woman said something misandrist to a man. People would've said the same thing about her. \nYou can't be like \"I'll go shame and belittle this group of men because this one man harassed me\", seriously?", "Lol how is this his fault 😂", "There’s no reason to be respectful or polite when you’re being sexually harassed. Not only did he say no, the conversation continued after that. At that point, any respectful actions are out the window. \nIf the roles were reversed and a woman was being rude to a male harasser, nobody would bat an eye.", "The truth is misogynistic - you hate women if you call a hooker a hooker, lol.", "not misogynistic, but definitely shaming and insulting.  what he said and how he handled it was really low level behavior, regardless of his opinion of her or her work.", "I disagree. When he said \"some hooker\" it was shaming and belittling. This is wrong.", "He said it in a shaming and belittling way. This is misogynistic. Not fine at all.", "The key word here is exchange. The only exchange she sought between OP and herself was that of fluids. Not payment. The money comes from subscribers. \n\n\"Live in sensitively\" lmao", "She asked him to make porn with her at his job! Proceeded to not take no for an answer, and then got shitty and basically told him he was asking for it !! \n\nThat’s not work appropriate behavior at all. It’s sexual harassment. And while it might not be nice to call her a hooker, she certainly wasn’t acting like a person who deserves a polite and respectful response.", "Oh yes, SO terrible to be judgmental of the person sexually harassing you at work. /s", "Um no. She should be fired for the blatant sexual harassment of her coworker.", "Are we not allowed to insult sexual harassers anymore? NTA", "She propositioned him for sex she would then make money off of. If he had jumped to that after she mentioned OF sure he's TA, but that's not what happened, she pushed he called her out. It wasn't necessarily nice but why should he have to be nice to someone sexually harassing him at work", "Why are you ignoring the fact she sexually harassed him at work?", "What we're not going to do is just disregard blatant sexual harassment because the **victim** of said harassment said something rude in response.", "You have to explain why. Keep in mind she sexually harassed him.", "But what a pick up line.. want to make content for my only-fans.... I usually wait until the 2nd date.. \n\nShe was out of line. AND to threaten your job.. wtf.. exactly if it was reversed the guy would've been bounced. I'd report her. Women should respect boundaries and understand sexual harassment goes both ways. I can't wear my ring for medical reasons. Generally men will ask me first if I'm single, some respect it but I still get the odd unsolicited deek pic. \n\nAlso OP NTA. You should suggest organization wide harassment training. I love the annual tradition honing my harassment skills!", "It’s ESH. He wasnt just belittling her as a person, but anyone who does what she does so sexworkers as a whole.", "She’s a whoraphobe. Sex work is sex work. She’s no better or worse than any other worker. And she makes us all look stupid. I hope she gets fired.", "I mean I'm a woman, and if a guy at my work came up to me, propositioned me, and asked me if I wanted to shoot some OF content with him, I would for sure be rude when I said no. And I would also report him to my boss, and let people now what happened-- if you don't want people to talk about you being a creep don't be a creep. And that's 100% what OP should do, and OP is not TA for being rude. \n\nBUT in that scenario I would still be an AH if I called the guy a whore. It's meant to be an insult. It's a pretty gross insult. Going at somebody with a \"Wow you act pretty high and mighty for a  hooker\" attitude is gross no matter what they said first. It's fair to be rude and absolutely she should face consequences for this, and him calling her names isn't nearly as bad as what she did to him, but that doesn't mean what he said is just 100% okay.", "People can be so weird about rings too. I have hand joint pain, but luckily I can wear my SO’s cultural engagement sign (a necklace). People are often made uncomfortable by this and I just don’t get it. It’s especially gross to not take no for an answer, especially after someone has clarified. \n\nI’ll admit if I was in the same position, I’d probably start matching energy for energy. Sexual harassment is gross. You can’t expect folks not to react. Like that thing about catcalling the catcallers. Folks do not like harassment.", "[deleted]", "yes it is, hooker is a derogatory term for both sex workers and women in general, and far worse than just saying prostitute\n\nedited to say, this woman isn't even a prostitute", "He belittled her job, not women. He did not say anything that was directed at her gender. If a plumber was harassing a woman and after politely declining his advances he began to pressure her for explanations, and she said something demeaning about being a plumber, that would be rude and tasteless, but not misandrist.\n\nUnless you're saying that him calling her a sex worker is misogynistic? Because if that's what you're saying, that implies that being a sex worker is bad, and I don't agree with that.", "You are if you're a man I guess 🫠 According to reddit", ">Is it misogynistic to not want to... make pornography with a sex worker?\n\nNot at all. But when he said \"some hooker\", this is misogynistic.", "There’s the rub…..", "Nah dude, OP is N T A. I imagine he told his wife about this after the fact, and the words she used to describe the co-worker weren’t nearly as gentle as “hooker.” And nobody would accuse the wife of misogyny (be honest, y’all motherfuckers would celebrate a robust clap back by the wife, just like I would). People that act inappropriately shouldn’t be surprised when the recipients of said inappropriate behavior reflexively use language that expresses their concerns, and certainly have no basis for complaint.", "Yet, he said it in a shaming and belittling way, which is misogynistic. The roles were already revered many time and the woman was called misandrist as well. It is the same thing.", "This isn’t about what’s polite and respectful; it’s about what’s professional. He can just leave the conversation instead.", "That sucks, but I'm not of the opinion that victims must be cordial while they're being sexually harassed in their workplace", "You don’t have to be nice to a sexual harasser because they sell porn", "No it's not, and anyone that knows the difference between prostitution and porn would say it's not. Apparently you're not one of those people", "He laughed (allegedly) *after* she screamed further insults at him, and said a hooker is someone who has sex for money. In my opinion, he is NTA. She didn't ask him on a date, or even for a fling, she asked him if he wanted to \"record some content\" she'd monetize. \nI see how people are upset with him about the hooker comment, and I agree that's rude, but I don't think that given the context (that we have) that it is out of place. Again, in my opinion; the way I grew up I've been conditioned to be non-reactive to verbal abuse, and seeing someone who doesn't take it is cathartic to me. To me, this scenario is fair. What would make him the asshole in my opinion is if he took it further and said actual derogatory things like \"you're disgusting\" or shamed her, which he did not do (via his previous comments). He was polite until she shot first.", "She was sexually harassing him. He is a victim, she is the only AH here. NTA", "Hooker means prostitute. It’s not something you just call a woman to demean her.\n\nAnd yes, she is. She wanted him to come over and have sex so people would pay her for it.", ">How dare you criticize sex work\n\nYes, belitiling and shaming a sex worker is rude and wrong. Not fine at all.\n\n\n> piece of trash\n\nYou can't be serious, are you?", "“Someone can be a victim of domestic violence but also be asking for it at the same time.”", "Please explain, english is not my first language so I might have misunderstood the word.", "So is 'pig', but it would have been fine to call her that. Propositioning a coworker is gonna land you some derogatory names", "I mean. Would you say that to a woman if a man did this to her? Tell her that if a coworker asked her to make porn with him, refused to take no for an answer, and then kept pushing , that she should be polite and walk away? I sure hope not? \n\nWhat she did was so far over the line, that I think his reaction being unprofessional is sort of not the problem here?   \n\nI think many otherwise professionally people would have an unprofessional response to this level of inappropriate harassment at work", "So he said no too rudely for your tastes, he wasn't polite enough to the sex worker that propositioned him - nay, sexually harassed him, at work - and who wouldn't take no for an answer?  Are you really doubling down on that logic?", "Technically porn stars are hookers. They get paid up front for sex. Not everything they do makes it to the end production, too. Plus something like 80% apparently end up in the sex trade anyway, so even if you want to pretend a camera makes a difference, they’re still hookers. \n\nIf you get a hooker off the street but record it, is she no longer a hooker?", "You.. don’t think playboy bunnies were prostitutes?", "Yes, in a not sexual way we ALL sell our body/ time for money (unless you don't have to work because you inherited a fortune).\n\nBut that's not what the phrase normally refers to, obviously.", "In a way that benefits society.\n\nAt best sex work takes money that would be better used to benefit ones future or family. At worst it spreads disease, and victimizes women and children.", "have you been a woman being called a hooker? if no, you have no right to say if it's demeaning\n\nif you have and haven't felt demeaned, you still have no right to say it isn't demeaning when it generally is", "Because like 70 percent of this website is porn subs", "Right, and that doesn't make him an asshole at all.", "[removed]", "If they called you an accountant in a bellitiling way, then yes they are rude for saying that. Plus, a hooker is under the control of a pimp, while onlyfans or porn stars aren't under anyone's control. There is a difference.", "Practically every title in this subreddit is “misleading” and clickbaity", "A hooker gets paid to have sex with someone. Someone making videos of them having sex for sale is not a hooker, but a porn actor/actress.", "It's not the same thing.", "I disagree. Hookers with multiple partners are going to have STI risk and potential violence to deal with. Onlyfans at least you are in greater control.", "Your average street/brothel hooker has sex with dozens of people daily and has a very low life expectancy. I'd say that's worse.", "No I don’t.  A prostitute is someone who has sex for money, not someone who poses for naked photos.", "LOL no.", "Sure, if you think sex work is shameful, then you find it demeaning. Similarly if the label is applied to make your actions or your profession seem like something they are not.\n\nBut if you are a sex worker soliciting sex work, it’s absurd to get upset that someone declines your offer by saying they don’t want to hook up with a hooker.", "[removed]", "What a weird thing to compare.", "Continuing to push when someone says no to sex is worse than calling someone a prostitute.", "Yes it is. Both are prostitutes.", "They are both sex workers and a lot of people don't bother to make a distinction.\n\nYou are arguing about the difference between a framer and a finish carpenter, but at the end of the day they both make a living banging nails into wood...", "Bruh you realize that these only fans girls are sleeping with guys to make content right? And most hookers aren't going bareback. Yeah but with being a hooker you can move and most likely never get noticed for your past ever again. But damn you can't run with an onlyfans.", "Yeah agreed, but they also have the ability to get out of the industry and not have it follow them as much as only fans girls.", "Haha... nope.\n\nSomeone working in a dildo factory is NOT engaging in sexual activities at work. They pack the damn thing in a box, not shoving it in their holes.\n\nSame goes for the other examples.", "It’d only classify as porn if he’s paid, too. Otherwise it’s prostitution at the same level as you paying a hooker to screw your friend.", "Costars get paid.", "Is it not? He's not paying her for service unless I'm mistakened...if a couple makes a video and posts it...are they both hookers?", "Was she going to charge him for sex? No, then he's way out of line calling her a hooker", "[removed]", "[removed]", "[removed]", "[removed]", "Prostitution is when someone is paid to engage in sexual acts with clients. The clients in this case would be the OnlyFans subscribers, who aren't engaging in the sex they're paying for. So someone with an OF wouldn't be considered a prostitute.\n\nEDIT: I was wrong LMAO I'm pretty sure there's no functional difference", "I get all that, but they could be making content with their boyfriend or husband? I don't really know, but I think it is normalized enough that most won't judge them if they run into them in public. Maybe I am wrong.", "He didn't pay her, he didn't engage in prostitution. He just had sex.", "Only if they were servicing a client together in person rather than producing images/videos", "If that's a source of income, yes. Prostitutes are people who get paid for sex.", "If she was planning on splitting the money with him, she was suggesting that they BOTH be hookers.", "She was going to get paid for sex. That's a prostitute, regardless of who is paying her.", "[removed]", "[removed]", "[removed]", "[removed]", "[removed]", "She would probably still take offense to that, tbh", "That’s just like.. your opinion man", "That is not the definition of prostitution. Prostitution is engaging in sexual activity for money, that's it. It doesn't matter who they're having sex with or who does the paying.\n\nNot judging OP's colleague for what she does for money, but she literally is a hooker.", "So if Billy, pays Jane, to sleep with Bobby. Then Jane would not be a hooker? Because the pay and sex weren’t the same people?", "Lol it will never be normalized. Everyone thinks that people who do only fans are basically in porn, and some are definitely selling sex to fans. And it will ruin their futures. They will all regret it just like how porn stars now after leaving the industry are saying they regret it.", "Stating an opinion as fact doesn't make it fact. People making porn being prostitutes is your opinion, nothing more", "[removed]", "[removed]", "[removed]", "How am I 'more concerned'?", "That is a very broad definition that would also make any celebrity that filmed a sex scene in a movie also a hooker/prostitute so it isn’t the same. The lady isnt asking for OP in context of being a hooker for him, it would in essence asking if he wanted to be a sex worker with her. (SW being simply a more neutral term with less negative connotation).", "Then how is prostitution illegal in almost all of the United States while OnlyFans is legal? Clearly there's a difference in the eyes of the law.\n\nAnd yeah I hold no judgement for sex workers of any kind (so I'm not trying to say one is morally better than the other) but I do feel like there's a technical distinction between a pornstar or someone with an OF vs a prostitute.", "That's not really relevant because that's not the situation here. The situation with OnlyFans is someone pays for a digital copy of sex or sexual acts as opposed to paying for the actual sex. It would be like if Billy paid Jane to send Bobby a picture of her in sexual positions. Or if Bobby and Jane decided to have sex and let others pay to see a video of it.", "I don't know man I have never checked out Onlyfans. I am not going to pay to see porn and I feel like there are plenty of people like me. But seeing as I don't have an Onlyfans and I don't subscribe I will defer to anyone with more experience on the subject.", "So which is it? Are we going with actually definitions, or is it “most people in this thread agree”. \nIt’s good to know that I need to be a lawyer to cite legal definitions. Does that make you a lexicographer because you cited the dictionary ((though selectively). \nThere’s no point in discussing this. You know you’re wrong. You’ve chosen to selectively interpret the dictionary and ignore any portion of argument that doesn’t agree with your preconceived notions. And you’ve decided that selective ignorance is a good look-a person does not need to SAY they disapprove of something for it to obvious.", "You could at least try to open a dictionary. Or just a quick Google search, you know?\nI don't get to make up the definition of English words and neither do you.", "If you are comparing two words and you can't say one of those two in public, that's the worse one.", "[removed]", "What are your comments about?", "NTA, I don't wear a wedding ring because I'm allergic to metals and the silicone ones don't last long.", "Guy literally gets propositioned at work and so calls the girl a hooker, and you're all mad at the guy? If the genders were swapped you'd all change your minds. NTA, you did nothing wrong here.", "As a fellow married tradesmen my ring doesn't fit my swollen fingers so I get it. NTA by a mile", "NTA.  Most people in the trades don't wear their wedding rings.  Too easy to lose a finger if it gets caught in something.", "NTA, \nShe disrespected you at your workplace and then gets offended when u tell her the truth about her. She should’ve just left you alone as soon as u said you’re a married man, period.", "I switched to silicone rings, dirt cheap online...\n\nAlso, NTA and I don't mean Not The Accountant", "NTA. I would have found it pretty fun if I had overheard.  \n    \nWith that out of the way, what exactly do you do with concrete? You sticking your hands in there and sloshing it around?", "NTA and I would report River. That’s harassment.", "NTA. Being asked by a coworker to film spicy content would cause me to say something out of  pocket too.", "NTA if anything tell the boss that she was sexually harassing you BECAUSE SHE WAS", "Hahahahahahaha.. NTA. And 10 points for the last remarks", "NTA most of the married men I know don’t wear wedding rings.  You don’t have to justify why you don’t wear it.", "Nta. I’ve been married almost 15 years. My husband doesn’t wear a wedding ring due to the work he does and he’s so used to not wearing it during his long work he only wears it for special occasions now.\n\n. A ring doesn’t stop someone from cheating and there are even some people who wear wedding rings to attract people (I know personally of a couple).", "yes, you are the asshole here", "ESH. She propositioned you inappropriately, and you called her a hooker inappropriately. You're both wrong.", "God yes, total asshole.", "YTA - Why did you have to call her a hooker?", "EHS\n\nYou could have kept it classy instead you had to hit below the belt because you didn't like something she said. You both acted immature and rude. How embarrassing for your workplace to have to hear about this because really it only says a lot about both of your characters to go this route.\n\nIt's not a big deal if you don't want to wear your ring as long as you and your SO are fine with it. You should have left it at that and walked away from the conversation because that wasn't your drama but you invited it in the moment that you judged someone just like they were judging you by calling her a hooker for her choices. That makes you just as low as \"river\" both are A H's.\n\nEDIT: lol You should have been flattered about the pornographic content comet treated it like a joke and then turned her in for harassment vs. engage in the conversation. Handle it better next time be the bigger person.", "OP, literally every job involves a person trading their body for money.", "Sounds like she already told them as he said he was having trouble at work, unless by that he just means this situation.", "I don't wear my wedding ring these days because I'm pregnant and it causes my hand to ache. It's a hefty ring.", "Op is a man and we all know that men nd parents are the root of all evil and they must always be politically and morally correct to the T at all times of life for them to not be an Ahole", "She was entitled for having that \"false hope\" to begin with. Plenty of people in longterm relationships arent married and plenty of married peopke dont wear a ring.", "Nah. Not borderline at all. Straight up", "Yeah, lol. But it’s still funny to see which side people fall on.", "Calm down - people are correctly supporting him, I'm not seeing any Y T As, and yes people would also correctly call out a guy for sexually harassing a woman. She probably did go way further than she might have had she been a man because of unfair stereotypes about men and sexuality, but you really need to chill with the caps lock.", "This is not the first time I've seen someone retaliate at a married person they have the hots for not wearing a ring. Such entitlement and desperation.\n\nSomeone tell these people that *not all married people wear rings and not all people in loving and committed relationships are married.* \n\nThe absence of a ring doesn't mean someone is single and down to fuck. It just means they aren't wearing a wedding ring. Most people in relationships have been monogamous for years before they get engaged or married and some couples never get married.", "If you sexually harass someone, I don't feel bad if you get verbally insulted", "I didn't even realize it was in all caps 🤣🤣", "Thank you!!", "The high road is a fictional concept promoted by abusers to stop retaliation.", "Well, as I said, he could have been nicer, but if someone at work comes to me, after he/she heard from someone that I said something remotly nice about him/her, in a moment of compassion, with whom I presumably never had a full convo, tells me some sobstory, takes a compleatly normal sentence as an Invitation to ask if I'm willing to make porn with them, when I politly decline and say I'm married and he/she still goes off and says that I would want to appear single etc, I would have probably called her worse, and made her feel so small she could fit under the rug. With a hat on top. (I'm from germany and I'm at a loss as to translate the saying) So I stand to my NTA. It wasn't in any universe the best course pf action, but and absolutely understandable reaction.", "I understand what you are saying. But he billeted her (women sex workers) for being one. For example, if I belittled a stay at home dad for being a man who stays at home, is misandrist. I don't know if you got what I'm trying to explain. I'm not good at it.\nPS: I am not siding her or justifying her harassment at all.", "Asking a married guy to have sex on camera is wildly inappropriate at work. Switch the genders, and suppose she responded by calling him, say, a jigolo. Is that misandristic? Seems fair to me.", "boo-fucking-hoo", "That's not what prostitution is...", "No but it would be a misnomer to call you a CPA, if you aren’t one.  And if you did it yourself, you’d be in deep shit.", "Yet, it was said in a belittling shaming way.\n\nPlus, there is a difference. A hooker is under the control of a pimp, while in onlyfans no one controls the person.", "brilliant.  just brilliant.", "I see, you don’t like the word hooker. While it may be your opinion that the word is on the no-no list with all the other naughty, censored words, I don’t believe there’s a consensus on that. Prostitution is illegal, very disreputable in most of the world, and generally seen as bad by polite society. On Reddit, sex workers are heroes, but that’s a minority viewpoint. I deem your effort to turn the word “hooker” into an “uh oh it’s automatic sexism!” word to be a pretty silly way to win this argument.", "pimps have zero to do with the definition of what a prostitute/hooker is lmao.", "It's a distinction without a difference. Had he been her partner it would be a  different story. She propositioned a near stranger for sex that would lead to money.", "Literally Onlyfans own description: \n\n\"Onlyfans is an internet content subscription service based in London, United Kingdom. The service is used primarily by sex workers who produce pornography.\"", "She doesn't seem in control at all if she's asking a coworker she barely knows to perform sex acts on camera so that she can sell the content.", "Look up Hugh Hefner and what would go down in the playboy mansion.", "You made my evening! I spit out my soda laughing. \"both make a living banging nails into wood\" Precious!", ">but at the end of the day they both make a living banging nails into wood...\n\n🤣🤣🤣🤣🤣🤣WIN🤣🤣🤣🤣🤣🤣", "Greater control, as in not a total random dude driving by. Maybe everything goes ok and you go your seperate ways. But, maybe you live the rest of your life in a sex dungeon until he murders you. Key word = greater.", "[removed]", "I feel like there’s a pretty foundational difference between being black or gay and being a sex worker… hmm… can’t put my finger on it. \n\nFor some reason I’m getting “blue lives matter” flashbacks. Weird", "[removed]", "Sorry, but they are. They pay, she does her thing to give him the results he paid for. Doesn't have to be actual physical contact. End result is the same.", "Thank you for your permission", "Right? Absolute insanity. If someone told a woman who was being harassed to not escalate and just let it slide calmly the commenter above would be calling for the head of the person that told the woman that.", "I'd ignore the sexist personally. \n\nLike you said imagine someone saying what they said if the genders were reversed..\n\nShe sexually harassed him. He called her out and called her a hooker which is exactly what she is. She is engaging in sexual activity for profit which is the text book definition of a hooker and a prostitute.", "Yeah I've mentioned in another comment I was just straight up wrong LMAO", "[removed]", "ESH - she’s an AH for doubling down after he said no thanks I’m married, and he’s an AH going and being a misogynistic pig about it", "I'd make her take me on at least 3 dates before filming Onlyfans content.  A guy has to have some standards.\n\nJokes aside, how did you fumble not being the AH until the last couple of sentences?", "Wtf is this grammar lmao, are you 13? Feels fake, the last bit of the story cemented it for me.", "Nope! NTA!", "Both TA. I was completely going to go with NTA (nobody at work has the right to comment on you wearing your ring or not, none of their business), but you can’t to around calling people hookers bud.", "Seems like you missed a lot of parts. She also insisted that he didn’t wear I ring because he wanted to look single. Idk about you but most people would find that very insulting.", "Would just like to add that I find these Reddit ring stories so odd. My husband doesn’t even have a ring and I only wear mine when I’m actually dressed (like if I’m doing errands and working out and with kids all day it’s in the safe). Neither of us have ever had an issue or someone comment on this. Not gonna lie I actually get hit on a lot while wearing my rings not the other way around. NTA OP", "True equality was never related to belitiling others. The way he called her \"some hooker\" was shaming and belitiling. And that is wrong.", "She shamed herself when he told her no and she persisted.", "There is a few but had to CTRL F to find them", "if this scenario was reversed, the guy would be considered a incel if he acted the same as her. Definitely NTA.", "Except if it was the other way around and a man was proposing sex and wasn’t taking no for an answer and she called him a hooker, everyone would be applauding her.", "Flip the genders imagine if a man asked a female.coworker to make porn with them. That would be unacceptable sexual harrassment", "Apply this to a race argument. Imaging instead it’s a POC and instead of using say an ethnic or cultural term to explain them you say something like the n word for example. You could argue that “it’s the same thing” but it’s not. It’s an offensive term. \n\nSo now look at this situation. The girl has an onlyfans account and is a sex worker but calling her a hooker is offensive because the word hooker is offensive. \n\nSo you question about calling an accountant an accountant being offensive is ridiculous and you know it. They aren’t remotely they same. The term accountant isn’t a historically offensive term like hooker is. \n\nSo ETA in this situation. The girl for sexual harassment and the guy for quite literally name calling. Grow up. You can get being to back off without calling them offensive terms", ">It appears they're more calling Hugh Heffner a prostitute.\n\nNope, he would be called Pimp. 😉", "If someone does demeaning actions and a person try to use words in their original meaning to describe those actions, it's not the person describing the actions who is demeaning someone. It's the person who did the demeaning actions, and they're demeaning themselves. People don't get to make others lie about their actions so they can protect their feelings.", "Ah, that makes sense", "She isn’t any of those things though, she does porn and was soliciting sex lol", "girl ain’t no one reading all that\n\na hooker is a hooker", "One has a camera", "*Ba boom tiss*", "Yeah, Hefner had sex with some of them - not all.  And many people who pose naked for pictures don’t do anything sexual. So I’ll repeat that they aren’t prostitutes.", "Not just Hefner. He’d have the girls fuck his guests.", "Definitely would. If the roles were reversed and the dude was black and instead of hooker she said the n-word, it would definitely be policed. There just aren't that many charged words for white dudes. Even if it were reversed and exact and she called him a hooker for having an OF it would still be policed.\n\nYou just got that incel brain.", "“A person, in particular a woman, who engages in sexual activity for payment.” It doesn’t actually say it has to be **with them** which you’ve bolded.", "YTA for that block of text! Paragraphs are your friend.", "That’s all the commenters have on op, his word choice. Imo that doesn’t weigh heavy enough for him to be ta in this situation NTA", "This comment right here", "She makes money out of it, might also be a bit desperate to find people with whom to film new content for it. Some people are even searching random strangers to do that in dating apps.", "Someone who gets paid by Person A to have sex with Person B while Person A watches is still a prostitute.", "He is right tho", "in some places i'd say more than others.\n\nin my area if you are using the term hooker you are clearly putting someone down. and it is used to put someone who isn't a sex worker down too. it's a way of what we call slut shaming these days. but folks would use it to say someone dressed in a manner they didn't find conservative enough even if the person in question was 12-14 years old.\n\n\"you look like a hooker\" and \"hooker red\" are a couple of phrases hat come to mind. hooker red is less insulting nowadays but when i was younger it was essentially the same as the term slut. your actual character and behavior did not matter it was insulting you.", "Record porn that they sell.", "1000%. He should not have to prove or even say he's married for her to stop harassing him.", "Now I want to see the necklace.", "At worst, concrete is used to make a building for sex work. Your argument is nonsense", "Is she not a hooker…? What am I missing here?", "I think it's nonsense to try to equate tradework with hooking.", "Are strippers prostitutes then?", "NTA I wore my ring for three months. Then I caught it on a ladder cleat and broke my finger.  Luckily I was at the yard and was able to get to the restroom. Soaped it up and pulled the ring off before the swelling got too bad.  I’ve been married 15 years, three kids, haven’t worn my ring since.  It hasn’t been a problem. I’m still married. I haven’t stepped out. \n\nAdmittedly it won’t fit on my busted knuckle anymore but that’s not the point.", "NTA.\n\nIn a lot of jobs you aren't even allowed to wear any ring/ jewellery for health and safety reasons and it makes totally sense to not wear your wedding ring if you lost it before because of work.\n\nShe sounds extremely desperate for attention/ hook ups so I wouldn't give her words any value... also nothing you said indicates you wanted to hook up, so she probably has the idea of herself being irresistible or something. Just ignore her.\n\nAlso if she earns money with only fans she's a sex worker (maybe next time use the more political correct term if you don't want to get into trouble, lol...), if she doesn't like being one or called one than maybe she shouldn't work as one?", "NTA my parents have been married over 30 years and my dad has never worn a ring, he doesn't like jewellery, as far as I'm aware no one has a problem with this.", "NTA I know a lot of trades people who never wear wedding rings. It's pretty inadvisable. I've seen photos of mechanics who shorted batteries out with their ring. It's also a workplace not a sex club or something. You shouldn't need to advertise your marital status.", "NTA brother is a mechanic and is happily married but refuses to wear rings because high-powered machines will skin you. Also, you were indifferent to her side hustle until she tried to include you in it, and you gave her a hard no. She took offense and insulted you and your family, and you rightfully so went down with her", "NTA anyone who knows people in the trades knows that jewelry…including rings can be dangerous.  It is safety.  Coworker is completely wrong for propositioning him and then trying to turn herself into a victim when she got shot down", "YTA. I smell Fanfiction. 🙄", "> I bet it made you feel really big though to belittle someone…\n\nI don't blame him, if she is going to harass him, then she should be ready for a backhanded comment back to her.", "This was the fakest one yet tbh", "Same q.", "But he said it in a shaming and belittling way.\n\nIII", "Yeah idk why people are lying to themselves. He did basically called her a hooker no matter how people cut it up. Still NTA tho", "She deserves to be shamed - but not for being a sex worker.\n\nBut for talking about her OF at work with colleagues she barely knew, then asking one of them to film porn with her and refusing to take no for an answer.\n\nThat was a level of desperation and harassment that absolutely should be shamed.\n\nShe then threatened to get him fired when he said no. She sexually harassed him with no provocation and then threatened him. It's not nice to insult people but it's also not unreasonable when you ate being harassed or threatened.", "She sexually harassed him at work and asked him to join her to make porn. Even after being told that he was married and uninterested? How else was he supposed to react", "I understand what you are saying. My point is that he can be right, and she can be the wrong, the asshole. But he can still do or say something wrong.\nI understand him saying stuff to get out of the situation, but after that it doesn't make it right when he thinks about it with himself.\n\nIII", "Woman was called misandrist 😂😂😂", "Prostitution is legal in lots of places, so I don't see how that's relevant.", "Fuck this rhetoric. I used to be a prostitute and I'm now a machinist. The two are not even remotely the same. Don't play dumb about not knowing what the term \"selling your body\" implies.", "Baboon tits? 🥴", "They qualify as sex workers, just like onlyfans people do"]}