{"id": 14626, "submission_id": "12jrgcy", "title": "AITA for telling my brothers girlfriend her dog is not equal to a human life and to stop talking?", "selftext": "  I (27m) used to think this was something that people would only say online, but I have definitely seen and heard it firsthand bleeding into real life which is why I am asking here. Maybe I’m just weird because I am surprised, I even have to ask this. \n\nIt’s not uncommon to see online (reddit for example) to see people say they would choose to save their dog over the life of a living person because their dog is their dog while the person is just a stranger. That entire mentally seems warped and incredibly vile. I don’t hate dogs, and I like playing with them, but I don’t understand how one can compare one to that of a person. That was once online, but it seems to be bleeding into real life at times. \n\nYesterday, a family friend was telling my family and my brothers girlfriend Mary (f25) how her son is having major medical issues which could ultimately take his life and how she and her husband were not dealing with it well at all, and my brothers girlfriend said, “I understand what you are going through, when Kennedy (her dog) needed surgery, she didn’t know how to deal with it and was a mess.”\n\nEveryone kind of got quiet because she was comparing the life of a dog to a nine-year-old child, and she said it like it was totally normal. The mom was visibly taken back and hurt, and Mary didn’t understand why. Mary added Kennedy is like a child to her, and before she could go on, I just blurted out something like “not the same at all, please stop talking.” \n\nMary did stop talking, but it made everything uncomfortable, so everyone called it an evening. My Dad asked Mary to leave and told my brother he needed to ensure he and Mary somehow made this right because that was heartless. My mom said she wasn’t sure how to end the conversation after that, but my method wasn’t it. \n\nMy brother hasn’t said much other than he gets it, but he is still upset with me. Mary is demanding an apology and for me to mend the relationship with my dad. \n\nThe few people who know about this are torn… some people are saying Mary wasn’t wrong and me and others do not get to tell her how to feel about her dog, and I invalidated her feelings. Others are saying she should be ashamed. One friend said, “this is a problem only white developed nation people could encounter, and Mary is actually a bad person.”\n\nI can’t believe I actually have to ask this, but they got me..AITA for any of this??", "created_utc": 1681316747, "permalink": "/r/AmItheAsshole/comments/12jrgcy/aita_for_telling_my_brothers_girlfriend_her_dog/", "score": 341, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I know people are becoming more attached to their pets and they do not view them the same as I do, but am I really the AH for not viewing a dog equally to a human life?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Just be prepared for some people to crucify you. I *have* lost a child as well as dogs and let me tell you, they are not comparable. Not in the slightest. Mary even having the gall and thoughtlessness to bring it up says more about her than about you for saying something to her. I’m glad you spoke up.", "NTA- it has less to do with the dog and more about Mary injecting herself into someone else’s tragedy. She sounds very self-centered.", "I love my dogs to a ridiculous degree. I had to put my oldest down this week and I am beyond devastated.\n\nBut there’s no way I would ever EVER EVER tell a parent of a young child in that situation that these two things are somehow comparable. It has much less to do with dog = human being and more to do with actual empathy, where you don’t try to somehow one-up the grieving parent or engage in some half-assed competitive victimization. That is some major WTF-ery.\n\nYou shut it down. Someone needed to, since she was obviously clueless.\n\nNTA.", "I love my dog and I love my son, but my dog is a dog and my son is  a human who will well outlive my dog. I respect people's choices on how they view their animals. Some people can't have kids and view their animals as that, but comparing surgery of an animal to one of a human is no where near the same. The outcomes are vastly different as well as recovery. Were you a bit rude? Perhaps, but NTA.", "NTA- Mary was taking away from the people who are actually struggling by making a comparison to her dog. I get she was probably trying to sympathize but it was an inappropriate comment to make and clearly made people uncomfortable. You were just trying to prevent it from getting worse by telling her to stop talking. \n\nWhy would you be responsible for mending the relationship with your Dad? He's the one who asked her to leave because of her comments. That didn't have anything to do with you", "NTA I love my dog. I love her fuzzy little butt. She brings me joy everyday. However, she's a dog. I am not a dog mom. I hate when people call me her Mommy, it makes my skin crawl.\n\nIf you don't know what to say to someone who is grieving the loss of a friend or family member not equating with your experience with your pet is common sense.", "NTA. I can confirm you are right, and acted correctly. \n\nYour brother's girlfriend comparing a sick dog to a sick child in front of the child's mother was deeply hurtful. While she may have had good intentions, she was very, very rude to equate a child's life with a household pet. Now she knows that comparison is inappropriate and offensive, and can hopefully correct her behaviour.", "What Mary said not just rude, it was deeply offensive.  It was good that you stood up for your family friend in that moment.  \n\nNTA.", "NTA. I grew up in a household with dozens of dogs. One of our dogs used to guard my little brother's crib at night, every night, while he was a toddler. Dogs are the absolute best, but what Mary said is just appalling and you were right to stop her from putting her foot in it further.", "NTA as a dog lover myself you were absolutely right its not the same. If this woman had a child herself she would've known that.", "Unless someone else in that room had been through the same situation where their child was dealing with medical issues and could possibly die, no one should've taken the opportunity to claim \"I know what you're going through\". The fact that Mary's story was about her dog just added insult to injury.\n\nI understand that it's really hard for people to just shut the f--- up and listen when people are grieving but we need to get better at it. Most of the time people are desperate to try to \"fix\" the situation by saying exactly the right thing that will make the grieving person feel better, but end up making themselves look like an ass. Because NOTHING they say or do is going to fix the situation or make that person feel better. Platitudes belittle their suffering. Comparisons are only for attention-seekers. If you really want to comfort someone who's mourning you tell them you're so sorry they're hurting, let them know you love them, and make a sincere and specific offer to help them (e.g. \"I go grocery shopping every Saturday afternoon. Can I text you that morning to ask for your shopping list and I can pick you up whatever you want?\"), not just the empty \"let me know if you need anything\" (they won't).\n\nMary doesn't sound malicious but her cluelessness only added to their suffering. Her feelings about her dog may be valid but trying to compare her experience to theirs is incredibly thoughtless. Normally, I'd say Mary should apologize but that just might make those parents feel worse as she'd be bringing up an already sensitive subject. I would just warn her to do what I suggested above instead of tactlessly trying to relate to something with which she has absolutely no experience. NTA", "NTA\n\nShe ruined her relationships with your family ALL on her own.\n\nAs for your outburst, it was just that. If you want to apologize for the way in which it was said, cool. But I wouldn’t apologize for the content. Keep in mind…that has the potential to make things a lot worse if she is intelligent enough to realize what you do with the wording. It could make you look worse, not better.\n\nIf people keep mentioning it to you, explain that your outburst was a result of shock that she showed such disregard (as this was your instinctual interpretation) for a 9 year old child’s life.", "NTA. I am the biggest animal lover and have lost many pets over the years. It hurts and the pain is horrible. While I think the stress and worry a parent feels is the same as the stress and worry an animal “parent” feels….it’s only the same to that animal “parent.”\n\nNo way in hell would I compare possibly losing a pet in conversation to someone who is worried about their sick child. Common sense….you never compare the two, no matter how much you feel your animal is your “child.” It’s incredible insensitive and Mary is absolutely clueless. \n\nYou did nothing wrong by telling her to stop talking. People can still be sensitive to her regarding her worry about her dog at a different time. That was not the time.", "I am shocked at the number of wrong people that demand an apology. Is this the world we live in as well? I said something stupid and wrong I got called out and now I want someone to tell me sorry. Id tell her to take her sorry and shove it up her....... you are not the AH here", "NTA im sick of people acting like this is true and that its totally normal and definitely sane to value animals over humans. i am obsessed with my cats, i get it. and having them sick or losing them is ROUGH and grief looks many different ways. but its not the time or place to compare it to a SICK CHILD. people need to get a grip. im glad you gave her a reality check", "A month or so ago the tornado siren went off in my town. It just so happened that both our lazy butt cats were out and chilling so we grabbed them and headed for the basement. If they had run or not been around, I would have forced my kids down the stairs without them. I love those cats to death but in danger as in tragedy, kids come first.\n\nNTA", "NTA the comparison is ridiculous. You can love your pet \"like it's your child\" but it can never compare to the relationship between a parent and a child. Her remark was thoughtless to say the very least and she really misread the feeling in the room.", "NTA mary tried to sympathize but did a poor job at it", "I love dogs. However, I am with OP the life of a dog is not the same as a living person. Not even close.", "NTA.\n\nAs a pet owner without children who has lost pets to desease and still misses them... It's not the same as a kid. It's never going to be the same. This people do lack some kind of basic empathy and no, they are not good people because they like animals.", "NTA a dog =\\= human life no matter whose. Mary was being insensitive. I don’t think she’s an ah, just tactless. I wasn’t there idk how harsh you actually were so I can’t say if you were too harsh. \n\nMary’s conflict with you are your dad are separate. It’s totally appropriate for her at address your tone if you were too mean but she owes your dad a conversation regardless of whether or not you apologize.", "NTA.  \n\n\nMary is not a bad person. She might have felt similar grief about her dog. However I think comparing her dog with someone's son is still wrong. Here is why:\n\nFor the three hundred thousand years we've been petting dogs, from the start dogs were living as the part of the clan as protectors, and we fed them in return. There's a really sweet loyalty and love that they give us, and we give them as well.\n\nSome people tend to put a cat or a dog above averyone else due to some personal reasons. Those reasons aren't being a \"problem only white developed nation people could encounter\" but more of \"noone can love us more than them or their love is so pure\" reasons.\n\nSome people may see their dogs as best friends, some may see as their child. Still; An adult person should be able to understand that not everyone percieve their dogs the way they do. Therefore comparing her dog to someone's child is wrong and you're NTA.", "NAH Mary was trying to empathize by offering her own life experience, and for her that is her dog almost dying. She doesn’t currently have a child so the dog is the closest she gets to understanding. That doesn’t make her an AH.\n\nThe family friend didn’t appreciate the comment and you all took up for her. Good for you guys for defending someone. But as you said you don’t understand how some people can care for pets as much as they do so you don’t agree. \n\nEveryone needs to cool off and then have a calm conversation and move on. This isn’t something worth staying mad or continually fighting about.", "Nta and I am one of those vile people who think it's wacky to save a stranger over your dog to whom you have an actual moral obligation to protect/care for. That being said, she needed to hear that. How on earth did she possibly think that was comparable?", "NTA. I love dogs, if I see a dog I become hearty eyes and all that stuff. But I'd never dare... wow.", "NTA", "Nta.... if the words you quoted are what you said that is a reasonable way to handle it.", "NTA and you don't owe her an apology, but you were ruder than you needed to be.", "NTA - & your friend is right: 100% rich white people problems. Animals are wonderful, pets can give love and be \"like\" family - and neither should ever be abused. That said, no animal's life is worth any human's and especially a child's in the eyes of their parent. No one can change another's mind, the individual must do that for themself. But if a few years from now Mary has a child and is asked: \"if you heard a screech of brakes and a crash and you run outside to find your child and pet both dead, which would you be more upset about?\" if she answers \"pet\" she has not changed her mind and is indeed a bad person. No mentally stable parent would grieve more over a dead pet than a dead child. PERIOD.", "NTA. People who think pets’ lives are equal to or more valuable than a human’s are a whole different kind of delusional and antisocial. The only right thing to do in that situation is to get her to shut the fuck up, which is what you did. Good.", "ESH\n\nShe was indelicate, but was trying to empathize. You were rude and confrontational.", "NTA. I’m one of those people who’d save a drowning dog over a complete stranger (but I’d honestly try to save both), and I even know there’s a HUGE difference. I’m a cat person, my 2 monstrosities are my babies, BUT I have a niece and nephew who I love more than anything. It would hurt more if something happened to my niece or nephew. \n\nYou did the right thing, you said the right thing.", "ESH.", "Hard disagree with your second paragraph. If a pet parent had to choose between their dog whom they’ve raised with love vs a random human stranger, they’re going to choose their dog, and there’s nothing wrong with that. Someone you love will always trump a random stranger whom you neither know nor care about.", "ESH. I don’t know if Mary is neurodiverse in any way, but stuff like this (finding a relatable counterpart from your own life to show empathy to another person) is pretty typical for a lot of us that are. It’s often a way of saying, “yes, I understand how stressful this can be and my heart goes out to you”. \n\nIt sucks that the friend is experiencing these difficulties, and it makes sense that she would be a little more sensitive about the subject even if Mary was coming from a genuinely caring position. But the friend can handle those feelings or call it out herself. that’s not your job. You were rude to Mary by invalidating her experience and also humiliating her in mixed company. Dogs might seem less important to YOU in the scheme of things, but to a lot of other people, animals are just as much part of the family as the other people in said family. I have a cat. I would save her first in any disaster situation because she’s *family* - and you don’t get to dictate the scale of importance other people place on their pets just because you don’t agree or understand.", "What parts of the internet are you reading a steady stream of people saying they would choose their dogs life over a humans?  \n\nAnyways, NTA although I don’t think snapping the way you did was helpful to anyone involved.", "[deleted]", "The last quote OMG this so true 😂😂😂😂😂", "Comparing the child that grew inside of you to a dog.... \n\"My mom passed away.\"\n\"I know how you feel, I lost a goldfish once...\"", "NTA... One should never compare painful events like that.", "ESH. Mary was showing empathy and the only way she can relate was by talking about her dog. The family friend felt a certain way about that but Mary didn't make any statement about her dog being as important as a Human, just an example.\n\nI almost put YTA for this though because I feel like the parent of the sick kid was already on 10 during the conversation and did not express empathy herself for Mary whose dog also almost died.", "Mary was trying to be empathetic, albeit somewhat insensitive to others. It’s true that a dog’s life cannot be compared to a human life but sometimes a dog could have a big impact on someone’s life and anything happening to them can be depressing for them. I think you could have gone a different route instead of blurting it out, but other than that, I feel both sides are valid. NAH", "NAH. You just both have different perspectives.\n\nYou and your parents think of animals as secondary creatures; a \"lower\" animal.\n\nMary does not. She understands that you can have a bond with an animal that is as intense as a bond between two people.\n\nPersonally, I agree with Mary. But I know other people don't feel that way about animals. Though I do think that people that feel that way about animals don't have as much empathy. Actually, the longer I live, the more I think animals have more of a right to this planet than we do.", "ESH (you but Mary most). Mary may have been trying to show she could relate, but it was insensitive and had the opposite effect. Demanding an apology shows she doesn't get it even now. You probably weren't the right person to step in and should have left it to your brother or parents.", "ESH - She was trying to be empathic, in a clumsy and ham-handed way, but she was trying.  You and your family lashed out in a pretty harsh manner, ordered her to leave and made it clear that you essentially despise her and her way of thinking.  Frankly, I doubt you will have to endure this person you think is so freaking awful because she's going to break up with your brother and you can all bask in your sanctimony without being further insulted by her presence.", "NAH … she was trying to sympathize, albeit not at all the same, your friend was discussing the potential loss of a child. I would have done something similar, but I would have asked Mary to step out of the room to do it. This is one case where Mary’s age and lack of children make her unable to process that amount of grief, so she used what she had to show she understood. Of course your friend was mortified, I would have been also. I’m happy you stuck up for your friend.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n  I (27m) used to think this was something that people would only say online, but I have definitely seen and heard it firsthand bleeding into real life which is why I am asking here. Maybe I’m just weird because I am surprised, I even have to ask this. \n\nIt’s not uncommon to see online (reddit for example) to see people say they would choose to save their dog over the life of a living person because their dog is their dog while the person is just a stranger. That entire mentally seems warped and incredibly vile. I don’t hate dogs, and I like playing with them, but I don’t understand how one can compare one to that of a person. That was once online, but it seems to be bleeding into real life at times. \n\nYesterday, a family friend was telling my family and my brothers girlfriend Mary (f25) how her son is having major medical issues which could ultimately take his life and how she and her husband were not dealing with it well at all, and my brothers girlfriend said, “I understand what you are going through, when Kennedy (her dog) needed surgery, she didn’t know how to deal with it and was a mess.”\n\nEveryone kind of got quiet because she was comparing the life of a dog to a nine-year-old child, and she said it like it was totally normal. The mom was visibly taken back and hurt, and Mary didn’t understand why. Mary added Kennedy is like a child to her, and before she could go on, I just blurted out something like “not the same at all, please stop talking.” \n\nMary did stop talking, but it made everything uncomfortable, so everyone called it an evening. My Dad asked Mary to leave and told my brother he needed to ensure he and Mary somehow made this right because that was heartless. My mom said she wasn’t sure how to end the conversation after that, but my method wasn’t it. \n\nMy brother hasn’t said much other than he gets it, but he is still upset with me. Mary is demanding an apology and for me to mend the relationship with my dad. \n\nThe few people who know about this are torn… some people are saying Mary wasn’t wrong and me and others do not get to tell her how to feel about her dog, and I invalidated her feelings. Others are saying she should be ashamed. One friend said, “this is a problem only white developed nation people could encounter, and Mary is actually a bad person.”\n\nI can’t believe I actually have to ask this, but they got me..AITA for any of this??\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I've had this conversation with people before.  My reply is if you and your family were starving.  Would you let your family die or eat the family dog.\n\nTheir answer is usually very telling.", "NTA you said what everyone was thinking and honestly supported your family friend who is going through the worst possible thing you can go through.  I don't have a dog but I like dogs and grew up with friends with dogs that I felt \"close\" to and was sad when they died but at the end of the day they are dogs not people, not to mention at best a small dog might live to 20ish, bigger dogs more like 15 a 9 year old otherwise healthy boy should expect to live to 70/80.  Just all in all no comparison Mary was completely inappropriate and offensive in her comment, I'm really not sure what else you could have said.", "Nta, I love dogs but 'dog people ' like this are legitimately disgusting", "NTA. I felt like that about my pet but when she died, I recovered. I adored that animal, it was a pure unconditional love not to be understated. The parent to child love is something more primal than love alone and that's why it's different. It's a physical need to ensure the safety and wellbeing of your child, so strong that if you can't make that happen, you'll never feel OK again yourself. I know that doesn't apply to every parent but to the majority it does.", "OP even said \"please,\" which is probably more than Mary deserved. I'm a pretty fucking dense dude, but even I'm not that thoughtless. \n\nI'm sorry for your losses.", "I just lost my dog and cried for two days. I cry when I think about my kids dying. I don't know what I'd do and I've had moments where my infant was choking and couldn't breathe/rushed to the hospital. It's not the same at all, I agree\nNTA", "My husband had a coworker who lost a dog that she had for years and another coworker was saying how sad it was and basically like losing a child. My husband agreed that it was sad but said it wasn't really the same and the coworker asked how so when she had never married or had children and the dog had been her companion for years. My husband's response was well she came to work the next day and I sure as hell wouldn't be here if my son had died yesterday.", ">She sounds very self-centered.\n\nI agree because of the way she's asking for an apology. She's TA for what she said regardless, but people are sometimes super awkward when dealing with others' tragedies. I feel like we're taught to empathize, so Mary tried to do that--badly. She's the asshole for that, but I feel like she'd be redeemable if she realized later that what she said was wrong and apologized for it, rather than doubling down and asking for an apology....", "Agreed.", "Exactly! I love my cat like a baby but trying to compare pet parent love to human parent love is just insensitive and pointless because you will never reach an agreement", "I'm so sorry about your dog, idk what I would do if I ever have to put down my baby boy and god forbid to that. \nHope you are doing fine.", "Not sure which is worse when I hear it: \"dog mom\" or \"fur baby\"", "I get people telling me Happy Mother’s Day because “you’re a dog mom”. Yeah, nah. I’m not a mother and I don’t want to be one. Let that day be for actual mothers, aiight? Let’s not cheapen it.", "I don't understand how this is a \"100% rich white people problem\".  It can't be a rich purple person problem?  Or a poor green person problem? I'm not seeing how financial status or skin color figures into this...", "Yeah agreed. Empathy doesn't always need to be on the same scale - you can draw from a similar experience even if it's not quite as traumatic. She sucks a bit for equating her dog to a child and not acknowledging that it's not on the same scale, but her heart was in the right place during an uncomfortable conversation where there is really not a lot to say.\n\nBut saying \"not the same at all, so please stop talking\" is rude as hell. ESH but honestly I'd lean more towards YTA than NTA.", "I accept your judgeent but I do not agree with your point of saving a cat first. Humans always goes first unless they're a vile person like a sex offender.", "Reddit. It's happened on loaaaads of threads.", "It's such a stupid hypothetical. \"If you have to choose between your dog dying and a random stranger on the other side of the world whom you'll never meet dying, which would you choose?\" \n\nIf someone asked me that, I'd probably say \"my dog\" as well because it's a stupid question lol.", "Her child might die ofcourse she’s not going to express empathy for someone’s pet who DID NOT die", " The bond and loss of a child is nothing like the bond and loss of a dog. It's frankly insulting when people think they're the same. \n\nI thought this way until I had a child and now I laugh at how ridiculous I was. And I was *that* dog 'mum'.", "I hope she breaks up with the brother and his AH family who have no empathy for anyone with a different opinion than theirs.", "I lost my dog when she was 10 and I had to make the decision to put her down as her quality of life was poor and just getting worse. I pet her and talked to her as she went, and it was so fast and painless on her part - she didn't fight it at all, and I knew 100% that it was the right decision. I was _devastated_ and cried like a baby for days. I still cry about her sometimes and that was 5.5 years ago. It was hard, but life goes on.\n\nI have a daughter now. I don't know how I'd survive if she died. I barely slept the first few months of her life not because she woke up too much (she's always been a good sleeper) but because I'd wake up and feel the overwhelming need to check on her to make sure she was still alive.\n\nI love my dogs with my whole heart, and losing them sucks. But it isn't the same. If I had to choose between my dogs and my child, I'd pick my child in a heartbeat.", "Well said", "You’re very kind. Thank you.", "They are both equally awful.", "Oh my god THANK YOU for this. I have a kid and a dog but my dog never kept me up all night pumping breast milk or called me a “narc” to my face at 3YO. \n\nThat’s the kind of shit you only put up with as a human’s mom. \n\nI love my kid, but my dog is an angel compared with your average toddler lol.", "It's just a figure of speech meaning \"the problem of someone who has nothing difficult in their life\".  It doesn't actually literally refer to rich or white people.\n\nIt is a pretty awkward idiom, though.", "This exactly!", "And that’s your personal opinion. My point is that it’s not really your place to decide how other people prioritize life and love. You’re entitled to think the way you do! What makes you the AH is trying to make Mary accept something that’s just not part of her truth. Especially since loving an animal like a child is fairly harmless on the scale of disagreeable opinions.", "Depends on the person, i will always pick my animal bro's over a unknown human to me.\nWithout any doubt or second guessing. \n\nPeople i know or have any form of relation with,  other story ( maybe ) .\n\n\nHowever i am older ....  and seen to much crap that i started to see \n the human race as a invasive species . \nTo many of them anyway, nothing lost .", "That's why I didn't put YTA.", "You thought this way, but now you've had kids, you feel it's ok to judge other people for thinking this way? That feels more than a bit harsh.\n\nPeople often compare different situations where they see some parallels, it is not intended as an insult, it's an attempt to find common ground and show empathy. I suspect what she was trying to empathise with was the sense of not having control over a situation and that being really scary, and it being emotionally draining when you are in a position of responsibility but something really bad could happen. All of those are completely fair comparisons.", "Ever seen one of those bone-shaped magnets on the back of a car that says \"I \"Heart\" my Granddog\"?", "Also, I never hear male childless/childfree dog owners get that on Father’s Day.", "Yes, I have, they make me roll my eyes.", "The hormone that creates love for our pets is the same as for people - and for some people, the fear of losing their pet (who is a loved one) would probably drive them to save their pet in an emergency over another unkown person. It might not sound rational because love isn't rational. \n\nBUT it was so tone deaf to bring up their pet like an equal to a child that might die. Idk if she was playing the tragedy Olympics or just trying to relate, but it was inappropriate in that situation. \nNTA", "Thank you for speaking up to her ignorance. I have a friend who was a pet parent but never once did I ever see her put her pets before a critical person. Her niece had to have surgery and she canceled her trip and ask me to take her dogs for as long as possible so she could be there for her family. One of her dogs was very old and sick. She just ask if I could just make him as comfortable as possible she would appreciate it. But not once did she put the dog in front of her nieces medical situation.\nDo not apologize she needs to apologize for her callous behavior.", "Grief or pain is not a contest.", "YTA\n\nA dog is not more important than a human life....to you. Others will clearly disagree. As far as worrying about a relative/animal having surgery why shouldn't they be equal? Both are beings someone cares about and would be grieved if unfortunate occurred.\n\nTruthfully, I'd save a dog over most humans", "I’m going to go with nah. I agree that the losses are not comparable. That said, Mary was trying (imperfectly) to empathize. She sounds a bit clueless, but not malicious.", "As a parent, and as someone who has owned several pets over the years, 100% NTA.\n\nWhat she did was completely inappropriate. Losing a dog is NOTHING like losing a child. I would know, I've lost both. For her to even pretend like she has a clue what they were going through is beyond ridiculous, and completely inappropriate.", "NTA  \n\n\nDamn people are assholes. I support a girls' school in Africa and when I ask people if they are willing to donate something (like school equipment, English books or maybe some money so the girl could get get access to fresh water) people cuss me and say \"they'd better help the local animal shelter\". I get it, I am a huge cat lover, but I would sacrifice all the cats in my area in order to make sure the girls from that school get educaton, acces to medical services and make it to ripe old age", "NTA\n\nI’ve had a dog put down, and I have kids. Not comparable. Loved my dog (still do, 10 years later), but not even close, and the people who call it the same have no actual clue.\n\nYes, in a lot of ways having your dog is like having a child. It can be similar. But it is not the same.", "Def NTA. You adopt a dog knowing that eventually it will pass away and that you will probably outlive it, you bring a child into this world expecting it to outlive you. Mary doesn't deserve an apology. She needed to be called out for such a thoughtless remark.", "NTA. It really is insensitive of her to make the situation about herself. Dealing with pet loss/health issues extremely hard, but you can’t compare it to someones own child.", "NTA, and please don't apologize until Mary apologizes to the worried parents; demanding that you apologize here is *probably* Mary's attempt to save face and shift blame, but honestly I don't see how you need to apologize for helping her not make any worse an ass of herself.", "NTA. I don't have any children of my own, only pets that I love dearly. That being said, I would never choose a conversation like that to compare the life of someone's child to be the same as my pets. That's just hurtful to the parent(s). \n\nWould I be devastated if something happened to one of my pets? Of course. \n\nWould it still be appropriate to compare to a child's life like this? Absolutely not. \n\nYour polite yet candid ask of her to stop talking was perfect, especially since no one else felt the need to ask her to shush.", "NTA, her dog is important to her but to compare him to the life of a child. Nope, I would have said the same thing and it would snow in hell before I apologized to her for such an insensitive remark.", "NTA, the dog cult is wild at times. I know a lady who sadly lost her toddler to cancer and under one of her posts someone wrote \"i understand, i recently lost my dog\"  and i was baffled absolutely flabbergasted that someone would think to make such comparison.", "You were more polite than I would have been. NTA", "NTA- what are you apologizing for? Mary made herself look dumb and was going to continue. I dont think what you said was rude bc the situation was already awkward. Mary did not read the room and obviously needed help to stop. Mary can handle fixing her own mistakes as shes a grown woman that felt the need to interject.", " NTA.   \nIts incredible that she would feel emboldened enough to say that to someone who's child is dying. Telling her it is not the same and to shut up was totally appropriate. And I lot of people wouldn't have been as nice about it. \n\nThat being said... I am one of the people who would prefer to save my dog over a human stranger. Because I love my pets intensely and tend to dislike strangers as a default.  I would likely (maybe, hard to say tbh) save the person out of a moral obligation. But I would also severely mourn my dog, feel incredibly guilty, and resent the person for preventing me from saving my pet. Yes I know that's not the heroic attitude someone should have. but it would likely be how I felt. \n\nEven then though  I would NEVER assume my love for my dog equates to a mothers love for her child.  And I would NEVER ever think its okay to make that comparison. Pets are pets, not children.", "NTA. You did the right thing. You invalidated her feelings? She invalidated those poor people's feelings about their sick child. It's good that you told her to stop talking, you defended the family friends which was the right thing to do.", "NTA\nI love dogs, my dog is my best friend, but people NEED to stop comparing actual children (especially ones potentially dying in the hospital) to dogs.\nOp you were FAR nicer than i would have been, also i’m curious, how exactly does she want you to “fix things” between her and your dad…?", "NTA honestly anyone who interjects on a tragedy to talk about themselves in the conversation ticks me off. It’s not an appropriate response. I know some people mean to communicate “I’m empathizing with you based on this experience” but it always comes off as “I’m pivoting the conversation towards myself”. It only really comes off as sincere if it’s a private conversation and not in front of a group", "Mary needed to keep her mouth SHUT. She was completely in the wrong here to bring up personal tragedy at all... Much less a /dog/.\n\nAnd I love dogs. Way more than I love humans. I have a service dog and two pet dogs. My service dog is my lifeline and alerts me to be safe, and is my best friend.\n\nI still wouldn't compare that to an actual /child/.\n\nNTA. She needed to stop talking.", "NTA. I have no human children, but I do have dogs. They are the closest family I have besides my husband. I would never compare the life of one of my dogs against a human (especially not to a parent talking about their child).\n\nWhen I got my pets, it was under the assumption I would have them THEIR entire life. I have raised from puppies 4 dogs, 3 which have passed. You never expect to outlive your human child. The two are not the same, the life expectancy and expectations are not the same.", "NTA I actually think what you said was fine.  It was short and to the point, because she was offending and upsetting those poor parents talking about their son.\n\nI don't have children.  I have pets that are like my children.  But FFS, they are not comparable.  We only get our pets for a short time, and it's sad and difficult when they have medical issues and/or pass away, but it does not compare to having your human child, who you expect to live a long full life beyond your own, suffering and possibly dying.", "NTA. Mary is absolutely in the wrong. Y *would* BTA *if* she hadn't actually directly compared her dog to a child, but she did - so you're completely justified in correcting her. If she'd said, in a separate conversation and context \"when Kennedy (her dog) needed surgery, she didn’t know how to deal with it and was a mess. He is like a child to me\" then Y *would* BTA to correct her then, but that's not the context of what happened. In fact, even if Kennedy actually were her child, what she said is insensitive and hurtful.", "NTA. \nI grew up on a farm, and I've worked in hospitals. Being witness to humans dying is something you take with you.", "You’re saying two different things here. \n\nYou’re NTA for calling out Mary. What she said was inappropriate for the situation. \n\nYTA though, for your belief that everyone must always treat people as more important than the animals they agree to love and care for. Just because you don’t get it doesn’t make it wrong. Would someone choose their dog over their child? No. Would someone choose their dog over a complete stranger? Many would, because they know and love the dog but not the stranger.", "NTA- the problem happens because people don't want to give any importance to the grief experienced when losing a beloved pet. I would NEVER say the loss of my dog is comparable to someone losing their child and i'm someone who calls my dog \"my child\" but i'm also not going to accept that my dog's loss is nothing and i'm not entitled to grieve. The only thing i would say is as badly as my dog's loss hurt me, i can only imagine the horror of losing a child. Your brother's girlfriend was completely out of line and should have kept quiet.", "NTA I am a huge dog lover. I’ve mourned my dogs way more than I mourned my parents, but that’s a story for another day.\n\nHowever, your brother’s girlfriend was cruel to compare any loss she’s experienced to what your friend is going through. Each person and therefore each tragedy is unique. When someone tells you what they are going through, just listen and ask what you can do for them. If they want advice and/or commiseration, they will tell you.", "NTA \n\nYou weren't an AH about it. You told her to \"please stop talking\". Even if she were comparing two human lives it was NOT THE TIME for her to be like \"yeah i get it\". Its dismissive and invalidating to the others who are pouring their hearts out. What she did was self absorbed and very unempathetic", "NTA your right it’s not the same. Like it or not pets and children will never be on the same level. You can care for both, love them have memories that you cherish and even pictures of them. However the reality is your pet will never have the mental capacity to make decisions and have the life of a human. They wouldn’t be making payroll decisions, operating machinery, performing operations on humans or other pets, they aren’t capable of informing their humans I want to go to see x or y for my make a wish, or attend school beyond training for specialized tasks. When you loose a child your loosing not only the the child but their hopes and dreams as well. You will never see them drive a car, graduate high school, college, marry or have kids. You grieve for their loss in your life and the loss of what might have been.", "NTA.\n\nThe fact your family are basically admitting you're NTA amd \"you said it wring\"...Well, they've had tome to think of something better. Ask them to give an example. You didn't have any time to think.", "NTA but I think she was just trying to show support and did it in a weird way.", "NTA Look, forget how you or she feels about dogs. The real problem here is she wasn't reading the room and noticing she was upsetting people who already had more than enough to be upset about. You just wanted her to stop before she got both feet in her mouth. Telling people scared for a child's life about how you felt about your dog is an asshole thing to do, and I'm a known \"dog person\"", "NTA.  Losing a child is nothing like losing a dog.  People who lose a child have deep mourning for the rest of their life.  People who lose a dog often pick out a new dog after a month or two.  Mary needs a lesson on reality.  \n\nAny friends or family who think otherwise either need a reality check  or they are the kind of people who can’t stand any conflict, even when it’s needed.", "NTA\n\nSo I have had dogs all my life - and I don't have children. But I do have young nephews. \n\nAs primates, we bond a lot better with our own species than with dogs or cats, **providing** that it's a *good* relation that we have to the other human. Not only that, but science has proven that **female** primates get a rush of endorfines and \"happiness\" hormones, when they are around their young. Thus, we can conclude that the bond between a mother and her child is (usually) stronger, than the bond between a woman and her dog. \n\nA dog is a **companion**. You expect them to die within 8-15 years of getting them. A child is not a companion. A child is the most intimate extention of yourself. I mean, if you get a child, just to entertain you... yikes. Not only that, but when people get a child, they don't usually expect to outlive their child.", "NTA. My dogs are my beloved family members but what she said in that context was very inappropriate. It's not comparable.", "You didn’t invalidate her feelings you told her to stop talking.\n\nWhich was pretty solid advice in that situation.\n\nCrash landing an airplane is not the best way to do it but in this case the runway was 3 counties over.\n\nNTA", "NTA. Refuse to apologize. She said something cruel and tone deaf and she clearly has no idea how bad it was. You apologizing would make certain that she learns nothing from this.", "When I think about losing my dog, it makes me feel sick to my stomach and really sad. I literally cannot even think about anything happening to my children. Just typing that almost has me in a panic attack.\nNot the same thing at all. And while I get that your brother's gf doesn't have kids and was probably trying to be empathetic by relating the event back to something in her frame of reference, she should have kept quiet and nodded instead. \nNTA and you did her a favour.", "NTA. She started talking about herself as someone else was talking about their son possibly dying. I get she meant well but this is sort of an implicit rule everybody has to learn eventually - don’t do that.\nYou weren’t rude, you asked her to please stop talking. You handled it in a professional yet assertive manner that made her realize that she *super should* stop talking.\nThose who think it could have handled it differently couldn’t think of a way to handle it at all. She kept talking about it as the room was silent and probably would to continue to do so if the room remained silent to fill that awkward silence, it’s a good thing someone said something before she did so.\nI understand Mary’s feelings here too - I’m sure she’s incredibly embarrassed. I feel apologizing will just make things worse, and just being friendly around her and giving it some time will heal your kinship with her a bit. If she takes the time to process it all she’ll eventually realize how daft that was and accept it. \nAs for her expecting you to make up with your dad on her behalf, that’s bizarre and quite frankly stupid. I have nothing else to say about that delusional request.", "I don't agree with your stance on pets. You can't really fault someone for choosing a living being that is dear to them in a situation where they have to make a decision in a split second to either save their beloved pet and family member or some stranger and you also don't seem to be a person who connects to animals at all really. \nI am voting ESH because you can't compare a pet to a person in a situation like this, it was tactless of her to say these things and she should have known better. I also don't think she is in a position to demand an apology given her thoughtlessness...However you did act like an asshole in my opinion. You shouldn't have talked to her like you did and I think you should apologize for your rudeness but do tell her that she was out of line because she was. But she still is your brothers girlfriend and you guys should get along with each other. You never know she might one day be the mother of your nieces and nephews.", "NTA at first I was going to say YTA, but the context is waaaaay different than I thought. It's not the fact that they compared them that I find problematic because I would choose my dog over anyone else in a heartbeat, but she compared life threatening surgery on a child to the dog and talked about the dog like it was a person. It's like when people compare raising a baby to raising a dog. It's simply not the same and insensitive", "Nta.  Those kind of animal people are unreasonable and irrational.  But good for you for saying something.", "ESH, but you in particular. Mary sounds like she’s immature but was trying to empathize with the parents. She did so in the closest way she had. It wasn’t great. The right thing to do in that scenario would be to steer the conversation in a different direction. Instead, you called more attention to her misstep and made it worse.\n\nNot to mention, given the choice between saving my dog or you from a freezing lake, I’d pick the pooch. I’d also weigh you down with a brick because you sound fucking insufferable.", "What do you think Mary was trying to accomplish with her comment?  \n\nI don't think she was trying to minimize what the parents are going through, she was trying to show empathy.  Sometimes people without children think they understand issues parents face but usually they can't because there isn't a comparable, a beloved pet is probably about as close as you can get.  It is sort of like a white person who thinks they understand what people of color face.  Wanting to understand, trying to empathize is not wrong but it isn't a good idea to make a silly comparison.\n\nI don't know that you helped anyone with your comments though.  You made an already uncomfortable situation much worse.  I guess that means I think YTA", "ESH. Mary sucks for making the situation about her. I don't fault her for what she was trying to do, it sounds like she was trying to empathize with the mom who had the sick child but even if I were to replace Mary's dog with Mary's son, it's still awkward and shitty. It's like saying, \"yeah that's terrible for you, I felt the same way when it happened to me when my son etc.\"  By doing this Mary is taking focus away from the speaker and their subject and putting it on herself. \n\nOP sucks for telling Mary to stop talking. It's harsh and unwarranted, given that the atmosphere was already tense and awkward due to Mary's fumbled attempt at empathy.", "I don’t know what to say in all honesty. \n\nI am child free. \n\nI have also watched my dog die in front of me, and it gave me PTSD. It rocked me to my core. That *is* my child. \n\nI’m not passing judgement on your opinion or response, but I am saying: it *can* cause long lasting trauma,\n\nAnd it should never be a trauma contest.", "I’m unable to conceive.  I do view my dogs as my children.  However, I cannot fathom saying that to anyone in that situation.  You are definitely NTA.", "Look at my username. \n\nNow that we have that context :D\n\nNTA.\n\nI am CFBC and a proud \"dog mom\" if you will. My dog is LIKE my child absolutely. But that's the thing... he's like my child bc I'll never have a child. And in no world, is he comparable to A CHILD. \n\nI find a lot of our millennial peers are getting a little... wacky... with the extremes of their pet husbandry. I could rant all day about how cool it is that humans can create such deep interspecies bonds another time. But I think a lot of people are trying to fill an internal void with cute animals (I get it) but don't actually do the inner work. So they become weirdos who say shit like this to bereft parents of human children. They're also usually AHs with poorly trained pets but that's for a different subreddit :D\n\nOP, IMHO sometimes (but not often) we are given the perfect scenario where someone genuinely needs to be told what they're saying is dumb & they should stop speaking. You were in the scenario & reacted appropriately. To politely ignore it would be a disservice to everyone including Mary honestly.", "YTA. She was trying to relate with a hard time that was up in the air and I promise I’d save my dog over almost anyone in the world even those I know my dog is my best frient", "I feel like Mary was just speaking before thinking while mentioning a roughly similar situation. I’ve don’t this and felt like shit afterwards. Obviously human lif is more than a dogs but I feel like she was just mentioning a similar situation. Nobody’s an AH here", "Mary probably didn’t know what to say and thought she was being relatable in a way. I have ADHD and will on occasion insert my experience in similar situations to try to verbally say I understand to an extent. I’m well aware of it now and do my best to stop. Mary wasn’t saying her dog was like a child, I think she meant she understands the heartbreak when someone you love is sick. It’s definitely a sensitive situation and I don’t think she meant any harm by it.", "I’m going to go against the grain and say NAH.\n\nDo you know if Mary has ADHD or autism? I (29F myself) have ADHD, and that’s how we express empathy to others. We’ll state a similar situation that we’ve been through as a way of saying, “I see you. I hear you. I know how you feel, and you’re not alone.” It’s not trying to steal the spotlight or make the situation about you in any way, or that’s at least the intention.\n\nOf note, *I’m not trying to say that the loss of a pet is in any way comparable to the loss of a child.* That’s a pain on a whole other level that I hope I never have to experience. Mary, likewise, doesn’t have that experience. We both also have dogs that we view like our children. If her way of expressing empathy is in any way like mine, then her dog was the next closest thing she could reach for. It probably would seem like it hurts about the same to her because she doesn’t have human kids. Limited experience and all that.\n\nShe knew she fucked up seeing their reactions, and her backtracking and trying to explain that she sees her dog as her child (to imply that she meant no offense) is *exactly* the sort of overexplaining that I would do in that situation to try and remedy it.\n\nIn this situation, she absolutely made things worse by continuing on and needed to be told to end it, but I’m in agreement with your mom here. I don’t think Mary intended to be heartless, even if it did come off that way, and y’all may have made her hurt even worse on top of the hurt she already felt by unintentionally hurting someone else.\n\nTo make it clear once more, this is again all assuming that her brain works at all like mine. It might not. I just know that I see myself in her actions, even if I wouldn’t have done what she did to begin with.\n\nI’d just talk to her, dude. Apologize for being harsh. Tell her that you can’t relate to how she feels about her dog because you don’t view them the same way. However, also make it clear that someone’s relationship to their human kid is on a whole other level than one’s relationship to a dog, and that’s something she has no way of understanding while she doesn’t have kids and take that as a lesson learned for interactions like that going forward.\n\nETA: Mary, on her part, should 100% apologize and try to make it right on her end.", "She was trying to relate to the situation and you were needlessly rude. YTA", "NTA\n\n> One friend said, “this is a problem only white developed nation people could encounter, and Mary is actually a bad person.”\n\nI hate it when I end up on the same side as an utter asswipe like that person.", "simple. you, your family and literally everyone in here is the @$$ hole. You all are typical. All life is valuable", "NTA we lost our dog, our daughters pet since she was 1, when Koda was 12 on my late husbands birthday and we all cried and it still makes me sad. Then then 2 years later my husband died on our daughters 15th birthday. Absolutely no comparison, we were in a fog for a year and still crippled with the loss at times. As you can imagine her birthday is difficult, but I made it a priority that we celebrate his life in the morning when he passed away and then the rest of the day is dedicated to the most important person in his life, his daughter. We both have memorial tattoos for both but again, absolutely no comparison. Even my daughter would agree and her Koda was her “brother” because she was only child. This woman is absolutely tone deaf and your brother needs to get his head out of his ass and gather a clue at how heartless he sounds for making this a deal.", "NTA. I have had pets and I love them dearly, but they are not equal to a child's life. I understand some people don't have human children and their pets are their world, but they are 100% not the same.", "NTA", "NTA\n\nEven if Mary wasn't talking about a dog, i still think she'd be an asshole. Comparing grief like she is doing is taking one person's grief and making it about herself.", "Honestly the last dog I lost I could not get out of bed for two weeks. I have also lost my dad and my brother.  I had to get out bed w their loss to plan the services \n\nIf I could save my dog or a person it would depend on who the person was.  My dog is one of my best friends - if it was my dog or some AH I’m saving my dog", "ESH Mary was obviously trying to sympathize but it wasn’t necessary. It’s tone deaf to try to sympathize with the loss of a child when you don’t have one.\n\nYou suck because of the way you handled it. She meant well, and you took it to another level. The easiest thing to do would have been to ignore it.", "NTA but - I strongly suspect this comes from a place of ignorance.  Mary *genuinely* thinks it’s the same.  Until you have a child, I think it’s damn near impossible for a non parent to truly understand that level of ‘love’. And I don’t think Love is even the right word.  \n\nIf Mary has a child then yep, she’s wildly insensitive and an idiot to try and compare. There is an etiquette list somewhere that when someone is suffering you simply listen and not try and compare or “relate” to their pain, thereby making the conversation about self.  She missed the memo.", "NTA at all but Mary sure is.", "NTA. Tell the GF she needs to apologize to the other couple before you will entertain the idea of apologizing to her. While her being upset is understandable it doesn't compare to someone potentially losing their child.", "NTA\n\nEven if you have no children but a dog and for you personally that dog is like your child with the extent to which you love them.. you have to understand and i thought it was common sense that for someone WITH kids.. 99.9% of the time its not comparable, not even slightly.\n\nMe myself? Im not a kid person, dogs, cats, i like them much more than kids. Would i ever tell a grieving parent or a parent going through what your friend is going through that i know what it feels like becuse \"xyz to do with my dog\" ? No. No way in hell. I wouldnt even THINK to myself that i know what that feels like becuse of my pet because i know its not the same but to say it outloud TO the parent in question is another level entirely.\n\nI guess its possible she was trying to empathise by drawing on her own experiences as many are taught to do and in the moment happened to choose an extremely poor one to use, HOWEVER in which case she shouldve apologised immediately upon realising it for being insensitive and said she understands its not the same and maybe explained her reasoning for the comment rather than knuckling down and insisting she was right.. the fact she didnt and instead is calling out for apologies for HER shoves her way way way into AH territory. \nI dont think you did anything wrong, i reckon if you had tried to shut her up more subtly it wouldve have ended up in a bigger scene with her saying more things no one should say to a parent in that situation you made it short and sweet.\n\n\n\nSympathies for your friends and their child.", "NTA anyone who has had both children and pets knows she's TA here, I wouldn't apologize.", "NTA, however I'm not convinced Mary is the AH either. I agree with you that comparing a pet's life to that of a child is poor form. However, it's possible Mary just didn't know how to relate and was trying with her closest experience. She probably didn't mean any harm. I think if you both just met, calmly explained, and apologized, it'll all be fine.", "NTA, people who think like this have simply never had to face a difficult decision or deal with a truly tough situation, which is why they pretend animals are like people. They are also more likely to abuse their animals when they're sick and in pain, but their selfishness stops them from doing the moral thing.", "NAH\n\nYou are definitely 100% right that a pet’s life and a child’s life are not equivalent, but I don’t think Mary understood how different it is so I would hesitate to call her an AH. She was trying to relate not minimize, she just made a mistake in delivery. A better way to phrase would’ve been “I was a mess when my dog went into surgery, I can only imagine how you must feel with your son going through such serious medical issues.” Hopefully she can learn.", "Hmmm... is Mary maybe just... an airhead?", "NTA\n\n>One friend said, “this is a problem only white developed nation people could encounter, and Mary is actually a bad person.”\n\n100%", "NTA. Comparing an animal's life to someone's son's life is disgusting.", "When I was a teenager we had a dog that we loved so much. The dog was 14 years old when he died, we cried a lot and it felt like I lost a brother.\n\nFor many years, when talking about that dog I used to say I lost more than a pet, I lost a brother.\n\nUnfortunately, 9 years ago my older brother past away, he was my best friend.\n\nSince then I’ve never told again that when my dog died I lost a brother, dogs are awesome (I currently have three) but will never compare losing a brother or a person close to you.\n\nNTA\n\nPS: sorry for the grammar, I’m learning English.", "NTA, but I don't think Mary is a bad person, she just thought she can relate with her dog which she loves. I hope when all of you calm down, you guys will explain to her why her comment was out of line. I don't think she meant harm since she didn't get why folks were upset at first.", "NTA at all. I think the main difference is that when you get a pet, you expect that you will eventually lose that pet (unless you get those tortoises that live 150 years i suppose). It will be sad, and you know it will, but most dogs/cats have a life span of a decade or two. \n\nWhen you have a child, you expect that you will die before your child. You figure you will die maybe in your 60s/70s/80s, and your child will probably be 20-30 years younger than you. They will keep on living after you die. \n\nHaving to bury a pet is sad but generally inevitable. \n\nHaving to bury a child is just about the worst thing a person can ever experience. \n\nTHAT’s the difference.", "My aunt lost her husband a few years ago and she said the worst thing people can do is compare their experiences to her grief, especially when they’re not comparable. \n\n“I know just how you feel, my animal died last month…”\n\nI know for some people, that’s the closest they can relate to a personal loss, but it seems like they just shouldn’t compare as it’s just insulting.", "NTA. I’ve had pets die. It was sad. It does not even come close to the *thought* of losing one of my kids (& let me tell you, that is an anxiety every parent lives with). I can’t even imagine how your family friend feels or felt in that moment. What Mary said was horrible. I get she might have been trying to be empathetic, but sometimes all you can say is “I’m so sorry you’re going through this. I’ll keep you in my thoughts/prayers/offerings.”", "NTA\n\nIt’s just not the time or situation to bring up her own stuff, let alone her dog full well comparing that to the loss of a child. She’s ignorant and self-centred, life will hopefully teach her differently (not thorough tragedy, just maturity). \n\nYour brother should’ve stepped in gently imho, she’s his guest. I understand if he’s embarrassed and lashing out at you (siblings tend to put that on each other to cover). In any case, he’s an adult now and hopefully realizes the situations is what it is down to his gf. It’s up to him to guide her in somehow making this into an apology…heartfelt ideally. I don’t know about smoothing it over, her true colors have shown now. Just hope she and your brother can reflect and grow past this…not your fault at all. Imho \n\nIf they were talking about eg. his gf not wanting kids and being happy with the bond with her dogs, sure. This wasn’t that - context is everything. Please don’t compare those who adore their fur babies with this unempathetic excuse for potential family …who even speaks at such a time? There’s literally no words for the loss of a child. Your brothers gf should google it - linguistic facts. Orphan, widow, widower, none for losing a child. It’s unthinkable let alone to try relating to it like it’s a meme…smdh", "ESH.\n\nWhy can't people just be supportive and compassionate to one-another instead of one-upping who's in more pain?", "YTA. Mary was tone deaf but who cares, it didn’t hurt anyone. Sounds like everyone there is way too sensitive and you all could have easily just moved on with the conversation and not made a big thing about it", "YTA.  Although I never think it's a good idea to share thoughts over a child versus a pet, your brother's girlfriend sounds like she was coming from a place of compassion and empathy with this family friend.  It was her way of being supportive whether you agree or not.  Rather than everyone crucify her for it, I think it should be let go.  I don't believe she owes anyone an apology.  It's a difference of opinion, and her goal wasn't to say dogs matter as much or more.  All she was doing was trying to relate and support the person going through a tough time.  I do think you should have shut your mouth.", "NTA. Outside of reddit, your opinion is completely sane and normal. Unfortunately, reddit is obsessed with pets and fail to understand that the inherent value of a human being trumps that of a pet.", "NTA. I had a friend try and relate to a friend’s mom dying by mentioning his dog dying. It’s so tone deaf. I had to let him know as much as it bothered you that your dog died, that’s literally this man’s mother. There’s no comparing the two. I understand pets are important and they’re no less than a human but they’re absolutely not the same. It sounds like Mary, like my friend, may have had good intentions (to console, relate, and comfort) but somehow doesn’t realize that a pet (more specifically *their* pet) is not on the same level of importance for other people.", "Excellent point.  \nBut many are taught to \"relate\"/empathise by sharing an example in their life that is close to what the other person is dealing with.  This was the closest example Mary had.", "This is the answer I was looking for.  My dog is 100% a member of my family. We (my adult daughter) and I dote on him and will be absolutely DEVASTATED when he passes. HOWEVER, the magnitude of devastation won’t even touch what a parent would suffer in that situation. There is no comparison to be made and any person with an ounce of empathy for others would know this.", "Bingo!", "Or possibly neurodivergent. A lot of neurodivergents, including me, instinctively want to share personal info to show that we are invested and trying to relate to difficult situations.\nIt may be that Mary was trying to show that she was empathizing, but since she doesn't have kids, relating it to her feelings about her dog was the best she could do. It was a bad choice, and OP was definitely in the right to shut her down. But I can also see how she might have gotten there in a totally innocent and genuine way.", "I agree on your point, but for some, expressing empathy is by relating with own experiences. I \"made the mistake\" to talk about the death of my cousin (25F, known heart disease) to my friend's parents whose son had commited suicide; they looked at me as if I was insane. The point was never to draw attention from their loss, but merely to express my understanding (my cousin was like a sister to me).\n\nLastly, I am sorry about your doggo.", "I’m ready to be downvote but whatever. I 100% agree with OP. It’s an unequal equivalent and Mary is the one who needs to apologize. She was hideously insensitive comparing her pet to a child. NTA", "I lost my pup after 14 years last year, have her ashes next to me right now, she was my little girl. I also have a daughter and while I love my pup, I could not even try to comprehend the loss of a child.", "First off, sorry for your loss. I don’t have kids so I can’t say I understand but I can imagine. Maybe I just read the post differently but I didn’t read it as she was being thoughtless, more that she was trying to empathize but obviously didn’t have a kid so couldn’t truly compare but was trying to explain how she understood. Didn’t sound to me like she was comparing a child life to a dog, just trying to empathize. But that’s my take", "I am so sorry you lost a child. My oldest had surgery that has something like 60/40 outcome and I wept like I never had before when they came through it ok. I’ve come perilously close a number of times and those were the worst moments of my life. I simply cannot imagine.\n\nI wholeheartedly agree with you: a pet is a pet. It is sad when a pet dies. It does feel like a little piece of your life is gone. It doesn’t come close to a human life.\n\nFinal thoughts: dog/cat/whatever moms/dads are folks looking to fill the voids in their lives with something and losing the beat somewhere along the way.", "Sorry for your loss", "It's like comparing the death of yourself (because, a kid is basically just an extension of yourself) and a dear friend. Both deaths hurt, but it's not the same type of hurt.", "Yes, in cases like this with extreme grief offer to do things for them!  It is so helpful.  They might not want to ask you, or even have the ability to think of it, but they would still possibly take the opportunity to have one less burden", "Plus, everyone who says OP should have said...something else...has had the time and 20/20 hindsight to think of something better.\n\nPersonally, I think OP was about as politely fair as she deserved at the time. Maybe an apology, but it shouldn't be a 1 sided one.", "I hope one day you gain a sense of moral obligation to other human beings as well.", ">How on earth did she possibly think that was comparable?\n\nI immediately wondered if maybe she's neurodivergent/has something else going on in her brain and didn't realize what she said was inappropriate. But that's all I've got.", "It's no more whacky than a man rushing into a burning house and saving his rubber doll he married over his dog.", "🖤", "And even if you were in the right, what's the point of demanding an apology anyway?\n\nAn apology means something only if it comes from the person giving it, if they realized they were wrong and felt remorseful. If you get an apology only because you demanded one, it means fuck all.", "And yet even after being told her comments were hurtful she’s demanding an apology? \n\nSorry, this girl sounds like a self-centred AH.", "The word is \"owner\".", ">pet parent\n\nPlease stop", "Your not a pet \"parent\". \n\nCloser to a slave owner, because that animal is your property no matter how much love you give them", "Er, no, I would save the person's life.\n\nMind you, I wouldn't call myself a \"pet parent\" either, unless I'd shoved said pet out of my uterus, in which case everyone including me would have a LOT of questions.", ">pet parent\n\nNo. The word is owner, thinking you're a \"parent\" cause you have a cat or something is just insulting to actual parents.", "There are people married to rubber dolls. Their feelings matter as well. That doesn't mean a rubber doll is the same as an actual spouse.", "No. It IS an.animal. Have you ever hit an animal with a car by accident, and reported it like it's a child? Did you have to have background checks to get your dig? Is it legal to buy a child, euthanize it, etc? \n\nStop comparing your feelings for a pet to a child.", "But would you save your cat before a living child? Because that's more of the comparison she was making.", "Good thing it's only your feelings that matter, not the feelings of the stranger, or their family, or friends.", "Yeah, the road to hell is paved with good intentions. She may not have intended it (or she may have, idk, I'm not a scientist), but her actions were still damaging and assholey. I think OP's solution was a little hamfisted but completely in the right in order to try and get that to stop immediately. \n\nEven looking through this with as much grace to her as possible, she doesn't deserve an apology. \n\nNTA", "I totally get that - it’s a shame she didn’t stop and acknowledge someone else’s pain before launching into her own story, and then expecting an apology and someone else to mend a relationship. It seems like she had a lot of time to reflect on her own behavior.", "Well... does the workplace give bereavement leave for family members dying? Most don't allow people to take off to grieve for their pets so I don't know if she showing up means anything. I get the sentiment, it's just an odd thing to say.", "While I agree that there is no comparison between the loss of a child vs a pet, this is not valid evidence of anything. People grieve differently and you may be destroyed and still go to work. This is one of the bigger issues with grief, that people project their own reactions onto others and condemn others for not behaving the way they would.", "Your husband was being an AH.", "Ready to be down voted, all of us so far agree 🤣", "Thank you. That means a lot. It’s been 7 years, but it still stings from time to time.", "Yep. They’re both ick", "Absolutely, OP didn't have the time like we have here to think of a calm response and still think she handled it much better than I would have", "Nah. My cat depends on me for her safety and wellbeing. I love her, I've known her for years, she loves me and trusts me to take care of her. I could never betray that trust for a stranger if it ever came to her vs. a human I don't know.", ">than a man rushing into a burning house and saving his rubber doll he married over his dog.\n\nThat's extremely wacky.", "Actually, I *did* have my house inspected to get that dog, provided vet and personal references. I’ve never hit an animal with a vehicle. But yeah, keep invalidating trauma 😂 \n\nYou’re missing my point. That’s okay.", "And yeah, personally I would try to save anyone I could. Few things in life bubble down to a true either/or situation. I’d save my cat first because she’d likely be right next to me. If a kid also needed my help, I would also save them.", "Was she really though? Or is that just what OP is interpreting it as? Because according to the post it sounds like she was just trying to relate to the stress of having a close loved one enduring life threatening medical issues. There’s nothing wrong with that.", "A different opinion.. are you actually serious this poor woman was talking about the possibility of her CHILD dying and then this other woman who doesn’t know how to read the damn room compared to her pet who almost died but didnt. There’s literally no comparison, her dogs alive he’s not dead and he’s not a child he’s a dog.", "I tired to give an honest answer", "I'd compare the loss of a old dog like loosing a good friend. It sucks. It hurts like hell, but ultimatly you (normally, in some cases not but thats besides my point so I ignore that) can get up and go on with your life. But the connection you have to your kiddo is on a whole other levl than a good friend, maybe even parents(i still have both, and no kids, so no expert here) and jn no way comparable. \n\nJust my thoughts on the matter, had to get it out of my head^^' thanks", "As a boss I've let people take the day off to grieve a pet, but it came out of their PTO, not official bereavement leave.\n\nEdited to add: The company bereavement leave policy was 3 days for a direct relation: parent, child, or grandparent. Any other funerals would require the use of PTO instead if a full day off was needed, where bereavement leave would not.", "I cannot imagine the pain🙁", "That's how I feel about my sweet girl (husky).", "I don’t have anything against feeling that responsibility for your pet. And I think offering up these horrific hypotheticals is grotesque and unnecessary.\n\nHowever, I was responding to the previous poster’s comment insinuating that we don’t have a moral obligation to protect and care for other people.\n\nI think that idea is what’s wrong with the world and why half of the people in America are opposed to socialism, free lunch for school children etc.", "That's the point.", "On what insane planet does being upset that your child might die register in your ridiculous mind as \"nothing difficult in their life\"?!", "I stubbed my toe. It's invalidating my trauma to not see it as being close to losing a leg.", "A couple of things.  The fact that everyone in the room seemed to take it badly suggests it was the wrong thing to say.  Also, when people are expressing their stress and situation, it's not a good look to draw it back to you.  It isn't about relating it to yourself, it's about listening and supporting.  As someone who has had a child almost die, and have a life threatening condition.  If someone said this to me, I would be livid.  Not the time or place.", "No it’s because when you don’t have kids you just don’t understand what the love you have for you child, weather birthed, adopted or fostered is going to be. It’s not comparable to anything it’s not even active love it’s just part of you, you can fall out of love with a romantic partner but the love for you child is just ALWAYs there even if you don’t like them. It’s literally in our DNA to care for our children that’s why they are born so dependent on us unlike most other animals where they are Mobil straight from birth. \nYou can’t compare somethings that’s uncomparable and I’m sorry but as a pet owner and a mother. There are just no similarities there at all, I would pick my child everytime, the responsibility or raising a child is not comparable to having a pet.\nThis woman was trying to compete in something that’s there’s not competition in and now wants an apology for being called out on it", "She was trying to be supportive but failed. OP and his family seem like people who don’t see animals as worthy of love and empathy. That’s what makes them the AH.", "Fair enough, I'm glad you're honest. And to be fair it's a stupid hypothetical. But if I had a relative or a friend or hell, even a co-worker die needlessly because somebody liked their dog more and so chose to save them instead I'd be angry.", "I also think when you get a dog it’s with the expectation you will outlive it. When you have a child the expectation is they will outlive you. I think your comparison is pretty spot on.", "I would like to work for you.", "Father’s Day is criminally under-celebrated across the board. Good dads are everything to a kid and family, IMO.", "Not upset that a child might die, being as upset that your dog died as if a child had died. And then saying that to a grieving parent.", "Um, what?  I was simply explaining what the idiom meant.  If you think it doesn't apply, then blame JustWatchin2021, not me.\n\nI like how my comment is being downvoted for trying to help someone understand.", "I mean at this point you’re mocking clinically diagnosed PTSD and that’s on you. Sorry you lost your toe. Must suck falling over all the time.", "Did you know that neurodivergent people actually do this as a way to show empathy? It’s not intended to be making the situation about them, it’s a way to relate and help the person they’re talking to feel less alone. Idk why people don’t get that, it’s not rude to share experiences.", "It’s not that they don’t see animals as worthy of love and empathy it’s that \n1) they don’t see the love for your pet the same as the love for you child which imo. Is true.\n2) what empathy did the dog deserve it didn’t die it’s fine. \n3) if you want to be supportive you you support the person with there emotions and feelings you don’t take it over it with you own emotions about a situation that’s not relevant to what’s happening", "My sister is obsessed with her dog. She's now 41 and is realizing this behavior has kept her from having friends, kids, and getting married. She often talks about what she'll do when her dog is gone, and it sounds like she's going to be more okay with it than maybe 5 years ago. You can usually get a new pet, but not a child. They're irreplaceable.", "Thank you, I'd love to hire you but unfortunately I left that place and then got laid off by the next one so now I'm job hunting, too.", "But clearly it was upsetting to already hurting parents, who also get to feel how they feel about the comment.  The OP was watching them show visual distress over this comment at a time when they were already overwhelmed.  They said, once again, everyone in the room took it the same way.  So whether intentional or not, it was hurtful to the parent's at their lowest time in life.", "Read the second paragraph again.", "OP actually said the opinion is split between the group, with some thinking she didn’t do anything wrong. Another neurodivergent trait is trouble gauging social situations. If Mary is indeed neurodivergent - and as a neurodivergent person myself, it really seems like she’s showing a lot of those traits. So it’s possible she just didn’t pick up on the cues. Seriously not as big of a deal as OP is making it out to be - some people communicate and share feelings differently than others and it’s shitty when the assumption is that someone is stupid or malicious for it.", "I promise you, as a parent who has been through it.  It's a big deal.  There were times I thought I couldn't go on.  A comment like that could send the parent reeling to really dark places mentally.  Whether intentional or not, pain was caused.  That shouldn't be dismissed.", "Omg how dare someone try to empathize the best way they know how?! 🤦🏼‍♀️ Ffs.", "It's not like she tried to wrap a birthday present and did a shoddy job. She deeply offended a couple preparing for the potential death of their child. How hard is it to say that maybe this person got it wrong in this situation and even though they tried, they made things much worse?"]}