{"id": 1462, "submission_id": "ymjrq0", "title": "AITA for telling my colleague's wife off?", "selftext": "Long story short, my (34F) colleague's (38M) wife is the jealous \"this-man-is-mine\" type. I dont care bout other's relationship unless it affects collabroative work. This man has given excuses after excuses especially when we are in busy period where things just needed to be done. Turned out his wife has more than on one occasion showed up at the office screaming bloody murder if he's not back on time. Ideally no one wants to stay after 6pm but occasionally when things got really rough and a project needed to be delivered, key people stay back so things would be on track.\n\nShit hits the fan during a company dinner (you can bring plus 1) when the wife sarcastically made the remark that I'm the other woman who's always up in her husband's business (my team has a lot of collaborative projects with his dept - I'm the team lead for my team while he's the senior engineer on his team) and often ask him to stay back. Side note: I'm the only woman on both teams. \n\nEvery time we gotta stay back it was never just me and him, its a bunch of corporate slaves that need to get things done. So I'm not sure where this behaviour comes from so I firmly told her off, look at my colleague and told him \"I expect your communication issues with your spouse to be none of my problems\". The rest of my table sat in awkward silent for a good 10 minutes before conversation resumed. \n\nNext working day, his team lead came up to me to talk bout it and although he apologizes for the way his subordinate's spouse behave with me, he also remarked how some of his team members thought I was harsh. Plus, there has been gossip the key reasons I've been single cuz no man would ever tolerate me being the way I am (in other words: workaholic and no pushover I guess). I don't really care bout the gossip but I admitted I could have talk to him bout his personal issues that impact his work performance on the side. However, I dont feel bad about telling his wife off when she so freely said it during a company's dinner as if she has the right to voice it out. \n\nI dont know if I should feel bad about telling her off or not and I sure as hell just want him to perform and deliver whatever he owes my team (and also his).", "created_utc": 1667621507, "permalink": "/r/AmItheAsshole/comments/ymjrq0/aita_for_telling_my_colleagues_wife_off/", "score": 5, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told a colleague's wife off in front of everyone I work with during a company's dinner because she implies I was flirting with her man and some team mates thought I was harsh for doing so.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  I'd like to wax on about the reasons, but I feel so strongly that the wife is cuckooo for cocoa puffs that no logical reason exists except for the fact that she's cray-cray.", "NTA.  I would go to HR with that remark.  \"no man would tolerate you?\". That is bullshit.", "NTA - she opened the door, you walked through it. \n\nSeems she’s used to saying whatever she wants without confrontation. I mean, she was probably intimidated by you to begin with, this probably just solidified that, but if someone wants to run their mouth, they should be careful who they’re running it around.", "NTA.\n\nIt seems like you can't win as a female leader. If you're assertive, someone's going to see you as a domineering b\\*tch. It's not uncommon for women to be accused at work for being \"harsh\" or \"aggressive\" for just being honest and straightforward and doing their job. But if you let things slide, people think you don't see you as a real leader, so that's no good either.\n\nThis woman was so out of line and you were right to call it out. It's also fair to expect your team not to make their personal issues your problem. People are going to give you shit for this, not because it was wrong to do, but because that's what people do to women at work.\n\nBy the way, your colleagues' gossip about you and your love life is totally inappropriate, and you might consider going to HR for this.\n\nThe only thing I'll fault you for is this: it's a bit toxic to perpetuate workaholic culture. As a team leader, you set the example for work life balance - if you work insane hours, it puts pressure on everyone else to work insane hours (yes, even if you don't ask them or expect it).", "You were in the right, of course.  However, I would recommend pulling the husband aside for a personal discussion.  It would have been preferable to keep the guests of the dinner from knowing, if at all possible.", "NTA\n\nYou stated an appropriate boundary. It isn’t like you spent 20 minutes cussing her out.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLong story short, my colleague's wife is the jealous \"this-man-is-mine\" type. I dont care bout other's relationship unless it affects collabroative work. This man has given excuses after excuses especially when we are in busy period where things just needed to be done. Turned out his wife has more than on one occasion showed up at the office screaming bloody murder if he's not back on time. Ideally no one wants to stay after 6pm but occasionally when things got really rough and a project needed to be delivered, key people stay back so things would be on track.\n\nShit hits the fan during a company dinner (you can bring plus 1) when the wife sarcastically made the remark that I'm the other woman who's always up in her husband's business (my team has a lot of collaborative projects with his dept - I'm the team lead for my team while he's the senior engineer on his team) and often ask him to stay back. Side note: I'm the only woman on both teams. \n\nEvery time we gotta stay back it was never just me and him, its a bunch of corporate slaves that need to get things done. So I'm not sure where this behaviour comes from so I firmly told her off, look at my colleague and told him \"I expect your communication issues with your spouse to be none of my problems\". The rest of my table sat in awkward silent for a good 10 minutes before conversation resumed. \n\nNext working day, his team lead came up to me to talk bout it and although he apologizes for the way his subordinate's spouse behave with me, he also remarked how some of his team members thought I was harsh. Plus, there has been gossip the key reasons I've been single cuz no man would ever tolerate me being the way I am (in other words: workaholic and no pushover I guess). I don't really care bout the gossip but I admitted I could have talk to him bout his personal issues that impact his work performance on the side. However, I dont feel bad about telling his wife off when she so freely said it in a company's dinner as if she has the right to voice it out. \n\nI dont know if I should feel bad about telling her off or not and I sure as hell just want him to perform and deliver whatever he owes my team (and also his).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Wife brought it up.  Thus, determined the forum.  Plus her past performances and dinner display set the tone.    In this case, social combat seems appropriate.  Thankfully, it appears that you suffered little to no blowback.   Good Job!", "This is such bullshit.\n\nWrite a detailed account of both situations and send it to your manager, their manager, and hr. Ask them to address the inappropriate and overly personal comments of the engineer and his wife, at a company event. \n\nI don’t understand what they thought would happen when they insulted you right to your face. \n\nAs Reddit likes to say ‘play stupid games, win stupid prizes’\n\nNTA", "NTA -  time and place for everything and she made it a thing at this work dinner.", "An ex female colleague called him after hour once for work purposes (he didnt email her the needed documents) and the wife sent a barrage of insulting texts to her right after for the entire weekends. The next working day, HR was involved. I'm not sure how this man actually work at any organisation with this kind of spouse. He has been with the company longer than me though.", "That sounds like an incredibly frustrating work environment.", "Understood. Personally, I like working but I don't expect others to actually follow my lead. As long as you deliver your due diligence, off you go. That's why I mentioned ideally no one should be at work after 6 and that's something most of my teammates appreciate cuz i told them not to worry if things are not urgent. Tomorrow will still come. \n\nHowever he has on multiple times dragged both teams because he cant commit due to his personal issues. My company reimburse us back when we gotta put in the late hours and it's not like we expect free labour. And it happens probably once in a blue moon. He has also, not respond to work commitments appropriately when it's working hours because he needs to \"check in\" with his wife. Dont ask me what he does but it involves calling/texting her and updating things I guess. \n\nSo yeah, I might be workaholic but I do not expect that of my subordinates. I expect everyone contributes appropriately also to collaborative work and his team has had to cover up (how do I know? Team lead told me - he has also been passed over for promotion early this year due to this).\n\nBut hey, I appreciate your take on this. I should look into myself as workaholic as well. Life is more than just that :)", "Thats what I mean when I had the talk w his team lead. Any office at all have their fair share of gossips and I'm not particularly worried bout it - just miffed at all these events that had happened.", "Granted I have always been known amongst colleagues as the \"feisty\" one. I just take it in stride - there's a reason why some people got to some position, aint it? But boy, this woman sure test my patience and I don't even have to interact, know her, or have whatever it is related to her.", "Oh shoot good advice. I never really thought of writing this event down to HR. Thanks, will do so. Better to cover my bases. I'm not about to be fired cuz someone else couldn't keep their partner in check.", "Hello tech world and its male dominated scene. I love being a woman in tech but holy heck, sometimes I just want to punch the wall", "Oh my... this is even more problematic than I thought, then. Now it sounds like his toxic marriage is not only putting you into unprofessional and inappropriate social situations, but also creating more work and hassle for the rest of the team.\n\nYeah, someone really needed to say something, it was long overdue, and you stepped up. You're extra NTA.", "OP, please do not feel bad and I am so sorry that you had to deal with a helicopter wife who can't seem to let her husband go a bit and let him do his work normally. She sounds extremely insecure and clingy that she truly needs help. I am not sure if your coworker and her have kids and if they do, I feel sorry for those poor kids\n\nMoving forward, I suggest you take your colleague aside and have a private discussion regarding this matter and at the same time, if it gets a bit overwhelming for him with the wife you encourage him to talk to a fellow trusted coworker to allow him to vent out"]}