{"id": 14661, "submission_id": "12k9xzd", "title": "AITA for telling my fiancée’s brother he needs to explain to her why I uninvited him to our wedding?", "selftext": "So I (29f) am getting married to my fiancée “Julie” (33f) next week. Julie’s younger brother “Paul” (29m) has been my best friend for 7 years, and was due to be my joint ‘MoH’.\n\nPaul and I went on exactly 1 date when we were 18, lost contact a few weeks later when we both moved away for college. I moved back into our hometown straight after college and so did he, we happened to be at the same party one night and he made a comment about how weird our date was all those years ago. I agreed and we became fast friends after that. Best friends shortly later. He has been there for me for so many things, and he comforted me when my parents died. A couple of years after we reconnected, Julie moved into town and Paul introduced us. Julie and I had instant chemistry and she asked me out, I told her I’d get back to her after I had checked it was okay with Paul and wouldn’t make him feel weird. I asked Paul if he was okay with it and he assured me that he very much was, and that he was the one who encouraged Julie to ask me out in the first place. Our first date was fantastic, and 5 years later we’re getting married. \n\nI wore my wedding dress for my bridal party (including Paul) yesterday for the first time since I ordered it during Covid and they’ve never seen me wear it before. Everyone assured me that I looked great. Later that night, Paul and I were watching TV when all of a sudden he turned to me very seriously. He told me he had been in love with me for years and that seeing me in my dress overwhelmed him and that he realised the mistake he made introducing me to Julie all of those years ago bc I should be with him. Obviously, I was upset. I told him introducing me to the love of my life wasn’t a mistake and that I needed space and asked him to leave. \n\n2 days later I texted him telling him he was no longer part of my bridal party and that I have to tell Julie what he said but I think it’s likely we’ll agree that it’s best he doesn’t attend at all. I planned to tell Julie when she got home from work. Paul got there first. He told her we had a massive fight and I had been spreading lies about him. She didn’t believe him, ofc. When I told her what happened, she was in shock. She immediately called Paul who denied everything. He was quite convincing and I told him to cute the BS. Julie said she needed some space to process, which I understood. I called Paul the next day and told him he needed to grow up and admit to Julie what happened, not bc she deserves to know the truth of what he said (more than what I can fit in this post). \n\nThis has caused a huge divide in our bridal parties and friends. Everyone agrees that uninviting him was right. But some say me asking him to tell her everything he said is adding insult to injury. AITA?", "created_utc": 1681355655, "permalink": "/r/AmItheAsshole/comments/12k9xzd/aita_for_telling_my_fiancées_brother_he_needs_to/", "score": 898, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I uninvited him to the wedding for confessing he’s in love with me. He admitted to always secretly hoping we’d break up, and that he regrets introducing us, that he had originally planned to object at the wedding but he couldn’t wait any longer. I told my fiancée who agreed we should uninvite him but he denied everything. She was torn and I told him to admit to everything he told me bc she deserves to know the truth. I might be the asshole bc asking her to be told by her own brother all the things he thinks about our relationship and why he’s in love with me might be a step too far.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">But some say me asking him to tell her everything he said is adding insult to injury. \n\nThey are confusing two different things. You are not demanding an expression of remorse for a moral wrong. You are demanding restitution, an act of undoing an injury that he caused to you by lying. NTA", "NTA. But I would suggest stopping all contzct with him for now. Unless at family events then be cordial.\n\nThe more you try to pressure him into telling the truth the more he's going to shut down and the more you look bad. Julie has heard both sides and sounds like she doesn't believe him anyway, it's up to her now what she would like to do about it.", "NTA. I very much enjoyed this fictional story.", "NTA for uninviting and NTA for being truthful with your future spouse. Things like that have a way of getting out. It’s  better to come clean and discuss it now before the wedding. Paul is the AH here, this isn’t a rom com where you dump the fiancée you love for her brother and somehow everyone lives happily ever after. He should have kept his feelings to himself, what he did was incredibly selfish, now potentially no one ends up happy.", "NTA - Paul can pound sand. As satisfying as it sounds, having him fess up might miss its mark if it's a captive audience situation for your fiancé and she's not ready for it.\n\nPaul's already the dick. The truth will make its way out in due time.\n\nLove your fiancé, and congrats to you both!  :)", "NTA, Paul shouldn’t be at the wedding.", "NTA. Truth be told. But need to fix the mess that's been made before your wedding. The what ifs or buts will come back. He needs to own what he said.  Not the way to start a new life.", "NTA\n\nHow is asking him to retract a lie and tell his sister the truth “adding insult to injury”?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I (29f) am getting married to my fiancée “Julie” (33f) next week. Julie’s younger brother “Paul” (29m) has been my best friend for 7 years, and was due to be my joint ‘MoH’.\n\nPaul and I went on exactly 1 date when we were 18, lost contact a few weeks later when we both moved away for college. I moved back into our hometown straight after college and so did he, we happened to be at the same party one night and he made a comment about how weird our date was all those years ago. I agreed and we became fast friends after that. Best friends shortly later. He has been there for me for so many things, and he comforted me when my parents died. A couple of years after we reconnected, Julie moved into town and Paul introduced us. Julie and I had instant chemistry and she asked me out, I told her I’d get back to her after I had checked it was okay with Paul and wouldn’t make him feel weird. I asked Paul if he was okay with it and he assured me that he very much was, and that he was the one who encouraged Julie to ask me out in the first place. Our first date was fantastic, and 5 years later we’re getting married. \n\nI wore my wedding dress for my bridal party (including Paul) yesterday for the first time since I ordered it during Covid and they’ve never seen me wear it before. Everyone assured me that I looked great. Later that night, Paul and I were watching TV when all of a sudden he turned to me very seriously. He told me he had been in love with me for years and that seeing me in my dress overwhelmed him and that he realised the mistake he made introducing me to Julie all of those years ago bc I should be with him. Obviously, I was upset. I told him introducing me to the love of my life wasn’t a mistake and that I needed space and asked him to leave. \n\n2 days later I texted him telling him he was no longer part of my bridal party and that I have to tell Julie what he said but I think it’s likely we’ll agree that it’s best he doesn’t attend at all. I planned to tell Julie when she got home from work. Paul got there first. He told her we had a massive fight and I had been spreading lies about him. She didn’t believe him, ofc. When I told her what happened, she was in shock. She immediately called Paul who denied everything. He was quite convincing and I told him to cute the BS. Julie said she needed some space to process, which I understood. I called Paul the next day and told him he needed to grow up and admit to Julie what happened, not bc she deserves to know the truth of what he said (more than what I can fit in this post). \n\nThis has caused a huge divide in our bridal parties and friends. Everyone agrees that uninviting him was right. But some say me asking him to tell her everything he said is adding insult to injury. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA. Dudes been carrying a torch for years then drops it on you as you are about to get married to his sister. Instead of keeping his mouth shut and moving on he starred drama between you and your fiancee and friends.", "Yes, I’ve been struggling to find the words to explain that. Thank you.", "I don’t think he will be at many family events, he doesn’t usually go to many of them fortunately. He’s already told their parents who agree he shouldn’t be at the wedding.", "Totally agree, NTA. If there was ever a known potential for a “does anyone object” issue it is Paul!", "[deleted]", "NTA. Demanding he correct his lies is perfectly acceptable behavior.", "That's just bs", "You’re neither aiming to insult or injure him. \n\nYou’re asking him to not lie.", "NTA \n\nBUT. It seems likely to me that he’s not actually in love with you and probably doesn’t really believe that you should be with him. I think he probably just got caught up in the romance and certainly felt jealous of Julie that she’s the love of your life and now things between you will change. \n\nIt can be really hard when your best friend gets married. I’m sure he loves you and wants you to be happy and maybe he’s just a little sad that he’s not that for you and he doesn’t have a love in his life like the one you have- even if he doesn’t really want that for the two of you. \n\n7 years of friendship is impossible to hide a desire like that. If it was genuine- you would know. If he was secretly harboring “I wish I could stay with you” after your movie nights- you would’ve picked up on it. The fact that it came as an outpouring after seeing your dress makes me think he’s having a personal come apart that is more like misplaced emotional vomit. \n\nMaybe give him a chance to explain what the heck is really going on and tell him that he’s being an idiot. See where that gets you.", "NTA. He should not be at the wedding.", "NTA. Unfortunately I do not see this having a very happy ending. So many eventualities. Someone is going to be hurt.", "Except he's not 'in love'. He just covets. \n\nSomeone in love with someone else wants what's best for that person - and wouldn't dream of messing up the other person's wedding just to splatter her with his unwanted declarations when he was fully aware that they WERE UNWANTED.\n\nPaul doesn't actually care about OP. He just built a *fantasy* version of OP in his head and is pissed that the IRL version of her isn't following the script he wrote for her.", "NTA. After that he doesn’t belong in the Bridal Party.", "If every person you know, including Paul's family, told you they agree with you, why did you need to post here? It seems pretty obvious that your fiancee would demand an explanation as to why her brother is uninvited from her wedding, so I'm not really buying the idea that you need to know if it was an AH move to tell her why.", "It’s “My Best Friend’s Wedding” with a lesbian twist! Ehh, not bad. 6/10.", "NTA\n\nHe's your fiances brother. He didn't think through his actions and when there were consequences he hit the gas and lied his ass off because he couldn't unring that bell. How he treated you and his sister in the aftermath is all I need to know about this guy. He messed up- a good person takes responsibility, instead he tried to undermine and break your relationship. I feel so bad for both you and your fiance.", "NTA I swear when it comes to weddings people just lose their minds.", "NTA! OP, I’m so sorry for you AND Julie, you both just got a horrible shock to the system. Paul definitely should not be at your wedding, and he should apologize to Julie for trying to throw you under the bus. Congrats on your upcoming nuptials though, may you both have a lifetime of happiness and joy!", "ESH. Paul for being a dick but I think you messed up by not talking with your fiancée's during the two days between when Paul pulled his stunt and when you uninvited him.", "YTA for not telling Julie immediately what he said to you and telling Paul that he would likely be uninvited from his sister’s wedding without talking to her first. This lack of communication and unilateral decision making is not a great foundation to your upcoming marriage. You are within your right to not want him in your bridal party and he shouldn’t be nor should he be at your wedding but you handled it poorly, Paul got the jump on you and now it’s blown up before Julie could contain the fallout and she is the most impacted.", "Nope. NTA. Paul definitely shouldn’t be at the wedding.", "NTA. He's trying to break you two up. If he succeeds, he'll be back at your door, professing his \"love\".", "Yeah, does Paul think this is a TV show where OP will suddenly realize she was meant to be with him all along while she's planning her wedding to his SISTER? Please.", "This makes me laugh because it totally happens! My husband's best friend told me AND my husband twice on my wedding day that it \"could have been him\", completly butt hurt. This guy didn't like me at all, he was just bummed that his friend was moving on to the next stage of life without him. But the way he said it you would think that he'd carried a torch for me long before my husband met me.\n\nFunny thing is, my husband asked him who I was the week we met, and the friend said \"oh that's X, she's got like 12 cats\". I only had two lol, but I used to talk about cats to the idiots at my work if I wanted to stop the conversation from going into gossip about other people.", "He told his parents the truth but not his sister? Yeesh. \n\nSorry you're facing this. What a jerk.", "Well sure, redditing at 3am, that's what I meant. Paul is obsessed.", "NTA. If he has enough balls to spout it, he needs to have enough balls to tell the truth about it.", "NTA honey, just Elope. Save the money for a down payment on a house. Live happy and never speak to Paul.", "I knew from the start where this story will end. NTA", "NTA - she has a right to the facts from the source", "Nta\n\nYou know that he's going to object to the wedding if he's there right?", "NTA besides the fact that you deserve the truth to be told to Julie, Paul is her brother. He is not some friend that can easily be cut off - he's her family and will be around. So if he doesn't admit it, it'll continue to be a problem.", "NTA because your asking him to undo the damage he did by spreading lies", "NTA. Of course he needs to tell her, he’s got no right to torpedo your relationship by lying.", "Please update", "NTA\n\n> But some say me asking him to tell her everything he said is adding insult to injury.\n\nWhat injury?\n\nThe only person who has been wronged here - twice no less - is you and your fiancée.\n\nIt is never appropriate to confess feelings of love to someone in a relationship - that alone is a bid to break a couple up or to have an affair. That alone is enough to justify uninviting someone from the wedding/bridal party.\n\nHe then admitted he doesn’t support your relationship and planned to object in the ceremony. \n\nBoth are reasons to uninvite someone from a wedding; particularly that last one. \n\nIt should also be expected that you tell your partner what happened.\n\nBut then. BUT THEN.\n\n\n*He lies about what happened, defaming you in the process*. Could be an attempt to salvage his reputation, could be another attempt to damage your relationship so the wedding would get called off and he could have an opportunity to woo you, or just basic retaliation. \n\nPaul hasn’t been injured.\n\nYou AND Julie have been wronged by him.\n\nJust, damn. The number of people who care more about protecting the feelings of a man over concern for the people he was willing to hurt is depressing.", "Paul is not an asshole. He's a fake person. Much much worse. He spreads lies and unfaith.", "NTA", "Paul sounds like a manipulative two faced little shit.\n\nNTA. I’m not sure why Paul can’t own up to his lies. He is actively sabotaging your relationship.", "ESH. Paul should have kept that to himself. But it didn't need to be a deal breaker. People have feeling for others all the time. He was a great friend to you for years and you dropped him completely, uninvited him to the wedding and and to blow up his relationship with his sister. He didn't ask you to act on his feelings. He just confessed to his best friend.\n\nI think you blew up a lot of relationships needlessly. He didn't kiss you or ask anything of you. It is always good to be loved and it is always hard to be rejected. You could have been really gracious and said something like, \"Thank you for telling me that. I know it was hard to say. You are my best friend and I will always be grateful to you for giving me the love of my life, and making you my brother. I can wait until the right woman comes into your life. She'll be so lucky to have you.\"\n\nFix this.", "NTA he is but I am definitely subscribing to this because I really want an update I hope everything works out for you I can't believe he done that from now on record all conversations with him there are a load of secret apps you can download on your phone from play store or app store that can let you record and nobody will know", "NTA. He lied and put you in a position where you felt your fiancee needed to hear it from him that he lied. She may still be misled about what happened! It's not rubbing it in to demand he fix it.", "The cat convo sounds like a great shutting people up strat 😂", "He’ll end up “injuring” himself all the same when he undo his lies. Stating that that isn’t her intention is just an excuse to sound more morally right. She wouldn’t be wrong for trying to do so though but she should just admit that she does want to undo the wrongs that he did in addition to hurting him as a form of revenge.", "WTH are you talking about? He hurt himself AND her. She is trying to undo the her hurting part. If that hurts him, tough titties. He brought that on himself. Why would she want ylto hurt him, he was her best friend untill this shitshow happened.", "You said it, he WAS her best friend until this incident. Imagine yourself in her place, some guy whom you rejected got butthurt and went on to spread harmful lies about you, could you still expect her to call him her best friend. And after that, it’s only natural that she would want to fix her reputation and in turn, ruin his. Both the intent of undoing and the intent of reprimanding are there. Nothing wrong with that"]}