{"id": 14772, "submission_id": "12luk9y", "title": "AITA for calling my bf cruel for wanting to abandon his guinea pigs?", "selftext": "So my (16M) boyfriend (15M) has guinea pigs.\nHe has three in total, two females and one male, they're adorable and I'm pretty attached to them.\nRecently, one of his females got pregnant and he was really pissed because they're always separated but she still somehow got pregnant.\nAnd now, he wants to wait until one of the females gives birth so he can kick both of the females out (including the babies) out in the street and only keep the male. I told him this is extremely cruel because guinea pigs aren't meant to be outdoor animals, that they will die terribly, that his male guinea pig will be lonely and that he should try at least selling them or giving them away. But he always tells me it's \"impossible\" because \"nobody wants\" guinea pigs and that it's too much work to even try. And when I got pissed and yelled at him  for unreasonably treating his guinea pigs like that and called him cruel. He got upset and said I care more about his guinea pigs that him and called me an AH, and that they're just animals that will probably be fine on their own.\nAITA?", "created_utc": 1681472926, "permalink": "/r/AmItheAsshole/comments/12luk9y/aita_for_calling_my_bf_cruel_for_wanting_to/", "score": 61, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took was yelling at my boyfriend and calling him cruel, and the reason it might make me the asshole is that he got upset with me for caring \"more\" about the guinea pigs than him and refuses to talk to me about it now.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "wow. NTA\n\nkeep the guinea pigs and get rid of the boy", "NTA - He shouldn't have pets. Tell him to take the guinea pigs to the SPCA. They'll take them and find loving homes for them. Also tell him guinea pigs MUST have a companion. Keeping a single guinea pig is cruel.", "Treatment of animals is a show of character. Let that sink in. NTA", "NTA. Guinea pigs are pets, not wild animals. If he let them run in the wild, they'll die within days (if not hours). No way they will survive.\n\nTell him to at least TRY to put them up for free, or at least drop them at a shelter. Some of them take those kind of pets, not just cats & dogs.", "NTA. You're right, he shouldnt have pets if he doesn't want to deal with the responsibility. And tbh if I was in your position, I'd be looking into who to report him to if he does do it.", "NTA\n\nIt is not only cruel behavior, but also illegal for good reasons. He can have the male castrated and keep all three. The babies he could bring to an animal shelter or at least get some advice there.\n\nWho can't keep up the responsibility, should have no animals in the first place.", "NTA. Your boyfriend shouldn't have pets if his first response to an issue with them is to abandon them outside. \n\nThis would be such a red flag for me, OP. Cruelty to animals and a lack of empathy like this speaks to a lot of other potential character flaws.", "NTA in most countries it is also illegal to release animals into the wild. For the environment it is actually better if the released animals die rather than become an invasive species.\n\nIf he can't take care of the guinea pigs responsibly, then he should give them up for adoption.", "Absolutely NTA. He's irresponsible and cruel. He sentences his pets to death by letting them out in the wild. Contact his parents if you can and explain the situation. It's best to give the pets out or even try to contact a local pet store. I had rabbits and when they accidentally had babies we sold them to the pet store with no problems. If I were you I'd care about the guinea pigs more than the bf too. They're never \"just animals\". They're living breathing creatures that should be seen and treated as family members. They're not toys a person can just throw out.", "NTA. Your boyfriend isn’t capable of taking care of his animals if he thinks like this. I hope they end up in good hands.", "NTA\n\nI don't normally advise this, but ditch this guy and take the lady pigs (even just to rehome)! It's a very concerning situation when somebody is trusted with the care and health of an innocent life and chooses to hurt/end that life for personal gain. Generally speaking, that's not the kind of person one wants to spend their time with.\n\nSave the pigs!", "NTA.\n\nAnimal cruelty as a child is a known precursor to sociopathy as an adult. I would recommend moving on.", "NTA. His route is a cruel way of expressing his acknowledgement that he can't take care of these guinea pigs, and he needs to search out an organization that will find good homes for all of them, including the male, which is unlikely to survive long in isolation after having companions for all this time. Your reaction was not overreacting, it was spot on.", "Keeping one male seperated at all times was already a cruel idea. \n\n\nMaking a little ad online, craigs list or something similar, is basically no work at all. \n\n\nYou bf sucks hard here. He doesn't even has the bare minimum guts to bring them to the vet or kill them himself. \n\n\nHe is old enough to know better.\n\n\nNTA", "NTA \n\nHow can he be upset with them? He should get the male neutered and can bring bBies to an animal shelter when. They are old enough. He really should surrender all of them. He was already treating them poorly by keeping the male alone. They're social animals. \n\nAnd typing guinea pig rescue into Google is literally zero effort. Im sure there's so.eone who would help amd at least at the shelter they'd have a chance at a better life. This experience should serve as a lesson to him to have empathy for animals in his care. Knowing how to care for them AND provide enrichment activity is part of animal husbandry. \n\nYou should probably also see this as a red flag since instead of listening to you and keeping an open mind,, he's accusing you of caring about the animals more than him and calling you names. You also deserve better.", "Wow. NTA. He sounds incredibly cruel or stupid. Firstly, pets should be neutered if you don’t want them having babies. Also they are love animals and not stuffed teddy bears. They are completely dependent on you for food and safety. To essentially muster them and in such a way as to simply abandon them is so heartless. I could never be with someone who treats animals that way and think I’m the ah for caring.", "NTA. Your BF is a totally, cruel AH. Those poor guinea pigs will very likely die. In most places abandoning your pets on the street is also illegal, even more so if they are not native animals. \n\nAlso how he kept them before was already bad. They are herd animals and should have been together, but seemingly the male was alone most of the times until an accident happened. He should have gotten the male guinea pig castrated. \n\nHe is totally irresponsible and his parents by the way, too. Though at 15 he should be even old enough himself to know better.\n\nAnd what he wants to do with his pets now, is just really cruel. \n\nPersonally I wouldn't want to be together with someone like him.\n\nThough for the sake of the poor animals, speak with his parents, siblings, whoever you know of his family and hope that someone of them is against animal cruelty. It is possible to find a new home, though not easily, but he and his family should try and otherwise suck it up and keep all.", "NTA. \n\nI’d take those babies in a heartbeat if I could. There’s always someone who wants Guinea pigs — my local PetsMart can hardly keep them in stock. He’s definitely the AH for wanting to abandon these helpless domesticated animals in the wild. He’s giving them a death sentence if he does that.", "YTA. After you expressed your opinion once, you had two reasonable ethical choices: keep your mouth shut or volunteer to find the guinea pigs a home. Otherwise, it is not your business.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my (16M) boyfriend (15M) has guinea pigs.\nHe has three in total, two females and one male, they're adorable and I'm pretty attached to them.\nRecently, one of his females got pregnant and he was really pissed because they're always separated but she still somehow got pregnant.\nAnd now, he wants to wait until one of the females gives birth so he can kick both of the females out (including the babies) out in the street and only keep the male. I told him this is extremely cruel because guinea pigs aren't meant to be outdoor animals, that they will die terribly, that his male guinea pig will be lonely and that he should try at least selling them or giving them away. But he always tells me it's \"impossible\" because \"nobody wants\" guinea pigs and that it's too much work to even try. And when I got pissed and yelled at him  for unreasonably treating his guinea pigs like that and called him cruel. He got upset and said I care more about his guinea pigs that him and called me an AH, and that they're just animals that will probably be fine on their own.\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Abandon, or re-home?", "Why would you be interested in relationship with someone who is abusive to animals?", "NTA. You can drop them off at pretty much any pet store; babies especially will be taken in immediately by them. Your bf just sounds lazy and irresponsible.", "No one wants Guinea pigs?\nNo, if I would live near you I would take them including the Male. \n\nNTA", "NTA. It is absolutely cruel to abandon domesticated animals like guinea pigs, especially in a way that would cause them to suffer and potentially die. Your boyfriend has a responsibility to take care of his pets and provide them with a safe and healthy environment. It is not fair to simply kick them out onto the street, where they would be at risk of getting hit by a car, attacked by other animals, or succumbing to illness and starvation.  \nIt's also important to note that selling or giving away pets is a common and responsible option for pet owners who can no longer care for their animals. Your boyfriend's claim that it's \"impossible\" to find someone willing to take in guinea pigs is likely not true, and even if it were, it's still his responsibility to make every effort to find them a new home rather than simply abandoning them.  \nYour boyfriend's response, accusing you of caring more about the guinea pigs than him, is unfair and manipulative. It's possible to care about both animals and people, and in this case, you're simply advocating for the humane treatment of living creatures.", "NTA he’s an AH!! Look at how he treated his pet after finding out it’s pregnant 😒 he doesn’t deserve it and it reflects his own character", "NTA You’re both very young, but mistreatment of animals at a young age is very worrisome behaviour. You should speak to a trusted adult so that the animals are treated humanely and your boyfriend gets help. I am not saying it will lead to something worse, but abusing an animal, and abandonment would be abuse, is not something to take lightly.", "NTA - Cant your bf find a good home for the piggies if he doesnt want them? Im sure there are plenty of people that would adopt them! Especially new born babies, you could even sell them and make a profit.\n\nIncredibly cruel to suggest just kicking them onto the street - red flag suggesting your bf is not a good person", "NTA. Break up with this dude. He's irresponsible and cruel.", "NTA! Obviously the guinea pigs can’t make it alone. I have bunnies, so my advise is bring them to a rescue and they’ll find them a new owner. And don’t let the male live alone please. Getting spayed them, I know it costs a lot, but they are suffering to live alone.", "NTA. Steal all 3 pigs and take them to the SPCA.", "NTA. Offer to take the Guinea Pigs off his hands for him, and rehome them yourself. Then break up with this ignorant, heartless monster. If he treats animals this way, how does he treat other people (besides you)? Red flags waving here!", "His attitude is sickening. NTA", "Tell him to get them spayed and neutered and he will literally not have this issue.", "Nta\n\nHe shouldn’t be allowed to have pets. Can you take the pigs and rehome them? If you can, get them and then dump that kid. He’s too immature to be dating or own animals", "NTA. Your boyfriend is disgustingly comfortable with animal cruelty and basically killing them. Not ok in the slightest.", "Wow, this would be a deal-breaker for me. It's animal cruelty. Even if he didn't end up going through with it, I'd never be able to look at him the same way again. NTA.", "Haha, I wanted to say the same, but didn't dare.", "Thanks, I'll ask him to take them to the SPCA, I really don't want them to die alone outside.", "That sink can come back with a warrant.\n\n(JK, totally agree with you, just couldn't resist)", "I can't contact his parents, his mom's fine with this behaviour and she's even done it to one of his previous guinea pigs..\nAnd the pet store option, he refuses to try it because he \"knows\" the pet store won't accept them.", "Sadly, I can't take them in. I live rather far from him and I already have two male guinea pigs myself.", "Why would I keep my mouth shut if he's unreasonably giving the poor things a death sentence for something that isn't even their fault? It's cruel.\nEither way, as much as I'd love to take them in or volunteer to find a home for them, I live extremely far away from him.", "Animal cruelty should be everyone's business.", "Ah yes, let's keep our mouths shut while the boyfriend decides to dump his Guinea pigs onto the streets. Which is an offense in most countries. \n\nPeople like these are reasons why animal shelters use a lot of resources to nurse animals back to health because someone couldn't be arsed to make a phonecall with a local shelter.\n\nHe's clearly irresponsible and shouldn't own pets if his first response is to dump his own pets onto the street.\n\nAlso OP, please and I beg of you please try to reach out to a shelter or put the Guinea pigs up for adoption.", "Abandon, like leave out on the street to die.", "Also agreed.  \n\n\nIt's a test of a person's character.  \n\n\nIf they would do this to a defenceless animal why would you want to be with them.", "Honestly I'd do it yourself, I wouldn't trust him at all with it. He could say he's going then dump them. If he's gonna abandon them anyway then he shouldn't complain if you just take them to a better place.", "It makes me so angry I wanna scream. This woman is an animal abuser and is raising another psycho. Talk to your parents then, please. Maybe they'll be able to take the pigs at least for a day or two to figure out what to do with them or to check if pet stores will be willing to take them. Please, don't leave them alone cause I'm about to cry. Poor babies deserve so much better", "Then at least take them long enough to find decent homes for them! These are living creatures and your boyfriend is the most disgusting thing I've heard of in a while. The fact that you are even maintaining a relationship with someone who would consider doing this makes you nearly as much an AH as he is. Please redeem yourself and rescue those poor animals. It's not like they are horses.", "Wow.. how can you be with a inhuman person who plans on killing innocent animals?\n\nHe‘s the AH. But maybe you should think wether a heartless and irresponsible person like this is really what you‘d aim for.", "I'd love to take them in but I can't do anything seeing as I live extremely far away from him (whole different countries), and my parents can't do much in that scenario either.", "As I've stated before, I can't do anything about it when I literally live across the globe from him :(\nOnly thing I could do is convince him to take them to a shelter before the female gives birth.", "That's so heart breaking. Idk what else to say. This boy is a massive AH and I hope you'll be able to change his mind 😞", "Sorry, I did not realize that you were quite so far away from him. If he cares anything about your relationship you might be able to leverage that into getting him to take them to a shelter, but I rather doubt it. I still think this is a relationship that needs to end because this is not a good person.", "It's alright, I'll try my best to convince him not to kill them."]}