{"id": 14782, "submission_id": "12lup7v", "title": "WIBTA If I Told my Mom im 18 and Can Buy What I Want?", "selftext": "I turned 18 in February and will be attending uni in the upcoming fall. I don't want to sound like the kid who says \"im 18 I can do what I want!\" but I feel my mom has gone overboard.\n\nI am not a big spender at all. I have friends who blow through entire paychecks and such but I do not. I work a steady decently paying job for a high schooler (bookstore) and save 99% of my checks in a savings account. I don't go buy anything a lot,, but what I do buy are books. And usually when I buy books they are free, heavily discounted or are second hand and discounted. I rarely buy new full price books.\n\nI'm a voracious reader and love books. Hence the bookstore job. I am quite good at limiting myself to buying new books only after I finish my TBR but I made an exception and my mom is pissed. One of my fav books of all time is The Invisible Life of Addie Larue, and there is a stunning special edition I have wanted FOREVER but its always $250+ on my thrift app so no way. Well, as they released it now as the illustrated version, Amazon has it for $25. I ordered it. It shipped today so I told my mom as she also loves this book and she went off. She said I know better then to spend more and have to ask her first. I tried to explain its supposed to be different than the original which is why I bought it (im pretty sure there is exclusive content?) but she wouldn't hear it.\n\nHere is where I am conflicted. Every other adult in my life thinks its weird she makes me ask her for permission cause I only use my money that I make and I am now 18. My guidance counselor who I've known for 4+ years says im fine and I'm an adult and my boss thinks its odd as well and always jokingly reminds me im 18.\n\nThis book will arrive at some point and our argument was cut off by me going to school and I know when it does I can't hide it from her so my plan is to tell her finally that I am an adult and have always been responsible and it's my money or something along those lines but I'm afraid I'll come across as an ungrateful asshole.\n\nWIBTA?", "created_utc": 1681473263, "permalink": "/r/AmItheAsshole/comments/12lup7v/wibta_if_i_told_my_mom_im_18_and_can_buy_what_i/", "score": 93, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I will sound like an ungrateful asshole if I tell her I can buy what I want\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Everyone's covered the NTA.\n\nI'm just going to suggest that if you have a bank account from before you were 18, aka, one your mom had to sign off on, that now may be the time to change over to a sparkly new one. (In theory removing her should be enough, but I'm the kind of paranoid who does overkill just to be sure)\n\nIf she's this controlling over a $25 book, I'd hate to see what she'd have to say about ordering doordash when you're having a busy weekend in college and decide to grab some lazy food.", "NTA, but I would suggest going about it differently. \n\nSince it sounds like you still live at home, your mom is probably also crazy anxious about you leaving “the nest” and stepping out on your own, and has built up an incredible amount of thoughtful worry about your future, including your financial future. \n\nKindly, patiently, and quietly sit her down and ask her why she thinks you should ask her about purchases with the money that you’ve earned. Then listen quietly and patiently, and instead of rebuttals and arguments simply ask more questions. There might be something deeper from your moms past at play here you aren’t aware of, and it’s a chance to build a better relationship instead of causing a rift. \n\nAsking questions is an amazing way to bridge gaps and heal hurts.", "NTA. Your mom sounds controlling in this case, and the fact that it took other adults in your life to point out her behavior because you didn’t notice it concerns me. \n\nYou are 18 and can do what you want.", "NTA Understand, though, that your mom’s iron fist over your spending is controlling and abnormal, and your rational response to her irrational mindset probably won’t go over well.", "You work, you earn the money being spent, you are 18.... i am at a loss as to how or why your mom thinks she has any power over what you buy. Its a book not a bag of meth", "NTA - You’re right, you’re an adult and do not need your mother’s permission to make purchases. She sounds overly controlling and like she has confused your perception of what normal parent/child boundaries look like.\n\nYou sound very responsible, and it makes sense to get something for yourself every now and again. This wasn’t even a very expensive item or anything. Many budgeting advice recommends keeping 50% for needs, 30% put into savings, and 20% for fun money. You’re allowed to adjust those numbers however you see fit, but the point is that you have a balance, and only *you* are allowed to set those limits and find the balance that works best for you.", "Did you miss a 0 there or is this really about 25$?\nAt 18 you're not really fully an adult, and it makes sense for parents to still try and teach their children to be responsible with money. But if it's 25$ or even  250$,  it's a one time purchase using your own money, and you're not buying anything dangerous/harmful/illegal, it's really not your mother's business.\nNTA", "NTA\n\nTf is wrong with your mother?\n\nI can understand if you’ve had financial issues or binge shopped in the past but that doesn’t seem to be the case. Also your age isn’t relevant, it’s your money, you do what you want with it (as long as it’s legal of course). I’m 18, but I’ve been buying whatever I’ve wanted since I was like 8 or 9, because my parents trust me to be responsible. Over the teen years, that trust has elevated as I’ve shown I can indeed save money for goals, learned to have safety money, and to only spend a certain % of income - sure every now and then I splurge a bit too much, but who doesn’t?", "NTA and please check your savings account and make sure she has no access to it.\n\nEdit: she's angry because her kid bought a book, I hope OP updates this and says its all some big joke. \n\nIf its not a joke, then your mom is abusing you OP, I'm sorry.", "NTA\n\nYour mother did all that over 25 dollars? You work and you bought that book with your own money. I don't see the problem here.", "NTA\n\nYou have a hobby you love and you spent money towards it. You are not in the wrong for spending your own money on something you want. I'm very similar to you, I love reading, I hoard my money, but every now and then a special edition calls for me. I've spent $120 on a limited edition board game as well as a few hundred total on various limited and special edition books/signed books. \n\nYou are allowed to purchase things. It sucks that your mom is having a bit of a hard time trusting you, and it could be for dozens of reasons, but it's important to know that you are indeed not wrong and she is the one who needs to open up to letting you make independent choices.", "NTA. Tell her I'm she doesn't  drop it you will no longer discuss your purchases with her. You don't  need her permission for anything.", "NTA! I'm sorry to tell you this, but your mum sounds super controlling. You make your own money working and you are 18, she can give advices to you but there is NO WAY she can control what you buy, it's simply wrong. You made a great deal buying a treat for yourself for once, I hope your mum chills out because you sound like agreat kid, have fun with the book <3", "NTA You should probably have a talk with your mom though. Maybe ask her if you have ever given her reason to believe you will not be responsible. Maybe framing it that way will help her see things more rationally. Let her know you feel she has done well raising you and that you need her to trust that. You sound like a good kid, so keep that in mind. Also ungrateful AH's rarely worry that they will sound like ungrateful AH's.", "NTA. You are an adult, and your mom is in for a real wakeup call regarding how much she can still control you. \n\nYou could light your money on fire in front of her, and you'd still be in the right, as it is your money and you're an adult.\n\nAlso, seriously, I thought this was going to be about something really expensive. She's mad you bought something that cost $25? \n\nOP, I would start making moves to distance yourself from your mom. You control your life. She does not.", "YWNBTA.\nIf she gets angry at this, as she very well may, tell her the two of you need a sit-down talk.\nIn fact, it might be best to prepare for one regardless, and put into words exactly what behaviour you want her to stop.\n\nShe's being crazy controlling over $25, so she's not likely to see sense from 1 statement and a shouting match.", "NTA.", "YWNBTA! It’s your money that you earned, you’re allowed to spend it how you like. Does your mother have access to your bank account? Cause I would but that off real real quick if I was you.\nEdit: Also, $25?! Come on, that’s not bad at all when you’ve seen it for over $250+!", "NTA: My 8 yo has more freedom than you when he has money and likes to spend it if it’s within what he has and not ridiculous or dangerous. \n\nAnd he quite good with money your Mum really needs to back off a bit if she doesn’t I seen it often adults who have no idea about money blow through it at the first chance.", "I came here for the title expecting that the purchase would be something absolutely ridiculous for an 18 YO. But $25 for a book that’s normally $250? That’s an incredibly reasonable purchase. \n\nNTA. Although if I might offer some unsolicited advice, maybe make a simple budget spreadsheet to show your parents? You are legally an adult, but understandably still learning/developing and this likely comes from a place of concern. Showing them your thoughtful money planning could go a long way towards them seeing you as more of an adult and maybe avoid future conflicts.", "NTA. maybe this is a fear of you growing up thing.\n\nWhen I was first year uni I waited for a year for a half price sale for a copy of this massive neuroscience textbook. It was still about $150 and I didn't even have a job at the time. I used my student loan money. So you're way more responsible than me and I never would have dreamed of asking my mother's permission to get it.", "NTA, sorry your purchase has been tainted, I hope you can still enjoy your beautiful book. Keep saving money, but it's ok to treat yourself once in a while. Let mom cool off and express your feelings again. Hope it works out", "NTA I agree with the other adults in your life", "YWNBTA as your boss says you are almost 18 and it your money you have every right to spend it whenever you want", "Info: Are you behind on rent payments or other financial responsibilities? That's the ONLY reason I could possibly see you potentially being TA, but it really doesn't sound like that's the case. \n\nAlso, $25 for a book that's normally $250? Not only is that an AMAZING deal, but $25 is not a lot of money and won't impact your savings account in the grand scheme of things. I really hope you buy and enjoy it OP, you deserve it.", "Are you paying rent?", "INFO\n\nHi, I suppose you still live with your parents/mom though and don't pay for rent, food and utilities?\n\nDo you help around the house?\n\nI suggest you also start giving your mom a portion of your earnings if you want your argument of it being your own earned money to fly. If you do contribute a bit financially, then yes, you can say you can do whatever you want with the rest of your money. But as long as she still helps you with money by housing and feeding you for free, she technically can still have a say in your spending.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI turned 18 in February and will be attending uni in the upcoming fall. I don't want to sound like the kid who says \"im 18 I can do what I want!\" but I feel my mom has gone overboard.\n\nI am not a big spender at all. I have friends who blow through entire paychecks and such but I do not. I work a steady decently paying job for a high schooler (bookstore) and save 99% of my checks in a savings account. I don't go buy anything a lot,, but what I do buy are books. And usually when I buy books they are free, heavily discounted or are second hand and discounted. I rarely buy new full price books.\n\nI'm a voracious reader and love books. Hence the bookstore job. I am quite good at limiting myself to buying new books only after I finish my TBR but I made an exception and my mom is pissed. One of my fav books of all time is The Invisible Life of Addie Larue, and there is a stunning special edition I have wanted FOREVER but its always $250+ on my thrift app so no way. Well, as they released it now as the illustrated version, Amazon has it for $25. I ordered it. It shipped today so I told my mom as she also loves this book and she went off. She said I know better then to spend more and have to ask her first. I tried to explain its supposed to be different than the original which is why I bought it (im pretty sure there is exclusive content?) but she wouldn't hear it.\n\nHere is where I am conflicted. Every other adult in my life thinks its weird she makes me ask her for permission cause I only use my money that I make and I am now 18. My guidance counselor who I've known for 4+ years says im fine and I'm an adult and my boss thinks its odd as well and always jokingly reminds me im 18.\n\nThis book will arrive at some point and our argument was cut off by me going to school and I know when it does I can't hide it from her so my plan is to tell her finally that I am an adult and have always been responsible and it's my money or something along those lines but I'm afraid I'll come across as an ungrateful asshole.\n\nWIBTA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA -", "NTA. I second what others have said, she is being controlling. My mom was like this when I was 18, and she absolutely lost her mind when I would buy myself nice things. She once threatened to throw away all of my clothes and get rid of my cat (who I loved dearly) just because she was jealous of me and wanted me to be miserable like her. Set your boundaries now and get yourself your own bank account. Do not allow her to handle your money in any way.", "NTA  Only $25?  Mom seems to be a little overboard over this amount of money.", "NTA your mom sounds like a control freak. Your a grown-ass adult & its your money", "NTA set up a bank account she can’t view or check or have any access to at a separate bank from her", "Fellow bookworm here - NTA. I also spent a significant portion of pay on books at your age and received lots of \"wasting $\" comments however my parents never actively forbid me to spend my own money per se. I also received complaints because we moved a lot in those days so packing up 7-10 boxes of books was kind of a pain lol. \n\nI would be firm with you mom that this is you money and while she can express concern, she cannot control your spending. Potentially offer her a thought out budget plan for your book spending (I had one that allowed for 20% of my income to go to purchasing books).   \nProve you are responsible once, then grey rock any future attempts to control your spending. Download some free library apps and see if you have access to unlimited reading apps too.", "Oh yeah I'm not a yeller I was just gonna ask her and try to get her to explain especially cause I don't have a history of being a bad spender and changed, I've always been frugal.", "This answer is probably the most reasonable I've seen. Asking questions and actively listening goes a long way in conflict resolution!\n\nNTA, OP.", "I def noticed it was odd but I just went along with it cause I wasn't spending a lot I didn't have to ask frequently", "Yeah I know it won't for sure but like is she gonna make me ask her when im a state over at uni?? So I def need to speak to her about it", "Yes the book was $25 with shipping lol. I would understand if it was $250 for a book but nope", "I'm not sure if she does or not, I don't think so as I believe it split on my birthday when I turned 18 but I could be wrong", "I was going to say, my parents didn't have this level of control over my spending when I was a kid and most of my money came from them! They would advise, certainly (\"You don't *have* to spend it all at once\") but in the end it was my choice. That's how you learn, while the stakes are still low.", "Sure! They do see my bank account logs, I've shown them they don't have access otherwise I believe but that's a good idea!", "OP is already 18.", "It's already on its way! In my state she can not charge me for utilities or rent as under our law I all considered dependent except in my age. For example, I can't call myself out of school despite being 18 as since im still in high school and therefore school-age, im dependent.", "No, im still in high school lol", "Hi! In my state im not legally allowed to pay rent or utilities as im still im high school and considered dependent. Why would I give her my earnings when I make it lol? She makes six figures she is fine. I clean a lot and take care of all of our pets and cook for myself and take care of my possessions and help with her cleaning.", "Have your books shipped to your work or a friends house.", "Just stop asking her. No fanfare. No speech. Just stop.", "Even if it was 250, it's your money. It's something you love and there is absolutely no reason for her to control what you spend your money on. \n\nI'm going to look it up, I've never read it. 🙂", "I would look into it just in case! Not that it sounds like she handles your money or anything, but if it becomes an ongoing monitoring when you’re away at college it could become extremely frustrating to have to justify all your purchases. Again, you’re money, spend it how ya like!", "You get to be in charge of your money, when you are actually in charge of your money.  Right now, you aren't.", "Well, you said it yourself that you're dependent on her. So shouldn't you also take heed to the one you depend on?\n\nAnd take another thing into consideration. Are you not gonna need your mom to help you financially again in the future? Is she not gonna help you at all buy a house/help with your wedding/university fees or loan in the future?\n\nI am indeed a bit confused on why a six figure earner is concerned for a 25$ one-time purchase. Maybe bcz she's not all that in touch with technology and doesn't get the use of a virtual book?\n\nI'm not saying you should give up the book, I'm just saying you shouldn't tell her you're gonna spend your money however you want. But be a bit more delicate abt this and say you only splurged this one time bcz this book is important to you. You should still be considerate with your mom at least while you're still living in her house.\n\nI just think logically your plan isn't 100% foolproof.", "Exactly!  Why all the drama. Just stop", "It's amazing!! One of my favs", "I will! Thanks!", "This is ridiculous. OP works and makes her own money. It doesn’t become her mom’s just because she lives there.", "??? I make it? It's mine money?", "Totally disagree. Kids learn financially responsibility by being in charge of their money. The only rule my mother had with my allowance was that I save a certain percentage. When I was able to open a bank account on my own. All my mother did was show me how to balance my checkbook. Again, she recommended that I save a certain % how I spent the money was up to me if I wanted to save more I did. On my own I opened a Christmas club savings account.", "What? She is legal age and makes her own money.\n\nWrong answer.", "Looked through the comments and seems like we're the only 2 ppl with this opinion. I'm starting to think it's a difference in culture at this point.\n\nI'm European and no matter how much of an adult you are, your mom will always be your mom. My parents are the only ones who I allow to tell me what to do, and even if I won't necessarily listen, I will still give extra consideration to their opinions, rather than anyone else's. I know my mom wants the best for me and she also respects my decisions and maybe unrelated, but we both consider myself more mature than her haha.", "It's not virtual, its an in hand book! I have scholarships that cover most uni fees and yes other stuff is important but that's what happens when you willingly have a child, you do provide for them for a certain period. Sure, she doesn't have to and I don't expect her to help me in the future so why should I still be chained with my money that I make to her whims", "No, but as she said, she's an adult and 18. Mom can instead of saying run your spending by me, say \"Pay me rent, or find somewhere else to live.\" That's the BEAUTY of being 18. If you want to play at being an adult, then actually be an adult.", "And you're 18.  You're an ADULT.  You can pay rent as an adult.  Would your rather run a small purchase by your mother, or pay market share on rent?", "They also learn financial responsibility by paying bills. Which as an ADULT OP can now do.  She can pay rent, she can pay for her phone, she can use that book money for actual life expenses.  She's an adult, after all.", "That's right. She's legal age and makes her own money. So her mother can charge her rent. Legally.  So does she want to run a small purchase past her mother, or pay rent?", "I'm sure she provides for you besides the minimum she's legally required to, for example covering part of the uni fees.\n\nAs long as she still helps you with extra money and you're not paying her back, you owe her.\n\nBut it's your choice if you wanna be smart abt it or drop all niceties.", "That’s not what a good parent does. OP is legally an adult now and thus has more independence, but that doesn’t change the fact that she has been dependent on OP for many things up until this point. \n\nAt this stage of their lives, it’s common for adolescents to save up their money so they can live on their own. Parents understand this. Demanding rent the day she turns 18 will just make her *more dependent* on her parent because then she can’t save the money to get out.\n\nEighteen is an adult, but most other adults have the nuanced thinking to know they can’t be treated like they’re 30 the day they turn 18.", "Since I'm in high school I can't as im not considered to he independent under the law in my state until I graduate so I wouldnt be legally allowed to pay rent :)", "Rent has absolutely nothing to do with this.", "You sound like her mom", "Like I said, no I can't pay rent in my state as on all official documents im dependent except in my age. Argue with my state if you don't like it, not me. It's illegal to charge a dependent rent if under a certain age and qualifications here", "Do you really want to play this game?\n\nThe second mom charges rent, the entire relationship changes - maybe permanently. \nThat’s no longer your child - it’s your renter.\n\n- There is no curfew.\n- Overnight guests are allowed.\n- Better put a lock on that bedroom door.\n- Oh, you wanted OP to watch their siblings? Sorry - I’m a renter.\n- OP now has all the legal rights and protections afforded to renters.\n\nBut yea, let’s potentially destroy a parent-adult child relationship over $25.\n\nYou and OP’s mom sound controlling. \n\nGross.\n\nOP - NTA", "I don't owe her anything, she willingly brought me into this world knowing and expecting she needs to provide for me for a certain time. It's law to provide for a child. Yes, not extra but even then, that's what happens when you have children", "Your version of what constitutes a good parent is not universal.  Raising a child to be fiscally responsible and understand their finanical responsibilities and the concept that with \"priviledge\" (being an adult) also comes RESPONSIBLITY.    The parent is attempting to teach her child not to buy useless splurges.  You can disagree with her tactics, doesn't change the fact that the idea is sound.\n\nCoddling children is what has led to 20-somethings being useless people who aren't equipped to deal with failure and a staggering generation of people who literally have no clue how to function in the broader world. \n\nAll you people running around thinking you get to do whatever you WANT! Because YOU WANT IT.  Adorable.", "Uh huh. Not true, but have fun finding that out.", "Sure it does.  OP is 18 and thinks because she's an adult, she gets to spend her money however she wants to.  One of the ways adults spend money is on contributing to the household.  Which the mother can insist on.  She's 18.", "Thank you for the compliment.", "Uh huh.", "LOL..  I love how your definition of the parent child relationship is \"child permanently sucks from the financial well of the parent for eternity\".   It's interesting YOUR entire view of the parent child relationship is one that comes down to letting the child leech off you for eternity, instead of shaping them to be a productive member of society.", ">she willingly brought me into this world knowing and expecting she needs to provide for me for a certain time.\n\nThat time is over. You are 18. \n\nWhen I was 18 my mother held onto my tax refund check and even opened MY MAIL to see how much it was. I called the police and wanted her arrested because I was so mad. They didn't arrest her but instead talked some sense into me because I was 18 and she could have me thrown out because I was an adult already. Be careful before you throw around the \"i am 18\" words unless you are ready for the consequences.", ">I don't owe her anything, she willingly brought me into this world knowing and expecting she needs to provide for me for a certain time. It's law to provide for a child. Yes, not extra but even then, that's what happens when you have children\r  \n\r\n\nSeems like  you don't really respect or appreciate your mother. Yelp, I will not raise my kid to have this kind of attitude towards me and have all my care, love and effort wasted.\n\nMaybe it's a different culture, but to this day, when I'm in my late 20s, my mom helped me buy an apartment(she helped me with a bit over 30% of the cost) and wants to help me get a car next, even though I continuously asked her and still do ask her to stop sending me money. I listened to my mom growing up, especially when I wasn't living by myself and wasn't completely independent. But we were both pretty accomodating of each other. If I was more headstrong and disobedient, my mom would've probably also been more strict. You feel like you're a full on adult when you still live under her roof and don't feel grateful to her at all, as if she only did strictly what she was required. At this point, you're just treating her like cash cow.\n\nDon't know what was the point of this post when it looks like you already had a decision beforehand. Anyway, there's obviously futile of me continuing to give my 2 cents, you were adamant in what you were gonna do to begin with.", "It's my money and my possessions, therefore under any common law its my property. I do not splurge. My mom splurged on her 5k+ California trip cause she could, you gonna yell at her??", "OP is *already fiscally responsible.* \n\nThey *already save most of their paycheck.*\n\nThey bought a *$25 gift for themself one time.*\n\nDon’t bring in other people or scenarios for your point. OP is not a coddled 20-something. They are already responsible and don’t need to be “taught” responsibility because they already are. *Budgeting suggests allotting a percentage of fun money.* And OP hasn’t even been doing *that.* They’ve been more fiscally tight than *what’s advised by financial experts.*", "It is lol. I can't call myself out of school due to it cause im not considered independent under the law", "But her mother hasn't asked her that. She just wants to decide on what op can spend her money on. So no, op can spend 25$ for a book ffs.", "I mean not permanently but you do need to provide for the child you willingly had? I know I was planned so my parents knew what they were getting into therefore they legally have to provide for me. If not that's called child abuse.", "It’s interesting that you got “… permanently sucks from the financial well of the parent for eternity.” From what I said.\n\nThat says far more about your perspective of life than you probably realize.", "That's great but this is about a $25 book not a tax refund or my mail. She opens my mail. Idc. It comes to her house she can open it", "Where op is at that time is not completely over. Also, I am 19 and my mother stills helps provide for me because I am her child and sometimes I need help. Just because you're an adult doesn't mean your parents have to stop helping you. It just means you more freedom and responsibilities.", "I love my mother and respect her and am extremely grateful. I listen to my mother and am called a respectful and responsible child by every adult I know. You can't say I feel a certain way when I provided no evidence of that. It's literally child abuse to not provide for a kid. I do NOT want my mom to keep paying for me even if she offers when im older cause she is my mother and I would be independent and she has done enough. This is over a $25 book not a 250000 house. I'm surprised you have garnered such rude and astounding beliefs about me over saying the law requires her to provide for me cause it does. She has to feed and clothe me due to law. I am grateful she does extra and doesn't abuse me but I simply want some control over the money I make. If you must know I already spoke to her and worked it out in a kind way where she called me respectful and trustworthy and knows im grateful that ended with us both saying I love you. But sure, make your assumptions about me and my relationship with my mother when my friends all envy how healthy it is when we discuss our parents and the fact my mother herself said it made her day that I trusted her enough to tell her and was so happy. So sure. Say what you will, I at least know my relationship is good with her", "She's actually an adult. Not a pretend one. When you're financially independent, then you get an opinion.", "Uh huh.", "The world is going to be harsh when you realize all the little delusions you've been living under aren't actually true. Santa Claus is also not real.", "Maybe her mother is tired of her spending money on frivolities and is ABOUT to ask her to start paying for her phone.", "Just block them they are harassing you look at there post history they gaslight everyone.there just a jerk NTA btw. Sorry there harassing you.", "You keep bring up the law about how she can't make you pay rent, I showed you an example how my mother broke federal law by opening my mail. The police said well you are 18 and she can kick you out. Thankfully our parents love us, the rest of the world DOES NOT.\n\nI think you should be able to buy the 25 dollar book. Throwing around the \"I am 18\" so I will do whatever I want should come with consequences in my opinion. You want to be an adult so bad, act like one.", "You  spoke about your mom's care for you as simply an obligation and a child must never forget all the other stuff their parents did for them. I don't wanna take and analyze your sentences one by one, but one could see at which points you implied such things.\n\nI said from the beginning this is not about the $25, but only advised against you saying (I quote): \"I Can Buy What I Want\" or \"I am an adult and it's my money\", at least not WHILE you're still using her money as well.\n\nI'm glad you worked things out with your mom and can only imagine you weren't quoting the law or saying she's obligated to house you and all while you spoke to her.", "I am financially independent based on what my STATE LAW allows again, its literally illegal to charge me rent here.", "I'm well aware thanks! I've been playing Santa Claus for my sis since I was twelve <3 its not a delusion I literally had a friend get in trouble cause she tried once she turned 18", "Maybe she's ABOUT to tell her to find a new house.\nYeah, we're not her to judge on suppositions. Move on.", "I don't spend money on frivolites as my average spending a month is <10$!!", "Rent and mail are two different things. One is me paying her for something considered a need and the other is an envelope. I don't want to say the I can do whatever I want cause that's just ungrateful I just want some control over spending money I make. I already spoke to her anyways and it went fine. She was happy I talked to her and it was very respectful.", "Because it is im obligation in a way. I don't see it as one and am extremely grateful for it but technically it is in a way and she does a wonderful job of it. Children need a lot to grow, I mean if someone abuses their child we look down on them cause its wrong, a child has a right to be loved and cares for by there parents. This is my money im using for the book, not hers. I would never use hers as its hers unless she wanted to get me a gift or something. I only use the money I make and in my account. Of course I wouldnt quote all that at her she's my mom. I just explained how and why I got it and how I felt not being im control of it expenses. That's it. I feel we have strayed from the original point. But, overall I am grateful for my mother and love her, just wanting some independence with my spending money. Have a nice day :)", "NTA. Get your own bank account & have your books delivered to your work. Mom is controlling.", "Since you've recently turned 18, are your accounts exclusively in your name? If not, change this as soon as possible. If she felt lambasting you for a $25 purchase was acceptable, she may decide removing your money to prevent you from being irresponsible would be best, then you'll have no access or information about the account balances and would have to ask mommy for every cent. NTA", "exactly, you're not in the wrong but if you use the 'I'll buy what i like' all that will happen is more fighting. you need to find out why she's so flipped out over this.", "The fact that you waited until it was on sale at such a low price before you bought it, says a lot about your self control with regards spending. It’s also something that can be cherished long term and passed on to others, possibly your own kids if you so choose. You can spend $25 on literally anything that lasts 5mins now, but this isn’t that. \n\nYou’re obviously very conscious about how and what you spend your money on and personally, if this was my daughter I would commend them in doing so, instead of reprimanding them. \n\nAlso you’re an adult and the decision to spend the money you earned on what you like is totally yours. I can appreciate your mothers concern as a parent myself, but it seems to be a bit overbearing here, as it’s not an excessive amount, neither is it something of little value. \n\nI think there may be something more to this and you need to have an honest chat about what her fears may be.", "Do not confront your parents (if that's your plan) before you ensure they do not have access to your money."]}