{"id": 14877, "submission_id": "12nahwk", "title": "AITA for being disrespectful and telling my mother she's shitty.", "selftext": "New account since I don't want my friends to know abt it.\n\n\nI (f16) was after the age of 13 very shy and never talked about anything. One of the reasons was just people telling me I am annoying and my mom saying I talk too much, so I just decided to keep things to myself.\n\n\nThis year I decided I should open up and talk about my feelings/experiences more because I am tired of bottling everything up and crying because of it.\n\nSo I started to talk about myself more, especially to my mother (f35), because she's my mother and I don't have a father to talk to unless my siblings.\n\nSo today at the dinner table I decided to talk about my two soccer games I had today and yesterday. I told her that I got better and that I even scored a goal. But after 3 minutes she just started saying to me that I should shut up and she doesn't care about it. \n\nIt honestly hurt my feelings and I felt like crying in that moment. She always listens to my other siblings, so why not just listen to me for once?\n\nSo I got up from the dinner table and told her she's shitty for that and went straight to my room.\n\n\n\nNow I'm feeling like the asshole, because maybe I should've just bottled it up again.", "created_utc": 1681576890, "permalink": "/r/AmItheAsshole/comments/12nahwk/aita_for_being_disrespectful_and_telling_my/", "score": 108, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) me telling my mom she's shitty and getting up from the dinner table when everyone was eating.\n\n2) again me telling my mom she is shitty\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "no sweetheart you shouldn't bottle it up unfortunately you have a mother that is too selfish to listen to her daughter. you would benefit speaking to a school counselor.", "NTA, she is being shitty and you are well within your rights to communicate that", "NTA. I don’t understand why your mom is so rude to you. I’m sorry you’re going through this. All I can say is that maybe she’s going through something too.", "NTA. She definitely sounds shitty and calling her out on atrocious behavior doesn't make you an A-H.", "Are you kidding me?!  Your mom for years has told you that your feelings and accomplishments are meaningless?!\n\nNTA, but please start planning to move out the day you turn 18 and go LC with her.  You deserve so much better OP!", "Definitely NTA but your mom is!", "NTA - your mom is shitty lol. And contrary to popular boomer/Gen x belief, your parent doesn’t own you, you are your own person, and if you’ve been treated like shit, well they shouldn’t be surprised when you call them on it. \n\nPS I’m sorry you don’t feel like you can express yourself or talk about things that are important to you. 16 is such a rough/unique age, and your mom is a HUGE shit for dismissing you. Hang in there, 2 more years and you’re an adult and she will NEVER have a say over you again.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNew account since I don't want my friends to know abt it.\n\n\nI (f16) was after the age of 13 very shy and never talked about anything. One of the reasons was just people telling me I am annoying and my mom saying I talk too much, so I just decided to keep things to myself.\n\n\nThis year I decided I should open up and talk about my feelings/experiences more because I am tired of bottling everything up and crying because of it.\n\nSo I started to talk about myself more, especially to my mother (f35), because she's my mother and I don't have a father to talk to unless my siblings.\n\nSo today at the dinner table I decided to talk about my two soccer games I had today and yesterday. I told her that I got better and that I even scored a goal. But after 3 minutes she just started saying to me that I should shut up and she doesn't care about it. \n\nIt honestly hurt my feelings and I felt like crying in that moment. She always listens to my other siblings, so why not just listen to me for once?\n\nSo I got up from the dinner table and told her she's shitty for that and went straight to my room.\n\n\n\nNow I'm feeling like the asshole, because maybe I should've just bottled it up again.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Are you siblings boys?\n\nBottling everything up is not healthy. You should be too allowed to talk. Personally I'd be bored after 3 minutes about sports, but that's no excuse to tell you to shut up. \nI listened to my twin sister for hours on end about horses, because they matter to her. It doesn't matter that they are off no interest to me, I care about her so she gets to talk to me about the stuff that's important to her. She had to endure loss of political discussions from the rest of us, so it's only fair she also gets to talk about stuff that interest her.\n\nYour mum is showing you she cares more about your siblings and I'm so sorry for you. That must hurt.\n\nNTA", "Absolutely NTA.  \n\nYour mom is being super shitty and you have the right to tell her.  Don't bottle up anything, it's only going to hurt you in the long run.  She obviously doesn't care about your feelings, even a little bit, so hers should be none of your concern.  \n   \nIf she doesn't like how you're talking about her, she should have acted better. \n\nMy mom was like yours and me and my kids are very low contact with her.  It's what she deserves.", "you are nta at all. your mom.is.", "NTA-sometimes parents just suck. You'll be dealing with the ramifications for a long time. I still deal with my own parents shit factors.   \n\nKeep advocating for yourself and learn about Grey rocking to deal with your mom.   \n\nGood job on soccer! And for working hard to become a more full you. That will pay off in droves as you age. My daughter is 16 and if my wife said that to her- I'd be the one screaming and yelling at my wife. Not cool.", "Nta.  Your feelings are valid, and as a mother she should be there for you emotionally.  \n\nYou’re not a bad person for wanting a connection with your own parents.", "[removed]", "She isn't feeling great herself! I've talked with her about how she feels and what her worries are so I never take it rlly to heart when she calls me names.\n\nThis time I was just frustrated and it turned into anger ahaha :))", "I'm not too sure if she thought of my accomplishments as meaningless. I mean she told me I'm doing a good job keeping my grades above 90% \n\n\nAlso what does LC mean?", "I've 2 brothers and 1 sister. \n\nBut my sister looks and acts very similar to my mother, while my brother's like their father.\n\nI think my mom only has a problem with me because I resemble my grandmother and father when it comes too looks and my mom has a strong hatred towards both ahaahah. But that's  just my guess 😄", "?", "It’s not ok for her to call you names no matter what she’s going through", "Friend, I understand your empathy, but so you know, it’s not appropriate for a parent to turn their child into their therapist. That’s not your job.\n\nBe well. (Also, NTA)", "LC is low contact, and NC is no contact.\n\nAnyways from one Redditor to another I’m proud of you for your academic achievements!  Best of luck OP!", "LC means low contact", "Did they cause her trauma? It's still no excuse, but it could explain why she's being an ass towards you.", "Ignore them. Literally their only comment ever is calling people trolls.\n\nNTA, btw. You deserve to have a voice.", "Ah I see, thank you sm!!", "Thank you!!", "Definitely! She always keeps on telling me what an asshole my grandma was and well my father is just a liar", "Hahaha thank you! Just saw their profile so I could've guessed it :))", "NTA", "This sounds so so so so much like me when I was a kid. Turns out I have ADHD but noone noticed. \nYour mom sucks tbh. She should be happy and like hearing about your life. Bet she'll wonder why you never tell her anything that happens in your life once you moved out. NTA.", ">Now I'm feeling like the asshole, because maybe I should've just bottled it up again.\n\nAs someone who just spend the last hour venting to his boyfriend about the inadequacies of my own parents I assure, no, you aren't the asshole. Shitty parents deserve shitty treatment. The idea you should respect her purely for her title is really just enabling bad parenting and bad parents.\n\nI might be projecting, but I'm also not gonna label a sixteen year old as an asshole for telling their mother she's being shitty when that clearly describes their behaviour.", "NTA. Sorry you’re not able to hold their attention. Maybe look for people whose attention you can hold. It will make the other lack of attention hurt less.", "r/momforaminute is a better option for you. I'm sorry you are being treated so poorly at home.\nNTA", "Nta you didn’t deserve that", "NTA. I want to hear about the soccer games.", "I do suspect me having adhd, especially because I relate to alot of symptoms and even my friend who is diagnosed with adhd told me that I might have it.\n\nBut I'm not diagnosed, so I can't say I have it ahaha", "Hey detting diagnosed is hard especially as a girl and assuming you're in the us it's even harder.\nOne thing I learned is that even if you're not sure or you don't have something, there are no rules against taking the strategies etc that people with it suggest online for example\nI just hope your mom never dims your light. There are people you will meet in your life who can not imagine anything more riveting that listening to you talk.", "I'm actually from Germany ahah, so the diagnosis would be free. But I would need my mom's consent,, which I will not get ahaa", "But your an innocent child that should not be punished because of what other adults did to her. Your feelings do matter and you’re allowed to feel how you feel. You are not the asshole, but your mom sure is. Please start making a move out plan and get out as soon as your 18 if you can. Then get yourself into some therapy to help your mental health! Good luck!", "OMG don't listen to all those \"move out when you turn 18\" posts here.\n\nSweetheart, I also thought that my brother was being \"prioritised\" but now i am 23 and while ...I don't say that he *wasn't* (hehe) it simply doesnt matter. Far more important is the relationship to your loved ones. \n\nIn General: You will now enter a phase where you get to know your mom for a second time. Until now you just knew her as a parent but now you will get to know her as an adult yourself.\n\nIf your loved ones turn out to not be deserving of your love make that decision but for the love of god DON'T LISTEN TO US\n\nWe are strangers on the internet who \"know you\" based on barely half an essay's length of text.\n\nVenting is great, certainly don't bottle it up, find someone to talk to or just write it out here on reddit :)", "NTA. \n\nSweetie, sometimes in life, we have to call a spade a spade. Sometimes we choose not to (we see it as respect for our elders etc) and sometimes there’s not an actual choice to be made. Sometimes we blurt it out. Sometimes it’s planned. But either which way you slice it, bottling emotions up and not having your mother as a shoulder to lean on when having a bad day/week etc, leads to unresolved issues and can result in needing therapy when we’re older. And results in a lifetime of disappointment in the one person you should be able to talk to about everything. \n\nTake it from someone who grew up with a manipulative narcissist for a mother. I ended up resenting mine for a myriad of reasons. I could write a book about it (and actually, I do write, and oft times will include a shitty mother 🙃) but we’d be here until eternity trying to list all the ways in which she let me down. Therapy didn’t do me any good, but cutting her off when I was 18 greatly improved my life. \n\nOf course, I’m not suggesting cutting your mother off the second you are able—even though it may well come to that—I’m just stating what did me some good.\n\nFor the sake of your mental health, find someone else you trust to talk to, because it seems inconceivable that mom will want/be able to give good advice. If you can’t talk to her, and you can’t bottle things up, then I suggest confiding in a close friend/relative/guidance counsellor at school. \n\nAs for the one throwaway comment that she’s shitty, it sounds like she deserved it. I wouldn’t walk around calling her out on every little thing, because she’ll undoubtedly make life harder for you. But you’re not TA for standing up for yourself. \n\nAs you get older, you’ll find ways to cope, ways to be assertive, and time will bring clarity on some things. But until then, find a responsible person that you trust and talk to them. \n\nHere’s a <**virtual hug**> from an internet stranger who knows what it’s like.", "NTA. In no way are you at fault here hunny. I'm proud of you for standing up for yourself though. I am also so proud of your soccer games! Congrats from another mom here for putting in work and getting better at something! I'm so proud of you!", "NTA - mom keeps that title to herself", "It was nice. I am a defender and usually stay back, because I am good at taking the ball away. But once I had the ball and just ran to the goal and even scored. Was nice asf", "I definitely didn't work onto that goal ahaha! Even tho my mom isn't the perfect mom, I don't think I could go LC 💁‍♀️", "Thank you sm!!", "You’re so welcome. Here’s another <**hug**> just because I wish I could hug you IRL. Honestly, us kids of sucky parents need to stick together. Hell, we could have a convention kind of like Comic Con, sell tickets, and make a tidy sum whilst helping each other out lmao 🤣 (could also spend said tidy sum on therapy… or booze… when you’re of legal age 🙃)", "Absolutely disagree. Don't set your mind up for LC,NC at the age of 16. Don't work towards that goal. Is it really a nice goal? LC/NC with your mother? Don't think so.\n\nDon't listen to us, we are strangers on the internet and what we know about your situations is barely half an assay's length of text.\n\nNow is now the time in your life of deciding whether your loved ones are deserving of your love. This decision can still be made when everyone including YOU is an adult.\n\nsigned, a 23-year old (=not that much older than you)"]}