{"id": 14879, "submission_id": "12nhw31", "title": "AITA for refusing to pay for my brother's wedding after he uninvited my wife because she's infertile?", "selftext": "So, a little background: my (32M) younger brother (28M) is getting married in a few months. Our family has always been close, and I've been financially successful. My brother and his fiancée (27F) asked if I could help pay for their wedding, and I agreed because I love them both and want them to have a great day.\n\nMy wife (31F) and I have been married for 5 years now. We've been trying for a baby for 3 years, but we recently found out that my wife is infertile. It's been a very emotional and difficult time for us, but we're considering adoption or other options.\n\nHere's where the issue comes in: my brother's fiancée is very family-oriented and has always dreamt of having a big family. When she found out about my wife's infertility, she was initially sympathetic. However, she later decided that my wife's infertility was \"bad luck\" and might \"rub off\" on her if my wife attended their wedding. As a result, she uninvited my wife from the wedding.\n\nWhen I found out, I was furious. I told my brother that if my wife isn't welcome, then I won't be attending either. Furthermore, I said I'd be withdrawing my financial support for their wedding. He called me an asshole, saying that I'm ruining his big day and being selfish. He also argued that it's just one day and my wife will get over it.\n\nI'm really torn up about this because I love my brother, but I feel like I need to stand up for my wife. AITA for refusing to pay for my brother's wedding after he uninvited my wife because she's infertile?", "created_utc": 1681591278, "permalink": "/r/AmItheAsshole/comments/12nhw31/aita_for_refusing_to_pay_for_my_brothers_wedding/", "score": 881, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Withdrew financial support for my brother's wedding after my wife was disinvited\n\n2. I might be the asshole for abandoning a family member in need of financial support\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nTell him that your wife is worried that his financial troubles are bad luck and that they might rub off on you if you help pay for the wedding. His wife will get over it.", "You are TORN UP ABOUT THIS??? Are you out of your mind? You'd be the asshole if you did pay.", "NTA. And your future SIL is not only cruel and vindictive, but dumb as a bag of rocks. Tell your brother that his horrid soon to be wife can get over it, since she’s the only one with a problem (an imaginary one at that).", "NTA\n\nYour brother and future sister in law need to check their calendar. It’s 2023, not 1223. \n\nThat “bad luck” and the idea that I might “rub off” is some of the most ridiculous BS I’ve ever heard. \n\nDefinitely don’t pay for their wedding.  After that garbage, I wouldn’t go and I’m not sure I’d even speak to them for a long time.", ">However, she later decided that my wife's infertility was \"bad luck\" and might \"rub off\" on her if my wife attended their wedding. As a result, she uninvited my wife from the wedding.\n\nYes, modern medicine understands infertility is a result of contagious bad luck, with weddings as a primary vector of infection, especially if rubbing is involved. \n\nYour wife doesn't need defending from this mystical bullshit, but you're absolutely justified in wanting no part of it. \n\nNTA.", "NTA. What else does this ditzy woman think will RUB OFF on her? If stupidity were contagious, I'd stay miles away from HER.", "Pull your financial support. Tell your brother it's just one day and he'll get over it. NTA", "NTA and I would NOT back down on this. Even if they re-invite wife, they have shown you where she stands in their lives. That is the dumbest shit I have ever heard. “Rub off on?” How insensitive. I’d go LC for a while and really think about which family is important to you.", "NTA. No, your future SIL can fuck off into the sun. You don't get to bite the hand that feeds in such a hurtful and cruel way and expect it to keep treating you.", "NTA.  Tell your brother that it’s just one day - he and his wife will get over it.", "This has to be a joke.", "You wouldn't even be TA if you never saw or spoke to your future SIL again.\n\nThat's a whole bowl full of horrible she spoke out loud to your wife. omgosh. Just no. Don't pay for the affair and don't attend it the wedding.\n\nNTA.", "NTA. You’re doing a nice thing for your brother and his fiancée and they decide to repay your kindness like this.", "NTA. They have a cheek asking you to pay for their wedding in the first place and then still expect you to pay after being insulting to your wife.\n\nI'd tell them that you consider it bad luck to pay for someone else's wedding as their lack of funds might rub off on you!\n\nYou're exactly right to stick up for your wife.\n\nI'd be wary of them re-inviting your wife as they may well do it just to get your money.", "NTA \n\nYour brother should be concerned about marrying someone that deficient in empathy or common sense", "NTA. Wow.", "NTA! What awful humans. Kick 'em when they are down philosophy. You are right, you do need to stand up for your wife and get the brother and fiancee out of your life.", "NTA. Your brother’s fiancée is cruel and your brother is too, if he supports her. I would never attend or support the marriage of two people who could behave so horribly because I wouldn’t want them to procreate. The world doesn’t need more awful people.", "NTA - ask your brother how he'd feel if \\*YOU\\* were the infertile one that his fiancee didn't want around. Stick with your wife and ignore your ah brother and his ah-fiancee", "NTA, you better not give in a single cent if you truly love your wife as it seems you do from the post language. This is a hill to die on.", "NTA And later…if your brother should actually manage to scrape up enough money to marry his lovely intended, (and if he actually invites you to his event)- I would not go. \n\nWay to bite the hand that feeds,(pays for your wedding)… Real smart. I roll my eyes.\n\nYou don’t owe him anything. He is supposedly a grownup. He can pay for his own party.", "NTA. \n\nI never get these stories about people having a wedding and disinviting the people paying for the wedding. The whole nonsense about thinking infertility will \"rub off\" on you aside, if someone's paying for your wedding, they are on the guest list. Period. I don't care if you hate them. \n\nIf you don't want them there, don't take their money.", "NTA, your brother and his monster of a fiancée seem to be a match made in hell. Wow. Of course you don’t pay for a wedding to which your wife gets disinvited over her fertility issues. They’re heartless and brainless AHs and you should probably just block them everywhere.\n\nETA I hear mingling with AHs can rub off and cause fertility issues because no fetus wants to be born into a family like that. Keep your money and invest it in your own family.", "NTA — What if the fiancée herself is actually infertile? Regardless of anything, I suggest reconsidering your relationship with these types of people.\n\nAlso, are they only inviting men and women who already have children to make sure nobody else is infertile?", "NTA. What in the ever-loving f*ck is wrong with your brother and his fiancee? Your wife's infertility could rub off on her?! That might be one of the most ignorant things I've ever heard.\n\nBut also, this isn't about the infertility (at least I genuinely hope not). Sounds like his fiancee doesn't like your wife for some reason. Let him know you're pulling the money until he talks to her and figures out what's really going on. Sounds to me like she's got a grudge against your wife and is using this nonsense to exact some weird revenge.", "NTA Tell them you wouldn't want to risk contaminating the wedding with money from the spouse of someone who's infertile!", "NTA! \nYour brother and his fiancé sound entitled to think they can uninvited your wife when you both still find their wedding.", "This is hard to believe. But NTA.", "NTA. His wife is ruining their wedding. Its just one day, they'll get over it", "NTA NTA \n\nWTH that is some messed up thinking.\n\nMost times I think most people are dumber than animals.", "NTA your brother and his idiot wife should learn that you can’t treat people like shit and not expect repercussions. I would absolutely cut off financial support and at the very least go low contact. If they push back them no contact.", "NTA - his fiancee is a real piece of work. I wouldn't want to attend a wedding for someone that viciously unstable.", "This simply cannot be real, if it is, I am stunned you are even asking this question. Ofc you are **NTA.** if they exist, your brother and fiancée are disgusting people.", "Oh, hell no. NTA.  Tell his fiance that infertility might be attached to the money, and you wouldn't want that to rub off on her.\n\nSeriously. What a horrible woman, and your brother is no better for now shutting her down.", "> However, she later decided that my wife's infertility was \"bad luck\" and might \"rub off\" on her if my wife attended their wedding. As a result, she uninvited my wife from the wedding.\n\nIs she a time traveler from the 1500s lol?\n\nAnyways. Nta. Obviously", "Ehm, you need to go NC with your brother and his wife rn never mind just withdrawing your money. \n\nYou're NTA.", "No way this is real. There is just no way.\n\nNTA and I’d be going no contact, takes boorish ignorant behavior to a whole new level.", "NTA. Sister is punishing your wife for a medical issue. That's hella messed up.", "NTA let's hope their future kids don't suffer their mother's stupid  rubbing off on them", "NTA but you should stop feeling conflicted about this. That attitude from your brother and his fiancée is terrible, people shouldn't be treated poorly because of something that is going in with their bodies. Infertility is so often met in the most abysmal way by some people and standing up against that in any capacity is the right thing to do. So is standing by your wife in this, unfortunately she will probably face other sentiments along this line and having a trusted confidante on her side will just benefit her in navigating that.", "NTA.  Your soon to be SIL is not only cruel but she is delusional as well.  Who in their right mind thinks that infertility rubs off onto other people?  \n\nYou are doing the right thing by standing up for your wife.", "Forgive me but I find this post difficult to believe. However, no one should feel compelled to pay for a wedding when their spouse won't be invited because she has bad ju-ju. NTA", "WTF did I just read?! Your future SIL sounds like she was born 400 years ago. Really didn't think people could be superstitious in such a stupid way in 2023.\n\nObviously NTA. Support your wife instead.", "NTA. You don’t pay for someone to disrespect and hurt your wife for made-up superstition. Your poor, poor wife - what a nasty way for them to respond to her pain and your joint loss.\n\nDo NOT pay but do TELL THEM BOTH that this is the cost of their cruelty and lack of basic common sense.", "NTA. You would only be the asshole if you did go to your brother's wedding and helped him financially. I think it's far more important to  consider the feelings of your wife for being excluded for her sad infertility,   \n\n\nSo, please, just chose your wife's wellbeing and tell your brother you're very dissappointed that he defends the sick attitude of his to be wife and that, however  much you still love him, means that you will keep your money for there wedding in your pocket and go LC with them, until they offer you and your wife well-meant apologies.", "So much wrong with your brother/his fiancée.\n\nInfertility isn't catching.\n\nYou don't uninvite the wife of the person paying for your day and still expect payment.\n\nIn fact, paying for the wedding was an extremely entitled thing to ask of OP at all.\n\nYour wife won't just get over this; it's a huge insult and mean and rude and just not something you \"forgive and forget\".\n\nIf it's \"just 1 day\" then why uninvite someone instead of just avoiding them?\n\nTheir actions won't just have ramifications for 1 day - this is a relationship damaging action and has the potential to ensure you are never close again.\n\nIf you don't stand up for your wife now, when will it end? She's not invited to birthdays, religious events, christenings, or get togethers at all? They each only last 1 day, and she'll get over it, right?\n\nNTA", "NTA at all!!!\n\nYour brother’s fiancée sure is though!! What kind of ass backwards mentality is she spouting??? Do NOT give them a single red cent, even if they apologize. Because the apology will only happen so they can have your money. You are nothing but an ATM to them right now. Stand up for yourself and your wife.", "Come on now. You can't be seriously questioning this", "NTA. Whatever it is that you do, your wife is part of why you are successful.\n\nShe’s paying for it too. Your brother wants your wife to pay for the wedding but not attend because of a condition she’s sensitive about.\n\nNot very family oriented are they? \n\nI wouldn’t even consider going if I were you. Reconcile later if you want. But if they invite your wife back in, it’s only because they need your money. And your wife will know that.\n\nSucks to be them. Good luck. Talk to you when you apologize.", "NTA at all.  I have said many times before on here that the bride and groom have a right to have their wedding however they want and invite whoever they want and that’s true.  However, decisions still have consequences.  It’s ridiculous for them to think that they can uninvited your wife and still expect you to not only come but help pay for it.  When you get married your spouse, and kids, come first.", "NTA your future SIL is the TA and your brother is pretty close to one as well given he’s supporting her. Who uninvites a woman from a wedding just because she is infertile??!!! They have do not have a heart. Stand by your wife and let them throw all the temper tantrums they want. Just be warn the story they share mace not be the real one so I’d tell your parents or close family why you are not going", "NTA jeez what a pair. They think they're entitled to your financial support while completely disrespecting your wife (and you/your marriage) because of an emotionally painful medical issue. They sound delightful. You aren't ruining their big day, they are. Were I in your shoes I would be loudly broadcasting the reason for my non attendance to all our family.", "NTA. Clearly. I would cut off all communication with your brother and soon to be SIL until they genuinely apologize. And, even then, keep them at a distance. She's going to make your wife miserable for being infertile forever. What a monster.", "Yea no that's complete bs!! NTA!!! Right... his fiance is soo family oriented that the minute someone in said family gets an unfortunate diagnosis she goes extremely superstitious and unsympathetic. They are the selfish ones.", "NTA other people have said it but just tell him it’s one day and he’ll get over it", "NTA. Your brother's fiancee sounds like she's not the sharpest knife in the drawer. Why would it even occur to her to think that your wife's infertility would rub off on her? That's crazy and she's TA here.", "A wedding is just one day, your brother will get over it. NTA", "NTA…infertility affects so many women and it’s so emotionally damaging to deal with.  Your brother’s fiancée is way out of line thinking infertility will rub off on her…it’s not contagious!  How heartless and selfish is she?  It’s not just one day, it’s a day that your wife and you will always remember because she got shunned for something outside her control.  Your brother needs to grow up and his fiancée needs to learn empathy.  Let the two of them figure out how to fund their own wedding.  Good on you for supporting your wife.  When someone shows you who they are believe them…", "NTA. Your brother & his fiancé really are a pair of hypocrites & snobs. Just remember that your brother is going along with this insult to your wife. Don't pay for their wedding or go to it. They don't deserve to have your attendance if they are going to be so hateful.", "NTA- infertility is hard enough without people making you out to be a pariah. You are absolutely doing the right thing by standing with your wife.", "NTA. This is one of those situations where you feel like you’re in the twilight zone- the people around you are behaving atrociously and acting like it’s totally normal and reasonable. \n\nYour brother and his beloved are hideous and cruel, not to mention entitled and arrogant. Stick to your guns and stand by your wife. Do not give them a single penny.", "NTA.\n\nI couldn't believe what I was reading, my heart aches for your wife right now and your priority is or should be, of course, her. You both need to focus on processing this news, and the direction you want to go to have in regards to how you become parents.\n\nCertainly not on a woman who has zero regards for how to treat people, or how basic biology works. Would they have uninvited you out of curiosity if you had been firing blanks, or would you have been allowed because you have the chequebook?\n\nAlso, if they couldn't afford to get married without financial assistance from others, perhaps theu should have waited till the saved up enough. \n\nGo cuddle your wife, reassure her of your marriage vows and place her back on her pedestal with some devotion. (But also give yourself some live too - this news has affected you both and it's a hard journey.)", "NTA and WTF is wrong with your future SIL", "Yeah it might ruin their wedding, and his wife might be mad but tell him: ‘it’s just one day, and your wife will get over it’ NTA", "Tell your brother that \"it's only one day\" and his fiancée will get over it. \n\nNTA, and I wouldn't give them one dime. Your brother's lack of empathy towards your wife is appalling.", "NTA Your brother’s fiancée is insane if she honestly thinks infertility is contagious", "NTA\n\nNope, SIL is way out of line here.", "NTA. They can't expect anything else when they uninvite your wife. As if this isn't hard enough for you both already, now she's going to be punished for being infertile. And for what, like bad luck, like infertility is somehow contagious. Wtf. That's some weird mumbo-jumbo. And downright cruel to your wife.", "NTA....holy cow! Wtf! You should cut of your brother for even going along with this! And anyone who supports them! Now you know your brother sees you as nothing but a bank! And it's better you cut them off now because it will only get worse from here", "your wife will not get over it \n\nnta", "NTA, and I’m sorry your brother is making you second-guess yourself! Standing up for your wife is absolutely the right thing to do in this situation. Who thinks someone’s infertility will rub off on them, anyway?", "NTA. They're ruining their own big day by being complete asshats. Rubbing off on them? Yeah, don't give them any... just tell them you're worried your money might curse them. Fuck them both.", "NTA. Your future SIL is ridiculous. Also mean and cruel.", "This is THE most ridiculous reason to uninvite a wedding guest I've ever seen. NTA. Tell your brother that when someone whose wife is infertile pays for your wedding, it's a bad luck and everyone, bride and groom included, might be affected by that so for the sake of their family you withdraw your generous proposal to pay and attend.", "I am horrified that people think that way, that they would say it out loud, that they’d then use that as an excuse to disinvite someone, and then finish it off with still wanting money from the same family members they insulted!\n\nNTA.  Wow.", "NTA\n\nBeing infertile isn't a choice and it's hard enough to learn that, it can be devastating to some people. It's completely and utterly rude and disrespectful to uninvite because of that, especially people who are helping to fund YOUR wedding.\n\nAnd the fact they're ignoring adoption and other methods to have a family, (even having pets count as a family), as well as other options is baffling to me, maybe because I've grown up with similar things.\n\n&#x200B;\n\nedit: typo", ">I'm ruining his big day\n\n>it's just one day\n\nSo which one is it.  \n\nIf it's just about one day then he doesn't need the money or your attendance. \n\nIf it's his big day then your wife should be invited and he needs the money.  \n\n\nNTA \nyour brother and his fiance are something different.", ">my brother's fiancée is very family-oriented \n\nThis is simply not true. If she was truly family oriented she would not be so self-centered.\n\nNTA", "Nta. Don't attend, I would be afraid of her stupidity rubbing off on you and your wife.", "This is Insane.\n\nI'd go NC immediately and spend every penny you were putting into the wedding on your wife instead.", "That's  not how  any of this works.\n\n\nNta.", "I have a hard time believing this story, but if it’s real and you don’t back your wife 100% you would be the A H. As it stands now, NTA", "NTA — if your wife is “bad luck” so is your money.\n\nThis is one of the most ridiculous posts on here if it’s not complete bullshit", "Absolutely no way this is real.", "What? Honestly this can't be real? If it is then NTA to withdraw funds and not go but you are a massive asshole if you you try and use money or your attendance as a bargaining chip to get your wife included.  You should absolutely not go, tell them to fuck off to the further point of fuck off and when they get there they should fuck off some more, and then never speak to the self absorbed ignorant assholes ever again.", "NTA and your brother seems to be someone whose brain cells hasn't made it to maturity yet. How could someone even think of uninviting someone for the reason stated and expect everyone else to be fine with it. Irrespective of if your wife gets invited or not, its better to leave them to deal with the finances and if it was me, I wouldn't be attending the wedding for the huge disrespect they have shown towards the wife. Its not just standing up for your wife, but for all those who gets blamed for no fault of theirs. Such cruel self centered people are better kept at a great distance.", "NTA but you'll be one if you go to that wedding or support it in any form after they cruelly excluded your wife. It must be hard enough for your wife to not be able to have kids and they are being just cruel to treat her this way over it. I just can't understand one thing - why do you have to ask reddit? If people say you're wrong, what will you do? Go to the wedding and finance it while your wife stays excluded at home feeling like she has not value if she cannot have children? That would make you TA", "NTA you 100% made the right call. Your future SIL took it WAY too far.", "I am not sure what there is to get over. Your brother told you his fiance and wedding are more important than your wife and your marriage. The bride is ridiculous, your brother is ridiculous, and take the money to explore creating your family. NTA. Your brother and SIL are AH's.", "NTA Your brother and his bride are. Instead of being concerned about your wife's feelings your brother is allowing his fiance do this cruel thing to your wife. He's more concerned about money than about the feelings of a family member. Both he and his fiance are greedy and cruel. Of course you're going to come to your wife's defense and withdraw the money.", "NTA being family orientated means being there for family through both highs and lows. Your fsil is not that person.", "NTA: Your future SIL is certified crazy, and your brother is being a selfish asshole.", "NTA, I’m sure that there are several other people invited to this wedding (both women AND men) that have dealt with fertility issues.  It’s more common then your future SIL thinks. \n\nWhat would have happened if the fertility issues had been on your end? Your future SIL’s behavior is disgusting and there is zero reason to help your brother or her for their dream wedding. \n\nYour wife and you can instead use that money to pursue medical treatment or other options available in becoming parents (if you choose to do so!). Or take your wife on a trip to just have time to herself. This diagnosis is difficult and having family acting like this does not help her.", "NTA it's just one day, your brother will get over it.", "NTA. Take the money you would have gifted them and do something special for your wife. Maybe an overnight trip?", "NTA.\n\nAnd if they're afraid of bad luck their same dodgy logic can be used thusly- \"oh well you don't want out infertile bad luck money that we jointly earned because wife and I are a joint and supportive team. Good luck\n\nEdit: they're that family oriented that they're willing to ditch your wife since she's not family enough apparently to be included in spite of infertility (weird logic). So apparently even though you're all family, some family is better than others? So maybe question how family oriented they are. If him and his fiance don't consider you that important of family to have at their wedding.", "NTA. It's just one day, he'll get over it.", "NTA\n\nYour brother and his fiancee are heartless and classless.", "NTA!\nWhat a horrid person your future sister-in-law is!\nShe not only needs to apologize to your wife, she needs to do some serious ass-kissing!", "NTA - don’t pay for the wedding and don’t see them. You don’t want stupid to rub off on you.", "One of the easiest NTA I've ever seen.\n\nTake your money and do something nice for your wife. \n\nYour new SIL is a serious problem", "Imagine being so dumb that you think infertility is contagious. NTA.", "NTA", "NTA!!!!! If your wife isn’t invited neither are you or your money. Let her know that’s not how infertility works nor how your money works", "NTA. Your brother and his wife are being outrageously hurtful towards your wife. They have really left you no choice but to withdraw from the whole event, both emotionally and financially. I wouldn't waste a minute of my life worrying about how they feel about your decision.", "This is absolutely horrible. I’m so glad to see that you are standing up for your wife. She is probably already dealing with coming to terms with her infertility, then she is treated in such a cruelly ignorant way. You are doing the right thing not paying for their wedding. I’m not sure which one of them, your brother or his ignorant fiance, is worse. NTA", "NTA\n\nyour brother and is (future) wife are TAH\n\nhave a nice day", "NTA. They are extremely naive and selfish.", "NTA. And tell your brother that because you love him, you aren’t facilitating this union.", "NTA remove the funding from his wedding and take your amazing wife on a well deserved holiday spoil her while there wedding is on. You and your wife have worked hard for your money your brother is not entitled to that just because he didn't plan this right and especially if he doesn't respect his sil.  Your sil on the other hand is a total hypocrite she said that she is all about family but yet when someone in the family has been let down she automatically cuts her off. I hope that you get to adopt and he/she will be loved dearly by the best parents good luck to you ❤️", "NTA, and infertility isn’t contagious. Your brother is marrying a moron.  Lots of women deal with infertility, there’s no doubt that more than one woman attending will have dealt with it or currently be dealing with it.", "NTA\n\nHonestly, I'd go MC with them, because I can totally see them also discriminating any adopted children you might have in the future since you don't share DNA.", "NTA.  I’d tell him to kiss my ass", "NTA but your brother sure is an AH.  What a stupid and insensitive thing to do because he’s superstitious", "That’s… not how infertility works. \n\nObvious nta is obvious.", "NTA - your brothers fiancé is insane, infertility doesn’t spread, and to disinvite the partner of someone helping to pay for the wedding? It’s worse juju than being around someone infertile. Don’t suppose the wedding, don’t pay. Don’t attend even if they re-offer the invitation. Save the money for your brothers upcoming divorce.", "Omg how dare they. NTA, but if you still financially contribute to those monsters (sorry, I know it's still your brother), then you will be the TA. Support your wife, let them learn a lesson about maturity. Maybe gift them a biology and anatomy textbook. Wow. Just wow.", "NTA.\n\n>> she later decided that my wife’s infertility was “bad luck” and might “rub off” on her\n\nAbsolutely fucking absurd line of thought. \n\n>> I’m ruining his big day and being selfish\n\n*You’re* being selfish for refusing to pay for their wedding after his fiancée had the audacity to uninvite your wife for a biological condition she has *no control over*? Really?\n\n>> it’s just one day and my wife will get over it\n\nIt’s not just one day. It’s going to be a lifelong reminder that your wife was disinvited and shunned for not being able to have children. It’s something she will remember for the rest of her days and something that will be at the forefront of her mind every time she sees your brother & his wife-to-be. \n\nStand your ground, OP, and be fucking wary moving forward. If your brother & his fiancée are this cruel now, think of how they’ll treat any children you adopt or how they’ll treat your wife when/if they have children.", "NTA - tell him to enjoy the wife, without your help.", "NTA -  Talk about biting the hand that feeds you. What is wrong with you brother that he would actually allow this?", "Nta holy shit what a c*** your future sil is and I can’t believe your brother would call YOU the ass for how this went down. They shouldn’t get one cent of your help", "…..some of these Reddit stories are so unfathomable, that I almost can’t believe them. You are NTA and at least you have some people to put on NC.", "NTA\n\n Take the money you were going to put towards his wedding and use it for what I am sure is a much needed vacation. If you wanna be extra spicy leave the day before the wedding.\n\nThe balls on both of them to think they can be callus, rude and still keep your money. Actions have consequences and tell any family who complain that THEY can foot the bill", "NTA\n\n> she later decided that my wife's infertility was \"bad luck\" and might \"rub off\" on her if my wife attended their wedding. As a result, she uninvited my wife from the wedding.\n\n\nSo your wife gets heartbreaking news about something that’s out of her control, and now she’s going to be ostracized from a major family event because of it?\n\nThey are being assholes.\n\nAnd the idea that having an infertile woman attend a wedding is “bad luck” or can “rub off” on anyone is just gross misogyny.\n\nInfertility is not infectious.", "NTA. Your money is obviously from a tainted joint account and would probably also bring bad luck their way.", "NTA your brother and his wife are being ridiculous. On the day of their wedding take your wife out on a special date and treat her like a queen. Just tell future sil that you won't be coming to the wedding because her stupidity is bad luck and may runoff. I am sure they will eventually \"get over\" your lack of participation and funding their wedding since they were so sure your wife will get over their rude entitled behavior.", "NTA \n\nAlso maybe I’m just new here, but did want one else read the title and think that can’t be right there has to be some kind of miscommunication or a typo? And then was shocked as hell when it really really wasn’t, people are just that much of an AH", "Support your wife. NTA. The idea that they’re willing to sabotage family relationships over a superstition they’ve concocted is absolutely absurd.", "NTA - This is just cruel and has no basis.  Take that money back.  Your wife won't get over it.  Being infertile and big moments like this hurt.  Stand yp for your wife.  Your job is to leave your family and cleave to your wife.", "Not only illogical but mean. NTA, and I support your choice to withdraw funds and self from the wedding.", "NTA fuck you brother and his new wife. Take that money and treat your wife to a nice trip", "What the actual f*uck!!!! Rubb off, the only thing that can “rubb off” is you sister in law stupidity. NTA", "I suggest telling him that the money that was promised is now going towards IVF and thank him for his fiancée's cruelty coming out now rather than after the money was wasted on them.", "NTA\n\nYour future SIL is a total crackpot, and a nasty one as well.\n\nSince she's superstitious and more than a little ignorant, I think that you should give her a talisman to protect her from infertility. Go to a witch doctor or buy a funky new-agey keyring. It's no less stupid than uninviting your wife! \n\nTake some of the money you're saving by not funding the ingrates' wedding and take your lovely wife on a relaxing, romantic vacation!", "NTA, your brother and his fiance are absolutely massive assholes and totally stupid to add. If anything behaving like them  towards other people is surely likely to bring more bad karma than anything", "That's one of those things you remember being told at family reunions and not wanting to be around them. You made the right call sticking up for your wife.\n\nNTA", "This is one of those perfect submissions where the title is all we need to know.", "NTA I’m so glad I can say this, fuck your blood family. All that matters now is your wife, your brother and his wife to be crossed a line by disrespecting your wife. Screw them", " NTA…. Your brother is and his fiancé is a dumbass", "NTA\nIf your wife is unlucky, then your money is too.", "NTA\n\nYour brother and the (ahem) woman he is marrying are treating your wife like a second-class citizen/some type of pariah because of a medical condition she cannot control.\n\n.. funny how it's only bad luck to have you and yours around if it doesn't directly enrich them.\n\nIf that is the way they want to treat your marriage, then you are more than justified in removing your support of them and their wedding.   \n Frankly after a cruel betrayal like the one the fiancée orchestrated; you wouldn't be wrong if you never spoke to them again.    \n\n\nLet them see how they like the consequences of their own shit behavior, and they shouldn't mind not having access to your wallet, since that money would be just as much bad luck as you and your wife's presence in their lives.  After all, their wedding is \"only one day\" and you were never obligated to fund it for them in the first place.", "NTA Tell them you can’t give them any money as it may have bad juju associated with it since this is your wife’s money too. Make sure to let them know that you are only thinking of their potential infertility problems that this money could cause.", "NTA\n\nYour brother's fiance is nuts if she thinks that. Seriously WTF is that way of thinking? \n\nAlso, uninvite the spouse of someone who is helping you is a surefire way for that person to withdraw help.", "NTA\n\nTell your brother it's one day, they'll get over it eventually 😏 argument can go both ways, he and his fiance are making the choice in how that day can go.", "NTA.", "NTA.\n\nYou did the right thing standing up for your wife and your future SIL is an asshole for how she treated her.", "No, you are NTA.\n\nYour brother should be informing his wife to be that her behaviour isn’t just selfish, it’s downright cruel.", "NTA. \n\nMy jaw literally dropped when I read the part about them uninviting your wife because they don’t want her “bad luck” rubbing off on them. I could only imagine how devastating infertility is and that type of behavior displayed by your brother & his fiancé is absolutely cruel & uncalled for & you absolutely should not help pay for their wedding. It’s truly unbelievable the stories I read on here. They 100% have to know that is incredibly shitty of them if they have any ounce of self awareness.", "Tell your brother that he shouldn't make a big deal that he can't get your financial help, since it's only one day and he can just get over it.", "Nta use the money from the wedding and use it to have the baby/babies. May you be bless with however many y'all want.", "NTA\n\nYour soon to be SIL is an idiot and your brother is too for indulging her ignorance. Infertility isn't catching. \n\nKarmic justice would actually be for her to turn out barren BECAUSE she blocked her generous benefactor's wife from the event THEY HELPED PAY FOR.\n\nFFS people are stupid. Support your wife and tell your brother that his soon to be bride needs to try and use her brain a little.", "NTA but your brother and his fiancé are. That’s an absurd and hurtful reason to uninvite a family member. They just created a huge divide that will be hard to get over.", "NTA and tell him that you're worried he's got \"bad luck\" when it comes to finances since he can't even afford his own wedding and you're worried it might rub off on you and your wife", "Oh hell no— you pick your wife, and you take your money back. There really aren’t any other choices. NTA", "NTA. Tell them that a marriage can be a lifetime but a wedding is just one day. They’ll get over it.", "NTA\nStand with your wife and tell your brother and his disgusting fiancé to kick rocks. Even if she was just a long term girlfriend I’d tell your brother to get bent; but that’s your wife.", "NTA it's bad luck to pay for an AHs wedding. They will understand.", "NTA. This is the most heartless thing I've read on here all day.", "Why would you be an ahole? \n\nNTA - Your brother stands behind someone who has hurtful beliefs and ostracizes your wife for a condition they cannot change. This is outlandish. Yes, remove all support. Stand solid by your wife during this devastating experience; her medical condition and a crazy insensitive bride.", "NTA - \nThat’s so insanely hurtful and absolutely ridiculous. \nI hope your adoption journey, or whatever journey you both decide on to grow your family goes well!", "It's just one day. His wife will get over it. Give them nothing. Stick by your wife and don't give in ever if his wife seems to \"just suddenly change her mind\" it won't be a change of mind it'll be her trying to reopen the bank. \n\nNTA", "If this is true, then you would be completely justified in never speaking to your brother ever again. NTA for sure and your brother and his future wife are completely out of bounds/pretty delusional to believe that infertility can be transmittable in any literal or figurative way.", "NTA. This would be it for me, I’d never speak to him or his wife again. Infertility can be absolutely devastating, to say your wife will just get over it is insensitive and cruel. I really don’t think there would be any coming back from that. Not for me anyway!", "NTA, but I have to wonder in what world does someone really believe infertility is contagious.", "OMG NTA!  What a terrible thing for his fiancé to say & do.  I’d be done with them after this.", "NTA. Take that money you were going to give your selfish, entitled, greedy AH of a brother and use it to take your wife on a once on a lifetime trip.\n\nScrew them and anyone else who agrees with them.\n\nMay your brother and future SIL have all the happiness they deserve.", "NTA. I think you’d be T A if you didn’t stick up for your wife", "NTA, your brother and especially his wife are cruel and entitled jerks. They can have their “bad luck” nuptials without either of you!!", "NTA, your brother and his wife suck!! Her for being irrational and him for going along with it.  What is he bringing into your family?  That’s sounds so terrible and inconsiderate, next thing is she doesn’t want to include you in family events.  Karma is a bitch and I hope fsil doesn’t pay the price.", "NTA. Fiancé is psychotic & brother is a huge A-hole.  Don't you dare back down. This definitely needs to be your hill to die on! Keep supporting your wife 💯%! After all, it's just one day. They'll get over it.", "NTA. I understand you love your brother, but your wife is your family too. He may think your wife will get over it but the fact is she was ostracized from the wedding for reasons she can't control, AND was made to feel like her existence brought \"bad luck\" to the people around her. On top of her own potential negative feelings towards her infertility, this is just shitty. Shame on your brother, but especially his fiance.", "NTA. Your brothers wife is absolutely abhorrent and disgusting for saying and doing that. I would refuse all contact unless she personally apologizes to your wife, and even an apology isn't enough to remedy what she did.", "Omg op NTA. Good job supporting your wife. Those two are just awful.", "NTA you’re right, you need to support your wife. Not inviting her is vile behavior and it’s disappointing that your brother is going along with this. Pull your money and use it for a nice vacay for you and your wife! I wish you both luck!", "NTA. Your brother and his fiancée on the other hand... as someone else said, take a trip with your wife instead of going to the wedding. You say you have loyalty to your brother and that's great, but your brother has just told you explicitly that any loyalty he might have for you is nowhere close to that he has for his fiancée. Take you cue from that fun fact.", "NTA - Don’t go and don’t pay for it. Just tell your brother it’s just one day and he will get over it.", "I am so utterly astonished to read this. You may love your brother, but when he supports this insane woman by asking that your wife not come to the wedding...... I would question everything about your relationship with him. Please- please do not give them a dime for this wedding. omg.", "NTA.", "NTA, but you will be if you don't keep supporting your wife and pay for this wedding. This is beyond cruel from both your SIL and brother. This should be put on choosey beggars too.", "NTA\n\nSeriously, wtf. I hope you withdraw support and keep running because that is cruel and toxic of them.", "NTA, as he said, it's just one day, he'll get over it...", "NTA\n\nYou'd be the AH if you didn't stand up for your wife.  As for your brother and future SIL....AH x 2.", "What ever you do please withdraw the funding", "Fuck your brother and his asshole fiance. They suck, hard. NTA", "Nta. And you know it. Theres no need to ask us because it’s so obvious and the rest is horseshit. On their part", "Is your brother going to disinvite your mom and grandma next, since they’re postmenopausal and also can’t conceive? Your cousin who had a vasectomy after kid #4?\n\nNTA. This behaviour from your brother and his partner is so beyond the pale. Refusing to attend and pulling your financial support is the right thing to do in the face of such vile, offensive behaviour. You may love your brother, but your brother does not love you enough to respect your family.", "NTA, you love your brother but he doesnt love you.", "NTA but your brother’s fiancé is and indirectly your brother for letting his fiancé be so rude. Infertility isn’t contagious or bad luck. If they can’t respect you and your wife they don’t deserve your money. Good job for standing up for your wife.", "This is the craziest thing I’ve read on here in a long time. NTA, not even close.", "NTA go to the wedding, pay for the wedding and expect to lose your wife", "Wow NTA. His wife must be dense because that’s not how infertility works. It’s not because of bad luck. It’s other factors. Good for you for sticking up for your wife ☺️ I’d cut them off because she may be considered “bad luck” if you guys would hang out further and keep in contact.", "NTA\nYour brother’s fiancée behaved in a shocking way. Such an AH! Not giving them any money for their marriage is the right way. Spend the money on your wife and yourself. You deserve it!", "NTA. Love your brother from a distance. He and his wife are horrible and they will ruin your marriage. You think it stops here? Your wife will always be judged by the bridezilla. Show some respect to your wife and stand with her.", "NTA \n\nI'd cut them out of my life entirely for how they treat your wife.", "NTA. Apparently their feeling that your wife is \"unlucky\" does not extend to your money. 🤨 \nThey are TA.", "NTA your brother's fiance is crazy.", " NTA that’s evil as sin", "This is easily the most NTA ever please pull all funding and I'd tell anyone what she said. Don't feel guilty for standing by your wife", "NTA Tell him that rudeness and insulting your brother’s wife is bad luck because it makes him not pay for your wedding. However, as he pointed out it, it’s just one day so he’ll get over it, right? Karma is a bitch!", " NTA\n\nWow, OP’s brother and his fiancée are something else. Infertility isn’t contagious. I can’t believe how rude they are, to uninvite OP’s wife.", "NTA\n\nYour brother, and soon to be SIL, need to get over it and grow up. What a hurtful thing they have done to your wife. Personally, I agree with what you did, and until they can get their act together, they can afford their wedding on their own dime.", "Pay and/or attend the wedding and you’ll be staring divorce in the face. Even if they apologize, I wouldn’t pay. It would be a fake apology just for the money. NTA", "NTA and tell him you found out you are also infertile and wouldn’t want the funds you give to their wedding to cause them bad luck. That is ridiculous.", "NTA- also, interesting for the groom to use \"it's just one day\" \n\nDoesn't seem to inspire much confidence in his excitement about the wedding, does it? Buy your wife a pony, screw the wedding!", "NTA but your brother and his fiancée sure are. Good for you for standing up for your wife. Your brother should watch himself. If she is capable of being this cruel, it doesn’t bode well for their marriage.", "NTA at all!  Your SIL is superstitious and cruel and your brother is enabling her. Her lack of empathy for your wife and her ignorance in trying not to be contaminated by your wife’s infertility is unacceptable.", "NTA.\n\nSuperstitions like this are idiotic.", "NTA your brother and his fiancé are the ones being selfish and will definitely get over having to shell out for their own wedding faster than your wife learning she is infertile. Also, they are both bug infested dill-weeds and I hope their cake has salt in it.", "I'm sorry for your wife and her infertilely, but your brothers girlfriend sounds like the absolute most dumbest I've ever heard off. Rub off?   \nCome on!  \n\n\nNTA, and take your wife on a long holiday and have her pampered!", "NTA. Wow, just wow. I can't imagine being as dumb and dense as your brother's fiance. You are absolutely doing the right thing by refusing to help. And when they tell you she's reinvited, tell him to go kick rocks because you're using the money you saved for a nice little romantic trip that day.", "Nta \nI get the feeling that the money requests wouldn't stop at the wedding", "NTA without a doubt… I literally can’t see anyone saying YTA, this is so clear cut, it’s absolutely insane.", "NTA. Are you sure you wanted to go to your brother’s wedding in the first place? I don’t condone people taking advantage of the mentally disabled. Shameful.", "Nta Why would they want your money it might have infertility on it", "NTA and please don't pay for his wedding to this psycho", "NTA. I can’t even believe that people have such magical thinking like this. Continue to support your wife. People like your brother and his fiancé don’t deserve your support.", "NTA - thank you for standing up for your wife.", "NTA. That f’ing childishly bizarre.", ">I’m really torn up about this because I love my brother, but I feel like I need to stand up for my wife. \n\nThere should be no “torn up about this”. There is only one answer and that is to stand by your wife. Your brother and his fiancé are cruel and ignorant to attack your wife with her infertility. \n\nNTA.", "So… let me get this straight \nThey can insult your wife in the worst possible way, still want your financial support, and you’re confused how?\nTake the money and run to an elaborate vacation for you and your wife. If they think infertility is an omen, wait until they feel the financial impact of their callous behavior. NTA", "NTA. The idiocy of your brother’s fiancée might rub off on you so it’s better not to be involved in that wedding at all.", "NTA, infertility is hard enough without all the superstition that others have! Support your wife your brother and his wife do not deserve your support or money!", "Nta… this would be a nc situation for me. I can’t imagine how devastating it is for Your wife that she can’t have a baby and then be shamed for it publicly. They are disgusting and please stand by your wife. If you don’t you come across as allowing her to be shamed in your family. And I don’t think it would stop at just the wedding invite.", "NTA. These are people I’d be cutting out of my life.", "NTA. You’re defending your wife and sticking by her when your family can’t. Cut the proverbial card and let them find their own, stupid way to pay for the wedding as opposed to your truly kind, wonderful gesture that they lost.", "NTA.\n\nThe only selfish person is this scenario is brother's fiancée.  She is ridiculous.  Infertility is NOT contagious.", "I refuse to believe this is true. Your brother and fiancée are major AHOLES.", "Biggest NTA I've seen in a long time, I can't even. \n\nYou are absolutely doing the right thing in not supporting their union in any way, considering how they are behaving. This is unacceptable behaviour towards a stranger, much less someone they know, presumably quite well! \n\nStay furious. Even if they backtrack and apologise and reinvite your wife to the wedding: don't go. Don't pay for it. They have shown their true colours and are most likely just backtracking because they want the money. \n\nI'm sorry this is happening but \\*curse words\\*.", "NTA The fact that your brother won’t stick up for you speaks volumes about their relationship. You can look forward to being at his next wedding instead.", "Your future SIL sounds like an absolute problem. Good luck dealing with that. NTA", "Curious where you are from?  Are you from somewhere that people are very superstitious?", "NTA you need to stand up for your wife.", "I.... Wow. NTA, absolutely not. I'll keep this short and sweet, cus many others have found perfect ways to advise already.\n\nYou are absolutely doing the right thing by standing by your wife. I'm sending so much love to you both in your parental journey, however that may end up. ❤️", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, a little background: my (32M) younger brother (28M) is getting married in a few months. Our family has always been close, and I've been financially successful. My brother and his fiancée (27F) asked if I could help pay for their wedding, and I agreed because I love them both and want them to have a great day.\n\nMy wife (31F) and I have been married for 5 years now. We've been trying for a baby for 3 years, but we recently found out that my wife is infertile. It's been a very emotional and difficult time for us, but we're considering adoption or other options.\n\nHere's where the issue comes in: my brother's fiancée is very family-oriented and has always dreamt of having a big family. When she found out about my wife's infertility, she was initially sympathetic. However, she later decided that my wife's infertility was \"bad luck\" and might \"rub off\" on her if my wife attended their wedding. As a result, she uninvited my wife from the wedding.\n\nWhen I found out, I was furious. I told my brother that if my wife isn't welcome, then I won't be attending either. Furthermore, I said I'd be withdrawing my financial support for their wedding. He called me an asshole, saying that I'm ruining his big day and being selfish. He also argued that it's just one day and my wife will get over it.\n\nI'm really torn up about this because I love my brother, but I feel like I need to stand up for my wife. AITA for refusing to pay for my brother's wedding after he uninvited my wife because she's infertile?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You would be the asshole to still pay for the wedding. Also bad luck because she’s infertile? I think the appropriate term for this is “horse shit”.", "NTA. At all. In fact, I think you're giving a lot of grace. I'd have gone scorched earth.", "I would be beyond livid at the disrespect towards me and my spouse, even if I were not paying for their wedding.  Tell them it's bad luck to support people who act so vile towards your spouse. And that their wedding is exactly that, just one day, and they will get over it.\n\nNTA", "NTA I am surprised you even need to ask. Offer to payAFTER brother's fiance has her tubes tied so she CAN'T catch anything.", "Obviously NTA. In fact, I'd quite literally never speak to a family member again if they uninvited my spouse from their wedding for being infertile.", "Wtf is wrong with this sub?\n\nNTA.", "NTA! Your future SIL is a superstitious cretin, and your brother isn’t any better for supporting her delusions.", "Nta. That’s discrimination. You may love your brother but your wife comes first. How he reacted is also showing you that he cares more about your financial assistance more than about his bond and relationship with you. Like someone said, spend that money on your queen", "NTA, but your brother is, and his fiance is a superstitious imbecile. The ignorance is appalling.", "NTA", "NTA. How stupid of your FSIL. What a horrible creature.", "NTA, at all, withdraw all support even if they apologize because they'll just apologize to take your money. Honestly I personally would go completely nuclear on them for this and blast them on every family chat and any social media the family uses then go no contact and say you don't want to be around her in case her stupidity rubs off on you.", "You would be an AH IF YOU PAID!", "I think my jaw dropped into my basement when I read this. \n\n\nWhat in the actual F*** is wrong with your brother and his fiancee?? NTA through and through. Wow.", "NTA. Your wife is your life. You protect her and stand up for her. As you have done - you did good.", "is this real…..", "YTA for asking if you’d be TA in this situation, they’re so obviously being unreasonable", "Nnnntttaaaa", "N T A. I wouldn't love my brother that much if he was really okay with his soon to be wife's insensitive attitude.", "NTA, for someone who is supposed to be \"family oriented\" the fsil doesn't seem to have a problem disrespecting the family she's marrying into, the family of the person who is helping pay for the wedding", "Is this a serious question? Idk if theres an AITA circle jerk sub for this bull shit. Cmon obviously your brother is ridiculous wtf do you need extra sympathy for.", "NTA but why would SIL be this superstitious? Is there a cultural element?", " YTA This post is insane and actually quite a decent example of what is wrong with this whole sub. \n\nFirst let’s look at the tropes: \n\n1) wedding -obviously \n2) wedding invite and financing issues - sure sure\n3) someone being randomly told they’re “infertile,” like that’s not an extremely rare diagnosis as far as being that black and white (there’s tests, there are low follicle counts and blocked tubes and unexplained issues but to be told point blank that you are flat out infertile is actually not that common. \n4) Bridezilla - ugh. DUH. \n5) They’re actually shocked you’d withdraw this financial support you apparently offered despite the fact that they uninvited your wife. \n6) you’re GENUINELY confused ans wanted to post about it on a mostly fictional sub. \n\nEhhh not buying it.", "Obviously your brother and his fiancee's behavior is abominable and you're entirely within your rights to stand up to it. Exactly how the AH quotient is divided may depend on a few details - like, how much money are you being asked to contribute; how much have they already spent and planned in reliance upon your support; do they have any other sources of support, &c. \n\nIf you really want to retain the moral high ground, and maybe even keep your relationship with your brother, one thing you could do would be to tell him that you'll continue to pay as promised; but that you won't attend without your wife. You may be able to persuade him that the idea of your wife's fertility problems \"rubbing off\" (whatever that means - seriously, WTF) is nonsense and that he and his fiancee need to rethink it. This is not a good sign as a start to a marriage, to begin with that level of callousness and irrationality.", "INFO:  Is this possibly a cultural thing?", "NTA, your brother and his fiancée are for being so horrible and insensitive.", "Absolutely NTA,\n\nI can’t believe that your brother’s fiancée would ever think let alone say anything like that. I can only imagine the pain your wife must be feeling at finding out that she’s infertile when it’s clear she wanted to birth children, let alone what she must be feeling now being uninvited as if being infertile is some kind of horrible disease that she’ll spread to others. And imagine if people at the wedding ask why she’s not attending now her very personal issue is broadcast to all the attending guests?! Absolutely not okay.\n\nIf your brother is willing to back his asshole fiancée  and her ridiculous request, you should absolutely back your more than likely hurting wife, she is your family", "obv NTA  \nyou say your FSIL is very family oriented, I guess that only applies to her potential future biological children? Certainly not to your wife. She's intensely stupid for believing this superstition and an incredible AH for letting that belief lead to uninviting your wife.    \nI understand you love your brother but he 1. agreed with FSIL and went along with her ridiculous decision   \n2. Completely trivialised the pain this will cause your wife, no it's not \"just one day\" and she will not just get over it and   \n3. when you absolutely rightly stood by your wife and chose to also not attend and not pay he displayed complete entitlement to your money and threw a temper tantrum over your decision.  \nIm sorry to say your brother is also being a total AH and I don't know how you're going to be able to spend time with these people at all in the future.   \nI wish you and your wife the best.", "NTA you definitely need to stand by your wife. Take the money and take your wife on a much deserved vacation. \n\nThis is one of those times your wife need to be your only priority. If you continue to let them get by with treating her less than then she will believe you see her less than. Cut contact with your brother and future sil.", "NTA and more like r/badwomensanatomy", "This may sound stupid…. But Y T A for even thinking that you might be for withdrawing the support. They are morons….. (NTA)", "Wow, NTA big time. But your brother and his fiancé certainly are.", "NTA. Your actions are correct, given that your future SIL's views are archaic and superstitious, and it seems your brother is completely spineless where she's concerned.\n\nWithdraw both the financial support and your attendance. \n\nWhy? *Because when people show you who they are, believe them*.", "NTA.  His fiancee is delusional and he's enabling her.  You love him?  You need to ask if that is actually reciprocated.    He called you selfish?  If it's just one day, he'll get over it.", "I'm often just blown away by the behavior some people think is ok.\n\nNTA\n\nFuck sake.", "How is this even a question?  \n\nAsk your brother why is he and his wife so selfish and entitled that he thinks they deserve your and your wife’s money for a wedding they want to exclude her from?  Not to mention for a very ignorant and dumb reason like being infertile?\n\nTell your brother his big day is just one day in the scheme of things and he will get over it as soon as he and his wife get their heads out of where the sun doesn’t shine.\n\nYWBTA for refusing to pay.\n\nY w b t a to your wife if you decide to pay for a couple who disrespected her and spat on her for an issue she cannot control.", "NTA! Your brother’s fiancé is being ridiculous and rude af. I don’t understand how your brother is even ok with this", "Wouldn’t logic dictate that if OP’s wife is “bad luck” then accepting money from OP is *also* bad luck?", "How obtuse must your SIL be to think infertility can \"rub off\" on her?? Either that or she doesn't want to invite your wife for some other bullshit and is using superstition (?) as an excuse. And she's also cold-hearted and mean, as is your brother. You would be TA if you proceeded with paying, you're NTA for your decision. Kudos for supporting your wife.", "I feel like there's something else at play here. For now I'm going to say NTA but I believe you're not telling the full story. Surely that can't be the only reason?", "NTA but you would be TA if you enable the behavior and pay. This is one of those situations where the red flag has turned into a gaping black hole with flashing lights saying “DEATH AHEAD” \n\nI’m so sorry for your wife’s infertility struggle and I truly do hope you can find a solution for your family. Her uterus isn’t going to jump out of her body and rub all over SIL and give her the infertile.  Women like this are miserable and will make everybody close miserable so get out now.", "If you wanted to be an AH tell the SIL that you put a hex on your wife because you didn’t wasn’t to have kids, now after her actions you put the hex on her too.", "NTA the fact that your brother is with a woman that bans a womn from a wedding for being infertile is disgusting. \n\nIf you bite the hand that feeds you then you do not get to whine about the consequences.", "NTA and his fiance is a total colossal airhead!   No one catches \"infertility.\"  It is not a disease!  Stand by your word.  That is unacceptable!", "If you don't side with your wife and cave to your brother then you might as well get divorced because you obviously don't love your wife.", "Wtaf?? NTA. Your brother and future SIL are the major AHs here. I cannot believe she literally uninvited your wife for being infertile. Not to mention they shouldn’t be shocked when you no longer offer to pay for the wedding after being so cruel to you! This literally boggles my mind. I’m sorry for you.", "What backwards shit is this? NTA. Don't support them. Also sorry for your wife's issues. It sucks.", "NTA. Get a vacay with wifey on your brother's wedding. Out of sight, out of mind.", "NTA.\n\nYou don’t “catch” infertility. Take the money for their wedding and treat your wife to a vacation or something.", "NTA, your brother and future SIL have some nerve trying to ban your wife for something out of her control, but still expecting you to pay for it. They really need to learn the concept of not biting the hand that feeds you", "NTA ask your brother if he’s afraid his fiancé’s stupidity will rub off on him if he marries her. Save your money and invest it in building your family, I wish both you and your wife well, you sound like a amazing partner.", "NTA by any stretch. But if you do pay or even go then you would be a massive AH to your wife", "NTA\n\nIt's just 1 day, your brother will get over it.", "NTA. Anyone else thinking that the fiance didn't want OP's wife there because she didn't want her \"thunder to be stolen\"? I've seen other instances on here of folks not wanting to invite anyone going through tough stuff to their wedding in case it \"overshadows\" the day. Despicable regardless, but it makes me wonder what else is going on here.", "NTA. Time to cut your brother off financially. Don't pay for his wedding and stop giving him money. I guess he never learned that you don't bite the hand that feeds you but he will", "Are your brother and his fiancée living in the Middle Ages? You are NTA, but they certainly are. How ignorant and despicable can they be? I’m not one for schadenfreude, but if I was to hear that they themselves had difficulty in that area in future I would say ‘thank you  Karma’. To think that they still expect you to pay for their wedding is outrageous.  Your poor wife and you should use the money to go on a lovely holiday or use it for something that she would like. Such cretins.", "Tell him that you think his poor financial situation is \"bad luck\" and you think it might \"rub off\" on you if you pay for the wedding. As a result, your wallet was also uninvited from the wedding.", "I wouldn’t even give them the out of if they re-invite her, you’ll pay. This would be the end of my paying for the wedding with bro on warning that he’s on the verge of NC. NTA", "NTA\n\nand imo someone who thinks infertility is contagious should not be able to have a kid", "NTA, NTA, NTA. You continue to stand up for your wife. \n\nShe just found out something that is heartbreaking for her. You admitted it's an emotional and difficult time. And now your future SIL is doing her best to add to the pain and guilt your wife is already feeling?!? That's horrifying. I don't care how superstitious of a person you are. That's cruel.\n\nYour brother should honestly be rethinking the wedding after such behavior.", "NTA  Choose your wife and don't back down. Do not pay for the wedding. Reconsider what sort of relationship you  want with your brother moving forward.  Spend the money you had put aside for the wedding, into looking some of those options you and your wife are thinking over.", "My dearest friend, a woman I'd known for years and someone I had let move into my house when she left her abusive partner called me in November of 1987 and told me that she wouldn't be talking to me or visiting with me until the new year because I was \"bad luck\".  \n\n\n1987 was the year that my mother died of breast cancer (six weeks from diagnosis to death and I was only 32 at the the time), my best friend died of AIDS and my beloved dog  also died of cancer unexpectedly.  \nI've never spoken to her again.  \n\n\nYou're are so NTA. I'd go low to no contact with both of them. You can't  piss on someone's misfortune and expect them to want anything to do with you much more ask them to subsidize your cruelty.", "NTA unless you attend then you are", "NTA I wouldn’t pay at all now that you know how awful his fiancé  truly is….", "What the everloving f@ck did I just read, here?!? Your brother's fiancee thinks infertility is *contagious*?!? And your brother is enabling?!?\n\nOh, hell no!\n\nYour future SIL and brother deserve absolutely nothing from you after pulling that kind of nonsensical BS, which also served to rub salt into your wound.\n\nNTA. OMG, you are soooo NTA here.", "The fuck did i just read?? How is this even real?\n\nNTA but why in the ever loving shit are you torn??? They disrespected your wife, rubbed her infertility in her face, and essentially ostracized her for something she cannot control. And you’re torn why???", "NTA. You sound like a really great guy who does love his family, but if this has you torn up about the whole situation, I don’t know what to tell you. Your wife being infertile might “rub off” on your SIL? Give me a fucking break. Say what you want about me, but the uninviting just over that would not only stop my financial support, but would also be enough for me to be willing to go NC for however long I needed to until they apologize.", "Nta - explain to your brother that you need to withdraw support to pay for fertility assistance! \n\nWhy spend money on a party for him and his idiot wife when you can spend it on having a child with your wife?", "NTA - Just argue that since your FSIL is afraid that inviting your wife will be bad luck,  then obviously she wouldn't want your money since the money is also your wife's.", "NTA - it's your future SIL who brings bad luck for your family. If she was sympathetic at first,   either somebody said something to her or she thought that herself. Either way,  that not a good sign. They shouldn't accept the \"bad luck\" money. I won't wanna be reinvited if that me.", " NTA your being a good husband not going to the wedding and not giving them money. How cruel to say that to anyone especially family. Please continue to stick by your wife and not give in.", "NTA, and screw those selfish, ungrateful people.", "NTA. Shame about your brother, though, marrying a vapid woman. Ah well. Maybe their huge brood will be halfwits at best.", "NTA.  It’s clear that you love your brother and you’re very committed to your family. \n\nYou did great standing up for your wife and yourself.  \n\nNow it’s time for your brother and his fiancée to decide what their love and commitment to family looks like. \n\nBest of luck with having the kids you want in whatever way they come into your lives and hearts.", "Sorry, but what country or culture is your sister in law from where she believes infertility in one person can spread to another? \n\nThat's. Very. Backwards. \n\nNTA.\n\nAnd don't pay for a bloody things. \n\nDems the breaks for your brother.", "NTA. Infertility is a painful and personal subject for many people - I know it was for me - but my infertility didn't \"rub off\" on everyone I knew. That kind of ignorance is astounding (and come to find out, I was able to have one child many years after my wedding - and right before a scheduled hysterectomy at that. Six of my friends were also pregnant that year. Stuff just happens; you can't really predict the future).\n\nBut you can predict where some assholes are here. And while you can love and support your brother all you wish, you chose your wife when you married her. Your anger regarding your brother's comments, and his future wife's ignorance, is warranted and justified, and your brother is making a clear statement by wishing for your financial support after his soon-to-be wife said, \"Your sister-in-law can't come, she might stop me from having kids!\" \n\nDon't subject yourself, let alone your wife, to that bull. Again, yes, you love your brother - I don't think love just STOPS when something stupid and awful happens. But you're NTA for not wanting to pay for a wedding in which the bride believes your wife will be some odd bad-luck fairy. That's just - not how any of that works.", "You and your wife are probably already hurting from not being able to conceive.  Uninviting your wife just makes it worse because it make it out as if it’s your wife’s fault, when it’s out of her control.  It’s hypocritical that they place so much importance on their wedding day and then minimize how negatively it would affect your wife if she was not invited.  Your brother and his fiancé are uncharitable, unsympathetic AH.  You are right to not pay for the wedding.  Stand your ground.", "Nta", "OMG, NTA, NTA, NTA. \nNOT THE ARSEHOLE. \n\nYou have been through enough. Your wife has been through enough. You are looking at options to enable you to have a family. \n\nTake the money back. You are not a bank. YOU ARE NOT A BANK! \nYou are not responsible for the cost of a wedding for a brother who agrees your wife (who is paying for the wedding) shouldn't be there for whatever f#£_ed up reason his bride believes! \n\nFamily comes first. Your Family is your wife. Continue to support her!", "NTA. I would never forgive my husband for abandoning me and going along with such a hurtful thing. Sorry for you and your wife, it’s hard not being able to have your dreams turn out how you hoped.", "I don’t really believe in bad luck or karma but not losing money for a wedding because you were cruel and insensitive over a ridiculous reason…\n\nNTA \n\nYour brother is an AH for being okay and pushing this and even if FSIL genuinely believed this (unlikely) she’d still be a cruel, entitled person. \n\nI guess her grandmother won’t be permitted to attend and probably not her mother either. Can’t have menopause rubbing off /s", "NTA. Tell your brother that you'll pay for his divorce.", "NTA", "NTA. Infertility doesn't \"rub off\" on people, but looks like stupidity does. Because your brother sounds just as stupid as his fiancée, supporting her with that bs.\nDon't pay for the wedding. They insulted you, by insulting your wife. \nClearly your brother doesn't care that much, otherwise he would have shut his fiancée down immediately. You have zero reason to feel any guilt.", "Is this a joke?", "NTA, brother's fiance is a walking red flag, and if he stands by her in this, then it means he is a red flag too. Standing your ground to stick up for your wife is something a good person would do.", "NTA good on you for prioritizing your wife like this.  It’s good to set some very clear boundaries the moment family members try to test them.  Anyone who tries to disrespect her over the fertility issue will be cut off until they learn how to act right.  You need to let people know right away when they cross a line what the consequences are and stick to it", "NTA.\n\nYour brother and his .... charming ... fiancee however are colossal bell-ends in dire need of a moral compass and some emotional intelligence. Possibly also a shared brain-cell wouldn't hurt to address the risible supersticious shite on display", "NTA does FSIL not understand science?  Infertility is not like catching a virus.  Your brother needs to educate her so that she understand how fertility works.", "I really hope this is rage bait because otherwise, this is absolutely revolting! \n\nYour future SIL is trying to say that your wife will somehow pass on infertility to her like she's contagious or actively cursing her? And then goes further by refusing to have her at the wedding? That is some next level asshole behavior! \n\nYour brother being ok with this is also asshole territory.  Thinking that uninviting your wife meant that they were still entitled to not only your presence but your money goes way beyond anything.\n\nNTA", "Info: How can you be torn up over this. It’s so ridiculously outrageous.", "Please love your wife. She doesn’t deserve this level of disrespect. Your brother and his fiancé are trash. Let them take their own butts to the curb !", "NTA, for either both of you. Give the whole \"family\" thing a big quadruple middle finger! Spend the money somewhere else. Take your wife on a vacation instead!", "Why do you even need to ask this?  I was going to go with NTA but this is one of those rare occasions where you are TA for wavering on supporting your wife by asking!", "NTA.\n\nfiancée is family oriented, my ass.\n\nplease, give your wife a really big hug from this internet stranger, will ya?\n\ntheir behavior, it will cut her really really deep. so deep that i fear there is no coming back from.\n\nit is clear, at least to me, that any kind of re-invitation they do will only happen to get your money. maybe pay for it if you feel generous and they both did grovel at your wife's feet and she finds it in her heart to forgive them. but attending? HELL NO!\n\ntheir wedding day is reserved to be an exclusive spa weekend for both of you where you wine and dine your wife, pamper her, 'love' her, show her she matters as she is. where you will just hold her when the tears starting to flow as it comes crashing down what bro & fiancée did. \n\ni am a proud member of the petty asshole club. i can be mean, i will be revengefull if i deem a situation warranted it.\n\nafter the knot is tied and i had to endure them at family functions i would always ask 'pregnant yet / still not pregnant / when will you give me a nibling'? and the longer it takes for fiancée to get pregnant, the more i would harp on the fact that since your wife wasn't at their wedding, barren (goddess of infertility) could not be tricked into thinking she already 'blessed' the wedding and so she poured her unique cornucopia out on fiancée. \n\npetty, nuclear, mean, i do not care. there are some things you so do not do. there are some words you so do not speak aloud. you don't beat, you don't kick a person already lying 'crying on the ground' since the dream of her own child burst. who also might fear that you may abandon, discard her 'since she is not a real woman / is defective'. \n\nbro & fiancée, if the spouse of the person you wronged till kingdom come is the person doing you a favor, footing your bill, helping you, do not be surprised if this person rightfully negates all promises made. actions have consequences, you know. \n\n'buwäääh, my 'princess for a day' party, ruined'", "This is one of the crazier stories I’ve read. What the actual heck. NTA! The fact that you are concerned about hurting your brother shows that you are a caring person. You need to take a step back from this and look at it rationally. Future SIL has some kind of crazy bias that she’s not even trying to hide. You and your wife are a team. Period. Your brother has chosen to be hurtful towards her, which is hurtful towards you. You can’t, in good conscience, throw your money at that. Even if apologies are made and the invite re- extended, I would have serious reservations about supporting them emotionally or financially. SIL has shown you who she really is. I’m sorry.", "I would never wish infertility on anyone, being infertile myself, but if anyone deserves it - it’s your soon to be sister in law.  What a horribly ignorant and cruel thing to say.  Yeah, do not attend or pay for that wedding.  She just cut her nose off to spite her face, and she will have to live with the consequences of her actions, and a cheaper wedding.  NTA!", "NTA. But please come over to my house so your financial success will rub off on me. I could use it. I'll make pigs in a blanket too.", "NTA. Obviously they don’t care much about you at all and just about your money given that he’s outright saying you’re being selfish and “ruining his big day”. \n\nAs much as I get you loving your brother, this is showing some red flags on how he views your relationship.", "NTA. Paying would honestly be a slap in the face to your wife and salt in the wound. Also how uneducated is your brother's fiance? This is 1500s peasant logic.", "I would tell your brother that Feng Shui dictates that good money should never go to a bad place. A good place would be an adoption lawyer. So in the meantime, he and his bad luck soon to be bride need to stay far away from you.", "NTA. \"I'm sorry brother but your and your wife's extreme stupidity might rub off and life is hard as it is without a sudden and extreme drop of IQ. I'm sure you'll get over it. Bye!\"", "NTA and definitely pull your financial support. I would say that even your brother and SIL “change their minds” about inviting your wife, you still shouldn’t pay. This was a very clear showing of how dispensable your wife is to them and you by extension. You shouldn’t finance anything in their lives moving forward.", "NTA - wtf", "Bro better do a swim test for his little guys before the marriage. Otherwise his soon to be wife will leave him or cheat on him for failing to provide what the fertile one needs for her large family. NTA.", "NTA. Do not give him a penny after the treatment of your wife.", "Of course you need to stand up for your wife! Tf. Is that even a question?? My gosh. Catch infertility?! How dense is she!? NTA. Absolutely NTA. I wouldn’t pay for it either. I wouldn’t go or pay for it if they change their mind either!\n\nAlso, since they can’t even afford a wedding…tell him you and your wife are afraid you’ll end up in their financial situation…you know? Lack of money.", "Just when I thought I have read it all.\n\nNTA", "NTA unless you give in and pay anyway.  That would be a very cruel thing to do to your wife.  Even if they decide to re-invite her I wouldn’t pay for their wedding; they’ve shown their true colors and it seems all you are good for is your money.  No one who cares about you would ask you to still pay for their wedding while excluding your wife bc “it’s just one day.”  Your brother and his fiancé sound like they are made for each other.", "NTA I'm kind of shocked this is even a real situation. If you pay for this wedding when they uninvited your wife you are setting the tone for how they get to treat her. I honestly think if you still paid for it you'd be the AH. It is beyond generous that you said yes in the first place, for them to do that to your family and you to not realize( sorry, I am pretty shocked you even feel bad pulling the money after what they did) just tells them you value making them happy with your money more than you value yourself, your wife and your future family.", "**NTA** \\- cut them loose.  Wife first, then family, then friends.", "Nta. \n\nUse that money for fertility treatment or adoption.", "Not sure how you could be considered an asshole for having your wife's back in this situation. You aren't being selfish it's your brother and his fiance that are. \n\nI hope you update us after you've told them you won't be paying for or attending the wedding.", "NTA. he is allowing his fiancé to bite the hand that is paying for his wedding.\n\nTell him if he asks you to reconsider, that you will now be using the money for adopting or IVF.", "NTA.  Don't let them get away with abusing your wife like that.", "Please. Stick to your guns. \nYour poor wife is in enough pain.\nYour brother’s bride to be is the major AH here.", "So they have uninvited your wife from a joyous event that will be filled with family because of her private health situation that doesn’t actually affect anyone but the two of you, but they still expect you to pay for it? What? I’m sorry they are being so cruel to your wife. \n\nThe only way you would be the AH here is if you caved and gave them a dime after they disrespected her so badly. I would let them know it’s her money, too, since she’s your freaking spouse, and expecting her money to go to an event she’s not allowed to attend is fully ridiculous. NTA.", "NTA - But your brother's wife is a BIG AH.  I would pull my funds and ask him why he's marrying an idiot.  Someone can't be that stupid, but obviously she is and he's standing by her which means neither one of them have the brains they were born with.\n\nBad luck at the wedding would be your brother marrying her.", "This is the way.", "Love this response...", "I wish I had an award to give. But this! This is the correct response!", "This is the *chef’s kiss* of responses", "This. 100% this. NTA. Your brother and his wife are heartless. I would go low to no contact unless your wife receives a sincere apology.", "I like you. Absolute perfect level.of petty.", "This is perfect. NTA", "Excellent response, OP is probably too nice of a person to do this but Im not and if I thought of it I would", "This is the perfect answer NTA", "That's beautiful ❤️", "It's just one day, after all.", "Chef's kiss", "100% but I would still not attend/finance their wedding. This couple is not just bad luck … their are bad people. So heartless", "Boop there it is! \n\nBrother's fiance is afraid the wife's infertility will be bad luck if she's at the wedding, but *somehow* the money she's very much connected to *won't* be a problem? Brother needs to take off the rose tinted glasses & see his fiance for the judgmental AH that she is because what she's doing *isn't* someone who values family imo. \n\nOP is NTA 10000% & should use that money to take a trip with his wife &/or prepare for when they adopt. Either way, brother & his fiance have some nerve & audacity to even think uninviting OP's wife was okay & then still expecting them to bankroll their wedding as if they weren't tacky AHs for doing so. The fact that he doesn't see how awful she is & is backing her up on uninviting his own SIL over something she can't control says he's a lot about both of them & none of it's good.", "I like this a lot :)", "Sounds like OP is a really decent person whose brother is attempting to manipulate their relationship for his own ends. It's easy for us to look at this objectively but good people get the short end of the stick from assholes alot of the time unfortunately", "As though infertility were infectious like a cold.", "...bag of rocks. Well spoken.", "“I worry your fiancée’s stupidity might rub off on us. In fact, I already lost a bunch of brain cells listening to her reasoning”", "Imagine if a close family member got cancer. Would she tell brother that they can't go visit them because it might rub off? Wtf", "Right? What the fuck kind of voodoo shit is that? Also, just one day my ass. Oh, she’s not invited to [insert holiday/family gathering] because I might catch infertility. Cut them loose now.", ">Yes, modern medicine understands infertility is a result of contagious bad luck, with weddings as a primary vector of infection, especially if rubbing is involved.\n\nThis made me laugh so hard I almost choked on my snack 💀 \n\nThank you, I needed this today 🙌", "Do banks make wedding loans? That's where the brother and future SIL need to look for some money?", "Cruelty cannot be justified. And then to hope that her SIL would ignore the cruelty and finance the celebration? Oh hell, hell, hell naw.", "I'd take the money and weekend in Aruba or somewhere else I've always wanted to go.", "Agreed. There is no turning back from this. It sucks that these important relationships are forever changed, but it’s the reality of it. I’ve never forgotten how some of my husband’s family reacted when we were having a boy and not the precious girl they wanted. I can’t imagine trying to forgive someone for kicking me when I’m down like SIL is doing.", "Love it! OP, please do this. \n\nNTA for sure, but this is so clear-cut that I’m worried about you being torn over it. I’m going to chalk it up to the utter shock and devastation of just discovering that your brother and his fiancée are stupid, cruel, and entitled people. \n\nTake the money you were going to use for this wedding and put it toward adoption costs/treatments/surrogate/therapy (actually, do the last one regardless. Infertility is incredibly painful for both of you). And first, maybe take some of that money and do something nice for yourselves on their wedding day.\n\nI’m so sorry you have to deal with this on top of the infertility news. Best wishes for you both!!", "Agree.", "fr, i couldnt get thru it without thinking \"this isnt real\"", "NTA save your money for adoption or a surrogate especially because being childless is such a problem for them. They should not want you to spend money that you could use getting a child on a party that only lasts one day.", "Right!? She may need to contact all her guests to verify their fertility before the big day. /s", "LOL - This is the best comment!", "Perfect!", "The same people who think sitting on a toilet seat will get you pregnant. OP is definitely NTA. Brother and FSIL are absolutely TA.", "I’m wondering if she/they are from a culture where superstitions are very prevalent. That is certainly no excuse for such abhorrent behavior by the SIL to be, but I cannot possibly imagine why anyone would believe such a thing.\nNTA and I would say you are not enough of an a-hole in this scenario.", "Way too many AITA posts are about weddings. People lose their minds when it comes to weddings and pregnancies.", "His brother is absolutely an asshole. What kind of brother who's having his wedding paid for would allow their wife to be to make a demand like that. Total asshole and I'd really like to say worse about the brother", "But he probably won’t get over how awful his brother and his wife are", "And stupid, to boot! What kind of moron believes infertility is contagious???", "Yes to everything here! 🏅🏅🏅🏅", "This was absolutely my reaction too: Holy cow and WTF! \n\nInfertility is \"bad luck\" and \"might rub off on her\"? You absolutely shouldn't finance the wedding, and if your brother can't understand how incredibly rude it is to uninvite your wife he needs some serious self reflection. \n\nNTA, 100%", "I agree and I can guarantee you that karma will hit the future SIL", "It’s also not contagious. \n\nNTA.", "This entire post is simply not true.", "All of this.", "Agreed. \nI say NTA but if I were your wife, i’d be extremely disappointed if I found out what you’re asking here on Reddit. \nHope you never tell her and immediately take action on your brother and future SIL.", "How are you answering this is complete good fault as though it’s a legitimate post? I’m genuinely curious: did you believe the events in this post actually happened?", "Fantastic idea", "I agree with this, take your wife on an amazing trip. Call it a second honeymoon", "But who is waiting for the one person to tell op he is ta because he promised. And that his brother is family and family does for family and some other bull shit!", "OP should stay away just in case stupidity is contagious because it looks like his brother already caught it.", "There are so many stupid people out there. It's terrifying.", "Yes, since she's so superstitious, then she probably shouldn't want OP's cursed infertility money either.", "I had to read the whole thing because I thought the title must have been misleading or exaggerated. But no.", "100% was coming to mention the karmic justice that would be lol like damn, nta op but your brother and certainly the FSIL is 😤", "You beat me to it. NTA. What a bunch of selfish pricks.", "Doubtful", "He has spoken.", "This is the way", "Well said.", "If it was I’d constantly cozy up to infertile people. ;)", "Take the money aside for adoption or other children related expenses you might need! I have 2 under 2 both are premature and require more than just “I fed them and they see the doctor for shots that’s it, ya know the regular “ you don’t EXPECT AND PLAN for the shit that may happen you could adopt a newborn with no known issues and then suddenly they aren’t eating aren’t gaining weight and they are delayed for unknown reasons! Most people are going to struggle to afford several therapies to support a child that isn’t perfectly healthy and fit at all points in early childhood…. No illnesses I wish upon them but it’s the reality of life sometimes and a good backup plan is a fantastic start in case, even healthy babies need soooo much stuff! They may not understand how you dump 1,000s in the first year yet! We sure weren’t expecting alll they need and want, who thinks their 3-4mo is too big for the bucket seat, ain’t it suppose to last a year?! Apparently it happens sometimes 😂", "They're kind of tedious... \"WIBTA if I [insert drama].\"", "Yep, the whole \"rubbing off\" thing doesn't make sense to me, I wonder where that logic comes from?\n\n&#x200B;\n\nedit: I've come back to this post and am realizing it sounds a little rude. I'm sorry, I'm not very good at conveying tone/emotion online.", "Of course there are stupid people out there but my god don’t pick THIS as the story to defend. It’s literally a trope is so ridiculous.", "Bet the bride doesn’t want anyone focusing on anyone but her and she wants OP’s wife out of the way. What she doesn’t realize is it will cause more commotion if she isn’t there and everyone is asking why."]}