{"id": 14946, "submission_id": "12o2hjp", "title": "AITA for being upset that my twin is coming home for our birthday?", "selftext": "I (20F) am turning 21 in a bit over a week, my twin (20F) lives in a different state for uni, she's much more extroverted and social then I am. I struggle with her as she's always overshadowed me in everything, and all of our birthdays have felt like it was a party for her and I was tacked on as an afterthought. She feels a constant need to push my boundaries and force herself in everything. I'm autistic and hate this, she's loud, she complains, she's demands everything to be done her way and its awful, especially around birthdays. She's also said and done awful things to me which she refuses to even acknowledge or apologise for.\n\nThis year, my mum said she was going to stay in uni for her birthday and celebrate with her friends. I was so happy, for the first time in my life, at 21 years, I was finally getting a birthday to myself.\n\nUntil today, when my dad decided she should come up because she would be upset that she was spending her 21st away from family. My mum started organising a plane trip for her and I just felt betrayed and hurt. She knew how happy I was to have a birthday to myself, and she's bringing my twin up anyways, even though she said she wasn't. \n\nI brought it up to my mum how it felt like a slap in the face and she told me that its her 21st and I should be more understanding but I'm just angry because she's ruined every birthday for me and made me feel miserable every time and I finally thought I'd have a birthday that didn't end in me crying in my room, but nope. Same old shit as usual. Mum got annoyed that I was telling her to \"ignore\" my twin but she already had a party/get-together type thing planned with her friends so it wasn't like she was going to be alone.\n\nAITA?\n\nEdit: I should clarify, to all the people saying I should hang out with my own friends, I don't have any, not irl anyways, so I really only have my family to celebrate with me", "created_utc": 1681636965, "permalink": "/r/AmItheAsshole/comments/12o2hjp/aita_for_being_upset_that_my_twin_is_coming_home/", "score": 161, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) being so upset about sharing a birthday with my twin\n2) that i want mum to cancel my twins flight and for her to have her 21st away from family\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH here - your parents have two daughters that are having birthday, not just one. Your relationship between your and your sister is not okay, but you pushing your parents to act as if they don't have another child is not okay either.", "Well, you’ll be 21. So the good thing is that you can just go out by yourself that day to celebrate. Maybe you can go with some friends.", "No judgement - Twin here (57f). I get feeling like nothing is your own but:\n\n1. You cannot expect your parents to feel that way. They have 2 kids. \n\n2. As you become older and more independent of your family, you will have lots of birthdays with the people you chose to celebrate with. \n\n3. You need to work through your feeling with your sister. Is there a difference in the way you’re treated or are you perceiving it that way?  Only you can answer that. \n\n4. The downside of being a twin is being treated as if you’re a package deal and not individually. That also changes as you become more independent. \n\nDon’t despair, enjoy your 21st and know that things will change soon enough. Happy birthday.", "I would say YTA for expecting your parents to ignore their other daughter. I am sorry about your past birthdays, though. They should have done things differently. You are two people with two birthdays (on the same day). Since you have two very different personalities, you should have two different birthday parties. One for you with the things that you like and one for your sister with whatever she wants to do. Birthday parties don't necessarily have to happen on the exact same day you were born (school/jobs make that difficult), so this could work for both of you. Talk to them and try that.", "Go do your own thing for your birthday. You don’t have to hang out with your sister. It’s not weird that your parents want to celebrate with their kid on their bday.\n\nI’ll go with NAH", "I am a twin myself and my sister and I have always fought like cats and dogs. We went to different schools after 5th grade (nothing to do with fighting) and we now live 6000 miles apart which seems to work best (we fight almost everytime we get together still at 46 years old). I cannot imagine trying to dictate my parents not to include their other daughter in her own birthday (or even not wanting to include her myself). I say this as a person who has spent my last 29 birthdays in a different country/continent than my parents&sister while they were all together. YTA!", "NAH \nI can understand your parents wanting to spend time with her since she lives far away. \nWhy don't you spend time with some friends away from your family?", "YTA\n\n&#x200B;\n\nYOu CAN have a biethday for yourself - instead of celebrating with your family, have a party with your friends. \n\n&#x200B;\n\n&#x200B;\n\n\"nd I finally thought I'd have a birthday that didn't end in me crying in my room, but nope. \" .. Do grow up. It is NOT your sister's duty to manage your feelings and your inferiority complex.", "Yta honestly. You're 21. Just go out with your friends. You can't honestly expect your parents to not want to see her on her birthday. How would you feel if she showed up and asked you to go somewhere else to celebrate so she can \"have a birthday to herself\"?", "My only suggestion is do go out at the time of the party and celebrate with a couple of friends, the way you want to celebrate.", "NAH, and I'd advise you to find a way to celebrate your birthday in other way. Even if you don't have friends irl, plan a nice fun day for yourself, maybe meet your online friends on a call to watch or play something. You can't prevent your parents meeting their other child or celebrating with her, however, you can make this day enjoyable for yourself. You're a big girl, time to do big things", "YTA. It’s not just your birthday. Your parents have two daughters they want to celebrate and while I understand you’re upset you can’t really expect them to not want their other child to come home to see family. \n\nWithout specifics it’s hard to judge your relationship with your sister. But assuming she is in fact awful, you’re 21, you can make plans to celebrate your day with friends. You are not obligated to spend it with her.", "YTA.  Your mother is her mother.  It's her 21st birthday.  Your home is her home.  If you want a birthday all to yourself, plan a trip, plan a birthday, and skip your sister's birthday.", "Hi OP! I saw you said that you don’t have any friends locally/‘in real life,’ so it must be really frustrating to get a lot of advice saying to go out with friends. Since that sounds not possible, I highly recommend a virtual party with your online friend(s). I’ve had online friends since I was in middle school, and I’ve had some of the best virtual celebrations with them. This could look like something low key, like watching something all at the same time and messaging each other, getting on a big Zoom and playing a game (one year we did Scattergories but specifically topics related to the birthday person), and that was really fun! I know it feels like a bummer to have your plans squashed and feel unheard by your parents. There are still ways to make your birthday special. \n\nNAH", "YTA. You're 21 - go out with your friends instead of blaming your parents for wanting to see their other child on her 21st birthday.\n\nYou're turning 21 - time to grow up.", "NAH. Can you go away?", "Sweetie, I have a very extroverted and sociable twin brother, so I get that the two of you don’t want to do the same things. My brother and I rarely want to do the same things too. We’re 25 now, so we’ve had a little more time to figure out how to make things work for us. \n\nThe first thing you need to do is stop thinking about having a birthday to yourself. Even if you aren’t with your sister, you will never have a birthday to yourself. You will always be sharing it. There was a birthday my brother and I had where we were in different states and time zones, so you know what he did? He called me at midnight in his time zone so he could joke about being older than me for the first time in our lives. My cookie cake still had his name on it because he’s my twin brother and it’s his birthday too and I love him. \n\nYour sister loves you. It’s important to her to be home and share this birthday with her family, including you, because you are an integral part of her life. Now, it’s okay to have wanted to do your own thing. And you still can. You’re almost 21! Make a new tradition of going out to get yourself a slice of cake if you get tired of whatever is going on at this celebration. Or schedule a call with your Internet friends so they can sing happy birthday to you. Or talk to your sister and tell her how you feel when she pushes, because I really doubt it’s malicious. I think she just doesn’t understand that you’re enjoying yourself in your own way, so talk to her. \n\nAnd stop taking this as a personal attack. It wasn’t. It’s not. It’s just your family doing their best, okay? You’re not an AH and neither are they, but if you decide to spend your whole birthday and the time leading up to it angry, you will be. Not because you’re angry, but because people aren’t particularly nice to be around when they’re angry. You’re going to be okay. NAH.", "I think this depends on motive and what exactly the plans are. You seem to be heavily implying that they are doing this to just piss you off, in which case you aren't the AH, but I'm not sure that's all there is to it.\n\n\nIf this is your parents convincing her to come home, with some misguided \"you should be home for your birthday\" and she'd rather spend it with her friends, they are the AHs. \n\n\nIf she wants to come home for her birthday, and do stuff maybe with HS friends and it's a convenient weekend, you're the AH for making it about you (not for being upset).\n\n\nAnd what were your plans for your birthday? Was it a special dinner with your parents or something? Or just that you didn't want her present at all even if she does something different. Do you make any effort to make plans with friends?\n\n\nWhere was she for her 19 and 20th birthdays?", "This sounds complicated.  You aren't the asshole for your feelings, and wanting to spend your birthday alone.  But, you also are kind of the AH because you are trying to keep your parents from seeing their child on her birthday.\n\nI know you say you have no friends.  If that's the case, it may still be best not to celebrate with your sister if you are feeling upset about her presence.  Maybe you could take the day alone to go to the park and a movie?", "YTA— coming from another twin, I hate to break it to you, but the birthday will never just be about you, especially to your parents. They have 2 children not just 1 celebrating that day. \n\nYou can do whatever you want for your birthday, you can even do it a day later just to do something on your own. But you cannot expect your parents to only cater to you.", "NTA\n\nI would make other plans for the day, the weekend or whatever, so you do not have to see your twin.  When your family asks why, please them the truth.  Why you felt like you have never had a party and its always  been about your sister.  \n\nTell them that you feel invisible or that she is the family's favourite or however you feel.\n\nHopefully this birthday can be about making some boundaries with your family.  \n\nEnjoy the day!", "You're NTA for feeling upset. I understand feeling overshadowed by a sibling. It must be so much worse when you're a twin, but I understand where your mum is coming from too. She's not trying to hurt you, you're both her children and she wants to see her children on their birthday. Also, your sister is away studying far away ( I'm assuming, as she needs a plane to get home), your mum must miss her and wants to spend that special day with both of you. \nThat doesn't take away the hurt you feel and I'm sorry you won't get that special day to yourself. I'd suggest planning something with just your friends so that you still have something where you're the focus.", "NTA. Seeing as you don't have any friends, I wouldn't have changed plans last minute, and celebrate with you, if I were your parent. I hope you can at least boycott the party.", "Another vote for NTA for just wanting a special day to yourself. Think of your own special day what you like best and make it that! But your parents aren't punishing you by wanting to spend your birthday with the both of you.", "I was gonna say N.A.H, but it's YTA for me. I can understand your point, but you're 21. If you want a birthday for yourself then go out and celebrate with your friends. If your family is pressuring you to attend the joint birthday then they'll be the AHs but you can totally decline their request.", "OP. What is it you like to do?  Hobbies? Likes? Dislikes?  Throw yourself into those things and find your tribe. I was in a similar situation. Took me years to find myself. But I did, and you can too.", "NTA Your feelings are what they are. But it’s also your sister’s birthday and she should be able to celebrate in a way that she’ll enjoy.\n\nIt seems like you blame your sister for being different than you. Her outgoing nature annoys you and your autism probably causes you to experience her personality traits in an amplified way. Keep in mind, this isn’t her fault. If you’d like to be accepted as you are, you should learn to accept others as they are. \n\nYou can graciously excuse yourself from activities that you find overstimulating and plan a separate birthday celebration that’s more to your liking. No need to get hung up on it occurring on your actual birthday. What’s important is that you’re celebrated, not which day it happens.", "YTA. And quite clearly jealous.", "YTA. You say you don’t have friends of your own, that’s hardly your sisters fault. Not trying to be rude but it’s just not. It’s ridiculous to hold that against her. Maybe, instead of being worried about “her overshadowing you”, just go out with her and maybe you’ll make some friends of your own.", "Can you go out to do things you like that day. Ignore her maybe get noise canceling headphones", "I’m going to go against the grain and say NTA but if you push this you absolutely will be. Your parents want to celebrate you both. Could you ask to do two separate  things for you guys? Also everyone saying your the asshole and to go out with your own friends can fuck off cause clearly they do not know what it is like to not have friends", "NTA - from everything you've said, it's understandable that you're upset and that doesn't make you the AH. \n\nI don't think your twin is the AH in this specific scenario either (although it sounds like she's been one in the past) - she can come home for her birthday if she wants, and maybe she doesn't know you feel this way. \n\nYour dad is an AH though for extending the offer when he knew you felt that way, and when your twin already had plans. \n\nNow that she's coming, maybe you can ask your mom if you could all have a discussion about boundaries, explaining how you feel because of your twins behaviour in the past? \n\nOr alternatively go out and do things you enjoy, you're not obligated to spend it with your twin even if she's back home. Hope you have a good birthday in spite of it all!", "YTA\n\nYou say that it always felt like every birthday was about her and that you got pushed to the sidelines.\n \nAnd then in the edit you add that you have no friends? Well, I'm sorry, but maybe you are not a very nice person. \nBeing autistic does make it harder to make friends, but most autistic people do manage to make some friends and maintain those relationships. \nIf you had parties together (me and my twin mostly did) and you both got to invite friends, but you did not have any friends or invite any friends, then off course the party is going to centre around your sister. \n\n\nHaving to compromise on the birthday dinner and cake flavour can suck if it always ends up with you not getting something you like, but then it's not a compromise. Me and my sister understood that neither of us would get out favourite meal, but we always managed to figure something out that we both liked. \nAnd we are also very different people. Think of a hyperactive nerdy fun loving tomboy for me and a horse crazy serious studious girl for my sister. We do not like the same type of food and have very different friends. But we still always found a way to have a nice birthday together. \nWe do however truly like, love and respect each other and it doesn't sound like you like your sister. It sounds like you resent her for being who she is. She can't help who she is and neither can you. I think it's time to get some therapy and figure out why you think your sister overshadows you. Why you feel that she needs to not be herself so you can bed moet comfortabel?", "I am so sorry this is your situation.  It is difficult to share the spotlight when someone else has had it your whole lives.  You can't control what other people do, but you can control yourself and how you respond to situations.\n\nBe your own cheerleader.  Don't depend on your parents or your twin for validation.  Participate only as much as you want to in the birthday situation with your family.  When things start to become difficult for you at the party, you can leave the situation and go to your room, and celebrate with your online friends.  Or by yourself even.  Treat yourself with some new make-up, or book, watch a movie while eating cake and ice cream, whatever you like.  Happy 21st to you, OP.  Best wishes.\n\nNTA.", "NTA.\n\n>its her 21st and I should be more understanding\n\nIt's your 21st and they should be more understanding.", "YTA!  You know what’s worse than spending your birthday with your twin? When you lose your twin and can’t spend the day with her.  I lost my twin 4 years ago and would do anything to spend the day with her.  One of our favorite days of the year has become unbearable for me, I dread it.  We also didn’t always see eye to eye, had completely different personalities.  We personally saw that as an advantage.  I can’t imagine my parents having to pick between seeing her or I.", "NAH\n\nCan’t your family have two celebrations? One for her and one for you, different plans you each choose, and possibly different days.", "nta - your feelings are valid and since what is done is done make it a point to plan something just for you!  something like a spa day or outing with a friend.  you dont have to go to the party your a legal adult and can make your own decisions.", "NTA. Go celibrate with your friends somewhere else.", "ESH. \n\nEveryone is at fault for part of this. Your mom got your hopes up that your birthday would be just you,  then they changed plans and are now dismissing and minimizing your feelings. That sucks. Changing plans can be massively upsetting to golks in the spectrum. But your sister is a daughter to them so i get that,  too. Listen, I totally get not wanting to share a major birthday with someone who steals the spotlight and makes you feel uncomfortable. All around everyone carries some responsibility about how this is turned shitty.\n\nThat said you'll have to deal with it\n Maybe you can explain you feel overshadowed by your sister and would like to celebrate your birthdays individually. One day for you. One day for her. Though it's unlikely they will it would give you both the chance to feel like you have \"your\" special day and also focus on the others special day. Then actually celebrate your sis on her day.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (20F) am turning 21 in a bit over a week, my twin (20F) lives in a different state for uni, she's much more extroverted and social then I am. I struggle with her as she's always overshadowed me in everything, and all of our birthdays have felt like it was a party for her and I was tacked on as an afterthought. She feels a constant need to push my boundaries and force herself in everything. I'm autistic and hate this, she's loud, she complains, she's demands everything to be done her way and its awful, especially around birthdays. She's also said and done awful things to me which she refuses to even acknowledge or apologise for.\n\nThis year, my mum said she was going to stay in uni for her birthday and celebrate with her friends. I was so happy, for the first time in my life, at 21 years, I was finally getting a birthday to myself.\n\nUntil today, when my dad decided she should come up because she would be upset that she was spending her 21st away from family. My mum started organising a plane trip for her and I just felt betrayed and hurt. She knew how happy I was to have a birthday to myself, and she's bringing my twin up anyways, even though she said she wasn't. \n\nI brought it up to my mum how it felt like a slap in the face and she told me that its her 21st and I should be more understanding but I'm just angry because she's ruined every birthday for me and made me feel miserable every time and I finally thought I'd have a birthday that didn't end in me crying in my room, but nope. Same old shit as usual. Mum got annoyed that I was telling her to \"ignore\" my twin but she already had a party/get-together type thing planned with her friends so it wasn't like she was going to be alone.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Must be American to celebrate 21st birthday.. ESH. Sounds very childish, everyone's behaviour, including your parent's. Here in my country usually people stop celebrating annual birthdays at 12. Then celebrate 18 when adult, then round years, 20,30,40 etc.. if even those. Sounds very immature to cry about the birthday as an adult.", "NAH. Your parents have two children celebrating birthdays and it’s natural for them to want to spend the day with both of you. Your relationship with your sister has held you back but now that you’re an adult it’s time to stop blaming others and get on with life. She may be the AH in all this but you and your parents aren’t. Talk to your parents about having separate celebrations. Spend the day doing things you like. I spent my 40th birthday by myself. I ate my favourite food, watched a season premiere of one of my favourite shows and went to a book signing of a favourite author and bought myself some presents. Carpe diem.", "Stay in your room until you feel comfortable. If it's all night so be it. You too are making choices. This is your day. You can choose to be happy/kind even in the most stressful of times. Choose kindness. You have zero control over others behavior. You do have control over yours. You best know your triggers. Take your space as you need.\nGood luck.\n Families are something. Bunch of people thrown together by genetics.", "YTA - you sound very selfish and entitled. You have a twin (like me) and so for your parents it will always be both of you who are important on this day. Of course they want to celebrate with both. And instead of working on your problems - your solution is to feel entitled to a single birthday. Grow a spine and articulate your wishes for the birthday. Get out and make friends instead of complaining that you only have your family to celebrate. You could be the solution to your problems.", "You're assuming a lot about what OP likes and is comfortable with.", "Why are you assuming she has any friends? If I were her, I wouldn't celebrate any of my birthdays.", "Sounds like she doesn't have any, which means her choices are to do the family one or be by herself.  No, that doesn't mean I think she should be able to uninvite her sister from the family thrown bday party.", "But do we even know if sister wants to spend the day with *them*? \n\nIt's her 21st. A lot of people (most, I'd say) have very NSFParents 21st birthdays.\n\nShe has plans to celebrate with her friends, so why would her dad assume his desire to have her home should trump what *she* wants to do?\n\nAt no point in the post does OP even mention what sister wants. I don't think she or her parents even care.\n\nWatch this space for the \"AITA for spending my 21st birthday with friends even though my parents bought me a plane ticket to see them?\" post.", "For REAL. OP, go to a hotel that has a spa, get a massage, mani/pedi, order room service, binge watch your favorite movies. You sound like an introvert which is COMPLETELY ok (I am absolutely a confirmed introvert) so start planning birthday activities you enjoy for yourself.", "So their dad can’t ask his own daughter about coming home? Why does OP get precedence over his other daughter when it’s both their birthdays?", "Going out with friends doesn’t have to mean bar hopping. Could be movies and snacks at a friends out. That’s still going out. OP would have left her house.", "how? all they said was to go out & celebrate by themselves (or with friends) they aren’t telling OP *how* to celebrate… just to celebrate.", "Well, she's going to have to plan something, even if it's just by herself in a park somewhere.", "People aren’t comfortable with friends?? What are you trying to imply here?", "She doesn't have any friends.  However, the rest of it is on point.", "Most people have friends. Even introverts. It would be an exception if she didn’t have friends. Therefore it’s reasonable to assume she has friends rather than the opposite.", "Well if the college sister had plans and expressed she was happy, and the twin at home was happy, and everyone was happy a mild AH. Because if he insisted she come home then it's just creating a complicated dynamic. But if the college sis was sad that she couldn't come home, or had no plans, then that would be more understandable imo.", "I'm just saying, in my experience being autistic and friendless on my birthday, organizing anything takes way more effort than it's worth and often just serves to remind you that socializing is way harder than it needs to be. \n\nOP, I do think someday you will have friends and birthdays that do not involve your sister. It is hard to get there, but very possible.", "Except she specifically says she doesn’t have any.", "This is his CHILD. Just because the one at home isn't happy with the one at Uni coming home doesn't mean it was wrong of him to tell his CHILD to come back to her HOME for her birthday.\n\nOP, YTA. I understood your relationship with your sister isn't what you want it to be, but you're 21 now. I'm saying this as a fellow neurodivergent person, it's time to put on your big-girl pants and make due with the situation. Either have a conversation with your sister and try to come to a civil conclusion together or just do your own thing for your birthday.", "I mean, clearly the college sister couldn't have been all that happy as she did decide to come home but even if she was, it's not wrong of the dad to ask about her coming home. Parents generally like to spend their kids' birthdays with them, even when their kids are adults.", "As an edit. Perhaps the comment was posted before the edit."]}