{"id": 14956, "submission_id": "12ogrzb", "title": "AITA for not inviting my ex wife on my family trip this time after what happened last time?", "selftext": "My (50M) ex (51F) and I were together for 10 years before we got divorced when our daughter (5F) was a year old. we had what i would say was a fairly amicable divorce and stayed very close after. for many reasons i became our daughter’s primary parent but we do share custody. \n\nfor 3 years we’ve gone on vacations together, usually cruises or all inclusives. it’s been fun. it’s been fun for us to spend time together and fun for our daughter to have both of her parents together. \n\nlast year though, i refer to in my head as “the incident”. the whole trip. we went on a 10 day cruise and she was drunk the whole time. there were several incidents of her behaving extremely poorly. on one excursion she got so drunk i had to carry her back onto the ship. it was basically having acquired a second, drunk, child. this was stressful and on numerous occasions really upset or scared our daughter. \n\nthis year, i booked a disney cruise. and i explained to my daughter that it was just going to be her and i this time. i told her we would do a different preferred activity with mommy a couple of times this summer. she was happy. \n\nnext part was telling my ex. i initially said (direct copy/paste) “hey [redacted]! so this year i decided to do something a little different for vacation with [redacted jr]. i will be taking her on a cruise from [x-y] just the two of us, but I thought that it would be fun to do a few beach weekends and maybe a Universal trip this summer.” \n\nwhen she got upset and demanded to know why I would do this, so I told her her behavior on the last trip (which she did know I/our daughter had been upset about) had made me not want to invite her this time. \n\nshe said I was being an asshole for not inviting her and for being uptight about fun on vacation that hadn’t hurt anyone, and I should give her another chance. \n\nSo, AITA?", "created_utc": 1681663564, "permalink": "/r/AmItheAsshole/comments/12ogrzb/aita_for_not_inviting_my_ex_wife_on_my_family/", "score": 616, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) i did not invite my ex wife on my family vacation due to her behavior on the last family vacation \n\n2) this may make me an asshole because she’s always come, and it may be true that she deserves another chance/there’s no guarantee she will act like this again.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - she seems unable or unwilling to accept responsibility for her actions (calling you \"uptight\" and saying she \"hadn't hurt anyone\". Maybe tell her her next chance can be the beach weekends where she can show that she can act like an adult/mom in front of her daughter.", "Nta. Her behavior scared her small child. That is not “not hurting anyone”.", "When you go to the beach or to Universal, you *are* “giving her a second chance”. But a trip to the beach or an amusement park may be cut short if your ex decides to act up. On a boat-well, you are kinda stuck for the duration. Yay :( \n\nNTA", "NTA\n\nFamily vacations are supposed to be about shared experiences, not getting shitfaced in front of a small child.", "NTA - you’re doing the right thing. Your child shouldn’t see that from her mother.", "NTA.\n\nPlus you ARE giving her another chance, just not with the cruise.", "Definitely NTA, you should be able to enjoy your vacation with your daughter without taking care of your ex as well. She's a fully grown up adult and is responsible for her own actions. She's not your responsibility.", "NTA \n\nWhat she calls fun on vacation is her behaving like a drunken sot the whole time, upsetting your daughter, and becoming a burden.  Given that, it's a sure bet that she'll repeat the performance.", "NTA\n\nIf she thinks you're being uptight about her being drunk in front of her child, I'd be wondering what she gets up to during her custody time.", "NTA   You should tell her that the beach weekends ARE her second chance.  You have been fair and honest, while prioritizing the needs of your child.  For the sake of your daughter, I hope that your ex has wised up and that you'll be able to go back to the situation that sounds as though it was very good for your child.", "NTA. Her actions were harmful to you and your daughter. You made the right decision, considering she can’t recognize her own fault. Good job protecting your daughter, and enjoy the Disney cruise!", "NTA. Getting drunk around your kid is FUN? Your ex has been given the reality check she deserves.", "NTA\n\nExcept it did hurt both of you. Her idea of fun is really not appropriate for a family vacation.", "NTA \n\nHer \"second chance\" is seeing how she behaves on the weekend trips.", "Hadn't hurt anyone?? She's delusional if she thinks terrifying her own daughter due to her drunken antics isnt hurting anyone. NTA. Even more so bc it's a disney cruise. Imagine she pulls that shit again, and idk, you guys end up banned from the cruises??", "NTA is she an alacholic or one of those people that thinks they have to drink when they're going out", "NTA\n\nShe was an AH for drinking to excess on the last vacation. \n\nYou might ask if she's done anything to get and stay sober. If she hasn't, it's a big NO.", "NTA. Not accepting accountability I’d never take her on vacation.", "Nta me and my ex share two kids. We go on trips up north together and it's usually with other people as well. We just act like friends but still a team. Neither one of us drinks excessively", "Nta - doesn't sound like ex wife accepts responsibility for her alcoholism.", "NTA. She did hurt someone. Her daughter and you.", "INFO Who pays? Do you pay for everything or does the ex pay for herself?", "NTA - She’s an ex for a reason. It’s not your job to take her on vacations. She’s perfectly free to take herself on one. You aren’t doing yourself, your daughter, or her a favor by enabling that behavior. If it’s hard for you to imagine not taking her on vacation or dealing with her anger then please get a therapist.", "NTA", "NTA, although did you talk to her about the incident in the past year? If it had been talked about after last year's trip and she expressed remorse, then I'd be tempted to give her one more chance, assuming she promised to not drink on this trip. \n\nBut that's just me. \n\nRegardless, since it's your money and you are divorced, you are definitely NTA for doing this trip with just your daughter.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (50M) ex (51F) and I were together for 10 years before we got divorced when our daughter (5F) was a year old. we had what i would say was a fairly amicable divorce and stayed very close after. for many reasons i became our daughter’s primary parent but we do share custody. \n\nfor 3 years we’ve gone on vacations together, usually cruises or all inclusives. it’s been fun. it’s been fun for us to spend time together and fun for our daughter to have both of her parents together. \n\nlast year though, i refer to in my head as “the incident”. the whole trip. we went on a 10 day cruise and she was drunk the whole time. there were several incidents of her behaving extremely poorly. on one excursion she got so drunk i had to carry her back onto the ship. it was basically having acquired a second, drunk, child. this was stressful and on numerous occasions really upset or scared our daughter. \n\nthis year, i booked a disney cruise. and i explained to my daughter that it was just going to be her and i this time. i told her we would do a different preferred activity with mommy a couple of times this summer. she was happy. \n\nnext part was telling my ex. i initially said (direct copy/paste) “hey [redacted]! so this year i decided to do something a little different for vacation with [redacted jr]. i will be taking her on a cruise from [x-y] just the two of us, but I thought that it would be fun to do a few beach weekends and maybe a Universal trip this summer.” \n\nwhen she got upset and demanded to know why I would do this, so I told her her behavior on the last trip (which she did know I/our daughter had been upset about) had made me not want to invite her this time. \n\nshe said I was being an asshole for not inviting her and for being uptight about fun on vacation that hadn’t hurt anyone, and I should give her another chance. \n\nSo, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.", "NTA, also, you don’t owe her anything and can cancel on her anytime (that is warranted of course). She is your EX-wife, meaning she no longer has the privileges a wife has.", "She was 50, on vacation with her four year old, and got so blotto drunk in port that she had to be carried back on board????? You did check her ID, right, and it said 50 and not 20?\n\nShe didn't go on that cruise to spend time with her daughter. Which means she's not there for the right reasons, and can go pay for her own cruise on her own time when her daughter isn't there to be upset that mommy's always sick and crabby.\n\nNTA", "NTA \"Had not hurt anyone\" just means it didn't hurt her. What a selfish way to look at things.", "NTA. Not at all", "NTA NTA NTA. You are under NO obligation to hold her hair or carry her back to the cabin for a second time. She’s completely neglecting the fact that she’s a parent while on this vacation- it’s not unreasonable that you would no longer want to sponsor or be party to that kind of activity for a second time.", "NTA \nHer behavior hurt her daughter.  If she’s unwilling to take any responsibility, unwilling to change anything? That’s that.", "I’m definitely going to use this language, thank you. \n\nIt can be a little hard because she does have a hard time being the responsible party. when we had our daughter (and we tried for years/had to do fertility treatments), I knew it was time to settle down. She’s a good mom but didn’t fully get the memo, you know??", "I can’t think about it. I choose to believe that she’s responsible and a good mom on her own time—the alternative is too stressful. \n\nI’m not puritanical about alcohol, either, I just feel there’s a degree of responsibility when you have a little kid.", "I wouldn’t characterize her as an alcoholic. she’s a person who likes to have fun and often alcohol is involved.", "i pay for everything!", "i did talk to her about it when/right after it happened. she knew we were upset by it, but it was sort of a “oh, haha, you’ll be okay” response. she was embarrassed only by how she acted on the one excursion.", "NTA, but if she \"didn't get the memo\" regarding being a parent that means she is in fact not a good mom. Please stop defending her poor decisions, her reaction to not being on this trip is that it her actions last time didn't hurt anyone but thats only because you were there to care for her. Should you not have been there to save her from herself and she had been injured do you truly believe she would suddenly be more responsible or would there just be more excuses and deflection?", "She's not a good Mum if she thinks getting that drunk while on holiday with her 5yr old daughter is ok.", "Not to be harsh but good moms don't get falling down drunk for 10 days while in a strange place with their child. She sounds like an alcoholic who is in desperate need of help", "Yeah just because your child has one responsible sober parent present, doesn't mean the other one can be shitfaced all day on holiday. My husband can push the line sometimes, it's not good when our kids would roll their eyes and say ooh dad's in the pub again.", "Honestly, it sounds like she has a binge drinking disorder, which can be a form of alcoholism.\n\nIf she was so drunk you had to carry her to the boat and she refers to it as “fun”, there’s really a deeper issue here.", "NTA So she is mad about missing a free cruise also, it seems like she doesn't feel like she did anything wrong and you are acting like a wet blanket.\n\nI wouldn't take her and if you do decide to take her on another cruise tell her that only if she doesn't get a drink pass and she has to pay for her own drinks.", "Maybe not paying for her this year will have her think more about the last trip and realize that actions have consequences!", "Also her actions did hurt someone, her daughter. The daughter was scared and upset by the mother’s actions, that’s enough reason not to bring her again. NTA", "NTA it DID hurt someone, her daughter", "With all due respect, it's time you accepted who your ex wife is...not who you wish her to be\n\nIt is very uncommon for the dad to get custody of a small child...so it's likely that there are reasons you don't want to talk about as to why the courts decided your ex was unfit to be the primary custodial parent.\n\nGiven the fact that she clearly has a problem with alcohol and put her own desires above that of her own child...then it's clear she is not a responsible person or a responsible parent.  So understand, you HAVE to stop making excuses for her.  Your daughter needs to see her mom for who she really is.\n\nYou are not preventing your child from having a relationship with her mom\n\nBut it's time you stopped making excuses and stated living in the real world.  Your ex likely has an alcohol problem or at the very least, prioritizes partying over everything else.  Which is a quality that will one day put your daughter in a dangerous situation when she is with her mother.\n\nYou are the only responsible parent your daughter has.  That means it is your job to protect her, even if that means protecting her from her own mother\n\nBecause the sooner your daughter see's her mom for who she really is, and learns to navigate the disappointment that comes from having a parent who is not who you wish them to be, the easier it will be for her to let go of the hope she has that one day...you will all be one big happy family again\n\nNTA", "INFO - are you paying for these trips? \n\nNTA- custody and coparenting is weird and you no responsibility to bring your ex on trips. But its cool that you do for your kids sake.  \n\nArmchair psychoanalysis is that your ex got drunk as she was feeling shame and guilt for breaking things up.", "nta- i have never seen my parents belligerently drunk. it's not that hard to keep that behavior away from kids - but u already know that", "NTA you are giving her another chance on a less expensive beach weekend & Universal. You should be able to take your child on vacation without you ex.", "NTA\nINow, your ex will have time to party while you and daughter are the cruise. Just she won't be partying on the cruise ship. I\n\n'm an alcoholic in recovery. I drank heavily during my oldest son's early life. It's been 20+ years. We're still undoing the damage and healing our relationship.", "NTA, Exes are exes for a reason.", "NTA. She's an adult and can get as drunk as she likes, but not in front of her kid on what is meant to be a family themed vacation. That's just trashy and irresponsible. And possibly traumatizing for a child.", "NTA.", "It \"didn't hurt anyone\" because you happened to be there to play babysitter to a grown adult. You're signed up for a family vacation with a young kid, you did not sign up for babysitter a drunk adult who was supposed to be spending family time with a small kid. The entire point of the trip was for the kid to spend time with both parents together. NTA.", "NTA\n\n&#x200B;\n\nYOu are Exes. It is COMPLETELY NORMAL not to have vacations together.", "NTA.", "it didn’t not hurt anyone—it hurt you and your daughter \n\nnta", "NTA.  Make it clear to the drunk that actions have consequences, and that if you ever see her drunk around your kid again, you'll be back in court to amend your custody arrangement.", "NTA ok so do you pay for the trips?? And if so then I think she’s more upset about losing a free trip. My ex-sis-in-law was like that. This is her chance to spend time with her daughter and make memories and instead she’s creating nightmares for her. Good idea about the beach thing.", "NTA, her behavior shows that she cannot be a safe and appropriate parent when on a cruise.   Your daughter deserves a cruise without having her drunk mother make selfish embarrassing choices.", "Quick question: Are you the one paying the total cost of these trips? If so maybe she is just upset to be missing out on a paid vacation. And if you are ‘footing the bill’ you have every right to decide who goes", "NTA", "NTA.  The fact that you were doing joint vacation in the first place was extremely generous.\n\nIt's good to separate more, and get your daughter used to the idea that mom and dad are not together and it's okay; she still gets time with both of you.", "NTA\n\nAfter her behavior, I don’t blame you at all.", "NTA\n\nNo one wants to babysit a drunk on their own actual vacation, nevermind with a child to care for", "NTA - Babysitting her is officially no longer your job. Its excellent you two are so amiable, but \"family\" vacations is probably unsustainable. Time for mom to party elsewhere.", "Nope. NTA. In fact, I think you are being very generous in your alternatives. Your kid is getting older. Maybe you will become part of couple- time to wind this down.", "Same", "this is making me a little emotional… but i really needed to read it. thanks. a lot to think about, but I needed it.", "i do pay for the trips, no reason other than i think it’s a nice thing to do.", "Honestly, it’s worth considering if these family trips may be setting you up for future failure. I’m not saying they are, but it’s a possibility. What happens when one of you get a new partner and want to incorporate them? How does daughter react? Is this creating unrealistic expectations by your daughter about your ex’s place in your life? \n\nIf you think ex will continue and be happy to share these trips with your future partner then cool, it would be awesome to have a shared blended family. If you think she’d react badly, you’re setting up daughter to resent future partner. \n\nI think the cruise w/o ex is smart, for many reasons.", "Yeah, sorry but a family vacation with a young child is mostly about the child: this goes triply for a divorced couple going together. \n\nThe only reason you’re going on vacation together is to give the daughter a family trip. This is not the time for her to be boozing it up and partying. \n\nIf she wants to do that then she needs to schedule her own wild vacation to go and live her best life and let op and the daughter have their actual family vacation.\n\nNTA- it’s sad that she can’t put aside her own desires to give her daughter happy memories of her childhood but if she’s not willing to then she needs to just bow out of the vacations.\n\nArguing that her actions didn’t hurt anyone? Getting wasted and scaring your child is damaging.", "Safe and appropriate parents do safe and appropriate things around their kids.  \n\nIt’s nice of you to keep inviting her on trips to keep the bond going for your kid, but also very smart to place limits.", "FFS she is 51! She should know how to behave and put her daughter over her fun on vacation", "You might revisit the custody agreement if she is having issues with alcohol until she has a handle on her drinking.\nNTA", "Is her alcohol use one of the reasons why you have full custody?", "I’m gonna be honest I think as her dad you should think about it. Make sure that nothing bad is happening and if it is start documenting and contact your lawyer because if that behavior is around your daughter when she’s at her moms you need to get her out of there.", "OP, based on your description of her behavior in your post, it sounds like you're doing some minimizing and damage control right here.\n\nDid you sit down with her when you three returned from the trip and talk to her about just how bad things were from your point of view, and also from your daughter's? If not, it's time to do that now. Because your ex has clearly not received the message that she needs to shape up.\n\nWhen you start making plans with her for this summer, you may want to let her know that her behavior on the first beach weekend will determine whether or not there will be additional weekends together.", "You’re a great dad.  I think it’s time to stop doing trips together.  You guys aren’t together anymore and continuing these trips could end up being confusing and harmful for your daughter.  Nta", "Yeah so you can whatever you want. You seem like a good egg. Good luck", "Most parents I know save the falling down drunk times (if they must have them), for after the child has gone to bed.\n\nHerding a drunk while on vacation sounds like the antithesis of a fun time away.\n\nOP - go have fun! NTA", "On a cruise the drink passes are really expensive, in my personal opinion, from watching people I was on a cruise with it made them drink more \"to get their moneys worth\".\n\nHe spent the entire cruise drunk af. The last two cruises he didn't get the pass and drank normally.\n\nEdit to take out person's identity", "Her actions hurt OP too, he was unable to share quality time with his daughter on vacation and was put under the stress of caring for an adult who chose to become intoxicated to incapacitation and having to sooth his scared and upset daughter.\n\nShe also caused financial harm to OP, he spent money for an experience that he didn't get to enjoy solely due to her actions.\n\nIt's also doubtful daughter has got over this, it's a big shift to a kid's reality that a parent isn't a person they're safe to be with. Imagine how she feels under her mom's custody time when she has to rely on her unreliable mom?", "NTA. After my dad died,when I was 13,my mom would get drunk EVERY single day. She was a heavy drinker on weekends with dad but managed to keep it together on weekdays. On days she didn't work she was too drunk to recognize me when I came home from school. She also ,according to her, \"wasn't hurting anyone\" Except me-she just didn't see it. Protect your little girl from her mom,please. Take video to show to a judge,if you have to, to show she should never be alone with the responsibility of your daughter.", "YTA", "NTA. it's fucking weird going on a family vacation with your ex husband/wife. The past incident is another reason why it's a bad idea. What will happen you find a girlfriend will you still go on vacation with your ex wife.", "NTA I had my mother do this. She thought it would be funny while drunk to scare us and ended up falling off a cliff she luckily landed on a ledge about 6ft down and had to climb back up then blamed us for it hours later when she managed get back cut to all hell. I think I was 5", "NTA. Getting sloppy drunk repeatedly, and then refusing to own the consequences, are not the hallmarks of a responsible parent.", "NTA op you are too nice stop footing the bill for ex I’m aware you’re trying to make memories with your young child of you all as a family but you are no longer a family. You are only confusing your child and honestly (I maybe wrong) she/he will have boundary issues when she gets older because she’s watching you doing the same. Protect your daughter, not saying keep your child away from her but be more careful about what you are including this woman in.. school related things,sure. Vacations nope.. I hope you figure things out and good luck", "I hated seeing my mom n step-dad wasted, that crap effects you, especially if your parent decides going out to get drunk n \"swing\" was more important then spending time with the kid you only see mostly on weekends, sge needs to know her behavior might seem like nothing to her but can be very detrimental for her kid. NTA", "NTA", "NTA.\n\nHer behavior DID hurt someone - your daughter.", "But her \"fun\" on vacation did hurt someone. It hurt you who had to carry her back to the ship at one point and your daughter. How embarrassing. \n\nNTA. She brought this on herself.", "NTA. Protect your daughter. See her mother falling down drunk is not good for a child. You are extremely generous to invite your ex to anything.", "NTA. \n\nVacations are supposed to be relaxing, and when you invited your ex I'm sure the expectation was that the vacation was supposed to be for you both to enjoy time WITH YOUR DAUGHTER (I mean, why else would you invite your ex). You weren't relaxing or spending quality vacation time with your daughter if you were taking care of an adult that chose to drink to the point of irresponsibility. She's lucky you're offering anything at this point.", "NTA. \nFun that didn't hurt anyone? She hurt her child by frightening her. It's terrifying to see an adult that drunk when you're small, and for her to dismiss that under the guise of \"No harm no foul\" is disingenuous. \n\nThe vacations were a courtesy. She couldn't behave, so now that courtesy has ended. That's a natural consequence of AH behaviour.", "NTA.  Her \"fun\" did hurt people, specifically you and your daughter since she ruined the vacation being drunk off her ass.  She knows it and she knew exactly why she wasn't invited when she demanded to know why.\n\n\nBy the by, has your ex ever been like this before or was her getting absolutely plastered for 10 days a new thing?  Is it possible she's developed a problem with alcohol?  That would explain both the binging and her minimizing the results by saying it didn't hurt anyone (even though she knows it did).", "NTA. She knows perfectly well that it hurt both of you. Saying she didn't hurt anyone is negligent at best, and an outright lie at worst.", "NTA.  You don't have to vacation with your ex.", "NTA\n\nA 51 yr old getting drunk around her 5 yr old child, 98% has a drinking problem.", "NTA\n\nI think you're underreacting. \n\nThink back to when you were around your daughters age. You probably remember the scarier events more clearly than others.\n\nYour daughter is a memory sponge. She's 100% going to remember some variation of her mother being drunk. It's possibly engraved in her mind because it was one of the scariest events of her life.\n\nYou only have your ex wife's word that she won't do this again. Are you present enough in her life to know if she does or doesn't have a drinking problem?\n\nThink of what would've happened if you weren't on the hike and it was just your ex wife and child. Think of what might happen if you let your daughter go on a trip alone with your ex wife. Your daughter will be on a ship in the middle of the ocean. She may be able to call you, but you will not have any access to her if something goes wrong. If you're not 200% sure about your daughter being safe with a definite yes, then don't allow the trip.", "Nta. I don't vacation with unstable alcoholics.", "NTA, not at all", "nta", "NTA.  Sorry, if she got so drunk she needed to be carried back to the ship, there is a bigger problem you may not know about.  But I would hold out an olive branch - she gets into counseling to figure out why she wanted to get loaded on a vacation with her daughter and when she can share the answer, you will reconsider inviting her next time.  Meanwhile, day trips only so you can get the kiddo away when she starts drinking.", "NTA. It did hurt someone. It wasn't harmless fun. It ruined your vacation and your fun as well as harming your daughter's opinion of her mom.", "NTA. As long as your daughter is happy, you’re most likely making the right choice.", "NTA. Her idea of \"fun\" seems a little off.", "NTA, you've got it right. It's a trip, not a vacation. You don't get to stop being a parent just because \"vacation\" the adults responsible for a child still have to be responsible for themselves and the well-being of child. Kinda seems like in her mind having you there meant it's a vacation for her, making you responsible for both child and her even though you're divorced.", "Mom of 2 here who loves going and having adult fun... never once have my kids seen me drunk... NTA for not wanting to put up with that at all she should have behaved better on a family outing", "NTA you’re not obligated to invite her. If she wants to act like an ass, she can do it on her own dime.", "NTA, you are not obliged to invite the drunk, if she wants to be inappropriate and annoying it is better that she go to a bar to get drunk", "NTA \nExes going on vacation together is weird anyway and confusing for a kid.", "Technically NTA because your question was about inviting your ex on the trip, but honestly I do think YTA for letting your daughter remain in the custody of someone whose sobriety you can't trust.", "NTA. I never understood this behaviour of having to like, hang out with, or be around your ex. They are exes for a reason.", "yeah what a way to set a good example for your 5 year old daughter. getting absolutely shitfaced", "Or she got drunk because she is a drunk which is why he got primary custody.", "can you elaborate?", "NTA. It's not her decision who was or was not hurt by her actions. That's not how this works. She has some sort of problem, and needs to demonstrate awareness of the problem(s) before putting her back in a situation that triggered her problem(s).", "When she says she “didn’t hurt anyone” she is discrediting the fact that she did actually hurt someone. She hurt you and your daughter.", "But she did hurt someone! Your daughter was upset at seeing her mother incapacitated because of alcohol! I like the idea of smaller trial run excursions and if everything goes right then maybe next year she can be included again. NTA", "I’m a few years younger than your wife. I like to party, but I also know that parenting and drinking doesn’t mix well. Even if it’s just a couple of glasses of wine in the afternoon. Alcohol makes us miss the small signals coming from children, and they need our help learning to navigate in this world. \nSo I can go weeks or months between drinking, and only does when I’m not with my kids.", "Does she have an alcohol problem in general?", "You *have* to think about it. You can't stick your head in the sand. Your daughter cannot protect herself emotionally and physically. You are the only one who can. If your ex is drinking like this in front of you, I'd bet she's doing worse when you're not around.", "It's your job to think about it. Protecting your child is your job. Literally no one else *can* protect her if her mother is failing her, don't you fail her too. She will remember that forever.", "I'm going to come into this with a really honest and hard to talk about thing. Because I think you need to hear it. \n\nWhen I hit my preteens, my dad became a not real cool dude, fast. (anger, emotional manipulation, guilt, NO SA just to clarify). My folks had been divorced since I was a toddler. My mom sympathized, but didn't help me. It was in MY very young hands to navigate. And it fucked me up for a long long time, including the emotional abuse and self hatred I gained, without an adult, my other parent, to step in and tell me it wasn't my fault, and that all those things told to me weren't true. \nHonestly, I think she just didn't want to believe it was that bad, and I understand that now (I'm a parent now too). But the thing is, she NEEDED to face the truth, for my benefit. \nYou do too. Maybe that's not what's happening right now, maybe your ex can usually control her shit for her visitation times. But maybe not. Or maybe not in the future, and you have to be able to keep your eyes open and watch out for it, so if it does come, you can step in and be the adult your daughter needs, WHEN she needs it.  \n\nYou're being a GREAT dad, just reading this I can see it. And I'm telling you all this so you can continue to be one.\nBest of luck", "Like by all means get shit faced. Just not infront of your child who will just maybe remember her dad having to carry her mom bc she was so out of it drunk. Be a god damn responsible adult", "Except that she can't stop having \"fun\" even when with her five year old. That is some kind of drinking problem.", "That too", "NTA, but in the future, the nice thing to do is to not inform your ex about trips she won't be taking. You could have just as easily--and truthfully-- said \"this year, instead of doing a big family vacation, we're just going to do some beach weekends.\" \n\nYou can also, in the future, do a few \"surprise\" vacations with you and your daughter where she doesn't know that you're going anywhere until the night before, or even the day of! \n\nUnless there's a clause against this in your divorce agreement, give this some thought, and best of luck to you.", "No real big reason, I just agree with your ex about having fun on vacations.", "it's probably the reason why they got divorced and why he got primary custody", "[removed]", "Thank you. This whole thread has been a big perspective shift for me I really needed.", "I’m so sorry you went through this. I don’t want my child to ever feel this way—EVER. i want her to know i’m always in her corner and on her side no matter what.", "I do have to inform her about trips outside of the country with a certain amount of notice, but I could in the future just provide her with that notice.", "at the expense of others?", "I have a 10 year old nephew that gets really really upset being around people who are drinking bc his dad gets drunk and unpredictable. \nWhat Mom did, getting so wasted she was belligerent or couldn’t walk with her child there to witness, is child abuse. \n\nAlso, divorce means you don’t have to clean up after your lush ex-spouse anymore. \n\nInsulate the child when possible, sure, but you don’t have to take them on vacation with you where you know they’ll act like a fool and make you be responsible for them.", "/u/Round_Branch9208 is a bot that stole part of OP's comment here and changed words around to avoid detection: /r/AmItheAsshole/comments/12ogrzb/aita_for_not_inviting_my_ex_wife_on_my_family/jgi7qc3/", "I think you’re a wonderful dad, trying to create happy family memories for you very young daughter.  I have huge respect.  But, a mom that can’t stay sober to create those memories for that same child, causes the child fear & insecurities, & then brushes it off as not a big deal, is not a good mom.  It’s very generous of you to be willing to do a couple of day/weekend trips with the ex, giving her an opportunity to earn back trust, but go on your vacation with your daughter with no regrets.  You’re doing the right thing.  Also, think long & hard about what situation your 5 year old is in when doing visitation with mom alone.  It’s not a little thing.  5 year olds are not capable of caring for themselves, let alone an incapacitated adult, nor should they need to.  NTA", "Ah, and I guess  \"out of the country\" would include this cruise. Got it! And that makes sense,  both ways. (Hopefully as the custodial parent, you have sole possession of your child's passport)"]}