{"id": 14996, "submission_id": "12ozxsm", "title": "AITA for not wanting to spilt bills for food i didnt eat", "selftext": "I went out with my friends today to play some hoops. One of them brought her boyfriend They begged me to stay for dinner so we went to a fancy restaurant. \n\nWe ordered our food and while ordering, the two guys ordered some apps and drinks for themselves, letting us know we can eat some if we like. Upfront before ordering I said I ate alot already so I wont be eatting the apps and just be eating my meal. And I didnt eat or drink any apps but the other 3 did. The ordered alot too so it added up.\n\nI had to leave early (my other friends were still eating) so once I was done I asked for my seperate bill. The waitress asked if the apps are included. Before I could answer my friends boyfriend (who is  her boyfriend of 2 months and this was our second time meeting him) said yes for me. I was annoyed and before I could say anything the waitress took off. He knew I was annoyed cause he looked at me and said thank you, you are a real star. I was like wth. I looked at my two friends and they didnt say anything.\n\nI excused myself to take a phone call. After speaking with my sister, I just went to the waitress (seperately and away from my friends) and told her theres a mistake. I didnt eat the apps and to just give me my seperate bill.\n\nI returned to my table and the lady gave my bill face down. This girls boyfriend asks \"does her bill include apps?\" Bless the waitress, she just said its her bill. I paid and tipped the waitress extra and left. But I been feeling uncomfortable about this whole thing.\n\n\nEdit: Thanks to everyone who took the time to message. I wish I had enough coins for your posts. I didnt want to lose my friends over a few dollars but I think from reading the comments its clear if they dont respect my boundaries I will just avoid that kind of setting or stop hanging out with those type of people. Peace! 😊\n\nTL;DR friends ordered a bunch of apps when I said I was only gonna eat mine and expected me to pay for it.", "created_utc": 1681701396, "permalink": "/r/AmItheAsshole/comments/12ozxsm/aita_for_not_wanting_to_spilt_bills_for_food_i/", "score": 39, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for going to the waitress seperately? I should have spoken up but it felt like my friends bf already decided I should pay. I would have paid had I not already told them upfront I wasnt gonna eat, my own budget, ans how expensive their apps were.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "\"Does her bill include the apps?\" WTH??. No, you are NTA but they were trying to take advantage of you. Not cool.", "NTA - if you didn't have any of their apps why should you have to pay for their bfs food, especially when they begged you stay/come for dinner and answered for you!  1000% NTA", "I had someone do this recently to my wife. I make a lot of money so they just expected her to pay for everything because her husband does well. She wanted to split the check so they called her selfish and broke off the relationship. The sad part is this is family. You’re definitely not the asshole for setting boundaries and then enforcing them.", "NTA. That dude was trying to make you pay for his food? What the hell? That's absurd. And the people who stayed quiet need to be put in their place too. This is a ridiculous situation.", "NTA. You paid your share.", "NTA. You made it clear that you weren't going to eat any apps. Hopefully now it's clear you won't be taken advantage of either.", "NTA. You handled it the best you could. You did not let them walk all over you. All it takes is one experience like this to keep you from going out with people you don’t already know and trust. I call people like this mini-predators. They’ll take advantage of anyone they can, pretending to be friends.", "NTA. Next time tell the waitress before you order that you want a separate check. These people are users to try sticking you with the bill for the apps", "NTA. What a snake he was, trying to get you to pay for their apps. Good for you and the server making things right.", "NTA - you need better friends.", "NTA.", "Ya NTA you made it clear you weren’t eating apps if they wanted them and offered that implies they are paying and offering them as a kind gesture not that you were supposed to pay… if I got apps for a table and said hey eat what you want I got them and expected to pay any offers of payment would be appreciated but I wouldn’t even accept if I ordered them even if it was for everyone to share…", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI went out with my friends today to play some hoops. One of them brought her boyfriend They begged me to stay for dinner so we went to a fancy restaurant. \n\nWe ordered our food and while ordering, the two guys ordered some apps and drinks for themselves, letting us know we can eat some if we like. Upfront before ordering I said I ate alot already so I wont be eatting the apps and just be eating my meal. And I didnt eat or drink any apps but the other 3 did. The ordered alot too so it added up.\n\nI had to leave early so once I was done I asked for my seperate bill. The waitress asled if the apps are included. Before I could answer my friends boyfriend (who is  her boyfriend of 2 months and this was our second time meeting him) said yes for me. I was annoyed and before I could say anything the waitress took off. He knew I was annoyed cause he looked at me and said thank you, you are a real star. I was like wth. I looked at my two friends and they didnt say anything.\n\nI excused myself to take a phone call. After speaking with my sister, I just went to the waitress (seperately and away from my friends) and told her theres a mistake. I didnt eat thr apps and to just give me my seperate bill.\n\nI returned to my table and the lady gave my bill face down. This girls boyfriend asks \"does her bill include apps?\" Bless the waitress, she just said its her bill. I paid and tipped the waitress extra and left. But I been feeling uncomfortable about this whole thing.\n\nTL;DR friends ordered a bunch of apps when I said I was only gonna eat mine and expected me to pay for it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nAll those people including the waitress should you exactly what their character is. Going forward remember this when choosing friends and generally people around you. This will either help you in life or hold you back.", "NTA. So NTA. They were trying to scam you into covering their bill.", "NTA When I go out in a group, when the server approaches for the drink order, I always say I am on a separate check. Others in the group do the same couples together usually. They were trying to intimidate you into paying part of their bill. They probably thought you would be too embarrassed to make a fuss/scene. Good for you for not being taken advantage of. Now you know how these people are, you can take steps to avoid their BS or choose not to associate with AHs like that.", "Thanks for sharing ur story. Thanks for the reminder on boundaries. Its def tough and something i struggle with. Good on ur wife tho! It sucks when its family", "It really does. It’s her sister and there is a lot of envy because my wife was always the black sheep and she ended up marrying someone that makes over 3x anyone in the family and she often still receives criticism. I’ve even heard her sister say we have more money than sense because I often get her coffee. Tbh I’m kind of happy she blew up and called us selfish over $25.", "It gets easier with practice. Stand up for yourself whenever someone tries to take advantage of you. You did great.", "This is such a good story! I am so glad for your wife! Sometimes there actually are happy endings!", "Thanks for this! It honestly made me feel better", "I’m assuming that you mean that the black sheep got the financially stable and loving husband = happy ending"]}