{"id": 15074, "submission_id": "12q5tru", "title": "AITA for cancelling a date because the girl has a boyfriend", "selftext": "So I’ve (23M) displayed interest in this girl (23F) for a couple months now and have brought her food and stuff but we’ve only hung out a couple times recently, we used to be friends of friends for a long time. But anyways she said she wasn’t in the best headspace to date and all that so I respected that and kind of gave her some space. Well anyways I invited her to a concert and she agreed to go, was really excited about it, all that, and confirmed that she would go and spent $1000 on the tickets, well she popped up of Facebook in a relationship today, would I be the asshole for no longer wanting to take her? I mean that’s great for her and all that, no ill feelings there, I just feel used for a concert", "created_utc": 1681782596, "permalink": "/r/AmItheAsshole/comments/12q5tru/aita_for_cancelling_a_date_because_the_girl_has_a/", "score": 869, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I could be the asshole because she never gave any inclinations that we were ever more than friends or was ever anything that couldn’t be chalked up as being friendly towards me so it could be a dickhead move on my end.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Take someone else if you want. But please please please - don't spend $1000 on a person you aren't dating. She was clear that she didn't want to date you, you spent the money anyways. Why did you do that? You didn't believe her? Wake up and don't do that anymore. \n\nYTA - because she was clear. nothing in your relationship has changed at all. She never saw you as a dating prospect and told you that. So why does her relationship status change things? Because you're an AH and not actually her friend at all.\n\nYou weren't used for a concert.  You were trying to use the concert to bribe her into a relationship. Wake up. You're deceiving yourself.", "From reading other comments, YTA.\n\nYou saw this as a romantic date. She saw this as a friend date.\n\nShe wasn't using you for a concert, you offered to take her to a concert and she wanted to go with a friend.", "YTA why would you use “date” in your title? You invited her, why would you feel used? “Because the girl has a boyfriend” now she does, after the invite. What does her having a bf have to do with the concert if you were just going as friends before? If you only want to spend money on people you’re dating, make sure they know and agree to an actual date beforehand. Don’t do nice things for people to make them feel like they owe you in return. At the end of the day, they’re your tickets and do what you want with them.", "YTA. You didn’t “respect” her wishes to not date. You bought the ticket while still interested in her, then backed out bc she’s not dating you. You’re a fake friend.", "No means no, not try harder, YTA", "If you cancel, please *clearly* state you meant it as a date and that's the reason why you're rescinding. These kinds of miscommunications can have shockingly enduring ripple effects", "YTA. She was honest about not wanting to date you,  you agreed to be friends, you asked her to go do something, found out she’s now in a relationship, and now you want to cancel. That right there says that you don’t actually consider her a friend and never really did, only someone you wanted to date, despite her being clear about everything. Seems pretty crappy to me. Imagine what it feels like to find out your “friend” was only pretending to be your friend because they thought they could get with you.", "YTA\n\nWhen a girl tells you she doesn't want to date, and you make plans anyway, you are very clearly indicating that you want to go with her because she is your friend.\n\nIf you then change your mind because her relationship status changes, you were never interested in going because she is your friend.\n\nYou should still cancel the show because the last thing she needs in her life is some dishonest jerk pretending to be her friend. The sooner she kicks your disingenuous ass to the curb, the better.", "YTA\n\n\nYou invited her. You offered to pay for her, unprompted. You werent used for a concert. You just played yourself. Gave yourself a certain expectation of what the concert should mean, not what it actually was. Which was two friends hanging out and having a good time at an event.", "You literally did this to yourself because you refuse to take \"no\" as an answer. You're a fake friend! YTA\n\nEdit to add: The concert was never a \"date\". You're forcing that idea but there's no chance she saw it as one.", "She said you didn’t want to date and you set up a date.  Her expectations are clearly that you are going to be friends and you then invited her to a concert, presumably as a friend because “you respect that”.  Anyway, she was clear and you’re still holding out hope you shouldn’t.  Yes, you’d be an asshole by canceling.  YWBTA", "Yta\n\nYou asked her to go to a concert, after what she said she sees it as 2 friends hanging out at a concert. \n\nStop trying to weasel your way in.", "INFO: did you buy the tickets before or after she turned you down? You're kind of a dumbass either way for spending that much money trying to impress that girl, but if you bought them after then you're extra stupid for thinking that it would somehow change her mind (and would also be T A for trying to back out of taking her when she  had already friendzoned you).", "If the intention you had was that you two would go on a date and that was fairly clear then NTA. If you said \"I'm fine with just being friends\" and now you're upset that she has a boyfriend then YTA.\n\nCan't have your cake and eat it too. If she says she \"Isn't looking for a relationship right now\" that means you're not the type that she's interested in and that will never change. This does not mean that she was \"using\" you for concert tickets.", "I am not sure if you are just really dense and don't understand a No, or whether you thought you can buy her, despite her telling you repeatedly No.\n\nShe made up an excuse about not being ready to date, because you didn't respect it when she said No, repeatedly. \n\n This is very close to the \"I have a boyfriend\" story women have to make up if they don't wanna date, because you won't respect her No, but you would respect a boyfriend. \n\nStop spending money on her. \n\nYTA", "YTA.\n\nYou bought the tickets when you were friends. It wasn't a date because you weren't dating. Suddenly because she's with someone, you're not taking her anymore?\n\nThen you were never friends. You were trying to buy your way into a relationship, which is a sleezebag move.", "I was \"with\" someone like you, for six weeks because they decided to come stay at my place with no warning, and I was afraid to say no. This was despite my telling them I was happy to be friends but nothing more, and that I was thinking of dating someone else long distance.\nA lot of people just kept telling me to kick him out, to tell him he was not welcome, and so on. Only three people understood the fear inside which kept me quiet, and let him do whatever. He would buy me things I didn't want, or had thought of buying for myself, and would expect me to be pleased and grateful.\nOnce he left, I blocked him, deleted old social media accounts, and changed my address.\n\nIf her response to dating you wasn't an enthusiastic yes, and you kept at it anyway, you're not a good person. If it isn't a yes, it's a no. \nAnd worse than not understanding this rule, you ignored it.\n\nYTA", "You’re a dummy for spending 1000$ on someone that clearly told you they weren’t interested. She didn’t use you, you’re just dumb.", "YTA.  Only YOU knew it was a romantic date.  Then want to back out when you find out she didn’t consider it anything more than friends.  You f’ed up.  You don’t get to blame her for not making your own intentions clear.", "YTA\n\nThis feels like the kinda thing a guy who complains about being \"friend zoned,\" would say. She rejects you very softly (not in a headspace to date), you invite her to go to a concert that you then pay for, she then gets a boyfriend but that doesn't make you and her any less or more than what you already were. Friends. But of course you don't want a friend, you want to sleep with her. Now that you can't do that (i doubt you would have even without the boyfriend), you don't want to hang out with her. YTA", "YTA. She clearly thought you were just friends, given she made her disinterest very clear, and you just continued to put her in the Fuck Zone. If you actually valued her as a person, and not just a romantic interest, then this wouldn't be an issue.", "YTA.\n\nShe told you she didn’t want to date you, you were “understanding” and continued being a friend. And then spent 1000 dollars on concert tickets knowing she didn’t want to date you. That’s entirely on you. She’s not using you for the tickets, she made plans with someone she thought was a friend.\n\nIt’s so painful to find out someone you thought was a friend was just trying to play the long game.", "You wanted to use this as concert as a 'we totally went on a date because I spent a bunch of money on you' way to guilt her into dating you. Just take the obvious signs of her not feeling a spark with you and let her be happy? She didn't know you were already labeling this as a date so she wasn't using you. She kindly let you down multiple times but you're hoping by throwing gifts at her that you'll wear her down enough to accept a date.\n\nYTA", "Sounds like she wasn’t using you to get the tickets, but you were using the tickets to try to get her.  \n \nIf she had already rejected you and agreed to the concert as friends, you have no right to feel “deceived” whatsoever. YTA. Leave her alone.", "YTA and this whole post reeks of “nice guy” incel vibes.", "YTA. She made it clear that she just wanted to be friends with you, yet you still went ahead an spent $1000 on tickets, that's on you. It doesn't seem like she used you for tickets, she probably just saw it as going to a concert with a friend, where as you were trying to make this a romantic thing, like somebody else already said, \"NO MEANS NO, NOT TRY HARDER\".", "~~Nope, NTA, and you can tell her why...~~\n\n~~Or might be worth talking to her to get more info if she really has a BF, before cutting her out... or better yet, reach out to her friends if you think she's using you for a $500 ticket, ask them if she has a BF...~~\n\n~~FB relationship status is definitely a red flag, but its not always true...~~  \n\n\nReread the post and think YTA...\n\nMaybe she was a little vague, but still clear she wasn't interested in dating you at the moment... you knew you were just friends, and decided to buy those tickets, AS FRIENDS...\n\nNot really cool to back out now... you went from being cool with going as friends, to now feeling used for a concert... that's not her fault... so soft YTA... I mean, you made your bed here...", "YTA take her as a friend like you said. Unless…gasp you aren’t a friend at all and you lied to her about being friends because you wanted to date her. You’re a huge ah but I doubt you’ll ever be blessed with enough self awareness to see it.", "[deleted]", "There needs to be another category\n\n\"You're the chump!\"", "NTA.  Cancel with her, but be honest about why you are doing so, and explain that your intention was for it to be a date, and now that she's in a relationship that is inappropriate.", "NTA here. You paid for the tickets so you're in your right to change your mind for whatever reason. But you also have to deal with the conversation of having to tell her you no longer want to take her to the concert because of her facebook relationship status.\n\nI don't think she used you for the tickets but I don't know the full context of everything.", "NTA, it's totally normal not to want to take someone elses gf to a concert and I bet he doesn't want her to go with some other guy either\n\nJust be honest with her and you guys can prob still be friends if you really want", "Well... Are you the relationship? If not, NTA.", "NTA. Cancel and go with someone else.", "I guess you could just let her know outright that this was an invitation on a date.  If she is in a monogamous relationship, then yeah, it's probably best to cancel the date.  NAH.", "I think most people here will say YTA bc you committed to going with her. \n\nBUT.... I'm gonna go with NTA. You only did it bc she's an potential interest. Although you didn't make it clear in your offer, I'm sure the girl knew.", "NTA - but qualified. I see a lot of Y T A s here, but he spent $1000 on tickets (I know, not the smartest move). She accepted the \"date\" and had to know what the cost was. They aren't even that good of friends. And she is now in a relationship after accepting the \"date?\" Either she forgot about it, or is kind of using you. Wonder what her new boyfriend thinks of this? Or am I totally off here?", "NTA - she knows what she’s doing, she clearly doesn’t have any respect for you, much less feelings.\n\nBail and don’t look back", "NTA.\n\nRegardless of if she wanted to date you romantically or not, this concert that you have paid for is a date.\n\nShe was single, she isn’t now, so you no longer feel comfortable with taking her to the concert.\n\nIf she has a problem with it, then tell her to ask her new BF what he thinks about her going to a concert with someone who has feelings for her, who has asked her to date them.", "My interests were repeatedly made clear, my last shot I took at it was basically saying I didn’t want to push but that I liked her and she responded with she’s not trying to date or talk to anyone right now as part of getting over a breakup, I told her I respected that and just have made light nods since, but again haven’t pushed or brought that back up", "NTA — Did she confirm you’re not the boyfriend?", "These comments are ridiculous. I don’t think OP is an asshole but definitely an idiot. He swung for the fences and it didn’t work out and his feelings are hurt. Shit happens. I would also absolutely cancel but I wouldn’t have invited her in the first place either", "NTA. Take another girl. And stop talking to that girl.", "NTA.uhm", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I’ve (23M) displayed interest in this girl (23F) for a couple months now and have brought her food and stuff but we’ve only hung out a couple times recently, we used to be friends of friends for a long time. But anyways she said she wasn’t in the best headspace to date and all that so I respected that and kind of gave her some space. Well anyways I invited her to a concert and she agreed to go, was really excited about it, all that, and confirmed that she would go and spent $1000 on the tickets, well she popped up of Facebook in a relationship today, would I be the asshole for no longer wanting to take her? I mean that’s great for her and all that, no ill feelings there, I just feel used for a concert\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Don’t take her to the concert because it’s going to make you behave even more like an asshole in the long run. She doesn’t want to date you. She made that clear. You keep pushing. You see this concert as transactional. She just wants to go to a show with a friend. You are NOT being used, as she has been  clear. Sometimes, “I am not in the headspace to date,” means just that. Sometimes it means, “I am not interested in dating YOU, but don’t want to hurt your feelings.” This is a case of the latter.", "Hard NTA. You can't date someone with a bf. Your instincts are correct.", "so according to OPs other comments, he has been pressuring this woman to date him for awhile\n\n> My interests were repeatedly made clear, my last shot I took at it was basically saying I didn’t want to push but that I liked her and she responded with she’s not trying to date or talk to anyone right now as part of getting over a breakup\n\nso OP didn't want to push..... he just tried over and over and over again despite getting no positive results. he made his interests clear.... repeatedly and when she wasn't interested back, forced her to explicitly say that her dating him is off the table\n\n> I told her I respected that and just have made light nods since, but again haven’t pushed or brought that back up\n\noh only light nods, how \"respectful\" \n\nOP sounds exactly like every predator I've known, complete inability to take no for answer, tries repeatedly and pressures people while insisting it's not pressure, maintaining a fake friendship in an attempt to convince her to date him\n\ngross gross gross gross gross\n\n[link to one of many of OPs comments](https://www.reddit.com/r/AmItheAsshole/comments/12q5tru/aita_for_cancelling_a_date_because_the_girl_has_a/jgoxtmd)", "Reminds me of this guy from my work who spent 800$ on Christmas gifts for his girlfriend of 1 week. She broke up with him a few days later and he wouldn't stop complaining about all the money he spent.", "If OPs story is true then she didn’t say she wasn’t interested in him. She just said she wasn’t in the right headspace to date (which apparently wasn’t true). So she could potentially be keeping him on the hook.", "You have a right to change your mind for any reason whatsoever. \n\nNTA", "I’m confused . Did he pay 1000 for tickets or did she? She’s clearly using him if she’s fine with him spending that money on her.", "Especially given that OP explicitly used the word \"date\" when referring to the concert in the title.", "He never claimed to just be her friend if he’s obviously been expressing interest from the start", "Doesn’t that only make it worse? Like her finding out he was only pretending to be her friend because he thought he could weasel his way in to a date with her? At least, that’s how it looks to me.", "Relationship is with her friend that she’s been close with, I can only assume that the guy confessed feelings and she just didn’t want to tell me but yeah they’ve both changed profile pictures, the whole nine", "How is she using OP when OP invited her and bought the tickets of his own free will?\n\nI'd accuse her of using him if she asked to go together. But it sounds more like OP bought tickets to her favorite concert and invited her in hopes to manipulate her into dating him after she had already expressed disinterest.\n\nOP is the manipulative one here.  He bought those tickets trying to manipulate her, not the other way around.\n\nIt's like if I walk up to a stranger on the street, randomly give them 20 dollars, they accept, then I log on to the internet and whine that they are using me for my money. I did all of that of my own volition; I'm wasting my own money.", "Agreed, but shit I was trying. Morgan Wallen", "Elaborate, because I’m not saying I disagree, but what would you do having already bought the tickets", "This was also a big part of it", "But OP said that the girl had already told him she wouldn't date him.\n\nHe said he expressed that wanted to date - she said no - he said he would respect her wishes and give her space. \n\nSo the terms of attending this concert together was always as friends, not as a date.  OP had already been rejected from being a dating prospect. \n\nThe idea that OP thought this was a date was pure delusion. And the fact he spent $1000 on someone who had already softly rejected him? It's downright bizarre.   \n\nThen to turn that to say she used him? Yikes.", "I said YTA because she told him she didn't want to date. And he took that information and bought crazy expensive concert tickets for a girl he wasn't even dating.   That's not reasonable. \n\nLike... sure, take someone else. But it seems like she was clear and OP should have understood this wasn't going to be a romantic date before he even asked her to join him.  \n\nIt's like if I ask you on a date and you say no, and I say \"well that's fine. Here's $100 bucks because we are friends\"... and you take it, I can't say you used me.", "She made it clear to OP that she's not interested in dating him tho. Going to a concert with a friend doesn't mean she's cheating on her boyfriend.\n\nI'm also not convinced she knew what the cost was. Considering OP noped out of this when he found out she had a boyfriend, he considered it a romantic date even after she told him she's not interested. That's on OP.", "\nEh - If someone says they don't want to date you, you probably shouldn't respond to that by inviting them to a concert then buying $1000 tickets for them.\n\nOP's actions are unreasonable.", "you haven't respected that! \n\nyou literally just described making your interests repeatedly clearly and taking multiple shots. she didn't reciprocate your interest literally ever, and then when you were pressuring her to date you by asking AGAIN, while saying \"no pressure\", she tried to give you an answer that was firm but that you wouldn't blame her for\n\nthen you pretend you respect that even though you're making \"light nods\" since which is somehow not pressure? dude, in what world?\n\nthen you invite her to go to something as friends, KNOWING that she doesn't want to go on a date with you but you consider it a date and now want to cancel because you know she's dating someone else\n\nbecause only when she says she's dating someone else do you actually respect that she IS NOT AVAILABLE. you didn't respect it when you try to ask her out of bazillion times and she said no\n\nyou have absolutely zero respect for this woman you want to date and negative respect for her \"no\" and I seriously worry about whomever you do end up dating because people with this attitude often carry it into the bedroom", "Sounds like you can't take \"No\" for an answer my dude.\n\n\"I'm not looking for anything right now\" means \"I'm not into you. I don't want to date you.\" It will never mean anything else.", "Then YTA\nDoesn't sound like she saw this as a date, just going to a concert with a friend.  The fact that she chose to change her status on social media does not change what she agreed to.", "Tay swift?", "No is a complete sentence. She said no, repeatedly. Accept it and move on.", "It’s definitely someone else, links to their profile", "First I was gonna say idiot for spending 1k on a night out with someone that said they weren't interested in dating... this is all a brand new level of cringe. Yeah, if this post isn't bs, OP is most definitely TA.", "there's nothing about his relationship with her that justifies a $1000 concert ticket purchase.  Even if she agreed to go with him for a first date (which she didn't) - that is way too much money. That's wildly unreasonable on OP's part. \n\nI would think differently if she asked him to take her to the concert and he said yes because he had a crush... But that didn't happen. She said she didn't want to date, then he invited her to go to the concert and he chose expensive seats. This stupid situation is entirely of OP's making. \n\nAs I said, he can change his mind and ask someone else to go. But honestly he should not be buying $1000 gifts for a girl who is not his girlfriend. OP has to stop doing that. I think we can all agree that this is unreasonable behavior.", "That’s a person being nice by saying it’s not you it’s me.  We all know it’s a lie to spare feelings.  The answer isn’t spend 1k on a quasi date", "maybe it was true and changed\n\nmaybe she was just trying to let him down nicely because she was afraid of backlash\n\nshe did absolutely nothing to indicating romantic interest in high, or potential future romantic interest\n\nin this case \"on the hook\" means that OP didn't fucking listen or actually respect her answer and has kept trying to date her under the guise of friendship", "Does she know he spent that kind of money on the tickets? She made it clear to him she's not interested in dating him so it's on OP if he thinks otherwise.", "Let's take a second and think about how unreasonable it is to spend $1000 on tickets for a \"date\" with someone who already told you point blank they don't want to date you and just see you as a friend.\n\nThere's no defending OP here. OP is throwing his money into the paper shredder and then blaming the paper shredder for wasting his money.", "Yeah. It would’ve helped if OP differentiated the two with *her*, not just in the post title.", "exactly—if that’s what’s going on, she should know", "FYI: Reread your post and have changed my judgment... I'm drunk at the moment and glossed over some key parts... :)", "Well the point is you shouldn’t have been trying. If someone tells you no, you can be friends with them or you move on. \n\nLife is not a romcom.", "“I’m not in the best headspace for dating” is code for “I’m not interested in dating *you*”", "Well I wouldn't buy them for someone who's made their disinterest clear.", "Take someone else. I doubt her boyfriend would be happy with her going with you anyway.", "I don't know- I've been in situations where someone asked me out multiple times even though I said no.  Maybe this is just me but if they then asked me to a really expensive concert, even if they said it was \"as friends\" I would still say no.", "I disagree a bit. Saying you “aren’t in a headspace to date” isn’t a clear no to everyone. A clear no is saying “Sorry but I’m not interested”.\n\nHe made his intentions pretty clear, so at that point any chance of just having a friendship is gone. You don’t accept tickets to a concert with someone you know wants to date you, unless you are using them or don’t care about their feelings at all.\n\nSo I think they both suck really, because he was stupid for buying them when they weren’t dating on the premise it would be a date.", "Doesn’t even sound like OP cared about the concert. Just the chance to date someone who clearly wasn’t interested", "Guarantee any girl that goes with him on this 1K adventure will be expected to give him sex afterwards, and he will be *pissed* if that doesn’t happen.", ">there's nothing about his relationship with her that justifies a $1000 concert ticket purchase.\n\nAgree.\n\nAll I'm saying is that we cannot tell from the story whether she completely turned him down or not. It could be a \"How I Met Your Mother\" situation where she is stringing him along. You know: \"I'm not in the headspace to date you.... right now\" 😂\n\nBut either way spending 1000$ in this situation is completely insane.", "We can all agree that spending 1000$ in this situation is insane. But it's also insane how many people make hard conclusions based on a 7 line story. The fact is that we don't know what happened between them.", ">she did absolutely nothing to indicating romantic interest in high, or potential future romantic interest\n\nWe didn't know that from the the original post. It's a 7 line story. All I'm saying is that saying \"I'm not in the right headspace to date\" is not the same as saying \"I will NEVER date you\".", "He asked first , she said yes (knowing he was romantically interested), then he bought the tickets.\n\nDunno if OPs post was edited or not", "She didn't say that, she wasn't up front or honest at all.", "Naive but still taken advantage of", "Perfect elaboration", "That’s called harassment", "that person was trying to manipulate you and you declined. Why? Because you knew they weren't really a friend, they were just trying to manipulate you. Manipulative people are AHs.  \n\nIt just goes to the part where OP agreed to respect the girls wishes and just be friends. then he invites her to a concert and gets mad when he realizes they are actually going as friends. Wasn't that what he promised he'd respect and agreed to? He was being manipulative. \n\nHe accused her of using him, but he was the one who was actually trying to manipulate her.\n\nOP should be spending that kind of money on people who have already agreed to date him, not people who have rejected him. It's his choice if he wants to throw his money away. He must assume accountability.", "That's very presumptuous, he actually sounds as if he's too nice and is a bit naive. Not exactly a raging hard on type. At the least he's not a \"guaranteed\" misogynist as you're painting him to be.", "if she'd done something, OP would have said so\n\nbecause it would have helped his case and been relevant to the story\n\nand as it turns out, if you read his comments, he pestered the crap out of her and tried over and over. she never reciprocated and he kept trying and eventually he forced a conversation and that's when she demurred about the headspace\n\nand then he supposedly respected her decision but not really because he kept at her\n\npeople don't say \"I will never date you\" because it's rude as hell, considered an asshole move, and RISKY\n\nif she said that everyone here would call her an AH without really extreme circumstances warranting it, and she doesn't need to take additional risk because it might theoretically get through to a guy who isn't fucking listening to her anyway\n\nshe said no. the answer was no and at that point dating is off the table, probably forever, but definitely the only thing putting it back on the table would be her bringing it up\n\nyou don't treat her differently on the assumption that she will change her mind. the answer is no. no is no is no", "He asked her to hang out after being told she wasn’t interested, lol", "If I open my wallet and give all of my money to random people on the street, then cry about all of my money being gone?\n\nThat's not naive. That's downright silly.\n\nIf you want to give your money away, that's fine. That's your choice. But no one asked for your money, you offered it. Be accountable for your choices.", "How was he taken advantage of exactly? He asked someone to go to a concert with him and she accepted. Did she put a gun to his head and make him ask her out? Or make him spend that much money on concert tickets? Did she sign a contract saying she would be his girlfriend if he did that but then she went back on her word? 🤔", "Doesn't make him an asshole. It does make her a bit of one though. \n\nNot a super fair analogy, guy said he gave her space cause she said she wasn't ready for a relationship at that time. Guy tries again by asking out to a concert, she says yes (but has a bf). Lots of comments saying it's 'code' for not being interested -at all- , probably true, but also a terrible way to try to tell someone you're not interested in them.", "Id be too guilty to accept it if i was in her shoes.", "Id also say \"sorry I'm just not interested in you that way\"", "But hey expensive concert tickets", "eh we don't really know the terms/wording of how he asked her.\n\nWe don't even know if she knew how expensive the tickets were or if she knew he thought it was a date. OP said they've been friends for years.  She seems pretty open about not wanting to date OP and open about her new relationship status. \n\nOP knows exactly where he stands. She's not leading him on at all.  He was being delusional and ignoring all the signs and making unreasonable decisions and he needs to learn to be accountable and to stop doing that.  Again, he spent a thousand dollars! You can't defend that.", "We don't know but you've picked a side based on more assumptions, compared to the information we've been provided. I'm just working with what's provided in the original post. \n\nHe said used to be friends of friends for years. The only info we have is one 'now isn't a good time' rejection. \n\nAnyway, I guess in the end he was just asking r/AITA if he'd be the asshole for cancelling. Based on everything he said and what I've said I personally don't think he's an asshole at all and should defs just cancel and be honest with her and also polite. Simple.\n\nEdit: hmm.. I still think she kinda knew what she was doing but it all depends on how long she was already seeing this new dude before changing fb status. Too many variables honestly. But I'm not super hard stance on 'she used him'... maybe though. Depends how solid their 'friendship'  actually is", "If she truly wanted to manipulate him, it would have been easy to hide the relationship status until after the expensive concert. \n\n\nOP knew the entire time that he wasn't dating this girl. Despite that, he decided to spend $1000 on concert tickets for her. He has no one to blame but himself.\n\nif I say \"hey Rude-Lettuce-8982 do you want to date me?\" and you say \"No\" then I say \"ok well, I still want to be friends. I have a $100 that I want you to have just as friends!\"  and you say \"oh thanks!\"  then I find out you have a girlfriend so I'm like \"hey give me that $100 bucks back, I thought you were single!\".... that's an AH move.  I wouldn't think you took advantage of me, i'd think I was a ridiculous person with delusional behavior.", "Like I said he's naive because she said that in not so many words according to OP. She said she wasn't interested in dating right now, he still thought he had a chance. 1K on tickets for a first date is crazy tho. But if he had the money it's his right to be crazy. \n\nHe even said no ill feelings he just wanted to know if he's an AH for cancelling. I don't think he is.", "She doesnt want to be in a relationship with you, or date you, and you still dont understand it. You werent used for a concert, you were never going together as a date. YTA", "YTA you didn't respect her head space. You invited her to the concert as a date, you were expecting romance after she told you no.", "Reading the comments.\n\nYeah no YTA. \n\nShe repeatedly told you she wasn't interested, read the room dude. \nTell her you don't feel comfortable taking her anymore because you don't want to step on her boyfriends toes and stop bothering her.", "YTA.\n\nIt was never a date.", "YTA\n\nYou are a NiceGuyTM. You have \"Nice Guy Syndrome\". Take a hint, be better.", "INFO is she aware you thought of this as a date or was she under the impression this is a friends thing?", "YTA \n\nShe was very clear about not wanting to date you, yet from what I'm reading it seems like you didn't believe her, or thought she'll change her mind. You then invited her to a concert and thought of it as a romantic date, but you never bothered to specify that you are asking her out, so she OF COURSE thought you are going on the date solely as friends - which is what friends do. And now, when you found out she is in a relationship, you want to cancel the date - because you know she's going there as a friend.\n\nYou two aren't friends. Friends have each other's backs and care for each other. The only reason you are still \"friendly\" with her is that you hope she will change her mind and turn into your love interest. Please, let this girl go already.", "If she was not aware that you classified it as a date then YTA. If was aware that it was a date with romantic intentions then NTA. However, it seems she sees you as a friend from what I see according to your post and probably assumed this was a friendly invite.", "YTA In what possible universe would you NOT be the asshole? 500 Days of Summer was a warning about this kind of thinking, not a how-to guide", "Info: did you pay for her ticket or she paid herself?", "YTA this was not a date. You can’t trick someone into going on a date with you. She’s not “using” you for a concert, you INVITED her to one. She turned you down and has not reciprocated any of the “nods” you’ve given. You lied to her and told her you respected her when she rejected you, then pretended to still be her friend. She said yes to going to a concert with her “friend”. You didn’t say it was a date when you asked her, after she’s already said no to dating you, so in her mind it’s as friends. Nothing is a date unless both people know and have agreed that it’s a date. If you had asked her to go to the concert AS a date and used those words, chances are she would’ve said no… again. Learn to respect no. She does not owe you anything, you are not entitled to date her. \n\nBut honestly you shouldn’t take her to the concert at all, you should leave this girl alone and stop pretending to be her friend. Stop pretending to be her friend and using her in hopes that you can eventually convince her to date you. \n\nEven if she wasn’t crystal clear to you with her wording of not being in the right headspace, that answer still necessitates a direct conversation about whether an invitation to something is a date.", "Info. Was she aware that you intended it as a date and not just hanging out as friends?\n\nJust saw the \"why I could be the AHole\" explanation.\n\nYes OP YTA for assuming it was anything more than friends hanging out.", "OP, I'm a woman and I have a rule about dating that has helped me a lot.\n\nIt's called \"FUCK YES, or, no.\n\nIt means, if I'm interested in someone and their answer is anything less than \"FUCK YES,\" and contains any kind of hesitation or maybe at all, then I drop it and do not pursue.\n\nBecause why would I want to be with someone who is settling, or just being nice, or ANYTHING less than totally stoked and excited to go out with me?\n\nFuck yeah, or NO.", "Dude, she literally told you from the start that she doesn’t want to date you. If you thought that spending that money would make her more likely to accept your advances then that is your own fault, not hers. You said you didn’t want to push, but you also said that you made your internet clear repeatedly. That IS pushing. \n\nThis entire posts reads like you are butthurt because she chose to date someone that isn’t you. Take someone else to the concert if you want, but you are not cancelling a date. There was never a date. You did this to yourself. Get your orbiting ass out of here.\n\nYTA", "How do you feel used for a concert when YOU'RE THE ONE WHO INVITED HER? TF? You're a clown. Please leave her alone and never talk to her again.", "It's not a date bro.", "ESH. You for spending that much money on someone who has been clear about not wanting to date you and her for accepting the invite to go.", "YTA but man stop chasing this one. She's not into you you can't buy that am sure someone else can meet your needs and you can spend money on them. She is only seeing you as a friend so you got to understand no amount of free stuff is going to change that and she just want to spend time with you platonically.", "100%!! He's going to scream \"friendzone\" when she owes him nothing and just wanted friendship and has told him over and over.", "Lol, did you read the whole thing?", "Lol that is not respecting her.", "Ahh, so you fuckzoned a woman who’s repeatedly turned you down and thought an expensive concert would finally get you what you want from her. Play stupid games, win stupid prizes.", "Yeah, and only backs of when it's confirmed she's another man's 'property'. Because a grown woman telling him repeatedly she isn't interested isn't enough, but he'll respect another man's claim of ownership....", "It depends, if the guy has been perusing her over and over despite her saying no, saying she isn't looking or ready right now usually gets a better response and the guy tends to leave the girl alone. He is probably crying about being friendzoned and thinks she owes him her body for the food he brings and concert tickets he bought. If I were her, I would just go no contact because he might become unhinged.", "This is what I say to guys when I don't want to upset them. I'm trying not to do it any more, and to be very explicit in saying \"I don't want to date YOU\".", "I mean if he’s asked her out to an event after she’s repeatedly said she doesn’t want to date…… I think it’s safe to assume it’s gonna be platonic", "Sell the tickets, get a gym membership and move on from this girl who clearly doesn't want the same things from you. This has been a valuable learning experience for you. I'll be honest I've been in a similar situation, not as bad tho. You need to grow up and move on.", "Fuck. No, I skimmed it.", "how is that clear? like maybe to most people but not to me. that seems like such an indirect way of saying \"i'm not interested in a romantic relationship with you\"\n\nif they want to be extra nice or apologetic i guess they could add \"at this time. should this change i will let you know\" but the first part is really the info i would need\n\ni don't find it being nice at all to not be clear. even a straight no, i'm not interested is better than \"i'm not in the right headspace\" if that isn't the truth.\n\nnow granted i'm female and have autism so maybe one of those factors plays a big role in wanting someone to be clear that they aren't interested vs cryptic with phrases that i just don't understand what they are supposed to mean.\n\nlike not in the right headspace sounds like it would open up someone to keep asking you out because what if your head space has changed.\n\n it's not kind to end up in a situation like this person who has OP pushing and pushing here and there to go out because apparently the message of not interested was missed. it really actually sucks for her. and if they were afraid of the reaction from a direct answer then i'd say in the future cut the friendship down.\n\nand even in movies when someone says they aren't in the right headspace half the time they end up with that character which thus further confuses the phrase so for some NDs it's really not clear", "Agree. My point is simply that was cannot conclude from OP's short story alone that she doesn't keep him on a hook. It wouldn't be the first time that a person strings someone along... especially if they buy them food etc.", "Yeah, this guy can't take no for an answer and keeps pursuing this girl.", "Just the chance to use financial leverage and geographic control to force her into a situation she doesn’t want to be in.", "Yes it is, even more so because it wasn't the first time she told him no.", "Yeah, the additional context of OPs replies, gives off the \"I spent *X amount* of money on you, I deserve a handy\" vibe.", "This just reminds me of that HIMYM episode (named hooked) where they keep saying \"I can't be with you........... \\*pause\\*....... right now\" 😂\n\nI don't think it's rude to make it VERY clear to someone that you're not interested. The \"it's not you, it's me\" should be retired.\n\nI haven't read his additional comments. I only read the OG post.", ">even more so because it wasn't the first time she told him no.\n\nThis info is not included in OPs post.", "She just said she wasn't in the best headspace to date after her breakup.", "fun fact - you're literally part of the reason it isn't retired \n\nmight want to go edit all that misogyny out of your life as a first step to retiring this phrase", "Honestly you can’t ever win if someone has decided they are not taking no for an answer. I met someone once at a party and after one date told him I didn’t think we were right for each other and didn’t want to date him. I was very clear that this was specific to him, not to dating in general, and we agreed to be friends. We went for coffee and generally hanging out a few times - not too often because something still felt a bit “off” to me, I didn’t want to deny him friendship but wasn’t sure he was as ok with just being friends as he said he was. Fast forward a year and I started dating my now-husband and guess who was super offended and immediately stopped talking to me. So this entire year of me being very clear, open and vocal about my (lack of) intentions he just pretended to be a friend.", "That means she's not in a place to date. OP also never expressed that this was a date. After he said he was fine being friends.", ">edit all that misogyny out of your life\n\nIt has nothing to do with gender.\n\nBoys are also keeping girls on the hook if it benefits them.", "He didn't say that as far as I can see.", "But did he say he didn't?\n\n'I don't want to date anyone right now' does not mean 'try again later'.", "It means what it means. If you're assuming total honesty", "As a woman, there is NOTHING quite like that feeling you get after finding out that the only reason your guy friend was even hanging out with you, was to try and get in your pants. It is horrible. It feels gross, unfair, creepy and invasive.\n\nWe are not to be convinced or persuaded to date you. NO MEANS NO. Respect her answer and get a grip.\n\nYTA. Massively.", "I’m confused because she already made it clear she doesn’t want to date, so idk why you’re considering it one", "YTA\n\nNo means no dude. I can just imagine you telling people you’ve been friendzoned. No. She was clear about her position. You were told no. You have to respect that. If you agree to be friends then you have to respect that and not use the friendship to try and advance your own dating agenda when she’s already made it clear. You can’t just spend money and hope it means she’ll change her mind. \n\nIt’s fucking horrible to be friends with someone, for them to express romantic interest and to politely let them down and want to maintain the friendship, and it become clear that the person only wants sex and more of a relationship.", "YTA dude it wasn’t a date stop buying food and tickets for people who explicitly don’t want to date you", "I read the title and was like, that's fair, you can't date a girl in a relationship, but then I read the post and the title is so misleading!", "Bro she does not want to date you, period. YTA.", "YTA", "YTA\n\n\nFucking creep. Seek help", "Yta. It's not a date. She isn't using you you're the one with ulterior motives. This is some r/niceguy crap.", "Ohh. You're one of THOSE \"good guys\".\n\nYTA. Yikes.", "ESH I can see all the comments about OP being pushy and persistent, and those are fair calls. However, she should NEVER have agreed to the concert and let him spend all of that money on her when she knew he was interested in her and it wasn't reciprocated. She was 100% taking advantage of him and I think that's pretty disgusting.", "Not the best scenario but NTA.   You bought the tickets you can take or not take anyone you want.", "Nta take some else it's cool that she told you that she wasn't in the best headspace today cuz I guess she wasn't interested but at the same time you shouldn't accept $1,000 ticket or $500 if it's for two tickets if you're not interested in someone because that's way too generous a gift for a friend", "NTA she might think your an asshole but do you want to spend 1000 on being nice to someone that was probably using you for free stuff? She knew she didn’t want to date you and continued to accept gifts. Just tell her the tickets are no longer available and you have to cancel with her. If you want to continue a friendship that’s more equal then do that but you don’t owe her the tickets and she isn’t a villian for not wanting to date you.", "[removed]", "[removed]", "Lol you talked yourself into a real pickle on this one.  You could either be a gentleman and live up to your word and go to the concert with her as a friend or cancel and risk being exposed as an AH.  Just chalk this up as a lesson learned and never do this again.  YTA for not taking her at word about not being ready to date.", "Maybe she thinks she’s in a relationship with you because you spent $1000 on concert tickets 😂😂", "You’re a wannabe try hard Dom. Leave the woman alone, she politely told you she’s not interested yet you’re still trying to control her.", "You wouldn’t be canceling a date. From what I can tell she hasn’t agreed to go on a date with you.", "This! If I had an award to give I would. \n\nThis happens so much to me. I never ask for anything and I am always willing to pay for myself. But the guys insist even after I make it clear that there is no romantic interest. And then when it finally sinks in I get called a freeloader and user by those people. \n\nOP is the AH. If he was her friend and okay with being just her friend her relationship status wouldn't matter. It would be about spending time with your friend at a concert. But guys like this love to think of themselves as the nice guys and cannot wrap their heads around how manipulative they are being. It won't sink in.", "\"Well, you know how men are. They think that \"no\" means \"yes\", and \"get lost\" means \"\"take me, I'm yours.\"\" -Megara", "people are being way harsh on you, nothing you did sounds creepy. It sounds like she was a bit vague in her rejection of you. Next time just make it clear that you want to take someone on a romantic date so they dont assume its a friend thing.", "He’s an asshole for not leaving her alone. Like he said in his comments, I don’t think anyone here cares about the tickets…", "“And don’t look back” while he’s the one who’s not leaving her alone ☠️", "Accepting gifts isn’t using someone… he never told her this was a date? As far as she’s concerned he respected that she doesn’t want to date him so they’re friends. But no in deluded mind this is a date ☠️", "So respecting her meaning going to a online platform to shame her because she made it clear she isn’t interested then you need new morals", "How long did you know her?", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The title mentions OP cancelling their \"date.\" If her online relationship status didn't change, what kind of nonsense/pressure/ uncomfortable shit would that poor woman have been subjected to at that concert? \n\nOP is an example of why women sometimes immediately say \"I have a boyfriend\" when you approach them. Men/people like this don't hear \"no\" but they'll hear \"property of x guy/you could get beaten up by a guy potentiallybigger than you.\" \n\nOP sounds a lot like an ex who ended up stalking me, and like every guy I thought was my friend who ended up assaulting me.", "Too many people taking the rapey 90’s and naughties rom coms too literally", "Why would she need to tell you?", "Admit you only bought the tickets because you were hoping she’d pay you for them with sex and give them both to her and her new boyfriend as an apology for ignoring her clearly stated disinterest in dating you. \n\nYou’re not gonna do that, but hey, it’d solve your “what do I do with these tickets I no longer want” problem.", "Dude. So the ENTIRE TIME you've been trying to get her to go out with you, you wouldn't take no for an answer, no matter how many times she said it and turned you down, but now that you might be disrespecting a man, suddenly you don't feel comfortable? You felt plenty comfortable harassing her for months despite never getting any indication she was interested.", "He didn’t do anything creepy but he is ignorant", "She didn’t say she didn’t want to date him - at least not explicitly.  She’s refused to reject him outright, letting him think the door is open for the future.  I can understand why OP would think that…but he needs to get over that.\n\nShe knows OP is interested, she knows she’s not, but she agreed to the concert anyways.  That means OP is NTA for finalizing realizing that this is going nowhere and ditching her.", "Exactly - I’ve been OP.  It’s easy to get hung-up on a chick that won’t give a clear rejection.", "If you know someone wants to date you and you keep saying no but accepting the gifts I think morally you’re in the wrong. He also is in the wrong because he keeps trying. She needs to say no, clearly you’re interested in me in a way I am not and we will no longer have a relationship. That being said he still isn’t an A for not taking her to the concert. They really should stop interacting as it was never a friendship for him just a potential romantic relationship that never happened", "yup, exactly\n\nngl I have wondered if OP is lying about the pressure and if it's a fake status change for that reason\n\nit's a good way to see is someone is actually your friend or just faking to get laid", "Another person suggested \"we are not right for each other\" that's also a good one. It's just important to make it clear that it's about the person and not dating in general. A lot of people are very ignorant and they wont get the message unless you say it VERY clearly.", "He thinks he’s a sexual dom. The guy is delusional and frankly unhinged. \n\nCheck his post history.", "So his ego wouldn’t be hurt?", "Yeah the only difference now is that she’s been “claimed” by another man. He can’t respect a woman saying she’s unavailable to him unless another man says it, too.", "“Aren’t in a headspace to date” quite literally means “I don’t want to date” …….. because they’re not in the headspace for that", "We really don’t have the full story. No one really knows exactly how clear the girl was, what sort of friendship they had, etc.\n\nBut one thing is extremely clear - OP invited this girl and spent $1000 on a person who had communicated already that they are in a just friends relationship.  This is OPs side of the story and even his version includes a soft rejection and just friends conversation.\n\nIt doesn’t appear she is hiding things from him, as he clearly knows she’s in a relationship now.\n\nIt appears OP is delusional and spent an inappropriate amount of money on a person who is not reciprocating his advances.  It’s extremely one sided.\n\nI don’t think it’s wise to overlook how bizarre OPs behavior is.  I’m not spending $1000 on a ticket to someone who isn’t even dating me. It’s a red flag into OPs delusion. At some point we are all accountable for our own decisions.\n\nThis isn’t even about the girl. Is he going to go spend $1000 on some other girl he isn’t dating next? It’s giving strip club trick who thinks he’s dating the strippers because he gave them all of his salary.", "She rejected him already. She thought he was inviting her to a concert as friends since he didn’t say “let’s go on a date” she’s not using anyone. If your friend pays for your meal, you’re using them? Or what", "I think some of you are imprinting the stringing along thing here. Yes that happens but this entire account does not support that this is a case of stringing along.\n\nEven from OPs account here (which should be biased in favor of his viewpoint and paint him in the kindest light), everything is extremely one sided and wildly delusional.\n\nI just don’t see how people get past the fact that AFTER she rejected him and they had a “we are just friends” chat -  he takes it upon himself to spend $1000 on this girl unprompted. What? That’s insane.\n\nHe’s trying to pour money into this girl who has clearly communicated already that this isn’t a date. He was deluding himself into thinking it was a date.\n\nY’all need to be real with OP - he’s making ridiculous choices and needs a wake up call. He made the decision to spend $1000 fueled by pure delusion. What if she wasn’t honest and didn’t tell him that she was in a relationship? How much would he pour into her? It’s got to stop. No one asked him to spend that money, he needs to be accountable for his own part in this.", "r/whenwomenrefuse is why women don't come out and directly refuse. \n\nThere are studies that show that people generally do understand non-direct refusals except in cases of romantic situations. If you ask someone if they want to try knitting because you enjoy it, and they say they don't have time, you take that as a no, not start tracking their time or hounding them to see if they can now take up a hobby they never expressed interest in. It's really only in romantic situations that this is such an issue. \n\nIf someone changes their mind, it's on them to say so, not on the rejected person to keep bugging them.\n\nEdit for sub name.", "You’re not wrong, but none of that is really in question.\n\nOP wanted to know if they were the AH for not taking her to the concert anymore.  That’s all I’m passing judgement on.", "I completely agree with you. But all of you are missing my point that actually has nothing to do with OP and everything to do with the wording of the original post.\n\nPeople concluded based on the wording in his original post that she made it very clear to him that he wasn't interested. But I don't see any wording in the original post that actually directly specifies that. So my point was simply that people cannot affirmatively conclude base on the wording of the original post that the rejection was clear.\n\nFollowing it has then been made clear by him in additional comments. But I made my point BEFORE the fact. It's not fair that I should account for comments made in the future. I don't have a time machine 😊", "You are also making up and assuming things that weren’t in the post. \n\nThat’s why we all read all of the OP’s comments and response so we get a better understanding of the facts/story. OP says multiple times in his responses that she said she wasn’t internet multiple times. Every time he asked her she said no. \n\nSo just stop defending your wrong assumption since you didn’t even read all of the responses and info from OP by your own admission", "Read the comments", "What kind of incel reasoning is this? You act like it's unreasonable for her to still want to be platonic friends after explicitly expressing she was not interested in him romantically. \n\nIt entirely makes him an asshole for expecting something just because he spends his own money of his own free will. She does not owe him anything, especially so after making it clear they are not romantically involved.", "That's called politely declining bro", ">he just pretended to be a friend.\n\nThat happens a lot sadly.\n\n&#x200B;\n\n>I was very clear that this was specific to him, not to dating in general\n\nYou handled it very well. You were definitely clear. This is the difference between your and OPs story (as he told it originally). Keep in mind I haven't read any of his following comments where people say he sounds like a stalker.", "Actually I was just pointing our that other people were making assumptions/conclusions and that she potentially could've been keeping him on the hook (based on his original post). I was just being open minded.\n\nI couldn't account for any comments he made afterward.", "They have nothing to do with my point 😊", "I never said any of that, stop putting words in my mouth. \nIt is not unreasonable for her to want to be platonic friends, but is this the case? You're assuming it is. They talk, clearly there's a line of communication but to what extent do we know there's a friendship? They could just be acquainted, by the sounds of it, I don't think they hang out much at all. OP is allowed to not desire a friendship, it sounds like he's asked her out in the past, she's said during that post break up phase that she was going through that it wasn't a good time for her, and that's all we know. They were \"friends of friends\" prior to this. \n\nSecond paragraph, as far as I can tell from the original post, he didn't expect anything? He was asking the sub reddit if he's an asshole for wanting to cancel after he realised she wasn't treating this as a date. Edit: adding to this. He was obviously hoping she assumed it was romantic, but I don't think there's any 'expectation' anywhere. A stupid misunderstanding, and he bought two tickets, hasn't actually given her anything yet, and now wants to cancel. How is that not fair and how does that make him an asshole? A bit dense, but not an asshole. \n\nYou've type-casted him as an incel, you've created that image in your mind cause this guy had a crush on a girl.", "Its not how I've turned down both men and women but yeah I get that most people would take the hint, but I genuinely think he took it literally. Due to inexperience or whatever.", "there's no fucking hook", ">It is not unreasonable for her to want to be platonic friends, but is this the case? You're assuming it is. They talk, clearly there's a line of communication but to what extent do we know there's a friendship?\n\nIts *quite* clear from her saying she does not want to date OP, yet still seemingly talking frequent enough to be asked to go to a concert and accepting. So even if they aren't 'friends' they're still platonic regardless since she had rejected him multiple times according to the OP.\n\n>as far as I can tell from the original post, he didn't expect anything?\n\n>He was obviously hoping she assumed it was romantic, but I don't think there's any 'expectation' anywhere.\n\nHoping that she understood it was a date, literally is expecting something of her. I don't get how you don't get that.\n\n>A stupid misunderstanding, and he bought two tickets, hasn't actually given her anything yet, and now wants to cancel. How is that not fair and how does that make him an asshole?\n\nIt makes him an asshole because he now wants to cancel after *finally* getting the reality check that she isn't into him via her having a BF now. He invited her to go to the concert, knowing full well she had said multiple times that she wasn't interested in dating him. And for all the very minimal context we have, it's safe to assume she thought this was platonic, but he had a romantic motive. This whole situation is on him not being able to take no for an answer.\n\n>\nYou've type-casted him as an incel, you've created that image in your mind cause this guy had a crush on a girl.\n\nCorrection, I've type casted YOU *and* OP as incels. He had a crush on a girl and then, when rejected, wouldn't take no for an answer. This isn't some sort of love story where she was playing hard to get.\n\nShe. Wasn't. Into. Him. \n\nStop pursuing people who aren't into you and then play the victim like you were used.", "That wasn't clear from the original post.\n\n>So I’ve (23M) displayed interest in this girl (23F) for a couple months now and have brought her food and stuff but we’ve only hung out a couple times recently, we used to be friends of friends for a long time. But anyways she said she wasn’t in the best headspace to date\n\nHe made it clear in the following comments.", "Where's the evidence of multiple rejections? He didn't mention that in any comments or the original post. The closest thing he has said to that is 'displayed interest' and 'made his intentions clear'. That's it. That's what we have to work with. You are the one who has assumed heaps from this: Multiple rejections, 'clearly not interested', 'talking frequently'. We don't know any of this, you're infering all of it", "YTA - as someone who has been this poor girl before, leave her alone. She has made it clear repeatedly that she only wants to be your friend. Then you invited her out (on what she probably thought was a friendly adventure), she agreed and now you are salty that you spent money on it. \n\nI am a woman who tends to be better friends with guys (I’m interested in a lot of things that a predominantly male so that’s just who I’m surrounded with). All but three of my male friendships have been ruined after years of being friends because once I became single all of my guy friends tried to make a move. They then get grumpy that I shoot them down, blaming me for spending time with them. At that point it becomes clear that I am just a sexual object for them and they never wanted to be my friend. It’s extra funny because I’m a bisexual so by their standards I can’t have any friends unless I want to sleep with them (but of course in their eyes women don’t count because homophobia). \n\nIf you can’t be friends with women without borderline harassing them (yes asking repeatedly and trying to pressure is harassment) stop hanging out with women that you aren’t dating.", "You should watch '500 days of Summer'", "Info: what color is your fedora and how many times have you addressed her with a “m’lady”?", "YTA for thinking it was a date in the first place. Why can’t you accept that no means no", "ESH. I don't think the girl gets a pass for accepting a $500 concert ticket. Friends don't buy expensive gifts that big. She knew he had feelings for her and she was happy to take advantage of him. \n\nOP - women don't enjoy hurting men's feelings and also, men sometimes react badly to rejection. For those reasons, women usually do soft rejections. They say things like I am very busy at the moment or I am not interested in dating right now rather than saying I don't want to date you. The thing to understand is that if she is genuinely busy, she will try to suggest an alternative get together. If she turns down alternative suggestions without trying to meet you halfway, she is actually rejecting and you should accept it as such. \n\nAlso, spending big dollars on someone who doesn't reciprocate your feelings or early in the dating stage is very pressuring. You are much better off having coffee or doing fun dates where you can get to know each other without feeling obligated. And lets be real here, you feel used because you felt her accepting an expensive ticket obligated her to take your feelings seriously. Don't be that guy. Save the expensive gifts for when your feelings are acknowledged and reciprocated. Stick to expenditure you won't resent if she doesn't ever return your feelings.", "NTA for  canceling.  She really shouldn't be going to a concert with someone who is interested in her while in a relationship.   She isn't interested.  She may have been keeping you as a back up?  You deserve someone who is into you.", "Let's see, you keep asking despite her saying no many times.  Clearly she has no interest in dating you.   \n\nUntil you suddenly have front row seats(I hope) to a concert she wants to see and now all those no's turn into a yes.  \n\nESH", "NTA\n\nLook it's a tricky situation and we don't know if you were pushy or if she is just taking it slow post breakup \n\nBut either way, no one expects a barely friend to gift them a 500 ticket", "How were you used?  She very clearly set a boundary with you that a relationship wasn't happening, so exactly what did you expect the outcome of the concert to be?  Spend $500 on her and suddenly she would start to develop feelings for you or something?  Nothing has changed.  \n\nNow..  if you REALLY want to redeem yourself... and I know you won't do this, but it's the only way I can see to salvage some degree of self respect that nobody will ever know about but you....  You can tell her that you noticed she was in a relationship with someone now, and if she would prefer to have your ticket so she could take her SO instead.  And that's it.  Expect nothing in return.  No need to \"give her space\", just quit assuming you will ever have a chance and move on with your life.  Be friends with her as much as you ever were and leave it at that.  \n\nAnd someday, when that relationship ends, and she's upset and lonely and maybe even considers you to be a safe harbor for those emotions....  DO NOT take that as an opportunity to make a move on her.   \n\nAnd spending $500 on tickets to anything is stupid.  Yes, I realize it sometimes costs that much... but it's still stupid.", "NTA. Don't listen to all these white knights, if it was me I wouldn't even talk to her that much after this.", "I never said I didn’t want to continue being friends with the girl or expected anything out of the concert other than being friends. However, it’s two tickets, seated together, and we had plans for dinner and all, if that’s not a date I don’t know what is, and I’m still comfortable hanging out with her, I just don’t feel it’s appropriate to take her out like that with her having a boyfriend. The only thing I feel should have been different is instead of saying she wasn’t ready to date, just said she wasn’t interested in me, at this point I’m trying to just take my little sister and let the girl know without being a dick about it, maybe I’ll make it up to her by setting up something where our mutual friends and her new boyfriend can all go do something else in a different setting", "This is also not months and months of this, we’ve been talking and hanging out for about a month, prior to this it’s been about a year since we talked, at which point we had both been in different relationships and were purely platonic. This past month was me talking to her about both of the progress weve made on both our ends, and her messy breakup and how she’s been handling that. To start with she pursuing me, and I took that and ran with it, would bring her food and stuff and make attempts to hang out. Last time was when our plans had gotten messed up and it didn’t work out, so the concert thing was a shot in the dark. I’m the idiot for buying the tickets but at the same time, I feel like she could’ve just said that she wasn’t interested in me and not tried to act like she was just in the wrong space or whatever. I’ve got no intentions of stressing out about it, and I made the post right when I first notice things. As adults I’m sure a lot of you vent and think differently to friends, and yes, even online, than you actually handle those situations and thats exactly what this has been for me. Do I think she had malicious intents, no. But do I think she could have been a little more forthcoming, sure", "YTA. She was very clear that she didn’t want to date you. Trying to manipulate her by spending a large amount of money to put pressure on her is a choice you made.", "You aren’t owed a woman’s attention, personal updates on her headspace or dating life, time or even a polite rejection. No means no, man. She probably told you she wasn’t looking to date anyone because she didn’t want to hurt your feelings. You could have avoided this if you just took no for an answer.\n\nYou situating yourself as a suitor doesn’t get you a guaranteed girlfriend.\n\nYTA.", "INFO: Was the concert explicitly a date? Maybe she understood it as a friendship thing / you having gotten over her romantically & just wanting to hang out.", "YTA\n\nShe told you she didn't want to date you. You pretended yoh were okay with that and pretended to be her friend but you were hiding your true feelings and just waiting for another opportunity to move on her. Now you are mad at her because she was honest, you lied and YOU feel like she was using you?!? How? How was she using you?", "YTA\nWhen someone isn’t interested, not matter what reason they give, don’t try again. Your pushy incel ‘insert niceness to get relationship/sex’ behaviour have backfired. If you took her at her word that she don’t want to date you, (in doesn’t matter what wording she used, anything after ‘no’ is irrelevant) then nothing changed between then and now, when she is dating someone else. But you didn’t take her at her word did you? You thought if you inserted enough ‘niceness coins’ a relationship would fall out. That’s why you feel slighted that she started dating someone else even though it’s a no to you either way. Give your tickets to the new boyfriend. You spend the time to focus on being better.", "YTA \n\nFor being a “Nice” guy and not just being ok with being her friend. Which is what she made clear from the beginning", "“no ill feelings” yeah right…", "Yta", "YTA. This wasn't a date in the first place. Stop harrassing the girl. She clearly doesn't want to be with you. If you are not interested in being just friends, leave her alone.", "YTA It wasn't a date, you just want to pretend that you were betrayed because you didn't respect what she very clearly communicated to you.\n\nCancel it for her sake and get some help.", "Are you 100% sure she's not assuming you're the relationship she's in?  It's Facebook.  It is not real information", "So the ticket was to win her over but now she's no longer interested in you and you can also no longer be friends with her? Okay. YTA.", "Yeeaaahhhhh YTA dude. And you haven’t respected her wishes because you literally keep trying. And if you’re only interested in her romantically, for your own sake, you need to just cut ties instead of attempting to maintain this faux friendship in the hopes her feelings will change. You should give her both tickets so she can go with her BF and you can maybe just think about what you’ve done and how to be a better person? Kidding, but yeah YTA here dude.", "You are very deep into the friend zone, dude. You will never get to date this woman. Cut ties and move on.", "Are you sure that she doesn’t think that she’s in a relationship with *you*?", "YTA. She said she didn’t want to date you and you spent $1000 on concert tickets to try to convince her to date you anyways. Don’t assume if a girl says no she’ll change her mind. She didn’t “use you”, you played yourself for a fool with your inability to say no and entitled belief she would say yes if you kept pushing.", "Who spends 1k on a date? \n\nLet alone it sounds like a first date?\n\nOr even in the beginning.. like wtf", "Take someone else to the concert and stop asking her out.", "Can we please stop pretending that girls are so \"naive\" that they don't know what \"hanging out\" in combo with \"getting  bought food\" means?\n\nDude- she used you. Had a breakup, needed a place to unload all of that, took the food, the time and went to another guy. \n\nYTA. Not because you canceled the \"date that wasn't one\" but because you kept going and going even after months and her telling you something about not looking to date and stuff about \"headspace\".", "NTA, but I'd ask her about it before making a decision.", "It was foolish to ask her to go if you wanted to date her still. She told you she’s not into you, that’s all there is to it.", "Dude.  YTA\n\nShe told you she wasn't interested.  But you asked her anyways.  \n\nYou ***KNEW*** this wasn't a date.  \n\nYou weren't used.  You offered for a ***friend*** to go to a concert and she accepted.  She didn't do anything wrong.  \n\nYou did everything and blame her for using you.  Good lord.  You're acting like you're 13 not 23.", "Nice h j j j", "YTA. Do this girl a favor, and take someone else. You have “nice guy” vibes written all over you. Trust me when I say you will be doing her a favor by telling her you do not want to take her any longer. Save her from having to awkwardly spend hours with you, dodging “light nods” to wanting to date her, and her awkwardly having to shoot you down and explain to you that she has no interest in giving her time to a boy that can’t respect her feelings and keeps pushing. \n\nThis whole thing gave me the ick.", "YTA for thinking you've been somehow wronged here. \n\nWhat you are doing is nothing new. There's always \"that guy\" women run into who can't simply take no for an answer when it comes to dating. They feign like they \"totally\" understand and respect the decision, but continually trickle in little forced affections and opportunities to persuade the girl into dating them. \n\nTake a second and really think... do you honestly think a relationship is worthwhile when one side essentially needs to be convinced to date? You either believe in false ideas that the woman you want just doesn't get how great you are, or your motivations are 100% selfish as you only want what comes AFTER you start dating. (Sex)\n\nFun fact, you are way more annoying to this girl than you think you are. It's not cute, you're not convincing, and you're eventually going to be ghosted or slapped with a restraining order. Move on.", "YTA for assuming it was a date even though she told you she doesn’t want to date. Also, you spent $500 on a concert ticket for someone you barely know? My dude, let this be a lesson to you.", "She gave you plenty of signs that she wasn’t interested. You insisted and insisted and still didn’t get the hint. It’s your fault that you feel used and angry. The concert wasn’t a date. So YTA", "YTA unless you made it clear you intended this concert to be a date. Just because you got a women to agree to plans with you does not mean it is automatically a romantic encounter. We’re you ever actually her friend?", "YTA. She told you she wasn’t dating you.", "YTA.\n\nShe said she didn't want to date you. She was clear. She thinks you invited her as a friend, and accepted under those conditions. You're not the asshole for not wanting to go with her, per se, but you're the asshole for going back on your word.", "who spends 1000 bux on a date???  thats some simpy shit.  Don't do it.", "I mean... was this a date?  You expressed romantic interest before, she said she wasn't interested in dating you and only saw you as a friend.  She's not using you for anything... she's been honest and up-front with seeing you as friends and you've apparently continued to think that this is going to lead to sex/romance in spite of her being up-front about it being friendship and nothing else.  You're not her friend, you're just some stalker hanging around thinking if you act real nice she might decide to date you, even though she has been very clear that she doesn't see you that way.", "She made it clear she didn't want to date....so you proceeded to try to date her then got upset it didn't work out your way. YTA.", "You are what we call typical nice guys. No women are obligated to date you just because you are nice and friendly to them. She had made it clear she wasn't interested in you, and you decided that she was just playing hard to get. Maybe listen to women when they tell you no instead of thinking, you know what they actually want. You're the asshole for thinking you are entitled to date this woman because you were nice to her.", "You're an asshole, but generally so, not because you don't want to pay $1000 for a \"date\" when she doesn't see you as a potential romantic partner. Because she was very clear that she wasn't interested in you, this was never a \"date\".", "YTA, and you should probably learn to accept no as an answer.", "When a woman says she doesn't want a relationship she means not with you. \nNever spend that kind of coin on anyone if it's that big of a deal and certainly not on someone you're not seriously dating.", "This dude is like so toxic, and he'll definitely play the victim when the girl (inevitably) rejects him. Maybe this is why she isn't dating him. Dude's a walking red flag.", "I agree, though I don’t know that *bribe* is the exact right word—*pressure* her into a relationship is more like it. OP gives off a very similar vibe to the dudes who take women out to really fancy bars/restaurants and then get mad when the women don’t want to go straight home with them, as if the amount of the restaurant bill entitled them to sex. OP sounds like he was hoping the girl would see how much money he was dropping on the concert and think, “Gosh, he spent all this money on me, I guess I have to be his girlfriend now.”\n\nIt’s an incredibly immature and simplistic thought process even for a 23-year-old, though unfortunately there are plenty of dudes twice his age or older who are no better.", "She's not an asshole for shutting it down, and telling OP she's going to a concert for free? \n\nThis is like women who go to bars and flirt with men for free drinks while in a relationship. \n\nOP isn't a saint - it's clear he's in the wrong here. But the girl he's pushing for shouldn't have accepted a 500$ gift if she's not interested in paying him back or dating him.", "AH. Fake nice guy that won't take no for an answer. Women aren't machines that men can insert niceness into and then get back relationship/intimacy.", "Don’t spend $1000 on people you’re dating either. Sheesh.", "She’s said no to him repeatedly and he’s said he’s understood. She’s being naive (as I have once been) but in my experience, she is just assuming that men don’t lie to try to get in your pants.", "Or she thought they were going as friends??? Have you only ever been to concerts with romantic partners?? \n\nI have absolutely bought concert tickets for friends and gone with them (though they were a lot cheaper)", "If you look at his post history, she has said no repeatedly. He thinks no means try again in two weeks, not no.", "They aren’t dating", "It's not as date when both parties haven't agreed to it being a date, I don't know where you're getting this from. Two friends going out for a fun time doesn't mean it's suddenly romantic lmao. \n\nBut either way, agreed that he should cancel it, but he feels uncomfortable for the wrong reasons.", "Bruh she didn’t take a banana against the back of his head and say “you either take me or I will make you’re head a banana split”", "\"it’s two tickets, seated together, and we had plans for dinner\" \n\nI've done that way more often with friends than with guys I dated.", ">if that’s not a date I don’t know what is\n\nBut she said that she didn't want to date you, you knew that she wasn't interested.\n\n>I just don’t feel it’s appropriate to take her out like that with her having a boyfriend\n\nBut it was appropriate to lie to her about your intentions before there was another man involved? She can't make her own decisions but as soon as there's another man in the picture you're all about respect?", "So in summary, you don’t care when she says no, you only care when she’s with someone else. Nice job.", "> I never said I didn’t want to continue being friends with the girl or expected anything out of the concert other than being friends\n\nThen you wouldn't cancel if you're just friends.  \n\n> However, it’s two tickets, seated together, and we had plans for dinner and all, if that’s not a date I don’t know what is\n\nThen yeah you really don't know what dates are.  \n\nIt's when two people agree it's a date.  Nothing more.  Nothing less.  \n\nYou invited a friend to a concert.  You two didn't discuss it being a date, so it's not a date.  \n\nYou're completely incapable of interacting with her as a friend without trying to find some loophole you think exists to make it a date.  This is severely unhealthy.  \n\n> I’m still comfortable hanging out with her, I just don’t feel it’s appropriate to take her out like that with her having a boyfriend.\n\nSo you're unable to act as a friend if she's taken.   Definitely not NG....\n\n> let the girl know without being a dick about it\n\nThere's no way to achieve that.  Just tell her the truth so she can break this friendship off.  She deserves to know that you can't respect her as a person.", "a date is when s someone says “i want to take you on a date” and the other person says yes to that. going to a concert is going to a concert. “do you want to go see this artist with me?” is asking someone to a concert. food is something we eat every day and can choose to with other people. did she ask what she owed you? did you say you had it covered? one summer i became friends with a regular at a bar where i worked (both bisexual women). she ended up getting expensive stadium tickets for both of us, for my birthday, when i was so broke i was about to leave that city and move back home. we got food first and drinks after. she insisted on paying. i was guiltily grateful. it wasn’t a date. (included how we met simply bc a lot of sexual/romantic relationships start that way; my live-in boyfriend was once my bartender at the movies. he asked me on a date eventually. she didn’t. hanging out with others is normal and possible.) happens all the time", "Yup that girl already had to deal with op enough/s", "> This is also not months and months of this, we’ve been talking and hanging out for about a month\n\nAnd you dropped a grand?!?!\n\nThat's insane.  \n\n> To start with she pursuing me, and I took that and ran with it, would bring her food and stuff and make attempts to hang out.\n\nConsidering you don't think two friends can have dinner or go to a concert, I highly doubt she was actually pursuing you.   Just being friendly and trying to get to know you *as a friend*.  \n\n> I feel like she could’ve just said that she wasn’t interested in me and not tried to act like she was just in the wrong space or whatever\n\nShe had a messy breakup.  She likely was in a bad headspace.  It's pretty common to feel that way and sometimes someone that clicks even with the bad headspace comes along.  \n\nIt doesn't mean she lied.  It means she liked the other guy even more than the bad breakup messed her up.  \n\n> Do I think she had malicious intents, no. \n\nWell now you're lying.  You said in the post that you felt used.   \n\nYou're backtracking to not look like a NG.", "Can you genuinely not tell what you did wrong or why this is an asshole move?\n\nDid she ask you to buy those things or spend that money on her? \n\nDoes she owe you something, because you chose,  _of your own free will_ to spend that money?\n Even though she directly told you she did not want to date, nor was she even considering doing so at the time?\n\nFinal question, did you make it explicitly clear to her that going to the concert would be a romantic date and not a platonic hang out?", "Here’s a tip for you: no means no. No doesn’t mean try again in two weeks. No doesn’t mean spend a thousand dollars on someone to guilt them into sex. No means no. \n\nIf you can’t get over her and be her friend, leave this poor girl alone.", "Nice guy syndrome.", "YTA. She told you repeatedly she didn't want to \"date\" you, so you figured you'd impress her by spending lots of money on concert tickets so that YOU could pretend it was a \"date\".", "> my last shot I took at it was basically saying I didn’t want to push but that I liked her \n\n***Last shot***\n\nSo you admit the concert wasn't a date and you're canceling it out of spite?", "Except he would still be just a friend.  It takes two people to agree for it to be more.  She turned him down.  \n\nIt doesn't matter if he expressed interest if she said no.  He's still just a friend.  \n\nIf you really think wanting to be more than friends makes you on a special level above just friends, then you need to go out into the real world a while.", "“This woman has told me for months she’s not interested in dating me. I figured I would trick her into a date by offering tickets to a fun concert, then she has the audacity to go and date someone else! Now *I* feel tricked! That wasn’t supposed to happen! :(“ — OP", "He 100% seems like a stalker to me.\n\nThis entire account is one sided and extremely unreasonable.", "I knew a guy like that when I was like 17/18, he bought me tons of stuff to basically try to bribe me into dating him, even though I, both of his cousins that were actually my friends, and several of his friends frequently and frankly told him that I was absolutely not interested in him, he's way too old for me, I didn't actually like him as a person, and I only tolerated his presence because of how much I adore his cousins. \n\nHe was SURE that the next expensive costume piece or dress was going to be THE ONE that changed my mind and won me over.  \n\nNope. He moved on after a few years, I think I got too old for him to be interested. 20 years later, I'm still friends with both of his cousins, so I know he's still single and creepy, and still fixating on a new legal but too young for him, ginger every few years. \n\nWhy are sides like this?", "I’m pretty sure if we had the other side of this story, we would be even more flabbergasted.\n\nBut op admitting to spending $1000 unprompted was the only hint we needed that he’s perhaps a bit unhinged.", "It’s delusional and manipulative.\n\nThe sheer amount he spent makes me question his mental health, honestly. This is honestly a bad situation.", "And some reasons make a person an asshole.", "And she already told him many times before that she didn’t want to date him, only to be friends. She (naively) thought that men listen when you tell them that and agreed to go to a concert with him. He is the asshole for trying to make a move after she has repeatedly told him no.", "She didn’t ask him to buy anything. \n\nHe invited her, while understanding the terms of their relationship. That’s on him.  There’s nothing to even suggest she knew how much the tickets cost. She just agreed to his invitation.\n\nIt’s a mess entirely of his making.\n\nI’d agree with you if she asked him to get the concert tickets. But she didn’t even do that.", "She repeatedly told him that she just wanted to be friends (by OPs own accounts). He then made the decision to buy concert tickets for her (something that I have done for friends though they were closer to $100) and then got salty when turns out she was in fact not in love with him (as she has stated several times before). \n\nAs a woman who has been in this situation many times, if he hasn’t started harassing her yet, he will.", "Yes.  She needs to know that he's such a creep.", "No means no, not try harder.", "Nope.  I have never gone to a concert with friends that we didn't pay for our own tickets.", "Ok but either way, he's not TA for not taking her to the concert.", "Trying to take a girl who said no to him to a concert under false pretences is definitely creepy. And it IS under false pretences. If it’s not, it wouldn’t matter she had a bf or no. They would be going as friends.", "Exactly lol. I’ve been to exactly one concert with a partner, every other one was with friends (and we were standing together and got dinner before)", "Seriously.  I've gone with several guys and girls on outings like this.  Wasn't dating a single one of them.  \n\nWe were friends acting like friends do.  If one had told me we were dating because they tricked me into an outing, I'd cut them off.", "I mean, in this case I don't disagree he pushed it too far, but I met a girl who had just broken up from a long term relationship and she told me she wasn't looking for anything right now. A few months later she messaged me back to ask to hang out. That was almost 10 years ago, been together ever since. We've been married for 5+ years with 2 kids and life couldn't be better. \n\nWe can't tell him to on one hand listen to what she says and back off, and on the other hand tell him to ignore what she is saying because it means something else.", "I didn’t say he was smart. I said he wasn’t a friend. Obviously he can’t just be that", "Lol that last paragraph…just wow lol. \n\nI think they will never be platonic friends because OP doesn’t know how to be just a friend. That’s more than obvious based on his story, no?", "A couple times I would tell guys I had a boyfriend, because I did, and they would say “I don’t believe you!” Ok buddy, so either I do have a boyfriend or I’m lying in order to not talk to you anymore — your pick.", "I can absolutely picture this guy trying to get snuggly at the concert and/or making advances in the car after (especially if they decide to hang out in the parking lot and wait for the traffic to subside) and then throwing a tantrum and bringing up the cost of the tickets when she inevitably rebuffs him, and reminds him she's not interested and thought they were going as friends.", "This. Just this.", "He need a therapist not a gym membership. Don’t convince crappy guys that they need to be hotter. They need to be better.", "No, based on his comment history, he was borderline harassing this girl. He doesn’t need to get hotter, he needs to go to one of the first year uni seminars about consent.", "Wild. First concert I ever went to was with my childhood best friend and she paid. Second time, I paid. The only concert I’ve been to with a partner we each paid our own ticket. \n\nJust because someone pays for your tickets (or drinks or food or anything) doesn’t mean it’s a date. Unless you are with a prostitute, money doesn’t buy sex (or romance).", "Well he’s the asshole for trying to buy the tickets to guilt her into dating him. He’s also the asshole for only taking her no’s seriously when there is another guy in the picture. Essentially, he is the asshole for harassing her.", "Nice job admitting that you also harass women.", "If he’s made his intentions clear repeatedly, but she still agreed to go to a concert that she had to have known would be super expensive (based on whoever it is they’re seeing), then she would have known he was asking her as a date and If she agreed to go, while dating someone else, then she did take advantage of him for a free concert. He’s asked her our repeatedly and she would shut him down. She knew this wasn’t 2 friends hanging out.", "She has made it clear that she isn't interested in him at least right now. He is being a pushy asshole who asks multiple times after getting an answer that he didn't like. \n\nIf she was interested in a few months, SHE will show interest in a few months. That doesn't mean pester her until she says yes.", "But in your situation, it did mean she didn't want to date you, it didn't mean anything else. She changed her mind later, I'm guessing partly because you respected her no and didn't push, but it doesn't change the fact that the initial \"I'm not looking for anything right now\" meant \"no, I don't want to date you\". The no always means no, and people can change their mind later, but pushing past the no is a very good way to turn a conditional no into a permanent no. Doesn't change that the no should always be taken at face value until it freely and without pressure becomes a yes", "Yeah but you respected her space.  \n\nThis girl OP has been talking to for the entirety of a month, he asked multiple times, and claimed after he *\"last shot\"* he kept dropping hints and \"light nods\".  \n\nHe did need to back off on the hints.  He didn't.  He shot himself in the foot.  \n\nYou backed off and she messaged you.  You showed respect.  \n\nWhether or not she means the line to gently say no or really isn't in a good headspace doesn't matter.  The response is the same - back off.  Either she decides to pursue it or not later on.", "You’re really digging your heels in, aren’t you?", "That’s kind of how this place works.  The OP paints themselves in the best possible picture and we judge filling in the missing details.  Personally if he didn’t say I thought she had changed her mind because she was flirting with me all the time then that probably didn’t happen.\n\nIf the OP believed he hadn’t been friend zoned and his goal wasn’t to change her mind then it would be stated here.\n\nLet’s look at this situation from the women’s point of view\n\n- she told this person she didn’t want to date him\n- she accepted going to a concert with her friend\n- she started dating someone else.\n\nWhere is the issue with what she did here?", "Would being more direct be better?  Sure. Would it have changed the situation at all?  Probably not.\n\nIf the OP was neurodivergent then I would be more understanding to him missing the cues. \n\nNo does not mean try harder.\n\nNot in the head space to date does not mean spend $1000 on me.  Even if he was just hanging around friend zoned waiting investing $1000 on that chance is foolish and certainly is smart.\n\nWhat did the women do in this situation\n\n- she said she didn’t want to date him\n- she accepted concert tickets as a friend\n- she decided to go out with someone else\n\nIn what world did she do anything wrong?", "Honestly not as bad as I expected.", "Lol, that’s some strong projection there.\n\nLots of women like to play the “let’s see if he’ll actually pursue me” game. \n\nGiving a girl some time and then revisiting the conversation at a later date is not harassment….but it’s now reached the point that OP needs to move on.", "Yes, I said he pushed it too far, he was a pushy creepy dude. Did I say he should keep pestering her? No. When my wife told me the same thing  l told her if things change for her reach out back to me if she wanted to, and didn't talk to her again until she did. \n\nAll I'm advocating for is actually listening to what a woman says and not trying to say \"if she tells you one thing it really means another\". Listen to what people tell you and act accordingly.", "I never said her no meant anything but no. \n\nListen to what people say, believe them, and act accordingly.", "I have only dated one guy after he repeated showed interest because I had got myself into a situation where I felt unsafe saying no. I have had to cut many friendships because of men like you.", "I disagree that it wasn’t clear.\n\nI think OP left the dating conversation with the girl clearly understanding they are not dating right now.\n\nBut yeah - peoples lives are crazy! Have a good one!", "Here’s a secret:  those dudes were never interested in just being friends.  \n\nSounds like you just wanted to use them. \n\nDon’t try to act like they’re the bad guys when you probably strung them along.", "You’re probably right, they were never interested in being my friend. I was friends with the one for 5 years and when I became single (after a long term relationship) he made a move. I politely declined. Then made another move a month later and then every other week until I cut off the friendship. \n\nAnother was my friend for a year and then made a move when I became single. He’s the one I ended up dating for a bit because I felt unsafe saying no. \n\nAnother, admittedly made his intentions clear after about 3 months of friendship at which point I declined. He only actually tried a couple more times and we ended up being friends after that. \n\nThere was another one that I was trapped with (working in a remote community) and I declined about 5 times and then he sexually assaulted me. \n\nI could keep going on. For about the past 3 years, I have never let a man pay for anything for me because so many of these guys would throw what they spent on me during our friendships in my face (never mind that I also paid for stuff for them). Even in committed relationships we split bills or it’s every other. I’m done being pressured into sex because someone bought me beers on a couple occasions.", "If you read OPs comments, the girl was abundantly clear. He is refusing to take no for an answer."]}