{"id": 15118, "submission_id": "12qxhzz", "title": "WIBTA if I told my landlord his health problems are not my problems?", "selftext": "I live in a pretty run down apartment building. Its 116 years old.  Ive been in my apartment for 15+ years and in that time, nothing has been upgraded, its a complete dump, and even worse, no regular building maintenance has occurred. \n\nMy landlord never fixes anything. If I dont fix things on my own, they will not get fixed.  I went almost 10 years with windows that were falling apart from dry rot, waiting for him to fix them. I finally took rent money and paid someone to fix them. \n\nCurrently, it is raining in my kitchen. There is water coming in through the ceiling in one spot. One of the bedrooms is also unusable because there is a water leak so bad, fungus is growing on the wall inside. Ive been telling the landlord since January about these leaks and the only response I get is \"Im sick, be patient.\"\n\nAbout 1 year ago, he was diagnosed with a \"blood disease\". This is all I know. We are not friends, we've had a pretty terrible relationship due to his being consistently difficult over the years regarding maintenance and other illegal things he has done. (Throwing away everything stored in the basement, clear cutting the yard and throwing away furniture and plants for no reason and with zero notice).\n\nI want it to stop raining in my apartment. \n\nThe city I live in has very good renter protection, and if I filed a complaint with the city, its very likely they would make him give me a monetary settlement.\n\nIm tired of being \"patient\" when I have fungus growing in a bedroom. We have a business relationship, and Ive never stopped paying rent, yet he does nothing. No property manager or anyone to do anything, ever.\n\nSo WIBTA if I told him Im tired of his lack of care and Im going to the city to file a complaint because enough is enough? If hes too sick to take care of his building, he needs to hire someone. His illness is not my problem.\n\nEdit: thanks to everyone for helping me see that I WNBTA. Im probably not going to reply to anymore  comments. Check my post history if you have a question, Ive probably answered it.\n\nIm not going to post to r /legaladvice. I know Im legally justified if I file a complaint. That wasnt my question. My question was ethical regarding only doing it while he is sick.\n\nThank you all.", "created_utc": 1681839143, "permalink": "/r/AmItheAsshole/comments/12qxhzz/wibta_if_i_told_my_landlord_his_health_problems/", "score": 386, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Filing a legal complaint against someone who's supposedly fighting for their life might be an AH move.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YWNBTA\n\nAs you mentioned, it's a business relationship, not a friendly one. He's still making money off of your rent, why can't you get what you are paying for?\n\nGive your landlord a warning, and if he still doesn't do anything definitely file that complaint.", "NTA but be ready to have a backup place to move. Chances are you really wouldn’t want to live there after doing all that.", "[deleted]", "INFO: Is there a reason you've stayed there for so long? Are there so few options for apartments in your area? This just sounds like a miserable place to live so idk why to try and make it work rather than move.", "NTA.  File the complaint.  You would be doing him a favor since the building will degrade over time without maintenance.", "I am a person who has a condition called prosopagnosia, which made it hard for me to be successful in my chosen profession- teaching. So what did I do? I changed what I did. I started teaching online. I sure as hell did not just say ''sorry kids, I am sick so you can get rekt.''\n\nYour landlord needs to do a job he can do. File that complaint. Lawyer the fuck up and shake him down. NTA.", "NTA!! I know it’s hard but please stand up for yourself 🙏", "NTA that’s literally not safe", "YWNBTA, NTA -- File today. You are tolerating intolerable conditions. Prepare yourself: On the city form specify the dates/times you notified him of a problem and requested service....go back as far as you can. His illness is a personal misfortune but he is legally responsible to provide repairs and housing that meet legal requirements.  Track all aspects of your complaint and respond quickly and thoroughly.", "NTA, but rather strange for having lived in this type of place for so long.\n\nDon't bother telling the landlord, just go to the housing board. However, make sure that he can't legally use it against you to evict you, but still have a backup plan for alternate housing. You may also need a place to stay during renos. Get all the legalities together regarding your rights and obligations as a tenant and learn about those for landlords. It's important that you know where the situation stands. Considering the condition of your apartment, I have a feeling your landlord either has no clear idea of his obligations or he does and is actively refusing to comply. That too will have to be teased out.\n\nDon't be surprised if you get a hefty rent increase proportional to the renos done, that is if they get done.\n\nGood luck", "NTA do it", "NTA. He has a contractual obligation to provide rental premises that meet the terms of the contract. Additionally, he is responsible for upkeep and repairs to maintain a safe living environment. Mold could be deadly. Water could cause property damage. \n\nIt’s unfortunate he’s ill, but in that case he should find a property manager or some other arrangement to make sure he can fulfill his duties as a landlord. \n\nI would make sure to keep it professional and just mention the lack of maintenance and things he’s told you that suggest he no longer has the ability to fulfill and perform the required upkeep and maintenance. Say that unless he commits to fixing these issues in a timely manner to prevent potential health concerns or property damage, you’ll unfortunately have no other choice but to seek help outside of this landlord/tenant relationship. \n\nDocument, document, document. Protect yourself. Send all of your issues in writing (even text is fine) or if it’s a phone call, follow up with a written summary of “hey here’s what we talked about”.", "You're NTA but you need to move. If nothing has changed in 15 years it won't change now. He may sell the building (sounds like it needs to be condemned) if presented with a huge maintenance obligation. I'd be ready to move in general regardless of the outcome as he may find a reason to evict if you complain. I know you mentioned rent control as a reason to stay but by the state of the place it sounds like your health may not tolerate you staying.", "NTA.  You are living in a toxic waste dump, not an apartment.  Make sure you have documentation of the conditions, your complaints to him and his responses.  Good luck.", "NTA", "NTA. You both are accountable in the contract of renting. He isn't holding up his end and so, you were forced to make claims against him. Mold, mildew and fungus? Property destroyed and not replaced? Uh un. That's unhealthy as well as plain nasty. Raining in your apartment? The apartment isn't habitable as it is and you are paying to be treated poorly.", "He's had years to maintain the apartment which he didn't do. That has nothing to do with his illness.\n\nIf he doesn't pay for for someone to fix these problems, you're in your right to file a complaint.\n\nAlso, he never felt sorry for his paying tenant to live in a dump.\n\nNTA", "NTA. \n\nThat said, I think first I would talk to your super along the lines of, \"I’m terribly sorry for what you’re physically going through.  If there's anything I can do, please let me know. But I need this fixed. I really don’t want to go outside you, but at this point I don’t know if I have any other choice. Please tell me I have one.”  I have turned 2am partying neighbors into silent moths by bringing them homemade soup.  I have found, in my own experience, that starting off with super niceness and a gift, cookies for the super, soup for the neighbors, does wonders.  Sometimes not, but a good 80% it does. \n\nI'm your same position, apartment-wise.  I've lived where I am for forever, am rent stabilized, and the last thing I want is to piss off my building management, super, or neighbors.  I mean, seriously, I’m the first person management would want out.", "NTA. Of course you aren't the asshole.  I'd go one step further, since I've had landlords like him: **he's saying this to make you feel guilty**. Stop being guilty.  Do what you need to as if he had never told you that hint about his health problems at all.  If you had a \"blood problem\", I'm certain you wouldn't be able to avoid paying your rent for a year.\n\nEdited for clear judgment.", "[deleted]", "ESH\n\nMove out dude. You've been there 15 years, what do you expect to change?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live in a pretty run down apartment building. Its 116 years old.  Ive been in my apartment for 15+ years and in that time, nothing has been upgraded, its a complete dump, and even worse, no regular building maintenance has occurred. \n\nMy landlord never fixes anything. If I dont fix things on my own, they will not get fixed.  I went almost 10 years with windows that were falling apart from dry rot, waiting for him to fix them. I finally took rent money and paid someone to fix them. \n\nCurrently, it is raining in my kitchen. There is water coming in through the ceiling in one spot. One of the bedrooms is also unusable because there is a water leak so bad, fungus is growing on the wall inside. Ive been telling the landlord since January about these leaks and the only response I get is \"Im sick, be patient.\"\n\nAbout 1 year ago, he was diagnosed with a \"blood disease\". This is all I know. We are not friends, we've had a pretty terrible relationship due to his being consistently difficult over the years regarding maintenance and other illegal things he has done. (Throwing away everything stored in the basement, clear cutting the yard and throwing away furniture and plants for no reason and with zero notice).\n\nI want it to stop raining in my apartment. \n\nThe city I live in has very good renter protection, and if I filed a complaint with the city, its very likely they would make him give me a monetary settlement.\n\nIm tired of being \"patient\" when I have fungus growing in a bedroom. We have a business relationship, and Ive never stopped paying rent, yet he does nothing. No property manager or anyone to do anything, ever.\n\nSo WIBTA if I told him Im tired of his lack of care and Im going to the city to file a complaint because enough is enough? If hes too sick to take care of his building, he needs to hire someone. His illness is not my problem.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. It's never wrong to report a landlord for this kind of thing. He chose to become a landlord, he accepts your money for doing nothing and contributing nothing to society. You would be within your rights to sue him without giving any thought to his health problems.", "NTA \n\nIf he cannot manage the building due to his poor health, he needs to sell it.  You have given him plenty of chances to fix this, he did not.\n\nFrom what you describe it is probably not healthy to live there, beyond the inconvenience.\n\nReport it and get out.", "NTA, report it. Where I live that house would be deemed unliveable and you could withhold rent until it was fixed.", "YWNBTA- that's why contractors exist. Place probably has mold now too.   \n\nSome states and parts of the world allow you to withhold rent until the apartment is liveable again. Might want to check that out.", "obviously NTA, but why don’t you keep just asking him if you can use rent money to get it fixed? Obviously it’s not ideal and he should be the one to do it, but sometimes that’s the price you gotta pay to live somewhere cheap unfortunately", "I have a friend who filed a complaint with the city because of a lazy landlord and the city came and condemned the property. So she got excellent revenge on her landlord….but she also had to find somewhere new to live on short notice.", "Thabks for your advice.\n\nOur city has laws against retaliation. \n\nI would not be able to move, financially. \n\nIDK what escrow is, or how it applies to renters.", "He could hire someone to be apartment manager and fix it person.", "I live in a city with extremely high rent and lack of availability. We have rent protectiona which keep rent from rising after you move in. \n\nIf I was to move, in this city my rent expense would be 2.5X what I pay now. I cannot afford that. Leaving the city isnt a option right now, as my career is location based and my whole life is here.", "Well, its really not strange in the city im in.  High rents and lack of housing. \n\nIf I could move to a better place without my rent doubling or tripling, i would have moved a long time ago.  Also we have good laws so he cant raise the rent for (what should be) regular maintenance. Thank you for your advice.", "Thank you. Yes all of the complaints and communication are in writing. I never talk to him in person. I have pictures of everything.", "Moving is not an option financially. I would make myself homeless by giving up my apt.", "By super you mean superintendant? We dont have one. There is only 1 owner, the landlord. He has no employees.", "Because the city I live in has an extreme housing shortage and is very expensive. When you find a good deal, you stay for a long time. Everybody here does it.", "Hes in sanfran and wants cheap rent but not live in a craphole to keep it cheap", "[deleted]", "Gotcha, def WNBTA. These conditions are beyond. I'd suggest giving him written warning before proceeding but you definitely need to take action.", "With all due respect, is your career worth it if you can't even afford to live in a place that isn't a serious danger to your health? fungal spores in the air are going to soon give you chronic respiratory illnesses which will mean expensive doctor visits, and  the place will eventually literally cave in from water damage and the fungi eating the wood. Not to mention that money that you are spending yourself on fixing these problems could also be put to finding a better place that will fix these issues.", "[deleted]", "My pleasure.\n\nI had a landlord who one year was planning on landscaping the front garden and decided to increase the rent before doing anything. You can be sure that I swiftly refused to sign for that increase. I contacted the housing board and the confirmed that a rent cannot be increased in anticipation of a project and outdoor landscaping cannot be counted into a rent increase. Every year I would calculate what kind of increase should be applied by seeing if school and municipal taxes had increased and by how much, then applied that against my portion of the building. The housing board would also publish ballparks for rent increases depending if you paid for amenities separately or if it was included in the rent. With that info detailed in a counter offer letter, he always accepted and never countered my counter. I managed to keep my rent very reasonable over many years.", "[deleted]", "I get that, but you might have no other option. Is it bad enough it could be condemned?", "Which kind of sucks because there's no middle ground between the person who takes care of your digs and the law. Still though, I suggest super kindness, maybe with the inference that he could find someone to fix the issue, so you didn’t have to call services, coated in caring, it could help.  And if not, you know, for sure, you tried everything possible before doing so. There can be no guilt in that.", "Ah. Ok, I understand escrow now. \n\n Where I live we have a city agency for rent protection. And no worries on the lease renewal. Here everyone goes month to month after their initial lease expires. Thank you for your advice.", ">With all due respect, is your career worth it \n\nYes. The city is expensive. You have to be making $200K to be of average wage here. I am far below that. I dont spend my own money fixing things, I take it out of the rent.", "Fixing the roof wont affect the other tenants. Regular maintenance cannot be used to raise rents in the city I live in. There are very steict laws about how much rent can be raised", "Not for maintenance. Thats not the way the laws work in our city.", "Im concerned about that. My neighbor in the building and I were wondering if that is his end goal. To just let the building get so decrepid it has to be condemned, and then he could sell the land.", "Basically money held in trust until a contract is completed. Or in your case necessary repairs completed. This way neither the tenant or landlord can play games", "That just means your landlord can kick you out with a months notice if he wants to …", "It's a real possibility. It may be good to look at a few options just in case.", "Not in the city I live in. You can only be evicted for not paying rent. Its almost impossible to evict people here for any other reason.", "OP NTA. File a complaint and make sure your place in habitable. He either fixes what he owns or sells to someone that can keep up with the maintenance.", "YWNBTA if you told him \"Hey man this is getting ridiculous, either I pay to fix this and deduct that from the rent with an invoice, you get somebody here (insert reasonable timeframe for your area) to fix this, or I'm filing a complaint.\"\n\nThat's both fair to the landlord and fair to you. Sounds like he might be dying, your comfort is understandably low on his priority list. But, be ready for that to be the end of your days living there. You need to start making plans to leave. I've seen your comments about the rent control and rents in your area, and I hate to say but it sounds like you have an untenable living situation that is likely to disappear here soon. Either from landlord dying, landlord finding a way to terminate lease, or you needing to move because mold and such will start being a real health issue.", "Nta\n\nDouble check with a lawyer on this one, but in the US I believe you can withhold rent (provided you place what would be the rent payments in escrow) until things like that are fixed. \n\nLike i said, double check with a lawyer and file the complaint with the city before doing anything like that. \n\nIf he's too sick to fix the problem, then he needs to *pay* someone to fix the problem for him.", "NTA. It sucks that he’s so unwell, but, as someone who works in housing, I’m here to tell you he’s in violation of your lease agreement without even having to look at it. The issues you’ve described here would immediately call for an inspection in my field and the LL would we held 100% responsible for repairs. If he’s unable to fulfill his duties as a LL, he shouldn’t be a LL. *YOUR* health is at risk right now living in that apartment. You need to talk to him about repairs. If he doesn’t do anything, you need to talk to a tenant’s union or legal service. Again, it’s unfortunate he’s so unwell, but you’re going to be unwell too if he doesn’t start doing his job.", "Not only WYNBTA for filling a complaint, you'd also not be the asshole if you end up withholding rent from him as well since it sounds like the apartment is not safe for you to live in.", "NTA: if your landlord can’t take care of the property or can’t afford to hire a company to do so, they shouldn’t be a landlord. \n\nI had a landlord get mad once I called the gas company over a gas leak and he got fined for it, he said I should have waited because he was at church. 🤨", "The landlord tenant relationship is explicitly exploitative. Fuck your shitty slumlord as hard as you can, get what you need by any means necessary. NTA, take legal action now", "Move....", "NTA...\n\nBut why oh WHY for the love of all that is holy do you continue living there... for FIFTEEN+ YEARS???\n\n\n.", "NTA. Landlord is obligated to ensure your building is to code and habitable. Not sure where you live, but check your count or city ordinances, or state laws regarding this issue. IANAL, but the one I work for checked up on this for me for a similar issue. Bottom line was, I could legally withhold rent and use that money to make repairs. Good luck.", "Yup, a tenancy is a contract, and the landlord is being paid to provide a safe and livable apartment. Mold and water coming in make it not only unpleasant but unsafe for OP’s health and damaging to their possessions. \n\n\nIf the landlord is too sick to visit the property and can’t fix it himself, it’s his responsibility to hire someone who can. That is what you pay rent for and he is not meeting his end of the deal.", "How friendly is it for the landlord to leave tenants in a shit hole?\n\nLandlords illness is not an excuse. If the place is too much for landlord to manage, then the remedy is for landlord to sell out to someone who can manage it.\n\nLandlord has legal obligations, which he has failed to meet for years.\n\nThis isn't close. OP should have made complaints long ago.", "I do not have roof fixing money.", "As ive said in other comments, its a very expensive city with very limited housing. You cant just move, unless you want your rent to double or triple.\nWe have excellent tenant laws in this city. In all the years ive been here my rent has only gone up $100 from the price it was when I started my tenancy.", "I agree, but OP mention that the land lord is being paid a fraction of what they could be getting tomorrow if OP moved out. I think this is probably on purpose, OP is paying very little rent so the landlord doesn't care (and would probably prefer) if they move out. OP should file the complaint, the land lord won't do anything unless they're forced to.", "If there’s already mold, I think that OP has more than waited long enough to file with the rental board. He should have corrected the issue long before mold grew. With his health issues in mind, having official oversight is probably necessary because once your walls grow mold, major work is needed to make the unit habitable again (if ever!)", "If I had to guess he's probably making very little (compared to market rent) off OP. He's probably hoping they'll just move out, then he'll fix up the place for the new tenant paying 2023 prices. I wouldn't be surprised if he's leaving the place in disrepair on purpose to try and get them out.\n\nEdit- OP mentioned that comparable apartments are 2.5x more expensive now, so I definitely think they're trying to get them to move out, or at the very least they don't really care about keeping OP happy as a tenant.", "Ah, k. That makes sense. He's probably itching to get you out and leaving the apartment in poor condition, hoping you'll just leave. You're NTA, but if he'll probably do what he can to get you to leave if he could fix up the place and get 2.5x the rent.", "oof good point. anything you can do about the fungus? I’m sure there are anti fungal sprays at least and a dehumidifier", "I really dont think thats it. There are currently multiple empty apartments in the building just because he has no landlord or management skills. When theyve come up.in conversation he says stuff like, \"yea I should get around to renting those out again someday\".", "thats kinda the point i was getting at. a 40K average salary where i live in the midwest US where i live will get you reasonably nice apartment in a nice neighborhood that doesn't have mold growing out of the ceiling or roaches in the walls or gunshots outside", "I dont have roaches, and my neighborhood has gotten so gentrified you barely ever hear gunshots anymore. \n\nFWIW i moved to the city im in from the midwest. I moved away because I did not like dealing with the racism, the closed minded people, the lack of culture, lack of excellent concerts, lack of varieties of other country's cuisine. I dont like winter and hope to never be in snow again. 40K in the midwest is MUCH harder to make than 40K where I live now. The city I lived in in the midwest had much more gunshots and violence than where I live now. I live in CA now and its the best state in the country. IMO", "perhaps, but again, your home isn't really livable and doesn't sound like it will be. if your city is too expensive to live in without having to live in mold and worry every night about whether the ceiling is going to collapse on you(if you're seeing fungi growing out of the walls, the water damage and fungal damage is already extensive), perhaps consider moving out of the city to someplace less expensive, because sooner or later the costs to yourself are going to outweigh any lingering benefits.", "So I mean this as gently as possible, but you clearly don't understand California housing and cost of living issues. To get to somewhere \"less expensive\" outside of either the bay area or LA you'd have to go minimum two hours' drive away, so people who can't WFH have the option of having roommates/dealing with shitty housing, or taking on insane commutes. Some types of jobs we have in some of these areas aren't readily available elsewhere. \"Just move somewhere less expensive\" is not even remotely a solution.\n\n(Especially given the current political situation and the ever-increasing restrictions on reproductive rights and queer/trans rights at the state level, many people need to think very carefully about whether it's even safe for them to move to certain other states.)", ">perhaps consider moving out of the city to someplace less expensive\n\nNah. I live in the best city in the country, in the best state in the country. I dont want to live anywhere else in this country. My entire life is here. The mushrooms are only in 1 room, lol. \n\nThe only problem is the lame landlord.\n\n People get 5 figure settlements when they file complaints for something like what Im going through. I just feel like I WBTAH because hes sick. I never asked for opinions on if I should end my whole life here and move to some miserable state just because its cheaper.", "You're assuming he has five figures to pay. \n\nYour rental is falling apart- that's going to cost him many times what the cost of just fixing it would be in the long run. \n\nBe very careful about shooting yourself in the foot here- you can't get blood from a stone and if the house is bad enough it'll be condemned", "i mean, get the settlement if you can, but you do realize that as long as this person is the landlord to your home, this will be a repeating problem, and he will try to retaliate in whatever way he can, which often can't easily be punished by legal action.", "Dude owns multiple buildings in the most expensive city in the USA. I think he's doing just fine moneywise.", "There are lots of laws protecting tenants from retaliation here. I could get a lawyer immediately if i need one.", "If you were too sick to pay rent for months or years, would your landlord still let you live there? Somehow I doubt it. Go the legal way and take what you're owed.", "NTA what are you waiting for?", "You need to being him to court 14 years ago it sounds. Those conditions are not sanitary. His health is not your problem. File all the complaints. Take pictures, print out texts or emails you have, receipts from repair companies, etc.", "NTA and this is a post better suited for r/legaladvice as you can very likely withhold rent in this situation", " Check your local laws. If he won’t make repairs you may be able to hire your own professionals and then deduct the amount paid from your rent", "Also, I don’t see how this is a “friendly” relationship. A friend wouldn’t let their friend’s kitchen get rained in, this is hostile.", "Im not asking for legal advice. I know legally he is in the wrong and I could possibly receive a large settlement if i was ruthless. I posted here because I want to know if IWBTA", "I do not have roof repair money.......", "Kk enjoy living in your fungus den while worrying if you're an asshole", "Wouldn’t hurt to get a quote to see what it would cost", "While that's true, you'd have to live in a less desirable place.  Some people might prefer one place over another, but the cost of housing is a direct indicator of the quality of an area.\n\nHigher cost, better area.  Lower cost, worse area.  It's always been like that and always will be.\n\nSome people don't want to go to a drastic downgrade in area when they're used to much better.", "maybe i don't understand california housing, but i do understand not staying where you can't live. OP's apartment is at best a few years from beginning to collapse structurally with a landlord who is likely going to be a chronic pain in the ass even if they can force him to fix this current issue, and sooner or later the hospital bills from all that mold is going to surpass the cost of moving. From what OP describes they aren't going to escape these horrible conditions any time soon so long as they are living in the area. Obviously yeah its not as simple as \"pack up and move\" but when your living conditions sound like that with no prospects of it getting better, sooner or later the cost of waiting on your savings and health is going to be higher than what it would have been had you tried to move", ">(Especially given the current political situation and the ever-increasing restrictions on reproductive rights and queer/trans rights at the state level, many people need to think very carefully about whether it's even safe for them to move to certain other states.)\n\nEh, New England is much more progressive than CA (Prop 8 wasn't that long ago) and that includes the lower COL areas.", "Ywnbta at this point you’ve given him plenty of chances. I wouldn’t tell him about going to the city, I would just go ahead and file the complaint", "NTA file that report. You have a slumlord.", "you YWNBTA. If he can't fix it, he should hire someone else to. He's being negligent.", "NTA - DO IT NOW you also will get sick living with fungus this is a health and safety issue", ">If I was to move, in this city my rent expense would be 2.5X what I pay now. I cannot afford that.\n\nTry to get a consultation with a local lawyer to discuss options.  If you file a formal complaint with the condition the property is in now the city may declare it uninhabitable and require you to move out immediately.\n\nOn the other hand, you may be able to do something like put your rent into a separate savings account and send your landlord notice that you're withholding rent until the unit meets the rules for habitability.   That's more likely to get the result you actually want: your landlord fixing the problems and you continuing to live there.", "If someone actually told you that you should live with mold and rain in your kitchen because your landlord has health problems, would you actually do that? \n\nTo be clear, I'm not telling you that you should put up with mold and rain. My advice is to get a lawyer. But, if everyone told you to put up with it because he's old and he has worse problems than you, could you actually believe that?", "I assumed something like this. No other reason to stay in the same rental for 15 years", "By fungus… do you mean the highly toxic and very dangerous BLACK MOLD????\n\nYour landlord should have hired a super as soon as he got sick and he was incapacitated to fulfill the maintenance and upkeep of the property, as per the rental agreements.\n\nYWNBTA.  In fact, I’d highly encourage you to contact other long-term tenants to do the same.", "Omg grow a spine and file the complaint", "NTA you shouldn't be paying rent", "Nta but you should leave. At this point if there’s mold growing in the walls it can make you extremely ill. What’s worse is mold spores can infect all your belongings and be almost impossible to remove from porous materials like bedding and furniture. Mold made from water-damaged buildings make potent Mycotoxins, some of which are carcinogenic. Its worth it to leave, trash your belongings and sue for the damages. At this point id be taking extensive photos, contacting your local health department. Your landlord is probably sick from chronic mold exposure himself.", "File the complaint but don't be surprised if he puts you on a month to month and terminates your lease in the near future.", "YWBTA He wouldn't give a shit if you had a blood disease, if you couldn't pay rent.", "No, by fungus I mean actual mushrooms growing off the wall.", "Well he doesnt live in the building, so doubt hes sick from the mold. The rst of what you wrote is interesting, i didnt know that about the spores.", "I am on month to month, for 14 years now, and a landlord in my city cant kick someone out just they want to. There is no terminating leases to get someone out here.", "OMG, I don’t know what’s worse.  There’s a huge probability that the fungus is in the walls, which means there’s a ton of mold.  Regardless, PLEASE do not sleep in your bedroom anymore!!!\n\nMushroom spores can cause a host of issues; irreparable and chronic damage to your lungs, with a specific condition called hypersensitivity pneumonitis, as well as allergic bronchopulmonary mycoses. You literally would need a biopsy to tell the extent of damage, and if exposed long enough, you could be on anti-inflammatory meds for the rest of your life.  It can also cause sinus issues, asthma, and trigger autoimmune disorders…\n\nIf you’re experiencing any of these things, get checked out ASAP.", "Yep, personally destroyed my health so I know firsthand how toxic it can be.", "Exactly, my husband and I lived in a place that had leaks and mold growing.  He was treated with 4 different antibiotics before the Dr figured it was the mold in our home that was making him sick.  He also started having mini strokes shortly after the diagnosis was made, I don't know if that was related or just coincidence.  But I'm sure that living with the mold shortened his life.", "Thank you. For the record, its not the bedroom I sleep in. Its just a spare empty room, because I dont have a roommate right now. I appreciate your tips to watch out for health wise.", "Where do you live? San Francisco??", "Can you not just move into one of those?", "Id probably have to sign a new lease and the rent would start at todays rate. Plus they are basement apartments that are horrible and dark.", "Have you considered New Mexico? It's liberal, cheap, multicultural, naturally beautiful.  CA is great but man that cost of living is fucking brutal there.", "No water. Thats going to be a huge problem in the not too distant future. Also a right to work/anti-labor state.", "\n> (Especially given the current political situation and the ever-increasing restrictions on reproductive rights and queer/trans rights at the state level, many people need to think very carefully about whether it's even safe for them to move to certain other states.)\n\nYeah,  I wouldn't necessarily suggest a trans person move to the Florida panhandle. \n\nBut there's plenty of affordable liberal cities in blue states.   You don't have to live in Boston, Manhattan, or in San Fran.\n\nOP mentioned not liking winter, but if you can stand a bit of snow than Buffalo and Rochester are both LGBT friendly and far, far cheaper than NYC.  Burlington Vermont is smaller but still very lgbt friendly.   Worcester is a fraction the cost of Boston.  There's also e.g. Portland OR, ot Baltimore.", "Something to consider,  but if someone else fills a complaint or your landlord passes from his illness. You may find yourself in dire straights. You may want to start thinking about saving some money and finding alternative living arrangements just in case as a back up. Cali is expensive as all hell,  and most people need 6-8 people in a 2 bed room apartment to make the rent there.  Just some food for thought.", "I mean, unless New England got mentioned and I missed it, I'm not sure how that's relevant? I wasn't trying to say nowhere but CA is safe, or even that there are no safe low COL areas anywhere, just that it's not as easy as \"just move to a low COL area\" because *many* - not *all* - of those lower COL areas aren't safe for a lot of us rn.\n\nI also don't necessarily buy that NE is \"much more\" progressive than CA as a blanket statement (and, BTW, prop 8 was 15 years ago, so not exactly recent either), but on that we can agree to disagree.", "NTA , *however*, when you report the many, many issues you are having with the livability of this structure... be ready should they decide (likely?) to condemn the place...\n\nGood luck.", "NTA. \n\nAs Zach De La Rocha once said \" fuck the landlords\"", "This was my first thought too! It sucks, but thems the breaks?"]}