{"id": 15154, "submission_id": "12ria9y", "title": "AITA for surrendering my neighbour’s cat to animal control ?", "selftext": "Six days ago, my neighbours packed up their trailer, closed the blinds on their house and left behind their unneutered male cat.  After three days, this previously unsocial cat became vocal and approachable with us (neighbours over the fence.)  As a cat friendly person, I was aware that my neighbours had left, was aware that the cat was outside 24-7. After day three, I checked the backyard of neighbours. Food and water available.. cat no longer had a collar. Day four: filthy water and no food. Day five: I left a note “we’re concerned, phone #, please contact us, I’m going to call animal services “…  fed the cat.  day 6 : no food, dirty water , so I pulled the plug, fed cat, called animal control and surrendered cat. He’s **lovely** sweet, purring loving attention. Was very conflicted about sending him off to the pound, but I already have two female indoor cats that would **not** tolerate him. \n\nOwner returned this evening after 5 nights away, mad that we had surrendered their cat to animal control. I felt my actions came out of concern for an abandoned pet without necessities of life, but now I’m second guessing myself. I felt 5 days was too long, but my neighbour is mad about the impoundment fee.and wants me to pay it, which I’m willing to do. AITA?\n\n**EDIT**thank you all for your feed back.  I went for a long walk last night and mulled it over for myself. The shelter will charge $45 CAD for pickup and shelter fees. There’s multiple cat bylaws in my city, including cat roaming and abandonment. \n\nI will wait and see if he has the nerve to try to bill me $45, or if he will have a change of heart and become a better pet owner.\n\n**E2**  [my cat tax as thanks for all the assertive advice](https://old.reddit.com/r/Bondedpairs/comments/mcosa7/these_are_the_two_that_started_the_sub_thank_you/).  The OG’s… Betty and Ethel, two rescues from a kill shelter in Texas (we live in Canada) who we named for our maternal grandmothers.  They live indoors, have a large outdoor catio. \n\nGo forth and do good, people.", "created_utc": 1681882439, "permalink": "/r/AmItheAsshole/comments/12ria9y/aita_for_surrendering_my_neighbours_cat_to_animal/", "score": 2102, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I surrendered my neighbours cat to animal control because I felt it didn’t have necessities of life. My neighbour has returned and is very upset about it.  I may have overstepped, but I had cat tunnel vision.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\nThey left their pet alone for DAYS. If they wanted to keep the cat, they should've been responsible pet owners and provided care for their pet - like contacting you and asking you to feed the cat and check on him each day while they're away. They're irresponsible pet owners and the cat deserves better.", "NTA- They could have asked a neighbor to give it fresh food and water.", "NTA but a top human being.", "NTA.\n\nNeighbor was a jerk. Leaving a cat outside with no food or fresh water for days is a great way to lose a kitty. As long neighbors cat was not in danger of being put down, then you did the absolute right thing.", "NTA - and don’t pay the fee.  What they did was poorly planned.  If they leave food outside wild animals will eat it.  They should have asked a neighbor to refill the bowls daily.", "NTA. \n\nWhile I do not like outdoor cats in any sense of the word, even those that *do* know that cats still need care. Even if the cat had been a barn cat/rodent control, your neighbours left it long enough for the cat to run out of food and water, *and* lose it's own collar. You attempted to leave your contact information, still nothing.\n\nOur pets rely on us. We are, functionally, their whole worlds. What would have happened if the cat had been unable to find water or food elsewhere? What would have happened if the cat had a run-in with another animal and became injured? What if there was a storm? Or some other kind of event that required special care? It would have died.\n\nYou did nothing wrong, OP.", "NTA. Un-neutered outside cat left for 5 days without regular food and water doesn't sound like a cared-for or loved family member. You didn't mention shelter, so I am assuming they didn't even have a safe space for him. Outside cats have relatively shorter life spans than indoor cats, especially if they are intact. I commend you on wanting to keep the peace, but this wasn't your fault. That poor cat deserves a family that really will love him.", "Nta, they should have someone taking care of the cat. At least now they know they can ask you to take care of the cat", "NTA - that’s a poor helpless cat and they should not have left them there alone", "NTA at all! Who moves and just leaves their cat and comes back days for it later? An AH, that’s who.", "NTA - they neglected and abandoned there cat for days. they should not be allowed to have any pets.", "I would have adopted that cat then and there tbh", "NTA. Who the hell leaves a cat with no water?! Even if you think the cat will catch wildlife, they still need access to water.\n\nI mean, I don't agree with outdoor cats, especially non-fixed ones, but if you're gonna leave, then you have to make sure the cat is provided for. You did the right thing. Don't pay those fees for those fools.", "Info: Did they move out and you thought they were leaving him for good, or did you think they'd come back for him?", "NTA. That should have got a pet sitter.", "Definitely NTA. You did the right thing and the owners are lucky an impoundment fee is all they have to pay because they should be charged with animal cruelty.", "I wouldn’t give them a cent that’s neglect they made the bed let them lie in it", "A soft YTA. You did it out of concern for the animal, but you could have just fed, watered and petted him until they came back. This is more like punishing them for it rather than caring for the cat.", "Info: was this a kill shelter? If so, YTA. There’s many more options out there than that. I foster cats for a rescue and I get how awful it is to see irresponsible pet owners.", "ESH they should have checked up that the pet sitter was caring for the cat. I don’t think you had ill intentions, but putting a cat in a shelter is always a dangerous move for the cat. Since it sounds like you can afford it easily I would pay to get the cat back. Their money might be pretty tight having just moved, especially since you commented that they were renting. You could maybe even go to the shelter and explain that it was your mistake because their cat sitter wasn’t checking on him enough and you thought he had been abandoned. I’m only ruling against you (partially) because six days is a pretty short amount of time to see the cat left and assume that it has been abandoned. \nWe adopted a momma cat that was dumped in our neighborhood with 8 kittens. We waited a month start finding homes for the kittens in case they had been stolen and dumped which has been a big problem in our area. Once she started to trust us it became obvious that she had been mistreated and we started making arrangements and decided to keep her. We’ve had her almost 6 years now, but we made sure to give her a chance to return to her home or for her owners to come looking for her. In my area you have to wait at least 30 days to claim an animal you find, so I think you should have checked up on him for at least a couple of weeks. If he regularly went outside before he would have been fine unless there was a major storm and you could have sheltered him if one was forecast. I’m just not okay with the risk of him being put to sleep at the shelter when they had been gone less than a week.", "YTA - it’s their cat and you gave it away.", "NTA.", "NTA and don’t you even think about paying the fee they abonded the cat with no food very little water that’s animal abuse and neglect and how we’re you to know if they were coming back in the first place", "NTA. Don't pay the fee. If the pet had no food and water left and was being outside without protection and an easy prey for wild animals then you did right by calling animal services.", "NTA, you're a good human helping a cat escape negligence. Don't pay for them to get the cat back, the cat deserves better humans", "NTA. Hopefully the pound will neuter him. You have a kind heart.", "I’ve since talked with the pet owner and he’s adamant that people were dropping by.  I came by multiple times and checked. No food. Changed the water myself and brought food.   I’m not willing to argue this point with him as he’s talking “trespass”.   I just saw a needy cat. Raccoons eat everything around here.", "Thank you.  I’ve been super conflicted over this and feeling pretty low.  Second guessing ones moral choices is hard.", "Honestly, you’ve read my mind. I just can’t vocalize it to the owners. This lovely little guy deserves so much more. But I think I’ll just suck it up to keep peace", "That would be lovely., but with two immunosuppressant indoor females, I felt like we were at an impasse.   But a [void, a tortie](https://i.redd.it/0a586qvjhtma1.jpg)plus an orange tabby…. Would have been great.", "I truly wasn’t sure. They are transient renters, packed up their trailer and left. No activity in the yard for 5 days. They’ve never been active pet owners, unneutered outdoor only cat,  I truly thought they might have abandoned him.   Hoped that they had not ( which they haven’t). But it’s really hard to explain that to folks that believe that unneutered cats should run freely outdoors.", "Giving the cat back to people who see no problem with animal neglect *is* punishing the cat", "And leave the cat with people who leaving it for a week with dirty water and no food is ok. Nope", "Believe me, I’m totally second guessing my actions. My tunnel vision for cat superseded everything.  Thanks for the reality check. I want to interact with the family positively (and humbly) tomorrow", "No. Not a kill shelter.we don’t have those. Owner returned this evening, will most likely get his cat tomorrow and I will pay the full bill to avoid neighborhood confrontation. Plus, cat is really sweet, even if he poops in my vegetable boxes. I like him a lot despite his crappy owners.", "I will be paying shelter fees… he’s going home tomorrow. Thankful we don’t have kill centres here. Also, thank you for taking in momma cat, her babies and making a safe space for her. ❤️", "Is your head screwed on right?", "But it wasn't their cat anymore, they abandoned it.", "Maybe he’s technically correct, and he means you stopped by", "I was going to ask if you had raccoons. Not only will they take everything but they will protect that new resource and the cat will suffer bodily harm. Not to mention now raccoons are living very close by and they will tear through a wall find a cozy spot.", "Your overlords look gorgeous", "Yeah you are NTA. You can just abandon a pet for almost a week and hope they fend for themselves. Much less run freely outdoors not neutered.", "Agreed, the neighbors might be shitty people. They should have got a pet sitter. But at what point does it become OPs right to intervene? I love animals too but it's not your animal, and unfortunately you can't save them all :(", "Man just stop. Everyone is coming at me now like I did something wrong. Yes yes the people are shit, no arguments there. But it's not OPs job to police how neighbors take care of their pets.", "I disagree. The family intentionally left a cat behind with seriously insufficient water, food, or shelter. They are more angry with the cat being taken than concerned that their cat was at risk due to their clearly inadequate care. They are more pissed about the fee than upset the cat is gone. These are not responsible pet owners and the cat doesn’t deserve to be neglected; this situation is unlikely to be a one off if they get the cat back. \n\nMy one concern is the cat being euthanized, which it doesn’t deserve. But this sort of animal mistreatment is not ok and is usually illegal *because it’s not ok*.\n\nNta you didn’t do it out of spite, the cat needed help and you were unable to take the cat in. My guess is the shelter would likely waive the fee if a cat was mistakenly or vindictively surrendered without the consent of a loving pet owner. My guess is the pet owners are either unwilling to explain why the cat was surrendered (and how they put the cat in such risky conditions as a result in the surrender), or the pet owners told the shelter what they did and the shelter is refusing to waive the fee as a result.", "You did the right thing. If they think leaving it that long with no one to check it and clean it’s water and feed it they shouldn’t have it. It’s neglect and cruelty. It clearly was in need as it was approaching for help. They are in the wrong here not you. They could have asked a neighbour to put clean water and food down but chose not too. That’s the reality check they need.", "NTA.\n\nDid you know how long they would be gone?  Even if you knew they would be gone 5 days, their failure to have someone reliable to provide food and clean water for that length of time is cruel.  It was not  OK because they thought the neighbors could have fed it or other such B.S.", "Hey, you came here for advice because you think you made a mistake. You did, but at least you weren't ignorant enough to pretend you didn't so don't beat yourself up. If I were you I'd swallow my pride, pay the impound fee, apologise, and just explain that you love animals, were concerned, and didn't mean to cause offence.\n\nWhether they accept your apology or not is up to them, but that's all the damage control and rectifying you can do.", "In that case, NTA. You’re not a mind reader. It’s kind of you to pay the bill though I think it’s unnecessary. Hopefully they freaking neuter they their cat!", "Will the shelter neuter the cat before returning him? I know of some that will charge a very high fee to release an intact animal back to the owner OR a very small fee if the shelter is allowed to sterilize it.", "haha no i don’t have any screws in my head thank you though.", "they left and forgot their cat then came back. things happen but you can’t steal peoples pets.", "Wait, are you saying it would’ve been best to leave the cat to fend for itself? Op kept the cat safe, the neighbors just don’t want to pay a fee to get it back! Most shelters would waive fees if the cat was vindictively surrendered or mistakenly surrendered when it had a loving home that could adequately provide for it. My guess is either the owners were unwilling to explain what happened to result in the cat being surrendered (and how their neglect resulted in the cat being put at risk), or they told the shelter and the shelter is unwilling to waive the fee because they realize that the owners were not taking care of the cat.", "But it wasn't their pet anymore, they abandoned it.", "I went for a long LONG walk after our confrontation with our neighbour tonight. I wasn’t stable enough to deal with the situation at the time (all spiky adrenaline) so my very very calm husband took the brunt for me.    However. On my long walk of talking through it , I am ready to pay for impoundment fees, because it’s just money, and well being is more important. I’m willing to atone for due stress to that family, even though it may have come from good intent, I truly want to be a good neighbor. I’ve overstepped in good conscience and have **no clue** how to make amends. (But I still feel like they are shitty pet owners that do not deserve a pet)", "👍", "Then they don’t deserve to have that cat!", "You \"forget \" a bicycle or a lawnmower.  \nWhen it's a pet, it's called abandonment.  The cat was suffering and OP had no way of knowing when or if these people were returning.  How long do you think OP should have waited before making sure the cat was safe?", "They didn’t forget their cat. No one forgets that they have a pet. And they left food and water, so, no, they didn’t forget. They were just AH‘s who thought they could go away for five days and not make proper arrangements for their cat.", "I don't know how you came to that conclusion when I litreally said OP should have just fed watered and looked after the cat but not send it to a pound.", "I think you’re more an AH for willingly helping them get the cat back when they’re clearly appalling pet-owners. I understand you feel bad, but considering they neglect the cat even on a good day, and there are no kill-shelters in your area, removing the cat was the best idea.", "You don’t need to make amends, you taking the blame here will make them think they were right. If they did have people who were supposed to check in then they need to take it up with them. But this isn’t the first instance of you seeing them being neglectful of the cat. Your angst here shows you are a good person. They will take advantage of that to make you feel bad and that you’re in the wrong. Youre not", "Truly I had no way of knowing how long, if ever, they would be back. There’s bylaws in place in my city for any roaming cat to be surrendered.", "NTA and definitely don't pay the fee. The neighbor shouldn't get the cat back at all imo. You did good in looking out for the cat", "You did the right thing", "NTA people need to stop thinking you can just leave a cat to fend for itself for days on end, they need as much care & attention as a dog. You did what was best for the cat, their feelings are irrelevant, if they truly cared they wouldn’t leave it outside like that", "Didn you have a phone number of your neighbour? A way to communicate with him? What kind of neighborhood is that.. ESH", "NAH you did what you thought was right. They did as well. Just exchange contacts so you could call them if something similar happens.", "NTA. The owner is super irresponsible for leaving an  unneutered cat roaming free and for leaving the cat without food and water. You absolutely did the right thing and you are not responsible for the impound fee, that’s on the owner.", "NTA - negligent owners left their cat without proper shelter food and water and then had the nerve to want YOU to pay for the impoundment fees? Take care of your own affairs and others won't need to get involved.", "NTA. This pisses me off sooooo bad.\n\nMy mom used to manage some apartments and one day the groundskeeper went in and found a fucking kitten in there. She was about 8/9 weeks and they'd just abandoned her. So guess who got a new furry friend? Me, and it's been a beautiful *5 years with my lil sassy Cleo. They ended up coming back to pick up some stuff and didn't even ask for her back; just acted like she was an old toy and they were glad someone had a use for her. People who abandon pets should be put on some kind of no buy/adopt list.\n\n*EDIT:* Rechecking it'll actually be 5 years on the 30th this month :3!", "NTA\n\nThe cat was abandoned and is living better at the pound than at home", "NTA. They left and animal which obviously cannot fend for itself with no food or water, and no message of when they were returning. \n\nYou did the right thing.", " Outdoor cats are not only a danger to the local wildlife but are more likely to catch a disease and at risk of getting injured or killed. What the neighbor did was incredibly cruel and they do not deserve a pet rock let alone a cat. \n NTA. You owe them nothing.", "NTA.  Who packs up and moves away without taking their pets even if it's an outside cat. I'm sorry I have moved before I've never exclusively had an outside cat my cats have always been indoor outdoor cats but I would never ever ever move without my cat this person does not deserve to get their cat back do not pay and hopefully they can't afford it either so this cat can go to a loving home", "Not every neighbourhood communicates with eachother. Me and my neighbors barely talk and I can only imagine speaking with them if I was concerned for their safety or something, I’ve heard similar from family friends.", "Those people dropping by must have been invisible and illiterate.\n\nI'd say maybe you could have provided food and water for the cat until owner came back, but you had no idea how long that would be and that shouldn't be expected of you.\n\nNTA - the cat was neglected. Maybe neighbour shouldn't have him if he can't get someone to take care of him while he's away.", "Even if someone was feeding, which clearly they were not, they left that poor cat outside unattended for FIVE DAYS? Horrible people.", "You have to tell him no one came, otherwise it will happen again.", "Your morals seem pretty spot on. Those animals were unfortunately neglected by their owners for 5 days and you did what was necessary. It's unfortunate for the owners but maybe they won't forget them next time.", "It's never wrong to help the helpless and voiceless. Your neighbor should be ashamed. You should not give them a penny. \n\nMy only issue is a lot of cats, most of them, are euthanized at the pound including \"no kill\" shelters. I would have contacted some rescues and tried to find the cat a home before taking him there. I hate seeing him go back with those awful people though.", "Thank you for taking care of the poor kitty, he was left on his own by his shitty owner. I wish more people were like you.", "Question: are they going to pay the fee regardless? Because I don’t think they deserve the cat back, can that be conveyed to the shelter or animal control? \n\nIf they are going to get the cat back, I guess Pat the fee to keep the peace and let them know you can stop by to take care of the cat the next time they go out of town and to NOT leave it to defend for itself. \n\nGood on you for being an attentive, caring human!", "Sounds like a sitcom setup tbh", "Don't you dare pay that bill! Tell them to pound sand and never speak to them again. They are probably going to take your money and leave him in the pound. The poor creature doesn't deserve to end up with them again anyways. You be the asshole then", "No, they are assholes. They are trying to scam you for a quick buck once they realized the cat was gone. They don't care about him. They can die mad for all you should care", "Well at least they must have each others number, you never know.", "The cat has a chance to be adopted by an actual loving responsible family. Don't inflict him with these trashy neighbors just to make **YOU** feel better. They will abandon him again somewhere you can't find him next time, if they even get him from the pound at all. Don't be a sucker", "Idk why you're being downvoted. You're right. It would be a huge asshole move to reunite them when now the cat has a chance to find an actual loving family from the pound.", "NTA.  And I would NOT pay a cent towards the kitty jail fees.\n\nStory time- I moved to a new neighborhood last year.  First thing I did was get security cams all over the house and yard.  I watched 2 neighborhood cats get splattered on our road- first died instantly, but the second did not and it was AWFUL.  I also got to watch the neighborhood foxes eat an opossum and attack 2 other cats, who survived.\n\nA few months in a 1/2 grown kitten started showing up at my house.  It repeatedly tried to get into my house.  It would climb up my window screens at all hours of the day and night, scaring the heck out of me, and wrecking my window screens.  I asked several neighbors if they knew who the cat belonged to, but nothing.  I grew to like the little cat, but meanwhile it was getting thinner and thinner, covered in fleas and ticks, and I cannot have cats as I am allergic.\n\nSo, I found a new home for it.  It was way too adorable and petite to be splattered on the road, eaten by the local wildlife, or left outside in the dead of winter.  It took 3 weeks for the missing cat signs to go up in the neighborhood.  I felt morally ambiguous about giving away someone's cat, but the lack of care and attention they paid to that animal was shameful.  And in that 3 weeks time that the cat was at its new home, she practically had doubled in size.\n\nI see her every now and again, and I am not at all sorry she has a home where she is warm, safe, well-fed, and a completely indoor pet.  She looks gorgeous now, her patchy hair is all filled in, and she is very happy.\n\nI would do it all over again.", "NTA, but you should understand that Animal Control is a death sentence to many animals. A non-kill shelter would have been a better choice.", "honestly any cat left outside, whether or not someone is feeding them, deserves and needs better care. you did the right thing. NTA  \nOutdoor cats are bad for wildlife and have half the life expectancy of indoor cats. Fight me.", "INFO - was this a no kill shelter?", "What do you mean pound? Are they going to put him down?!\nIf so yes Y. T. A. Majorly.\nYou could have easily just get him neutered and put a lil doghouse outside your house for him so he has a place to sleep while you're looking for someone who can adopt him. \n\nIf it's just a normal shelter where no one is going to kill him then N. T. A", "nta", "NTA  You did NOTHING wrong.  Do NOT pay that fee!  Those losers abandoned their cat outside where anything could have happened to him.", "No you are not. I would have contacted animal control after Day 1.", "NTA you can't leave an animal for 5 days and have people randomly stop by to feed and water it. They need more than some food thrown at them every few days.", "NTA. That's not how anyone treats a pet. It was left outside with hardly any food. I don't know what \"people\" stopped by, but clearly they didn't do much.", "NTA I couldn't imagine just leaving my 3 babies and not having proper care for them. Like hell, my Uncle who I love like a father, suggested that I don't bother getting a cat sitter or bringing my babies with. He said and I quote \"There cats, just leave them some water and food and they will be fine for the 3 days.\" I lit into his ass soooooo bad for that comment. These owners are trash", "NTA\n\nDon't pay the fee and please, please discourage the pound from returning the cat to them. That lovely boy deserves better.", "NTA but no good deed goes unpunished. I  learned this the hard way too but next time (if there is one), take pictures and any other evidence you can of the cat's condition. \n\nI once kept an abandoned cat for after 2 weeks of pet sitting turned into 3 months without contact from the owners. They had even left him infested with fleas which ended up passing to my cat as well. I finally found a wonderful home for him with a family and very sweet children. Original owners came back two *hours* after they picked him up, after not responding for months on end to a single text or call, and accused me of kidnapping their cat and demanded to have the new owners' info. I didn't budge and they slandered me to the entire community calling me an evil catnapping bitch. Really wish I had saved my texts to them but I had deleted it in anger.", "Definitely NTA. You acted in the cat’s welfare when your neighbours FAILED to do so. Leaving a cat alone for 6 days without adequate food and refreshed water is neglect. They should have either boarded him or hired a sitter. I would argue that you already paid the impound fee by way of providing free sitting services.\n\nIt’s also no surprise that the cat is unaltered.", "NTA. Why did the cat get left outside?! I’ve left my cat for five days before but he stays inside and someone drops by every other day or so.", "NTA. What they did to that poor cat was cruel. You did the right thing.\n\nThey could have left the cat in the house and hired someone to come and feed the cat, or even just asked you to do it, rather than leaving the cat outside to fend for himself with little food and no water.\n\nThose people deserve to pay whatever fee they have to pay. I just feel sorry for that cat having to live with those people!", "NTA - you were concerned for the cat. For all you knew they weren't coming back.", "NTA. Your neighbours are irresponsible and don’t deserve that cat. Hope they don’t have kids. They’d be terrible parents.", "op=NTA  \n\nIf for some bizarre reason, the neighbor needed to be away, they had chance TO ASK someone to care for their cat before they left.  \n\nHow long were you supposed to wait for that cat to get food, clean water and shelter?\n\nDO NOT PAY FEE--this is a Lesson for them to actually CARE for their cat(tho I wish they couldn't get cat back)", "NTA at all. He abandoned the cat for a holiday probably. Seems like a very negligent owner", "NTA. Makes no sense whatsoever. Why leave the cat for 5 days? Why take the collar off?", "Not the asshole. Don't pay that bill.", "NTA\n\nThey can explain why they left their cat without food or water or srrsngments for its care to animal control if they want the fee waived.\n\n\nHint: it's not a good enough excuse to get it waived", "Nta. They abandoned their cat instead of arranging someone (like you) to make sure kitty had fresh food and water.", "Nta, maybe help with cost.. I don’t feel you’re 100 responsible if at all. But I’d be second guessing myself also..", "[removed]", "They can go over a week without food if ultimately necessary. The water is far more important.", "I don’t have the number of any of the homes in close proximity to me.\n\nEdit to add…oooops", "Dislike all you want, that's how it should be to prevent many issues. You judge only the two people here which is fine, what about this poor cat that was taken from its home???", "This is a karma farming bot. This comment was stolen from [here](https://www.reddit.com/r/AmItheAsshole/comments/12ria9y/aita_for_surrendering_my_neighbours_cat_to_animal/jguk3yc?context=3)", "The person who was meant to be feeding the cat can pay the fine (if this person even exists) since it was on them that made the cat look/be neglected.\n\nBefore any hate comments I really don't think they organised anyone and was thinking if they put enough out on the first day the cat would be fine. If they did organise care as a pet owner if be beyond pissed that whoever was meant to be caring for my pet  didn't care for the pet like I'd ask and control was called, not the person who called animal control", "If people were dropping by they would’ve seen your note.", "TBF, it could be a case of their arranged care for the cat not doing their job. But in that case, they should be grateful you looked after their cat when it was not being cared for, and they should be asking for the impoundment fee from whoever was supposed to stop by.", "He might have been let down but you did right by the cat if situation genuinely as you saw. Though do worry about kill shelters. I wouldn't pay the release fee. He should have arranged better care including shelter. Pound covered shelter, food and water for him.", "Don't pay ANY fees. You're NTA, tell the animal services or whoever comes to your door about how they abandoned the poor cat for days.", "That cat asked you for help. A cat who suddenly gets social and hangs out with you is asking for help. You helped him.\n\nMy neighbor did the same sort of thing. Had a gorgeous calico baby. Someone in the neighborhood took the cat and made her an indoor cat. Mom told the neighbor that they didn't deserve any of their pets, so she wasn't going to share who had her. Just that she was safe.\n\nMom can be a lot but she's definitely a badass.", "I'm going to get absolutely blasted for this, but I've left my cat for 5 days before. The difference is I kept him indoors, left plenty of water options, and more than enough food. The reason I didn't have someone check on him is because it terrifies him to have strangers in the house. Even knowing he had more than enough to get by, I still felt bad being gone so long. Now I have resources he is comfortable with, so he doesn't have to be alone while I'm gone.\n\nI would NEVER leave my cat outside alone for 5 days.", "By \"suck it up,\" I hope that doesn't mean that you're planning on reimbursing them for the fee!!", "OMG! I also have a black cat and a tortie! Love to see it", "So, the cat is going right back to the people that left it with zero care?", ">I will be paying shelter fees\n\nYTA to yourself for that\n\nThough the shelter is the bigger AH for giving them back the cat in the first place", "There should always be a way to communicate", "NTA - Negligent owners leave their cats without proper shelter food and water and then you want to pay for the seizure? Take care of yourself and don't involve others.", "If the pet has no food and water left and is outside without protection and is easy prey for wild animals, you should call animal services.", "Why? People who live in proximity to you don't need your number nor you theirs.\n\nIt ain't a commune it's a neighbourhood.", "I live less than 20 feet from my neighbors on either side and don't have their numbers. We've never had any interactions other than a brief hello.", "Why?", "How do you forget your cat? For 5 days?", "No. No no no. Don’t help them get the cat back that they left to fend for itself for 5 days. Not good pet owners.", "Well it kinda is, neightboors can be really useful especially when you aren't home for days/weeks.", "I don't say you have to talk all the time or everyday but it's good to have a number in case of emergency.", "What why, wtf, some of you have issues here go look at them.", "Yes they can. But neighbourhoods don't NEED your number which is what you posited with neighbours MUST have each other's number.\n\nI most certainly wouldn't want my neighbours have my phone number myself, that's for friends and family and most neighbours are nothing more than people who live near me.", "I don’t know! Maybe people don’t think OP is an AH at all, or that regardless of the neglect the cat belongs to the neighbours?", "They need to have a number it's needed. In case of emergency.", "NTA. If they were going away for that long they should have put the cat in a boarding kennel or kept him inside with enough food and water to last five days. Leaving an unneutered cat outside is also irresponsible as they are contributing to the stray population and putting him at risk for engaging in cat fights where he could be injured.", "NTA. The cat was outside 24/7 with no way to get inside out of the elements and away from wild animals, and its food and clean water ran out. The owners were extremely negligent. You weren’t wrong to surrender the cat because for all you knew, they’d abandoned it and it needed a safe place with food and water. They can pay their own impounding fee to get the cat back. Hopefully they’ve learned something from his experience.", "NTA Naaaaah tell them it is possibly cheaper than the animal hostel they should have payed in the first place.", "Leaving an unfixed cat outside for days? NTA they can pay impoundment and get their cat fixed you did right.", "You said you're willing to pay the fee which is more than reasonable.\n\nNTA.", "People will lash out and create any sort of false reality in their head to place blame somewhere else. You did exactly what any human would do. NTA", "Pay the impoundment fees.\n\nThey are ungrateful wretches", "NTA. If you do NOT pay that fee. You would be paying to let a cat go home to people who neglected it. You WBTA if you did that. You rescued that cat. Don't toss it right back in the deep end.", "NTA - If they can afford a vacation for themselves, they can afford to care for their cat. They chose not to.", "NTA. The neighbors do not love or care about that cat. He is better off with someone else. Thank you for caring for him. You’re good people.", "NTA and do *NOT* give those people money! \n\nWhen we bought a house and started moving, first thing was the cat and her gear. We had lawn chairs and sleeping bags, so she could acclimate. \n\nBut then, I'm a weirdo. She's spayed, vaccinated, chipped and wears a collar with a tag. Usually, only two cats with collars. I've taken both to the vet. One belongs to a neighbor.\n\nRecently had a young male with a collar show up. No tag. He's been trying to come in for 2 weeks. I'm probably gonna surrender him to animal control because he's driving my older cat nuts and being a nuisance.", "NTA.  They can consider the fee your retroactive pet-sitting fee.  And let them know you are happy to go INSIDE and feed it next time they leave town for a week.", "NTA, they shouldnt have the cat tbh. They need fresh water and food.", "NTA, who tf leaves their cat ALONE for FIVE DAYS.", "Nta do not pay for fees either and I would call the local police station and ask them to meet you at the shelter to take your statement along with animal control/pound's statement about the incident. That should nip any trespassing threats in the butt. And next time neighbors threaten you with trespassing with that incident all you have to say is both I and animal control have given a detailed statement about that incident along with any pictures I had taken of the cats living conditions.", "OP NTA. Based on what you wrote, I would agree that it looked like the cat had been abandoned, since it didn't have sufficient food, water, or shelter. If the owners of the cat were just going on a vacation, they could have mentioned that to you or kept the cat inside their house.", "NTA they left him outside without food or water for days, reporting them was the only choice.", "OP did the right thing, the owners need to be charged with animal cruelty.😡😡😡😡", "NTA. You’re not obligated to pay anything. If they didn’t want to pay/ask a friend to check in on their cat, they could have bought a water fountain, a food dispenser, and a robot litter box. Yeah those are expensive but you CANT ABANDON YOUR PET for almost a WEEK!! They did nothing to ensure the cat was taken care of. It doesn’t sound like they gave a single frick about the cat. Not okay. There are services like Wag where you can pay someone $20 to do a checkin on your cat. $20 each day would be less than the cost of the fountain, litter box, etc that I mentioned. There are many options they could have done. Fuck that person. Good person or not, they’re a shitty pet owner.", "Also the fact that you left warning notes was very very kind and even further backs up your decision being the right one", "They had so many options if they couldn't take him; boarding, sitter, etc. \n\nThe jerks don't deserve a pet. \n\nNTA", "NTA. They abandoned him. Surrendering him to a shelter is far better than being abandoned.", "Do not pay the impound fee. They abandoned their cat!  Someone needed to be responsible for the well being of the animal", "NTA\n\nThey should have arranged care for it", "NTA.  You don't leave your \"pet\" alone for days with no fresh food and clean water.  If they had asked someone to watch out for the cat because they planned to come back it would be different.  At that point whoever was supposed to watch it would be TA, but this seems to be a case of straight-up neglect.", "NTA and I wouldn’t even pay the fee if I were you. This is just animal abuse and shouldn’t be tolerated. Paying her fee is admitting that what you did was wrong, when in fact you went out of your way for the animals safety. Most people would just let that un-neutered cat escape and wreck havoc.", "Nta they should have found someone to care for their cat. Good of you for doing the right thing", "NTA", "You are a hero to that cat. Screw the humans who abandoned him and left him to fend for himself. NTA.", "NTA. Your goal was animal safety. Can't argue with that", "I did something similar about 12 years ago..my old neighbor had this beautiful long hair tabby cat that they’d just let roam with no care for her. We had bears,dogs,probably coyotes too. My exs mom hates cats so I couldn’t keep her which crushed me because she was the sweetest thing ever. My final straw was when she got stuck in a tall tree near my house for a couple days..I called 911 and they said they couldn’t help so I literally baby talked the cat down,thankfully she trusted me enough to listen to me. After that I put her into a dog carrier with food and water and letting her out to go to potty for 5 days. So she has been gone for about a week and her “owner”didn’t even try looking for her. I took her to the humane society,where I’m hoping she got adopted by someone who actually loved her and cared about her. So defiantly NTA,you saved his life most likely", "Plus the fact that he's an unneutered male left outside. effers. NTA OP", "Nope. Nope. Nope!\n\nCat goes *first* when moving!", "Relatively shorter? Outside cars average like 6 years and indoor cats 16.", "None of that is OP's responsibility. The owners should have gotten the cat neutered and put \"a lil doghouse\" outside for their OWN cat.", "AND do not pay the fee, FAFO", "NTA and I wouldn't pay any fees. They abandoned the cat. Whenever I moved, f*** everything else...my dogs went first. Or at least found a place for them while gathering everything for the move. They didn't bother with the cat and you were concerned and had every right to surrender to animal control. And if I was an animal control officer and they wanted the cat back I'd say nope you abandoned it once already OUTSIDE! UNEUTERED!! Irresponsible.", "I suppose it's possible that they had arranged for someone to come and it was that person being negligent.\n\nEither way they are mad at the wrong person.", "Maybe he had made arrangements and whoever was meant to be feeding the cat let him down. That's not your fault though.\n\nNTA", "If there's raccoons, there's probably possums, too. They'll eat cat food too.", "NTA.  Start talking \"Animal Abuse\" charges.  If the fee isn't too high it may be worth paying it as he will probably just let the poor thing be put down.  Perhaps you can pay them directly and get them to just tell him they \"waived it\".", "Possibly they did have people stopping by and you just didn't see them, but the raccoons got to what they put out before you or the cat did. That would also explain the dirty water, raccoons wash their food.\n\nStill NTA. They left their domesticated cat to fend for itself outside for a *week*. That's abuse even without everything else. Animal control wouldn't have taken the cat if they thought everything was fine.", "This simply is not true. Cats begin to have serious health issues if they don’t eat for even 3 days. Google it!", "If you pay the fees, no lesson is going to be learned on your neighbor's end.", "Are you out of your fucking mind??\nWe are talking about a LIVING BEING here.\nThe cat isn't at fault and dependant on a human to littlerally stay alive. We are talking about a live and death situation here.\nThe fuck do you do when you see an injured animal lying on the street? Do you leave it there??\nI would never do that it's beyond fucked up.", "Also raccoons will drink the water AND THEN WASH THEIR HANDS IN IT!", "[removed]", "I mean we used to leave the cats outside when we went on two week family holidays. But they were indoor/outdoor cats, we built them a cozy nook in the shed with a cat flap, we live in a country where nothing eats cats, and someone from the village was always was paid to come *twice* a day to check water and to feed the beasts, plus the neighbours on both sides had their own pets and would also keep an eye out.", "I'm surprised animal control would give the cat back to them after they abandoned and neglected it, even with a fee (no matter who pays it). Yikes!", "How did you leave the food though? Unless you have an automated feeder you can't really leave \"more than enough\" food for a cat because firstly you never know when they might randomly decide to eat it all and then have to go without for days, and secondly dry food does go stale and cats are fussy creatures who may decide to turn their noses up at it.\n\nObviously you have other strategies now but if you ever find yourself without those again I'd recommend maybe setting up an in-home camera while you're away so you can see that he's actually still got food and water.", "And serious behavioral issues if their dish is empty for a few hours. \n\n- cat owner", "Monsters!", "Imo, death is better than neglect.", "Leaving a cat outside is also a death sentence for many animals, but calling animal control is at worst only going to end with the death of that one cat. And I have 4 cats that I treat like children.", "I read stories like the original one and get so upset. I don't believe that cats should live outdoors. But with cats there are such shades of acceptable. Like, I leave mine home alone for 5 days, but will have someone pop in once or twice to check her. And I also let her outside for about an hour a day... and I have barn cats, who are perfectly fine. Your story started out horrifying, but got better with each sentence!", "In North America, cats are pretty much an invasive species.  In Europe it's different.", "My mostly indoor cat is from a line of barn cats. She's 9 and prefers to stay inside. She likes our porch and goes out with us.\n\nShe has a fountain and an auto-feeder. She still gets mad if I leave for 3 days.\n\nTravel is stressful for her. Boarding is worse. Friend asked about checking on the cat, on our last trip. No thanks!", "Can you explain that? My understanding is that cats are killing off native species of birds and other wildlife all over Europe too.", "ESH - you could have put food and water out and waited an actual week. That short a time is not abandonment. But they should not have left it outside either. Then again, maybe they didn’t and the person who was supposed to be feeding the cat let it outside. Either way, y’all are all in the wrong", "CW: sad cat story and some graphic imagery:\n\nOnce upon a time, a former roommate moved elsewhere in the same neighborhood. During the move, she made her ill, senile senior cat an almost fully outdoor cat. The cat kept showing up back at our place, clearly unwell, and we’d call the roommate and ask her to please keep her inside. Finally, the cat showed up with a large chunk of fur and skin ripped off, bleeding from a fight and in distress. We called the ex roommate and waited to make sure the cat would get some care, but started putting out feelers to see if we could rehome the cat. \n\nEx roommate found out and sent a male friend to our house to threaten us in response. The cat disappeared shortly after. \n\nThe moral of the story is, if you can tell an animal is not being cared for, your NTA if you do what you need to do. Even if the people involved are mad. I hope this kitty is okay.", "I wouldn't be willing to pay the fee. That's the cost neighbor would have paid if they properly took care of their cat. I wouldn't spend a penny helping them get it back.\n\nNTA, but I wouldn't give that verdict if you paid for the cat. And I'm sure the cat would agree with me in that case.", "NTA, but call animal control and make sure this person can’t get their cat back", "NTA \nAt all! Good job!", "Yeah, you can leave a cat alone INDOORS for maybe a 3 day weekend if you’ve appropriately provisioned it but 5 days lunacy, let alone the fact that it was outdoors. You protected an animal. If they’re able to prove ownership animal control will give the cat back to them. NTA", "NTA. What they did was animal neglect. It doesn't matter if they came home, they clearly left it to fend for itself.", "Maybe get your neighbors contact info for the future? At first I was thinking you WTA but after a second thought, you’re not because if the neighbors gave a rats about their cat, they would’ve known to leave sufficient food and water out plus access to their house, it’s called a cat door! I think you’re fine, they’re the thoughtless assholes. Plus the cat prob got neutered 👍🏼", "NTA", "kudos ! you did the very best thing", "NTa, and don't pay for anything. The dude kicked his cat outside for five days and expected it to fend for itself? He's an AH, and the cat needs a better home. If he gets the cat back, he'll keep doing the same thing all summer.", "NTA. This is active, possibly criminal neglect, depending on where you live. Laws around cats are weird though.  \n  \nNext time, or if anyone else encounters similar circumstances, just magic the cat away to a shelter and tell them it's, as far as you're aware, stray/abandoned. Which is a perfectly likely outcome anyway if the cat wanders far enough and finds actual strangers.", "NTA, and don't pay the fee. Negligent pet owner abandons un-neutered cat, then wants it back? That does not work.", "NTA the cat shouldn't have been outside for 5 days and they should have hired a cat sitter.  You should not pay the pound fees.  Your neighbour is well out of order.", "NTA and do NOT pay the fee for them. They deserve consequences for their actions. Don’t let shitty people guilt you like this.", "NTA and seriously any responsible pet owner would have at least asked you to feed the cat during his absence. Imam shocked that thé neighbour can get the car back.", "NTA. They left their boy outside with no protection from elements, coyotes, etc., inadequate food or water and just as bad they left the neighbourhood girl cats without protection from him. \n\nWith a bit of luck they will refuse to pay the fee and the shelter will find him a loving home.", "NTA - the impound fee is what should have been paid to a pet-sitter or pet-hotel.  They should have made arrangements for the cat - even if it was to ask you to feed him.", "NTA, doesn’t sound like they’re responsible enough for a cat.", "NTA. Don't pay the fee. They were irresponsible pet owners and should learn from their mistakes. Anything could've happened to that cat. Idiots shouldn't have pets.", "NTA. I have taken my neighborhood un-abandoned cats to animal control after catching them killing birds/other wildlife on my property. 😭 I’m against outdoor cats being allowed to roam freely in general, so I’m probably biased. But you had concerns that the animal was left by its owners, nothing wrong with wanting to help it. It’s irresponsible for people to let cats wander in general, let alone intact cats that can contribute to feral cat populations.", "ESH - you could have put food and water out and waited an actual week. That short a time is not abandonment. But they should not have left it outside either. Then again, maybe they didn’t and the person who was supposed to be feeding the cat let it outside. Either way, y’all are all in the wrong", "NTA, they practically abandoned their cat and never came by to change food, nor contact you. For 5 days after leaving. 5 DAYS! They can pay it and they should consider themselves lucky you aren't reporting them for animal abuse.", "NTA, he shouldn’t be allowed to own pets. i can’t imagine even leaving my cats alone for more than a day or two at max.", "NTA\n\nNow that I have kids, I can't just go out any evening I feel the urge to go out. I have to call a babysitter, plan it out, etc...\n\nWith a pet, I can leave him alone for an evening and he'll be okay. But if my family is ever away overnight, I either drop him off at a sitter or my parents' place. There is no way I'm leaving a pet alone for more than a few hours. \n\nEven if it's an outdoor pet. That's still a pet. Still a living being that has come to rely on being fed and taken care of. Unless you have an automatic feeder and litterbox sifter and self-watering bowl, that cat is being neglected. \n\nActually, even with an automatic feeder, self-cleaning litterbox and self-watering bowl, that cat will still be missing companionship. After 5 days? It's been well and truly abandoned.", "YTA", "NTA\n\nThey couldn't have easily asked you to feed and water the cat which kind of sounds like you would have or at least left a note. They appeared to abandon their house and cat.  You did the correct thing.  Actions have consequences.   It sucks but they should have ensured the cat was cared for one way or another.", "NTA, thank you for caring.", "NTA\n\nHe left the animal.  He gets to pay the fee to the city for his animal at large", "Sounds like any further discussion with your former neighbor about the cat is pointless.  You did what you thought was the right thing to do at the time with the information you had.  \n\nI wouldn’t be available for any further discussions with the former neighbor anymore.  You are not responsible for the fine. He is.  It is his cat and he made the choice to do what he did. The consequences from his choices are his to bare not yours.  \n\n\nNTA.", "Sounds like any further discussion with your former neighbor about the cat is pointless.  You did what you thought was the right thing to do at the time with the information you had.  \n\nI wouldn’t be available for any further discussions with the former neighbor anymore.  You are not responsible for the fine. He is.  It is his cat and he made the choice to do what he did. The consequences from his choices are his to bare not yours.  \n\n\nNTA.", "NTA\n\nhonestly its clear they don't know how to take care of the cat because they'd either ask a neighbour or friend to check in on the cats or even hire a pet sitter. its also concerning he's unneutered + outdoors and his collar came off that easily. if they left the cat like that they should not be surprised if it disappeared in general. don't even think about paying the fees since if they realized they did something wrong they'd put down the money to get him out and not abuse him anymore", "NTA - they left a house cat outside for a week without fresh food and water. These people can suck it.", "Whenever I leave my indoor cats for a WEEKEND I always fret about their food and water. They have auto feeders with battery backup, and a water fountain (no batter backup option). We always leave an extra big tub of water just in case. If we need to leave for a week, we either take them with us or arrange care.", "By day 3 at most the cat would have been mine.", "I am in agreement with you.  Even for your own story. Homie waiting 3 weeks to put up missing papers, clearly they didn't care about the cat they just wanted its emotional support.\n\n Same thing for OP story. If they had actually cared about the cat they would have asked a neighbor to check in on it.", "Thank you for seeing neglect and acting. You did well.", "Sorry that happened to you .three months is absolutely a reasonable timeframe to rehome an abandoned animal. The slander came from a need to blame someone else for their neglect. You did a good thing.", "Happier/more bittersweet story:\n\nTotally different city, next door neighbors (who shared a parking lot with us) had “adopted” two teen cattens but were keeping them on the porch. They kept demanding to be let into our place, but our cats already wanted to murder them and our landlady knew about them and wouldn’t allow it. We provided supplemental care and nudged as much as we could, and eventually one day one of the cats disappeared. We finally got the owners to agree to rehome the remaining cat, and now she is very sleek and happy and safe with a friend of ours. I like to try to believe the other cat got taken in cause she was super friendly. 🤞🤞🤞🤞🤞🤞🤞", "Yes.", "No , the phone number was on the cat’s collar, which he had lost. I’m “friendly chat in the street/over the fence “ but don’t have many of my neighbours numbers.", "Right? If my cats get left for the weekend I leave them at least 3 bowls of water and so much food. I worry about them a lot. Any longer and I get someone to check in on them and give them pets and stuff. I can’t imagine leaving them outside even overnight (but mine are indoor only) let alone 5 days.", "In the winter I feed feral cats in our detached garage.  For water, I got a big pet bowl with an electric heating element.  It's not hot, but it is always above freezing.  And I have a trail camera to keep track.  It turns out the raccoons will drag the food dish over to the water bowl, and settle their butts in, having snacks to go with their full, raccoony spa experience.", "NTA. Neighbor abandoned the cat and only came back after catching flak for said abandonment.", "Please report your neighbour to the SPCA for animal abuse and abandonment. Also to the shelter so they won't give the poor kitty back to this Ahole.", "Cats already hate the stress of moving. It is better not to tear them away from the place they know until the new place has some familiar things set up in it, if you have a choice. But that doesn't mean leave it alone outside for five days!", "Do not feel guilty about this. They essentially left their cat without a thought about whether it would die or not. They are not good people.", "So can people, that doesn’t make it ok *at all*.", "The poor thing was rehomed in the middle of winter.  It had lost a bunch of hair due to the fleas and ticks in the warmer months, and it just kept getting smaller and thinner.\n\nI know the reason it kept coming onto my porch was because it was trying to escape the wildlife and my security cams activate flood lights, which scared the predators away.  As soon as I saw a fox come 1/2 way up my porch steps after the cat, I decided she had to have a new home.\n\nI did not want to see her get eaten on my cams.  It was gruesome enough watching the opossum get eaten.", "Then I'd say NTA. You were looking after an animal you thought was abandoned. That's on them, and I wouldn't pay their fee to get him back.", "NTA then.", "I have never seen a raccoon harm a cat, and I have lived in a rural area with cat ladies who had tons of cats, who also fed the raccoons. Everyone got along just fine. Cats don't attack raccoons so they see each other as equals. We have raccoons and foxes here and they don't bother my cats at all.", ">You forgot to mention the not neutered bit.", "We bought a house and I disagree. We slept with the cat, on night 1. \n\nLawn chairs and sleeping bags. \n\nKitten-Cat has been my shadow for 9 years. Pretty sure I know her better than you.", "How many days worth of food do you leave for 5 days? Because one of our cats would have it all gone by day 2 - and that includes her brothers food as well.", "You Google it ya fuckin idiot. https://www.hillcrestanimals.com/site/blog-memphis-vet/2019/11/26/10-reasons-why-your-cat-is-not-eating#:~:text=Cats%20can%20survive%20for%20about,in%20a%20day%20or%20more.", "True, but what exactly do you think animal control is going to do with 1 more cat? I'd take hungry and alive at home over imprisonment and inevitable early death.", "Typo?", "As a mediator on behalf of the raccoons, they are practicing good hygiene practices the best they can. Hard to get a non-paying job as a rodent to afford hand sanitizer or soap", "Tbf my dog would basically do this with his water", "I dunno about cats, but I have seen raccoons go after dogs more than a few times. I think the scaredy cats just know better?.", "Raccoons will mess up pretty much anything if they decide to.\n\nAnd, if they are hungry enough, they will totally kill and eat cats.", "Congrats on your not-dead cats,  lots can't say the same.", "Raccoons absolutely will attack a cat.  If the cat isn’t submissive and tries to fight they will be killed.  My family has been in wildlife control for over 30 years and seen this dozens of times", "I didn't forget, I just don't see how that's relevant. Abandoning a pet outside is AH behaviour whether or not the animal is fixed.", "My friend found out his cat had teeth trouble when he came back from vacation to find her hungry and most of her dry food remained. Got one tooth removed and now she eats dry food again. But that was a life lesson to always have someone to check in on cats because you never know when they'll develop problems.", "Oh that's for sure lol. Had to switch from food out all day to a set feeding time, and oh boy does she know her feeding time 🤣", "That depends on where you live, though. If you’re by a major city, especially one that’s surrounded by more rural areas, cats rarely get put down. They’ll get adopted out as barn cats in the worst case scenario.", "I'm a cat person as well, and I used to be generally 50/50 on outdoor-cat ideology (not including barn-type cats who have the specific job of pest control). The main argument against it for me is life expectancy goes down like 10 years for outdoor cats, from disease, fights, and cars. What tipped the scales entirely was this exact point being brought to my attention. House cats that end up strays or feral are invasive and kill a lot of non-pest wildlife. \n\n(NTA, calling animal control after 6 days of clear evidence of abandonment and neglect is extremely reasonable)", "I was with you until you called raccoons rodents, lol.  Not even close.  😂", "If a raccoon goes after a dog it is probably bc dogs will try to fight a raccoon. Dogs are way more territorial than cats, or rather, they have a different concept of territory than cats do.", "Honestly, the birds of prey we have here are much more worrisome. Eagles have been known to carry cats off to the nest. We live next to a stand of old growth trees so the cats do have that protection, however we have owls as well. \n\nYes, letting cats outside can be dangerous, but my cats have chosen that life. We have two cats that do not go out, but my female cats were raised in a barn before we got them and they insist on going outside.", "I didn't say I'm an expert but in my experience it's never been an issue. The cats and raccoons in question were/are very tame. \n\nWhere I live now it's somewhat rural, but the animals here coexist with humans and domesticated animals. \n\nI don't even see the raccoons here, but we do see the foxes bc they are so numerous. My husband has observed our cat playing with the foxes in our backyard.", "Or we just don't know what emergencies would require us to need to call a neighbor instead of family, friends, or 911?", "That's exactly it. I grew up with outdoor cats on the dairy. They hunted mice. I also grew up with housecats who went outside. They slaughtered birds and other native wildlife. I love cats so much, but invasive feral cats are the third largest cause of species going extinct, behind rats and, obviously, humans.", "Cats can be downright mean if they feel like their territory is being invaded especially if it's other animals. Dogs can too obviously", "You're the pet owner. If they're hurt, it's on you, not them.", "Socially it’s different. Environmentally it’s not, unfortunately.", "LMAO they’re an invasive species in Europe too.  All domestic cats are descended from the North African / Southwest Asian wildcat.", "Why would you say no to someone checking on your cat? Even if it hates strangers, batteries can die and power can go out as far as the auto feeder. Plus no cleaning of the litter box for three days??", "What if you aren't home? Lol it's needed", "They are. It's just more socially acceptable so people make up all kinds of bs", "They do hunt birds and small mammals in Europe, but there were already wild cats before there were domestic ones, plus other small predators that fill a similar ecological niche. They haven't stormed in and torn apart the balance. They've also been present for a lot longer.", "Maybe I'm mistaken, but cats were brought to North America by European colonists, so they are definitely invasive to North America.  As far as Europe goes, I am not as knowledgeable, I figured that cats have been around in Europe much longer than North America and I know in the UK cats have the right to roam.", "Native species in areas the cats frequent have not gone down apparently, it's the farming practices and other removal of natural habitat that are killing the wildlife in Europe.", "Cat hates strangers. You don't think we have back ups and fail safes?\n\nShe has 3 sources of water, two for food and two litter boxes.\n\nEven if the bin is empty on the feeder, she still has dry food in the tray for days. \n\nWhy you riding my ass?", "I would never trust automatic feeders either. I would never use them if I were going to be away for long, although they are handy for morning feedings so you don't have to get up, or if you are late from work.", "They’ve been invasive in Europe longer, that doesn’t mean they aren’t invasive, lol.", "Because your house probably has doors. There was a post not too long ago about a pet owner distraught because their cat got trapped in a room while they were gone for the weekend, and didn't have food/water/etc in the room.", "There have been studies that show that the cats don't have much of a negative effect, the main problem are the destruction of natural habitat by farming etc.", "Don’t pay anything! They should have hired a pet sitter like any responsible pet owner. A neighboring teenager or preteen could easily feed and water the cat- who should be indoors. \n\nYou were the only one who acted responsibly for this poor cat. Don’t back down.\n\nNTA", "NTA - Your neighbors are. They abandoned their pet, assuming it would survive on its own. But they really didn't care.", "Nta", "NTA. tell him to get lost", "NTA\n\nDo NOT pay that fee and set up that precedent. Neighbor sucks. This is how I ended up with almost 20 cats at one time, people abandoning their animals when they just can't be arsed anymore.", "Nta did you explain the situation to animal control. If you did they might not even give the cat back since I think it would count as abuse.", "The small town I live in is very aggressive in picking up cats roaming outside, collar or no collar.  It's very hard on the bird and small animal population around here and the cat population is exploding.  If they have a collar they check with the owner if they are able and the person can pay a fine and get the cat back.  No one should just let their cats run wild outdoors.  You are NTAH.", "NTA. That cat for all intents and purposes was abandoned. If the owner didn't want the cat at the pound he needed to have taken the cat with him to start with-or at the very least asked you or another neighbor to keep an eye out for him.", "Nta. So they thought it was okay if their previously indoor cat starved for several days until they felt like getting it? They're terrible people. I'd call the shelter and let them know they abandoned their cat", "I don't think anyone can fault you for caring about an animal. compassion is a very positive trait.", "Oh Hun. Absolutely NTA. And don't give him a dime. Abandoned his pet, didn't properly provide, and clearly hasn't had the kitty to a vet either. Next time get the kitty fixed and find it a new, indoor home", "NTA. Even if the neighbor had asked others to feed the cat, which is doubtful, an unneutered male cat should never be left outdoors alone. Tomcats are notorious for getting into nasty fights that can result in serious injury. They are also at high risk of contracting FIV. Their tendency to wander great distances in search of fertile female cats makes them more likely to get hit by cars. The neighbor was negligent for letting the cat outdoors at all, even before leaving town.", " You did great. \nThey’re awful pet owners & shouldn’t be allowed to own any pets.\nWell done for being kind and doing the right thing for the cat.\nDon’t let your neighbours bully you or anything over this. Stand your ground. Your two cats are beautiful btw! 😍", "Definitely NTA. they left the cat alone for days and basically .. neglected it. Sounds like the cat is better off without these people to be honest. Have them go to a home where they’re actually properly cared for.", "I guess if depends whether or not this is one of those places that will euthanize the pet or find it a new home.", "I think im going to be in the minority..but YTA...i just left my cats alone for a week while i went away....my dad stopped in and fed then so they where fine..but last trip i took i had a person who lives nearby do it for me...im not sure..but i dont think she actually did anything except right before i came home...this could have been the case here. Your neighbor may have made arrangements and whoever was supposed to be taking care of the cat didnt do their job...you should have fed and water the cat..and then talked to your neighbor when they returned...if they didnt return in 10 days or so..then maybe call animal control...however...you live next to these people not me...so your in a better place to judge what kind of pet owners they are in general so take my yta with a grain of salt.", "YTA.  Sending the cat to the pound was your idea, and it doesn't solve anything for the cat, especially if we are talking about an outdoors neighborhood cat taken away from its environment.", "NTA. Leaving an animal without food for five days is horrible. They could have at least had a friend come by and check on the cat to ensure it had food, etc. The cat deserved better.", "Definitely NTA!!", "Update, apparently they *did* ask someone, but evidence says otherwise. Raccoons live in our area and rats.", "He’s at a shelter (no kill policy) . And as of this morning, still on the website.", "I was in the same boat. I live in a Building complex with animal restrictions. New ppl moved in and they had this cute orange kitten that would get out. Our complex has ppl who don’t pay attention when they drive, and this cat would dart in and out of traffic. I started feeding it and leaving water out for it. I had a cat that was not fixed at the time and we couldn’t have another cat due to the restrictions. We started seeing that the cat had a shorter tail so after petting it and taking a look at it we noticed the tail was eaten off. That was the final straw for me. Both me and my neighbour decided to find a new home for the little guy. He’s now fixed and has doubled in size and my neighbour told me her grandkids absolutely love the little guy. We ended up reporting the owners to the the local spca and the building managers. Turns out they had six animals over the restricted amount. 3 French bull dogs, 1 bird, 2 snakes, and 2 other cats. Not to mention the excessive amount of extra ppl living in the building. Everyone was shocked when the police and animal control showed up. We kept quite about the little guy.", "I acted upon the information I had at the time. I didn’t know that they were returning that night. Turns out it’s $45CAD, and he’ll have to pay it to get back the cat. If he wants to “bill me” I’m curious if he’ll be that petty.", "Thank you. This is possibly the most comprehensive and calm answer. Very much appreciated when I was double guessing myself.", "Bylaw officer got the whole story, and I did speak with the shelter this morning to see if any charges were filed. Bylaw chose to waive any additional charges.", "Australia is really cracking down on cat bylaws for this exact reason, too These bylaws are technically in place here, in Canada,but very loosely enforced. \n\nMy two cats have a large outdoor “catio”", "He feels that he did have someone checking up on his cat, evidence said otherwise. I absolutely would have been over to check regularly, had they asked.   He feels I should have “asked around the neighborhood “ more.", "Thank you. I’m gaining more conviction in my beliefs with every response I read.", "No it’s a municipal shelter that’s No kill, that strives to reunite lost pets with owners.  My neighbour knows where his cat is, and he’s up on the website.", "I honestly did not know this was an option, having been the owner of idiot dogs that would manage to harm themselves if left alone for more than a workday. We recently got a cat and I hired a sitter for an overnight oot just like i would have with the pups lol. Maybe I'm too hung up on a pristine litterbox?\n\n5 days is abandoning your pet. I hope the shelter won't give him back unneutered!", "Same.  The longest I'll leave mine is 2 nights, and then I'm rushing back the next morning.  They have water and food upstairs and down, I leave them extra canned food, and they have a water fountain.  \n\nAnything more than that and my pet sitter is coming over daily.", "He’s lying because he’s pissed his actions have consequences", "Don't give him any money for the impound fee, fuck him. Also if he can't afford the fee, he can't afford the cat and frankly does not deserve the cat.", "Don’t.  Those neighbors are terrible cat owners and should not have pets", "I would feel weird about it too, I don't like conflict especially with neighbors, but you absolutely did the right thing.  \nThey also need to get that cat neutered.", "That was definitely my thought when he was yelling at my husband last night. Shifting blame. I absolutely would not have intervened if the cat had been receiving necessities of life, I would have just continued to internally judge them.", "Turns out it’s only $45. Bylaw officers didn’t tack on any infringement charges .", "I went for a long walk last night, and came to the conclusion that at the core of my heart I stand by my decision 110%.   I chose actions for the information I had. I feel better after a sleep and waking up to 300 comments of mostly solidarity.  Thanks.", "Turns out it’s only $45 CAD. He’ll have to pay it to get cat back. I’m curious if he’ll have calmed down overnight and will still try to “bill me” Bylaw officer didn’t add any infringement fines.  Should he need to talk more about this, I’ll definitely offer my excellent cat sitting services.   Thanks.", "Aww, [same here](https://imgur.com/a/VCniUUU)! Hard to accept how old my babies are getting (12 and 16)", "Off to r/vorties!", "Thank you for such an assertive response. Turns out the fee is $45CAD, I have no intention of reimbursing him. \n\nI’m naturally a peacemaking personality and have gained much confidence from some of the comments in this post.", "I’ve considered this, and upon learning it’s $45… I will not reimburse them and I still don’t feel like they are going to learn a lesson.", "Turns out it’s $45CAD. , I’ve decided not reimburse them, should they ask. And I’m not actually sure if he’s gone and picked up his cat. Time will tell.", "Raccoons will attack cats out of competition for food, particularly little ones.  \n\nThere was a colony of feral cats next my husband's shop that he would take food to.  Kittens abounded every spring.  I now own grown cats who as kittens had gotten in the way of a raccoon at the food bowls and were so badly injured I had to capture them. One had it's mama and sister killed. After treating them I couldn't bear to return them, motherless, to the colony.  So now I have Captain and Pim...the raccoon survivors.", "My former cat was injured by a raccoon.  We had seven living in trees in our yard (Until the German Shepherd moved in--they moved on).  My cat was on the deck. She got injured by one of the assholes. They would come into my house if a boy left the patio door ajar to steal her food. They are masked bandits for real.", "Ah, word, he still sucks though", "Long lives to them 🤎🧡🖤", "Honorary rodents. Like how bats are bugs.", "Notably the wild cats have been displaced and are nearly extinct thanks to feral domestic cats. And ferals are much higher density than wildcats ever were, meaning they kill much more.", "You must have a really hard time in life if you think someone pointing out that unexpected things can happen is \"riding your ass\" lol", "I use them myself, but if I'm away, the person checking on them double checks it's still powered on every day and gives them a little additional wet food. I wouldn't rely on them alone for longer than a day just in case", "NTA.  If they had left a human child for 5 days, CPS would get involved and the child would be taken.  Non human children should be treated no differently.  Especially if they are unable to hunt for their own food.  Thank you for taking care of the kitty that they couldn't bother with.  Pay the fee IF they push for it, otherwise, enjoy your life knowing that you saved one.", "NTA. Cars should not be allowed to run loose EVER. Wild bird populations have been steadily declining for years and releasing invasive predators into their world is not helping. It’s estimated cats kill well over a billion songbirds every year. This number leaves out other beneficial animals they prey on. You were kinder than I would have been, I’ll just put it that way.", "NTA. One day is one thing but several days.", "NTA.\n\nI owned cats before (2 at a time), and we've gone on week-long vacations too. They got left *inside* though, with extra litter boxes out everywhere, extra food left out, extra water bowls (with ice so they replenish some) and the toilet seats to be left open in case they need more water. My in-laws have one cat, and they go on trips, but they make sure someone can stop by every few days to check on/hang out with her because she gets lonely.", "NTA\n\nYou did right by the cat and the evidence you had indicated the cat needed some help.\n\nI did the same once, brought a cat I thought was homeless to the local humane society. I loved her but I had three cats already, and two dogs. \n\nShe turned out to belong to a neighbor on the street behind me but this neighbor's other cat kept driving the sweet one away. The neighbors and I got to know each other due to my dropping their cat off at the shelter and eventually they let me adopt her. She was a darling girl, RIP Callie!", "NTA unless the cat went to a kill shelter.  Otherwise you helped an abandoned kitty.", "NTA. Our local shelter does pet sitting when people are away. Or they could have asked a neighbor (e.g. you) to check up on them. This is totally unacceptable.", "YTA - You ain’t got nothing else better to do", "NTA and I'm really just commenting to tell you that your cats are BEAUTIFUL", "NTA. I'd let the shelter know what he did. He doesn't deserve a cat back he abandoned. And he did abandon it. Definitely do not pay a dime.", "Do NOT pay the fee so these people can get this cat back to just neglect it again. \n\nThey don't want to pay the fee because they think the animal isn't worth it.", "ESH - You could’ve fed/watered the cat & had a conversation with your neighbor when they returned. Instead, you caused that cat a TON of undue stress and if that owner hadn’t returned in that short a time, that cat could have been euthanized. And, you trespassed!! Yes, the owner wasn’t super responsible either but really YOU BOTH SUCK!", "Totally agree. When we leave - even just for a weekend - we hire one of our daughter's friends as a house/cat sitter. He gets a house to himself, with a full fridge and wine cellar, plus $50/day. Our kitty gets food, purrs, and someone to sleep on. Plus my garden gets watered!", "Thank you. Another set of facts to my arsenal should I have any more confrontation with my neighbour. \n\nApparently there was someone “dropping by” to feed him, but I suspect the raccoons got most of the food.", "Apparently, there was someone “dropping by” to feed him, but I suspect the raccoons got most of the food.", "Then there's nothing at all to worry yourself about.\n\n(Even if it wasn't I'd say NTA)", "Cats are better than dogs in regard to being able to leave them for a couple of nights as long as you have prepared for it. Fresh litter box, plenty of food and water, and making sure they can’t get outside through an open window or something. It works better if you actually have multiple cats because they can hang out with each other, if I had one I probably wouldn’t leave them home alone for a weekend because the poor thing would probably be bored and lonely as all hell. \n\nAlso make sure they have lots of interactive toys too ♥️ \n\nI totally agree. Five days is absolutely horrible. Definitely animal abuse, and they shouldn’t get the cat back at all. I know for some people it’s controversial, but having an outdoor only cat (to me) is already bad enough. Add on starving it and depriving it of fresh drinking water? Yeah, they don’t deserve a cat.", "They won't. They neuter every cat or kitten that comes in. Every shelter does.", "I will not hold my breath!", "Raccoons do fight with cats and both animals are negatively impacted because saliva, blood interaction spreads disease. There are diseases cats can carry that will wipe out a racoon colony and  raccoons can carry rabies. So it is a bad interaction for the cat and the racoon.\nI would also think if there are raccoons there are probably coyotes and they will definitely eat a cat.", "Depends on the cat. Mine has always been checked on so he gets his wet food if it's more than a weekend, but like... You could leave the bag open and laying down and he'd only eat when he was hungry enough to get off his ass. Even our former stray doesn't really binge anymore now that he's not starving.", "I hope you don’t apologize. I know how hard it is to not cave to irrational people, but you certainly did the right thing!", "I managed an outdoor colony of cats for 20 years. I did TNR and got the friendly ones homes. It's possible to have an outside semi feral cat and still not be negligent. \n\nBut this particular cat was abandoned and looking for help. NTA", "Pigeons are also honorary rodents.  Deer might be as well.", "No. In Scotland the population is extremely vulnerable. As a whole European wildcats are considered a species of \"least concern\".\n\nAnd while I daresay the ferals don't help, widespread human encroachment and deforestation are much bigger issues.\n\nCan't have a forest dwelling species if you cut down all the forest.", "Nope. I learned years ago most people are unreliable. \n\nMom told me a cousin was gonna check on her cat when she went to Houston for cancer care. I spent three days with her cat. Cousin \"forgot\".\n\nAsked our nephew to water our yard, with pay. Came home to messed up blinds, broken lamp and drug paraphernalia in husband's truck. \n\nPeople suck!", "Daughter's dog trapped itself in the bathroom while she was at work. Tore up the door, frame and wall, trying to get out. \n\nMy cat opens doors."]}