{"id": 15165, "submission_id": "12rnmhs", "title": "AITA for telling my grandparents I won't go to their party since my estranged father will be there?", "selftext": "I (20f) have been estranged from my father for more than a decade. He and my mom divorced when I was 5. My mom was his second wife. His first wife died about five years before my parents met. He had no kids with her but had wanted them. He never got over his first wife. She was always his one and only. But everyone was concerned about him and encouraged him to seek help and move forward with his life and his brother told him finding someone new to love would help. He met my mom and decided he would just pretend she was his first wife or something. Mom had some concerns but he told her all the right things and she was young (21) so she naively thought it was just how serious relationships go.\n\nWhen mom was pregnant with me she developed eclampsia and I had to be delivered by emergency c-section. On top of the seizures mom had a pretty major bleed. She didn't come around for a couple of weeks. In that time my father named me... after his late wife. Had all the paperwork submitted and everything while mom was sick. It was the beginning of the end for my parents even though mom stayed married to him for a few years after that.\n\nAfter the divorce my mom had primary custody and my father saw me every other weekend. He very clearly never wanted me. I hated being called his first wife's name, I hated how he would only talk about her. One day when I was 6 I told him he didn't love me he only loved her and he said that was right, that he loved her and only her and he never should have pretended he could ever love another woman or love children who were not born from her body. He said the only way he could tolerate me was by giving me her name.\n\nMy mom eventually helped me change my name, something that was complicated to do, but by then my father was no longer in my life.\n\nHis parents were and they were good to me. We are close. But now they are celebrating a milestone wedding anniversary and they want me to attend while my estranged father will be there. I have not seen him or been around him for 10 years. I don't want that to change. They still want me there though and begged me. I told them I won't go since he'll be there but we can celebrate on our own before or after. My uncle said I should be there for them and I should give my father a chance, that maybe he's found a way to love me and want me in his life, that I should have compassion from him, he's all messed up, and even if he's a dick, my grandparents aren't.\n\nAITA?", "created_utc": 1681897603, "permalink": "/r/AmItheAsshole/comments/12rnmhs/aita_for_telling_my_grandparents_i_wont_go_to/", "score": 623, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my grandparents I won't go to their party since my estranged father will be there. I know my grandparents want me there and they have been so good to me and they love me and I love them. Maybe I am being unfair by digging in my heels like this. They aren't to blame for what their son did.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, I'm sure your grandparents are wonderful but as you said, you can celebrate afterwards on your own. He does not deserve a second chance unless he apologizes and makes some effort.", "NTA. What your dad did was sick and twisted on multiple levels. Your grandparents aren't necessarily AHs either, though. Even if you are 100% the victim and he's the violator, they clearly feel sorry for him and they're caught between two people they love.", "NTA, your father made everything clear to you as a child. He may have changed, you may go and find that he has realised his wrongs but it's your choice if you want to let him back into your life and in your position my answer would also be a very firm NO.", "NTA You don't have to put your feelings aside. He's had ten years to 'find a way to love you' and let you know.", "NTA...you don't have to make any accommodations for your father. You suggested a compromise and that's going to have to be good enough for everyone.", "NTA.\n\nWhat your “father” did was very traumatising. Having to see him again at the party could be very triggering and difficult for you. I am assuming this since you don’t want to see him.\n\nIf this is the case, the party will not be any fun for you. Having to smile and look happy to not make it “bad” for your grandparents will add another layer of trauma. It won’t just be a few hours, it will affect you before (anxiety about the event) and after (dealing with the trauma).\n\nIf your father wants to talk to you he can contact you after the party. You can choose to let him in or not.  You owe him nothing and those who try to force you can pound sand.\n\nI hope you are working with a trauma informed therapist.", "OP, listen to me very carefully.  Do not go to that party.  Your grandparents likely will use the party to try to get you two to talk to each other.  It’s not worth it.\n\nNTA, but you’ll only be doing yourself harm if you go.", "NTA you offered to celebrate with them separately. Its funny that if you turned down the invite for any other reason there probably wouldn’t be an uproar but because the reason is due to their child they want you to make amends. They should be telling their son he’s an ass and needs to make up with you before the party my guess is he’s still an AH and refused his parents request so now they want you to be the bigger person. No disrespect to them for wanting their family together but they are AH. Your uncle needs to never give anyone advice his record for that sucks, he should be telling his brother to seek help and grieve his wife appropriately.", "NTA: Always hated that the person who is wronged has to be the bigger person. \n\nYou offered to see them beforehand there no reason to make things awkward being around your sperm donor.", "NTA, but my only thing to consider is whether someone who obviously isn't worth a moment of your time is worth losing the relationship with your grandparents? I'd go, be confident and calm, ignore him completely and enjoy a party with people who you do get along with.", "NTA. And honestly, if reconciliation were to ever happen between you and your father, a party isn't the time or place. I think that might be an angle to try with your uncle and grandparents. They don't really want this awkward elephant in the room at their party of all things, do they? It's not going to be some heartwarming Hallmark movie experience, like your uncle is imagining. I think your compromise was valid, and they can take it or leave it. If they really love you, they'll get over it.", "NTA. The only way your father could *tolerate* you was by giving you her name? Seriously?! \n\nYour grandparents and uncle know this. They know he’s not been in your life. A parent shouldn’t have to “find a way” to love or want you. I know family gatherings are really hard when you can’t go cause he’s there, but stand your ground. His side of the family isn’t going to stick up for you, you’ll have to do it yourself. Maybe offer to celebrate privately with them on a different date. \n\nNTA at all. And, in case it hasn’t been said, I’m sorry for your loss. You’ll always hold some grief for the man who your father should’ve been.", ">they want me to attend while my estranged father will be there.\n\nAt this point in time, your grandparents must know that if they host an event they can have you there, or they can have your father there, but they can't have both. By inviting him, knowing this, they are effectively choosing to exclude you. Your suggestion to celebrate with them on an earlier date is a reasonable one, given that they've made it impossible for you to attend the event itself.\n\nAs an addendum - if they're hoping to engineer a reconciliation at this event, please help them understand that this is not the time or place for it. If your father had approached you separately wanting to make sincere amends, that would be one thing (though I don't personally think you should let him back in your life, even then). But throwing the two of you together and hoping that the pressure of all the other family there present will make you hug and make-up is guaranteed to end badly.", "Celebrations are NOT the times for reconciliations.  \n\nReconciliations should be done slowly, and on neutral ground.\n\nNTA", "NAH apart from dad and uncle.\n\nGrandparents are caught between two people they love- and on their own they haven't done anything wrong. You are completely justified in your stand.", "YTA. You don't have to interact with your birth father, and you absolutely aren't required to get to know him or be his friend AND YOU ESPECIALLY DO NOT HAVE TO FORGIVE HIM. He was clearly actively harmful to you, and you are probably a million times better off without him.\n\nThat being said, this is a party for your grandparents, about your grandparents. You should make your decision about them, and go, but bring along a friend or partner to help you. Also, especially after you've made it so clear you don't want to be around him, if you go, even for a short time, that will mean a lot to them, since they'll know how much you are doing for them by coming. Also, you can always leave early.\n\nHaving a person specifically there to be on your side and run interference on any attempts that might come from well meaning nincompoops will be a great way to protect yourself. Make sure to brief your friend a few days ahead, or even weeks ahead, and if you have them, give pictures and names to the friend, as well as info on what to expect.", "NTA for your feelings on the situation. I’m so sorry that you have this in your life. By no means am I trying to belittle your feelings in this next statement- all families have their issues some worse than others. Your grandparents matter to you and vice versa. They are also parents to their son, that though has made terrible life choices, they still love too. Now you are faced with a very grown up decision to set aside your resentment of your father for one day for the love you have for your grandparents. You will not have them forever and you need to reconcile for yourself if giving them what they want for this one day is worth more to you than not ever seeing your father. I respect how difficult that is knowing that in the moment it will cause you pain but will it cause you pain in the future if you regret not going for your grandparents?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (20f) have been estranged from my father for more than a decade. He and my mom divorced when I was 5. My mom was his second wife. His first wife died about five years before my parents met. He had no kids with her but had wanted them. He never got over his first wife. She was always his one and only. But everyone was concerned about him and encouraged him to seek help and move forward with his life and his brother told him finding someone new to love would help. He met my mom and decided he would just pretend she was his first wife or something. Mom had some concerns but he told her all the right things and she was young (21) so she naively thought it was just how serious relationships go.\n\nWhen mom was pregnant with me she developed eclampsia and I had to be delivered by emergency c-section. On top of the seizures mom had a pretty major bleed. She didn't come around for a couple of weeks. In that time my father named me... after his late wife. Had all the paperwork submitted and everything while mom was sick. It was the beginning of the end for my parents even though mom stayed married to him for a few years after that.\n\nAfter the divorce my mom had primary custody and my father saw me every other weekend. He very clearly never wanted me. I hated being called his first wife's name, I hated how he would only talk about her. One day when I was 6 I told him he didn't love me he only loved her and he said that was right, that he loved her and only her and he never should have pretended he could ever love another woman or love children who were not born from her body. He said the only way he could tolerate me was by giving me her name.\n\nMy mom eventually helped me change my name, something that was complicated to do, but by then my father was no longer in my life.\n\nHis parents were and they were good to me. We are close. But now they are celebrating a milestone wedding anniversary and they want me to attend while my estranged father will be there. I have not seen him or been around him for 10 years. I don't want that to change. They still want me there though and begged me. I told them I won't go since he'll be there but we can celebrate on our own before or after. My uncle said I should be there for them and I should give my father a chance, that maybe he's found a way to love me and want me in his life, that I should have compassion from him, he's all messed up, and even if he's a dick, my grandparents aren't.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH - (except your dad obvi) - you do not have to subject yourself to this person who has caused you trauma but I think its important to acknowledge that your grandparents are not AHs for wanting you there and your decision will impact your relationship with them, but it is yours to make.", "[removed]", "NTA. This man manipulated a young woman into giving her the child he wanted with his first wife, named that child behind her back and then was emotionally neglectful (before being physically absent) punishing you for literally existing. A person's most formative relationships are those with their parents and you were failed by one of yours. The impact that would have had on your self-worth as a child and have had to carry through to adulthood is something your uncle - who appears to have had good formative relationships - could never understand. \n\nTo ask you to put aside your feelings for a man who could never deal with his own enough to show up and be a good father to an innocent child is selfish and, quite frankly, hypocritical.", "NTA. I know your uncle and grandparents probably means well, but well-meant intentions don't mean anything if the outcome is as bad as this is probably going to be. It's just thoughtlessness at that point.", "NTA - you protect yourself. You were neglected and abused by that man and it’s a shame your grandparents chose him, but they did. If he was truly sorry and had truly grown he would be on his knees begging you for forgiveness.", "NTA\n\nINFO: if you told your uncle/grandparents that you will agree to go but will not speak with him and they have to agree not to put you in a position to try to get you to speak with, what would they say? What would they do if he hasn’t changed and says something to hurt you? My point is you can use this as way to show how happy you are without him and obtain some revenge for abandonment but I wouldn’t want to put you in a place where you could get hurt", "That may not be possible for OP to do. Trauma is not so easy to ignore.", "OP, you are NTA.\n\nThat said I’m going to tell you a story and let you decide if it will work for you.  I’ve been NC with my mother for over 15 years. A few years ago my niece passed and while “supporting” my brother she spent the entire first day moaning about our NC and she had no idea why I would do such a thing. Because I love my brother and I’m willing to be a liar I spent an hour on the phone with her giving her no actual information about my life, leading her to believe we would have coffee together and talk when she was done and that she should support him now. Once she was home I reestablished NC and went on with my life. \n\nIf you think you can do it, go to the party, treat him like an old friend of your grandparents that you should be mildly polite to and keep moving. Never be alone with him and every time he tries to corner you, see something you need to do, someone you have to talk to etc. \n\nIf you are even thinking of trying this talk to grandparents first. If they are willing to accept the compromise of “I’ll be at the party at the same time but it’s inappropriate to attempt a reconciliation in a crowd” that’s fine but if there is even the slightest push for more, it’s a trap and stick to your celebration at another time plan.", "Yes, he was disgusted that he had a child with someone else, had married someone else. He didn't want me to exist. I might be his flesh and blood but I was his biggest regret (his words) and so was my mom.", "I don't really think he will ever approach me for that. I will never be the child he wanted and I don't think he will ever be sorry for that. But I will try to explain what you said to my grandparents.", "I do understand that and as sad as it makes me, it's the only way I can imagine myself proceeding.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I didn't say to ignore the trauma, I made a suggestion with my judgement. OP can choose what they wish to do based on how they feel.", "Good luck OP, my heart goes out to you.", "I was thinking this as well. I also suggested in my comment to bring along a friend or partner whose specific job is to run interference if anyone does try to make them interact or make them be friends. After all, the party is for the grandparents, about the grandparents, so there may not be much focus on this man and op, and a friend being present might also ease the situation.", "NTA - “MAYBE he’s found a way to love you?!” Your uncle has lost his mind. You do not owe your grandparents your mental health. If they truly love you, they will not penalize you for not wanting to put yourself in a painful situation.", "I presume this uncle is the same one who told his grieving brother to marry a young, innocent woman under false pretenses(yes, I'm sure he didn't say it that way).   Feck Uncle.\n\nYour father emotionally and mentally abused you and you absolutely get the right to NOT be around him.  If your father HAD suddenly found a way to \"Love\" you and want you back in his life--he's had time(14 yrs) to figure that out and approach you--I don't buy that he'll magically be Dad of the year here.\n\nYou've offered your grandparents and alternative, but forcing you to be around your Father is cruel.  Don't be cowed into submission by guilt or \"but family\".", "NTA. Your uncle is talking nonsense -- if he were right, your father would have contacted you already. You're still working thru the trauma of having this grieving broken man as a father. Be good to yourself and don't let anyone emotionally blackmail you. NTA. NTA. NTA.\n(And good for you for changing your name!)", "A kid should never be in the position of begging a parent for scraps of affection. He told you he'll never be able to love you (WTF!) why subject yourself to that again . I would cut him permanently out of your life.", "NTA Your \"father\" is an absolutely disgusting human being. Saying all of that to a young child?! He's clearly not mentally well. I hope you have had a chance to get therapy and work through all of that. I feel like your grandparents are setting you up to see him and maybe your \"father\" is in on it. I would NOT go!", "NTA, your uncle is 100% wrong you don't owe him a thing. He has made zero effort to make amends its not on you to make that happen and that's only if you wanted to do so. It's a shame they're trying to force your hand here but protect yourself.", "NTA. I have a strange feeling something's up. Perhaps your someone thinks that you won't cause a scene on family gathering and therefore you'll be forced to interact with your DNA donor. It's just a bit sus.", "NTA. They may have their own reasons which doesn’t necessarily make them assholes but you certainly aren’t.", "NTA - you uncle needs to stay out.  I feel sad for your grandparents but I would setup a dinner or something that maybe you can pay for and take them out on a different day.  Simply tell them that you don't want to ruin the party for them because you don't know how you would react to seeing your father.", "NTA it is your right not to be in the same room as him and you can celebrate on your own with them, before or after. Your uncle is projecting emotions feelings and ideas onto your bio father that he just doesnt have. Your bio dad has shown by his words and behaviour that your uncle's words to you are absolute nonsense. It is what he would like to be, not what actually is.", "NTA", "It's interesting that your uncle wants you to risk your heart on a maybe. I'm assuming Sperm Donor isn't estranged from the rest of the family if he's invited to his parents' wedding anniversary, so... shouldn't your uncle or grandparents know if he feels remorse for the way he treated you? Or are they hoping that seeing you all grown up will spontaneously make *his* heart grow three sizes and there will be a Tearful Reconciliation? \n\nnot that it matters either way ofc. Some bridges you can't unburn. I'm just wondering how much you can trust that side of the family anymore, if they're trying to orchestrate a reunion that for all you know Sperm Donor isn't even interested in.\n\nNTA.", "NTA.", "NTA but if it were me I would go and have a great time. Just avoid your father unless he really pushes for contact. Then unload on his weird ass.", "NTA. And why the heck does your uncle thing you have to be the adult in the situation with your father? He was never the adult, even when it meant causing emotional harm to a child. Why would his feelings outweigh yours, even if he magically stopped being a narcissist and \"found a way to love\" you?", "NTA - a beautiful private lunch or happy hour will be lovely", "NTA. As a mom myself I would have been so disgusted with my son, I’d have cut him off. There isn’t a lot that would cause me to cut off my own child. Hurting or denying my grandchildren is one of them.", "NTA- Don’t go. You aren’t comfortable and its not worth the risk. On top of its inappropriate to see him at your grandparents anniversary. So many things can happen to ruin this for them. If your dad is sorry he has a way to reach out to you.", "NTA - I'm in the exact same situation. My parents split up last year and during the divorce, my dad treated my mom so horribly that I'm just disgusted by him now. Even my older half brother took the side of my mom, his step mom. When my brother told our grandmother what really went down in the divorce, she broke down crying and said she couldn't believe her son would act like that. But she still invites him up for all of the family dinners, so I've stopped going. It's not an easy choice to make, but you have to put yourself first in some things. There will no doubt be people who think you're an asshole for not going (in your family, not in the comments), but don't let that be your problem. Enjoy the day off relaxing at home instead of subjecting yourself to that stress.", "NTA", "NTA\n\n\"maybe he's found a way to love you\" yeah no, GTFO of here with that bull crap. If your father couldn't in the first 10 years, wtf makes his brother think 10 years of being an alone and pathetic human would help? Maybe when your dad is on his death bed and tries to reconnect you can spin what told the child you back on him as some sort of poetic justice to his sad life.", "NTA \n\nYour grandparents and uncle are wrong to want you in the same room as someone who calls you his biggest regret.", ">My uncle said I should be there for them and I should give my father a chance, that maybe he's found a way to love me and want me in his life, that I should have compassion from him, he's all messed up, and even if he's a dick, my grandparents aren't.\n\nUgh, while I certainly agree it would be nice if you to *tolerate* his existence for a few hours just to see your grandparents, I think what your uncle said was ludicrously disgusting. Why in hell is it the child who must have an unending well of compassion and love for the man who admitted to a six year old he didn't love them and only tolerated them due to their name? It's also disgusting to suggest such a parent deserves a \"second chance\" like your default direction in life should be to eternally pine for the cold hearted assholes affection even if it will never come.\n\nAlso, does he even know you threw away the name he gave you like the piece of trash that it was? That's bound to cause drama.\n\nNTA", "NTA - why do you, as the child, have to be the first to reach out to your dad first with the olive branch? \n\nHe’s a DAD. If he wants another chance at fatherhood, he would be reaching out to you, because fathers are the more mature, more experienced one. Why does a child have to be the more mature one in this case? If your dad was a big enough person, he would find a way to reach out to you and say sorry. It’s not your job to forgive him if he hasn’t made any effort.", "This. Tell your grandparents that you are really sorry to miss their event and that you love them but at this point in your life you are not ready to forgive your father for what he said and did to you (and may never be). Your father hasn’t apologised or tried to make things right at it’s not up to you, as the victim to make it right. You are sorry that they are caught in the middle but you have to take care of yourself.", "Major mile stones for celebrations aren’t the time for reunification aka no deadbeat parents should expect their children to reconcile at weddings, funerals, or family parties. If the parent was to reach out it should be before the party in a neutral location", "And the uncles reason is stupid.\n\nI'm sure everyone wants to be told maybe their parents could possibly find a way to love them", "100/100", ">He may have changed, you may go and find that he has realised his wrongs\n\n*If* he has changed, *he* needs to be the one to make the effort to reach out to OP. Until then, he has made it perfectly clear that he hates OP and OP's mom. OP is allowed to cut negativity out of her life. \n\nNTA", "You never deserved to be treated like that. It sounds like you're working thru the trauma with your mom's love and support, but omg. \n\nIf it means anything from a random reddit stranger, I'M glad you exist. I think you're a good person and I wish you the best.", "NTA  \nYour uncle sound like the worst advisor ever. He made 3 lives (one that was not even born yet btw) miserable with the first advice and now he DARES to try and advise you too? Maybe remind him what kind of track-record his advice truly had so far...", "I'd be the petty type so I'd show up with the smile and let it be known he means nothing to me and glad I changed my name. I'd also rub it in his face that I am his child from a woman who wasn't the love of his life. He shouldn't be the reason you are not there to celebrate the people who do matter. Make him feel uncomfortable, not the other way around.", "NAH except for you uncle who doesn't see the harm your father did and is living in a fantasy world.\n\nBut...you're giving your father a lot of power. I encourage you to go for your grandparents. Make it clear in advance that your father is not to approach you or talk to you. If he does, you'll make a scene and ruin the event.", "YTA, you can go and be civil and ignore the bastard.", "The opposite of love isn't hate but indifference.  Go to the party for your grandparents.  Support them.  But the sperm donor is nothing to you.  Pretend you don't know who he is.  Show him you thrived without him.\n\nNTA.", "YTA — It’s not about you or your dad, it’s about your grandparents. It’s their milestone wedding anniversary.\n\nIn your blurb, it’s your uncle suggesting reconciliation, not your grandparents. I’m sure a family in unison is desired by some, but you don’t have to buy in on any of it. Be seen on behalf of the grandparents, and if any party involved gets weird, wish your grandparents your respects and leave. \n\nLife is uncomfortable and unfair at times. Take this as a practice run, because coming across your dad will not get easier when it’s a funeral.", "Is there a reason why you can't go and ignore him? The party isn't about him or you it's about your grandparents.", "NTA\n\nHe has had plenty of opportunities to get in touch with you and having a reunion at someone else's party when one of them in uncomfortable makes for an awkward and tense situation.\n\nPerhaps you can go early, say hi and congratulations to your grandparents, drop gift and bounce. \n\nHowever if you choose not to go that is your choice and they should accept that.", "NTA. A party meant to celebrate a long marriage faced with a kid he only tolerated because she had the same name as his great love doesn't seem like your father will be a pleasant person to be around. \n\nNot subjecting yourself to this situation is perfectly reasonable.", "NTA. Honestly, your father sounds deranged. This is not a petty refusal to go over a small disagreement, what your father did to you is inexcusable and will affect you forever. I can’t even wrap my head around what’s going on with him there. I’m going to guess that his first wife wouldn’t be all that impressed with his behaviour if she could have seen it. I know I wouldn’t want my husband to be cruel to a child due to excessive grief over my passing.", "NTA- no one .  No celebration, invitation or event is worth your mental health", "NTA.\n\nIF for some reason you break down and go to the party, park so that you can't be trapped, and you can leave whenever you desire.", "Who cares if he’s ready to step up and be a dad? Why would you ever trust him? Tell them sorry but you can’t attend.", "NTA - ignore your uncle", "You did the right thing for yourself. No one gets to tell you differently. If your father wanted to mend anything he would not have waited 10 years for his parents to have an anniversary in order to do so. Live your best life and forget about that pathetic excuse for a father. You deserved better then and you deserve better now. NTA", "NTA. I haven't spoken to my own father in many years because he's a horrible human being, so I totally understand your reason for not wanting to be around him. I'm sure there was no malicious intent behind your grandparents' invitation, but they do need to respect your wishes. Like others have said, you can celebrate with them another day.", "I bet they're hoping that you'll reconcile with him at the party. They don't want people to know how awful he was to you and your mom; if you're not there, people will ask questions. They're not being good to you here. Your father was abusive to you and your mother. He's not sorry. If you go, he'll probably hurt you all over again by making snide comments about you or your mother. NTA", "NTA! That was very sweet of you to offer your grandparents an alternative option to celebrate, too.  We get to set our boundaries, for us.  How it affects everyone around us is really not our problem.  I take issue with Uncle chirping in as well.  It's like he's trying to sell your dad on you and your dad is a full grown adult and should take responsibility for his own dealings, actions, past and future relationships.", "NTA", "You know the thing that annoys me about these is that if the estranged person wanted to get in contact, they would.\n\nUsing an anniversary party to suggest a way to see estranged dad is so disingenuous and fucked up.  If he wanted to talk, he would.\n\nI'm sorry op, this sucks:(", "I think this is actually NAH, as far as you and your grandparents go. Your father and uncle can both suck an egg.\n\nYour grandparents just want to see all of their family together, in once place. And there is nothing wrong with that desire. There is something special about those occasions and it makes sense they'd want that for a big anniversary.  \n\nYou are also completely justified in not wanting to be around your dad. He dug his grave, he can rot in it.  \n\nAnd your uncle can stay clean the duck out of it. He has no place inserting himself in this situation, let alone trying to guilt you or suggest any intentions your father may have.\n\nAll that said, by avoiding family situations where he will attend, you're giving him some level of control over your life. If you were to go, and just ignore him, that would remove his ability to have any affect over your actions or choices.  \n\nYou can go to the celebration with clear boundaries that you will leave if he tries to converse with you. Treat him as if he's a plant on a Roomba, milling around the house. If the plant talks to you, leave. (I mean, I am not sure I'd stick around for talking plants anyway.) Give him no no more consideration than he deserves, which is absolutely none, at all.  \n\nObviously, not everyone gets to a place they can view this in this fashion. But it's been my experience that being able to be in the same room with my abuser, years after, and treating them as if they were less of a concern to me than the dust on my shoes was really empowering. My situation was a little different, I was SA'd when I was 18 by a friend. He later had a kid with someone close to me. He was out of the picture by the time I was around that person, but their kid was involved with a horrific accident at a young age and passed away. Avoiding my abuser wasn't worth the cost of missing the funeral. It was really healing, after all those years, to take back control like that.  \n\nSometimes life throws us situations like this. In your shoes, I would go to their party and have a great time. Enjoy the family time with those you love in the face of, and in spite of, the guy who could have had that if he had pulled his head out of his stink wrinkle instead of sitting around waiting for the world to cater to him.  \n\nBut I don't blame you, either, if you stick to your guns and refuse to go anyway.  If you don't go, though, you have to be ready for your grandparent's feelings to be hurt. They're just as entitled to feel how they feel as you are to feel how you do. So I'd at least be ready to help mend that afterwards.", "Maybe the grandparents aren't dicks, but they are specifically having OP's father at their shindig, and he is a dick.\n\nTherefore, due to both the commutative and the associative properties of dickitude ... grandparents might actually be dicks.\n\nGo with your plan of celebrating them separately, OP! NTA.", "Nta. They are asking you to hurt yourself for their comfort. The answer to that is always no.", "NTA. And tell your uncle to go to hell.", "NTA. And I'd ask them if they love you so much why do they want you to be around someone who actively caused you trauma. So much so that you associated your original name with someone not liking you", "NTA.\n\n\\> I told them I won't go since he'll be there but we can celebrate on our own before or after. \n\nI think it is very admirable that you presented this opportunity to them instead of a \"him or me\" ultimatum.", "NTA.  Your grandparents and uncle are probably trying to reunite you with your father at their special party, and everything will be rainbows and unicorns.  Don't go if you don't want to see your father.  He has made it clear to everyone who he is and how he feels.  Or, you could make an appearance at the party, and don't speak to your father.  Don't do anything you are uncomfortable with.  Your father is a grown man who made his choices, his parents and brother should leave it alone.", "NTA. Your dad was hideous, and I am sorry. \n\nIf you are able to go, it would probably mean a lot to your grandparents, and they are actual decent people who love you. You do not need to talk to your sperm donor. Your uncle was a complete idiot to suggest that. You can go and keep a dozen people between you and the jerks. You could go for a half hour. You could attend by Zoom or something. You do not have to talk to the waste of oxygen.", "Your uncle said your dad may have changed!  So your father has not shown any difference in his perspective about you, nor has he gone to the trouble of trying to approach you.  This may indicate that your grandparents and your uncle hope that you will do all  the work.  This happens too often in life where the wronged person is supposed to keep trying.  Your dad’s relatives want a happy family and want you to make that happen. Otherwise they would be on him to take the initiative because he is the person who caused this.", "NTA for not going. Be gracious and don’t act like you are trying to get them to uninvited him so you can come, just express your regrets that you won’t be able to be there due to your father’s relationship with you, and plan another time to celebrate them.", "My advice is go and ignore your sperm donor. Support your Grandparents like they always have you on this anniversary. They want you at this milestone and it will hurt them and maybe your relationship if you don't go. Make sure to set a hard set of rules about not wanting to be near or talk to your SD and if anyone tries to force you into contact you will be leaving. The decision is yours in the end but I don't want you to regret missing this day later. NTA.", "*With respect to everyone involved...a wedding is not the time nor the place for my father and I to have a forced reconnection that neither of us want.  I have well over a decade's worth of resentment built up in me for the way my mother and I were treated.  I have memories from my childhood where my father told me directly to my face, that he never loved me, never wanted me, and marrying my mom and having me was a mistake.  That he could never love a child that didn't come out of his first wife...and even naming me after his first wife was a mistake.  So even if I were in a place where I wanted to reconnect with my father, it would have to be under the supervision of a licensed therapist...not at a big party to celebrate Grandma and Grandpa's love for one another.*\n\n*I will not now, nor will I ever forgive my father for how he treated my mother and myself...and how he disrespected this family by abandoning his child like he did.  And I don't think dad is prepared for that reality.  I could see a world where we were cordial and respectful of one another, but I don't think he could ever truly accept that I will never forgive him.*\n\n*So it is with a heavy heart that I must decline my invitation to this celebration.  I am so grateful to everyone in my father's family for being there for me when my father wasn't.  I know I will never be able to repay that kindness.  But I also know that if the two of us were at the anniversary celebration, one of us would say something or do something that would ruin the evening for everyone.  And I just can't do that to Grandma and Grandpa.*\n\n*We don't always get what we want out of life.  Sometimes, we just have to accept that the way things are...are the way things are.  Please understand that this is just how things are between my father and me.  And if he wants that to change, he is going to have to prove that HE has changed and that HE is remorseful.  Only then will I even consider opening opening my heart again.*\n\nNTA", "NTA. Does he know your new name? I would probably go just to introduce myself to him using the new name.", "Info: Does your family (grandparents, uncle who is giving terrible advice, etc) know what he has said and how he's behaved towards you?", "Nta, it sounds like you grandparent's mean well, but they are being delusionally hopeful,  its obvious  that your father needs therapy and grief counseling, but WHAT THE FUCK, who says that to a little girl it's unforgivable you don't own him anything and you don't need him", "NTA. Don't go to the party, it's not up to you to fix your AH father", "NTA, but you are letting your father control your actions.  Don't let him control you having your best life.  If you want to go, go and screw him.  Just ignore him like you would any stranger.", "NTA keep that toxic man out of your life.", "NTA", "NTA.  \n  \nYou are young and I understand your feelings since my dad was an AH to me too, but if I were you, I would try and be there for my Grandparents. It is about them and not about me this time and also, ignoring your sperm donor will be a blow to him. But again, it's just me.  \n  \nEdit: your uncle is an idiot for telling you to give your dad an opportunity. No. And yes, you can also make a celebration with your grandparents afterwards.", "NTA\n\nYour father’s issues didn’t give him the right to say something so terrible to a 6yo child. \n\nKeep him cut from your life. Don’t see him. You have that right and it’s better for your mental health.", "NTA\n\n\"... maybe he's found a way to love me...\"\n\nI don't know the last time I read something more heartbreaking and at the same time so insulting.  Stay the hell away from these people. Grandma and grandpa get to have a time out for trying to push this. Uncle can get blocked forever.", "Those \"give them a second chance\" are messed up on so many levels... EVEN if OP wanted to try to reconnect, doing so in a large event is extremely ill-advised. These things would need to be made in a more controlled environment where OP would feel safe (psychologically).\n\nBut WHY should OP try to reconnect? The grandparents and the uncle seem to be the only ones interesting in the \"reconnection\" (\"connection\" is probably more appropriate)... Don't go OP. But make sure you organize something else at the same time and TURN OFF your phone...", "It's still sad for OP to miss her grandparents party. I would go party with my family and just ignore the sperm donnor.", "I’m sure your grandparents are nice but… Your dad is beyond messed up. He named you after his dead first wife while you’re mom was in critical condition and then told you he could never love you or your mom. Yup, he gets no more chances. Your uncle needs to take a seat, and close his hole. See your grandparents for a nice meal or something another day. This isn’t worth the mental and emotional toll.", "NTA, your father made everything clear to you as a child.", ">I should give my father a chance, that maybe he's found a way to love me and want me in his life, that I should have compassion from him, he's all messed up\n\nNo, no, absolutely not. He has done no such thing and deserves no compassion. He may be messed up but he is far worse than a dick. He stole your identity at a birth that could have killed your mother to honour a dead woman, and told you he could only tolerate you by doing that. He is downright evil and there is no evidence he has changed. It's said for your grandparents but their special occasion should not be marred by this. If they insist on him going, it's your duty to yourself and even them not to go. NTA in the slightest degree.", "This is my first thought.  Uncle train-wrecked two more lives. His brother needed serious therapy, not another woman he clearly wasn't ready for and didn't deserve someone marrying her just because others thought being partnered would help him.", "And it’s insulting of uncle to assume OP even WANTS anything from father at this point. There’s no indication father even wants anything to do with OP and even if he changed completely and totally loves her now, she’s not a child anymore and he missed his chance.", "Yes and he might always have that because I do not ever see myself being willing to be in the same room as him again.", "OOOOOOR OP can continue to keep her boundaries and celebrate with her grandparents at a different time. Her father straight up told her at SIX that he didn't love her so those boundaries are completely acceptable ones.", "I'm not there yet and I might never be there.", "I am not at a point where I could ignore him. It would bother me. I would sense him and just remember all the things he said to me, how he treated my mom. I have not reached a point of indifference like someone else mentioned. I still hate him.", "They do know, yes.", "Right? Why's it the child's responsibility to mend the relationship with their parents when they've said shit like that to them?", "Especially since the uncle is the one who pressured OP's father into dating/marrying another woman when he was clearly not ready to move on and put them all in this situation to begin with.", "This is probably one of the same uncles that told her dad to find someone new to love to get over his first wife. Because of course that's how it works.", "I wonder if this is the same uncle who told him to ruin OP's mother's life on the off chance that it might help him get over his dead wife.", "There isn't even any evidence that the father is interested in reconciling, it might all be just wishful thinking on the others' part.", "I at no point said otherwise, in fact I said that I would do the same if I was in OPs position.", "He should be disgusted with himself. It was his decision to remarry and nobody forced him to have a kid. Your dad has issues and needs a lot of therapy. Don’t let his parents or anyone else try to guilt trip for not having a relationship with him. Protect your peace and don’t go.", "Show him what he missed out on.", "Is there a possibility for you to attend and just ignore your \"father\" (I really just want to say sperm donnor) or people will expect you to talk to him?\n\nI don't think you should be the one \"excluded\". You did nothing wrong in this story and yet you're the one not attending a family event.", "Exactly the audacity of some people to give you \"advice\" regardless of their actual efficacy is astounding to me.", "I get it.\n\nI hope you get to the point where you don't care about this sperm donor. Imagine being so broken you can't love a child. Your own child. And imagine being so heartless as to tell that to a child.\n\nOn one hand, it's nice that he didn't lie. Because you read him right. What I hate is when your family says \"of course he loves you\" when you know the truth. At least this way you know your instincts are right.\n\nThe opposite of love isn't hate, it's indiference. I hope you can get there because he doesn't deserve to have any space in your head.", "Understood.  Still NTA.  You do what you need to do to be comfortable and celebrate your grandparents another time.", "I won't impact your relationship with your grandparents.", "Yikes, NTA do you girl.", "You would be surprised how almost universally children of this kind of horrific abuse are shamed for saying enough is enough. \n\nThey experience soul-wounding rejection/neglect and then society is constantly \"bUt it'S yOur FatHEr!\" (or mother)", "This! So much, this!!!  The most underrated comment", "So much this.   If he wanted to talk, he would try.  He hasn't.  At best this is wishful thinking.", "I wouldn't be able to do it. It would bother me so much to see or feel him there."]}