{"id": 15172, "submission_id": "12rnoeg", "title": "AITA for not letting anyone read what I wrote for my grandfathers funeral?", "selftext": "My (22M) grandfather passed away. He had asked my father and his two brothers, and for whatever reason me to speak on his behalf at his funeral.\n\nHe was always a really peculiar but typical hardworking conservative man who struggled showing emotions, love, or anything like that. However I knew he cared about me, he was the type of person who if you didnt matter to him he wouldnt bother with more than a yes or no. The way he showed me love was trying to get me to play old korean strategy games like go, or teaching me math or something like that, usually for hours on end.\n\nI was going to speak after my father, however both grandpa and my father are alike, and I absolutely did not expect the gut wrenching, tear jerking speech he gave. It was the first time I had ever seen my dad bawl his eyes out. Literally everyone was sobbing and I was in this state of shock at some of the things he said. I couldnt even speak so when I went up I just said I couldnt and that I was sorry.\n\nAfterwards family and extended family was invited to an all u can eat restaurant and I just wanted to kind of mourn in peace with my gf, I understood there were alot of people who wanted to speak with me or just have a brief conversation, which I was fine with. I didnt appreciate though when people kept asking to read what I was going to say for my grandfather, I didnt want to share it. It made me more upset when people would ask me why and I didnt have a reason.\n\nSomeone actually said that Im withholding a piece of my grandfather from the rest of the family, and I had an obligation to show everybody because its not fair to the people who love him. This is the first person in my life who is extremely close to me that has passed away, this was also believe it or not the first funeral ive ever been to. Is that a real thing or is she just saying that to try and guilt me in to sharing what I wrote. AITA?", "created_utc": 1681897762, "permalink": "/r/AmItheAsshole/comments/12rnoeg/aita_for_not_letting_anyone_read_what_i_wrote_for/", "score": 38, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > did not speak at my grandfathers funeral, did not want to share afterwards what I had said about him, some people say its not fair to not share what I said\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - you didn't do the speach for what ever reason, so it is not public and doesn't have to be unless you choose too make it public", "NTA it’s personal and your not withholding anything anyways and if they ask to see it just explain to them that it’s difficult for you to share how your grieving over your grandfathers passing and maybe in the future when your ready you can share", "The audacity of ppl is at an all time high. You are under no obligation to share what you wrote for your grandfather and they should respect that. This is nothing more than nosy people wanting to be nosy. If in the future you feel comfortable enough to share that’s your choice. I find it extremely rude they would try to guilt trip you over this. If they can’t respect your right to privacy then they can kick rocks.", ">Someone actually said that Im withholding a piece of my grandfather from the rest of the family, and I had an obligation to show everybody because its not fair to the people who love him.\n\n\n\nI’m going to give grace and call it NAH because that person is going through grief and hopefully realizes they were wrong. *You* have done absolutely nothing wrong. You are not obligated to share your speech to anyone.", "I'm going with NAH because your family is in the throes of grief, which can do weird things to people. I think it's weird they're demanding to see what you wrote, but sometimes raw grief makes people latch on to small things and turn them into big things. I've also seen grief amplify anger, even about tiny, inconsequential stuff.\n\nYou are absolutely not the A for deciding your thoughts are personal, and changing your mind about sharing them. \n\nI'm so sorry for your loss, and I wish you and your family peace.", "NTA. Everyone grieves differently and in many ways. I think its kinda rude that someone else is trying to force you to follow what they want in this trying time. Manage yourself how you see fit and in your own time.", "NTA...I'm sorry for your loss. You're entitled to whatever privacy you need.", "NTA- Whatever thoughts you had were meant for your grandfather, not for the entire room's entertainment if you chose not to share.", "NTA \n\nSounds like you want confirmation that you did not commit an injustice to your family. You did not. Your relative made that up as some sort of melodramatic narrative.  I've never heard that particular guilt trip before, so it's quite unique but still pretty lame. A eulogy, good or bad, is not a sacred rite owed to the bereaved.\n\nHere is a real injustice, for context. Let's say you were supposed to give the only eulogy at the funeral, there was no one else who could do it besides you, and you went up there and said, \"Deez nuts! YOLO!\" And then you did a crotch chop and dropped the mic and walked out.  In this case, your family would be right to think maybe you were a selfish jerk, but even then, in this extreme example, a more understanding family would probably chalk it up to grief and never speak about it again except to laugh about it years later.\n\nYou were there with your family to say goodbye. That's what you owed and you gave it willingly. Sorry for your loss.", "Fuck, NTA.  Everyone grieves in their own way.", "NTA. Your family is just nosey, and want to know what was in your speech that made you decide not to speak after all. Was it something rude and insensitive which you decided not to say after seeing your fathers grief? Was it something embarrassing about grandpa they would love to know? But you are not obliged to cater to their curiosity. The speech was never given, so it never actually existed.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (22M) grandfather passed away. He had asked my father and his two brothers, and for whatever reason me to speak on his behalf at his funeral.\n\nHe was always a really peculiar guy, typical hardworking conservative man who struggled showing emotions, love, or anything like that. However I knew he cared about me, he was the type of person who if you didnt matter to him he wouldnt bother with more than a yes or no. The way he showed me love was trying to get me to play old korean strategy games like go, or teaching me math or something like that, usually for hours on end.\n\nI was going to speak after my father, however both grandpa and my father are alike, and I absolutely did not expect the gut wrenching, tear jerking speech he gave. It was the first time I had ever seen my dad bawl his eyes out. Literally everyone was sobbing and I was in this state of shock at some of the things he said. I couldnt even speak so when I went up I just said I couldnt and that I was sorry.\n\nAfterwards family and extended family was invited to an all u can eat restaurant and I just wanted to kind of mourn in peace with my gf, I understood there were alot of people who wanted to speak with me or just have a brief conversation, which I was fine with. I didnt appreciate though when people kept asking to read what I was going to say for my grandfather, I didnt want to share it. It made me more upset when people would ask me why and I didnt have a reason.\n\nSomeone actually said that Im withholding a piece of my grandfather from the rest of the family, and I had an obligation to show everybody because its not fair to the people who love him. This is the first person in my life who is extremely close to me that has passed away. Is that a real thing or is she just saying that to try and guilt me in to sharing what I wrote. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "My condolences.  \n\nNTA, while you are indeed 'withholding' a perspective on your grandpa, you have no obligation to share it with anyone.  \n\nThat someone is TA for trying to guilt you into sharing something you clearly no longer wanted to share.\n\nAs a bit of speculation, your fathers speech apparently changed your perspective on your late grandfather so much your original words may not have felt appropriate or sufficient anymore. Talk to him about it, maybe you can rewrite or rephrase what you wanted to say wile taking these new insights into account.  \nIt may still help you get some closure. But there's no obligation to share with anyone else.", "NTA. This is your choice.\n\nI wrote and delivered a speech at my mother's funeral. It was not bad, and people were very warmly outspoken about it. My sister took the paper with the notes, and kept taking it around to relatives and friends who had not been there, reading it to them. I had very mixed feelings about this. Those were my words and my emotions, to be delivered once, they were not hers to carry around in order to make our elderly friends cry. At the same time I knew doing this released her grief and that of others. I had managed to put it into words, making it visible and manageable, putting it in context and giving it shape and meaning. It helped my sister, and she wanted to share that help.\n\nI shared, and at the end, it was right. But I was of mixed emotions about it, and could as easily have tipped the other way.", "You’re absolutely NTA cos your speech is about the personal memories you’ve had with your grandfather so it’s not wrong if you don’t feel comfortable letting other people see the speech. The fact that people keep pestering you and trying to guilt you into showing the letter is wrong cos it’s private info of yours. Your situation is kinda similar to how people find someone’s diary or journal and are try to get the person who wrote it to give it to them so they can read it. \nBasically don’t allow them to read your speech if you don’t feel comfortable doing so cos it’s about personal information that you’d rather keep to yourself.", "This. NTA", "Yeah I felt like that was most likely why she seemed kind of ticked off that I didnt want to share. The only true reason I didnt want to is because I feel like alot of people were expecting this to be another way to see more of who my grandfather was, or to try and feel the same emotions that my father made everyone feel at the funeral, but honestly what I wrote is kind of disappointing and no where on the same level as what my father prepared. I felt like my dad summed up everything about his life beautifully and that it deserved to be the last thing said on his behalf.", "I’m sorry for your loss. If you ever wish to share what you wrote please don’t feel like you can’t because you don’t think it’s as good as what your dad wrote, you have your own experience with your grandfather and your words and thoughts of him have meaning. There doesn’t have to be a last word.\n\n\nBut again, you are also not obligated at all to share with anyone. It’s your words to share or keep or burn."]}