{"id": 15239, "submission_id": "12su6gf", "title": "AITA for throwing out my wife’s friends at 4am?", "selftext": "My (41m) wife (40F) was out with her friends last night. Her friend is moving out of the country, so they were hanging out at our place first, drinking mimosas and listening to music, and after that they went out to drink at a bar. I am injured (recently had surgery), am taking antibiotics, can’t drink or move around easily, and so I stayed at home with the dog. \n\nThe dog is relevant to the story; he is a male dog, and he is kinda sceptical towards other male dogs. It’s about a 50/50 chance whether he will like them or not.\n\nAt around 4am, my wife comes home with one of her friend and two people they met at a bar. Turns out, one of those people brought their male dog. It was a cute dog, he seemed really nice. But it was a male dog. \n\nOur dog jumped down, eager to greet his mom, then sees the other dog and *freaks out*. I have to lift him up to avoid a dog fight, and when the other dog goes over to eat his food, he freaks out even more, barking and growling.\n\nIn my sleepy state I probably overreacted; I ask my wife why the hell she thought it was okay to bring a male dog home at 4am, and while he is freaking out in my arms, basically begging me to let him down so he can eviscerate the “intruder”, I tell them to get out of my home, and basically push them out the door.\n\nMy wife then brings some wine outside to have a drink with her friends in the backyard, and I bring the dog into the bedroom to calm him down.\n\nAn hour or so later she comes back inside and goes to bed. \n\nThe next morning she tells me her friends were “worried about her” after my reaction, and that the dogs would have been fine (my dog was *literally* snarling at the other dog while I was holding him). I will admit that I might have overreacted in my exhausted state at 4am, but AITA?\n\nEdit: Spelling", "created_utc": 1681987146, "permalink": "/r/AmItheAsshole/comments/12su6gf/aita_for_throwing_out_my_wifes_friends_at_4am/", "score": 236, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took was throwing out my wife’s friends because they brought a male dog (my dog reacted poorly to the dog), and I might be the asshole because I told them to “get the hell out” and basically pushed them out the door (so I could be the asshole both _because_ I threw them out, and because of _how_ I threw them out).\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nWhy?? Why?!?! How much more wine did they need? Why did she bring anyone home at 4 am??? Is this a normal thing? \n\nI would lose my shit on my husband if he ever did this.", "NTA.  Your wife knows you are in recovery and knows the dog and yet still brings these people into the house at 4 am with their dog. She was incredibly inconsiderate and lacking in empathy.  She needs to do better.", "i'm worried about her too....she brings home at 4 am, 1 dog and 2 strangers?\n\n&#x200B;\n\nshe's TA", "NTA\n\nI can't see how you had any other options.\n\nI hope you're okay, post surgery owies and all.\n\nGood work on preventing a bad outcome. I'm on your dog's side. My dear old girl had a strict rule about other female dogs on her turf. It's your dog's home and food. Of course he'd be reactionary.", "NTA.   Your wife brings home people she met at a bar?  At 4am?", "NTA\n\nI guess you can think you overreacted but if your wife knows your own dog doesnt like other Male dogs then she is just in the wrong", "I had to take my dads wife to the emergency room, three bites, 9 stitches. She accidentally got between her two dogs, one of which is food aggressive.\n\nYea, you might have dodged a bullet, it might have been nothing? But it *could* have gone straight to hell. \n\nI can imagine a drunk laughing  “Oh! Just out the dog down, they just want to plaaaaay!”)…And your wife *knows* your dog can be aggressive with strange dogs. And here one is, in his house, eating his food. WTF\n\nOh, *hell* no. What a serious lack of good sense from all around, except *you*, op. NTA", "NTA but your wife needs to lay off the booze. The other dog owner is not too bright, either.\n\nYou didn’t overreact. Your wife and her drunken friends were extremely rude.", "Nta.\n\nYour wife has an issue though", "NTA. You saved the other dog from being mauled in front of everyone -you never mentioned the size of your dog, but even a small dog can do damage if they get the first attack in. They were drunk, not thinking, not fully *recognizing* reality in front of them.\n\n&#x200B;\n\nOn another, semi-related note... this is exactly why the \"Oh don't worry, he's friendly!\" thought process is flat-out wrong, and dangerous. *Your* dog may be friendly, sir/ma'am, but do you know if the other dog is?", "NTA No one brought up the fact that he just had surgery. He could have injured himself trying to separate fighting dogs. Once the other dog started eating his dog’s food, all hell would have broken loose. I can understand his wife staying out late with her friend, and coming home for another cocktail. But who brings people from a bar to your home with a dog at 4:00am, especially when your husband is in bed recovering? Were they even her friends or just some people she met at the bar?", "NTA - I love that you’re sticking up for your wife in the comments. It was a moment of poor impulsive decision making on her part, I’m glad that everything ended up okay in the end - I’m sure that she’s sticking up for you to her friends after realizing that she made a bit of a judgement error!", "NTA. Everyone is talking about the dog, but no one is talking about the fact that your wife brought home 2 strangers that she had just met in a bar. They could have been serial killers. Cannibals. Maybe the dog was so hungry because they hadn’t killed anyone recently. Who brings complete strangers to their home at 4 in the morning?", "NTA. They were clearly tanked if they thought their dog would be ok", "NTA you safe yourself from potentially having to pay vet bills etc...", "NTA\nShe is inconsiderate. It’s ok to have fun-but it’s not hard to think of others while doing it", "NTA, drunk idiots are", "INFO: How often does your wife do this??", "NTA.  Your wife showed really poor judgment bringing home people she met at a bar?  At 4AM?  With a dog she didn't know?  And continued drinking?\n\nThis really isn't normal adult behaviour.  And they were worried about her?", "ESH\n\nYour wife should've known better, but your reaction is a bit concerning if her friends were literally \"worried about her\". It being 4 AM isn't really an excuse. You could have defused the situation without being so aggressive that your wife's friends worried about how you treat her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (41m) wife (40F) was out with her friends last night. Her friend is moving out of the country, so they were hanging out at our place first, drinking mimosas and listening to music, and after that they went out to drink at a bar. I am injured (recently had surgery), am taking antibiotics, can’t drink or move around easily, and so I stayed at home with the dog. \n\nThe dog is relevant to the story; he is a male dog, and he is kinda sceptical towards other male dogs. It’s about a 50/50 chance whether he will like them or not.\n\nAt around 4am, my wife comes home with one of her friend and two people they met at a bar. Turns out, one of those people brought their male dog. It was a cute dog, he seemed really nice. But it was a male dog. \n\nOur dog jumped down, eager to greet his mom, then sees the other dog and *freaks out*. I have to lift him up to avoid a dog fight, and when the other dog goes over to eat his food, he freaks out even more, barking and growling.\n\nIn my sleepy state I probably overreacted; I ask my wife why the hell she thought it was okay to bring a male dog home at 4am, and while he is freaking out in my arms, basically begging me to let him down so he can eviscerate the “intruder”, I tell them to get out of my home, and basically push them out the door.\n\nMy wife then brings some wine outside to have a drink with her friends in the backyard, and I bring the dog into the bedroom to calm him down.\n\nAn hour or so later she comes back inside and go to bed. \n\nThe next morning she tells me her friends were “worried about her” after my reaction, and that the dogs would have been fine (my dog was *literally* snarling at the other dog while I was holding him). I will admit that I might have overreacted in my exhausted state at 4am, but AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA next time let your dog loose", "This isn’t common, no. Her friend is leaving the country for an extended period of time, so they just wanted to have one night out together before she left. They just wanted to have a couple of drinks after the bars closed, I don’t have an issue with that. Bringing the dog was what made me upset.", "My wife is in general a very empathetic person, but people do dumb things when they are drunk. I don’t blame her for that. Plus she apologised, we’re all good.\n\nBut yeah, I was upset that they brought a male dog over.", "She was drunk, people’s judgement isn’t the best while drunk. And it’s not like this is a common occurrence, you know? She apologised, we’re all good. I was just worried that I might have overreacted. This morning I realised I could have asked them to take the dog out to the balcony instead of throwing them out, ya know?", "What I thought about this morning is that I could have told them to pick up the other dog and take him out on the balcony, instead of throwing them out. \n\nAnd I’m alright, but thanks for the concern! Just limping a bit and still on antibiotics (thus the no alcohol for me part).", "I mean this isn’t a regular occurrence or anything, her friend is leaving the country indefinitely and they wanted one night of fun before she did. I don’t have an issue with that, just with bringing an unknown dog with them.", "I mean he is like… 50/50? Some he is fine with, some he is not, but that’s when he meets them outside. This was in his home.\n\nIn her defence she thought they could just bring the other dog out on the balcony so that my dog wouldn’t even see him, but he was already at the door to greet her.", "She rarely drinks, this was just one last hoorah for a friend who is leaving for possibly many years.\n\nBut thank you, seems like most people here agree with you.", "Nah, she is basically never out with her friends. And with her friend leaving the country for an extended period of time, I think having a night out on the town with her friend before she leaves is perfectly warranted.\n\nThe issue for me was bringing a male dog when she knows how he reacts.", "Thank you. They are both small dogs, but mine is a dachshund. The other one was some sort of small curly fluffball. If there was a fight, it would be a short one.\n\nMy dog is usually very friendly, but the combination of it being a male dog that he didn’t know, and it being _his house_ made him immediately go into defense mode.", "One friend, two people she met at the bar.\n\nI mean it’s been a couple of weeks since the surgery, but I am limping a bit still and I am on antibiotics (thus no drinking). \n\nI was fine with her bringing people over, I just thought they should have left their dog at home.", "She apologised, so we’re all good! I don’t care that she was out with her friends or brought people over, I was just upset at the unknown dog.\n\nThe reason I was thinking I could be TA is that I could have told them to pick up the other dog and keep him on the balcony with the door closed instead of throwing them out.", "😂😂😂 That comment cracked me up, thank you! \n\nI was never worried about that part, even post surgery I am pretty capable. They should just have left their dog at home.", "The weird thing is they didn’t even seem that drunk. I guess they thought it would have “worked itself out”? Idk.", "I mean… Never? Her friend is leaving the country for an indefinite period of time, and they wanted to have one night out together before she left. I don’t have any issues with that part, I just got upset that they brought a male dog.", "I mean her friend is leaving the country indefinitely, so I don’t have an issue with them having one last hoorah before she leaves, even with people they met at the bar. \n\nMy issue is just bringing the dog over, which she admitted was a bad idea and apologised for, so she and I are all good. I just wanted to know if I overreacted.", "I get that, and thank you for your honesty (I upvoted you!). I mean I don’t really understand why they would be worried, it’s not like I was yelling at her. I basically said “You know how he is around other male dogs, why did you let them bring a dog he doesn’t know?” and told them to “get out!” while I was holding a snarling dog in my arms.\n\nBut I understand that my reaction might have been over the top, thus the post.", "That would make a big mess though. Plus I like dogs, I don’t want to see them hurt.", "It was 4 am & her “friends” were people she just met at a bar. They shouldn’t be walking in to your home at 4am with or without a dog. \n\nYour wife should be apologizing profusely.", "Yeah i mean its not the end of the world but imo you didn overreact", "She has apologised, and we’re all good. But her bringing people home at 4am wasn’t an issue; it was a last hoorah for a friend she might not see in years. We don’t have kids or anything, so I don’t have an issue with that part, just with bringing the dog over.", "Appreciate that. Seems most people here agree with you!", "Just so I’m clear... you’re upset because your wife’s friend’s dog upset your dog? That just seems like the cherry on top of an all-around bad decision sundae \n\nNothing bad happened to the dogs. Your dog is a male... if I had to guess he’s probably still intact. It’s a pretty standard reaction from intact males. Regardless... It’s was just a bad scenario, 4 am, strangers, strange male dog, Dad is freaking out. Your dog is fine... He’s probably already over it. So I guess it’s all good. Ask her not to do it again. Who cares what her friends think about you throwing them out .... they think it’s okay to walk in people’s homes with their dog at 4 am so....", "Were those 2 people men?", "Yeah the thing I was upset about was bringing the male dog. My dog was super angry, and tried to attack the other dog (I picked him up before that happened), and kept snarling and barking at the other dog while I held him, which is why I told them to get out.", "They were a couple, f/m.", "A lot of people are missing the fact that, yes you were able to contain the dog, however it could very very easily have resulted in you getting bitten in your dog's frenzy to protect his home from this strange intruder. So not only did it put their dog in huge danger, it put you at risk too. Not to mention this was at 4 am. 4 drunk people and a dog are in no way going to be even remotely quiet. You're in recovery and by all reasonable expectations would've already been asleep so inviting them all back was just generally inconsiderate, previously known or not. \n\nNTA at all. Your wife is a tiny bit of an A for still trying to defend a clearly bad drunken decision, but only a little bit because she did apologise as you've said. This could've gone so much worse, but it didn't thankfully.", "If my S/O tried to bring strangers into the house at 4AM I would be fucking livid.  NTA whatsoever", "NTA. Your wife is.", "NTA. You’re making way too many excuses for your wife. I know you’re just upset about the dog but bringing home complete strangers at 4 AM is ludicrous. Then they have the nerve to assume you’re the abusive one? None of her behavior is acceptable here. Wake up", "NAH\n\nSounds like your wife had a good night out, and despite what others are saying I don’t think any of the details here are very untoward.  It’s pretty normal to invite new acquaintances over for a nightcap after the bars close in my experience.  Your wife could have been more cognizant of the male dog problem, but she spent the evening getting tuned up and probably emotional with her friend leaving for x time.\n\nIt doesn’t really seem like there was even a serious problem that resulted from her lack of judgement on the dog situation.  \n\nI think you already knew you were NTA though, so I’m confused about the intention of the post.  Seems like a good excuse to have a bunch of strangers dissect your relationship though.", "Definitely NTA and I’d be absolutely livid if my husband did this! 4am?! And she comes stumbling in with  her friends and some strangers with their dog, waking everyone up? I think it was completely disrespectful of her!", "NTA. \n\nQuestion: Did these people take their dog to the bar? I don’t know any establishments that allow that except for guide dogs (but I’m not in the US, so don’t know how it works there). Or did they go home and fetch their dog, knowing they’d be out late? \n\nYour wife knows your dog doesn’t do well with other male dogs. Okay, she was inebriated, so her judgment may have been impaired. It’s just… how did the dog come to be there?", "NTA wife was rude", "NTA.", "Stop defending your wife. She made a decision regardless of why. Her friend is a GUEST in your home. Your wife knows you had surgery and are recovering. Dog or no dog does not matter. She brought people from a bar who she and your guest do no know into your home. Last hooray or not, she effed up. Stop defending her behavior. It’s kinda sickening that you’re saying it’s okay because her friend is moving. If the behavior is not okay in any other situation, it’s not okay here. \n\nYou are NTA and no matter how you slice it your wife is the AH.", "NTA", "while I don't think you're the asshole, you shouldn't have spoken to your wife disrespectfully, especially in front of others. \n\nI do understand your predicament with the dog going crazy and just the general weirdness of two strangers at your home at 4 am. \n\nBut you could have diffused the situation better without yelling or freaking out, especially at your partner, and take it up personally and express discontent later. \n\nI think that may have prompted the friend's \"I'm worried\" comment cause they saw you lose your shit at your partner and two strangers and completely freak out\n\n&#x200B;\n\n NTA", "NTA it’s understandable honestly and people who talk like that are instigator.", "NTA!  I can't believe the gall of bringing people home at 4 am.  Red flags here.", "NTA: Your wife brought someone home with a dog that clearly way going to turn into an escalated event. Dog fights are dangerous to the pets and the owners. You could have gotten seriously hurt just holding the dog. Why the wife thought that was fine blows my mind. Additionally, it sounds like the guest dog was also a bit of a spaz, eating the food that is left out. Like why not put the dog in the backyard from a gate to begin with? \nBut also, who has company at 4am? \n\nSure you likely reacted poorly, but being tired, in a dangerous situation I think it's forgivable.", "NTA. Ngl. If my so had pulled that shot I’d have locked and bolted the door when they went out with the wine.", "NTA - But your wife is.  Did the dog come from the bar too?", ">Our dog jumped down, eager to greet his mom\n\nYour wife is not your dogs mom. Other than that, NTA. Who TF brings a dog home from a bar at 4am? Your wife has issues.\n\nBut seriously, you should train your dog better. If your dog attacked the other dog, and/or the other dogs owner, it was still in your house, and the person was your wife's invited guest. You could get into some shit for that.", "NTA no one should bring a dog to a person's house without permission, and it sounds like your wife was not thinking clearly enough.  The minute there was a problem with the dogs, they all should have moved outside or gone home.  You did nothing wrong.", "INFO did these strangers have their dog with them at the bar at 4 am?", "NTA - How clearly could she possibly be remembering the night? She goes and gets drunk, brings home strangers AND a dog with out warning, and then blames you for not reacting the way she wants? Seriously?!?", "I'd be unbelievably pissed off if my wife brought random people from a bar into our home at any time of day", "Me too. But then again we're at the stage in life where 9:00pm feels pretty late. When my husband wakes me up at 4:00am it's because he's getting up in the \"morning.\"", "In fairness this was a special occasion, with her friend going away possibly for many years. I can’t say I was thrilled about it, but considering the circumstances I was okay with it. \n\nNot with the dog though.", "Idk why this is down voted. Most sensible answer here", "Who tf brings their dog on a night out?!?? NTA", "With all due respect...they drank before they went to the bar, then they drank at the bar, then they came home at 4 in the morning to drink some more\n\nThat's not a couple of drinks\n\nThat is alcoholism", "Don’t bring strangers you’ve just met home at 4 am, along with a strange dog, ya know?", "ok, well, based on your comments here, I'm glad you and your wife are fine now, you're totally NTA but she needs to have a serious talk with her \"friend\" who was \"worried about her\" because of your reaction and explain how *she* f-ed up.", "If you read this post you’d probably vote NTA then.", "Are you ok that they brought in strangers? Is that something uncommon for her? Also she has to be aware that your dog is like that. Did she tell you why she thought it would've been ok?", "Better person than me. Few thing I hate more than to be \"called out\" for something I either had the right to do or not do. U didn't overreact.", "Probably because 90% of the text in my answer is blaming OP. I figured everyone else had already pointed out why his wife was in the wrong, so I didn't need to elaborate on her.", "It might be binge-drinking, but it's not alcoholism.", "doing that for one night does not inherently make them alcoholics", "It’s not a common occurrence, no, and this was a special occasion. I can’t say I was thrilled about it, but considering the situation with her friend I was okay with it.\n\nShe said she figured he would be sleeping in the bedroom with the doors closed and that he wouldn’t even see the other dog. I pointed out that he would hear her come in and would obviously want to greet her like he always does, and would bark if I didn’t open the door to let him out. She agreed that she made an error in judgement and apologised for it.", "I would defend a dog over most people tbf. Dogs are awesome, people suck.", "'Two people they met in a bar'. So they were strangers, then?", "Okay you keep bringing up this friend that's moving. The dog owners were not that friend they were complete strangers your wife brought home. That's very dangerous. Whether she drinks often or not, next time she goes out I'd be very worried that she's too friendly with strangers and will bring dangerous people to my home? Remind her that isn't safe", "People 1000% suck", "Yeah, as far as I am aware neither her nor her friend knew these people ahead of time.", "why are you insisting on finding other \"problems\"?", "and they brought their dog to a bar?\n\nIs this normal behaviour where you live OP?", "They are just saying they are worried for your wife as a way to deflect their own shame.", "I haven’t actually asked where they got the damn dog yet. It’s not common, there’s a reason it didn’t even occur to me that there would be a dog with her when she came home.\n\nAnd since she already apologised, I don’t want to make it seem like I am beating a dead horse by asking, so I’ll probably wait a couple of days before bringing that up. I am actually surprised only one person picked up on that, I just didn’t want that part to affect people’s judgement.", "Good lord, stop clutching your pearls.  Yes it is in fact very common for dogs - whether service or otherwise - to be allowed into individual establishments.  Where I live the restaurants/bars downtown almost always have outdoor seating, a lot of them even have water dishes on their patios for dogs.\n\nJust because you’ve never witnessed this does not mean it isn’t a completely mundane happening.", "It's really normal to bring a dog to the pub. I have on multiple occasions. Can't go into a pub without seeing a dog where I live. They have treats behind the bar in most", "Right! I bring my dog to a local bar often. They don't serve food so well behaved dogs are allowed. I would not bring my dog to someone's house after drinking, especially if they already have a dog, in case of dog reactiveness. \n\nBut having dogs in bars where I live is common.", "Really? Where you live it's normal to take a dog to a bar until 4am?", "Depends where you’re from. Where I live it is very much not allowed, even with outdoor seating, to bring an animal, besides a registered service animal to an eating/drinking establishment. A lot of places put water bowls out for passing pups though, and sometimes have treats the servers keep to hand out if they are near when you walk  passed, which is sweet of them.", "Where I live?  No, bars in my municipality close at 2am.  It would be normal to see someone out with their dog at 2am, and normal to see a dog at an after party at 4am, however.\n\nThe general rule here is that patios are fine.  I also know of several bars (ones without a license requiring food sales) that allow dogs inside.  \n\nIt is completely common.", "Our bars aren’t even open that late, I’m in a CA beach community but sure there are dogs everywhere all the time. Pretty much all restaurants and bars with patio seating allow dogs and many allow dogs indoors. Many have dog menus! Which I actually think is a little over the top… one has a giant sign ‘humans tolerated dogs welcome’. Target and CVS serve dog treats. There’s even a dog BEACH! It’s paradise."]}