{"id": 15264, "submission_id": "12t7nv8", "title": "AITA for leaving my own birthday party after they invited my former bully?", "selftext": "I (20f) turned 20 a few days ago. My friends and a few family members threw me a birthday party after I got home from class. I was so happy and felt so loved as I had always planned my own parties previously but never had a surprise one. I looked around the room and saw Sam (19f) who used to bully me for about 2.5 years back in high school. She would tease me, make comments about my appearance, spread rumors, and physically hurt me. I quickly walked up to my closest friend asking why Sam was there. Apparently, Sam had reached out as she wanted to apologize because she realized how mean she was back then. I met many of my current friends in uni so they did not know me or Sam back then.\n\nSeeing Sam again made me feel horrible and gave me flashbacks of all the things she did to me. I was so happy when they first surprised me but I felt like crying after I saw her. I went up to Sam and simply told her \"what made you think I wanted you here on my own birthday?\" in front of everyone. Then I stormed out because I was extremely mad that she had the balls to show up at my birthday knowing what she did. I got countless calls from friends but didn't pick up. I started getting messages saying that it is ungrateful that I left after they gathered everyone, spent so much money & time, and planned everything so far ahead. They also said that it was rude of me to confront and embarrass Sam in front of everyone as she was \"literally there to apologize\".\n\nI'm wondering how they thought I would react if they invited a bully of mine to my own birthday. In what scenario would anyone like that? I'm happy that she realized what she did was wrong and I would have talked to her any other day, but not on a day that is meant to be special and happy for me. She picked the worst day of them all and I am wondering why my friends said yes because they know I'm a very sensitive person. I'm starting to feel like I should have been the bigger person and stayed, but just ignored Sam. AITA?", "created_utc": 1682009524, "permalink": "/r/AmItheAsshole/comments/12t7nv8/aita_for_leaving_my_own_birthday_party_after_they/", "score": 71, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. the act i did to be judged was that i left my own birthday party because my friends invited a girl that bullied me back in high school \n2. that could make me the asshole because my friends spent a lot of time and money planning the party and i left within the first 5 minutes.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "She didnt need to attend your birthday party to apologise. \n\nThey are AHs. They should have told her to apologise prior to the party and then asked if you are comfortable having her around.", "NTA for the reasons you already stated. Almost any other day would have been fine, but this was a party for you on your birthday, when you should not have to relive that bullying. It was a selfish act to only make herself feel better.\n\nEdit to add: I feel like people are also ignoring the semi-public \"surrounded by friends\" setting here. Sam designed this to be a spectacle that would play out in a specific way so you could not just kick her out without conflict. You basically had to accept her apology or you'd be the bad guy. There was no way out of this that would have kept you happy and I'm in full support of you not falling for that bullshit.", "NTA. I hate it whenever someone tries to dictate what someone else is allowed to feel. Coming home to a surprise party is overwhelming in a good way. Then seeing your bully and tormenter (from not so long ago) was the exact opposite. Kind of like emotional whiplash. \n\nIf she reached out to your friends to apologize, I don't understand why they didn't talk to you about it first. Not just to be sure you would be receptive but also to make sure you were mentally prepared. \n\nStaging an apology this way, in front of a crowd, puts the entire burden on you. You have to either tell her all is forgiven or you're the bad guy. Either way, the bully gets off scott free. \n\nI am also skeptical that she is really sorry. She probably heard about the party and just wanted to attend. If so, then she just got away with bullying you again.", "Absolutely NTA. If she truly wanted to apologize, she should have chosen a more private situation. As you described it, it looks more like she just wanted to publicly show herself as a better person than she really is. Like why on earth would you want to do that in front of everyone? Also, considering that all the \"friends\" supported her, I would have just left too.", "NTA\n\nMaking a spectacle of an apology at a party takes away some of the authenticity of it for me personally. It should have been done in private, when OP was ready to confront their bully on their own should they so choose.", "NTA - people get more upset at the victim for reacting, more than at the perpetrator for perpetrating. You can’t decide how someone else should react to something surprising and hurtful. She may have been there to apologize but it is not the right setting. Also, you can forgive her (if you want) and still not want her at your birthday party celebrating with you as a friend. I think this was a bad call on your friends’ and family’s part, and perhaps you owe each other apologies for the misunderstanding. \n\nMaybe it would have been better to privately ask her to leave and then stay and enjoy your party but hindsight is 20-20. Curious what others think…", "NTA sam wanting to apologize is reasonable i guess? but it’s up to you to accept it or not and it’s INSANE that anyone would thing your birthday party is a good place for that to occur", "NTA. This is fundamentally no different to a public proposal of marriage to manufacture an undesired ‘yes’.", "You're nta, you are not entitled to accept someone's apology just because they want to give one. She should have reached out, and asked you if you wanted to meet up in person, or she could have apologized over a message. To have someone who verbally and physically abused you be standing right in front of you, on what is supposed to be a happy occasion to celebrate you is messed up. I have no clue why your family or friends would think its okay to trigger your trauma on your birthday. Seeing someone who hurt us just brings us back to everything they did, and that's the last thing you need on your birthday. Wrong time, wrong place, wrong way to do that. Your fam is TA", "There's no way around the fact that it ruined the party for you, despite everyone's intentions.\n\nIf anyone knew that Sam had been mean to you in the past, it was a huge mistake for them to invite her. A birthday party with friends is not a place for an apology from a tormentor.\n\nI guess your friends aren't dealing with any leftover bully trauma, so they don't get the effect that this could have on you.\n\nAnyway, sure—it would have been great if you could have been civilized and not made a fuss, but we don't always have our full capacity for etiquette in every situation, and you did what you had to do to take care of yourself. NTA.", "If Sam rally wanted to apologize she should have reached out to you and talked with you at a moment of your convenience. A real apology is more than just saying 'Sorry' and then enjoying your party. A real apology contains recognition, responsibility, remorse and efforts to undo the harm done. \n\n**It isn't showing up** **at your birthday party.** If she was serious she would have stayed away.\n\n*I started getting messages saying that it is ungrateful that I left after they gathered everyone, spent so much money & time, and planned everything so far ahead.*\n\nIf they wanted the surprise to be a happy one for you, they shouldn't have given into your bully's request of being invited.\n\nShe made you feel uncomfortable at your own surprise birthday party, and this even managed to turn some 'friends' against you.\n\n*They also said that it was rude of me to confront and embarrass Sam in front of everyone as she was \"literally there to apologize\".*\n\nIt was rude of Sam to show up, it was rude of your friends to invite her. It is rude of your friends to not understand what Sam put you through, and it is rude of your friends to not realize after you walked out how your bully and her past actions still affect you.\n\nIt is also very rude of Sam and your friends to use peer pressure to try and make you accept your bully's apologies.\n\nWhich she hadn't given yet. So we don't know if she would have apologized. \n\nFor the moment she is still your bully and she got to enjoy YOUR surprise party without your presence. \n\nNTA", "NTA. Although we agree that you probably should have been the bigger person and stayed. However, it was your day and you could have reconciled any other day. Your friends should have known this if they knew that you had been bullied (yes, they didn't know the specifics between you and Sam, but Sam would have said to the friends that she did bully you and wanted to apologize). They should have known not to invite an ex-bully on your birthday.", "NTA.\n\nIf Sam wanted to apologize, it should have been done privately, not at a birthday party. And your friends should not have invited her without knowing exactly what she did or how you would react. They screwed up, not you.\n\nThat said, you could have handled it better, both there (I appreciate what you want to do Sam, but this isn't the time or place, leave me your number and I'll call you some other time) and afterward (If Sam is gone, I'll come back, I know you meant well, but it really was a bad choice without checking with me first). Sam's bullying was traumatic as hell for you, so your reaction was understandable, but you missed an opportunity to take control of your past and your trauma and move forward. You missed an opportunity to fix what they did wrong (in having her show up at your party unexpectedly) and in essence you victimized yourself again by ruining your birthday party when it was poised to be such a fun, gratifying, and uplifting event. They damaged the start of your party, but you let yourself be victimized in a way which ruined the whole party. I'm sorry, but harboring such ongoing resentment and unresolved trauma is harmful to you and will continue to hurt you in life.\n\nGo to therapy - or back to therapy - or address this with your current therapist. Have them help you decide whether an apology from Sam will help you, and how to get that apology in a safe and productive way. Have them help you decide the best way forward with your friends. Your friends seem to really like you and be pretty awesome, except for this one big faux pas, which likely comes from not understanding the nature or depth of your trauma or the right way to help you resolve it and Sam apologize for it.\n\nSam has grown up a lot since then, it sounds like. You don't owe her anything, but what you owe yourself is probably different from what you are thinking. Giving her an opportunity to apologize and ask for absolution may be a gift you give yourself.\n\nThink carefully about how to move ahead from here for your emotional health and stability and healing. Victimhood may be emotionally gratifying on a weird level, but its not a healthy coping mechanism and why victimize yourself?", "i just don’t understand why you wouldn’t tell her to leave instead of ditching the party that they threw for you??", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (20f) turned 20 a few days ago. My friends and a few family members threw me a birthday party after I got home from class. I was so happy and felt so loved as I had always planned my own parties previously but never had a surprise one. I looked around the room and saw Sam (19f) who used to bully me for about 2.5 back in high school. She would tease me, make comments about my appearance, spread rumors, and physically hurt me. I quickly walked up to my closest friend asking why Sam was there. Apparently, Sam had reached out as she wanted to apologize because she realized how mean she was back then. I met many of my current friends in uni so they did not know me or Sam back then.\n\nSeeing Sam again made me feel horrible and gave me flashbacks of all the things she did to me. I was so happy when they first surprised me but I felt like crying after I saw her. I went up to Sam and simply told her \"what made you think I wanted you here on my own birthday?\" in front of everyone. Then I stormed out because I was extremely mad that she had the balls to show up at my birthday knowing what she did. I got countless calls from friends but didn't pick up. I started getting messages saying that it is ungrateful that I left after they gathered everyone, spent so much money & time, and planned everything so far ahead. They also said that it was rude of me to confront and embarrass Sam in front of everyone as she was \"literally there to apologize\".\n\nI'm wondering how they thought I would react if they invited a bully of mine to my own birthday. In what scenario would anyone like that? I'm happy that she realized what she did was wrong and I would have talked to her any other day, but not on a day that is meant to be special and happy for me. She picked the worst day of them all and I am wondering why my friends said yes because they know I'm a very sensitive person. I'm starting to feel like I should have been the bigger person and stayed, but just ignored Sam. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your closest friend was wrong to invite Sam.\n\nIf sam really wanted to apologize and make amends, that fine.  But this is never done at a party or celebration.  \n\nNTA", "NTA Throwing you a surprise birthday party with your bully there is shockingly naive at best. They're blaming you for reacting in a very predictable (and understandable) fashion. They should look at themselves and acknowledge that they messed up, and apologise.\n\nIf your bully really wanted to apologise for their treatment of you, they should have reached out to you. I'm assuming they got in touch with your friends and asked them to attend? That is bizarre behaviour in my mind.", "NTA there are 365 days in a year", "NTA - she just found another way to bully you and your friends enabled it.", "NAH, I think it's hard to blame you for how you deal with trauma. And if she wanted to apologize she should have reached out as an individual.", "[deleted]", "ESH  \nSam for choosing your birthday to come and have her moment of repentance.   \nAnd you for storming out of a party that had been planned by others.  \nYou should have asked for Sam to leave rather than leave yourself and spoil the party.", "[deleted]", "NTA.  But instead of leaving, I would have just told Sam to GTFO.  Your birthday party is not the time or place for an apology", "NTA to your bully, you don't owe her kindness or consideration. You are the asshole to your friends who wanted to create a special day for you. They are not in your head and cannot understand your reasons as well as you and it seems you didn't take the time to explain to them. You acted childishly by leaving and honestly I would probably at this point be Sam's friend over yours. She can obviously grow and change. While you can't even respect your friend efforts enough to stay or talk to them.", "NTA\n\nYour ‘friends’ screwed up. They owe you an apology. \n\nAfter you receive that, reiterate why you responded the way you did. Depending on their response, you may need to reevaluate the friendships.", "I agree! Also, what kind of \"Friends\" set you up like that?", "This! You were in a lose/lose scenario. It was only going to work for your bully. Your options were to suck it up and accept the apology for everyone else's benefit or do what you ended up doing. Which make you NTA in my opinion. Oh and now find some better friends. It's not their business to broker a peace between you two at your birthday party", "Yeah, I can't imagine that a birthday party is the place to apologize. If it was genuine she should've done it beforehand and maybe been invited as a way to mend bridges? Pretty messed up tho all around", "Am I the only one thinking \"you reacted to suddenly and unexpectedly being revictimized and traumatized again wrong\" is one _hell_ of a take?", "you also literally said they didn’t even know the situation between you??", "If her friends had planned a party *for her* they would have realized it should’ve been about celebrating the birthday girl and not making it about Sam’s apology. Sam knew what she was doing and was acting selfishly by even asking to do this in front of everyone at her party. \n\n\nI think OP will find great friends someday who will throw a wonderful surprise party- without any bullies", "I’d argue it was rude and immature of her “friends” to invite someone who used to pick on her to her one special day of the year, then expect her not to have a sour reaction and get upset when she does. Some friends, if my friends felt it was appropriate to invite someone who used to pick on me to my birthday I’m not sure I’d ever want them throwing parties for me again anyways!", "OP explicitly said the bully was there to apologize so I don’t agree with the first half of what you said. Either way, OP explained it well, she would have been fine talking any other day but not on her birthday. That makes sense to me, why would you want the one day that’s supposed to be special to you to be tainted with having to accept an apology from someone who used to make your life hell? Then be forced to spend the rest of your day around that same person? Nah, if it was me I would have left too. I’m not going to sacrifice my birthday so an old bully can feel better about themselves, I agree with OP the bully can come “apologize” any other day of the year.", "they just said that their friends didnt specifically know Sam. They clearly knew the situation because that's why they let Sam come in the first place"]}