{"id": 15339, "submission_id": "12u36yp", "title": "AITA for selling a family heirloom to pay for my destination wedding?", "selftext": "My fiancée (38F) and I (39M) are planning to get married this summer. We both want to have quite a lavish wedding at a winery in another state. The two of us agree that it's the most important occasion in our lives, so we should make it as memorable as possible. We both have stable jobs and a good amount of savings, but it's not quite enough for the (admittedly ambitious) plans we have in our heads.\n\nMy father passed away in January, and in his will he left me a very valuable (think five figures) family heirloom. I'm not much for big family traditions, so although it's a nice thing to have, I'm not massively attached to it. I have plenty of other good memories of my father and I don't need a fancy heirloom to remember him by. My brother (34M) however is a huge history nerd, and is really really attached to it. He was very upset by my father's decision in the will (the reason it went to me and not to him is that this has been traditionally passed to first-born sons). My fiancée and I don't plan to have children, and I think he assumed therefore that he (or his children) would be in line to get it if I were to pass away.\n\nAfter some discussion, my wife-to-be and I decided that we would like to sell the heirloom to pay for our wedding. My brother, who is also my best man, was furious when he found out, and said he wanted nothing to do with the wedding anymore. He thinks my wife-to-be and I are behaving like spoiled brats. In addition, he's convinced my uncle and cousins not to come to the wedding either. With our parents having passed away, this means that virtually none of my family will attend the wedding, which I'm really upset about.\n\nI think since I legally inherited the heirloom I can do what I want with it. I think he's just upset because I ruined his expectations of one day inheriting it, but since my uncle and cousins agree with him enough that they're not coming to the wedding, I'm not so sure I'm in the right. AITA?\n\nedit: accidentally called my fiancée my wife in a couple places", "created_utc": 1682086692, "permalink": "/r/AmItheAsshole/comments/12u36yp/aita_for_selling_a_family_heirloom_to_pay_for_my/", "score": 371, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I sold a five-figure family heirloom to pay for a destination wedding. My brother (who expected to inherit this heirloom) is furious with me and claims I have no respect for the family. I think I may be the asshole for ruining a centuries old tradition, but on the other hand the heirloom is my property to do with as I please.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Technically you can sell it because it’s yours but YTA for caring more about a ridiculously lavish wedding that will break the bank, than you do for your relationship with your brother or your dads tradition. If your dad had known that you were going to sell it, he would have left it to your brother. \nI hope your lavish wedding is worth it to you.", "YTA while it's technically yours to do what you want with, I think you are being quite selfish knowing the whole story.\n\n> He thinks my wife-to-be and I are behaving like spoiled brats.\n\nYour brother is correct. You want to sell something that your brother would treasure for a party.\n\nEDIT: Also, the reason the Uncle is upset is because he is in a similar position as your brother. It was passed down to your father (I'm going to bet the uncle is younger) instead of him. Now to you. And because it means nothing you, you treat as though it doesn't mean anything to anyone else. It was a family heirloom and you were just supposed to the caretaker.", "YTA, if you sell the item don't be surprised if it ruins your relationship with your brother forever. All for what? So you can brag about your wedding to friends, while looking at pictures that don't include anyone on your side of the family.", "YTA. You are being very selfish and short-sighted. \n\n> We both want to have quite a lavish wedding\n\nAnd in your late 30s, you can't afford that without hocking something important to your family? Yikes.", "YTA \n\nYour father trusted you with this item for whatever reason. You don't care about it for whatever reason but why didn't you just give it to your brother or another family member? You knew your family cared a lot for it, don't act surprised they're not joining you on your special day. You messed up big time.", "Yes, YTA. \n\nAs soon as I read you have a brother I realized how selfish and self centered you are. It’s been passed down through your family for generations and while you don’t care about traditions, your brother would have greatly appreciated it and it’s likely what your dad would have rather you had done with it. \n\nAnd if your marriage doesn’t work out in the future (anything can happen), you’ll be an even bigger ass for selling it.", "YTA, legally being able to do something doesn't mean it is the right thing to do. I doubt your dad would have given you the heirloom if he knew you would sell it off like it was nothing. Your brother didn't convince anyone to be mad or not to go, I bet he just told them and they made those decisions mostly on their own. You probably should have thought that all out before making a selfish, self-centered decision.", "This is a FAMILY heirloom, and while it doesn't mean anything to you apparently, it does have meaning to your brother. So yeah, you can sell it, that's your right, just as it's his and the rest of your family's to not attend your wedding if you do. So I'm gonna say YTA, not for selling it, but for acting like your brother has no right to be upset about it.\n\nEdit: I just saw your response to the bot where you say this heirloom is centuries old. I've changed my mind, YTA for selling it, way to bury the lead.", "YTA. You prioritized funding your wedding over your relationship with your brother and now you’re experiencing the consequences of your own actions. Sit down and think about whether your dream wedding is really worth this.", "YTA.\n\nI am the receiver of a family heirloom. Passed from mother to daughter on and on. I am the last to receive it. It came over on the mayflower. From me it's going to a museum in Massachusetts. \n\nYou could have given it to your brother. People hate destination weddings.", "YTA \n\nOut of your budget weddings are silly to begin with.  Selling a family heirloom that apparently means a lot to the rest of your family to do so is just selfish.\n\nI do not blame them for not wanting to go.", "YTA. It’s a family heirloom, if you don’t want to respect it pass it to another family member.", "YTA why would your family want anything to do with someone who sold a expensive family heirloom to pay for a wedding. You dishonored your fathers memory.\n\nAnd crapped all over your other relatives that this heirloom meant something too.", "YTA.  This wedding is ONE day.  While you might not care about tradition or family heirlooms, it is such a shame that you're willing to sell it to fund a ONE day event. An event that will not have your family in attendance.  Yes, it is yours to do as you please, but it obviously means quite a bit to your brother (with good reason) and I can see why he's upset.", "Oh YTA no doubt\n\nSure technically it’s yours but you know how important it is to your brother and you absolutely knew that making that decision would damage your relationship.", "YTA only because your decision seems to be affecting your entire family. Is a wedding more important than the people that matter most?", "YTA. I mean, ultimately it's yours but kiss your relationship with your brother goodbye. You'd sell something that he and your dad shared an interest in, that he wants, so you can throw one big party for yourself. Can't get more selfish than that. But it's legally yours so do what you want.", "If it didn't mean much to you, why not give it to your brother?\n\nIf you couldn't afford your wedding without having to sell the heirloom, you should have done a better job with saving money.\n\nYTA", "I was torn until I remembered that I have my great grandmother’s watch. It’s solid gold and 100+ years old. My grandmother wore it every day. It came to me because I am the oldest. If I sold it for something I didn’t really need my sister and brother would be devastated. It represents a lifetime of memories of our grandparents and we regularly bring it out to show the grandkids. I am merely the curator of this item and one day I’ll give it to another descendant. \n\nIn light of how you say your brother and father felt about it, I think YTA for indulging your more superficial needs.", "YTA.\n\n It's family _legacy_, ie to be passed down. Not a gift to you to pay for your wedding. And that difference is pretty clear to most of us.", "100% YTA", "Technically / legally it’s yours to sell. \n\nEthically it’s a crappy move for many many reasons, not least the fact you are more concerned about the wedding than the marriage\n\nYTA", "YTA. Yes, you can legally do what you like with it, but you don't have to break the law to be an AH. A family heirloom that has a lot of sentimental and informational value to your brother isn't something you should get rid of without discussing it first. If having a wedding you can't afford is more important than your relationship with your family (as you've shown at many points in your story), then you're 100% an AH.", "YTA.  Also, if you think this wedding is going to be the most important event in your life… that’s just plain sad.", "Yta. Greedy and selfish. Make your own money to pay for your OWN wedding", "YTA. \n\nIt’s not a question of whether it was *legal* to sell it, but more a *moral* one. \n\nLegally, you’re entitled to do whatever TF you want, I guess. \n\nBut morally… man, you can’t see just how in the grey you are. \n\nYour brother would have dearly loved to have the item and likely bequeath it to his first born son, and so the family tradition would carry on. It’s an item that is centuries old, that your brother and father “geeked out” together over. This right here, to me, would have been the signal to give it to your brother. \n\nNow, you are in a position where your family don’t want to come to your wedding, and honestly, I don’t blame them at all. It is a totally selfish thing to do to sell it so that you can fund a lavish party. \n\nA wedding is just one day of the rest of your lives. Have you never heard the phrase “live within your means”? If this party wasn’t within your budget without selling the heirloom, you should have scaled it back to what you could afford, rather than hocking an item that is steeped in history and family tradition. \n\nI’m honestly not surprised at all that your brother and other relatives are made at you. I would have lost my shit and turned my back on not just your wedding, but **you** full stop.\n\nEdit: typo", "YTA", "YTA", "YTA I guess the rub here is what you can legally do and what your morally should have done. From what you said both your brother and father loved geeking out over this thing so it had a lot of value to your brother than just it's value. It was likely a connection to your father for him and also it's history and not just valuable in $ terms to him. Legally sure you could do with it what you will, morally I think you really screwed the pooch on this.", "YTA. If you’re going to sell a valuable family heirloom, you use the money to buy a house, make an investment in your future like going to school or starting a business, or to pay for a life saving medical treatment for yourself or a loved one. You don’t sell a family heirloom to pay for a one day celebration. If you and your fiancé don’t have the money to pay for a lavish wedding yourself, that’s a sign that you shouldn’t have one. I don’t blame your family for boycotting your wedding.", "YTA I’m a firn believer that if your wedding is going to cause you to go into debt, you should probably tone it down. You shouldn’t have to sell valuable *family* heirlooms or sacrifice your firstborn to pay for them.", "this is really sad...sold it for the worst reason money wasted on a wedding for 40 year olds.", "YTA you are nowhere near being in the right. Funny how you are upset that none of your family will not be attending your wedding but don’t see why they feel that way.", "YTA. Maybe I’m overly emotional because tomorrow is the anniversary of when my dad died. I cannot imagine being so callous as to sell something my father left me for a fucking wedding. Of course your fiancée wants to sell it so she can get her dream wedding. She has no attachment to it. \n\nI would be devastated if I were your brother or any of your dad’s relatives. This would be a reason to go no contact with you for me.", "YTA. Apologize and give the heirloom\n to your brother. That’s the only shot you have at fixing this if you want to have family at your wedding (or in your life at all).", "Question:  Did you already sell it?  If not, then you still have a chance to NOT be TA.  If you did, then you should try like heck to get it back.", "You were absolutely legally entitled to sell it since it was willed to you. But still, YTA, because *of course you are*. This post almost feels like bait.", "YTA. The fact your father used to geek out over this with your brother means he wouldn’t have been happy you sold it either. \n\nIt’s ironic tradition is the only reason you got it and yet you spit on it.", "This is not Am I Legally Allowed- this is AITA. \n\nYTA- this is a very valuable family heirloom that your family cares about, just because you don’t care about history doesn’t mean you should throw it away. \n\nYou want to have a fancy party and a fancy vacation at the expense of your family. Is that really the choice you want to make?!", "You are literally ruining the relationship you have with the last living member of your immediate family over having a big party. YTA and will have big regrets one day.", "YTA. You should have gifted it to your brother straight away, or exchange it for something.   \nIf you sold it you should have sell it to him. I would even understood you sold it after offering it to him first if you purchased a house or if you were in dire monetary situation but for a wedding, that seems awful.", "You are completely within your rights and you are definitely the asshole. YTA!", "YTA. I’m sure he didn’t have to convince people to not go. They decided after hearing that you were selling the family heirloom", "YTA", "wow, YTA. you sold something that has been handed down to the men in your family for generations. legally you can sell anything that is yours, but morally? that is a heartless thing to do. it doesn't matter if you won't have kids, your dad gave it to you with the intention for you to carry on the tradition with a nephew or someone down the line.", "It sounds as if you both do have enough money for a beautiful, nice wedding, and you're just being selfish and wanting more. I understand wanting a dream wedding. But at the expense of tearing your family apart and ridding the rest of your entire family the pleasure to hold onto something that reminds them of your dad. YTA.", "YTA \n\nHe’s never going to forgive you, if you can live with that go ahead. I hope the memories of your wedding are worth it.", "Come on, how could you not know YTA here?", "YTA. Your family and their heirloom deserved better. So effin shallow. Enjoy your destination wedding without your family!", "*(the reason it went to me and not to him is that this has been traditionally passed to first-born sons).*\n\nYou got the heirloom instead of your younger brother for the sake of tradition. The same way your father got the heirloom to keep instead of his brothers. So it is safe to assume that your father didn't bestow the heirloom on you because he wanted you to have the monetary value. He trusted you with it because of the family tradition.\n\nOr was your father aware that you couldn't be bothered with the tradition, that you did not plan on having any children to pass the heirloom on, and that you would sell it instead of keeping it in the family?\n\nYou are indeed in your legal right to sell it, but the question still remains:\n\nWhat do you value more?\n\n\\-The monetary value of the heirloom.\n\n\\- The relationship with your family who value the family tradition of the heirloom, and the memory of your father who bequeathed it to you so you could honor that same tradition?\n\nYou can decide AITA yourself.", "Omg massive YTA. It was a family heirloom— even it it didn’t hold meaning for you, it held meaning for your family, and you knew that. You acted out of pure selfishness, and it’s completely understandable that you now have family members dropping out of the wedding. \n\nThe only thing that can make this right would be to get the heirloom back if you can. If you can’t, it’s time to sincerely apologize to your family and admit you have now seen the error of your ways. Offer to pick out something together that will hopefully become a new family heirloom. Then hope to god that they’ll accept, because they’d certainly be within their rights not to.\n\nAlso I’m just going to say it: I worked weddings for five years. The worst ones were always the incredibly lavish, expensive ones where the couple was overly concerned about the aesthetics and flaunting to their guests. And by “worst,” I mean that many of the couples weren’t even happy the whole day because they were too focused on having the perfect day, and the guests didn’t even have that great a time because the whole thing felt more like a spectacle than the start of a loving marriage. Some of these couples we learned got divorced within in a few years. The best were the weddings that focused on people, not perfection.", "YTA when it comes to family heirlooms, your not really the owner of it, you’re the caretaker. Your job is to take care of the heirloom until it comes time to pass it down in your will or earlier if it suits you. But you should definitely pass it on. This heirloom holds sentimental meaning to your family. It is an honor you got it. If you don’t feel that way, that’s fine, but don’t sell it. Pass it on to your brother who you know has great respect for it. Can you legally sell it? Yes, but you don’t get to control how your family feels about it. They have a right to be mad. Your father, I’m sure, did not intend for you to sell it. It’s nice to have a big expensive wedding, but you don’t need it. Wedding last one day and trust me, it goes REALLY quick. Your heirloom will last generations. Perhaps a member in your family in the future really will need to sell it because someone they love is sick and needs expensive treatment, or any number of really good reasons to sell such a sentimental piece. I hope you reconsider. I think you will regret it later.", "YTA\n\nIs an extravagant wedding really worth ruining relationships with your family? Weddings are about families coming together, not how expensive of a venue you could book. I can understand why your brother and other family are upset, it's like you're choosing to show off like you're richer than you really are instead of holding on to something that's important to your family.", "INFO: Is it already sold? And did you offer your brother to buy it from you first?", "YTA. It's called a family heirloom for a reason. That means it stays in the family. If you don't want it. Pass it on to family that does. I picture LC or NC with you family in the future.", "INFO: What would your father think?", "YTA.\n\nYou are certainly legally entitled to sell it, no question. But this isn't a question of whether you're legally justified.\n\nKnowing it's a family heirloom and knowing that your brother values it even though you do not, you are a tremendous asshole for not giving him the first opportunity to at least buy it (I'm working on the assumption that he received a similar value of inheritance? If so, then a sale is fine. If he got nothing of monetary value and you got this, you'd be an AH for even selling it to him as you did nothing to earn this).\n\nI don't blame him for his reaction to your selfishness.", "Wow...YTA.", "YTA\n“I think since I legally inherited it…” this is AITA, not a legal advice sub, and you are a massive AH for selling a family heirloom to pay for a wedding. The fact that you are so dismissive of your brother’s and other family member’s connection with it just shows how little you care about your family.", "YTA.  How fucking selfish and vain of both you and your fiancée.", "YTA Bigly. I can't even imagine why you would think you weren't.", "Wow YTA. Your family didn’t want you to have for this exact reason. You turned out to be exactly as they expected. A huge spoiled brat and admittedly a not nice person. Give the heirloom to your brother, pare down your “lavish” wedding that you can’t afford even before your father died, and be a kind person instead. Lavish weddings are just dumbs wastes of money anyway.", "YTA - Your father cared enough about tradition to pass it to his first born. He would be disappointed.  Did your brother receive anything that could be swapped for the heirloom?", "YTA\n\nGive it to your brother if you don't care for it. Selling it will be insulting to your father and everyone in your family and I can see why they refuse to attend your wedding.", "YTA. You do realize that if you do this and you and your wife ever end up getting divorced you won’t be able to rely on your family for support, right? Not after you selfishly sold your family’s legacy in order to pay for a failed marriage.", "YTA. Your brother and the rest of the family respond with the same behavior as you’ve shown. \n\nYou don’t value family, so why would they bother to join you at your wedding. You are not to be trusted with caring for family inherits, why would they care for you and your fiancé.", "INFO: Did you even think of offering to sell it to your brother before you sold it to someone else?", "Legally you can sell it but morally YTA. Just because you don't care doesn't mean that other people in your family shouldn't have had a chance to keep it. Your father really messed up by sticking with tradition instead of giving it to someone who would actually follow his intention of keeping it on the family.", "My family heirloom is a late 19th century Singer sewing machine. Sale value £25? Value as heirloom - priceless. \n\nI actually have newer better machines and that Singer is packed away gathering dust. I know it would sell, and we need the space BUT it isn’t “mine” it will pass to my daughter, and if she has no children it will pass to my oldest grand-daughter. The fact that she is F2M trans means that he might prefer to have it left to his oldest sister - but that will be his choice. I am not automatically disinheriting him, as he might have a daughter one day but if he feels it wrong to lay claim, then that will be his choice.", "Yta in comments Op reveals the item was left to them bc of 'tradition' and his brother *actually* cares about it.    She should have gifted it to her brother since she doesn't give a flying fig about it.\n\nOP, ask yourself.  Is this money worth ruining your relationship with your brother?", "YTA massively holy shit.\n\nSo this extremely special and valuable item ONLY passed to you through birth order, despite your brother desperately wanting it.\n\nBecause you don’t care for it, instead of making an arrangement so your brother could have it, you decide to sell it out of the family to pay for a single party.\n\nAre you legally in the clear? Sure. Are you a huge, massive, complete and total AH? Absolutely.\n\nHave the wedding you can afford. If you have to sell precious family heirlooms to pay for it, then you are acting out of your price range. I hope sacrificing your relationship with your brother is worth the party.", "YTA. Not only is it terrible that you chose a wedding over the memory of your father, but you're making terrible financial decision. Enjoy that precious wedding of yours with no family by your side. Just know that your relationship with your brother will most likely never recover.", "YTA\n\nThat is a family heirloom worth a lot of money. Your brother only didn't get it because he wasn't the oldest.", "Yta, but hey, you clearly never cared what your family though, so you can enjoy your expensive wedding with your soon to be wife and her family", "YTA\n\nYour Dad only died in January and you are already selling important valuables to fund a wedding. If your Dad hadn’t died how would you have afforded it? This is why I have a clause in my will preventing my oldest from selling anything I leave her and instead she has to pass it to her sister.", "It’s kinda sad the parents didn’t raise their first born right.", "YTA\n\nYou disrespected your family by selling something that was important to them. You shouldn't be shocked they don't feel the need to celebrate you. Also likely spending a pretty penny of their own money to do so, adding insult to injury. Destination weddings are expensive to guests and generally an annoyance, as an fyi\n\nYour father was also the AH because if there was any reason to break tradition, it was by not giving it to the person who wouldn't value it.", "YTA\n\nIt's a family heirloom that means a lot to your brother.  You clearly don't deserve it but got it on the basis of a tradition that you don't value at all.\n\nYou sound very entitled and materialistic and to be honest you should expect others to treat you with the contempt you are showing them.\n\nIf you were decent at the very least you would keep the heirloom and continue the tradition by passing it on.  If you were better you would pass it to your brother because it's important to him and he can then keep the tradition alive.", "YTA \n\nYour selling something sentimental to be able to show off for a day. \n\nYour family is not coming because they have discovered how vain you are and don’t want to associate with that.", "YTA. A five-figure family heirloom sold to pay for a party? Seriously?", "YTA YTA YTA. It's a Family Heirloom, meaning it's supposed to stay in the family. And you threw it away for a one day wedding?? You're awfully vile", "YTA", "YTA", "YTA. You knew your brother wanted it and sold it anyway.", "Read the room. There are many things you can rightfully do. That doesn’t mean you should or need to. Give it to your brother the ring and apologize and scale back your wedding or get a zero interest credit card that will give you 14-18 months to pay interest free.  YTA", "Absolutely YTA", "YTA, you sold a family heirloom that you know your brother really liked. And you did not even give home the change to buy it it before you sold it. A family heirloom is never yours you are just the custodian. And if its sold it should be for a solid reason like cost related to an operation or alike that is not covered by insurance", "Yta, so you sell a valuable family heirloom to help pay for your \"lavish wedding\", what sacrifices has your fiancée made to help pay for it? Has she had to sell any family heirlooms as well or is just you.\n\nI hope your close to your fiancées family because you've probably just lost your brother and maybe the rest of your family as well, so I hope your wedding is worth it.", "YTA. \n\nDon’t you think there were times your ancestors could have used the money? Like REALLY used the money for survival?? \n\nThe Great Depression comes to mind (assuming it’s been in your family that long). \n\nAnd yet they didn’t sell it as they wanted something for their children and their children’s children.", "People need to give these things to the people who value it. YTA", "YTA\nThe wedding is not the most important thing in life.  The marriage is.  \n\nGrow up", "Need more info: what is this heirloom? Give us some context.", "YTA\n\nYou don't care about the family heirloom. Tyat's fine. But to sell it for your wedding, when you brother obviously cares about it. It seems to me like your brother didn't have to do much to convince your family not to show up to your wedding.", "Morals play a bigger part as you grow older. You prob won’t have a family if you end up selling this family heirloom. Give the heirloom to your brother.", "YTA. You have a 50/50 chance this marriage will work and you’re willing to sell a family heirloom on those odds….. \n\nYou’re fiancé is only looking at $$$$ signs and you’re willingly being manipulated.", "YTA. What exactly is this mysterious heirloom? I get the feeling that if OP were more specific it would come off as much worse and that's why he's trying to downplay that.", "YTA and the title was sufficient for the judgement, the post reinforced it.", "YTA. Ever hear the saying \"Just because you can doesn't mean you should?\" Because that's what's going on here, OP. Legally, you can sell it. But the price for selling it is playing out in front of you. And if you judge a party to be worth more than some relationships, then own that. Tell your brother that legally you can do what you want, his feelings don't matter, and you're willing to trash your relationship with him because the party matters more to you.", "Yta. I have no family heirlooms to pass down. But if I did, I would absolutely know it wouldn't be mine to sell. Why did you not discuss this with your family first? See if they'd be willing to throw some money towards the wedding before you sold a family heirloom? \n\nObviously, your fiance is biased because they want the wedding, but did you not think about the long-term consequences of this? Your family will probably go NC with you over this because  I know I would! Honestly, an over the top wedding that requires you to sell anything is tacky af. I don't know what the hell you were thinking. That heirloom should have just gone to your brother instead because it's obvious you had no appreciation for it what so ever.", "YTA.\n\nYour wedding is one day. One. Yes it’s one of the most important occasion of your lives but in the end, it’s a fancy party that’s one day. In the grand scheme of things it doesn’t matter if you have the fanciest wedding in the world or a backyard bbq, it all means the exact same. You sold a family heirloom and put in jeopardy your relationship with your brother and the rest of your family for…a fancy party. That’s it. That’s what you did. How can you even ask if you’re the AH? Like…enjoy the four string quartet but your brother will never forgive you? How did that even play out in your head.\n\nAlso, you may call the artist lesser known but if it sold for 5 figures, the art world clearly knows them.\n\nAnd for it’s worth, I used to work in the wedding industry. Couples who plan weddings they can’t afford are usually the same couples getting married for the wrong reasons.", "If there ever was a case of YTA, this is it. I hope you think it’s worth trading your family for a lavish one-day event that no one else will care about.", "YTA\n\nI hope losing your family over having a fancy wedding was worth it.", "YTA, selfish, mean, unfeeling, and things I can’t type out here. Your fiancée is, too. \n\nIf I were your brother, I’d never forgive you for this and good for him for telling your remaining family members about it. I’m glad they’ve all left you over this. \n\nYou might’ve put a monetary worth on this object, but to your brother it’s absolutely priceless. You KNEW why your father left it to you and yet you’re still sold it. \n\nI hope your stupid destination wedding is worth it. You’ll be divorced within 5 years probably.", "Yta. Do this and be prepared to not have any family left. If I was your brother this would cause me to completely cut you off. I hope you have a good relationship with your wife's family because if you ever need anything in the future they are the people you'll have to go to. Cause your brother will never forgive you for that.", "YTA. what did you expect? You sell a family heirloom for a one day, dumbass party in a fancy destination, shitting all over your family history in the process.\n\nI'm glad they're all cutting you out.", "You're entitled to do what you want with it.  You're entitled to be callous, selfish, insufferably stuck on *OMG THE MOST IMPORTANT OCCASION OF OUR* ***LIVES!!!!!!!***.\n\nYou're also entitled to the fallout.  \n\nYou started it by having zip, zero, nada concern for how this would hurt your brother, he now has zip, zero, nada obligation to care about what will hurt you.\n\nYTA", "YTA. You sold an irreplaceable family heirloom you didn't give two shits about KNOWING how much it meant to your brother! You traded decades of family history for a single day. You are incredibly callous and selfish", "YTA.\n\nMassively.\n\nAnd I think on some level, you realize it.\n\nNow the rest of us do too.", "Yta", "YTA.\n\n You are willing to dishonor your father's wishes and destroy your relationship with your brother and father's families just for a party for 1 day. For a marriage that, forever what reason, may not last. \n\nMost heirlooms are passed down, not because of their monetary  value, but for what they represent. Family history, national history, struggles, honoring an ancestor.  Your family could have sold the heirloom a long time ago if it was just about money, but they didn't. Too bad it ended up in the hands of a shallow, greedy person instead of someone who appreciates it's legacy.", "My sister got more because she's the oldest. Stuff from our grandmother and father. Everything she got has been pawned, lost, stolen, or destroyed. I, on the other hand, still have what I inherited. I would have taken better care of that stuff, but no! Let's leave it all to the oldest, even if they are less responsible. YTA", "[deleted]", "OMG. Massive YTA. Can't believe you did that to your family", "YTA.  A HUGE AH!.  Legally, it might be yours, but you know deep down in your money-grubbing heart that ETHICALLY, it was a totally shithouse move to sell it for the sake of a frigging wedding day.  Especially given that you did not even entertain the idea of gifting or selling or swapping it with your brother, who actually LOVED and treasured the heirloom and desperately wanted it.\n\nYou are in your late 30s. FFS, you don't need a lavish BS wedding, and you sure as shit didn't need to attain by being so outright, selfish, money-grubbing, and bloody cold-hearted.\n\nEnjoy your BS one day (as someone who has been happily and successfully married for 18 years and did it on a budget and had a fucking fabulous day),  I can tell you overspending on a single day of which you will display a sum total of maybe 4 pics and if you are super lucky will pull the album and video out once every 10 to 15years). \n\nThat heirloom you sold literally....... many lifetimes of memories.  But you AH#1 and you fiance AH#2 go make a life time of memories for as you so clearly pointed out a sum total of 2 people, because you have likely sacrificed your relationship with your brother and his family and probably a number of other family members when they find out.", "YTA.  Does the word \"heirloom\" not mean anything to you. What do you think an heirloom is?  It's got nothing to do with what's legal; this is about what's right. \n\nIf the piece is as meaningful as it seems to be to your brother, I would be furious and would probably never speak to you again.", "Wow", "Look, I understand not being overly attached to objects. And I understand that technically this is your inheritance to do what you wish with. \n\nBut your brother HAS expressed an emotional attachment to this item. More over, your father's reasoning of it being passed to the first born son means that he had intended it to stay in the family. \n\nYour choice is ultimately your own, yes. But there are consequences to your choices. And your family is not out of line to decide they don't want to come to the wedding because you have decided to make a selfish choice that you KNOW will hurt your brother, and go against the wishes of your late father. A wedding that will only serve as a reminder of that selfish choice you made. \n\nYou have to really sit down and think about HOW much this experience means to you. And if it is more important than your relationships with your family. Because you are 100% jeopardizing those relationships if you decide to sell it.\n\nYou do not get to have your cake and eat it too. \n\nYTA.", "YTA. One lavish day which, let’s face it, is more of a show for everyone else. The price you pay is losing your family.", "Yta\n\nYour wedding is the most important day of *your* lives, the heirloom is supposed to be something important (not most important, but still there) in your family's lives. Think about more than just yourselves. Your grandkids, hell your kids, won't see your wedding as the most important days of their lives, it prly won't even be in the top 50 for them, and it won't make the list for anyone else.", "So basically you are trading your family for an event. That's shallow, man.", "YTA, you owe your brother a huge apology. You arnt better than him for having been born first. It was important to him and you threw that away for money for a one day event that, I promise you, doesn’t matter to anyone but you and your fiancé. Get your priorities straight.", "YTA\n\nYou have to decide what’s more important to you. You selling the family heirloom, having no family at your wedding(the irony), potentially ruining your relationship with your brother vs. not selling it, having your family at your wedding, and your wedding is just a little less ambitious.\n\nSeems like an easy decision but to each their own.", "Yea YTA", "YTA for wanting to sell a family heirloom (that cannot be replaced and is of more than monetary value to your brother) for an event that lasts for one or two days?? It isn't as if you've earned it. You just got it because of a stupid, outdated tradition. If you sell it to pay for your wedding, be prepared to deal with the fallout in your relationship with your family. And if your marriage ends????", "YTA.  You chose your extravagant wedding over your family.  You knew your brother would be devastated, but decided it was more important to have a really fancy party. \"But it's my PROPERTY\" is either a legal argument or a child's argument.", "YTA. Obviously you didn't care for your late father. I think he spoiled you too much and failed to instill proper values.", "Yta. Both of you and selfish to the core", "YTA.  You know that heirloom means a lot to him and although it was passed down to you and you can do what you want with it, you’ll ruin the relationship you have with the remaining family that’s left. Sorry about your loss but you should definitely think this through before deciding.  \n\nThere won’t be a need to sell their heirloom if people aren’t gonna show up for the wedding", "YTA\n\nLegally and morally are not the same.\n\nJust because you can sell it doesn't mean you should.", "WOW you’re a massive asshole. Yep. I feel so sad for your brother. Do you even care about him?\n\nYTA and honestly I’d never speak to you again.", "YTA. How incredibly selfish", "Let me get this straight... You sold a centuries old family heirloom to pay for a party that will last a few hours? YTA. Massively. In fact, you're the entire colon.", "YTA if you didn't want it you should have passed it to the family member that did. Congratulations on alienating your family.", "YTA. What you should have done, if you needed the money, was to offer to sell it to your brother so that it could stay in the family. If he had declined, then you could have sold it to anyone.", "YTA \n\nYou lost your family but gained a new one with your wife so there's that.", "ESH, Everybody Sucks Here---but more you. \n\nYou don't care about or appreciate the heirloom, your brother does, and it's only in your possession because you're the elder son. Add to that, you're selling it for a frivolous reason (a 5-figure waste of money that you otherwise can't afford even though both of you are near-40, come on). Legally you're right it was yours to sell, so console yourself with that thought when none of your family celebrate with you I guess.\n\nYour brother's decision not to attend is understandable; he went into asshole territory when he started enlisting others to also boycott.", "NTA  Although it's yours, it's important to your brother.  Because it's so sentimental, I'd think twice before hurting a family member like that.  You're right, though.  At the end of the day, it's your decision. \nYour brother should never have included your uncles and cousins and put them up to not coming to the wedding.  I think the worst kind of people are ones who don't get their way, and instead of dealing with it themselves in a mature matter, they do everything can to rile others up and include other people to further their agenda.  I think your brother is a piece of you know what for that.  \nI'm really not sure where you go from here.  I wouldn't just hand it over after what he's done here to get the family on board to not attend the wedding.  That's a messed up thing to do.  I'd probably think it over, hold it for a bit, and figure out if there can be some kind of agreement eventually.  What did he get in the will?  Maybe it's something more of use to you.  Maybe he can buy you out of this heirloom so he can have it for his kids.  \nAt the end of the day, it's your decision.  Although I can't promise, I'd imagine if I got something really important to another sibling, I'd either give it to them or work something out.  But I don't ever think my siblings would have tried ruining my wedding attendance because I decided to do what I wanted with my inheritance.  Maybe upset, but there's a limit.", "NTA.  If you're not that emotionally attached to it, sell it to your brother or just give it to him.", "NTA\n\n&#x200B;\n\nOffer for your brother to buy the heirloom from you at market value.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy fiancée (38F) and I (39M) are planning to get married this summer. We both want to have quite a lavish wedding at a winery in another state. The two of us agree that it's the most important occasion in our lives, so we should make it as memorable as possible. We both have stable jobs and a good amount of savings, but it's not quite enough for the (admittedly ambitious) plans we have in our heads.\n\nMy father passed away in January, and in his will he left me a very valuable (think five figures) family heirloom. I'm not much for big family traditions, so although it's a nice thing to have, I'm not massively attached to it. I have plenty of other good memories of my father and I don't need a fancy heirloom to remember him by. My brother (34M) however is a huge history nerd, and is really really attached to it. He was very upset by my father's decision in the will (the reason it went to me and not to him is that this has been traditionally passed to first-born sons). My fiancée and I don't plan to have children, and I think he assumed therefore that he (or his children) would be in line to get it if I were to pass away.\n\nAfter some discussion, my wife and I decided that we would like to sell the heirloom to pay for our wedding. My brother, who is also my best man, was furious when he found out, and said he wanted nothing to do with the wedding anymore. He thinks my wife and I are behaving like spoiled brats. In addition, he's convinced my uncle and cousins not to come to the wedding either. With our parents having passed away, this means that virtually none of my family will attend the wedding, which I'm really upset about.\n\nI think since I legally inherited the heirloom I can do what I want with it. I think he's just upset because I ruined his expectations of one day inheriting it, but since my uncle and cousins agree with him enough that they're not coming to the wedding, I'm not so sure I'm in the right. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I'm not going to issue judgment until you answer one simple question - \n\nDo you care or love your brother?  You're welcome to not care about him, and honestly, siblings are just a bad thing to have in general, but if you can reply to me and say out loud \" I care more about money than my brother\" then I will say you are not the asshole.  If you so much as have one ounce of care for your brother, then you are the asshole.\n\nIf you fail to reply to me and instead remain silent, I will take that as confirmation that you do care about your brother and thus realize you are the ass.", "YTA, your father left it to you because he thought you would honor and cherish it. Selling it is a slap in his face and a slap in the face to anyone else in your family who would keep it in honor of your father.", "Your focus is on the wedding & not your marriage or your family. YTA.", "YTA", "You are willing to hurt your brother, disrespect your father's memory only months after his death, give up a treasured family heirloom, deplete your savings and ruin relationships for a single-day event. You're making really immature, short sighted decisions. \n\nYTA.", "OP YTA- you could have at least told your brother you were about to go to \\*extreme\\* lengths to get up the rest of the money for the wedding, perhaps him or other family could have pitched in and helped you with the money in exchange for the heirloom.", "YTA  Is this worth potentially permanently ruining your relationship with your family over this? Because it is likely your brother will never forgive you for selling something that has such great importance to him.", "\"My father passed away three months ago and I couldn't wait to get my hands on that $$$$$.\" I think you're gonna have regrets. YTA.", "YTA. Your dad gave that to you through his will, and yet you would rather sell it for a party instead of keeping something your dad valued?! Everyone is right in not going. Do the right thing and give the heirloom to your brother who actually cares about it! He deserves it more than you do!", "So let me get this straight\n\nThis thing your brother is super attached to and was insulted that your father didn't at the very least leave partly to him...you just up and sold it without asking him if he wanted to buy it first?\n\nOr making sure he was ok with you selling it so you could do damage control within your family?\n\nI am going to be honest.\n\nIf I were in your family I would skip your wedding too.  You knew how important this thing was to your brother.  But the money was all that you cared about so you never stopped for one second to have a conversation with your brother about it\n\nYou may have permanently damaged your relationship with your brother and your entire family....all so that you and you fiance can pretend to be rich for a day.\n\nCome on man...that's not have family treats famly\n\n\nYTA", "YTA, and if you don’t realize it now, you will when you’re at your very “lavish” winery wedding and have no family there with you. I hope it was worth it.", "YTA and you know it. You put so much emphasis on the fact that it’s legally yours, so you can do with it what you want, but you know you’re an asshole for it. I bet if your dad knew you were going to waste it on a dumb wedding, he would’ve passed it to your brother.", "YTA\n\nDid you even give other family members an opportunity to buy it from you?\n\nI hope your lavish destination wedding is worth what you sold...and I am definitely not talking about the painting.", "YTA. Going to repeat a lot of the sentiment of people saying yeah legally you can do whatever you want but the painting obviously meant a lot to your late father and brother with how much they’d geek out over it. Choosing to throw a lavish party and only being able to do that by selling a 5 figure painting seems to suggest your party budget might be too high.\n\nCurious question you don’t have to answer, if you didn’t have the painting would you take out a loan to pay for the party?", "Did you at least offer to sell it to your brother first?", "YTA. The heirloom might not matter to you, but it does to your brother. It’s kinda like your wedding. It doesn’t matter to him, but it would to you, if he didn’t go. Seeming as you don’t value family or the possessions that have sentimental value, they will do the same to your wedding. You don’t get to discredit someone or something and then be upset when the same is done to you.", "YTA ~ while I fully understand that it was bequeathed to you and it is therefore your property to do with as you wish, you could’ve offered to sell it your brother first knowing that it holds significant meaning for him. \n\nNot to mention, you basically just crapped on your whole family and the memory of your dad so I’m not sure why you’d be surprised that they’re all pissed at you and want nothing to do with the physical representation of your feelings toward your dads gift to you.", "YTA, I am a long time lurker on the AITA community, but I have never really posted a reply.\n\nOP, give this heirloom to your brother PLEASE. If it doesn't hold memories for you it sure as hell holds memories for your brother. If you have even a slight heart you will give it to him. Your reasonings for selling this heirloom are incredibly selfish and go is your fiancé for even agreeing for you to sell it. Quite frankly if she has no qualms about selling something like your family heirloom I hope you are able to buy her whatever she wants in the future or she might leave you. Then you'll have no family by your side.\n\nThis was a post I strongly wanted to comment on because something similar had happened, however it was my dad's guitar. He carved three hearts in it one for each my sisters and I. My sister ended up selling it when he passed away and didn't even offer it to my middle sister or I and we haven't spoken to her since. I am still trying to find that guitar to this day.\n\nPlease OP do the right thing. I'll keep you in my prayers and hope that God will guide your heart.", "YTA. You're selling a family heirloom, that you know means something to your brother, to pay for a wedding? Not surgery, not even something like a house, but a stupid *wedding?*\n\nI very much doubt that your poor father intended you to be so mercenary when he left that to you. What a shame that he didn't leave it to someone who gave a damn.", "If its purely monetary why not offer an exchange? Part of his inheritance for the heirloom.", "you are such an AH!! you should give the item to your brother and find another way to pay for your lavish party. you are such a spoiled, selfish person.   to sell something that is super important to your brother and family just so you can have a party is the stupidest thing!  NOBODY cares about your wedding at all, they are like shoot I have to go to this thing and spend money I don't have,  to eat dry chicken and bad cake.", "YTA. Legally in the clear but what you're planning is ethnically and morally reprehensible.", "YTA quit trying to have a wine wedding on a beer budget...", "Technically, legally: NTA\n\nChoosing this as the reason to (maybe permanently) damage your relationship with your brother: absolute AH.", "YTA. Your wedding is just a day but family, and the memories you’ll have together and the relationships you’ve cultivated are forever. You’ll one day regret giving up this treasured heirloom that meant so much to your beloved father and brother, both of whom will be out of your life forever at that point, for a single party that will only be a chaotic whirlwind and goes by in a flash. This is so foolish I can’t even begin to explain or comprehend.", "People like you are the reason the world is the way it is today. Only caring about yourself and doing whatever you can to make a quick buck and damning the rest. Yes, without question and hesitation yta, and I'm very well aware of how your poor brother feels cuz this has happened to me on multiple occasions. I've watched childhood homes on both sides of the family sold off just for money and petty jealousy, vehicles gone, rings watches and wallets gone, I've had both my paternal grandparents, my uncle and both my maternal great grandparents pass away and I have nothing to remember them by because of the rest of the family either hording or Hocking everything and leaving my mother and I nothing. And I'll happily say it again yt major A", "Being legally able to do what you want with something doesn't magically not make you and your wife assholes. This isn't Am I Legally Allowed to Do This. Congrats on alienating your entire family and disrespecting your father. Hope it was worth it.", "I think you are perfectly within your right to want and have a lavish wedding. But I think selling this heirloom is a shitty thing to do. If you have savings, dip into that. You can always replace money, you can NEVER replace a family heirloom. Since you aren’t having any kids, you’ll be able to recover the money spent on the wedding pretty quickly and it’s not like you have to save up for college. Go ahead, have the blow out wedding, but don’t devaste your family in the process. Soft YTA.\n\nEdit: misread this entirely. You already sold the heirloom. Jesus christ you’re a selfish AH.", "YTA", "Yta and very selfish op. Your too entitled to see that yourself.", "YTA. Can't really think of anything else that needs to be said.", "YTA", "INFO: in your father's will, was your brother compensated equally given that he did not receive the valuable heirloom or did you both otherwise split the estate evenly and you *also* got the heirloom on top of your share? \n\nEither way, choosing a party you can't afford over the relationship with your family is pretty sad and shortsighted.  It says a lot about who you are and what you value, which I hope you would think over a bit before making a decision. The heirloom belongs to you to do with as you please, but the consequences of your decision are irreversible.", "If you sold it to pay for a life-saving medical procedure, you wouldn’t be the asshole. But you sold it to pay for a one-day party that’s supposed to be a family celebration. And guess what- now you don’t have a family to celebrate with.\n\nThis is the stupidest, most self-centered version of Gift of the Magi I have ever heard. YTA. Enjoy your big day.", "YTA - you’re putting your wedding above your family so why should they prioritize you?\n\nThis is an incredibly selfish think to do knowing the meaning, but legally you can do whatever you want with your property.\n\nBut everything has a cost, finically or otherwise, and you should decided if losing your family is a cost you’re willing to incur.", "YTA. It's yours, you can sell it if you want. That's your right.  It's your family's right to disagree with you selling the item and to decide not to come to your wedding.  See how that works?  You can't have it both ways.  If you get to feel how you feel and take action accordingly, so does everyone else.", "YTA\n\nIf you insist on this, could you figure out *exactly * how much difference you need from your savings to have your dream wedding and offer it to your brother for that price? Still shitty but if you're going to sell it either way at least offer it to him first for the least amount you need", "I don’t understand how one day is worth a family heirloom, let alone an expensive heirloom that sounds like will be *very* difficult to get back. It’s selfish to value a special day over something that’s been passed down generation to generation. \n\nYTA. It was legally yours, but your family and brother are rightfully upset at you for it. I’m sure your father wouldn’t have given it to you if he knew you’d get rid of the heirloom. You should’ve *asked your brother and family first* BEFORE you went ahead and sold it. I’m sure they would’ve helped to pitch in for the wedding if they found out if you planned on selling it too!\n\nWhat’s done is done, and it seems like the relationship with your brother has permanently been damaged. You valued money and a wedding over a precious family heirloom, which is a very personal and sensitive thing for people and families.", "YTA. A family heirloom doesn’t belong to you. You’re just taking care of it for the time being. Ethically you have no right to sell it, even though the law doesn’t care if you do. It’s part of your family history and YTA for treating that like it’s nothing.", "Oh that’s just sad. It survived in your family for centuries and within a few months of being in your care it was sold for a wedding? \n\nI think the only acceptable end to that tradition is if the family on your dad’s side decided it was time to end and the proceeds divided among them. Then you could’ve spent your part on your wedding. But when there is still so much love for the piece and the tradition, to make a unilateral decision on its possession is unbelievably selfish. \n\nYTA and my heart breaks for your brother.", "My understanding of a ' Family Heirloom ' is that who it is given too is the current care taker for safe keeping not for sale to line your pocket. It wasn't willed to you for sale purposes. The onus is on you to inform your father before he passed so he could make an informed decision if you or your brother should have it. You failed your dad and family just taking it knowing you wouldn't have children.\n\nI suspect that your fiance is so out of this world that you're thinking with the wrong head OR you are just such an intitled sh**, you never thought through the consequences. I suspect the latter. Definitely TA", "YTA \n\nI hope you're happy that your selfishness and greediness costed you all your family just because of one day that you can't afford.", "Of all the reasons in the world to sell something so valuable both financially and emotionally you chose a wedding.  You and the wife to be are AHs. \n\nI would never let a partner sell something so significant to their family. It's like you wanted to go off a cliff and she cleared and greased the path for you. \n\nYTA", "YTA- you may legally be able to sell it but that doesn’t make you not an AH for doing it. You know your brother cares about this item and likely other members of your family as well since they’re also not coming to the wedding over this. If you want to repair the relationship with your family do not sell this item, pass it on to someone in the family who will respect and treasure it and come up with a new way to pay for your wedding.", "The thing about family heirlooms is that you don't so much own it, as you caretake it for the next generation.  Yes, YTA.  enjoy the wedding with no one there.", "I didn't need to hear the story to understand YTA. who does that? you are very self centered and selfish", "YTA. Your father made a mistake leaving the painting to you. Enjoy your lavish wedding that nobody will attend.", "I would say YTA unless you gave your brother the option of buying it from you at a very generous discount or trading it with him. You need to give the relatives a chance to claim it. Hey, maybe bow you won't need to sell it tho cause your destination wedding party just got a whole lot smaller", "Why do the other memories of your father mean enough that you don't need the heirloom to remember him by, but the memories you will make with your wife your whole relationship don't mean enough that you won't need a destination wedding that you can't afford? \n\nGive the heirloom to your brother with no charge. YTA.", "Yta- your dad made a poor choice in who he left something sentimental with. I would be so embarrassed my greed was showing like this. Yes you can do what you want with it and in doing so you will lose family member. it’s okay bc like you said you aren’t one for family traditions . So having less family won’t be a big deal.", "I mean, it’s yours to do with as you wish, but I think it’s crappy especially when it means so much to your brother, I can’t imagine doing that to my sibling. And weddings can be such an big waste of $, if it was for a house I may feel differently. YTA", "Gotta agree with you. Placing the party over your relationship is a really bad move.", "YTA\n\nOP clearly has the mindset that as long as he has a legal right whatever he does is also ethically right and he should face no consequences for it.\n\nThis is an item that meant a lot to everyone in the family except for him, yet through sheer coincidence it ended up in his hands. \n\nThe right thing to do would have been give it to his brother, brother’s kids, or leave it to one of them when he passes.\n\nShittier but still okay thing would have been to give his brother the option to purchase it or exchange it for something else he was left.\n\nOP chose the most selfish possible option, get rid of an important family heirloom for personal gain. The consequences of that is he loses the family he still had before that decision.\n\nEdit: Throwing in one more thing. OP sold the painting to pay for an extravagant day for himself and his fiancé, because he wanted it to be memorable. Now his wedding will always be the associated with his selfishness breaking up his family. Hope he is proud of himself.", "Agreed. If you can’t afford a lavish wedding without doing that at this age then maybe reevaluate…. \n\nYTA… and maybe fiancé is too… sorry", "I know. My first thought was, \"these young people have no idea what really matters -- the idea that a wedding will be the most important day in their lives kinda made me laugh.  Then I looked at the ages. Yikes.", "Came here to write this too! Op is the YTA -once you sell a family heirloom, it's gone forever.", "I was gonna say... if you're months away from being 40, if your dad dying is the only way to afford a more expensive wedding then fucking A... dude, YTA.", "Well now that most of his family isn't coming he may be able to afford it.", "OP- did you dad have any idea you would sell it if he left the item to you? As my mom would say, he’d be turning in his grave- YTA and very shortsighted.", "Because then he couldn't have a big party with the money he got from flogging it, duh. Hrs a massive AH, the fact he thinks his brother only cares because he thinks he'll get it for himself later tells you everything about how he views family tbh", "More than likely, his marriage won’t work. Look at the decision making.", "Right? He didn’t own it as much as he was made responsible for it due to his position in the family.", "The museum at Plimoth Plantation? I’m a huge history nerd who grew up in MA, that’s so cool!", "One day. To make a commitment that only has a 50/50 shot at lasting a lifetime.", "I thought so, too.  YTA", "They already sold it.", "Gifted, period. This is an heirloom, not a commodity.", "Thank you you said it perfectly he was a caretaker.", "I'm honestly not sure. He and my brother used to geek out over it together a lot, so I could see him being upset. I think he was pretty torn that tradition dictated the heirloom go to me and not my brother. But he was also a very understanding man so I could see him being okay with it.", "It's a very old painting by a lesser-known artist. I don't want to post too many identifying details.", "I think the brother only ends up in asshole territory if he embellished the story. If his phone call was something along the lines of: \"Hey Kevin sold the painting to pay for his wedding, I'm not going anymore.\" Then I don't see an issue with that.", "OP ruined the wedding attendance by selling the painting to pay for the wedding. If my sibling sold a family heirloom to pay for a party at a winery I’m not going to that party. I don’t know why OP expected them to be ok with this.", "Well, he can’t cause he sold it already with no consideration for anyone else.", "I hate to be \"that person\" but I think autocorrect screwed you.  I am certain that you meant \"selfishness\" not \"selflessness\"....and I agree wholeheartedly", "I've noticed over the years, the more expensive the wedding=the shorter the marriage.\n\nMight want to start saving for a divorce lawyer OP.\n\nOh and YTA. Massively. Good luck repairing the bridge you just bombed with your family.", "Look how he views family.", "Really? You're giving those odds on this arsehole's marriage lasting? I could maybe see that on if it lasted a year because there's no way someone this far up their own arse is going to manage it for even a decade.", "At the very least the money should have been used to the benefit of the entire family. A painting can only hang on one wall so one person has to be in charge of it, but that doesn’t mean it’s automatically OPs to do whatever they wish with it. The more I read the more upset I feel for the rest of the family.", "So he didn't even really want you to have it. Wow. You're a huge AH, OP.", "You're honestly not sure? It seems pretty clear he would not have liked your decision if he wanted to give it to your brother (the one that actually respected it) but didn't due to tradition.", "You’re a jackass", "I was leaning towards YTA until I read this. Fell straight down on that side of the fence. YTA.", "Yeah, you're an Asshole. Your Dad would Not be okay with it and he would probably be very disappointed in you.", "YTA and honestly not including that detail in the original story is a bit misleading. It implies that your dad would have been fine with it", "he'd be disappointed. YTA", "I think the last sentence is you lying to yourself. So you just have to accept that your family won't be attending.", "I do hope that your wife's family likes you because your OG family is well justified to wash their hands of a feckless son like you.", "At least you can save more money with your family never speaking to you again", "YTA - you haven’t even given your brother first dibs. You and your future wife are only thinking materially, ignoring the sentimental.\n\nUnless you can stop the sale, you have essentially destroyed your family relationships.", "I think your vision may be a bit cloudy. This is the same vision that led you to sacrifice your relationship with your brother, and possibly your uncle and cousins, in exchange for your “dream wedding”.\n\nYTA", "You know you're the asshole and you came here hoping someone would defend you.  All of this for one day nobody else will care about but you.  For your own ego.  Jesus.", "YTA \n\nAccording to one of your comments your dad was torn because he couldn’t leave it to your brother. That statement alone shows your dad would rather your brother have it because he knew he’d appreciate it. If I were your brother I would be upset too and would definitely not go to your wedding. Since it is a family heirloom I also don’t think your brother is in AH territory for informing the rest of your family. You and your fiancée have the right to whatever kind of wedding you want just like your family has the right to not attend. You chose a fancy wedding over your family. Are you really surprised he reacted this way? You and your fiancée are very selfish. Good luck with your wedding.", "You are the absolute worst. Your father would not have been okay with it, no father would be okay with selling a family heirloom just so you can have a big party that no one but you and your wife will ever talk about, or think about again once it's over.", "Bullshit. There is no way that a man that honor tradition and geeked over the painting would be okay with your selling it so you can have a party.  If I were your brother I would never speak to you again.", "You didn’t sell the family heirloom. You sold your relationship with your brother and the remainder of your family.\n\nIf you have to do that much damage to pay for a party you can’t afford the party.\n\nBut your (and your fiancée) complete disregard for the feelings of others does seem super promising for your future. You will treat each other with the same callous indifference to each others emotional well being as you have your brother, and your Uncles and Cousins.", "Oh wow, this makes you an AH on a level that I can not begin to express for fear of being banned.  You KNEW your Father wanted your brother to have it.  They fuckinng bonded over it and you, rather than doing the right thing and pass it on to him, sold it, pocketed the cash to selfishly use on a wedding that NONE of your family is going to attend because you are so selfish.\n\nFarrrrkkkk.  I can not even begin to fathom how you did this.  What you have done is despicable.", "Yeah, because you can totally hear your dad say \"I know my younger son loves and appreciates this item, but I am choosing to be bound by tradition. I'm completely okay with my older son throwing it away from the family because screw tradition. Screw who appreciates it. Older son wants to party!!!!!\" mmmmhmmm, keep justifying yourself to yourself.", "Damn dude, sounds like you know it’s the wrong thing but you plan to do it anyway, and were hoping some strangers would back you up. YTA", "> so I could see him being okay with it.\n\nYou can lie to us about it, if it helps. But you know that isn't true.", "Come on, at least be honest to yourself. Take a moment, think about it, and give yourself an honest answer to this question.", "Did you offer your brother to buy it? And was your brother given anything in the will?", "Just get a zero interest credit card. You will be able to pay the balance off over 14-18 months interest free. Many will give you checks. Write yourselves a check and that becomes the card balance. Now pay it off over x months. Your bro and father geeked out over it. It’s a piece of your father. Having it is part of grieving and getting through his loss. The same as it was for your father when he inherited it.", "So wait, you didn’t even want it and could’ve just given it your brother and you kept it anyways?", "holy selfishness batman,   your dad wouldn't want you to destroy your relationships  with every member of your family over a stupid wedding.", "You're a HUGE asshole. If you can't afford a wedding without selling a FAMILY HEIRLOOM AND DRAINING ALL OF YOUR SAVINGS, YOU CANT AFFORD A WEDDING THAT EXPENSIVE.", "Jeez, OP, your family can never get that back. You really screwed everyone with your selfishness.", "YTA.  Really inconsiderate and narcissistic thing for you to do.", "Wow!!! Well, enjoy your wedding and I really hope it lasts forever cause, if it doesn’t you sold off a family heirloom and probably lost your family for nothing.", "I’m torn. On one hand, it is just a “thing” and I usually value experiences over things. On the other it’s really important to your brother and the rest of the family. Is the family in the position to buy it from you? I ask that knowing that even though my sister and I don’t always get along, I would probably just give it to her cuz I love her. So, YTA.", "Why didn’t you sell/trade the heirloom to your brother?", "Agree, but I took OP at his word with phrase \"he's **convinced**\" others---meaning, there was more than just a mention from the brother.", "I gave it 50/50 because I figure the bride to be must be a kindred spirit if she’s willing to go along with such a gross idea. \n\nBecause you know, “IT’S HER DAY!” The long honored battle cry of many a Bridezilla.", "I think the point is that this is a treasured item with generations of tradition behind it. Better to preserve it rather than sell it and give each family member some money.", "Oh it’s sold?", "Especially when you consider due to family tradition it went to his father because he was the eldest. I am willing to bet the uncle and cousins would have wanted it as well.", "That's fair, I might be reading to little into it. I feel like since OP doesn't care about this heirloom, he doesn't understand how the rest of the family could either. If he's the black sheep in this (and it kinda sounds like he is), it wouldn't have taken any \"convincing\" to persuade them, just the story.", "Of course. Just saying that the value of the item belonged to the family not OP.", "Didn’t think about that but yup, you’re right. OP sucks.", "Not true. OP can do what he wants. If he’s going to sell it, then he gets to keep the money. It would make him an AH; but legally, it belongs to him.", "It’s ironic how often weddings tear families apart. YTA and you already know it.", "Couples who have a modest wedding with the focus on the honeymoon tend to outlast the ones who do vice-versa.  That's backed by statistics, and I can also relate this anecdotally. This not only sounds like a massive waste of money, but to waste money by selling a family heirloom is just stupid. Your family is right, as well as the inconvenience and selfishness of expecting people to take time off and spend exorbitant amounts of money to even attend this thing, you're ruining your relationship with your family.\n\nVerdict: You definitely are the arsehole and selfish to boot.", "YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA  \n\nyou're so materialistic you'd rather sell a living part of father to pay for some extra decor or drinks your stupid wedding when you're already well off \n\nyou can earn back the money needed to pay for your wedding YOU CAN'T EARN BACK THE HEIRLOOM\n\n i'm furious for your brother", "Legally you’re in the clear but this isn’t r/legaladvice. YTA for destroying your relationship with your family because you wanted a fancy wedding.", "Gift the item to your brother and elope.  Problems solved.  YTA", "It’s just a wedding. It’s not the most important day of your lives.  And it certainly isn’t the most important day of your brother’s life or your extended family’s life. \n\nYou’re so caught up in having an ostentatious wedding that you can’t afford that you refuse to see the damage you’re doing to your relationships.  YTA.", "YTA you should be ashamed of yourself", "YTA! You're going to sell something extremely important to your family for one party?? How selfish can you be? I wouldn't go to your wedding either", "Is your destination wedding more important than your family?  If so, keep doing what you’re doing. \n\nYeah, YTA.", "YTA. \nThe verdict is pretty clear, but I just want to chime in anyway. Cause wow.\n\nYour dad passed in January! That’s barely 3 months ago? You made a completely irrational selfish decision on basically a whim and destroyed your relationship with your family for it. \n\nNow your big extravagant wedding day won’t even be remembered for the right reasons. Wild", "INFO: Are you willing to loose your family over this? Because if you sell it you are very likely going to loose your brother forever. If you sell the painting but expect to keep your brother in your life, then yes YTA since you care more about a wedding than your brother.", "YTA - perfect example of technically allowed but definitely asshole move. Genuinely no shame for having a big blowout wedding if that’s something you really want. Despite how this sub sometimes acts, it’s okay to not get married in the cheapest possible way in the name of practicality. Mega shame for considering that party truly more important than your dad’s wishes, your entire relationship with your brother, and what sounds like the relationship with and respect of your uncle and cousins. Your brother and uncle both actually want this item, whether for the actual or emotional value, and both screwed out of it by the coincidence of birth order. It means so little to you that you’d sell it a couple months after you got it. \n\nHow were you planning to pay for this lavish wedding if your dad hadn’t died? If there wasn’t a way to do that in the first place, then it was doubly insensitive to your brother and other family to treat your dad’s passing as the ticket to a fancy party.", "NTA-\nYou inherited it. If your brother wants it so badly, he can buy it from you.", "NTA\n\nIt was your heirloom, not his", "NTA. If it's that important tell your brother he can buy it off you for the same price. Problem solved.", "ESH - Fine wanting to sell it because once it's yours and legal you can do whatever you want.  But you could have told your brother and given first dibs on buying.", "If an expensive party is more important than your relationship with your family, sure sell it. Did you think, at any point, to sell it to your brother? You might not get as much as you would selling to a complete stranger, but again you only need the money for a party.", "Since most of your family won't come, you should be able to afford it. And sure enough if the family/friend of the fiancée is aware of that, many will pass..so you could afford an expensive wedding without selling your father gift. Or, you could just be nice and have a little less expensive wedding and give the heirloom to your brother and apologize.", "YTA. You are having a big expensive wedding and the only thing your family will remember is that you sold a precious heirloom entrusted to you by your father.  Wow….very shortsighted of you.  I wonder what you will think about this decision in 20 years.", "YTA.\n\nAs the owner of that object you can do with it what you want so selling it was entirely within your remit. \n\nWere there other paths you could have gone down? Yes, you could have informed your family that you got the item valued and you wanted to sell it to fund your wedding. You could have given other family members the opportunity to find the funding to buy the item off you. \n\nYour reputation is priceless and your family won't forget this. \n\nSadly, you've also ruined your wife's reputation if you remain silent. If you want to give her a chance at being accepted by your family, you should make it clear that it was entirely your decision and she insisted you not sell it but you still went ahead and did so. You need to take 100% of the blame for this. \n\nIf you tell anyone in the family it was a joint decision or she didn't bother stopping you, they will all view your wife as someone who has no respect for tradition, doesn't share the same values and doesn't fit into the family. She will forever be an outsider and receive the cold shoulder. \n\nThe fact your father has been gone less than 6 months, in a way you tarnished his memory. The whole family would've known he inherited the heirloom and they would've been interested to see who he entrusted to keep the item, someone reliable who could keep it safe and protect it. \n\nYou painted your father as someone who made bad choices by giving the heirloom to you. You might not realise this is how it looks but damn, this is real bad.", "YTA.", "YTA.\n\nIf you were in dire straits and needed the cash to physically live, this *might* be different.\n\nBut to pay for a wedding that you simply can't afford?\n\nDefinitely YTA.\n\nGive the heirloom to your brother for gods sake, he clearly values it more than you. That's the right thing to do.\n\nYou're being selfish because you want an Instagram wedding that a few week's after, no one will care about.", "YTA and soon you’ll learn that weddings aren’t that big of a deal. (The relationship is the important part)", "YTA. Selling a family heirloom to fund a party is an insult to the father who left it to you. Dishonor! Dishonor on you, dishonor on your wedding.", "Legally you can do what you want, but YTA", "Wow, so you got the precious heirloom and don’t treasure it? That is so sad. YTA. If you didn’t care about it, you should have given it to your brother who does care about it. \n\nAnd if you can’t afford a “lavish wedding” at your age, you shouldn’t be having it.", "YTA. If your wedding will be the most important occasion in your life you sure aren't setting the bar very high. Selling an heirloom for a wedding is very fivolous and short sighted.", "You can, of course, do what you will with your own property, but YTA for expecting your family to not have any feelings about it. You did act like an entitled selfish brat, you didn't think through the impact this would have on your relationships with your family, you are now paying for that in spades. Enjoy your super expensive, pointlessly expensive wedding. Without your family. 👍", "Omg, I would seriously consider never talking to you again if I was your brother! Don't care how much it's your right to do with as you want. Apparently the concept of family has no value to you. \nHave great one day event! Hope it's worth it! \nYTA big time!!!!", "YTA, Dick move Bro.", "Im not even gonna read this and vote YTA", "> I think since I legally inherited the heirloom I can do what I want with it.\n\nLegally correct, morally an asshole, yes. \n\nYTA\n\nJust to point out, the chances of you having another wedding are infinitely higher than acquiring another family heirloom that’s been passed down for generations. \n\nYou’re giving up something truly unique for something that people do every day. \n\nCan’t say that speaks much for your taste.", "You sound like a 21 year old bridezilla. Wedding is a wedding and is also a landmark in your life. A wedding party is just that - a party.\nYTA", "YTA. People on this subreddit usually lose sight of legal versus moral. You’re legally entitled to sell it, no question. But doing so is a huge disrespect to your father, brother, living family, and deceased family. The fact that you’re doing it all for what boils down to a glorified party just makes you a selfish AH. It was never given to you with a mind to it’s financial value, so if that’s all you see it for give it to your brother.", "YTA but you could perhaps offer your brother to buy it from you with part of his inheritance", "INFO did your father leave anything of similar value to your brother? Can your trade items and sell that instead?\n\nUnless this heirloom was being sold to pay for your guests accommodation and transportation, most of your family was probably looking for any excuse not to spend a ton of money and time on your \"lavish\" wedding and you've thankfully given them an out.", "Yes, YTA. Who cares if it's legally yours or not? It doesn't mean anything to you, but it does to your brother. So you're going to sell it to pay for basically a big party...while yeah, you'll have cute pictures and nice memories, it's just one day. And you're going to ruin your relationship with your brother and other family members over it.", "YTA, the fact that you think he had to convince your family shows how spoiled and entitled you are. The conversation probably went like this\n\nBrother: Did you hear that OP is selling precious family heirloom so he can afford his lavish wedding\n\nFamily: WTF are you serious!? Please tell me that's a bad joke.", "YTA - YOU decided that the wedding was more important than family tradition. It is sad *you* didn't realize that it might extend to other family traditions (like the tradition of family attending). If you want to fix things with the family, you have to admit you made a very selfish decision.", "YTA. The only compromise is to sell it to your brother at a price he can afford.", "YTA, if you can't afford to have the wedding you want, scale back. Stop living outside of your means and FFS, don't sell a valuable heirloom to finance a *day*.", "YTA You've told your brother exactly how much you value him and the rest of your family. A big party is worth more to you than your brother or his memories of your father. If you go through with this, you will lose your brother. Offer to sell it to him with a payment plan or something if you really value money over family. But know that no matter what you do, you've done real damage to your family", "YTA\n\n> I think since I legally inherited the heirloom I can do what I want with it.\n\nLegally, sure. But lots of legal actions result in you being an AH. You chose selfishness over something important to your family and ironically are upset at your... family?", "YTA.  If you don't care about it, just because it's \"legally yours\" doesn't mean you should just hock it for your overly lavish and \"ambitious\" wedding, it should be with someone in the family who appreciates it.  Are you willing to throw away family relationships over your fancy wedding, which, yes is one of the most important days of your life, but it's just one day.", "YTA\n\n \"I'm honestly not sure. He and my brother used to  geek out over it together a lot, so I could see him being upset. I think he was pretty torn that tradition dictated the heirloom go to me and not my brother. But he was also a very understanding man so I could see him being okay with it.\"\n\nYou know exactly how your father would feel about this, don't lie to yourself and the internet. Your dad valued and cared about tradition so much that he left this to you over your brother would would want it more. Tradition mattered to him, he would be appalled at your willingness to disregard this Tradition and family legacy. \n\nit's hurtful and disrespectful to everyone in your paternal family. Grow up, at your big age you should pat for your wedding on your own, not hock a family heirloom to pay for a freaking party. Yea your dad wouldn't understand this and had he known he probably would've left it to your brother instead.\n\nIf I was your brother I'd go NC, not because of the pettiness of an item, its not about the heirloom, it's about how little you valued your dad's wishes, and the family legacy. and how easily you put your want for a big parry over something he truly valued.", "Info: why you can’t pay for your wedding out of savings? \n\nIf you don’t have savings by almost 40, that’s a giant red flag.", "YTA you and your fiance are incredibly selfish\n\nYour family not being there is the real cost of you selling that ring, your just gonna love looking at your beautifully lavish wedding photos that won't have your family in them", "YTA and you know it.  Sell it, have your “perfect” day, and most likely your family has zero to do with from now on.  You don’t need them anyway with a perfect paid for wedding and an equally selfish new wife!  Hopefully you make the cut and you don’t waste all that money, lose your family and end up in divorce anyway.  What perfect karma that would be.", "YTA and will it be worth it if you get divorced?", "YTA: legally yes you can probably sell it. Morally you are an overwhelming AH. There is no chance if I inherited something that was so obviously important to my sibling, I’d keep if I didn’t care about it. They are my siblings and that relationship I care for and about them far more some destination wedding. And yes, he or his children SHOULD inherit it if you don’t have kids. That’s what happens with family heirlooms, until the AH in the family gets it. Talk about betraying your dads trust.. and your families. Get over yourself.", "YTA.\n\nA selfish, self-centered, self-righteous asshole who doesn’t care about anyone but himself.\n\n“The most important occasion in our lives”?\n\nSo the entire rest of your life is going to be a disappointment.\n\nWay to start off on the right foot there, champ.", "YTA  enjoy your fancy wedding without your family", "YTA \n\nI'd disown you if I were your sibling. \n\nYou sold the heirloom, *and* the trust and history of your family, all for a meaningless event that *nobody* will care about in time.", "Legally, of course it is yours to do with as you wish. Morally, YTA. Hope losing your family is worth it. I hope your father haunts you.", "Legally, do what you want. Im sure there are comments defending you because sometimes this sub mistakes legality for morality.\n\nBut yes, it is a huge asshole move to sell a family heirloom without consulting other people in the family who could want it. YTA\n\nSelling the heirloom is probably not what your father would have wanted you to do.\n\nLearn to live with yourself and your choices but without your brother.", "YTA picture this: you sell the item, you spend all the money on the first few days of your marriage. But the weather is shit and some drunk guest proposes at your reception, stealing all the attention, and because you thrive on attention, the event is ruined.\n\nNow you have no family, no money, no heirloom and tarnished memories.", "YTA. And so is your fiancée.\n\nEven if legally yours, a good practice with any inherited things are to have the \"right of first refusal\". That means if you have something you want to sell or give away that you inherited, your brother (and any other relevant relatives) should have the right to inherit it or buy it first before you go outside the family. And similarly if your brother inherited something that he no longer wants/needs, you should have first dibs before it can be given or sold elsewhere.", "Yta- If you can’t afford a lavish wedding then you can’t afford a lavish wedding .\n\nIs looking like a big shot infront all of your guests worth  burning bridges with what’s left of your family ?", "If the item isn't so important to you, let your brother have it since it obviously means a lot to him. Find other ways to pay for the wedding, and spend at a level you can actually afford. YTA big time.", "YTA.  And a short sighted one at that.  Maybe family and tradition don't mean anything to you, but apparently it does to the rest of the family.  And you're going to destroy a family tradition and alienate yourself from your family so you can live it up ONE DAY at a fucking winery?", "YTA and you have to know that. What's more important, your relationship with your entire family, or one day of your life? Your priorities are not right.", "Yes, you are the asshole... WOW!!! I would stop talking to you too if I was in your family... \n\nYou had every right to do what you did, still makes you an asshole and here is the consequences of your actions, your family wants nothing to do with you... \n\nBut enjoy the party I guess.....", "You sold it or you are thinking of selling it? \n\nIf it's not sold - don't. YTA if you do. \n\nIf it means so little to you but so much to your brother, sell it to him. Charge him market price, if you must. But let him pay you back over as long a time as needed. \n\nSelling family heirlooms for profit is not a good way to start your family life. \n\nAnd that is the point of a wedding, isn't it? To celebrate your union of becoming the family you choose. A family which, ideally, should add to the richness of your family of birth rather than isolate you from it.", "YTA and I hope losing your entire remaining family is worth it for you. Your brother and the rest of your family are 100% right to cut you and your wedding out.", "YTA. So hard. And you had better accept that, if you choose to go through with selling something so precious to your family history, that you will absolutely ruin your relationship with your brother and possibly other family members. All for a massive party for a single day. To celebrate a relationship that may or may not last.\n\nIf you were my brother and you sold the heirloom, I’d never forgive you.", "YTA - I was already leaning that way and your comment about recognizing your father would be upset about it solidifies it for me. Just say you don’t value the relationship you have with your brother or respect your father. By your own omission it sounds like you only every cared about it for whatever money you could get for it, regardless of what you would use it for. \n\nMy mom recently died and I de facto inherited her jewelry as the only daughter. My brothers and I already agreed that if I wanted to sell any of it, we would have a family discussion about it first. My SIL used my mom’s wedding ring at their ceremony and my brother and I have discussed me giving it to her. I would NEVER have just told him no and sold it.", "YTA because you knew it would upset your brother to sell it. Of course he's going to be mad. You knew it was important to him, but you valued having a destination wedding over his feelings. Destination weddings are already pretty selfish affairs imo, but your priorities are what they are. How are you surprised that he would drop out of the wedding over this? You did something you knew would hurt him.", "1000000% YTA selling a ***family*** heirloom just so ***you*** can do a destination wedding automatically makes you the asshole. If you couldn't afford it nor even actually planning for it and saving up for it just words can't really describe it.", "YTA and your brother is absolutely right.", "YTA and, quite frankly, I'm surprised to see the zoomer mindset in people my age.  Pro-tip, bro, your odds of getting divorced from this lady are rather high in this day and age.  Especially if you are cohabitating before marriage.  Your expensive party is going to be a sour reminder of your poor choices in life.", "YTA. \nYou got your values all wrong, good luck marrying someone like you.", "YTA. I will any day sacrifice a lavish wedding for a family heirloom. Sadly I didn’t get any. Ironically, those who treasure it most never get to have it.", "Lmao good luck", "Yta. If it’s so expensive, it means it was in the family for multiple generations. Like, maybe 300 years ? It’s a lot of time you know. It’s a valid excuse to cut ties with you. Your father wouldn’t like that either.", "YTA literally no one cares about your wedding more than you do. So not going to them is easy. People care WAYY more about family history. You don't even have to be a history nerd to think that something passed down through generations is cool and want to keep in the family.\n\nYou ARE selfish.", "YTA-trading something deeply meaningful & irreplaceable for an ephemeral event…. YTa", "Yta holy shit dude what a trashy move.", "YTA you are within your rights to sell it. But it is no doubt a very morally questionable thing to do. Do you really believe your father would have left you it in the will if he thought you would sell it straight away, or would he have left it to your brother to carry on the family tradition? If it were to be sold would he have split the money fairly? Hmmm", "There’s legal rightness and moral rightness and they don’t always align. Were you within your legal rights to do it? Sure. Is your family allowed to be so upset they never speak to you again? Also sure. At the very least you should’ve consulted them and given them the opportunity to buy it from you first. \n\nYTA.", "Did you already sell it?", "YTA\n\nYou already made it clear how little family matters to you by selling the heirloom, so why do you care they aren't attending? \n\nAt the least, you should have sold it to your family. I hope 1 day of your life is worth decades of strained relations with your family.", "The main bullshittery aside, why should they be concerned if you're upset when you're not concerned that they're upset? Was it really worth it to destroy your relationship with your entire family just to have a lavish wedding?", "YTA", "YT (very selfish) A.\n\nThere's a lot I could say but other comments have really said it all. I really hope this is as made up/bait post and that this isn't a real thing.\n\nIn possibly the only terms your shallow ass might understand what are you going to say when guests at your soulless \"lavish\" wedding ask \"where are your family\"? Hope that doesn't ruin your big day...\n\nHell I can barely stand my brother but there's no way I'd do anything like this if I was in your situation.", "YTA", "Look—\n\nFamily heirlooms aren’t “yours”, they’re the family’s. You’re merely the possessor of that item for a brief moment, then it passes to the next family member.\n\nWhen an heirloom ring is given as an engagement ring, almost universally that ring returns to the family of origin upon dissolution of engagement/marriage. Because that ring was more than an engagement token, it was a historical family piece.\n\nFurther, you’re pretty narcissistic if you think the sole purpose of the heirloom is for you to “remember your father” and since you “don’t need it to remember your father” it’s OK to sell it. Again, it’s for the family as a whole, and doesn’t just come from your father.\n\nI hope you get your head on straight.\n\nYTA", "YTA - Selling a family heirloom that holds sentimental value to your family members so you can fund your own ostentatious wedding is such a selfish move. Generally, weddings are suppose to be a day where friends and family gather to celebrate a couples commitment to one another. Your actions have caused your family to refuse to attend your celebration. You need to consider the importance of these familial relationships to you, because selling the heirloom will likely damage them permanently.", "YTA.\n\nYou're the worst. There are more important things than money, and your wedding location isn't one of them. Your relationship with your brother is. \n\n>He thinks my wife-to-be and I are behaving like spoiled brats.\n\nHe's right, you are.\n\n>In addition, he's convinced my uncle and cousins not to come to the wedding either.\n\nGood, it's their family heirloom, too. \n\n>this means that virtually none of my family will attend the wedding, which I'm really upset about.\n\nYou don't seem to give a fuck about the heirloom, why would you give a fuck about the family?\n\n>I think since I legally inherited the heirloom I can do what I want with it.\n\nYou can do what you want with it, but what you've chosen has consequences. You can still sell it. Nobody is stopping you.\n\n>I'm not so sure I'm in the right\n\nCan and should are not the same. You're in the wrong.", "YTA - while you can sell it I don’t blame your brother for being upset. Actions have consequences and you can’t control how your brother feels. Those are his feelings and are valid.", "YTA.\n\n> We both have stable jobs and a good amount of savings, but it's not quite enough for the (admittedly ambitious) plans we have in our heads.\n\nThen either lower your plans, or push them off long enough to save up for them.", "YTA\n\nSelling the heirloom is in really poor taste. That is a significant momento of not just your father but of your family history, that's why it's an heirloom... If you don't want to cherish it, give it to the family member you know would, not sell it. Your father didn't give it to you to sell, he gave it to you to continue the tradition, you not stewarding the heirloom he gave you is a slap in the face.", "YTA\n\nAs well as your brother having emotional ties to this heirloom, if your uncle is from the paternal side, he will have too.", "YTA", "YTA!", "What’s worse than being the AH? Whatever it is that’s what you are. As the sibling that didn’t get anything when their dad passed I know where you’re brother is coming from. YTA. You’re a dick.\n\nAlso, if your wedding is the biggest “occasion” in your life you’ve fucked up a lot.", "You could have at least asked your brother if he wanted to purchase it. \nYTA.", "Info: Did you sell it already?", "You can absolutely do whatever you want with your FAMILY heirloom, and your FAMILY is absolutely allowed to treat you and your FAMILY event with equal dismissiveness.  \n\nDon’t expect the perks of FAMILY love, support, and commitment if you’re not willing to reciprocate.\n\nAnd, dude, if you’re wedding day ends up being the most important day of your lives… well, that’s just plain sad. \n\nWeddings are just a nice, slightly stressful  day to host a party to celebrate your love and your new lives together.  If you don’t plan on something (or a lot of somethings) coming along to top a party in both import and significance, your imagination is tragically limited while your shallow is boundless.  \n\nIf you don’t see your anniversaries and milestones together - after tribulation and hardship - as FAR more important, then it’s probably because your focus is all about the wedding and not about the marriage.  That means your wedding really is all about one, single day, and that’s sad not celebratory.", "INFO: When the estate was probated, did you and your brother get personal effects or money that were roughly equal in value? If your Dad left him with more cash/assets because you got this, it’s not really fair for him to expect you to keep it when you received less, are not attached to it, and he isn’t prepared to buy it off you from his share of the estates proceeds. \n\nIf all things were equal between you and your brother, but you got this as an added bonus because you’re the first born, than I think YTA is more fair.", "if the pricetag of the wedding is more important than the marriage, the marriages is doomed anyway. Don't lose your family over it", "YTA it's a family heirloom", "YTA\n\nWhy would your family support you? You sold something that you KNOW means a lot to your brother. How could you write all of this, hopefully proofread, and not realize you are an AH? How did you not realize when you debating selling it?", "Well technically I guess you can do what you want with it, but you'll have to accept the relational consequences, and honestly, I think it's super dumb to blow all that on something ephemeral enough it could be ruined by a day of rain. Typically I'm an \"experiences over things\" person but in a past life I catered weddings and let me tell you, they are all the same in the end. And the experience won't be nice if the important relationships in your life are ruined and those people don't attend. Just live within your means or sell it for a house or something that contributes more to the actual future of your family, not a party.", "Your an idiot who thought selling a family heirloom was worth it just for a wedding. Spending too much money on a wedding is a choice you made. \n\nIf you needed it to buy a house or pay the mortgage then sure you could be in the right but you sold it for a wedding that you chose to make expensive.", "Destination weddings are for AH anyway. \n\nYTA. I highly doubt your father would have given it to you had he’d known.", "INFO: Is it possible to sell it to your brother as you would get the money for the wedding and he would get the heirloom he cares so much about?", "YTA it is a heirloom and just because it doesn't have meaning to you doesn't make it less important\n\n&#x200B;\n\nalso, you should know there is a direct correlation between the more money people spend on a wedding and reduction in duration they stay married, so enjoy the wedding but maybe look at why you are doing such an expensive one", "YTA.", "YTA - You are nearly 40 and cant afford \"lavish\" without selling things then you are just bad with money.At your age investments and stable places to hold wealth should be on your priority list not expensive parties.\n\nCurious, did you even offer to sell it to your brother?", "YTA. Your parents would be so sad", "Why would you not offer to sell it to your brother or other family first?  I guarantee they would have went above and beyond to keep that in the family. It sounds like you were jealous and spiteful because it was something that was important to your father and brother that they bonded over. You really are a piece of trash and when your wife leaves you for a richer guy and you have no wife and no family please come give is an update. \n\nHuge YTA", "Yta. That heirloom has been passed down for generations. I’m sure if your father knew what you were going to do with it he wouldn’t have left it to you. If you didn’t care for it then you should have given it to your brother since he actually appreciated it. I hope your marriage actually lasts or else selling a priceless family heirloom and losing all your family would be for nothing 🤷🏻‍♀️.", "So you two want a wedding and not a marriage? Got it. YTA,  1000%!!  It doesn't HAVE to be lavish, especially since you two can't *actually* afford it.", "YTA. Hawking hundreds of years of history for a tacky, gaudy party? God this is the most American thing I've ever read.", "YTA male version of Marie Antoinette", "YTA. Good news! Your wedding will be cheaper after you sell your family!", "A person with integrity would give the heirloom to the next sibling who will have kids so that the heirloom can stay in the family into future generations. And I say this as a childfree person. You will never repair the relationship with your family, even after you divorce your first wife, and blame the whole heirloom-hocking on her. YTA", "YTA\n\nLegally you're in the clear, but morally you a massive AH..\n\nAlso I don't why you're upset about your family not going to your wedding, you've just shown that family doesn't mean alot to you.", "Yta", "YTA, it doesn't belong to you, it belongs to the family. To throw away something so meaningful to so many people over the years for something as shallow as a wedding you can't afford is disgusting and I hope (and fully expect) that your family never forgives you.", "YTA\n\nIf you’re so desperate for money and your brother would be more than happy to take this item off your hands, why not give him the opportunity to buy it?", "YTA and your family is too for having a stupid tradition of passing it on to the first born rather than those who will cherish and appreciate it.", "Yta.. your wedding is  only the most important thing to you. The heirloom seems to be important to your family.", "It's your item and your right to spend its value on any dumb thing you want.  If your fancy wedding with no family in attendance is worth burning those bridges, flame on.\n\nI hope a few years from now you still think it's worth it.\n\nYTA though.  Just because it's your right doesn't mean you're n-t-a for doing it.", "My parents left me their antique bedroom set. It’s very very old and very expensive. I found myself in a very difficult financial situation. I was single mom to 3 boys. Before I sold it, I spoke to each one of my siblings to ask them if it was ok with them. They told me mom and dad would want you to take care of your kids. That’s how you handle this situation. And for a fancy wedding that now no one wants to attend?!\nMASSIVE AH", "Wow! YT massive A! \n\nHow selfish can you be?! If it meant nothing to you why didn’t you just give it to your brother? Sounds like all you care about is money and yourself. If I were your brother, I wouldn’t go to your wedding and I probably would never speak to you again.", "YTA. A wedding is a very big day, yes, and maybe this is an unpopular (and also subjective) opinion, but: your wedding won’t necessarily be the most important day in your lives. Even if you don’t have children, life is full of pivotal moments. There’s absolutely nothing wrong with wanting a lavish wedding…but it doesn’t sound like you can afford this on your own. How long have you been engaged? Did you consider a budget at all initially or are you now considering a lavish wedding because you’ve come into this inheritance? Yes, it’s legally yours, and I don’t know your family dynamic but selling something that other family members would value for sentimental reasons to pay for your wedding is shady. \n\nWhat’s more important to you? An over-the-top single day, or having your family in your lives still?", "YTA, this heirloom was passed due thru several generations so I can see why your brother and other family members would be very upset. \n\nYour wedding will definitely be memorable. The whole family will remember how much of an A-hole you are every time they think about it.", "YTA-This absolutely falls under just because you can do something it doesn’t mean you should.", "I'm really surprised to not see ESH at the top. Honestly, I don't care that you want to sell a family heirloom. Some people are sentimental, and others are not, I don't judge that. I can understand if it's more valuable to you if it's sold than just kept for \"reasons.\" \n\nBut you suck for having such a lavish wedding that you can't truly afford it. Gain some perspective about what is essentially a party. Getting married is about BEING MARRIED, FOR A LIFETIME, not about having a wedding.\n\nYour brother sucks too. This seems like a drastic overreaction on his part. If you want to spend your money or assets on a wedding, I don't see why that needs to be his problem. Then convincing other family members not to come goes way into asshole territory.", "YTA and a massive one.  You know your brother is very attached to the heirloom.  You know it means nothing to you but financially.  You admit it’s only yours because it’s traditionally passed down to firstborn sons.  You don’t plan to have children so you don’t really care what happens to it anyway.  Your brother does.  It’s not a cash inheritance.  You didn’t win the lottery by being born first, that’s not the intent of an heirloom passed down through generations.\n\nIt’s irreplaceable, man.  Priceless.  For so many reasons.  So you’re willing to hock it to a stranger unless your brother basically pays for your fancy wedding to keep it in the family?  This wouldn’t even be for an emergency, it’s for a party.  I hope it’s worth what it truly cost you.\n\nIf I were you I’d have already given the heirloom to my brother for nothing.  As the brother, I’d go NC with you if you sold it.", "\"AITA for stabbing my family in the back, knowingly sold things important to the family, and used the funds to make an event that everyone else will have to pay ***way*** more to attend which I only can do because of my betrayal?\"\n\nYes.   YTA.\n\n> With our parents having passed away, this means that virtually none of my family will attend the wedding, which I'm really upset about.\n\nYou didn't care about them before.  Why now?  Just because they'll make your ego feel bigger celebrating you?\n\n> I think since I legally inherited the heirloom I can do what I want with it.\n\nThis isn't legal advice.  We don't care what you legally can do.  You can legally have a right to do something and still be an AH.\n\nYou do realize that this is more than the wedding, right?  You're cut from all family events moving forward.  You stabbed your family in the back, and they're acknowledging that.", "“ I think since I legally inherited the heirloom I can do what I want with it.”\n\nYou’re right. You can do what you want with it.\n\nBut that would make you an AH. I can legally tell every person I walk by on the street to go fuck themselves, but that would make me a huge AH.\n\nThis isn’t “Am I legally in the clear?” It’s “Am I the Asshole?”\n\nYTA", "YTA\n\n*I think since I legally inherited the heirloom I can do what I want with it*\n\nYou absolutely can do with it what you want. If having a wedding that would be out of your budget without the sale of a clearly sentimental family heirloom is more important than your actual family, go for it. \n\n**Just because you can doesn't mean you should.**", "YTA. You'll probably get divorced, so then you'll have neither spouse nor heirloom. All you'll have is photos and memories of a person you hate.", "YTA, a fancy wedding is nice but is ultimately a bad financial investment and this heirloom is clearly something of importance to the family.", "Actions have consequences. Were you within your rights to sell it? yes\n\nare you an AH for doing so? yes\n\nYTA\n\n>In addition, he's convinced my uncle and cousins not to come to the wedding either.\n\nMaybe they can't afford to come because they couldn't sell an heirloom to make it happen. Or, maybe they heard the exact same thing we heard and decided for themselves your wedding is not something they choose to support.", "YTA  . If you don't care about it , give it to your brother  as he surely would appreciate it . You selling a heirloom will burn all your bridges with your Family,  and for what ? A wedding and trip you actually can't afford ? Don't forget your brother will still be your brother , but your wife can be the person you hate the most in 6 months when you split .", "Wow YTA. Hes upset because you've sold something very meaningful to everyone in your family, except you.. probably the biggest memory of your father, and something that has probably been in your family for decades.. and you sold it for a bit of cash? I'd have wiped my hands with you too, knowing how much it means to him, if you didn't want it, you should've asked him if he wanted it.", "YTA no if ands or buts about it. How can you write that and not think you're the asshole? Your father is probably so disappointed. You should've given the heirloom to your brother", "I’ll never understand people who value the ceremony of a marriage over relationships. I realize the heirloom is just an object, and perhaps in different circumstances it might be fine (for example, to pay for cancer treatments or something of that seriousness). But to sell something that is of significance to the family just to get married at a destination…that says a lot about a person’s priorities", "Also OP doesn’t see the irony in yes it was his to choose what he wanted to do with it, but also his family has the right to choose if they want to go to the wedding. It goes both ways.", "Yes, exactly this. Legally, OP can do whatever he wants with the heirloom. But that does not make it moral, nor does it make OP any less of an AH for selling it. Prioritizing money over his brother is definite YTA behavior.", "Yep. YTA. Just because he “legally inherited it and can do with it what he wants” doesn’t stop him from being an AH. This is the “AITAH” sub, not “Am I Legally Allowed” sub. Too many conflate these 2 concepts.", ">So you can brag about your wedding to friends, while looking at pictures that don't include anyone on your side of the family.\n\nSooo much this!", "Nailed it. Also, OP, I have had so many better days in my marriage than my wedding day and a lot of them were free. You are selling a peice of your families history and estranging your family for one event. Stop being extremely shortsighted, the world does not revolve around you.", "They just want to be able to post pictures of their lavish affair on social media to impress their ‘friends.’", "Brother? Yes. \n\n.. entire paternal (and possibly maternal) sides of the family.. definitely. \n\nThis will be a fall out OP will never recover from. And he will lose his entire support network over this decision.", "There are laws against prodigality. It will not apply here, but ownership is rarely complete.", "Your comment about the uncle explains exactly why heirloom culture is inherently broken. People are always left out, always pressure on the ones who didn't. Like I'm not saying OP is ok for what he did but I wish people saw how horrible this practice makes people. Brings out the worst in people.\n\nLike the family that harassed a grieving widow the day of her husband's funeral to get the heirloom engagement ring back to \"keep it in the family\"", "Doesn't care about traditions but wants an extremely lavish wedding to be thought of as the most important day of his life... which is a tradition", "And how was OP going to fund this shindig if their father had not passed away just a couple months ago leaving them this heirloom?", "What happens if  for some reason the marriage doesn't last? He's lost family and  the heirloom.    This is the typical case of idc about the marriage I just want a fancy expensive wedding that everyone  be in awe of.", "Also, the wedding won't be the most important occasion in their lives, unless they're involved in a tragic winery accident immediately after.", "Why are you shaming him for not making enough money? Not everyone in their late 30s is suddenly making bank.", "Lol imagine your kid selling something that has been in the family for generations to get married 150 miles away.", "Really? In this economy, you think everyone can have a lavish party outright?\n\nSure, they could change their plans, but OP is technically right - they inherited the piece. It’s theirs to do what they want with it.\n\nNAH - everyone is right to feel the way they do about the situation but OP has the right to sell an object they don’t even care about.", "NTA !.. its his stuff, he can sell, throw or do whatever he wants !  \n\n\nif he isnt attached to those heirlooms, he can do whatever he wants.", "Not only do people hate destination weddings, but you don’t realize until after you get married that you don’t even get to enjoy your own wedding. You’re so busy doing shit and thanking people and taking pictures you barely get any time to enjoy the party that you throw. You get to talk to every guest for 1 minute and maybe have 5 minutes to eat. OP sold his family heirloom for a lavish wedding he will barely get to enjoy or remember. He sold his *family heirloom* for a lavish party for his guests, who aren’t even coming now\n\nYTA OP", "I live in the UK and two of my friends got married in Vegas. Did I attend? F*** no!", "\"I am merely the curator of this item and one day I’ll give it to another descendant.\"\n\nBeautifully put.", "TBF I really do think the relationship is going to peak at that point.", "And it's a party with no one planning to attend.", "Don't blame the parents,  for all you know op just grew into an ass to spite them.  \n\nYou'd think I and my brothers were raised in three different households by how we turned out.", "if you read it you would have seen that he sold the painting", "he already sold it brother found out after please read", "I agree on the first sentence here. Almost every day here at AITA, there is some asshole who value the ceremony (or worse still... the PICTURES of the ceremony) over their relation to the people involved. \"Wear this, lose weight, cut your hair, else you ruin my day!\" Well... If you like this friend well enough to have her at your wedding, you want HER there. Not a fancier, toned-down version of her... right? \n\nAlso, OP is ofc YTA for selling the heirloom. No party is worth pushing your entire family away.", "Exactly this isn’t an emergency and I think it’s kinda awful that the brother gets the short end of the stick for being younger. I bet their dad would have reconsidered if he realized this was the outcome.", "I don’t understand this either, my 3 cousins all got 30K when they turned 21, one went to law school, one bought a house and one put it towards a wedding. Honestly I was gobsmacked, who spends £150,000 on a wedding?! \n\nYou specifically mention the ceremony, I can understand people wanting a nice ceremony, with nice pictures in an important venue. But surely that’s the cheapest bit?? The actual showing of love and exchanging vows, the most important bit of the wedding will probably be ridiculously cheap compared to the massive parties with fireworks and performers people throw.", "OP has not thought about all his friends asking where his family are… the fallout will probably go beyond family.", "This last paragraph is everything. \n\nThe irony of a family heirloom put into the wrong hands, sold to have the most extravagant wedding to start a new chapter in his life .. alone. With no family. \n\nAnd he’s already sold it?! Ffs. That’s just terrible.", "Not to mention as someone who has already had a wedding, mine was a penny pincher wedding and I’m glad it was because they go by so fast. It’s soo much prep and planning for literally one day, one party, not even 24 whole hours. And since it is a busy day it feels like it goes by even faster than the average day. It’s such a whirl when it’s over this guy is gonna be left with his dick in his hand, and nothing but faded memories and some pictures to show for why he has no family left. \n\nIt’s legitimately the biggest waste of money with the smallest return. (Not to mention that divorce rate)", "I was really afraid I was going to be on the wrong side of this, but I’m glad to see that others agree that, OP, yes, YTA. \n\nMy mother had a china cabinet that has been in our family for at least 3 generations. It is passed to the eldest girl in the inheritors family, so will be passed to me when my mom passes. I do not want it. I’m not super sentimental and I don’t really go in for antiques, so I chose to ask my cousin and his wife, who purchased and live in our grandparents’ house, if they would like it. \n\nOP, I think it’s somewhat telling that you haven’t said what the heirloom is, but reference that your brother is a history geek. If this is something that is absolutely one of a kind and unique to your family, selling it would be unforgivable.", "Don't worry, this marriage won't let forever either.\n\nStatistically the more you spend on a wedding, the more likely you are to get divorced.\n\nThe fact that OP and their future spouse can't even afford this wedding on their own shows they are perfectly willing to live above their means.", "And you are not the owner, merely its guardian.", "It is OP's property and he is free to do what he wishes with it. Regardless, I think a good solution to this issue would be for OP to sell the heirloom to his brother. This would allow OP to get the money they want and OP's brother to gain possession of the heirloom they so deeply want.", "I'd say if you \\*want\\* a lavish wedding that YTA lmao", "Well my wedding was the most important day in my life. I spent it at the courthouse with 3 close friends and went to have dinner afterwards in a normal restaurant. Never understood why putting oneself in depth to have the biggest wedding ever. Size doesn't matter.", "I'm shaming him for wanting something that he can't afford. What was his plan if his dad hadn't croaked and left him this heirloom?", "This!! I did a low budget DIY wedding and spent a year painting decorations in my spare time and min/maxing the budget, and while I don't regret it, it went by FAST and I'm not sure I'd spend as much time on the details if I did it again. And definitely wouldn't spend more money. \n\nYou want to talk about memories you'll have forever? How about the down payment for a home you can actually share together. Normally I think this is a false equivalency (my wedding sure as shit didn't cost as much as a down payment) but it sounds like OP could make better financial choices.", "I told my husband to enjoy the taste test because we wouldn’t be getting any of that at the wedding for reasons you’ve stated.", "Never gone to a destination wedding. Sorry but your need to go is not overriding me being able to have my own holiday to where I want. The expectation that people should shell out ‘because it’s our special day’ I find vulgar. It’s surprising how unimportant that destination is to their relationship unless there is a crowd there watching them.", "Good point: \"he was made responsible for it due to his position in the family.\" Made responsible . . . and he sells it for a party. Oh my.", "This is how I see it. He does legally own it to do what he wants but ethically, it is owned by the family and future generations and he is just one in many to hold it and honor that tradition. The discussion to sell something like this is not just a decision of him and his fiance to make, it should be a family decision.  In fact, his fiance shouldn't really get a vote at all. \n\nOOP is very much the asshole.", "OP if there is one word to describe you, it would be weaponized ignorance \n\nyou CHOOSE to believe everyone would be fine with it since you legally own the heirloom when you know they will all be unhappy with your decisions \n\ntread wisely, I'd definitely go n/c with you if you treated our dad as a stepping stone for more \"lavish\" decorations at a wedding", "Your father is probably rolling in his grave right now and regretting passing it to his ungrateful older son.", "He wouldn't be okay with it, and you know it. He only left it to you due to tradition and is likely rolling in his grave.", "Wow. You're absolutely TAH. You only received it because it's traditional to pass it to first born sons, and you want to hock it to blow even more money on a fancy party you can't afford? If your dad knew you didn't care and were just going to get rid of it you KNOW he would have given it to your brother, who he could trust, unlike you who just sees dollar signs.", "You’re disgusting and your father would be disappointed in you", "Be honest with yourself you father would have been disappointed in you for this. You picked this over your whole family. You could have offered it to them or even to sell it to them. YTA and a lot of other not nice things that I’ll keep to myself.", "He would be so disappointed in you. Luckily he isn't alive to see what a horribly entitled, spoiled \"adult\" you have become.\n\nShame on you.", "Well, I hope you're happy about losing any relationship with your brother because there is no way you are coming back from this one.", ">so I could see him being okay with it.\n\nKeep telling yourself that, my dude. \n\nYou admit that this heirloom was important to your dad and brother, and that your dad would have liked to give it to your brother.  Your dad clearly cared about tradition, or else he wouldn't have given it to you. \n\nLook, you can do what you want with it, but don't delude yourself into thinking you are not the AH, or that your dad would have been okay with you selling it. Also, be prepared to lose your brother (and maybe other family members) over this.  But I suppose that is a small price to pay so that you get a lavish wedding.", "Quit deluding yourself. He cared about the tradition enough to follow it even when you clearly didn't care. He would care about it enough to be ashamed of you.", "INFO: So you didnt like your father so you did this?", "He's turning on his grave and will hopefully haunt you and your shallow asshole of a wife till your last day.\n\nETA. You're obviously a shallow asshole too.", "Sounds more like he’d be angry and think he gave it to the wrong child. Which he did, because you clearly didn’t appreciate it.", "You know you are wrong, you just done care.", "You said your brother is a nerd and he and your dad would “geek out” over it… get over yourself. You are a pretentious asshole. Have fun at your ridiculously expensive and insanely boring wedding while your family (rightfully) cuts you out of their lives.", "Highly doubt that. If your dad was torn about giving to you in the first place and only did bc of tradition. If he knew you’d sell it he would have rather gave it to your Brother.  You knew very well how he felt but sold it anyway. All your family know that you care more about the value of money than the value of family.", "No he wouldn't be okay with, stop embarrassing yourself.", "YTA. I bet yout father would be so disappointed in you. I can’t believe that you are even entertaining the idea of selling a family heirloom. If you go through with it I hope your brother goes NC with you. You seem like a very selfish and entitled person. Enjoy the wedding and hope it will be worth it losing your own family over it.", "If you sold the heirloom because you and your fiancee fell on hard times and needed the money to survive, I would agree with you. But you didn't. You sold it so you and your wife could have a party. That's all a wedding is. An expensive party. You didn't care about family heirlooms and traditions. Your dad cared so much that despite the heirloom being something your brother loved and that the two of them bonded over, he gave it to you because that was the tradition. It could have gone to your brother's son and continued to be an important part of your family. Instead, you took that away from your brother and all future members of your family so you could have an over the top wedding. Now your family has no heirloom and that big fancy party you wanted so bad will be missing most of your family. Your father would be ashamed. I hope the extra money you got for the wedding you will spend 1 day celebrating was worth destroying your relationship with your family for life and taking that heirloom from future generations.", "You are absolutely horrible not to give it to your brother.", "Your dad has been dead less than 6 months and you’re already preparing to get rid of his treasured belongings that he left you for ONE DAY? I say this as someone getting married this year, you’re being incredibly shallow and short-sighted, and despite your lack of sentimentality, will come to regret this. Is it worth damaging your familial relationships? How will you feel once the wedding has passed, the wedding your father cannot attend, then have it sunk in that you sold off something precious that he valued enough to will to you, all to throw a slightly more glitzy party? YTA, morally if not logistically.", "You’re the worst.", "I hope you’re content with the consequences after all this, by consequences I mean not only losing your best man but your brother. You’re also losing your side of the family by being so selfish and they’re all going to see you and your wife differently. This will never be forgotten. \n\nAll they’re going to see is how materialistic and selfish you are.", "You're being very shitty. You know this is hurting your brother. I hope your wedding is worth it.", "Is it worth selling for your super fancy lavish wedding that no one in your family will celebrate with you?", "Destination wedding you say", "Although I couldn't see myself doing this, it was his decision.  He's not telling anyone, as far as we know, what to do with their inheritance.", "A few years ago I went to a fancy country club wedding with 18 bridesmaids and groomsmen. Everything decked out in expensive flowers and decorations. Completely over the top. \n\nIt ended in divorce 6 months later 👍", "Maybe he has another heirloom he can sell for the lawyer.", "It was a painting by a lesser known artist...\n\nMaybe his family will be able to buy it back, but it'll be expensive...", "OP is a major AH. Selling it would be unforgivable. \n\nThis heirloom should absolutely stay in the family, it’s obviously what your father would have wanted. It SHOULD be sentimental to you because your father upheld the family tradition with honor.\n\nYou are not. And your entire family sees what a selfish AH you truly are. \n\nYou are legally entitled to do whatever you want with this heirloom, but you will lose your entire family because of it.", "See I think what my grandma did was really great. She had a beautiful antique armoire, and after her funeral whoever wanted it put their name in for a raffle. My sister won it that way. I think it was great because that way it really went to someone who'd cherish it.", ">Statistically the more you spend on a wedding, the more likely you are to get divorced.\n\nwhats the stat on betting for OPs marriage to implode and his wife fleeces him for all the money he has? \n\nI dont want to jinx it", "Yep, spend so much on a wedding and then live the rest of your life in poverty.\n\nI forget how many marriages end in divorce, but at least they had a lavish wedding.", "This. I could understand if it was something like life saving medication or struggling to conceive a baby, but a ‘destination wedding’… gross.", "Yeah... It's like that show they did \"a house or a wedding\"... The show would either pay for their wedding or give them a cash down on a house or something... I don't understand how anyone chose the wedding... \n\nWe have been pinching pennies for 2 years to save for our house! Why would you choose a party, over having a roof, that you own, over your head?", "But see, you are actually focusing on the marriage, not the party to celebrate the marriage. Which shows your priorities are in the right place! Congrats, AH-Raccoon.", "He would have had a less expensive wedding. This kind gift from his father allows him to have something nice that he wouldn’t have otherwise had. Doesn’t anyone deserve that?\n\nTo clarify, I’m also not defending the impact on his brother. I just don’t think the problem here is that he doesn’t make a lot of money.", "But that's not what you said.", "I've always thought that a destination wedding would only work if I was willing/able to shell out the money to pay for every aspect of travel and lodging for my guests. I cannot imagine thinking that an entire vacation's worth of time, travel, and money needs to be used up for the sole purpose of having a single party.", "Is it owned by thr family? Does the family all get to use it? This is my main problem with heirlooms, they bring out the worst in people like with OP or the family that harassed a woman on the day she buried her husband to get back an heirloom engagement ring because it has to \"stay in the family\"", "Oh wow. \n\nSo really the father would be rolling in his grave right now knowing the absolute dishonor of OP", "Leaning?? Really?! OP is actually the biggest AH I’ve read about on this sub in .. years.", "Honestly. I would say NTA if he sold it to his brother who his father wanted it to have. Personally I would have just given it to him regardless of tradition, and while it'd be stingy that he sells it to his brother for cash atleast then it's still in the family, and with someone who will genuinely treasure it.", "The convincing could have just been family asking the brother why he is no longer the best man and him going “OP sold the family heirloom” and then the rest of the family decided not to go. I doubt OP is a reliable narrator and people always try to write it to their advantage on here.", "The only thing OP got right was that the tradition is outdated and BS. His father should have left the painting to the son that would actually care for it and value the sentimental value of a family heirloom over the greedy one who would throw it away for a fancy overpriced party.", "That whole show completely boggled my mind. It was a substantial down payment amount, too. Even if I couldn't afford a mortgage right that minute even with that down payment, I'd bank it until I could. Being able to buy a house > an expensive party", "That's what my parents did. Small wedding, their honeymoon was a three-day weekend in Vermont, and they used that money as down payment on a house.  It worked out well for them.", "Ah I see, not something I considered in my original reply. Hmm it is a distinct possibility.", "From the sounds of it, yeah.  He sold it, and *then* let his brother know."]}