{"id": 1536, "submission_id": "ymsl6p", "title": "AITA for making my bf pay for expensive bath products even though he can’t afford them?", "selftext": "I (24F) and have been dating my bf (29M) for a year and half and have been living together for 6 months. \n\nI have a well paying job but my bf is looking for a phd position so is working part-time delivering medicines and volunteering at the university. When we moved in together we agreed to put 50% of our salaries into a joint account for joint expenses like rent and groceries and the rest 50% into our personal accounts. Since I make thrice as much as him I have more ‘fun money’ but it also means I’m contributing a lot more to our joint account. \n\nOne thing I like to treat myself with is body bath products from this really expensive brand. I pay for them using my personal account and buy less expensive products for my boyfriend using our joint account. Recently, I started smelling these products on my bf (they have a strong distinct smell) so I asked him if he used them. He said he only uses them a few times a month so I let it go as that’s fine. However I started smelling them on him all the time and also realised I’m running out way quicker than usual. So I confronted him and he admitted that he prefers my products over his so he uses them daily. I said no problem but I’ll be paying from them using our joint account from now on. Well, he freaked out. He said he can’t afford them and since I have more money in my personal account anyways I can afford it. I however think it’s unfair as I’m already paying so much towards our joint account that I would like to use my personal money for my own things and savings. Also, it’s not like I asked him to contribute more than he does towards the joint account, we can afford these products together after our other expenses. It will just cut through a bit from our joint savings. \n\nWe got into a huge fight and he’s saying that I’m financially abusing him. He got our friends involved and they’re split. They think I should be considerate of his feelings as I make a lot more than him and can easily afford the products on my own. Now he has stopped using the products as protest and I feel terrible.\n\nETA: Since the comments are mixed, I want to give a bit more information. \n1. My boyfriend is looking for his phd in a field with very limited opportunities (like archeology) whereas I work in a very high demand field (think AI). So we always knew I would be making more money than him and we agreed that there will be some things that I can afford while he can’t. So I make a point to get him nice gifts and take him out for expensive dinners every once in a while. \n2. They aren’t just any bath products. I use Dr Barbara Strum or Molten Brown products. They can be very expensive. \n3. My job is very demanding so I unwind by taking baths so it’s something important to me. I snapped when he used one of my favourite bath bombs that’s hard to find and is expensive. \n4. We also equally divide household chores so it’s not like I bring in more money so I can relax more at home.", "created_utc": 1667651355, "permalink": "/r/AmItheAsshole/comments/ymsl6p/aita_for_making_my_bf_pay_for_expensive_bath/", "score": 2804, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because I want to pay for the products using the joint account even though I can afford them on my own. This made my boyfriend think I’m financially abusing him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA How can you be \"financially abusing\" him by expecting him to pay half when he's using half? He's the one who started just using your products every day without asking after saying he only used them rarely, and he's the one who decided by himself without telling you that you should be 100% subsidizing his use of your personal luxury items.\n\nHe doesn't need these things. They are a personal indulgence, which is why they weren't part of the shared household budget and you paid for them out of your personal money. If he wants to indulge he should at the very least ask; and if he wants to make luxury products his every day experience then he can pay for them. It's not like the alternative is scrubbing himself with thistles picked from the side of the road. He just doesn't get to smell extra nice every day for free.\n\n*edited to fix brain fart.", "NTA. You use the joint account for things you both use. If he wants equal access to the products, he should contribute some to it. Especially since you said you can afford it from the joint account. And you were okay with it when it was a few times a month. You've been super tolerant.", "NTA but I really don't think his issue starts and stops at toiletries... If he's upset enough to cry financial abuse (which this is decidedly *not*, btw), there's something more going on.\n\nIs it possible he resents you making more than him? It may be a good idea to have another talk about finances, because if this imbalance is going to keep causing issues you need to find a solution before it festers.", "NTA\n\nPlus I feel that most of the ESH and YTA commenters are reading it wrong.\n\nYou're not \"charging him for bath products.\"\n\nYou're just saying that since the bath products are a *joint expense* (since both of you are using them, not just you), the cost should come out of the *shared account*—to which you're already contributing more than he is (sounds like around 75/25). \n\nThat's absolutely fine!", "NTA. Next, he is gonna be taking your car because it’s nicer? Or your phone? If you choose to financially support him while he pursues his phd, it should be on your terms. If he thinks that’s beneath him, he can find a new sugar mamma. Choosing higher education often comes with low income for a while, so he should be prepared to live the low-income life that comes with it. That’s why it’s an investment.", "NTA. In those 6 months you have been living together, you are building your very well necessary ground rules for coexistence. Couples need their personal space and things too. But your BF is using your stuff, liying about how much he uses it, and doesn't want to fairly pay for it. I don't think that is a good sign in financial and personal aspects.", "NTA. The fact that he doesn’t think he should have to pay even a fraction of the cost of the stuff he uses is a huge issue. Claiming you’re financially abusing him while you foot the majority of the bills is completely unreasonable and he is a mooch. If/when he starts earning a comparable salary, he will probably continue to be the selfish and greedy person he has revealed himself to be.", "Technically if you're putting more in the joint account would that not mean you're paying for majority of these products? Technically now\n\nBut on the serious note, if he wants to use them then obviously he's got to pay for them so NTA\n\nYou reap the seeds you sow as they say", "NTA. Household products come from the joint account. I don’t understand what the issue is.", "NTA \n\nA couple of things:\nI think it would be a very good idea for you and your boyfriend to sit down and try to have a conversation about this without it escalating, and I think you really should talk about what he meant when he said that you’re financially abusing him.\nBecause you’re not! I see it more and more that people are throwing around words like that without the true meaning behind it, and I don’t understand why he thinks that.\nYou’re in fact paying for two thirds of his products and for all of your products so I don’t understand how he could come to the conclusion that you’re financially abusing him.\n\nI don’t know you guys or your relationship, but it sounds like there might be underlying issues, maybe he feels resentful because you earn more and are able to spend more, and knows this will go on until he has his Phd? Maybe you feel resentful because you contribute more to the household expenses? I don’t want answers obviously, but I think it would be a good idea for both of you to sit down and talk about your finances again and just tell the other person how you feel", "NTA. If they are products used by both, the household account should take care of it. Shouldn't be a problem since you can enjoy the products together. I don't think he knows what financial abuse is.", "NTA. If he can use them, he can cough up some money for them, aka from the joint account", "NTA, you're not obligated to help your BF live beyond his means. You both contribute to your household expenses and these products are outside of that category. Either he pays up or stops using them.", "NTA. He turned the good bath stuff into a joint expense by using them all the time. The household budget just went up, so you both contribute more. No reason to fuss unless he's an entitled brat. You already contribute 75% of the household expenses to support him in his pursuit of higher education. Not paying more when he unilaterally increases the household expenses is taking advantage of you, regardless of why. He has to decide which he wants more, the products or his fun money.", "NTA. Molton Brown is expensive AF.", "NTA.  Things that both of you use should be paid from the joint account.  You are already paying 3X more than he is into the joint account and he wants more?  Who is abusing who here?", "NTA Lol not paying for luxury items is not financial abuse... WTH", "NTA, it’s only fair that you both pay for the products if he’s going to use half. It was not tit for tat, you didn’t mind him using SOME but it’s another thing if he wants to use them all the time. Also as another user pointed out, if you’re putting half of your salary into the account you’re already paying more, how is this abuse?", "NTA. He’s not being financially abused. If anything, he’s using you since you’re pretty much subsidizing his living expenses. He’s being beyond unreasonable here.", "NTA. If he wants to use them jointly then they become a joint expense, it is not very difficult for him to obtain his own toiletries and hygienic products If replacing yours isn't in the budget", "NTA if he wanna use the more expensive stuff he could have asked when he knew they were more expensive \n\nMigth get his phd position (idk know what it is exactly not from the us) so he can ask if he can pay you back not just expect you to pay for it alone for 2 people", "NTA \n\nIt was agreed upon that finances would be split and both would add in 50% for joint expenses. Y W B T A if it was all joint money but it’s not and these terms were agreed on by both of you. \n\nIf either of you aren’t happy with the agreed upon terms then a conversation should be had about a new agreement if one can be decided on.", "NTA. The joint account is for joint expenses. He turned them into a joint expense when he started using them every day.", "NTA and cut the dead weight, he sounds exhausting to live with. Why do this to yourself when you're a perfectly capable woman?", "NTA but one indicator of abuse (which in this case is also happening with manipulation and the silent treatment) is someone doing something unreasonable and accusing you of being the abuser. Read up on DARVO and take a step back and really think about your relationship and whether or not there are similar instances of this kind of behavior.", "NTA - the two of you really need a serious discussion if he’s pulling out the financial abuse card.\n\nIf your able to afford them, treat yourself all you want.\nBoyfriend is literally stealing your products and is now calling foul for you wanting it to come from joint money and not your separate account.\n\nThis will be coming up more and more in the future.  You can afford it, so you need to pay for it.\n\nUnless you want to start being treated as an ATM, you need to nip this now.\n\nIs he really looking for a position or is he going to pull that I can’t find anything that’s worthy so you can just pay for everything while he plays.", "NTA\n\nMy husband and I do share some products …like I absolutely know when he’s using my stuff. The better point is that he also buys some of it or keeps our shared stuff stocked. Your bf wants to use your luxury products simply because they are already there.\n\n\nHowever. \n\nBarbara Sturm is *goooood* shit. I’d be fucking appalled at my husband for using that. It’s cute he thinks he can hijack your products and understand what he’s doing. I bet he’s wearing actives outside without sunblock. That’ll catch up to him.", "NTA. If he can't afford to repay you, he shouldn't be touching them. He's using YOUR expensive product after you've already designated some for him. \n\nTell him when he starts making more money he can buy his own.", "Nta.  If he is using them all the time then buy from joint account.  You are contributing more to the joint account anyway.", "NTA because you don't want to pay for your boyfriend to use expensive products, and you shouldn't have to if you don't want to. And did he really call it financial abuse? Like, seriously? That's ridiculous.\n\nAlso, \"he has stopped using the products as protest\". That's just LOL. It's literally what you wanted so how is it a protest? Talk about cutting off your nose to spite your face. He didn't think that one through.\n\nHowever, you do sound a bit transactional about your relationship, and like you have maybe built up some resentment about the financial split. I don't think you are as ok with the current set-up as you claim to be. As you are not married and are co-mingling finances to a certain extent, you might want to get to the bottom of this issue.", "I think you should just drop the joint account and just have your personal ones. You can still split rent, bills etc with personal accounts, if he wants bath products then he should just buy his own, or atleast contribute a percentage of his money to the bath products you buy so you're sharing the product and the price. NTA", "I think if he is going to be this petty I n this think is this really the mad you want to be with.\n\nNta", "NTA If he wants to use specific products he cam buy them himself. Personal care items are not part of shared expenses", "NTA. You need to reconsider your whole financial setup and whether or not you want to keep financially supporting a man 5 years your senior who doesn’t want to pay a fair share of shared household products.", "This sub is filled with older men dating women in their early 20s and financially mooching off them in indefensible ways. You're like the 5th post I've seen in a month. You are NTA but the financial abuse is flowing the other way. He is deliberately raising your expenses to cut into your independence from him. You don't say what kind of PhD he's getting but will he even eventually make enough money to balance this out, and how long will you have to put up with this inequity before that happens?  \n\nA previous poster with a bf just like yours actually put a lockbox under the sink and hid her products in there.  The other posters, whose boyfriends were usually spending their money by inviting all their friends out for free meals and then forgetting their wallets at home, forcing the younger women to pay for all the food, all got their asses dumped. \n\nYou could stop buying expensive products for a while, or keep them at work and apply them when you get to the office. It might help you see if he switches to something else to cut into your financial independence to compensate.", "NTA. He’s trying to take advantage of you. \n\nI’ve been with my little lady for 8 years, lived together the last 5, and personally, I think y’all are doing the joint account wrong. Both people should contribute equal amounts, not equal percentages. \n\nIf he only puts in $50, then you should only put in $50. His money is not worth more than yours because he has less of it. That’s not how society works. \n\nAs for the shampoo, if you paid for it with personal funds and asked him not to use it, he ought to be an adult about it and stop using products he can’t afford, especially since he refuses to pay half for it. \n\nIt also doesn’t matter if he will be a doctor. If he is bad with money now, he will be bad with money then.", "NAH\n\n\nThis isn't really about bath products,  it's about money and who has more. Getting friends involved is childish to the extreme.  \n\nMight want to think about this, according to the info in the post money inequity is going to continue to be an issue due to his chosen field. \n\nYou guys might not be a good match. It's bath products now, what's going to happen when you make a large purchase? House? Retirement? Vehicles?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24F) and have been dating my bf (29M) for a year and half and have been living together for 6 months. \n\nI have a well paying job but my bf is looking for a phd position so is working part-time delivering medicines and volunteering at the university. When we moved in together we agreed to put 50% of our salaries into a joint account for joint expenses like rent and groceries and the rest 50% into our personal accounts. Since I make thrice as much as him I have more ‘fun money’ but it also means I’m contributing a lot more to our joint account. \n\nOne thing I like to treat myself with is body bath products from this really expensive brand. I pay for them using my personal account and buy less expensive products for my boyfriend using our joint account. Recently, I started smelling these products on my bf (they have a strong distinct smell) so I asked him if he used them. He said he only uses them a few times a month so I let it go as that’s fine. However I started smelling them on him all the time and also realised I’m running out way quicker than usual. So I confronted him and he admitted that he prefers my products over his so he uses them daily. I said no problem but I’ll be paying from them using our joint account from now on. Well, he freaked out. He said he can’t afford them and since I have more money in my personal account anyways I can afford it. I however think it’s unfair as I’m already paying so much towards our joint account that I would like to use my personal money for my own things and savings. Also, it’s not like I asked him to contribute more than he does towards the joint account, we can afford these products together after our other expenses. It will just cut through a bit from our joint savings. \n\nWe got into a huge fight and he’s saying that I’m financially abusing him. He got our friends involved and they’re split. They think I should be considerate of his feelings as I make a lot more than him and can easily afford the products on my own. Now he has stopped using the products as protest and I feel terrible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "sounds like expensive bath product digger", "I've been living with my partner for 18 months and been together for 2 1/2 years and we still haven't had the joint bank account talk. It seems incredibly premature for you two to have one this early into your relationship. I earn SIGNIFICANTLY less than my partner. Even when I was on unemployment we either split things according to income (60/40) or 50/50. Our apartment is linked to his bank account so I transfer my share on rent day. Electric in my name linked to my account, gas & water linked to his name his account Netflix in my name. Etc. Things like this \n\nYou should consider going back to the drawing board with how to split finances. And how to split household items, what items you want to consider household items, which ones personal luxuries. This seems like a communication issue coupled with your boyfriend feeling entitled to your money while being smart & saving savvy with his own. ESH", "This is a tough one.  Imagine if the genders were reversed.  \"My wife is a SAHM and I make a great salary.  I like to use expensive shower products because they smell nice and are good for my skin.  Because she brings in less money, I buy her generic store brand products from the house budget.  I recently found out she has been using my products and was angry.  I told her if she wanted to use more expensive things, she can find a way to pay for them herself.  AITA?\"    I'm not going to cast a vote because you're not married and can decide for yourself if bath products are a deal breaker.  Just wanted to give you and others something to think about.", "[deleted]", "YTA. He's not your roommate. He's your partner. Sounds to me less like you care who pays for what and more like you want to remind him that you make three times as much money as him right now. If you can't share *bath products* with the guy, you probably shouldn't be living together.", "In a relationship you're supposed to be a team. Doesn't sound like it", "ESH - you guys are petty as hell, splitting hairs over goddamn bath soaps?? Seriously?? Red flags all over the place that point to deeper issues in your relationship.", "YTA. It's bath products. Share. If this is your mentality though you won't have to share for much longer because my guess is that your BF will peace out of your relationship. And it's not like he's staying home all day, he's in grad school, working and volunteering.", "YTA-he’s going to be doctor, I’m sure he’ll pay you back. FFS it’s bath product, learn to share with the person you supposedly love", "YTA. Are you going to fly first class while he's in coach, order steak when he gets the grilled cheese, drop in at the thrift store while you head to the mall? Why are earth are you living together?", "YTA. You should share items you both use. You're sharing a home.", "[deleted]", "NTA. The fact that he’s throwing out there words like financial abuse when he’s in essence stealing is a bit rich. I’d be very clear with him that either he chips in on paying for them or he doesn’t use them. Don’t give in to this. Also bringing other people into an argument is a huge red flag. If I’m fighting with my boyfriend I’m fighting with him alone him tag teaming friends and family is not ok at all", "NTA.", "NTA. You’re not financially abusing anyone.  He, on the other hand, is bath product abusing you. Get your own crap dude.  The salary difference will continue probably, so this needs to be sorted now.", "[deleted]", "Nta but lo and wtf is up today. Are one of you the children of the lady that is mad her husband won't let her order 4 dinners to waste so she tries everything? I'm waiting for the AITA asking if they're the asshole for not selling the youngest child when the rest are starving or something. Probably bad service on their phone plan.", "NTA. Sounds like he’s throwing his toys out of the pram because he can’t deal with the fact that OP’s chosen career pays far better than his. \n\nOP is being completely reasonable, and fair, but our boy seems to have issues when he sees her buying expensive stuff with her disposable income. In fact he’s not just throwing his toys out of the pram - he wants to take *her* toys, and is sulking when he’s told that’s not how it works. \n\nHe needs to put on his big boy pants, and accept that he made a decision to pursue a lower-paying career, and that this decision has consequences.", "Absolutely NTA. This has become a joint expense. Your bf has a lot of nerve complaining about this being taken from the joint account considering you're putting so much more in than him. He is fortunate that you are ok with the current financial arrangement.", "I think NAH, although I do think there’s a certain amount of pettiness going around, more on the bf ends imo (so maybe NTA?). I think your proposal is perfectly reasonable. You’re paying the majority of household costs for him to pursue his dream. Getting a PhD is not a guarantee he’ll get a future high wage (I know—I’m working on my PhD) but there are lots of years where he won’t be making much and that will require lots of conversations about how things will be split. All you’re suggesting is using the joint account on something you’re both using. I do get why he’s struggling with how little he’s making, but that’s sort of the pain of pursuing his dreams sometimes. You’re already making it easier by contributing so much to the household. I’d suggest sitting down and having a conversation but he needs to understand he can’t go airing relationship problems and crying wolf about being abused. It’s not abuse and he’s diminishing the situation of other people who ARE being abused.", "NTA.\n\nYou clearly didn’t mind sharing them on occasion, but when they became part of his daily routine, they absolutely shifted from a personal expense to a joint expense. He took advantage of your kindness, and I don’t think you are wrong for being upset.\n\nYou have an agreed to financial plan and it is unfair for you to be shouldering more costs that you weren’t anticipating.", "**NTA**\n\nAnd if he's smart enough to be working on a Ph.D. he is smart enough to understand that: 1) you are not \"financially abusing\" him, because he has no intrinsic right to luxury products to begin with so not having access to them is in no way \"abuse\", and therefore b) if he feels that he cannot afford to pay for them out of his money/your joint account, then he needs to stop using your luxury products. Period.\n\nI understand his frustration and envy, trust me. I was raised, not wealthy but certainly upper middle class, with access to lots of nice things, and I am now amongst the poorest economic class in my country thanks to having become severely disabled and living on meagre disability benefits. It was an incredibly difficult lesson to learn, having to live within very different means and give up almost any and all nice things. Suddenly \"luxuries\" were not Jo Malone perfumes but being able to buy myself some nicer food from the grocery store, LOL. But that is reality, and that's what your boyfriend needs to learn: that we would ALL - every one of us - love to have luxurious things, but at some points in our lives some of us cannot afford them. \n\nAnd sometimes we live with people who can, and far from being \"financially abused\", I'd say he is incredibly lucky to have a partner who is loving and generous enough to say, \"Hey, I'm okay if you want to treat yourself OCCASIONALLY with my nice things.\" And that you buy him nice things on special occasions. But he is your boyfriend, not your life partner, and your finances are not commingled, and he is not ENTITLED to the luxuries that you buy to treat yourself. No, ma'am. \n\nYou are absolutely NTA to say, \"You have two reasonable choices: you can share in the cost of these expensive things, or I would rather that you didn't use them except on rare occasions as a treat.\"", "NTA. Your boyfriend is welcome to do his PhD in whatever field he likes but then he shouldn't expect others to subsidize his choices.", "NTA but I also have a PhD in a highly competitive field. It took me a long time to find a good college teaching position, but before I did, I still worked multiple part-time jobs to pay the bills. Your boyfriend could take on a second job to buy the stuff he wants. Even though I was technically working full-time, I was still able to make time to look for jobs I was eligible for and apply for them. I also did other things to save money or earn extra money, like participate in focus groups for cash and get my hair cut for free by hairstylists in training. Applying for jobs with a PhD is very time-consuming, but it's doable with a full-time job or two part-time jobs. Your boyfriend is taking advantage of you.", "NTA-  if both is using the products then it comes out of joint account.", "NTA there is no need for a joint account you aren't married. Keep your finances separate and pay for the bills when they are due.", "NTA. I have expensive hair products and have pretty well laid out the same options to anyone if lived with, if you want to use some go ahead but you'll have to chip in, the difference is everyone I've told this too understood and didn't throw a tantrum. Maybe I'm overthinking but I almost get an impression he's insecure about making less? I don't know why this would be the hill to die on otherwise", "NTA. The fact that he’s calling your request for him to pay his share — which is still less than what you are paying — and he is calling it abuse would make me worry about his intent in terms of pulling his weight in the future. It’s a slippery slope when someone starts justifying why they shouldn’t have to pay their share especially when it involves living beyond their means. It sounds like he is starting to both take you for granted and take advantage of you. And the fact that he got your friends involved? Honestly that crosses a completely different line. And that would be the finish line for me.", "ESH \nI think the issue here is that you buy cheap products for him from joint and nicer for yourself.\n\nView from his perspective, he is working, trying to find job I. His field and the person he lives with has nicer things and he has cheap.\n\nI’m not saying you are wrong but I am saying that  sometimes putting our partners feelings first is the better thing to do", "NTA. If you are both using them then you both should be contributing to the cost. Him crying financial abuse over soap is bs.", "NTA, but welcome to parenthood and congrats on your new son. Amazing how he is 5 years older but still might as well be saying \"but moooooom it's not fair!\"", "NTA ohh hellllll no. If my bf was casually using up my Skinceuticals products I’d be losing my mind, but DR STURM?!\n\nNope. Tell him to hands off.\n\nBetter yet, go shopping and help find him a routine/products that he likes but are within his budget??", "YTA.\n\nThis is really petty on your part. Is this how you imagine your future with him? Because it doesn't sound fun.", "YTA I understand your frustration, but you need to pick your battles and ask if this the hill you want to die on - especially after mentioning how much more you earn than he does several times. Are you really happy knowing you are denying him a tiny taste of the luxury you enjoy in front of him daily? It’s totally fine if you say that your rare products are off limits, but I encourage you to be generous with the daily stuff. If I had to wash myself with Dove while staring at my partner’s Molten Brown soaps, I’d feel like crap. You’re partners and he’s in the job-struggle because he’s following his passion - be kind <3", "YTA. You can clearly afford it if 1/2 of your salary is \"fun money.\"", "Sharing is not a business transaction.  Relationships are not business transactions.  YTA for failure to consider the possibility of sharing with BF.", "ESH. I buy more expensive stuff for myself than I do for my husband.  I buy him what he likes and what he asks for.  \nHaving said that, I would never get mad at him for using my stuff.  I would never ask him not to use something that I bought for me. \nShould he ask? Yep. Should he have more respect for your wishes? Yep. But in all honesty, your relationship sounds more like a corporate merger instead of two people building a life together.", "Edit: OP's edits change my COMPLETE verdict and opinion. Not E S H any more, NTA. Why do people always provide relevant info only in the edits??\n\nHim for sneakily using your products and being manipulative, you for being selfish and cheap. He's going to earn excellently in the future and is hard working (I am assuming - since he's striving towards a PHD?). You buy expensive bath products for yourself and cheap ones for him even though you KNOW he likes the expensive ones? You're treating him like a roommate, not like a partner. If you are already having trouble sharing or compromising in this very minor aspect of your life, I see a lot of trouble ahead. Where's your trust - and your wish to see your very own partner happy? It's not like he wants you to buy him an expensive car, it's literal bath products. And his financially difficult situation is not forever. Learn to trust and share. And he needs to learn to communicate better. You are not financially abusing him (this manipulative statement plus his sneakiness is him being TA), rather, you're being selfish and not acting like a partner.", "Both are the AH", "YTA\n\nTeamwork makes the dream work and if you are going to be together for any length of time then you need to work together, there will be times when he is up on money and you are down on money.", "OMG- you took to the internet over freaking bath products. Got to love first world problems. Please break up with him and spare him a life of selfishness over petty things!!! YTA", "[deleted]", "ESH. It seems like between you, you could find some products he likes that are more affordable. Help him shop!", "This just sounds untenable. If you don't want him to use your stuff, keep it put up where he can't find it. He will get the message immediately. Maybe he thinks you really don't mind him using them. Men can be dense sometimes.", "The way they pay into their joint account he would still only be paying 1/6 of the amount.", "Agree with your argument but it does not match your judgement. Sounds like you’re saying that OP is NTA, but you wrote y t a", "Wait you say y t a but then says she isn’t in the rest of the comment I’m confused", "He’s not even paying half!", "And if it's being paid for from the joint account he'd only be paying a fraction of the cost, because he puts less into the joint account.", ">Is it possible he resents you making more than him?\n\nI think it's more likely that he resents her living the \"good life\" in front of him.", "Yup, and the BFs personal bath products already come out of the joint account while OPs do not purely *because* they're expensive, so this particular line item was in the BFs favor.", "Exactly", "Drs are notoriously awful with handling finances I've noticed, they just don't think it's as important to worry about when I guess they're making it with their PhDs\n\nThis pup she's living with has the Dr mindset without the pay to back it up", "I don't think this is a fair analogy only because he's refusing to pay even a fraction of the cost despite him having a job, unlike a SAHM who has no income.", "I don’t think it’s the same. Because what you are describing is a bad SAHM system where the breadwinner feels their salary is their own and not the household’s salary.\n\nOP and her BF each have their own salary and can buy things they enjoy, like chocolate or videogames. If BF wants the toiletries to be shared, they should both pay for them. Maybe split the cost by income instead of 50/50. It would be like if each had a car, but OP had the nicer car and BF thinks he is entitled to use it because it’s not fair that he drives trash.", "But that's not what's happening here: both put 50% of their earnings to their joint account. OP suggests that the expensive stuff should be paid from that joint account from now on because it's a *joint expense*. It will only affect the money they will be able to put into joint savings. Bf still has the same amount of fun money to use as he previously had.", "She is saying it should come from the joint account. Because they both use it.", "First of all she isnt the sole breadwinner and isnt using her authority to diminish his right to what is in the house. Op never said he should buy it himself, but that they should use both of their money to do it, as they could afford it, and share the expense as well as the products. He adamantly refuses and want her to pay for ALL OF IT and for him to keep using them.\n\nWhy are you trying to twist this, and making it a gender issue?", "Not really, in your hypo the SAHP is working for the family by handling the joint duty of childcare. BF is working for himself only and chores are evenly split.", "but he's not a stay at home mom she does just as much chores as him, he's choosing to go into archeology", "This was exactly what I was thinking.", "Have you looked at the prices of that soap? Barbara Strum lotions alone \nare $200-300 for a couple of ounces and that’s just one product.", "If he can use them without asking then he can pay for them.", "okay but OP literally picks out and purchases his bath products for him (as if he’s a child? like… why?), if he wants an upgrade i think he needs to choose and buy them himself. if this is important to him he should make room in his budget instead of pilfering— but it sounds like you think everyone deserves fancy bath products even if they can’t afford them. which just isn’t how life works.", "Bruh you try paying for a expensive luxury brand item and let your partner continue to gat half and see how quickly that’s becomes expensive even with a great salary", "Yep, the petty is strong.", "Expensive bath products, that he thinks he shouldn't have to buy for. Honestly, she's better off without him", "You've clearly not heard of molten brown. Its super expensive, and something op purchases on their account to avoid him bearing an unfair financial burden, as per agreement he entered into.\n\nIf he wants to use it he can share the cost, or maybe not enter into a agreement he won't honour", "So he is going to be a doctor sure \n\nBut he is still using products his girlfriend bought for her without her knowing and she asked him to cover some of the products since he uses them as much as she does witch is completely fair", "He *might* get a PhD, not that he is enrolled for one, and the salary potential for a PhD is not always great. My husband has a more advanced degree than I do but I still make 3-4x as much as he does. He pursued a passion and I respect that but he is not a high earner. She said nothing about her boyfriend's earning potential and he is a minimum of 5 years from attaining that while he lets a 24 year old support him financially at almost 30 years old.", "Wait a minute. He’s in a PhD program. Are you saying doctor as in formal title Dr. Jones with a PhD in history or a medical doctor.\n\nIt’s also not just bath products it’s the fact that they’ve already had one conversation in which OP already confronted him about using her things. OP is NTA for wanting someone to respect her things. \n\nIf he wants to use the same products as OP he should be contributing something to their costs. OP is probably running out of product twice as fast and its costing them money to replace those things. \n\nIt should come out of the joint acct since it’s something they’re both using. Or he should stop using OPs things. \n\nOP you’re NTA", "But bath products can be expensive. We don’t know how many products she’s talking about, or what they cost, but if it’s like a shower gel, body peeling, body lotion, face mask, face peeling, face wash, face cream, shampoo, conditioner, hair oil and he uses all of them daily (as she said) and they’re really expensive (as she said) that’s quite a lot of money.", ">FFS it’s bath product, learn to share with the person you supposedly love\n\nExactly! Jeez.", "Why doesn't he just pay something towards the bath products that they're both using? Instead of her paying for it all and him using it.", "Why doesn't he buy his own, cheaper, bath products then??", ">YTA. Are you going to fly first class while he's in coach, order steak when he gets the grilled cheese, drop in at the thrift store while you head to the mall? Why are earth are you living together?\n\nNothing more needs to be said here.", "Then why not share the expense since it is something they both use lol", "He obviously cares, considering he uses them but won't pay for them.", "you obviously don't buy $20 bath bombs", "Bruh ya reading into this as if she asked him to cover her nails not something they both use", "Then he should pay more for household expenses if she has to pay more luxuries.", "Doesn’t matter if she has half of her slavery for fun money if he wanna use products more expensive then what he can afford he should at least have asked", "And half of his salary is also “fun money”", "I never got mad at him for using them. I told him it’s totally fine as long as he asked and I let it go when he said he used them only a few times a month. I suggested the joint account thing AFTER he used the products without asking and AFTER I was running out of them very quickly.", "How is she cheap tho she pays more to joint expenses then him?????! Like the fuck", "Not buying something luxurious doesnt mean she is buying something cheap, she was ok with sharing once in a while, but if he drains her products, then why shouldnt they split their cost ?", "And how is OP paying for something they both use with her own money “teamwork”? They have a joint expense account, this is now a joint expense. Using that money to pay for it makes perfect sense.", "You should read the post.  Titles are usually misleading on AITA.  OP buys the products for herself.  She’s only asking the bf to pay half because he’s choosing to use her products instead of his own.  The bf wouldn’t need to pay if he stopped using them.", "Good point. As you say, if it were paid by the joint account he still wouldn't be paying half. He's being entitled beyond reason.", "Close; he would be paying 25%. She makes three times as much as him, they pay into the joint account proportionately. Let's say she earns 75k, that puts him @ 25k, for a total household income of 100k. \n\n50% goes into the joint acct. 12.5k from him, 37.5k from her.", "Thanks. Somehow my fingers typed the opposite of what my brain was thinking.", "Sorry. It was just a brain fart. I've fixed it now.", "I get that it's different.  My point is it's not that cut and dry.  If OP is this upset over body wash, what's next?  I brought home lobster for myself with my money, he's upset to eat Chef Boy R Dee.  We went on vacation and I upgraded my seat to first class from my money, he's upset to be in coach.  At Christmas we set a budget, but I decided to use my money to buy my dad a gold watch.  We got his dad a Timex.  Body wash is just the starting point.  We don't have enough information to know if OP is financially abusive or if bf is a moocher.  That's why I didn't vote.", "Yep! (Commenting so I can collect more downvotes...)", "Lmao thank you, sounds like they don't understand sharing groceries at all", "Pretty shitty \"partnership\" if you have to nickel-and-dime the damn soap. Just sayin'", "THIS. Very well said! \n\nNTA\n\nSo he doesn't want to use \"his hard-earned dollars\" to help cover the cost of something *he* is using? In what world does that make any economical sense? And for those saying \"it's just bath products,\" he clearly doesn't see the products as equal or he wouldn't be using up the good stuff.\n\nThe bigger issue is that OP brought up the issue with him, making it clear that she doesn't want him to use them (frequently), and he still hopped in the shower and went to town behind her back. Not cool. That does not show OP that he respects her or her money. Or frankly her time, because she planned and shopped for his stuff that is just sitting in there not being used.", "It’s not like a $10 body wash, the Barbara Sturm stuff is easily $90 and up, which is why he wants to use it and not have to contribute.", "SHE buys him products already.", "That was implied. Share the product and expense.", "Yeah, if she's like \"oh, he likes when I scratch his back, so now my nails are a joint expense!\" then she's out of line... but he is using the products daily on his body and wants her to foot the bill.", "But one cannot draw blood from a stone - OP has made it very clear that he doesn’t have money for these things. He clearly likes them, so he’d probably buy them if he could. I see your side, but if my partner is contributing to rent/their duties and I can totally afford a luxury for both of us that won’t put me out in any way, then I would do so. Sounds like OP can too. Wouldn’t you want your partner, who you’re intimate with, to be just as clean and nice smelling as you?", "People who are in a romantic relationship living together shouldn't have to ask. True love is sharing. If you can't share your bath products with someone you'll potentially spend the rest of your life with, that must be a sad relationship. \n\nBTW - I sure hope she doesn't have any slavery! Haha. I know you meant salary.", "exactly, you’re not saying he can’t use them or telling him to buy his own full skincare line, you’re just asking that if both of you are using something, you should both be paying for it.\n\nsounds like mr man is a bit insecure about making less money than his gf, though", "I agree with this. Though, reddit crowds don't tend to agree with pooling $$, ha! My comments throughout this thread are sure to be down voted.", "So you want her to pay 3/4 if expenses and also cover the rest of his nine joint expenses while he just gets to do whatever with it? Bruh \n\nA relationship is about being equal but he Dosent wanna contribute equally in this case", "Buy your own damn shampoo if you don't want to share expenses \n\nIt's not rocket science but logic does seem lost on you for sure", "If he can use her expensive bath products without asking, it's time for him to buy his own. Op needs to take a stand.", "The problem is that he's expecting her to pay for them for both of them because she earns more.", "So why is she the asshole when he won’t spilt expenses?", "But he doesn’t wanna pay for it at all tho \nThat’s the issue here", "Bro you need to re read the post", "Not if my partner used my expensive products without asking, or even letting me know until I notice I'm running out quicker. If he'd just asked to use them, then maybe I'd have some sympathy.", "Tell me you have never been in a relationship without telling me you have never been in a relationship.", "It’s not about the can’t share it’s about the fact he won’t help if he uses it everyday like her then it’s not just sharing with them it’s not yours if you only get half of something very expensive like bath products they can get expensive as holy water \n\nSo if he want to use it he should also think about the fact that it isn’t fair she should spent houndrds of dollars every 2 maybe 3 weeks on bath products that she migth not get more then half the use of \n\nSharing is fine but when your partner have asked you if you use it and you say yes sometimes then switched to everyday and it is something expensive it is not sharing because she didn’t know she was sharing he just did it", "huh? WTF are you talking about, nine joint accounts? \n\nAgain: OP posted about soap. I think this is evidence that their relationship issues go much deeper than some fancy bubbles in the bath.", "ha!! Yes, Division of Soapy Assets is an incredibly difficult logistical feat for me to decipher. Good thing you're smarter than I am. If I'm ever lost in the mental maze of petty household expense challenges, I'm glad I know who to contact.", "Yes I understand. But she's got a choice to either buy cheaper products to share or to pay for better products herself  and understand that her BF is going to use them. They share a household. You don't split hairs.", "I'm not a bro. Thanks.", "What??", "Molten brown soaps and dr Barbara is brands they are both extremely expensive and even for people make fuck all money it is a luxury not a yea this is just my soap situation like bruh look the brands up and you will think differently when you see the prices", "I buy expensive (for me) skin and hair care products for me. My wife and I have a similar financial situation to OP.\n\nMy wife, even though she loves my products and enjoys using them, has literally never done so without asking first. And not even because I ask that of her! I explicitly tell her that any product I leave in the bathroom she's welcome to use and she still asks!\n\nBecause she knows that I save up for restocking orders, she knows I pick the products out specifically for myself, and she respects that just because we are married doesn't actually mean everything each of us owns belongs to each other.\n\nWe have couple belongings and personal belongings, and neither of us would use the other's personal belongings without asking first. It has never caused any stress or anxiety for us to do this, and it has allowed each of us to feel confident that if we buy something special for ourselves as a treat that it will not immediately become family property.\n\nWhy is OPs only choice to either sacrifice her access to items that she values and pays for herself or start paying for a 2 person supply? OP didn't even ban her partner from using the items! Just asked that IF he was going to use them every single day, rather than every once in a while, he contribute at the usual percentage to their purchase as a shared family expense.", "\nOr the option that the boyfriend doesn’t use products he doesn’t contribute to. Sharing a household doesn’t mean sharing everything. People are allowed to be individuals with their own property.", "I bro everyone, its a french thing, sorry", "Do you know how expensive bath products can get especially if they are branded towards women?", "\\#1: you're obviously the OP, just using a different account\n\n\\#2: I use Clé de Peau \"bruh\" and I don't think any differently. It's soap. If you don't want your partner to use it, put it somewhere that's less convenient for them to use. \n\n\\#3: this relationship is doomed if you don't figure out how to deal with petty shit like soap", "Sure. But this relationship is doomed if they are fighting over shower gel.", "She makes 3 times as much, with 50% going into her fun money. She has a lot of fun money. It doesn't sound as if it'd hurt her to allow her bf to indulge in the luxury with her. They can rediscuss financials after he lands his higher paying job, if she wants to squabble over who pays for what. It's a laughing point for me that this is even an issue. That's my final stance on this matter :)", "So she has to basically has to provide for him just because they both use half their money on joint expenses plus so she already pays 3x more of everything jet she has to give up her spending money but he doesn’t had the roles been reversed here you would be calling her selfish for expecting him to pay", "😂😂😂😂 financially abusive because he can’t use your bath bombs 😂😂😂😂 dude actually got that out with a straight face?!?", "NTA and he is a big one for going to your friends.", "NTA, your boyfriend is behaving very very entitled.", "If your bf continues this route I’d separate ALL accounts and he can have his money and you can have yours. He doesn’t realize how sweet he has it right now and that’ll really rock his view on things", "You're NTA and don't let him manipulate you into feeling guilty. However, are you sure you want to continue? He sounds like he has a lot of resentment and insecurities that you make more than him, and it is only going to get worse.", "NTA for all the reasons everyone else has already stated. To add to that: I can’t believe he pulled the financial abuse card. If anything it’s him financially abusing you given you are already paying for the lions share of everything with the 50% income spilt AND you’re paying 2/3’s of of the total cost of his current bath products by buying them using the joint account even though you have to use your own money to buy your bathroom items. \nThe entire point of a joint account is fo pay for things you *jointly* use. Not to have your partner subsidise your personal use products. \n\nYou choosing to combine funds that way would be totally fine & quite sweet if he respected the sacrifice and appreciated that you’ve gone out of your way to ensure he is living a similar lifestyle to you, one that is above his own means. Him throwing all of that in your face though and accusing you of financial abuse is just f**ked up, is a huge red flag and really makes me question if his cushy life with you has got him *expecting* you to financially support him and feeling entitled to that support, rather than actually *appreciating* that support and being gracious like he should be.", "NTA. Lock 'em up and hide 'em. He's delusional if he thinks this is what financial abuse looks like.", "NTA and he’s the one financially abusing you lol", "NTA that's not financial abuse", "NTA \n\nBreak up with him.", "NTA. The fact that he thinks asking him to contribute to the cost of luxury products if he is using said products is “financial abuse” is the most ridiculous thing I’ve ever heard.\n\nIf I were in your shoes, I’d dump him. This is a drop in the bucket of what’s to come if you spend your life with him. It will be a never ending saga of him trying to gaslight you into being his sugar mama.", "NTA forever, what an entitled jerk he is", "NTA, and I think you are being too kind by not dumping him the moment he pulled that shit and claimed you were abusing him.  Let him find another person To mooch off of.", "Besides the fact that he’s being drama with “finically abusing” him, he went to to other people to try to pressure you into paying for it all. It’s so manipulative. NTA. He needs to stop being lame, apologize and buy some bath bombs.", "NTA. Does he not understand what *joint* means? Joint use means using the joint account. \n\nI don’t think he understand what financial abuse is either. If anything, he’s the one being a mooch.", "NTA. But why do you have joint savings when you aren't married? Stop giving boyfriends husband treatment.", "YTA sorta. First, as someone who has always made more money than any SO, there will be some inequality in how money is divvied up for personal expenses. Second, if you guys are living together, I suppose marriage would be in the future. This is a sure fire way for finances to become an issue in the marriage. You guys do you, but this seems like a strange hill to die on. I’m assuming you guys love each other, so why wouldn’t you want to share something that you both enjoy, if you have the financial means to make it happen, without it being a financial burden.\n\nLastly, if the sexes were reversed, I’m pretty sure that most folks would be saying you’re the ass. For those wanting to disagree, reverse the sexes and give it a good think.", "NTA", "I’m pretty sure one girl on here got a safe for some of her expensive products.", "NTA\n\nMy husband and I share finances across the board and I would still be upset if he used something I had gotten for myself. Because that's the bottom line. If you want to use someone else's stuff, you have to address that beforehand...not after you decide to help yourself to something that doesn't belong to you.", "NTA. If you weren’t using a joint account he may see the value of the products more clearly. You could remind him of all the things you do but for him (you mentioned gifts), but that this is your one personal thing and it’s special to you. I don’t think it’s unreasonable for him not to use your products. If you were feeling generous you could as a one-off get him his own set and then it’s his job to make it last and decide if he wants to buy his own when it runs out", "NTA. He should be stoked simply at the fact you are willing to put half of your paycheck into a joint account with a boyfriend of 1.5 years! I understand splitting joint expenses 50/50 (my fiancé and I do this and he makes 3X as much as I do) but you are going above and beyond. It is definitely not financial abuse, OP.", "The 50% of salary account seems problematic. Your half is clearly larger, so you already contribute more. What if you just matched his 50%?", "INFO: If you buy your products with your own money, why are you buying his with the joint money? Why isn't he buying his own with his own \"fun money\"?", "Nta", "NTA", "NTA your boyfriend needs to deal with his issues about not making as much money as you do. No matter what he says, there are I ternalized money issues there.", "NTA?\n\nMy husband began using my conditioner…and WAY too much at that.\n\nHe prefers my product to the shitty 2in1 he used his whole life, so now he also orders it when it’s running low and has learned how much to use to optimum effect.\n\nShared products are a shared resource/expense.\n\nIf he’s unhappy/unable to continue the 50/50 split that needs to be looked into, but he can’t arbitrarily pick and chose which luxuries or expenses he pays for while enjoying them all.", "Nta", "NTA. Bath products you both use are a joint expense. Don't let him manipulate you.", "NTA. If he uses these products all the time then the money should come from the joint account. And even then he'd get a super good deal, as he wouldn't be paying even half of the value of the products. \n\nThat said, there is also another option: there are things between \"luxury\" and \"drug store\". I personally find that, like many things, there is a big difference between budget, drug store and \"intermediate\" brands. But between intermediate and luxury, it's the law of diminishing returns. If you (singular) can afford to pay more for that little added value, that's your choice, but you're not required to subsidise his use of the products. \nOn the other hand, I'm pretty sure he can find something he likes in the \"midrange\" or even drug store price ranges. The brands I use the most are Body Shop and L'Occitane. They have good products and often have deals.", "NTA. It's a bit rich for him to accuse you of abuse when he refuses to respect your perfectly reasonable boundary. Using something that you have bought for yourself alone and then calling abuse when you ask him to respect those boundaries would warrant serious thought if it were me. Your solution of paying for them out of the joint account is eminently reasonable if he wishes to continue to use them - especially considering your contribution would still be greater.\n\nI think maybe the disparity in your incomes might be a bigger problem than he thought it would be and you guys need to have a serious talk.", "NTA.\nThis isn't good because it probably isn't just about some bathproducts. The two of you should have a talk about money and if he really feels comfortable with this situation.", ">Barbara Strum\n\nOh HELL NO. Absolutely NTA. The lengths I have gone to just get samples, how dare he. He’s a mooch.", "NTA. Also, bringing outsiders into couple's issues is immature and stupid.", "Why do you guys have a joint savings? Just curious… I get the joint account for bills, but lost on joint savings.", "NTA if you're both using it but just because you make more an hour why would you not have have to help in the house too?", "NTA.", "NTA.  He wants to use you products for free, which is inappropriate. If they’re now for the household, they become an extra joint expense. Screaming “financial abuse” makes it seem like he’s insecure about the fact that you make more. I’d keep a watch out for that type of language in future as it could be a red flag.", "NTA if everyone is using the bath products, that's a joint expense.\n\nYou make more money so you buy yourself nicer, more expensive things. If your BF wants to continue using those products, he needs to pay to do so.\n\nYour BF is selfish \n\nI also don't know why you agreed to put 50% of your salary into a joint account. At best, it should be a set amount but that's a discussion for another time.", "NTA\n\nYou each contribute 50% of your earnings to the shared account. \n\nThat’s fair. If you earn $2000 a pay you contribute $1000, and if bf earns $500 a pay then he contributes $250. That’s a fair way to do things. \n\nYou have your personal money. The things you each buy with your personal money are individual purchases and NOT shared purchases. Your products are yours and he is stealing them. You proposed putting their cost into the shared account - if it’s a shared resource then that is where it belongs. Now he’s freaking out? \n\nNo. He doesn’t get to freak out. Either he stops using them, and you pay with your own money. If he does use them, take the money out of the account retroactively and pay yourself.", "NTA he financially abused himself by choosing to go into a low paying field.", "I had to re-read your joint account payments. You are already paying more toward the house hold account then he is. Logically then, if he wants to use your luxury products, they start coming out of the joint bank account. \n\nNTA", "NTA but his reaction/tantrum belies a more significant issue. I would be very very cautious about moving forward with him. This financial imbalance will NEVER improve with what he’s choosing career wise. You’ll always be paying more of the bills and carrying the financial burden which isn’t necessarily a bad/negative thing BUT how he’s behaving is a huge 🚩🚩 imo. What if y’all have kids? \n\nHe sounds like a piece of work. “Financial abuse” yeah maybe from HIM. Your friends who think he’s right aren’t very smart either. So where does it end? You pay for high quality bath products which he demands to use but not financially contribute is just the beginning. He sounds very entitled and selfish. Good luck!", "The use of the bath products is a red herring.  Your boyfriend lies when confronted with his misbehavior and then trolls for votes with other people to manipulate you.  THAT’s the real problem and should be a dealbreaker.\n\nNTA", "NTA he should be paying for products he uses. It is kind of you to subsidize his lifestyle especially so early in the relationship.\n\nAlso, you just reminded me to put fiery pink pepper on my Christmas wish list!", "NTA him telling you that you are financially abusing him is unforgivable.\n\nHim telling  your friends is a betrayal", "Nta but this isn’t about bath products. Op knows she’s always going to make more. Bf wants her to subsidize more of his lifestyle. It’s up to OP to decide what she’s comfortable with.", "NTA Not sure why he had a tantrum over paying for things the household uses out of the household account. Especially since he wasn't asked to not use the products or contribute more to the account. And then treating an argument as of it's a group discussion with friends 🤢🤢 Strangers online is one thing, we'll never even know who you are. But people you regularly spend time with will think about that every time it seems as if there may be an issue with the couple", "NTA \nNext he's going to want you to fund his extravagant christmass (since Halloween is over)  that he's always dreamed about ,then demand you leave the house for the night because you dint use all your money to bull all the deco he needed.", "You need to change those numbers. 50/50 isnt fair when you make so much more. Percentage of income is a much fairer way to things. NTA for being annoyed that he used your stuff.", "NTA. If he can't afford something he shouldn't be using it. He's got basic products-he can use those. It's not as if you're eating fillet steak and he's living on ramen.", "Slightly off topic here, but have you read the ingredient list on the Molton Brown products?  Not the healthiest, imho.  Dr. Barbara Strum looks better.\n\nRegarding your question, you are NTA.  Those purchases should come out of your joint account if you’re both using them.  Your Phd guy sounds entitled and whiny.", "NTA and I can't understand how anyone would think otherwise. \nOf only one person uses something, they pay for it themselves.\nIf it is something everyone in the household uses, it comes from the household budget.\nIt isn't that hard.", "NTA.\nHe started using your stuff everyday without your permission? \n\nI also started making my partner pay for half my hair care stuff (he was using that 3 in 1 stuff) because he really liked how his hair felt/how he smelled after using my stuff.\nIf you use it, you should be financially contributing towards it.", "NTA and your BF is as immature as they come. Why is the word \"abuse\" thrown around when a selfish AH doen't get his way? Seriously. \n\nIt's up to you if you want to put up with his ego, but I certainly wouldn't. And it's not just bath products. It will be food, car, savings, anything. And every time you draw boundaries, Mr Toddler WILL CALL YOUR FRIENDS TO WHINE. Over him using your stuff and not wanting to contribute. Who does that? AHs do.", "Oof solid NTA", "NTA. If he can’t afford to replace an item, he shouldn’t use it. He’s bitter that you have more money, and wants to take advantage. This requires at minimum, a serious discussion about your finances. You may want to consider separating them completely, if he has this  “what’s yours is mine, and what’s mine is mine” attitude.", "NTA. He’s closer to being financially abusive to you than the other way around", "NTA he is a finacial abuser. He knew joint account for joint expenses and tried to cheat you. Dude stole from you knowingly. Leave now. It only gets worse. I have been there.", "I get so confused about these AITA posts sometimes - is your relationship always this transactional? Unless he is showing a pattern of this type of behavior (using your stuff and then insisting you pay for it), what’s the actual harm in allowing him to use your expensive soap if you can easily afford it? It’s up to you, of course, but it seems like a lot of couples with this financial set up end up nickling and diming each other, which sounds exhausting", "NTA\n\nNo offense OP but you are buying products that are not worth the price. Do your bank account a favor and do some research on better products for much less. No hate, just being practical  :)", "NTA! The brands you mention are super expensive! He’s totally taking advantage of you in this! It’ll start from simple things like bath products. But if you were indulging in some other luxury items, I bet he would find a way to victimise himself crying ‘financial abuse’ just to use those as well.", "This exact post was posted a while back… you didn’t like the answer you got? Because everyone agreed you weren’t the asshole back then. What gives OP?", "NTA. Either they’re just yours, and you pay for them yourself or you both partake and you both help pay. He’s going way overboard by accusing financial abuse.  This is simple math.", "NTA. You are supporting this guy, and he's making you feel guilty so you keep doing it. Great manipulation on his part. Don't feel bad for telling him no, and locking up your good stuff in a safe in the bathroom. (Former reddit story!) You can't financially abuse him because you don't control his money, so let him and his uneducated friends know what that big word means before they call you that. I'm kinda hoping you grow away from him and find someone more mature cuz he seems to be regressing... Good luck OP!!", "Why would you care though if you can easily afford it and love this guy?  YTA", "NTA. I thought he was a small ah for using your bath products. But the fact that he doubled down on not contributing anything towards the products, called it financial abuse and ran to tell all your friends puts him in solid, asshole territory.", "NTA. My wife and I have a rule that we don't use products (or eat food) specifically bought for and loved by one person, without their permission. We make plenty of money to afford what we want, but it's really just respect and courtesy you're talking about. If we went to the store and she said \"Oooh, muffins! Breakfast will be good this week!\" and I stayed silent, and then ate some without her permission, I've messed up her breakfast plans and upended her expectations.\n\nThat said, I do have what might be a contentious belief: I don't think your present plan is viable for a marriage. Were you ever to marry, you should take half the money you each earn, and put it into one account for bills, and then consider some more nuanced plan for a little more even distribution of discretionary funds. It doesn't need to be 50/50 because one of you isn't working as the stay-at-home spouse (taking on 100% of the domestic responsibilities with consent of both parties). But, I think it should be altered to some extent if there's a wildly different income amount between married parties.", "NTA but why do you have a joint account if you’re not married/engaged/only been together for 1.5 years? Seems odd to me. Protect your money, girl.", "Yta. You're creating financial leverage over him, and flexing it on him.  You're too immature and materialistic to be in a relationship.", "NTA.\nYou have a fair financial split right now. He wants you to further subsidize him. You refusing isn't financial abuse, him trying to mooch is *him* attempting to financially gouge you.\n\nAlso, not for nothing, but he's a bf of less than 2 years, not a husband or long established life partner. You don't owe him financial support.", "NTA. Everything you have done here sounds reasonable. If you spent your personal money on something you want to enjoy and he’s now using a lot of it, he should contribute as well.", "So because you have the ability to buy it easier than he can but he wants to use it you should just get it for him? That’s super entitled. NTA. Why is he deciding your personal finances when y’all have it separate. If y’all are both going to use it equally then you both pay half. If it’s from the joint account he’ll only pay the percentage of what he puts in compared to yours.", "NTA. It would be nice if you shared the products because it seems that he likes them. Obviously that’s up to you.", "NTA he's using half, he should pay for half. If he can't afford to chip in, he can't afford to use them.", "ESH. It’s not financial abuse.  That is absurd.  It’s also reasonable to each pay a percentage. But it’s usually kind of obnoxious for one partner to be able to have nicer things than than the other partner.", "I could swear I saw this post, word for word, about a year ago. I was surprised to see this was AITA and not Best of Reddit.", "A relationship is a financial bond as well. How can you enjoy your fun money if your partner can't afford to participate? Times can change you know. YTA.", "NTA\n\nBut I don't see why you made a thing of this. \n\nIt's agreed you but the groceries from the joint account\n\nToiletries are part of the grocery shop\n\nYou are both using these products\n\nSo just buy them as you do all the groceries. You don't explicitly say \"this nice ingredient is paid for from the joint account. \"", "NTA but it's another example of the statement proving to be true: You never really know someone until you see how they react when told NO.\n\nYou told him NO on one reasonable point and not only did he have a meltdown, he got other people involved in something that's between two adults in a closed relationship. Fuck that. Is that reasonable? Is that rational, acceptable or in anyway a tolerable way to react to a perfectly normal boundary on a person's luxury items?\n\nWhy would you sign yourself up to a lifetime of this? This Iss who he is", "It would be weird if he ASKED to use them once and you reacted by making him pay for it - nickel and diming your SO is weird. But he’s using your special items frequently and without asking, so NTA", "Let us flip this around. Suppose you were making less and he was making more would you feel this was right ? \n\nYTA.\n\nI  can say this cos at one point my other half was the bread winner I studied and applied and studied and applied with no result. Then the lucky break came all the hard work is paying off I pull in like 5 figures a month. Who the fuck am I to say to this partner that was there when I was broke AF that she can't drink the 100 dollar bottle of whiskey ? Or that I now need to ensure she pays her share of the rent when she had to work herself into the ground while I was studying and applying without luck ? \n\nI love this person I would live the way I live whether she is there or not. I can afford it. No use being a separate entity financially unless you are actually planning on being single. It especially sucks if the other person is doing thier best and because you can afford it you want to live better in the same place but not with them. Either he is your partner or not . No buts.\n\nEdit: I'll take the down votes but before you do flip the situation around. Would you like it done to you if you were in the financially lesser position. \nI'm not saying he has rights to her money but if she is going to spend it then she should be prepared to spend for 2.", "Beyond being AH or not, can't you see how hurtful for you boyfriend that you use expensive products and he uses cheap ones?", "ESH\n\nI take daily baths for stress relief. I buy interesting and varied products for the bath. And if my spouse wants to use them, fine. But the nicer stuff, I keep separate since he doesn't know or care what he is using. \n\nYou should share because you are kind but he should have limits on what nice stuff he can use. \n\nBut if you plan on getting married, sort this yours/mine thing out now\n\n(And stop buying bath bombs. They are way too expensive for what they are.)", "NTA but ya both need to sit down and decide a better way to split costs. This is not working.\n\nMy wife and I dont mix our money. No joint account either. We also never fight over money. So what needs to happen here is that you two sit down and figure it all out and see if there is a way forward.\n\nYou seem to be ok with him not making as much. Not sure if it has fully sunk in how much disparity there is in your salaries even when he is properly employed. Some people have 0 issue and dont mind either not being able to partake because they cant afford it or knowing they will have to sacrifice to partake in things if they want higher ticket items.\n\nHe may be thinking that since you are putting 50% into the joint that you are open to sharing so much more of your money with him and getting that wake up call that you are sorta ok with it made him realize that he does not have access to those kinds of funds. You dont seem to mind sharing but feel since its a shared item it needs to be purchased from the shared account. Makes sense. Him using your high end bath bomb is something that needs to be addressed.  If anything in the home is fair game in his mind, then you dont have his and hers and only have OURs. Time to address that too.", "For real. I wish people would stop claiming abuse either to try to change someone’s behaviour or because they’re so up their ass about what actual abuse is that they go around claiming it when someone sneezes. \n\nHe wants nice things but doesn’t earn enough to afford them. His girlfriend earns enough that she can have those things. In their joint account, they have enough money that they can buy those things for them both to use but it will have an impact on their joint savings. So his conclusion is that his girlfriend owes it to him to use her money to buy the nice things because she shouldn’t have them if he can’t. What a baby. OP is obvs NTA.", "And who in their right mind gets their friends involved in a personal dispute about finances, let alone where they are weighing in on Bathgate. \n\nYou don't pay, you don't play.", "If OP is feeling super petty, get a locked cabinet in the bathroom that only they have they code to. Put your molton brown in there, use when you shower, put it away when you're done. \n\nThen you're not \"financially abusing\" him, you're just ensuring that things you pay for with YOUR money stay YOURS.", "> My boyfriend is looking for his phd in a field with very limited opportunities (like archeology) whereas I work in a very high demand field (think AI)\n\nOP, you should seriously think about this relationship.  A marriage is a financial partnership as well as an emotional and sexual partnership.  Dude basically volunteered to be broke his whole life and have no job opportunities, and is demanding you subsidize his life.  And is pitching tantrums about his self-chosen financial limitations already.\n\nAt bare minimum, you *need* an iron-clad prenup.\n\nIt would be one thing if he accepted the financial implications of his chosen career.  But this sure doesn't look like that.  And \"financial abuse\" :rolleyes:  He just wants nice things without making the choices that provide nice things.\n\nedit: and he's likely going to expect you to damage your own career, so he can move around the world to like the 3 job openings per annum for someone with a phd in a field like archeology.  And most likely will just be an adjunct professor who will never have a real job.  Think very hard about this.", "Nta, this sums it up nicely. He also really shouldn't be tossing around financial abuse like that. It is a serious acusation, and he is TA just for using to describe his tantrum. These are not necessities and are luxuries. Plus, these are personal goods that make YOU feel good. They are very much bought just for you. Instead of making it about switching it to a joint expense, tell him to keep on NOT using your stuff. You bought it for you. It is yours. He is not to touch. Play stupid games, win stupid prizes.", "Not even half,  she is asking him to pay a quarter.", "THIS RIGHT HERE. I really don't understand why this is even an issue.  If they both are jointly using these products regularly, they become regular household items that should come out of the joint account. Am I missing something here? Seems to me like BF wants to have his cake and eat it too. SMH. NTA", "It's also super crazy that he got their friends involved ABOUT BATH PRODUCTS.  That is really manipulative and immature.", "Yeah, I feel like one of 2 things is going on here...\n\nA) OP is being very reasonable and boyfriend is a User In Training, aka training OP to let him use her forever,- and the body wash is him putting his toe over the line to see what he can get.  In which case it will only get worse and OP need to hold the line HARD!\n\nB) Boyfriend is otherwise a decent person, but in his current job search is having serious feelings of inferiority or insecurity, etc, and unconsciously is trying to \"test\" OP with stupid little shit like the body wash.  In which case this petty stuff with continue unless boyfriend and OP can have a real heart to heart about what their future is going to look like.  \n\nApplying and being turned down for jobs can really do a number on someone's self-esteem, and the boyfriend may just be over-reacting to the implication that OP doesn't think he is \"worth\" the expensive body wash.\n\nOf course that's not at all what's she's actually saying, she would still be massively subsidizing his body wash usage if it was paid from the joint account, but BF is too far up his ass to really listen.\n\nSo, there's a chance this can be worked out by getting to the real issue, if BF is otherwise a great guy, just having some big emotions right now.  BUT there's also the chance this is step one towards BF manipulating OP.\n\nHow exactly all the friends got involved would be something I would want to know more about, because if BF can't understand that these things need to be talked out INSIDE a relationship, not outside, than that's another major issue to deal with!\n\nI would suggest OP sit down and and run through the finances with her BF.  They should discuss what is currently paid from the joint, how much money that looks like, how much is currently being saved, and what the numbers would look like if most of the bath products were paid jointly, as well as assess if there's anything else they are currently paying independently that should also be moved to the joint category...  just a full review of their financial situation!\n\nThey can discuss savings goals for the next few years, what they see their daily lives looking like (work schedules, vacation time, etc)...  at 1.5 years it's a good time to work out the financial 5 year plan!  Then OP can see if their futures really align, and if the boyfriend is capable of being on the same page or not.", "Its not just unreasonable, its gaslighting.", "Nta He did lie until confronted with evidence.  What else is he hiding?\n\nChipping in a fraction for stuff that's common use is fair. Check that your paperwork and personal account info is locked up and passworded. \n\nWatch for other stuff and behaviors for entitlement, gaslighting or guilt trips. Watch for passive aggressive behavior or first.\n\nHe bruised trust and it needs time to repair.", "Yep...if anything, he would be the one financially abusing her since he is trying to guilt her into paying 100% of the cost for him to have expensive products, whereas the agreement was that she would pay for half of his normal products...\n\n\"It's financial abuse if you don't treat me like your sugar baby\"\n\n?????", "He probably won’t even make as much as her after he gets his PhD related job.", "I’m gonna make lots of assumptions here. Dude is getting a useless PhD (and I KNOW, holding a PhD in history) because it’s his interest, got himself a high-flying girlfriend and is now hoping she will subsidize him for years to come. Freaking out about bath products because he now has to pay a small percentage of the price?? \n\nIt’s a bit late now for “sitting down and talking”. He sees her as an ATM, he thinks what’s hers is also his without making an effort. NTA but girl run", "I actually was financially abused, for years. It was a humiliating, scary, desperate place to be. I was blocked from having any financial access to anything, even a few dollars in cash, had to ask permission for SuperCuts haircuts once a year, was routinely berated or woken up to go over credit card bills line by line, etc. I was completely controlled because without money I couldn't do anything.\n\nTo see someone claim financial abuse because they can't have Molton Brown soap purchased for them is insulting.", "I hadn't heard of that brand,  looked it up. My lort- I'd be pissed too. 900$ for serum!! Also- I wish I could afford it and give it a go", "😂😂And some of their friends actually AGREED🙄🙄!!", "Yep. Based on her edit, she will always be out earning him and he sounds like he wants to live off her money. This will be your life OP. \nI would dump him just for calling out the flying monkeys.", "Since my products are definitely a luxury and can be very expensive, I try not to overuse them. If I’m taking a second shower on the same day I’ll use the less expensive products. That’s why I buy them using the shared account as I also use them sometimes.", "She doesn't mind him using them, she just thinks it's fair to buy them from the joint account, like part of the grocery list, and that makes total sense.", ">you for being selfish and cheap.\n\nHave you seen OPs update? \n\nAn example: Even a 100ml anti aging serum costs 800€. \n\nI wouldn't call that cheap.", "Gag. Can't we please retire that silly and over used cliche?", "The products cost several hundred dollars. \n\nFor example: \n\nThe brand OP uses sells 100ml anti aging serum for 800€/$800.", "The products OP buys cost several hundred dollars. No one needs these products. \n\nOP even buys less expensive products for him.", "He's a grown man. He can shop for the mid-range bath products if he wants them. OP can still have her fancy stuff in her personal expenditures.", "For real. I have a friend in his 50's with a PhD in a similar field. He still lives with his parents because he HAS to - he's never made enough money at his profession to afford a place of his own. This guy has written papers, applies everywhere but never gets anything above adjunct. It's sad.", "This is it. Time to discuss this financial setup with him. He's not as ok with it in practice as he may have been in theory.", "Yeah, don't involve mutual friends in financial or personal things like this. She already contributes three times the money, she IS thinking of him.", "Not a snowflake’s chance in hell. Archeology? Absolutely not.", "Yes, my ex did the same. Crying “financial abuse” every time I did not 100% fund his every passing fancy", "This would be fine if they were roommates. I can't imagine being this petty with a partner.", "Yea not quite the same but my brother has a masters, but it’s a niche art one and I make more than he does without the degree for my field. The only reason he makes as much as he does is because our dad helped him become a partner at an art studio by giving them money.", "And OP didn't even get mad, she just said she'll start buying them from the joint account, which makes sense.", "NTA. I think it's totally fair. If you're both using them, you both should be paying for them.", "Sooo OP you should realize that your relationship is not gonna last long as your bf is insecure and manipulative.\n\n1. He accused you of financial abuse as a manipulative tactic\n2. He brought his friends into your relationship to guilt you into caving.  (that alone is a deal breaker for me)\n\nDon't think for one second that this problem won't pop up again and again.", "I.e. a luxury. So you are saying ok it's OK for me since I can afford it but as my partner you can't so here is something  of lesser value for you. I think I get the jist of it.", "Glad you did this illustration. It is fair for OP to pay more for household expenses - but they should rethink both putting in half of their income.", "r/theydidthemath\n\nEdit: there was a \"t\" instead of \"r\" - context for the comments", "I blame the microplastics.", "All she is asking for is this to be paid out of their joint account. How could that *possibly* be spun into financial abuse. If he was a SAHD then I think your point would be more valid. But he has money and they have shared expenses. Your examples and scenarios don’t really make sense to me as actual issues. Are you arguing that spouses shouldn’t be allowed personal money and it always needs to be joint? Your examples indicate that if one spouse has a higher discretionary income they should not ever spend it on fancier this than the other spouse. Is that your point?", "But these are unrelated to the question at hand. It does seem like they need to have an earnest conversation though, and talk through *why* the bf thinks she's being financially abusive. Maybe he's being a gaslighting AH or maybe OP does some things that make him feel financially unsafe or maybe he just threw that out in the heat of the moment.\n\nLike I get what you are going after here, and maybe it'll turn out your guesses describe OP's behavior, but imo nothing at the moment points to that.", "If I was in his situation, I would ask my partner before using her expensive products. Not use them, and never bring it up until she notices she's out quicker than usual. He does not respect her at all.", "Nepotism. Disgusting.", "Then your partner needs to voice that they feel lesser and you need to assure them they aren’t but \n\nLet’s say your partner uses your car and the fuel tank was full when he started and after he stops it’s half full and he doesn’t wanna pay for it and we are talking the expensive gas here \n\nThat gas is still less expensive then a single 100 ml bottle of dr barbar shrum you could pay for a months of gas for a family with the money these products costs for a single person for 2 weeks", ":) I'm a retired accountant, I couldn't help myself.\n\nIf the joint account covers rent, utilities, insurance, gas & maintenance for the car(s), vacation, dining out as a couple, 50% could be reasonable. I'd like to see lower earner have more available for savings/investments, but of course we don't know the actual incomes.", "Ha!", "That’s legit: I would be upset, too,  if they totally didn’t ask. OP’s partner wasn’t upfront about using their stuff nor when they escalated their use. That’s dishonest, but I feel like the root of the problem is OP’s partners clear feelings of inadequacy. They alleged financial abuse, which could be exaggerated and baseless, but at a minimum shows me that they need to reevaluate their agreements and situation. OP’s partner could be the manipulative, problematic one, but I still empathize with feelings inadequate and jealous of OP’s income. Y’all don’t like my take, but if it was me, I wouldn’t die on this hill and I’d want my partner to pamper themselves within reason", "You got “smarter then me” part right", "That's your idea of a zinger? You must be so proud.", "Lol I wish I was her lol I’m a broke 18 year old lol\nPlus it’s not a soap alone it’s like a 100ml bottle of serum for 800-1600 dollars alone", "Nah just starting the fact you said yourself\nAnd hey it’s not a zinger if it’s true right?", "No it’s doomed because one partner doesn’t want to equally to his share of expenses. We’re taking about thousands of dollars worth of “shower gel.”", "There ya go. That was a little better. \n\nConsidering you're a broke 18 year old, I'll give you props for confidence with zero attempt to tear you down. Keep striving toward greatness!", "She makes three times as much money. They have agreed to share 50% of their incomes. And they are fighting about shower gel.", "Bruh ya need a life lol my age didn’t make me dummer but yours hasn’t made you wiser either", "NTA what a manipulative dick.", "NTA it's not abusive to just buy the item you both like using from the joint account rather than personal and stop getting the cheaper stuff.  He wants you to pay more than your share for hus indulgence he us the one trying to be financially abusive if anyone is", "Financial abuse, over skin products? His skin is as thin as it is soft. Hey Zeus. Wait til she lets him go, the abuse of every day financial life will really get him a new perspective. NTA.", "Oof, drop this manipulative man like a hot potato. \n\n1) Using the term \"financial abuse\" in this situation is infuriating, especially when there are so many posts on this sub from sweet people who don't understand that they actually are being financially abused.\n2) Getting his friends involved. Over BATH PRODUCTS!\n3) Using your stuff without your permission.\n4) Using it MORE after you had a discussion with him that it was ok if it was just occasional.\n\nThese things might seem small on the surface or individually, but together, they create a picture of a selfish, whiny manipulator. Things will only escalate, especially if things get more serious.\n\nETA: NTA", "NTA, It's very simple right? Private use -> private account, joint use, joint account. Maybe he can ask some for his birthday is he doesn't want to pay for it?", "NTA. If he expects you to share these things, then it should be paid for from the shared account. For anything that can't be shared (like bath bombs), if he wants to use them then he should be paying for them. He isn't entitled to expensive items just because you bought them and he likes them, or because you make more money and can afford to buy them for him.", "NTA\n\nYour boyfriend accusing you of financial abuse is outrageous and he should not have jumped to that accusation. That's way out of line.\n\nYou being able to afford luxury that he cannot is no one's fault but his own. He makes his own choices like a big boy, and he can buy his own damn body wash like one too. \n\nYou deserve to use your money for you. Him being financially dependent on you is going to give him a doorway to exploit you for money by guilt tripping you or pulling the \"financial abuse\" card like he already has. \n\nHe sounds like leech. Don't let him ride on your coat-tails and slow you down.\n\nEdit: Me and my partner have been together for 2 years and we have our own separate accounts with our own separate money. We buy things for ourselves and for each other because being financially responsible together is easier than most people make it. Getting a joint account with someone you aren't married to is the worst decision anyone can make. I will never have a joint account with anyone. It just causes problems.", "NTA\n\nHe has made *your* products into a *joint* purchase, so the money comes from the joint account.\n\nIf he doesn’t want to pay for the products, he can use the less expensive ones, that you also pay for.", "NTA . If he’s using those products it’s only fair he pays his half. I wish people won’t throw the word abuse around. Disrespectful to people that are actually in abusive situations/relations.", "NTA. Paying for household products you both use from the joint account is not financial abuse. You were already being generous by buying cheaper products exclusively for his use out of the joint account.\n\nHaving said that, the bath products aren't the real issue here. The two of you need to sit down and have a serious conversation. It sounds like he is feeling bad about the fact that you make significantly more than he does. It sounds like even after he finds full time work in his field you'll still make significantly more than him so you need to sort this out now or it will continue to be a problem.", "NTA but I feel this is more than a bath product issue... Although as someone who also uses expensive products, that would annoy me to no end. It sounds like you two might need to reevaluate your financial arrangement. He seems to think the current agreement isn't fair. Would you be okay with contributing more to the shared account? (It's okay if the answer is no - I probably wouldn't.) IMO you are already being kind and subsidizing a higher quality of life for him. Perhaps instead of volunteering at the university, he should get a paying side job. I feel like what he's doing is (lightly) stealing from you since he lied about it, and I find that super weird. He could have asked you. Accusing you of financial abuse is uncalled for and seems like a red flag. Discussion is needed.\n\nETA: I like a lot of things I don't feel I can afford and so don't get. I love new clothes, I love eating out, I love new tech. I don't buy these things constantly because my income wouldn't allow me to do that and save. It's not that hard.", "Have you told him you would prefer to eat at a fine dining restaurant every day but you can’t afford it, so you don’t.  You also ask permission to use other people’s possessions.", "Why are you with him?", "NTA, this is what me and my husband did, I used more expensive shampoos than my husband. Since they were more expensive I would buy that with my money. My husband ran out of his one day and used mine, no big deal but he ended up really liking it. So what happened is that we started buying a bigger bottle of it to share and it came out of our joint expenses. I would have a talk with ur bf and ask wtf is going on in his head, maybe he's growing resentful that you make more. idk", "Why do be people get joint accounts with bf/gf??", "NTA it’s not like you are expecting him to use dawn, or Irish spring. He is still getting a good deal if the cost are split.", "NTA. \n\nIf he wants to use expensive bath products he can buy them. \n\nExpect him to move on once he gets that position and starts making money on his own. He’s using you.", "He's \"stopped using them in protest\"? 🤣🤣 You win.\n\nNTA", "NTA but I wouldn’t be so generous with my money on just a bf when he’s this selfish and entitled. Is this really the dynamic you want for your relationship? Throw this one back…imagine how good it would feel to be in a partnership and not just paying the majority for a grown man to live comfortably..", "NAH because you guys decided how you were going to split bills and your logic is consistent with that. I don’t necessarily agree with you. I make more than my husband, we have separate finances and I don’t think twice when he uses any of the things I buy that are more expensive. It just seems a little petty to me and seems to bother him so why make it into an issue? You are running out faster, but if you stopped buying all the cheaper products you used to buy and started putting that money towards them too would it offset the cost from your personal account? You said you are just running out faster, is this really that inconvenient for you?", "He is projecting. He is the one finacially abusing you.", "[removed]", "NTA, you use the joint account for stuff you are both using", "NTA. I feel like you should phrase it differently maybe? If you’re using your joint account then it shouldn’t be a problem. You’re still technically paying for 3/4ths of it.\n\nIt sounds like your boyfriend is insecure about the situation.", "OP is clearly NTA.", "Buy the Barbara Sturm V wash for vaginas and bathe in it. That will stop him cold.", "him lying about it and using your stuff without asking or anything is a red flag, and so is freaking out when you suggest it be a joint purchase.", "NTA - I'm guessing that the bath products aren't the only place he thinks you should be spending your money on him. He agreed with his face that it was okay you'd have things he couldn't have, financially,  but his actions say he doesn't feel that way.", "NTA. He shouldn't be stealing from you if he doesn't want to pay you back.", "NTA but red flags from SO.  This is only the beginning of financial bs.", "NTA. Put 'ol boy out to pasture. Plenty of PHDs  in the sea.", "NTA \n\nHe’s being disrespectful", "NTA. Give him a gift basket of the expensive products for his birthday or Christmas.", "Okay, I admit I did some math. Currently, the joint account is paying for his bath products. If you’re getting the cheapest possible without being useless, you’re likely spending $5 on an item like body wash. That means with him putting in 25% of the overall budget, he’s “paying” $1.25 for that bottle. \n\nNow, you referenced a couple of brands. Milton Brown’s body washes are around $35. For a bottle like that, he’d be “paying” $8.75. If that kind of amount breaks the bank for him, then he needs to find a better job immediately, without seeking his dream job. \n\nI doubt that you’re having to buy every item each month, so these products are likely something like $50-75 of the overall budget. That’s not financial abuse and if he likes the products, then why pitch a fight? Since it’s so low stakes, I’d consider this a big issue that he’s throwing such a hard fit. Consider it a big red flag for future finances. \n\nI would keep the stuff that you buy specifically for you in your budget but also express to him that this basket/cupboard/stocking from Christmas is for you and you alone because they’re treats for you and you will be expecting him to ask about using them before using them and to replace things he uses. He’s welcome to make his own little collection of stuff and you’d be happy to help him find things he likes based on the stuff you like. Maybe he decides to go with a different brand that’s cheaper, and you can help him out with that so that he finds similar things. \n\nBut I think the biggest thing would be to write down what gets bought when (if you share them from now on) and show him how much it really is each month and how much of “his” money would go to it. Asking him to pay 25% of a product he uses is not a big ask. \n\nThough he should be paying 100% of that bath bomb, I get the possessiveness there. NTA", "NTA - If he didn’t like the items you were purchasing, he could have just told you instead of using yours? You’re doing him a favor by buying them for him at all. Even from your joint account. It’s still emotional labor to do the shopping. So, honestly… he can be an adult, buy his own bath products, and not expect you to pay the difference.", "NTA.", "No you’re not the asshole. While it may cut more of a hole through the joint account you will also not be buying extra products for him. Though if you’re both using it — it’s no longer a your product or his it becomes a house product so the house should pay for it. It’s one thing for him not to pay it when it was for you and mostly used by you (as you didn’t mind the few times a month) but it’s just like pitching into the internet bill or cable. Everyone uses it everyone pays.) it does make sense. And just cause you have more fun money means nothing you still contribute equal amounts", "nta you don't just use other peoples shit without asking and offering to replace", "Nta", "I think you guys need to seriously think through your relationship.  \"Score-keeping\" with money is not a good sign.\n\nLet's say he graduates, gets a job, and you guys want to buy a house.  You can afford this semi-mansion in this expensive neighborhood.  He can afford this cute, comfy starter home in a middle-class neighborhood.  One of you will end up resenting the other no matter what you choose.\n\nWith such a big discrepancy in y'alls earning potential, trying to keep separate finances will only make him resent that you are his partner, but living so much larger than he.", "Barbara Sturm?! Yeah, that stuff isn't cheap by any means. It's weird that he even wants to use those products and somehow thinks he's entitled. My husband wouldn't be caught dead touching my skin products. But he also nearly has a heart attack when he finds out what they cost...lol. NTA.", "NTA. If he wants to use those expensive products then he needs to shell out money aka it comes from the joint since you BOTH use it. Barbara Strum is expensive! My eye twitched when I let my cousin use my Tatcha and that stuff costs 3x less than Barbara Strum and I love my cousin to pieces and would give her whatever. \nFinancial abuse my ass. You didn’t even make him pay some of it from his personal after he had been using it for a while and you had been paying for it. If he doesn’t want to pay his part then he doesn’t get to use it, end of story.", "Nta, it makes sense you use the joint account for things you both use, that same joint account that you put more money into anyway. That is not financial abuse. I bet if you did a break down of what his income covered compared to what yours covered he would have a lot less to say.", "NTA. He should be ashamed for suggesting this is financial abuse. That shit ruins lives and is just as serious as any other kind of abuse, he's just upset that he can't get another thing for free.", "Accusing you of abuse over this is a very big red flag.  The type of partner that wpuld throw that out there to get his way.....well, how could you ever truly trust him?  NTA.", "It started horrible, but was relatable at the end. Good relief", "Um. This isn’t about bath products.\n\nIt’s about the agreements between the two of you on where money comes from and what it should get spent on. It may be hard to live on top of each other and for him to see you having three times as much for fun things for yourself.\n\nYou two need to re-negotiate your division of finances, and find something that both of you are actually honestly comfortable with. \n\nWhat you decided when you first moved in with each other didn’t account for the issues that are going on now, which you couldn’t have foreseen before you experienced them.", "Just what kind of fucking question is that?!?!?", "NTA. He wants these for free. You say that you both should split the expense. You are being the reasonable one here.", "NTA but it’s Barbara Sturm and Molton Brown", "Nta", "NTA him getting hid friends in on this is utterly childish.  Of course he likes them there expensive and a luxury brand.  People first midst know what financial abuse it before tossing that out.  Tjis is not it.  He is however manipulative to cry that.", "I don’t understand why he doesn’t get a full time job while he is still looking for work in his field?  Still NTA", "NTA.  If he wants to use higher quality products, he should be willing to pay for those products.  You shouldn’t have to subsidize his life just because he chose a niche profession he knew would be difficult to find a job in.  You aren’t withholding access to personal hygiene products, just asking him to contribute his share if he wants to use your expensive stuff.", "NTA Your paying your way and using your spare money to buy things for tou that's how it works. It isn't your fault he currently earns less", "I’ll never understand people who get other people involved in their relationship problems. Do they really think that getting someone else involved will solve the problem? Pathetic really.\nNTA.", "You are financially abusive by... not buying him luxury bath products? Oh dear, if all cases of financial abuse were this horrific, I can't even.\n\nSeriously. NTA.", "NTA", "NTA. My ex knew not to lay a *finger* on my Olaplex conditioner.", "NTA but once someone cries financial abuse the relationship is essentially over. There really isn't much to recover when someone throws around a big accusation like that. Whether it's happening or not, once a relationship is at that point... It can't be mended.", "NTA", "NTA", "NTA\n\nKudos for doing a proportional split according to your salaries. Red flag that bf engages your friends as flying monkeys when you guys have a private conflict", "He can move out if he thinks he’s being abused. NTA", "YTA.\n\nIt isn’t abusive but I honestly do not understand partnerships where one partner is ok with having a much higher quality of life over the other.", "ESH \n\nSorry like I see where you are coming from but I also know that he's trying to find something to make a name for himself and he's doing the best he can with what he has. Obviously you don't want to be overly supporting him, however you knew the circumstances beforehand. I think the bath product thing is petty. Plus he will most likely find something that pays well and then everything will be equal. Until then, know that some little things like this may be more on you. Anyways hopefully you guys move past this and come to a healthy understanding.", "I’m sorry…I just don’t see the big deal. You’re a couple and I assume you care about each other. \nIf roles were reversed, and your bf was the one making the most money while you ere working on a PhD and working part time, comments would be all over your partner’s ass for “lording his money and ability to buy luxury items for himself” and not considering your feelings. Voting NAH simply because there’s no law against being an A.H., but I think you’d be better off finding someone with your own earning capabilities than an academic", "NTA. But if you get married this isn't how it works. It's even split. What's yours is his. Except for preexisting assets as agreed. At that point it would be financial abuse.", "MOLTON BROWN !!!!!NOBODY BUT MEEEE !!!!!!\nTOUCHES MYYYYY MOLTON BROWN!!!!!!\n\nBloody arm and a leg they are 😤😤😤", "A soft NTA - in the short term, instigating a \"you try, you buy\" policy is fair to demonstrate the value of these items to you, but I'm not sure your system is a good one to start with. OH and I have been round and round on this in the past, and we settled on this:\nI put everything EXCEPT £XXX into our joint account. That £XXX is my fun money for the month. He also puts everything except £XXX in. So we've put very different amounts in the joint account, but we each have identical buying power for our own treats. \nThe joint account is then used in this order:\n1. Bills, mortgage etc. (all direct debit or standing order as far as possible, coming out soon after we're paid)\n2. Savings (automatic payment to savings account)\n3. Joint spending on food, toiletries, nights out, luxuries for the month etc (so we discuss if a weekly shop looks too much, or if a purchase or meal out is a stretch that month, together)\n\nIt's not equal, but neither are our incomes. What it is, is equitable. We both have the same lifestyle expectations, same financial pressures, and a shared sense of stability.", "Also these products can be [hundreds of dollars](https://www.sephora.com/ca/en/brand/dr-barbara-sturm?country_switch=ca&lang=en). I would straight up murder someone who used my $200 face cream.", "Yup. I used to use Molton Brown when I had a good wage.  Once I retired, I switched to cheaper stuff. I prefer Molton Brown, but the cheaper stuff does the job.", "I wonder if the 50% of income into the joint account idea is not working for him because his income is too low. Like, if he's only making $20k a year, it might be very hard for him to contribute $10k to the joint account and still cover, say, a car payment, insurance, and a cell phone bill while keeping enough in savings to repair the car if it breaks down. And if her income is high enough that the joint account is more than enough to cover their shared expenses and the balance is just increasing month-to-month, it's got to be really frustrating watching half your desperately needed money sit where it's not helping you. The mature way to handle this is definitely not stealing your partner's fancy soap and then accusing her of financial abuse, but there might be a little bit of blame lying with OP if she didn't take a second to work out the math and recognize her partner could be struggling.\n\nMy husband and I do the joint account, but the way we do it is we seeded an account with an amount slightly more than our monthly expenses and then once a month we each contribute an amount to bring it back to the original balance. That way neither of us is putting more into the joint account each month than the bare minimum to cover essentials.", "Involving their friends in the issue to put pressure on her is also a red flag.", "Agreed, I know some people here will jump on my ass but it’s actually insane to have a joint bank account with someone you’re not married to (unless you’re both on the same page about being together without ever getting married).", "Because they want to play husband/wife before actually becoming husband/wife.", "Oh lol. \nHe’s wanting to be an archeologist. \n\nWell. \n\nHmmm.\n\nHe may never move on then. \n\nHe’s already violated your boundary and trust using your bath products.", "These are multi-hundred dollar luxury products, which is why she was paying for them with her own money. You’d be fine with your partner using multi-hundred dollar products and not contributing to it?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "This is Reddit. Are you expecting people to come here with serious problems? This is absolutely the right place for this issue.", "Rubbish! The split depends on whatever the couple agrees between them. \n\nSome choose fully blended finances and everything comes out of joint account(s). Others choose a joint account to cover shared bills (e.g. mortgage/rent, property tax, utilities, vacations) and contribute equal amounts per month to that, or a percentage based on relative income, while retaining personal accounts, where their salaries are deposited, for what they consider personal expenses. Still others don’t share a joint account at all, they agree who is paying which expenses, the rest of their income is their own. *None of these are wrong*.\n\nIt’s worth noting that those who choose to keep their accounts partially or fully separated, rarely find themselves in the position of all their money being taken from the joint account(s) by their spouse/partner if they split up. I would argue that the whole concept of dewy-eyed “we pool all of our resources together because **WE love and trust one another**” is idealistic condescension towards those with a more pragmatic approach to life. A pre-nup is not lack of trust, nor is keeping one’s personal income private. It’s simple acknowledgment that just because I’m madly in love with my SO right now, doesn’t mean it will last forever and I have a duty to protect myself, as does my SO.\n\nLastly, I don’t think you understand what financial abuse is. It’s where one partner prevents the other from accessing funds to keep them almost entirely dependent and without means to leave. Or, it’s where one partner places all the financial burden on the other and expects to be kept, also placing them in a situation where they can’t leave out of guilt.", "Yes! Without asking. And then even after she gave permission for him to use it a few times a month he started using it daily!", "The minute I read Dr Barbara strum, I was on her side", "Accusations of abuse stop the conversation. \n\nOnce someone says that, there’s no way to argue or disagree. They have just called you a monster and themselves the innocent victim. \n\nWhich is exactly why people use it (when it’s not abuse). The use of to win the argument, and stop any more discussions on the topic-because if you are an abuser-you can’t be trusted to not abuse, so you don’t get to make decisions, arguments or plans on that topic.", "It's different when married. If a woman said my husband makes 3 times as much as me and makes me spend the food budget to get soap that isn't no name while they take half their income and eat steak in front of me, everyone on here would be losing it about red flags and financial abuse. This is fine for bf/gf, but if they get married it's not fine.", "There’s lots of decently paying jobs in commercial archaeology, but yeah- academic archaeology is going to be hard to get into. Archaeology in general is not a career dead end though- he should just transition to CRM.", "If the sexes were reversed I think there wouldn't be as many people saying this. Sounds kind of hypocritical.", "Yes yes and yes to all of this. I'm hoping OP sees this. OP is NTA.", "i can't help but feel like if it was the other way around it would be considered ok for her to live off his money...\n\n\n(was just answering that one sentence in general. in this case: his behavior is not ok obviously! if those products are that expensive he shouldn't touch them at all. things that she buys with her own money are hers and he should definitely ask for permission to use them and accept if she says no.)\n\nETA: the real problem is not \"who makes more money and how should it be divided?\" but \"do not use what isn't yours without asking!\"", "You have every right to have expensive products that you like to use for a “treat yoself” moment, especially when you’re footing most of the bills.", "Get a lockbox for your bath products.", "Familiar with both these lines. I love Molton brown for their bodywash scents and the nice way the soap feels on your skin. Strum products, in my mind, are egregiously overpriced and not worth it though I'm a skincare junkie and know just about every dupe or better suited product for myself that's out there.\n\nGiven your income discrepancy I think a fair compromise is sharing the molton brown. Not sure how many products you use from that brand but it couldn't be more than $50-60/month if you use say, body wash and lotion. A standard bottle is about 30 bucks and will last approx a month for 2 people. I wasn't a fan of their hair products but maybe you use those too but a guy would only use a minimal amount of shampoo. The strum products are obscenely priced and I think its fair you ask him to refrain from using those.", "A sahp also provides something to the household- chilfcare- and it was agreed up on that they give up their job/income to raise a child.\n\n\nThere is no child, bf does not do more housework and op never agreed to finacial support him limitless/ make her income their shared income.", "Frist that- the sahp brings in something different than money.\n\n\n\nBut the second is consent. The other parent consents that their income is fully shared income and to provide for the sahp. Op never consented to fully finacially support her bf.", "Yeah, after that, I change my verdict.", "This\n\nHe already puts less into the joint account.\n\nIs this the first time he has tried to manipulate you into paying for something you use jointly out of your private fund instead of the joint fund? Are gifts to you/your family from your private fund but gifts to him/his from the joint fund? \n\nIf he really thinks you are financially abusing him, he should break up with you. The fact he is so comfortable making such an accusation over such a relatively small thing indicates his intentions are suspect-really, it’s financial abuse to ask him to contribute to the cost of soap?", "I was being facetious. I did read the post. I stand by my answer.", "Indeed, and the fact that he only got HIS friends involved so that he would have a posse behind his back, means that he is trying to gang up on her and bring his friends in as his backups whenever they are having a relationship issue. It's a major problem", "But that isn’t what’s happening here? She’s willing to buy it from their joint funds for them both to use, he’s not. And she is saying that they’ll just have that much less in their joint savings if that’s the choice to make, and seems fine with that - not that they’ll then have to live on toast and ramen. \n\nTbh, even in this bf/gf situation rather than marriage, what you’re describing would be wrong. Insisting that a partner that you have any degree of shared finances with (in this case, contributions to a shared account) buys something luxury from the food budget and then eating better food than them because you’ve used your discretionary funds that they don’t have is obviously wildly unfair; it doesn’t matter whether the higher earner is male or female. But that isn’t what’s been described at all.", "I've given this identical advice out for both genders.", "Not as far as I.am concerned. My husband makes enough to support us. I have worked full time since youngest was in K and I put hubs through school before we had kids.\n\n I retired after Covid (teacher- his idea as he felt it safer). Now I sub for extras for both of us.", "She's eating soap steak in front of him and is saying use the joint funds which food comes from if he wants some.", "Subteddit", "I honestly can’t tell if you’re being serious. Soap steak?! \n\nShe isn’t telling him to choose between the nice bath products and food (whether nice food or otherwise). She’s saying they CAN AFFORD the nice bath products for both of them from joint funds and it will have a corresponding affect on their joint savings. That’s it. \n\nNot that she wants the nice products from joint funds but he can’t use them. He can use them. And it doesn’t affect their other purchases, she specified savings at the end, not monthly budget.", "What a facetious comment", "🤣👏🏻", "NTA, “financial abuse”? These are bath products, not food and shelter.", "NTA. I would pay attention to how he involved your friend group to manipulate you. That’s what teenagers do. It may not seem that big of a deal over bath products     But if you think about it, he doesn’t respect your boundaries. I think you will end up being the one who is being financially abused and taken advantage of. Open communication about budget, finances, responsibilities, etc is needed. If he can’t handle that then you need to make some decisions now. Don’t forget to see a professional regarding your future. A financial planner and a lawyer can really help set you up and protect you regarding future ventures. Make sure you name someone to make healthcare and financial decisions in case you are unable to. I was a nurse for many years and saw this situation frequently. Younger adults out of college don’t worry about accidents or loss of income. Please take this old woman’s advice. Take care of yourself first and others later.", "I would be really scared to share a future with someone who jumps into a smear campaign against me for fake abuse. Your friends will always have this allegation in the back of their heads, and going forward, will unconsciously be looking for signs in your/his actions that support that claim. Not only is your bf entitled, and ok with misleading you about how often he steals your stuff, but he’s ok with trying to publicly shame/destroy you to get what he wants.\n\nNTA", "NTA\n\nI'm actually over here laughing at this grown man who thinks he is being financially abused by someone who is literally just asking him to pay for products he is using. He sounds like he's insecure about making less money than you and possibly also resents you for this. I think he's definitely envious of your nicer products and needs to either share the cost or stop using your stuff.\n\nGood luck, OP!  \n\n\nEdit: Also I just looked up both of those brands and they look amazing. Is there anything specific you would recommend I try first?", "NTA. If you're both equally using the products, the cost to purchase them should come out of the joint account.", "NTA. If there had been a prior conversation and he asked you if was ok if he started to use the products too, then that’s a different story. But he’s not asking and not even offering to help pay makes it worse for himself.", "NTA, partly because he wants to mooch your stuff, but mostly because he ran to his friends and aired your financial dirty laundry in public.  To me, that's a huge red flag.", "it's so funny to me when someone uses the \" you just want my money\" card when there is no money to want 😂 you each use half of your income for home expenses and yours is more so contribute more. The problem is he is now expecting you to use your personal money for joint items so if anyone is financially abusing anyone it would be him taking advantage of you. I always compare these situations to those times when toddlers try to push your boundaries to see what they can get away with, and if they get away with one thing they keep pushing for more .", "\"We're both using these products, so I'll buy them from the joint account.\" \n\nI mean... duh.\n\nNTA", "I honestly think the financial abuse thing gets thrown around way too often.  Financial abuse occurs when one person doesn't have a source of income and instead are doing household duties or if someone is controlling all the money in the relationship even if both parties are working... it is not financial abuse for a BOYFRIEND to pay his own way.", "Stop. Dating. Poor. Children.", "NTA. Break up with him.", "Damn those are expensive! O.O Definitely NTA. Hell, I would love to be financially “abused” by you like he is, while basically being treated to stuff he wouldn’t be able to afford otherwise… (though in his case “stealing” might be a bit more fitting term, since you had a discussion about it and he was well aware that those are expensive and special treat only, and yet he was using it everyday and doesn’t want to pay for it)", "He stole your stuff by using your products without permission and now you feel bad!?\n\nStop it. Just stop. Don’t let him make you feel guilty when you did nothing wrong.\n\n\nNTA", "If he wants expensive products he can make a contribution towards them. Crying financial abuse is plain old manipulative - ie abusive. Your arrangement is more than fair to him. He's an asshole and when he is doing so well from the arrangement his assholery does not look good or bode well. NTA.", "He is your BF, not your husband and he does not have the right to half of everything you own. It is not financial abuse for him to go without expensive bath products. He won't have them if you leave him for being a jerk over nothing. Odds are without you he'd be getting that PhD living in a much smaller and not as nice home and washing with soap from the Dollar Tree (assuming his stipend is close to what my spouse's was 5 years ago when he got his doctorate).\n\nYou are allowed to have nice things for yourself. You are absolutely within your rights to not allow him to use these things.\n\nNTA.", "NTA. I use is clinical and my partner knows that he is not to use them. I work overtime to pay for them, and I would be furious if he used them, seeing as he would never pay that much for skincare. If your boyfriend refused to contribute for these items, he shouldn’t use them. Period.", "NTA OP.  This post reminds me of the Old Spice body wash commercials.  That said, if it was me and my BF said that I was \"Financially abusing\" him, I would have told him \"If you feel that I am abusing you, let's call it quits because I don't want to be in a relationship where someone thinks I am abusing them in any type of way\".", "NTA he can't expect to use them for free", "Oh snap, those are HELLA expensive products!! If I had purchased them with my money (in my dreams) and someone else was using them, I’d make them help pay for them too!!  NTA here!", "Nta, but he needs to be looking at employment in adjacent fields and doing research on his preferred specialty if he wants to get there. At least,  if he's looking into something niche like archeology. You generally don't get where you want to be right away... gotta pay your dues.\nSource- sculptor who makes monuments and restores headstones.", "NTA. If he wants to use them he can contribute. Simple.", "NTA he was using your products without permission which is stealing, you weren’t financially abusing him because you said he works so he makes his own money. He doesn’t need those products he wants those products. The high end expensive stuff is a want not a need. It’s not your fault he chose a field with extremely limited employment opportunities. Unfortunately choosing a field that isn’t in demand makes finances tighter. Sometimes choosing a field you want isn’t always the best idea when it comes to finances. We all have to do things we don’t want to do in life and he just needs to expect that if he wants the expensive products and he can’t afford them because they’re out of budget then he’s going to have to get 2 jobs and stop volunteering at the university.", "NTA - The joint account is for joint items. This is what you agreed to. Your boyfriend is the one being financially abusive. You agreed to a plan on how to fairly divide and spend your money and now he thinks he can share things that you pay for from your personal money and then guilts you when you ask him to help pay for it. Nope. It you let this go…he’s going to expand it to other things as well.", "NTA - it’s not even close to financial abuse. You can afford nice bath products and should have them if you want. If he wants to also, he can help pay", "NTA\n\nHe's using half, he should pay half or use the cheaper products.", "This man is 29????? Nta", "NTA. At all. You're already contributing way more into your 50/50 account due to making more, so all you would be doing is forcing a small contribution from him towards a luxury that he's decided to use. The fact that you were buying his bath products to begin with is charitable enough. If he wants to use the expensive stuff then he can help pay for it.", "nta", "Question: OP you will always make more money than him. You are arguing about bath products and you want to make a life with this man? How?", "NTA.   Curious.  Boyfriend thinks OP should pay more because she has more income.  He has more time and ability to run errands, do chores, etc.  Does he perform a higher percentage of these?  Does he do more of the shopping; buy extended friend/family gifts (and wrap them), and generally expend more of his \"extra\" resource for the good of the couple?", "NTA, also why is your responsibility to buy his bath stuff?", "NTA - he is living beyond his means and isn't embarrased about it.  If you stay together this will continue and if you don't stay together, the split will come as a culture shock to him.\n\nI don't know any archologist who likes fancy bath products.", "NTA\n\nFrom someone who has actually been financially abused this is not what’s happening & I get so angry when people throw that phrase around. Has your power ever been shut off when you weren’t home and he had no access to the accounts to turn it back on? Does he not have money for household items like laundry and dish soap? Does he have to ask for every dollar he spends? No? Then he can stfu. \n\nYou have a lot of thinking to do. He’s making very, very serious accusations of abuse and throwing a tantrum because he can’t use your bath products. Isn’t that emotionally manipulative? What else will he guilt you about in the future? I don’t think it’ll ever be a good idea to combine finances. It’s clear he thinks your money is his and what’s the big deal because you make more than him. That isn’t a healthy mindset to have in a relationship.", "NTA. I'm hoping you are not planning to marry this PhD guy. If you are planning to get married, then this would be your life long problem esp when the financial boundaries will dissolve. May be consider a guy within your financial strata.", "NTA You might want to consider the past six months a learning experience and move on from this relationship. Your boyfriend is unhappy with your current financial arrangement which benefits him far more than you. He has accused you of abusing him financially.  His chosen career means that he will always make less money than you do and unless you decide to completely combine your finances, he will always have less disposable income. If bath products cause this much of an argument, what happens when you need a new car and buy a nicer one than he can afford?", "He is fighting over bath products?  Tell him get a bar if soap, works for me.", "Do you really need this entitled brat in your life? Is this tantrum over bath products just one more item into the list of shitty things he does? Or is just an exception on an otherwise equal and loving partnership?  I feel is the first, and honestly you are too young and too successful to tie yourself to a selfish, immature man this early in life\n\nNTA but I feel that you deserve better", "NTA. \n\nHe seems to be financially abusing you. \n\nYou are doing more contributions in general", "NTA. I owned the house my girlfriend moved into with me, I make slightly more. I pay the mortgage and she pays the bills ,other than personal stuff like my cellphone. She has more money left over than I do, but she's also better with money, so it helps us both in the long run. I'd recommend reevaluating your way of sharing expenses.", "So if I'm understanding this correctly - you are suggesting that y'all pay for bath products that you both want to use out of a joint account and he says you are financially abusing him? \n\nYou didn't tell him to go out and spend his personal money to replace what he used, or even up buy his own - you just want to use joint money since you are both using them.\n\nNTA", "Oh shit those are very expensive. Yeah I don’t blame you for being mad. \n\nNTA", "NTA. People are real quick to pull that financial abuse card when they don’t get their way.", "NTA. Your BF is acting overly entitled. \n\nI will say your relationship doesn’t sound super healthy when you have such a significant disagreement on money and finances. That needs to be better dealt with before people live together.", "is he going to make more when hes done his PHD ? gotta act like a team. if it was roles reveresed would he buy for you ?", "NTA and there are a shit ton of real jobs in archaeology he can do - just very few in academia (if it is archaeology and not just an example). It's not financial abuse to expect him to contribute to the things he's using. I would reevaluate the way costs are being split if he started to accuse me of \"financial abuse\" over some sundry item spending. Like wtf.", "YATA but not intentionally. Knowing it's not financially feasible for him to afford the products you use, you tell him you're going to start using your commingled funds to purchase said products. You're going to buy the products regardless, you make a considerable amount more than he does, and his career is going nowhere...is this really the hill you choose to die on? Consider this practice for if down the line y'all were to get divorced. He could go after you for alimony, spousal support etc, and likely win. At this point you're simply maintaining the lifestyle he's grown accustomed too.", "ESH - but not for the financial topic: \n\nYou are two grown adults, living together and potentially wanting to keep it that way - and you are fighting about who pays the Molton Brown soaps?\n\nCome on… Can’t you find anything better to be making it a relationship conflict?", "Esh....do you two even like each other? Thank goodness I never encountered this pettiness in my marriage. We didn't keep score and all I see with these couples today is greed and petty. No wonder this world is going nuts.", "She is the asshole because if the gender roles were reversed everyone would be attacking him for not being understanding.", "Lol. Would you say this if the roles were reversed? Imagine someone saying this sub is filled with older men making way more and the woman are financially abusing these men… that wouldn’t go down well would it?", "If she makes 3 times as much as him in a well paying job (in what sounds like tech), and judging by her age she’s just started her career, I’m guessing the split might be more along the lines of 30k vs 90k to 40k vs 120k.", "He also chose to go into a field that will not have lucrative opportunities, and he needs to come to terms with that. It was a choice he made. OP is being super generous with her income as it is, considering they’ve only been together for a year.", "Help! Help! I’m being repressed!", "Ah yes, the PhD student. In school until he is 45 then makes like 25k a year with 100k+ in loans. Good luck.", "That solves the immediate issue, but the Iranian yoghurt, as this sub says, is not the problem here. Him helping himself to $$$ every day and lying about it is.", "He’s not getting one. He’s “applying” supposedly. \n\nOP- If he can’t work full time and manage phd program applications, I’ve got some bad news about what phd life is like. Much less what it’s like to manage a tenure track career if he ever gets a job. (He likely will not.)", "In a dating relationship, this is exploitative, as other commenters trying to make this point have been told. When a couple marries, the income belongs to both of them, because the stay-at-home spouse is also working for that money by providing child care and home management. These two both earn money and are living together without marriage or children. He is not dependent on her financially the same way stay at home spouses who have removed themselves from the job market would be.", "Because men on Reddit will trip over themselves to scream \"what if the sexes were reversed!\" when the situation would be viewed exactly the same way.", "The above comment is way off base. You never said you were mad and it didn’t read like that. That person is probably the type who borrows stuff without asking. Pay them no mind.", "You helped me understand a very ancient toxic relationship in a very new way. 3-4 years in and knowing that I have *actually* spent my life being abuses, he starts dropping this more frequently. It stopped the conversation for sure and always triggered a flood of confusing emotion for me.", "The income does not belong to the two of them unless they decide it does. You also didn’t touch on my previous comment. Would you feel the same?", "But why is she responsible for undertaking these costs 100%? Why shouldn't it come out of their shared account if he's using 50% of the Molton Brown?", "I got lost in there! Neat and thank you.", "They did the monther math", "which sounds perfect to me.\ni couldn't be only staying at home, that's my personal preference though.\n\nthere's different ways and honestly whatever a couple agrees upon is fine. if they agree that only one provides and the other stays home, that's fine.\n\nto me the \"he wants to live off her money\" just sounded like a negative thing while if it was the other way around it would be mostly acceptable.\nalso he does work and bring money in so i feel like that statement wasn't really true.\n\nin the end she did not agree for him to use her stuff and that's the big mistake he's making.", "They’re fighting because one partner doesn’t want to equally contribute to expenses. If you want to reduce it “shower gel” go ahead.", "NTA\n\nBut he is for involving your friends and trying to play the victim.", "NTA.  I’d be wary about staying with him if he’s bringing flying monkeys into an argument that’s obviously of his making.", "NTA.", "NTA\n\nYou bought them for yourself. He knows those are specifically for you. He didn't ask permission at all before using them. Just because your partner has something you like, doesn't mean that makes it yours too. You even met him halfway by suggesting to split the cost. What more does he want?!\n\nI buy the groceries. Some stuff is for me, some is for my wife, and most is free game. Even though I pay for all of it, I will still ask if I want something of hers. If the situation were flipped I am sure she would do the same.", "NTA, but I’d think about implementing the following plan: \n\nEach of you puts a percentage of income in joint account; percentage is based on amount of income. So, if you make 3x what your boyfriend makes, you put in 2/3, while boyfriend puts in 1/3. You decide ahead of time what your joint budget will be — let’s say for example $2,000/month covers all mutual expenses. Your boyfriend would put in approx $667, while you put in $1,334. \n\nIn this way, all bills/rent/groceries/shared toiletries, etc. are covered and you each have some discretionary income for individual use. My bet is that you’re splitting everything down the middle, which is technically fair, but is liable to cause resentment in the person making less.", "Nta. It's your personal money and therefore your personal products.", "Lol, that's not what financial abuse is!! Is he trapped/coerced/isolated/fearful/disempowered by being made to share payment for the toiletries he CHOOSES to use?! Obvs not, he just doesn't like not making as much money as you. \n\nHe's an asshole for being sneaky about using your special products, being lazy (and sexist) by not researching nicer more affordable products for himself, and trying to make you feel bad for making more money by throwing around the word \"abuse\". You're NTA, OP.", "NTA. It’s a trust issue as much as anything. Since you don’t have all shared expenses, his taking your expensive products is literally theft, like if he took cash from your wallet. \n\nOne problem I have in my household is people using items like regular things when I buy them as luxuries. Like, if I buy really good ice cream, I might eat one spoonful a day over the course of a month. If my kids find it, they’ll gobble it all in one evening because they don’t know what things cost. Your BF needs to pay his share of these products so he’ll decide whether it’s really worth it to him.", "NTA at all. Your boyfriend is leeching off you and being incredibly selfish. There's no way you should be paying for his products like this. You should each buy your own stuff and if he wants to use nice things, he can get a better job to pay for them (or obvs not use them). I get sharing rent, bills etc. but it sounds like you're effectively carrying him which could be absolutely fine if you're building a life together but his attitude screams entitlement and is what makes this ridiculous.", ">We got into a huge fight and he’s saying that I’m financially abusing him.\n\nYou are not married, so he is not legally entitled to your personal funds and while you combine your joint funds, doesn't mean you have to continue doing so. Financial abuse entails cutting someone off of their \"entitled\" funds, he has no legal right to your money. NTA", "NTA. The added edits don't make any difference to me one way or the other. For me, the salient points are\n\n1. He wants to have free use of something but not pay one single cent toward it and have you buy it for him.\n2. He didn't raise his desire with you; he snuck your products behind your back. When you OK'd using it once in a while, he upped his stealth use (i.e., stealing) of your property to daily.\n3. He could continue to enjoy the products through the shared account (where his share of the cost if1/4 compared to your 3/4) - with no increase in his contribution; but he refuses to do even that!!!!!!!!!!\n4. ETA: He then jumps to DARVO: Denies (that he did anything wrong), Argues (that you should pay for it since you have more money), Reverses Victim and Offender (saying that you are financially abusing him).\n5. He then involves outsiders into this in an attempt to get flying monkeys to help him persuade you that you should just pay for his preference for high quality items because... some friends agree with him.\n\nHis attitude over this small thing is such a HUGE warning flag to me. He steals and steals more; he expects you to pay for his indulgences full on your dime; he has no interest in working together with you on a mutually agreeable solution; \\[ETA: DARVO\\]; he runs to others to be his chorus instead of just working things out with you. The guy is just not looking like a keeper.\n\nETA: I shared your post with my husband. His response: You need to dump this guy quick; it will not get any better.\n\nETA: We both wondered: What does 'seeking a PhD position' mean? Did he earn his PhD and his looking for a position as a university professor? Otherwise, what difference does that make to his job search?", "NTA and what the f...?\n\n1. Seems like your boyfriend can't do basic maths, as you COULD use the joint account to buy those and you don't.\n\n2. Who freaks out and involves friends over BATH PRODUCTS?\n\n3. \"Financial abuse\" my ass. You are more than generous\n\nTell him from now on, both of you will buy your own groceries, and make him compare the situation before and after.\n\nOr better, run away and enjoy your products alone", "NTA. Your boyfriend really wants to be the victim here. Also he needs to shut the fuck up, that's not what financial abuse it.", "NTA OP, look how quick he ran to other people crying that you are abusing him. What does that tell you. For one, he involves people in your problems (that’s toxic). Two, he will paint you as an ABUSER to people. Three, he throws tantrums when he doesn’t get his way. Is this the sort of person you want to be with. Never mind the bath stuff for now. Actually see his behavior. This is all deal breaker stuff to me. Where are your boundaries? When he is ruining your reputation already?", "he’s a deadbeat, honey. leave him. NTA.", "Nta. You are not denying him the product. You are simply taking it out of the shared account, as it became a shared product. \n\nBecause of his reaction, I would hope you have checked the balance and activities on you shared savings account.  He seemed a bit overly concerned when you mentioned it.", "NTA those are YOURS, he needs to leave them alone and stop stealing your stuff. He needs to buy his own. It's not your fault that he has a useless PHD. Tell him to pay for them or start paying for all of the bills himself. Stop putting more money into the joint account than he does. Your not \"abusing\" him, you're not even married to him. I'd seriously consider moving out and letting him live on his own for a while", "Too bad if you want kids some day. Having tantrums like that because he wants beyond his means. Chose a limited career. Gets an easy lifestyle and still complains.", "NTA but don’t be surprised when he start making more money that he will hold this against you", "NTA", "NTA.\n\nYou are paying proportionally more towards everything, which is fair if your earn more.\n\nI don’t see why he freaked out when you said you would be purchasing these items from your joint account. It sounds as if it wouldn’t affect the budget, just less savings.\n\nIf he wants more money, he should go earn it.", "NTA. Forget PhD level studies, you learn in kindergarten that you're not supposed to take someone else's stuff without permission.\n\nIt would be hilarious if he really was going into archaeology tho, as I don't know a single archaeologist who wouldn't laugh in his face if he complained about his partner being upset that he was taking their personal items.\n\nAsk him if he's gone a Manifest Destiny route.", "NTA\n\nPhD programs are *really* failing him if he can't understand the true definition of financial abuse.\n\nNo, dude. You used expensive products, you replace them. Period. If it means you don't have as much \"fun\" money, oh well.", "NTA. If he doesn’t want you to pay for them out of the joint account, he doesn’t need to use them. Your initial suggestion was completely fair, and the fact that he’s blowing up because he expects you to pay for the more expensive products for both of you on your own, and you’d rather not is just crazy. If it’s a shared expense, it should come out of the shared account.", "NTA.\n\nIf both are using the products, they should be paid for out of the joint account.  He shouldnt have even used something that he didnt pay for, or contribute to paying for.  He is actually financially stealing from you.", "He is trying to financially abuse you not vice versa.  Tell him to get bent and hand him a bar of Irish Spring.", "Some of the comments are confusing me. I read this as you buy store grade bath products out of the joint account for him to use and you buy very expensive bath products out of your personal account just for you to use. I see many comments about it all coming out of the joint account and that is a different scenario than I originally thought.", "NTA", "NTA. I’d say the way you guys have your accounts set up is very fair, and is similar to how my fiancé and I are. I make more than he does, so I pay more of the bills, but my fun money is my fun money. Your bf is plenty old enough to understand that when you choose a less lucrative career field, that comes with not buying as nice of things. You’re his gf, not his sugar mommy", "I'm on the fence here... because if the situation was reversed and the guy was buying himself high quality steak and his girlfriend cheap cuts (so sorry, I know it's a gross gender generalisation) I'd think AH. But on the otherhand, you are not long term partners or married and do not have a commitment to share finances. \n\nI'm going to say NAH at this stage of your relationship, but you should consider at what point it would be unfair or selfish, particularly in the context of how you would want the situation to play out if roles where reversed.", "NTA\nAsking your boyfriend to help you pay for elite products if he wants to use them isn't financial abuse wtf", "NTA… I thought you were going to say that you expected him to buy them from his savings as well, but since you’re suggesting they come from the joint account, completely NTA", "So what's yours is his but what's his is his own? NTA", "NTA... BUT, I find it really funny in a weird way how Americans treat money and relationships. You like, love someone but when it comes to money they're like complete strangers. I would never ask my partner to pay for anything that I got for me and he starts using.", "NTA he should reimburse you for the products. Paying $65 for the core ingredient being hyaluronic acid is something. \nWhy don’t you gift him some for the holidays?", "NTA maybe this relationship has run its course. I mean you're fighting about bath stuff. You're in different places and the accusation about financial abuse is untrue and concerning.", "YTA- He enjoys your bath products...call his use a gift and let him be.", "NTA - makes sense that this fight is about bath products cuz this boy is a SCRUB", "NTA but I have been scrolling forever to see these mixed comments", "NTA. I’m glad you gave more context and I honestly think you’re better off without him 🤷🏻‍♀️since you already go out of your way to treat him nice things when you can, you’re obviously not financially abusing him. That’s that. To say otherwise is just fishing for problems. \n\nHim using it without telling you is a problem. If he had started a conversation with you about it for you to ease into the thought of the products going away faster, maybe you would have been fine with him using it, and y’all could have made compromises. Idk. I just think he could’ve told you so you knew instead of finding out yourself and feeling iffy.", "NTA now if you were married it would be a different story.", "NTA. But you picked him.", "NTA\n\nYou're not married. \n\nYou have a generous arrangement for covering the household expenses. \n\nIf he wants luxuries, make more money.", "NTA this is not financial abuse. This is saying since it’s a joint expense the money will come from the joint account. Which you pay more into.", "NTA. Time to live separately and let him pay his own full expenses. He's not only being unreasonable, shared use should be from shared account, but he's bringing in others to try shaming you into doing what he wants. This is not a healthy relationship.", "NTA", "INFO : What was he using before?\n\nOn one hand, I feel like a little bit YTA - everyone is working hard, and deserves to relax and feel good.  On the other hand, I get that luxury bath products are just that - a luxury.\n\nI wonder what he was using before since there might be a compromise somewhere in the middle.  Maybe he just needs a nicer shampoo or products that are better than what he had before, but not super expensive either. (I’ll admit I use a fruit-scented shampoo that’s not marketed specifically towards men, because I like the smell, and it lathers well with my hair, and makes it look good.)", "Dang Dr. Sturm products? Does he have any idea how much that stuff costs? Is he liberal with it? My husband doesn’t even want to *look* at my Sturm products cause of price, have you tried getting him cheaper products like Jack Black? NTA", "NTA. If he can’t afford them, he shouldn’t be using them. You bought them specifically for yourself (with your own money, not the joint account money) and he never even asked you if he could use them in the first place. Sounds like he’s feeling a little entitled to your bath products.\n\nAs far as the “financial abuse”: Actual financial abuse is when one person controls all the money and refuses to share it with their partner; or controls a significant amount where their partner doesn’t have enough to live on. That is not this case at all. You’re boyfriend makes enough money to put 50% into a joint account and have the rest for his own fun money. You both agreed to your monetary split when you moved in together. Since the joint account has more than enough money to cover to pay for those products if he insists on using them, he’s making enough money on his own to support himself.\n\nAs far as “considering his feelings”: it sounds that since he’s been living with you and seen how much more “fun money” you have than he does, he thinks that not only can you *afford* to pay for more of his things but also that you *should*. I’m sorry, but that’s not how it works. He spends his time working part time and volunteering, while you spend your time working full-time. Of *course* you are going to make more money than him. It doesn’t entitle him to your money. He knows you have more money because you work more. He agreed to how your (both) money was split when he moved in, and he should continue to respect both your agreement and how you spend your fun money. It’s called being a grown-up. And just because you can more easily pay for items than he can, doesn’t mean you’re *obligated* to. If he thinks otherwise, he‘s acting jealous & entitled. Besides, if you each put 50% of your incomes into the joint account, and since you make more money than he does, you put more money into the joint account than he does. Since you pay for the rent and utilities and other things like that with the joint account, you are paying more into those things that he is. If you start to consider his feelings on how do you spend your money, who knows where it’s going to end.\n\nFinally: If you *both* are using the same bath products, they should be paid from the *joint account*.", "NTA\n\nYour boyfriend might need to change career paths if he can't afford bath products at 29 years old", "You are dating a very feminine man.", "You're both assholes!!!", "OP, why don't you just gift him some for your next anniversary/bday/other special occasion?", "The way “financial abuse” gets thrown around really bothers me. Especially when it’s just by entitled jerks who don’t want to pay their share of things.", "He wouldn’t even be paying half - he’d be paying about 25% based on how they do this (half of each income into the joint account, OP makes 3x as much).", "I’m really sorry that was done to you and hope that you’re in a better place now and were/are able to work through that. \nIt’s great that forms of abuse like financial abuse, manipulation, gaslighting etc. are getting more recognition and attention, but the negative side of it is what I meant: people are throwing around these words without knowing what it means or without reflecting if that’s what’s really happening to them, like the bf in the post.", "I didn’t wanna post a classic “NTA and break up” comment, because (if there isn’t outright abuse happening!) I don’t think it’s helpful to tell someone to break up over every fight. I truly believe that people can work through a lot and grow together. \nMaybe he does see her as an ATM and sitting down and talking will reveal that to her. \nMaybe he is resentful about having less money and sitting down and talking is gonna open his eyes to the fact he’s treating her unfairly and that he should not pursue a “useless” PhD if he also wants to have more fun money.", "He lied to you about something really silly.\n\nMake sure to keep your eyes open with that one. I get the feeling he's going to be searching for a position for a very, very long time.", "Bloody Peasant!", "The steak of soap. Dead serious.", "When someone pulls the ‘financial abuse’ card due to being entitled and a mooch then you should be 100% done with them.", "Honey there is a reason that a man who makes far less than you accuses you of using him financially when you hold him accountable for using up your personal splurge on himself, and it is not anything you should bet on for the long haul. NTA\n\n(Also, I bet if he had asked you whether it was OK to use them, and discussed it with you like a reasonable person, you'd feel completely differently. Ask yourself why he didn't and decided to try and put it over on you instead.)", ">We got into a huge fight and he’s saying that I’m financially abusing him. He got our friends involved\n\nThis guy is a one man red flag parade.  He's the one financially abusing you buy being so entitled to your things and your money and trying to manipulate you into thinking you're the one at fault.  He is taking advantage of you big time and getting mad that you won't buy him whatever he wants.\n\nThen he gets his friends involved?  Oh, hell no.  That should be a deal breaker right there.  This is a matter between two adults in a relationship and he's tattling your personal business to his friends like he's in high school.\n\nBetween the immaturity and entitlement, I don't think you should keep him around any longer.  You can do a lot better.  NTA", "Dr. Squatch has entered the chat", "Leave I see bigger problems ahead since you will always make more. Don’t be a sugar mama!", "he thinks you're financially abusing him because you won't pay for his bath products?  he's clearly using you as a bank. you should contribute equally to the joint account. not 50%  .. hes so obviously using you.  NTA", "NTA but you've got bigger problems with this guy then bath products. It sounds like you're always going to have more money than him and his entitled attitude and claims of abuse are only going to get worse, especially if you marry him. I'd be so pissed if my partner went and accused me of financial abuse to our friends if I were already paying more for the household and even provided him with nice bath products.", "NTA but now I've looked at the Molton Brown site - what are your fav scents?", "This is so petty. Like how much are these products that you can't buy one extra bottle a month if that?", "NTA. I suggest agreeing on a budget- even one that includes expensive products you both like- and then each paying 50% of the budget into the  joint account. That way, you can both have equal say in how it is spent. \n\nOtherwise, he should be using stuff he can afford on his budget. Plain and simple.", "ESH. You described your financial arrangements but I don't think either one of you are being honest about how you feel about it.", "NTA.\n\nHe stopped using your stuff as protest?. Darling. Maybe for him it is protest or it is proving a point. \n\nBut you showed your boundaries and thats the point and the best thing to do. You should not feel bad because he is stopping to batten your stuff. If he thinks that is a protest, it shows you what he thinks about you.\n\nIn my opinion, there are a lot of people who choose to live a comfortable lifestyle so they work their ass off for that. So they can afford more expensive stuff and thats very ok.\n\nBut when your bf choose a doctor and actually everybody knows how much money will a doctor of archeology bring in. He can not feel entitled into your expensive stuff when he is not willingly approaching a more well paying job and even it is highly toxic to say I am using your stuff but I will not pay for it. I would leave that guy instant.", "NTA. Your BF is going the way of the dinosaur. Leave him in the dust.", "Move on from this dude. You tried living together and it's not working. He dragged friends into an argument and is accusing you of abuse because he can't use your ultra expensive stuff on demand without paying for it. NTA.", "NTA. Those are not staples, they're your personal items he's using without permission: stealing. You have a leech boyfriend problem.", "I admit I was at y t a at first, thinking this is a pretty petty thing. But his asinine claim that you're \"financially abusing\" him when you are practically supporting him flipped me to you're NTA and your added comments only solidified that. He is choosing a ridiculously low demand field, he will have to accept the financial consequences of that and stop acting like a petulant adolescent when he can't afford luxuries.", "NTA\n\nAnd I'd rethink your future with Mr. Entitlement. I'm betting that if you think back, this won't be the first instance of him behaving this way.", "NTA\n\nYour bf is lucky that you both have agreed to this system.....sounds like he is getting a great deal.\n\nThat your bf claims you are \"financially abusing him\" is pathetic.....he needs to grow up. He chose his field and you chose yours. Why you should bankroll a certain lifestyle for him is beyond me. BTW you already are subsidizing a better lifestyle for him with how much more you pay into the joint account; that that doesn't seem to be good enough for him is absurd.\n\nYou are obviously in the best spot to judge your relationship, but the fact that he said you are \"financially abusing him\" and that he got your friends involved are really bad signs IMHO. Wonder if something bigger is going on - maybe he resents how much more you make than him or maybe he is simply wanting to take advantage of you.\n\nSorry, this is a crap situation.\n\nYou are probably more gracious than I am, but I would change the terms to 50/50 on living expenses; not half of each of your incomes, but each of you pays half of all expenses.", "NTA carefully reconsider this relationship.", "NTA - you are both using it so the money should come from joint account", "Nta- but maybe since he makes less offer a different splint like you 66% him 34% and just treat that 16% difference as a small gift you give him to have nicer bath products too. Plus cutting the cost of the cheaper end products will help out for some of the cost.", "So you’re basically arguing if the bath products should come out of your money or your money? What a scrub. NTA, I didn’t even need the additional comments. That man sounds like he will bleed you dry if you let him, and use all your friends and family as part of his emotional warfare to guilt you into whatever he wants. He’s never going to be able to contribute his fair share, he’s just going to get deeper into debt and expect you to pay his way through life. That is the behavior of a child who sees you as a meal ticket, over bath products? Please get a prenup if you ever actually marry this guy. I’m sure he’ll throw a fit over it and get all of your friends to tell you how you should be “considerate of his feelings”.", "Tell Indian Jones to dig up some more money if he wants silky soft hands to swap out golden Idols.", "NTA. Don’t date down, find a man that can match you or provide more than this mooch", "NTA. If you're abusing him, then he should want out of the relationship.\n\nInstead, he's being manipulative to try to change the financial arrangement without a calm discussion. \n\nFor reference, I'm a member of a couple that has 100% shared income.", "ESH.\n\ni can't believe people argue this hard over fucking bath products.\n\nmy ex and i are still living together one more month until i get possession of my new place. whenever either one of us is out, we will ask if the other needs toothpaste / soap / bodywash / shampoo / whatever & just buy it while we're out. and yes, we both have certain things we prefer and some can be pricier. but we both like to be clean, have some creature comforts, and sometimes life just costs money.\n\nact like fucking adults. you don't need to nickel and dime each other over every little thing.\n\nwhen you are 90 and on your deathbed, will it really matter that he used your \"special\" soap without paying an extra $5 towards it? and if you're using $100 bath products, well then, you're both idiots.", "NTA- he’s lucky you’re splitting expenses equitably vs equally. If he wants to start pulling shit like this, I would tell him we are going 50-50 on expenses and I’m walking up the good bath shit. He’ll have even less to go around.", "NTA and he sounds like a brat", "NTA now that men learned the term \"financial abuse\" we will never hear the end of it. There is REAL financial abuse, don't get me wrong, but most of the time what these leech dudes wanna cry about ain't it.", "NTA - I might have suggested paying maybe one of every three from the joint account to be nice until I saw the part of him saying that you are financially abusing him. A grown person crying abuse from not getting free bath products would be enough for me to leave", "NTA him throwing around a term such as \"financial abuse\" is so completely ignorant to the fact that these products were initially bought on your dime and exclusively for your use but because he started using them he had to start contributing their purchase. Also if your bf just wants to get into skincare there are drugstore products that are affordable and easily emulate luxury skincare he does not need to touch your stuff.", "NTA. He shouldn't have lied, and should have thought of that before he started using them more. You are not financially abusing him. If you were, he wouldn't have ANY of his own money. Let him protest by not using them. If you go back to paying for them yourself, and he starts using them, Buy a nice lock box and lock them up, until you want to use them. It's now a shared expense, it should be paid for by both.", "Honestly, I think the issue is with the title. Some people (wrongly) read only that and make assumptions about the story before reading it.", "i think they're doing it wrong, too, but the other way around. if she's making 3x what he is- $300 to his $100- she should be contributing 75% while he contributes 25%. putting 50 percent of both their incomes into an account leaves her with $150 fun money and him with $50 which isn't equitable, they should be able to have the same amount of fun money.\n\nthe shower soap thing is him wanting her to subsidize him completely, though, and that's ridiculous.", "Let him know if he doesn't want it in joint account at fraction of price they will be a locked safe in bathroom cuppard with them.  If joint account it'll  be shared.", "No one is abusing anyone here.", "This.", "If it is B then a compromise could be looking into nice but affordable products for him. He may have to have cheaper products but they don’t have to be the old ones he used. I’d bet that the wet shaving subreddits have some good recommendations for fancy yet affordable stuff.", "Yeah, I had this happen in a very short-lived relationship. I was appalled at first... but the next time they told me I was abusive, I simply nodded and said we should break up then. Because I loved them too much to want them to be in an abusive relationship, and if I'm abusive, I shouldn't be in a relationship anyway. In fact, we needed to get them as far away from me as possible, as soon as possible.\n\nThat was a very loud night. 😖", ">Accusations of abuse stop the conversation. \n\n>Once someone says that, there’s no way to argue or disagree. They have just called you a monster and themselves the innocent victim. \n\nOr accusing someone of addiction", "Honestly, even if the \"fancy\" stuff only cost a couple dollars more than bargain basement crap, I would still be on OP's side.  There's nothing unreasonable about shared supplies being purchased out of shared funds.  Not to mention that OP was already doubly subsidising boyfriend by purchasing supplies that are exclusively for him out of the shared budget that OP contributes more to than boyfriend does.", "Definitely. Not just based on stereotypical beliefs, but also because a lot of women in their 20-30s are going to be financially dependant on their partner if they have babies, unless they can afford child care.", "why should they rethink putting in half their income?", "This article explains it well, fair isn’t always equal. \n\n[How couples can split money for bills to be fair](https://hermoney.com/connect/love/how-couples-can-split-their-money-to-be-fair/)", "Thank you for the link. I'm about to move in with my boyfriend and this was very useful. I just sent it to him as well.", "[removed]", "I’m sorry but a year and a half in and giving half of your paycheck? That’s a very fast to become so intertwined. Yes people need to do it, but with such a financial disparity between you two and in such a young relationship, it just seems off to do so quickly. Why it’s concerning is he’s almost acting like a mooch. While you always knew he’d make less than you, he wants to an enjoy a life style that only you can afford. With out you, he wouldn’t be enjoying those luxuries. And the way he’s handling the conversation is troublesome. He should be bringing in other people. Your relationship is not a community affair. Maybe it’s time to only pay half of household expenses and keep the rest to yourself because where this is going is just bad. He can’t say it’s not fair IMO since you’re still paying half of household expensive, you just giving 50% of you paycheck to him or access to your money. On top of that, he just sounds like a spender and wants to be a high roller on a bit high roller income.  \n\nRegardless of the whole financial situation, is he’s using your referred bath products, those become household expenses. No different than dish soap or toilet paper. You liking them first or introducing them has very little to do with anymore. \n\nNTA", "Gonna go out on a limb here and say that he’s envious of the lifestyle that OP can afford, begrudgingly accepts it because he’s winning out, and spat the dummy when she put her foot down.", "NTA. You're not financially abusing him; you are asking him to respect your personal property that you buy with your personal money. He can choose any of the options you presented, but he instead wants to take advantage of you.", "NTA. Is your BF a child? Either pay from the joint account or keep your bath products somewhere else where he can't access them.", "I looked up the Dr. Barbara stuff in the body wash is $65 for 16.9 oz (500ml)\nAlso some of the shampoos were $180 !!!", "Not the Dr Barbara Strum!\n\nNTA, also 50% of your salary is in the joint account, you’re still paying for it and he’s being ridiculous", "I look those things up those are super expensive. Yeah he needs to pay half or don’t touch them if he can’t afford it. NTA", "Can you give the products to him as gifts so he still gets them from time to time for birthdays, Christmas, Valentines, ect.. but once he runs out of his bottles too bad and he can’t use yours.", "NTA.  When my hubs runs out of his bath supplies he will use my expensive brands.  I make a point of buying him knock offs products for him to use. \n\nWe keep our money separate and have done so for 25 years of marriage.  It has been smooth for us and we do this by having separate bank accounts and each covering specific bills.  We don’t nickel and dime it though and we won’t pay each other back for things unless it is bigger dollars.  Separate money was my idea because I am a bigger spender and didn’t want hubs to have input on this.", "Leave the broke guy and find someone ho makes the same or more as you!! Why are you wasting your time and money on him….", "Originally I was leaning towards just letting the man use the products, no big… I’m sure it would even out in the future BUT then I looked up the products!! $$$wtf $$$ ???! I think they should 100% be yours to use alone since it’s a personal splurge. Maybe help him find a more affordable brand within his budget and guide him through what to buy and personalize it to his skin/hair. If I was in your position I would do that and also buy the first round of products he agrees on.", "Nta", "NTA but if ya'll are arguing over bath products instead of sharing, sounds like this relationship may not last too long", "They're bath products, not insulin. This is the height of an optional product. Who cares how much he likes them? He wants to use, he contributes. \n\nNTA", "NTA. \n\nArcheology….  The profession where you have to wait for your professors to die to get a job. Better fix this situation quickly, because he’s not going to be able to contribute for much for quite some time.", "NTA", "I’m curious to know the brand", "If my husband, who shares finances with me and I love deeply and have been with for 20 years used my skincare or bath bombs without my knowledge - and I mean even the ones he bought for me- I would be furious.  If he lied about it, even more so.  NTA.  Those accusations of financial abuse are ridiculous.", "The answers here are going to come down to social class and that's probably it.", "He acts like he is paying half of the joint acct. But he is paying 25%.  Your paying 75% and he wants it to be 100%. The gall!!!!  I don't think it should even be  allowed to get it from the joint acct. It should be from the individual acct. And if he does want to get it paid by you then he should contribute more in the way of more house work.\n\nNTA", "NTA. But sounds like you know what to give him for Christmas", "If you're both using it then, of course, it's a joint expense. You don't have to treat him to these upscale products but you could out of kindness. I think he's being very disrespectful but you have to choose your battles. If everything else is going fine then maybe this one thing isn't that big a deal. If he starts wanting to live his life at your pay grade then you'll have a problem.", "Is this really the hill you want to die on?", "NTA he’s a whiny mooch.", "If she makes 3 times as much as him (let's say $30,000 vs $10,000 to make the math easy). She is paying 50% of $30,000 into the shared account which is $15,000 and he is paying $2500. \n\n&#x200B;\n\nThat means the split is 6:1 which is 86/14.", "OP is NTA and I've been through the same issue with my ex. He was always asking to use my stuff and I just bought him cheap whatever, but once in a while if he stole my soap or bubble bath it was fine. I never let him anywhere near my lotions and I found that telling him how much each little jar cost and asking if he wanted to pay for it worked pretty well. \n\nMy ex was fairly reasonable about it but it was still frustrating when I bought him even his own fancy soap and he STILL PREFERRED MINE. \n\nI have since developed some very territorial feelings about my things.", "I really haven’t been able to figure out a ruling and I think your post helped me realize why.\n\nIs she being fair and reasonable? yes. \n\nWill they ever be happy? Not with this arrangement.\n\nWho should change so they can be happy? Either she just pays for more luxury items for him or he drops his PhD for a career that will afford him the luxuries (I used to be in academia, his chances of making good money in this field are, sadly, quite slim). Or neither of them get luxury items. Or he learns to be happy with less.\n\nI can’t even guess which is right for them and if they can’t either, I don’t know there is much chance of a happy future.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "This is perfect. The bf is entitled. He wants to enjoy expensive products but doesn’t think is fair if he shares the cost. Like for real", "While I understand the difference between equality and equity, I do prefer it to be an equal situation rather than an equitable one when it comes to relationship finances. Otherwise, power dynamics can quickly shift in one direction or another.", "Funny how people who are actually being abused don't often accuse their abuser of abuse because they know how fucking dangerous that is for them.", "Look, some woman in a pond tossing around swords is no basis for government.", "Yes, I definitely understood your point, and I agree.\n\nThanks for the kind words. Most days I don't even think about it anymore. Then there are days when I do something like buy myself a fancy smelling soap, and even though its only $3 on clearance, I find myself feeling anxious and second guessing if it's ok to buy, and I realize how affected I will always be.", "More like Smelly Peasant, in this case.", "There's some lovely filth down here!", "The couple are splitting their money how the article suggests", "NTA. You had a financial agreement, and he violated it. If he wants to turn your expensive bath products that you bought with your money which was previously agreed to be off-limits from him, into joint usage products, then it needs to come from the joint account. His protest is to stop using the products now? Good. He never should’ve started using them to begin with.", "Sturm not Strum", "NTA. Your bf chose to get an expensive education in a field in which he doesn't expect to make much money. Now he wants you to be his sugar momma and provide expensive things to him. Plus he doesn't respect your property. He must have fine, hidden qualities because on the outside, he is TA.", "Nossa, a vida desse povo parece tão fácil. Imagina brigar por isso…", "NTA. If you both use the products it's a joint expense. Period. That \"financial abuse\" claim of his is a red flag.", "NTA. I have this exact financial arrangement with my partner. That’s the arrangement you agreed and he is the AH for complaining. Either the bath products come out of the joint account, or he doesn’t use them! Definitely NTA", "NTA. \nWomen you are already paying for him to have a decent life which is way beyond his means. With his finances, can he make a living on his own? That doesn't seem to be the case, then you are already giving him a full on decent life while also sharing equal responsibilities on the chores. \nHe should be worshipping the ground you walk on for helping him not just to survive but have a good god damn life as well. \nBut he's being ungrateful and bratty. \nHe thinks you owe him everything including luxuries. \nYou could do better than him; he's mooching off of you. \nTime to get a new and better boyfriend.", "And how is that OP's problem? If he can't even afford to live by himself, then he shouldn't get into a relationship and expect his partner to not just give him a decent life but also coddle him with luxuries. Also he's studying a useless degree which is already a huge problem and it's his problem.\nShe makes a significantly bigger amount than him because she worked hard for it. That's not free money. She works for it. \n It's not her problem that he chose a wrong career or chose a career he likes which doesn't pay him enough for a livelihood. \nIf he's actually making only $20k a year and never would make decent money to survive, then he should effing look for a new career than to mooch off of OP. At this point he is indeed mooching off of OP. She's essentially paying for all his stuff. He would probably be homeless if he earned that less money if not for OP. Hell if he can't even pay for essentials such as a car payment, insurance, and a cell phone he should be on his knees worshipping her, not demanding luxuries from her and calling her abuser. \nAfter writing this, i agree with the commenters; he got into this relationship so that his partner will pay for him to survive, knowing full well he couldn't even afford a shitty apartment, forget decent life. He should be grateful she's giving him a decent life while he's essentially a moocher. \n\nOp can do better than him.", "Dragging the friends into this indicates that A) he's immature, or B) he's manipulative. Given that he was initially dishonest about his use of OP's bath products, I'm going to go with B.\n\nNTA \n\nI'd be having second thoughts about the guy at this point, not because of the bath products themselves, but his unwillingness to be honest and discuss this like an adult. The sneakiness, then whining, then getting friends to pressure her would be a huge turn-off.", "If he is crying financial abuse and getting your friends involved over the expensive bath products you buy that he feels entitled to then what else is this asshole going to cry financial abuse about when you already funding a major part of his living expenses. See his behaviour for what it is. A giant red flag of entitlement, selfishness, disrespect, and that he will make false allegations and try to turn people against you to get his way. I would be reconsidering this relationship. NTA", "thats exactly what i was thinking. they've only been together a year and a half right?", "Reminds me of hearing once that getting a degree is Egyptology is a pyramid scheme, both for the pun and for reality..", "I said specifically that this only applies  when the accused is not being abusive.", "I agree with you"]}