{"id": 15376, "submission_id": "12uk0dz", "title": "AITA for speaking up about my birthday gift?", "selftext": "A few days ago was my (F26) birthday. I’m getting married to my fiancé (M26) in the fall. Something about me, I really really love birthdays. I always have. I love having cake, opening presents, feeing loved by my people, all of that birthday jazz. I really love celebrating other people’s birthdays too. I take a lot of time and energy (NOT necessarily money) to find great gifts for people. \nThe thing is, we’re super broke this year and have been busy busy busy. I understand that money is tight and that life happens quickly but I was disappointed with my birthday gift this year. \nHe got me flowers, which was really sweet. However, that’s all I got. When I asked if he had more for me downstairs, he smiled and said no. His reasoning was that he doesn’t have as much money this year as he has had before and that he couldn’t figure out what to get me. My response was that if he was at Kroger to buy me flowers, I couldn’t believe he didn’t see something there that reminded him of me or he could’ve bought my favorite candy. Just SOMETHING. He hasn’t  been acting the same since and has been kind of ignoring me, so I’ve been wondering if what I said made me an asshole.\n\nEDIT\nokay I get it. \nA lot of you think I’m a spoiled brat. However, there seems to be several misunderstandings. I should’ve communicated more in my OP. I did say thank you for the flowers, I thanked him profusely. I like flowers, it was a kind gesture. I’m floored that there are so many people that think that the very bare minimum (I.e. REMEMBERING my birthday) is acceptable in an equal partnership. TO CLARIFY: I was upset about the lack of effort, not the lack of monetary value. Money is not the world to me, I love him so much and I try so hard to make him happy. I just want him to show that he cares about me and wants me to be happy by taking a few minutes to consider what might be a good gift for me. The amount of people attacking me based on a few sentences is wild.", "created_utc": 1682114418, "permalink": "/r/AmItheAsshole/comments/12uk0dz/aita_for_speaking_up_about_my_birthday_gift/", "score": 224, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m worried I said something insensitive about the effort he made to get me a birthday gift. At the same time, I don’t think I’m an asshole because he knows I love birthdays.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "1) He remembered your birthday.\n\n2) He got you SOMETHING - flowers.\n\n3) He considered you both are on a tight budget since broke and a fall wedding coming up. YOURS.\n\n4) YTA", "YTA here unless there's missing information. By the way you tell the story, he gave you the flowers and instead of saying thank you, you asked if there was more and then complained.", "NTA- I don’t think money really has anything to do with this. Assuming your partner knows how important birthdays are to you, this would’ve been the time to come up with literally anything homemade or inexpensive. Gifts are way more than their cost, and it sounds like receiving them is your love language. I’m sorry you felt uncared for on your birthday! Maybe some further communication would help him understand it was effort you were looking for.", "YTA. \n\n>His reasoning was that he doesn’t have as much money this year as he has had before\n\n>The thing is, we’re super broke this year\n\nIn these circumstances, what were you expecting?", "YTA\n\nHe got you a gift.  You could have said, \"Thank you so much!  They're beautiful!  I hope you didn't spend too much on them since money is so tight right now.\"  Instead your response was, \"Is that all?\"  He could have done nothing.  He could have said that he doesn't have money for anything non-essential and he'd have to get you an extra special gift next year.  He still managed to get you something and you made it clear that it wasn't good enough for you.  Congratulations.  You probably won't get a gift from him again unless he can go all-out because why would he make an effort when it won't be appreciated.", "NAH honestly, I can understand both POVs", "YTA. Next time say thank you.", " NAH. It’s okay for you to feel hurt because this is something you assess love with. It’s okay for him to simply suck at being a good gift giver. I suck at it too and I’ve learned that the best way to go about this is to express my love for the person while warning them about my abysmal gift giving skills. Just have a conversation with your husband, tell him it’s not the monetary value but you feeling unloved.", "YTA. What you said was objectively rude af and extremely ungrateful. You're not entitled to gifts. Not everyone enjoys giving gifts, and not everyone is good at it either - if you want something specific, you should let it be known. Otherwise just be thankful for what you have.", "YTA. He remembered it was your birthday, went to the store and bought you flowers. That was his present, it was the best he could do this year, money is tight.  This may not be the only time in your life when there are money issues. It's nice to have an understanding during those times.", "Yep YTA. He did get you something because he was thinking of you and did pull money out of a tight budget to let you know you are cherished. And you complained immediately. I would also be less than happy about that.", "YTA. You are not entitled to anything on your birthday. People that love you choose to celebrate it. In this case, he got you some nice flowers, and your immediate reaction was “Is that it?” \n\nGive me a break.", "YTA\n\nNot everyone sees birthdays as the huge ordeal you do.\n\nHe did go to a store to buy you something, telling him he should have bought you candy too is a little weird.  I mean, when would it be enough.\n\nHe was right not to overspend if he’s broke, there shouldn’t be an expectation of him going into to debt to buy you something that you most likely don’t really \\*need\\*.", "My husband and I don’t give each other birthday or Christmas presents. Rather, we show each other that we’re thinking about them throughout the day : “hey I saw this thing that you mentioned the other day (new flavor of ice cream, funny t shirt, etc) and thought you might like it.” For no reason, just saw it and thought it might make the other happy. I also know the things he absolutely hates to do that I don’t mind doing, so I do those things for him (laundry) and he does the things I hate (talking to the insurance company). He’ll take my car to be detailed while I’m napping or in a work project. I’d much rather live like this than have the drama around getting the “right” present on a holiday.", "YTA\n\n>He hasn’t been acting the same since\n\nDude is definitely reconsidering the\n\n>getting married in the fall\n\nPart", "LOL Am I missing something here?  He brought you a gift : FLOWERS.  He remembered it was your birthday and brought you a GIFT of FLOWERS.  I have to go YTA here because you're sounding pretty ungrateful, and greedy.   FYI he's ignoring you because he went to the trouble (and expense at a time by when by your own admission money is SUPER tight) and you made him feel like crap.  Honestly you don't sound mature enough to be getting married.", "Flowers ARE something!", "YTA - It's very rude to get a gift and say \"Thanks but is that all you got me?\"", "Info.  Did you have a birthday cake at all?  Cake and a loved one is all you need for a great birthday.", "YTAish, I can see why disappointed. But not everyone puts the same stock in birthdays as you do so isn't fair to hold others to those standards.\n\nMaybe think of it this way.\n\nIn keeping things simple for your birthday and not going all out, he is showing you just how much he wants to marry you and give you an amazing wedding. If you think of the sentiment behind that decision, it was a great gift.", "NTA. Honestly, flowers are okay, but he could have easily written you a love letter or done something for you that doesn't cost money or something.", "NTA because I really think you don't care about the money but the thought. If he had gotten you some candy and drew you a stick figure picture of the story of your relationship or something I think you would have been happy. I also love birthdays. It's not a present related thing but I enjoy feeling loved and cared for on that day. I dont know how your conversation with him went down but it's a bit rude for him to ignore you. I would try to hash this out and explain what parts mean a lot to you. It's the thoughtfulness not the money.", "Soft YTA. \n\nIt sounds like in the past he made more effort and spent more. But this year it just didn’t happen. Did you at least do something for dinner? If he’d forgotten your bday altogether that’d be one thing.. \n\nIf I was you, I’d have smiled at the flowers, thanked him, and let it go. In the future when money and schedules allowed I’d be hopeful for more tho. And if it was an on-going issue where I was putting in effort and he wasn’t, then I’d have a conversation about it.", "I gotta say YTA. I understand being disappointed, but what you said was rude.", "YTA.\n\nYou said yourself you guys are pretty broke this year, why would you be so entitled as to ask for a gift? I personally love my birthday as well, and understand the excitement behind opening presents, but the fact that your fiance made the effort to buy you something despite his incredibly tight budget is more valuable than any other gift. If I were in your position, I would value those flowers so much. I can't wrap my head around the fact that not only were you not appreciative of his efforts, you also asked if there was anything else, and when he said no, you started an argument because you just couldn't believe he didn't get you something else.", "YTA\n\nSentiment over materialism, always. When you care more about him than you do about you, then you are ready for \"in sickness and in health\". Good luck.", "YTA and selfish, you just said that you don’t “necessarily spend (lots) of money” for other birthdays, so do not expect the same in return. He told you he’s strapped and he was kind/loving enough to get you flowers. He still acknowledged and got you a gift on your birthday, that is feeling the “love” from your people. If you can’t realize that than I’m gonna go ahead and assume you’re the self absorbed type that thinks little gestures aren’t good enough for your selfish ass. I hate flowers and if my partner brought me flowers, I’d be happy because it’s a kind gesture.", "YTA. Not a harsh yta but you are. He admitted money is tight, so he tried. You could spend years with a man and he won’t be able to figure out a gift if the money is tight because he wants to give you the world, but cant. When men only want to give you the most, they never think about how to give you the least. So they get stumped when thinking of what to get us when they dont have much money. So try to appreciate he came up with something. Sometimes they think so long and hard you end up with nothing. But he figured something out. Show you care", "YTA. He acknowledged your birthday with flowers, you said you’re broke, so yeah you’re being an asshole by whining about not getting anything else. You have the right to \\*feel\\* however you like, but lashing out at someone you know is broke because they ONLY bought you birthday flowers AS AN ADULT is really childish behavior on your part.", "YTA for not thanking him first, and for the way you communicated. Instead of actually explaining what you needed from him (demonstrating “more effort”) or why it was important to you, you criticized him and essentially looked down on him (you “couldn’t believe he didn’t XYZ”). \n\nI think you owe him an apology. From there you can try explaining where you’re coming from, and maybe listen to his perspective as well.", "YTA He thought about you. This year is tight because of the upcoming wedding. But he did think about you and you basically threw the flowers back in his face. I'd be ignoring you too.", "YTA and may be the reason you’re both broke with your nonsense!", "YTA\n\nYou love everything about birthdays except being grateful for what you get. \n\nBuy yourself what you want. Money is tight. Treat yourself if you want more. \n\nIt’s supposed to be the thought that counts.", "YTA\n\nYou're not entitled to gifts, but it sounds like you think you should be. Your partner got you a gift, and it was flowers. Those aren't cheap! You may not like the gift you were given (though you say you do like getting flowers), but it's really rude to ask if there's more. \n\nNext time, tell your partner what you want instead of being so insulting and asking if there's more... they can't read your mind, and you obviously have ideas about what you feel is a suitable gift.", "NTA you just wanted to be thought of and made special by the man who loves you", "YTA.  You aren't 6 years old.  Birthdays aren't a big deal for adults.  You got a gift.   Grow up.", "This is a grey one, I can see both sides. But I would tend to say NTA, I'm more like you as I love birthdays too, esp when you find the perfect gift for someone, my favorite thing is to watch them open it! Flowers, imo, are the worst gift because they are temporary and don't serve a purpose - unless combined with something. It does seem like an easy out, but on the other side, at least he remembered your birthday so... 🤷🏼‍♀️", "NTA… I think your love language might be receiving gifts. And hence the disappointment. I think you and your fiancé need to talk about this and how gifts are important to you and your expression of feeling loved. \nI will however tell you something…sometimes a persona can have only 100$ and they get you a 25$ dollar bouquet…and at another moment they might have 1000$ and get you 25$ bouquet. The difference is in how in one case someone spent probably more than they can afford and relatively it might not be a lot of money…but for that person in that scenario it’s a lot! \nHopefully this helps you see value in his action.\n\nHighs and lows are part of life…don’t let go of the birthday joy and spirit. Hopefully love compensates for other stuff.", "NAH. I totally get the disappointment. You didn't want anything extravagant, just something that shows he cares. But as someone who is terrible at on-demand gift giving, I also appreciate that having a perfect gift on a specific date isn't always easy. My nearest and dearest have learned that they might get nothing more than a good wish on birthdays or holidays, but I won't hesitate to give the perfect gift on some other totally random day when the right idea hits me.", "NTA. Flowers are the most thoughtless and generic gift possible. Say the bouquet was $15; he could have spent that same $15 on a pretty notebook and heartfelt card and you’d have been much happier. People are saying “it’s the thought that counts” but literally the only thought he had was “it’s her bday, I better get her something, ummm flowers I guess? Sure.” If all the people saying YTA would be happy with the same gift he’d get for his mother, sister and any ex girlfriends when he was out of ideas, that’s on them. You wanted something he put effort into and didn’t get it, of course you’re disappointed.", "NTA. There are tons of things he could have done for next to no money that would have made you feel thought of. Heart felt note, homemade coupon book for massages etc, he could have done a picnic and given you the flowers there. It’s not about money it’s about the effort and thoughtfulness.", "NTA. But let him know how it made you feel, and tell him what you expect for your birthday so it doesn't happen next year. Communication is key.", "NTA- I’d be a bit miffed if my partner got me flowers- they’re about £2-10 where I’m from. He could have gotten you a cute notebook (usually £5-20 where I’m from, so not much in it) or come up with something free and fun for you to do together. Saying “I couldn’t think of anything” is lazy, and suggests he knew the gift was a bit naff.", "Going against the grain here with ESH. You could’ve handled this more tactfully- he did remember your birthday and get your flowers. However, I understand where you’re coming from too. I would at least expect a card with something nice and thoughtful written in it.", "NAH.  Making a big deal about birthdays is important to you.  That’s how you show love to other people and how you feel loved and valued.  So when your fiancé got you flowers and no other gift, you probably felt devalued.  But making a big deal about birthdays and choosing gifts might not equal love to your fiancé.  In his mind, maybe he was showing you love by buying flowers and saving money toward your future, since he couldn’t afford to get you a really “special” gift.  \n\nWhile I think it’s a little tacky to ask “is there more?”, I don’t think either of you are AHs.  Sounds like a communication issue more than anything else.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA few days ago was my (F26) birthday. I’m getting married to my fiancé (M26) in the fall. Something about me, I really really love birthdays. I always have. I love having cake, opening presents, feeing loved by my people, all of that birthday jazz. I really love celebrating other people’s birthdays too. I take a lot of time and energy (NOT necessarily money) to find great gifts for people. \nThe thing is, we’re super broke this year and have been busy busy busy. I understand that money is tight and that life happens quickly but I was disappointed with my birthday gift this year. \nHe got me flowers, which was really sweet. However, that’s all I got. When I asked if he had more for me downstairs, he smiled and said no. His reasoning was that he doesn’t have as much money this year as he has had before and that he couldn’t figure out what to get me. My response was that if he was at Kroger to buy me flowers, I couldn’t believe he didn’t see something there that reminded him of me or he could’ve bought my favorite candy. Just SOMETHING. He hasn’t  been acting the same since and has been kind of ignoring me, so I’ve been wondering if what I said made me an asshole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA he got you flowers and he's tight on money I'm sorry but I find it ridiculous you who is 26 a full grown ass adult is gonna be upset because you didn't get a present I get that some adults still like to have birthday parties and that's fine but to act like this is just really sad I don't even remember my last birthday party I was probably 8 or 9 because my mom couldn't afford them although I was disappointed I still acted more mature than you did he still thought about you and got you flowers grow up", "oh the bar is on the ground", "I understand the way I told the story is odd. I did say thank you before I said anything about something else. I do like flowers, he rarely gets them for me and I was happy about them.", "More than she got, she sounds entitled.", "A little something? Candy or a notebook? Something he knows that I like or have been talking about wanting.", "Although I'm leaning more towards YTA, lashing out like this at someone that is struggling money wise is... Uh, bad.\n\nI would understand more if you only thought about it, but outright saying it? Uhhh...", "It’s not about being a bad gift giver, I think you missed one of the key points in the post….. he’s tight on money right now. She’s just selfish", "OP makes it clear it’s not a money thing. She just wanted something with a little thought behind it", "He going to marry her though. He knows she puts in effort for everyone’s birthday, including his. He also knows it’s not about the monetary value of the gift, but the sentiment behind it. He knows this is her love language and yet doesn’t even warn or apologize for it in advance. How do you love someone while doing something obviously hurtful to them? He could have just bought her something a tiny little bit more thoughtful with the flower money instead.", "I can't judge til I know if there was cake.  Not because it is really the be all and end all.  But if there was cake and you still complained about flowers, you get one judgment.  If he didn't bother with anything except flowers despite knowing how big a deal birthdays are for you, it is another judgment.", "As someone who hates cake, you don’t need cake lol \n\nBut you’re basically right, but so is OP. I’m a little opposite in that I have everything I need, and request no gifts, but I love when people still get me dorky gag gifts, or cute highliters, or my favorite candies. It isn’t about the gift itself, it’s more an extension of the love.", "It’s this EXACTLY. It’s the thought.", "Just because birthdays don’t mean a lot to you doesn’t mean they can’t mean something to others. I’ve lost important people in my life and I’ve learned that it is fleeting. Birthdays are significant to me.", "While agree with the judgment, you reasoning is a bit ridiculous. Birthdays are a big deal regardless of age.", "Lucky you. Where I'm at, a nice bouquet would start at 40 euros. I mean you \\*can\\* go into Lidl and snag one for 5, but you catch my drift. Depending on what he actually bought, the price range would be quite large.", "if simply remembering your partner's birthday gets you praise..\n\nthe bar is in hell", "Grow up, they're two young adults getting married.  Money is tight she needs to get a grip", "So from here... You really have to be the judge. You know what he usually does, you know more about the budget you're in, and you know how subtle you've been about the kind of gift you wanted.", "Nah girl I get ya. Reddit is very non birthday and especially anti birthday girls. The thing that is important is that it’s important to you and you were looking to see what you value reflected back at you. Everyone has different priorities. From one birthday girl to another, it’s ok to be disappointed and it’s ok to have expectations.", "Get your head out of your ass, you even said so yourself that money is tight so stop acting so self entitled and be happy with what you got as a lot of people don't even get as much as a birthday card for their birthday, YTA.", "So if he had gotten you a piece of candy instead of the flowers you would be satisfied?", "Flowers are something. YTA.", "Like...flowers?", "Yeah he could have used that money to get her something a little bit more thought than a flower bouquet. It’s the most thoughtless gift ever. It’s not even an opinion, it’s a fact. A dentist you’ve visited once will gift you a bouquet on your birthday. What about being thoughtful equates to more money? He could have used lesser money to gift her something sentimental and she would be happy. Hell, I’m sure she would be happier with a simple cake and a movie night with her favourite movies.", "She said they're super broke this year", "It obviously is a money thing if flowers aren’t good enough for her. I’d also like to point out that flowers nowadays run $40-70 so it probably wasn’t exactly cheap either if he’s already strapped for cash. She wants a lil something extra after spending two tanks of gas on her? Boo boo, she can go buy herself something if she’s gonna be selfish", "Why don’t flowers meet that requirement?", "How do you tell someone you love, who you know is broke, that their gift is shit and they should have spent more money?\n\n&#x200B;\n\n>She puts effort for everyone’s birthday \n\nThat’s very nice, hopefully the other person appreciates that, but you shouldn’t do those things expecting something in return.", "You seem very invested in this.  How much effort should he have put into this? Would a macaroni birthday card have been better?  That has no monetary value but takes time and thought.", "Ah now I understand, getting her flowers on her birthday is equivalent to abuse and she should break up and go NC. Jeeze, she is not wrong from expecting something else, she is wrong and TA for explicitly asking if there was something else. That is rude and lack of manners.", "Heresy!!  Lol", "This is also my thought. However, I think your delivery may have been off slightly. You know he's probably sensitive about his finances, but he might not realize it is truly about the thought. I would apologize to him, something along the lines of \"I'm sorry I reacted a bit harsh on my birthday. I know money is tight, but I don't want you to think it's about that. I just wanted to feel like you put more thought into it than a small bouquet of flowers. I don't care if you didn't even buy me anything, I just thought you might have cared a bit more to give it some extra, home-made effort.\" That way he understands it is seriously not about money and he feels seen.", "I mean, maybe he was planning to spoil you in other ways than a gift and then you go and say \"is that it?\" \n\nI'd be like....no back rubs and making breakfast and lavishing love on you", "You got a gift.  Period.  End of story.\nGrow up.", "40 euros is a lot of money to spend on something pretty impersonal and temporary- especially when you can get something personal and permanent for the same price or less. Judging by the tone of the OP, I’m guessing the flowers were more Lidl/ supermarket prices. Either way though- I think the point was more thought and personalisation could have gone into the gift.", "I was commenting on the fact that if REMEMBERING the birthday of the person you’re engaged to is the first standard, then the bar is on the ground. Also confused what money has to do with anything- she never mentioned wanting an expensive gift. Gifts can be free.", "All you’re proving is that we live in a society that is selfish and more concerned about gifts than the thought behind it. It really is simple, gifting flowers does have thought behind it. I’m genuinely not sure why you’ve got a hard on for this dentist that apparently gives out bouquets but that doesn’t exist. I have never gone to a dentist that just gives out bouquets to patients, none of my family has, none of my friends have, so it’s a great made up excuse. If this so called dentist does exist, he’s got some serious class and is very thoughtful!\n\nPS. It is not a fact, might be a personal opinion to you but tons of people love flowers and you can cry that they don’t and scream about it on here till you’re blue in the face but you’re still wrong.", "What about “a little thought behind it” indicates the need to spend more money?", "He could have bought some crafts and made her something for the price of the flowers. Did you not understand the comment above? It's the thought. It takes no thought to go into the grocery store and grab the cheapest bundle of flowers and call it a day", "He didn't buy flowers that were special to her. He bought a generic gift. She didn't want a more expensive gift, she wanted a personalized gift. One that was obviously purchased with her in mind. NTA", "[removed]", "Bro she’s allowed to be hurt her fiancé doesn’t know one of her love languages. This is like basics of being in a happy relationship, like basic decency.", "Yea I’m invested, I’m bored as hell. Also  idk maybe just gotten her her favourite food and had a movie marathon with some movies she loves would be a cheap alternative. I don’t know her. He does. I’m sure like 10 minutes of thinking could have helped him come up with something. I’m a terrible gift giver and have a lot of friends like OP. I always apologize in advance and tell them I love them so that they know my gift doesn’t translate to anything other than my horrible gifting skills.", "Honestly, I'd be happy with a macaroni birthday card because then at least I'd have known he put at least some kind of effort into my gift.", "Yeah I get that reaction a lot. lol \n\nMy job had an ice breaker meet & greet my first day, and the question was to list your favorite cake…I’m like, “I don’t like cake” and seven years later people still reference it or talk about the girl who hates cake 😂", "OP's boyfriend definitely needs to learn his audience. Personally, I would be ecstatic over a pretty bouquet, but then I'm an ecologist so for me a personalised bouquet would be very meaningful. Think: the language of the flowers, flowers that are meaningful in some way (I'm from a city famous for its roses, my national flowers+his, etc.). I do admit, I'd be slightly disappointed by Lidl flowers but they do have some absolutely gorgeous tulips this week, so...", "She specifically said he could have bought her something else at Kroger, meaning she expected him to purchase her a gift in addition to the flowers.", "I’m really sorry for you if think gifting flowers has real thoughts behind it.\n\nAnd yeah, it’s a thing for dentists and other businesses to give out flowers for festivals or birthdays where I live, mainly as a marketing gimmick. I always found it weird", "She said she actually loved the flowers so really she’s just being a bit greedy and entitled", "She clearly stated she liked the flowers. So it's obvious that he did think of something she would like on a budget. Too bad he wasn't a mind reader and went the extra mile with a piece of candy. Booo....", "I’m unsure of how you think flowers are not thoughtful? Do you know how many women love flowers? Personally I hate flowers but if my mother only ever got flowers as her gifts she’d be fuckin tickled pink.", "Wow! I was taught when someone gives you a gift you say \"Thank you\" not complain about it. \n\nI'm assuming this is not the first time they're celebrating her birthday as a couple. He obviously did better in the past or she would have mentioned it.  If she  has expectations of what he needs to do to make her birthday special then that's a discussion a month or two before the next birthday. Not right here hands you his gift.", "Love that when people start to feel they are wrong they automatically go to trying to insult you lol. \n\nFor you it might be the most thoughtless gift, you might not like flowers but do you know how many people love them? That’s a great gift, why do you think so many holidays are centered around giving them as gifts? Because they have a huge market of people who love and enjoy them. You’re right, he could’ve spent the money on something else. He also could’ve just not gotten her anything and saved his money. He obviously felt she would like the flowers and from her comment saying she thought it was sweet, I’d think she probably did like the flowers. She was just so damn selfish she needed more.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "WTF with the “bro”?\n\nAlso, saying this is a “love language” is asinine.", "I hate cheesecake.  \n\nHonestly I have never tried it.  I just assume I don't need another dessert in my life.", "Her example was “candy” which is what, $2? I think it’s clear from that it’s the effort she was wanting, not an expensive gift", "I’m really sorry if you’re so self centered and selfish, as well as entitled to think that you deserve more than what people have given you out of the kindness of their hearts. It makes me feel really sad for you.\n\nEdit: nice edit there at the end, I’d genuinely love to take a poll regarding this as a gimmick because it doesn’t exist. Maybe in the 1960s when people actually had some human decency or you live in a utopian society.", "Depends person to person as you just mentioned. Clearly OP didn't think so. And I personally don't think so as well, depending on the flowers. If you just go into a Walmart and find the cheapest flowers, that's not very thoughtful, is it? On the other hand, if OP had a favorite flower and her bf searched around picking and choosing to find the best arrangement for a reasonable price, and maybe included a card with a heartfelt message it would be different.", "Your first statement is simply not true. I’m sticking to my argument, I’m just saying what I think of your opinion.\n\n“I’d think she probably did like the flowers. She was just so damn selfish she needed more.” You’ve called her selfish twice already, when she’s made it clear it’s not about the money. You’re so hellbent on making this woman a golf digger to suit some twisted narrative in your mind.", "Your first statement is simply not true. I’m sticking to my argument, I’m just saying what I think of your opinion.\n\n“I’d think she probably did like the flowers. She was just so damn selfish she needed more.” You’ve called her selfish twice already, when she’s made it clear it’s not about the money. You’re so hellbent on making this woman a golf digger to suit some twisted narrative in your mind.", "I use bro as gender neutral, my apologies. Also don’t make it my problem if you don’t know one of the most basic, wildly known in pop culture, love languages.", "Your last sentence in the previous comment stated gifts can be free, not inexpensive hence my comment pointing out her expectations", "I… never said I was particular about gifts? I have a strict no-gift policy for my birthdays because I’m a shit gifter myself. Your aggression is really telling of your biases. I was advocating for OP because I don’t think there’s anything wrong with what she likes, even though I cannot relate to it. It would really help you try to be more open minded, including for the stupid businesses’ flower gifting part. You really can’t believe it happens somewhere in the world because it still doesn’t happen where you live? Can you handle anything other than your preferences and experiences?", "[deleted]", "You can stick to your opinion, that’s great! I’m going to stick to mine. And it is selfish, being selfish doesn’t require money. Selfish is not being happy with what you’ve been given or gifted which she is, instead she asks for more. I genuinely wonder if people on here have any human decency or respect for other humans or are only concerned with themself and what they can get from others. It really is quite sad. \n\nThat’s my opinion and I’m sticking to it.", "“Bro” is douchey.  Stop it.", "I almost just died, my aggression? That’s the funniest fucking thing I’ve heard all day and I’m not shitting you🤣🤣🤣\n\nI love when people do this “it’s so telling about you” like you weren’t the one that went there first. What was it you said? I feel so sorry for you? I just returned the energy. Don’t throw stones when you live in a glass house. \n\nAs for this conversation I’m quite tired of it, I’ve spent all day taking care of patients, maybe I’ll be a decent human being and send them some flowers lol. Have yourself a good one", "You’re trying so hard to read into things to make yourself feel right. You’re assuming he went to the cheapest place and grabbed the cheapest flowers without even looking. We’re you there? Did you watch her fiancé go to Walmart? No, you didn’t so your assumptions are mute. Could he have gone and picked out her favorite flowers? Yes. \n\nYou say there’s no thought there behind his actions. He could’ve simply not bought her anything that isn’t considered an essential because he’s broke. He chose to spend his money, go out of his way to grab her the flowers and give them to her on her birthday. That is thought right there.\n\nEdit to add: you’re also making assumptions about OP, she said she thought the flowers were sweet so she obviously appreciated them. She is just selfish and wanted more which is why she is asking if she is the AH or not.", "Oh my god, a woman told her fiancé how she feels about something related to her! The audacity! Heaven forbid some open communication takes place or else how will resentment fester.", "So you have no argument. Got it.", "You’ve used the words selfish, self-centered, greedy, etc so many times but I’m the one who went there first when *checks notes* you REPLIED TO ME (calling her selfish on your first reply that too). I hope you treat your patients better", "I just read what OP posted lol. She said he went to Kroger. A grocery store similar to Walmart...and he clearly didn't get her favorite flowers considering she said he could have gotten her her favorite candy. Seems pretty obvious either he didn't get her her favorite flower, or she doesn't like flowers in general. Sounds pretty thoughtless to me.", "Okay don’t change the topic, it wasn’t her talking about her feelings and communicating. She asked if she was an AH for asking for more and she is. Like I said, you’ve got your opinion and I’ve got mine. \n\nNow quite harassing me on different threads, have a great day!", "You bet your fuckin ass I do, just like I treat my partner better. Again we’re talking about personal opinions. I do think she’s selfish. I do think she’s self-centered. I do think you’re wrong but again as an adult and apparently the mature person in this conversation, I agree that you can have your own fucking opinions to, that’s awesome. Grow the fuck up and get passed the petty bullshit blows, holy shit. \n\nPS: I responded to you on this thread but you found me and continued to harass me on this one\n\nEdit to add: love when people edit their posts to make themselves look better. For additional context so my comment makes sense, they started talking shit and making petty comments about my job as a nurse doing patient care and insinuations on how I treat my patients.", "I genuinely feel bad for men in this day and age, nothing is ever good enough. We’ve made generations that are so selfish, self centered and entitled.", " “When I asked if he had more for me downstairs…”\nYTA", "I think NTA. Unless he knows you really love flowers and he chose your favourite ones, flowers are the easy “no need to think” option. It sounds like you just wanted a little bit of thought (not money) put into your gift.", "you sound like a nightmare YTA", "I think it’s absolutely wild how many people are calling me selfish. My fiancé and I had a conversation afterwards about putting more thought into a gift, to which he agreed. He bought me 6 dollar Kroger flowers and called it a day. People keep saying “he remembered your birthday and got you something” which is quite literally the bare minimum when it comes to caring about someone. I was upset that he didn’t put effort into a gift. It would’ve taken two seconds to buy my favorite candy (which shows he at least knows something about me). That was my problem, I’m sorry I did not communicate that well enough in the initial post.", "OP, based on all the comments, you know some people have vastly different opinions here. On what is right or wrong. Spoiled or normal. Etc. \n\nThat is the judgment you need to take away from this. Most people have different standards for gift giving. \n\nThe expectation he should do or buy more may be valid. But money is tight, so it was a bit rude to ask if it was all you got. \n\nIf the thought is what counts, and he could only afford one gift, the question is did he get you your favorite type of flowers (roses, daffodils, etc), color of flowers (red, white, purple, etc), etc. If you are not happy and he got everything right, this is a you problem. \n\nNo one here would think of saying Y - T - A if your favorite flowers were ranunculus and he bought you lillies that were on sale. That isn't a thoughtful gift. it's a 'I forgot and went to the grocery store'. \n\nToo much information is missing. And by your comments, you wanted him to buy you something else at the store. But if he made you dinner or popped some popcorn and had a free in home movie night  with your favorite film, then you are NTA. But your comments and OP imply that it may be that you want 10 gifts and a party, or you may want some effort. If it's the effort, next time, dont ask if that's it and talk about it the next day and explain to you would appreciate more thought in your gifts.", "NTA\nI don't really get all the Y T A posts- they are getting married, which means the fiancé should know by now how much op loves birthdays. And those claiming she's selfish because she wants more than flowers ???? Flowers are literally the lowest effort. He didn't have to spend money, he could've made something like a memory box or literally anything. I would be disappointed too", "NTA. He knew how important birthdays are to you and failed to do something meaningful.\nIt's not hard to write a heartfelt letter or spend an extra fee bucks on some candy for your FIANCE... maybe even spend the money he paid for flowers on something you could actually use that shows how well he knows you.\nI'm not sure that being angry about it was the right approach but I definitely can understand why you might have expected some more effort from him.", "Info:\n\nIs the issue what he got you or that you feel it was thoughtless in comparison to the effort you expect from a spouse's gifts to one another?\n\nInfo: \nAs someone who buys flowers from Kroger regularly... Was it a bouquet ($15) or individual packs arranged by himself ($4 a pack, 3 will make a pretty one), as a self arrangement is very thoughtful.", "YTA. I understand you're disappointed, but as you pointed out, money's tight. You're planning a wedding.  He got you flowers and all you can think is \"But I wanted MORE\". Thats how  you sound right now. he's also probably feeling like crap right now.", "It's your birthday--he brought you flowers.\n\nMoney is tight--he brought you flowers.\n\nHe's not as flush with cash as last year--he brought you flowers.\n\nWhat's the matter with you?\n\nYTA\n\nETA: Here's a short story by O. Henry, *The Gift of the Magi*. It involves gift-giving and a married couple. If you've read it, it's worth another read, if not, you may appreciate their circumstance.\n\n https://americanenglish.state.gov/files/ae/resource\\_files/1-the\\_gift\\_of\\_the\\_magi\\_0.pdf", "THANK YOU. What’s with all these people who think she should be sooo grateful that her fiancé bought her a grocery store bouquet. No thought went into that gift. There’s so many nice things that one can do for free/cheap that would show more effort. He could prepare her a candlelit dinner, he could give her a massage, he could write her a poem or heartfelt letter, make her a card, make her a gift basket of her favorite candies/treats…anything that shows that he actually knows her and what she likes??  These people are getting married; he has to know much birthdays mean to her and should be putting in a BIT more effort.", "> But not everyone puts the same stock in birthdays as you do so isn't fair to hold others to those standards.\n\nNot everyone, but I do feel like part of a successful marriage is being able to communicate and work towards each others needs. The one person you should be able to count to take into consideration your views on your birthday is your SO.", "Why are you here asking then if you think it's absolutely wild?\nFlowers are something you like, and something you havnt gotten in a while, they show you that he was thinking about you and willing to spend money (WHILE BROKE) to make you smile and feel loved on your birthday. \nTHE THOUGHT WAS HERE what wasn't was funds.", "My issue is that he picked up flowers on the way home from work for my birthday. So I think my answer is the second option", "Dude, the two rules of presents, always say thank you, and never demand one.", "A cheap meaningless gift from the checkout line just to get the dollar value up?", "Like FLOWERS?! How dense are you, I hope he cancels your wedding and gets someone less materialistic and selfish.", "You said it perfectly!", "u/chuckberrylives  u/gorditapollo sounds like you and idiot op would make a lovely throuple 😀", "> I’m really sorry for you if think gifting flowers has real thoughts behind it.\n\nWhat? There are many types of flowers, picking out ones that you specifically think the giftee might like certainly requires thought. I don't know how much thought was put into OPs flowers, but I certainly put plenty into mine whenever I gift them.", "It’s called an ad hominem attack. If you can’t stand in the merits, attack the person.", "Disagree. He didn’t pick or arrange those flowers, he bought them. No cute date or anything. It’s an afterthought.", "I don't see how there's really more effort put into getting flowers and candy than there is getting just flowers.", "Lol she didn’t talk about her feelings. She said “is there anything else downstairs” and got upset she didn’t get more from someone she explained a few sentences before is broke. She’s a selfish AH and entitled. Bro g ungrateful and telling your SO isn’t “talking about feelings”", "NTA it's not about spending money it's about putting some effort in. Take her somewhere that has an amazing view to give her the flowers. Say something 'I can't afford much but thought you'd like this spot, the view is almost as beautiful as you'.  All those people saying she is entitled for wanting something more are focused on the dollars and that's not it at all. It's about knowing he cares enough to put some thought into it!", "NTA\n\nI honestly feel crazy reading these comments.\n\nI don't know exactly how tight your budget is. If it's literally 'we can't spend a single penny' then I yeah, you're TA. But it doesn't read to me like that. So he couldn't make you a cake or a card? Buy something some cheap candles or put music on? He couldn't have made you breakfast in bed? Written something for you? Planned a romantic walk or meal at home? There are so many cheap or completely free options he could have picked but he chose to do absolutely nothing because it was easier for him. This is your birthday and he didn't put a single ounce of thought into it for you. You're definitely not TA for being upset when there's so many options he could have chosen.", "I don't understand why there are all the why tee ays. Your fiancé should presumably know how much birthdays mean to you, and didn't put much effort into it. He missed an opportunity for creating a nice experience - it doesn't have to be about money.\n\n&#x200B;\n\nNTA.", "NTA. it’s about the effort. he could have given you a card($1), candy ($1-$5) or literally anything more than the flowers that will die in 3 days. he knows birthdays are important to you and the effort people put towards you on your birthday is EXTRA important to you. Especially since you put the effort into others birthdays and not having that reciprocated makes you feel like shit.", "NTA. I get it. I’d be hugely disappointed too. Same thing happened to me with Mother’s Day. He got my flowers.  At least do some free art work with my son’s feet or something.", "NTA you can state your feelings when your disappointed. It wasn’t the gift that’s the issue it’s the effort. I am sure there are other low budget options he could have done as a present. I’m for birthdays it should be more of an effort then flowers", "NTA. He totally half-assed it.", "NTA. But I think flowers are a horrible gift. They just die and you’re left with nothing.", "Nta. I love how gifts are an identified love language and people are still calling you selfish. The bar is in hell if going to the store on the right day and buying flowers is enough for someone who loves birthdays and puts thought and effort into them. Bet this wouldve gone way different if he wouldve presented the flowers on the table with your fav meal. Or in your freshly washed and detailed car. Or at a intimate spot in a nature space. Sorry to anyone here that thinks shes the asshole for being disappointed in the lack of effort, but your standards are trash.\n\nEdit- hell, she said she wanted something like a damn journal, something useful and low cost that doesnt die and rot and shows he thought about what *she* would actually like. Im just amazed at this comment thread, honestly", "When I had no money, I bought five clay pots and painted them with designs specific to what my partner liked with dollar store acrylic paint, with an IOU for cacti to fill them (we were moving cities in two weeks so I didn’t want them killed in the drive). Decorated with stuff from the dollar store, baked him a cake and had a taco night watching Netflix. Cost about $30 but it was one of the best birthdays we’ve ever spent together. You can put thought into a cheap gift, that’s all you wanted! It’s clearly not about the dollar amount, but the effort and consideration. NTA!", "kiiiinda yta. i can understand loving birthdays. personally i LOVE giving gifts and putting a lot of  thought into finding or making a gift for someone, but i dont expect that back from my loved ones. he thought he was doing something nice for you even though he didnt have money. you hurt his feelings", "Have you ever heard of the five love languages book? I suspect your love language may be gifts. Maybe read it together as a couple if he is willing. You may be surprised to learn what his love language is. I dont think it is unreasonable to say what you need to feel loved or to be disappointed if this is the way you feel loved. NTA", "Breakfast in bed? Something written? Music and candle? Romantic meal in? Literally anything from the huge list of free stuff he could have done but couldn't be assed to?", "I don't get why everyone is obsessed with his this budget. There are so many free things you can give a partner but he decided to do exactly 0 of them and get her a basic, I-don't-know-what-to-get-you gift instead and she's supposed to be ok with that?", "He should reconsider marrying you. You don't seem to be quite practical enough.", "Exactly what I came here to say. YTA", "Is it more that flowers are a low-effort kind of gift from a partner? They’re a beautiful “sometimes” gift, but it’s kinda what you get someone when you don’t know them very well, or they’re in hospital, or someone’s died or something. I get the feeling it’s less about you wanting something exxy and more about wanting something more personalised to you.", "You mentioned that you had lost people. Then you should know birthday gifts aren't important. Nice to get yes, but important, no.\nI hope you're being nicer about the wedding but I have a feeling you aren't.", "I mean, wouldn't he have made it known? \n\n\n*Hands flowers* \"And I have something special planned tonight\" or \"Get comfortable cuz I'm gonna spoil you today\"\n\nIdk anyone who just hands someone one gift and doesn't even hint or elude to a surprise? And I mean, I'd probably ask too if that was all if it's my birthday and you handed me just flowers? But in my case, I'd much prefer snacks over flowers. As pretty as they are, you can get more snacks for the same price of flowers.", "She literally mentions in the post that even a small candy would've been nice....\nThe lowest flowers go here is $10. For that price, he could've gotten her a basket of snacks from dollar tree (assuming they have one since she mentions krogers)", "Maybe he was like gonna surprise it after the thank you? Idk. I'm someone who despises getting flowers for anything because all I do is kill them and I still wouldn't react how she did", "MAYBE WE WILL", "In another comment she mentions she said thank you first than asked. Maybe its my autism getting in the way because that seems pretty reasonable. With so many cheap gift giving options available to us, I'd be pretty taken aback if my partner who planned on marrying me only got me flowers. \n\nThe first gift I got my partner of 3 months was from dollar tree, I had $10 to my name and I was still in high school. I got a few fake flowers for $3, a basket for $1, and then q bunch of candy and a hot wheel since I knew he was getting into those at the time. I would not be able to sleep at night had I given him just flowers and he gave me the fake customer service thank you.", "It's an extra mile to get a piece of candy? I mean they literally have bundles that come flowers AND candy. I mean seriously,  you pass up an entire selection of candy as you check out. It's can't possibly be considered \"going an extra mile\" to pick up a $1 bar of chocolate.", "NTA  I get it.  It's the little things right?  It's not about the money.  Flower, a candy bar (he knows you love) and a homemade card would have been enough.  I get it.  Gently explain that to him.  Tell him you're not mad, you're a little hurt that he didn't put effort into it.  And suggest small cheap or free things he could have done that would have been fabulous.  Maybe then he'll understand.\n\nGood luck and Happy Birthday.", "Men don't understand personal effort counts.  Light a candle and sing.  Write a live letter.  Breakfast on bed.  Cheap dinner on fancy plates. A fun treasure hunt for love notes.. or love notes in a jar.... nta", "Maybe an unpopular opinion but NTA— there are plenty of things he could’ve done that are free and shows he cares. Off the top of my head— planning a picnic by the water, writing you a thoughtful letter, setting up the living room for a cozy movie night of your choosing, offering to pamper you for a day, etc. all of these things cost him nothing but are worth a whole lot.", "NTA at all, people are acting like you're saying he should have spent hundreds of dollars on some extravagant gift. Flowers are nice but they're not personal at all. A card with a heartfelt message or a romantic home-cooked meal is a great way to show your love without spending a ton of money. Flowers are so low effort. A gift doesn't have to be expensive to be thoughtful!!", "Nta", "NTA", "NTA thoughtful crafts or doing an at home date with your family home cooked meal and a movie would've probably pleased you and been within budget.", "NTA your love language must be gift giving and he gave you someting with no meaning behind it. Even as someone whose love language is not gift giving at all, I can understand that.", "I get you. I love sentimental gifts too regardless of how expensive they are. My partner is not great at doing this though which I've just had to accept lol!", "NTA", "There are different ways to show caring. Over the top birthday stuff is not important to most adults.", "Gentle YTA, I think that it’s easy to forget that not everybody has the same love language as you. It sounds like yours is definitely gift-giving, but it doesn’t sound like your fiancé has the same one. So seems like a lack of communication regarding how you’d like to give/receive love.", "“We’re super broke this year” “money is tight” “doesn’t have as much money this year” I got something and still bitched about it. “A few minutes to consider what might be a good gift” he got you flowers. That’s something. Better than nothing. Entitled AF. YTAH", "YTA. In the future, just give him a demand list for your birthday.", "Been broke, still planned a nice little birthday in the past. Flowers first, then a home made meal, etc.\n\n The issue is, if I got the first step (flowers) and was met with \"that all?\" Response, I'm not sure I'd be willing to go through with steps 2 and so on. \n\nYTA", "My man was out of state for my bday, he called me at midnight to wish me happy birthday but when he came home, didn’t bring me or get me anything. Oh man, let me tell you how mad I was. Not one bit. Because he still remembered and I don’t expect anything from him. My point, at least your fiancé brought something home to you, be appreciative. YTA.", "I don't even have to read it all.  The first 2 sentences scream nothing but pure self-centeredness and entitlement.  YTA", "NTA. In my experience flowers are a phone-it-in gift for when you can't be bothered to find an actual gift. If money was an issue he could have made you something. It's the thought that counts and it frankly seems like he didn't put any thought in at all.", "NTA! I don't think you're spoiled at all. You weren't expecting a diamond bracelet just a bit more thought. Jeez a handmade voucher for a foot rub or something would have been nice", "Thoughtfulness.", "What's ungrateful is a partner that doesn't try on your BIRTHDAY. a letter of love is FREE. Flowers are thoughtless, it's a cop out. You can give almost anyone Flowers. \n\nBreakfast in bed, or a romantic home cooked dinner, or a day centered around her and doing things she wants to do... it sounds like he just got a bouquet and called it a day. Where is the effort? Effort costs nothing.", "If your partners love language is gift giving you can put effort into getting a meaningful gift once a year. \"I'm not good at that so I got you flowers\" is not being a good partner lol.", "Oh hun, I think these people just haven't been in actual relationships. I'm married. My husband was terrible with birthdays, despite me putting an ENORMOUS amount of effort into his!! I made him candy baskets, I cooked him food, I wrote cards, and anything else I could think of, money or not! \n\nAt the beginning, he didn't try at all. He said he would buy me a gift when he got paid later in the week... he told me the day of my birthday. We had to have a real conversation about how much it hurt that he did that bc I always put so much effort into his days. And now, he's great at it! He's learned how to communicate if we're in a tight spot, and even if he doesn't have money, he makes the day special. \n\nIf I only got flowers, I would have said the same thing!! \n\nIt's a learning curve..it hurts, but if you express your feelings and he's receptive to it, you'll have to just hope for better next year. Hopefully you grow together through this experience.", "Man if I was getting married to someone and they did this... I'd be sad. Broke isn't an excuse to not plan. Make her a nice dinner and have a movie marathon on netflix. Light some candles and run a bath. Write a love letter. Make a jar of reasons he loves her. I took my ex on vacation for his birthday. I got grocery store flowers and that's it. Yea it didn't last.", "Well I'm glad that op is a 7 year old that got a toy she didn't want on her birthday and threw a tantrum. Oh? That's not what's happening? I couldn't tell from the way you worked this. \n\nThey are about to get married. Flowers are a good gift if you're still learning about someone. If you've known them for years, you should know if they don't LOVE LOVE flowers, it's a shitty gift. \n\nShe said even CANDY would have been fine. Just her favorite candy. \n\nHad the man who claims to love her put in a modicum of effort, i doubt this post would be here. Notice how the only thing mentioned that he did AT ALL for her BIRTHDAY was buy her flowers. Where's a card? A letter expressing your love that she can keep forever is free. \n\nObv. Finances are expected to celebrate their SOs birthday. He couldn't communicate that he wasn't sure what to do, given their money situation?? And if you think it was her job to ask him about her birthday plans that are usually a surprise... why?", "She said thank you, and When there was no follow up on his end for anything else, asked, \"is that it?\" \n\nWhich is a solid question. Where's the romance? We don't know the flowers were nice. He doesn't have money, they were probably the cheapest he could find at the store. And she didn't mention they were her favorite, so I doubt there was thought into the flowers. He could have, for the same price, gotten her some of her favorite candy. He could have made her breakfast in bed and spoiled her all day..could have asked her what's something fun she would want to do at home. If He could only do flowers, why not warn her ahead of time? Why not ask the birthday girl what she wants for her birthday? And then have a realistic conversation that while he can't do much with money, he wants to make the day good for her. \n\nIf im marrying someone - im entitled to them caring about something i care about! Like my fucking birthday!! Give ME a break with these childish ass responses.", "If you ONLY got flowers, and no other gesture, would you feel the same? \n\nOne small kind gesture is something I expect from my fiance any day. On my birthday, I'd want a bigger gesture. And NO That doesn't mean a monetary gesture. There are plenty of free, thoughtful things he could have planned. Instead he copped out on flowers and thought that would be enough. \n\nIt's not about the money.", "He did the bare minimum and you think the money is what she's upset about? Your reading comprehension is off. \n\nShe said she didn't care about money. She would have been fine with her fave candy. I'm sure a letter or a card, breakfast in bed, or literally anything that shows he loves her. She has confirmed in the comments she would have liked anything else with thought and no more monetary value then he spent on the flowers. \n\nFlowers are a gift for people that don't know eachother well. There are a rare few people that genuinely love flowers, and if he knew she fucking LOOOOVVEESSS flowers, it's a good gift. But she doesn't. She's okay with flowers, they are nice, but it's not thoughtful at all. It's a very generic, quick \"I saw this at the store and this is a good default present\" they weren't even her favorite flowers. Just a bouquet. \n\nShe wanted to feel special and loved. Where is that in his gift?", "So because you have low expectations everyone else has to as well??", "My comment might get buried, but it sounds like a miscommunication of love languages. I would definitely recommend you read about the 5 Love Languages. It's something my husband and I read and discussed before we got married, and it really helped!\n\nNAH", "And is that what you focussed on conveying rather that he didn't buy something else. From your OP it sounds like you emphasised he didn't buy you more rather than he didn't do something extra thoughtful, say make breakfast/a cake because the effort shows he cared.\n\nI think you need to apologise but explain it wasn't monetary value you want but thoughtfulness.", "This is what he heard… “Thank you for the flowers… what else did you get me?”\n\nNow he’s second guessing if he should marry you, I’m betting.", "Exactly! I'm broke right now, but I've just realized that my fiance's love language is gifts, and I'm a decent enough artist, so I've decided I'm going to make him a little book, with nice art paper, tied in ribbon, and I'm going to calligraph and illustrate each page. \n\nThe first 10 pages will be \"10 good things (that I love about you)\" because he once told me that it takes 10 positive statements to overcome one negative statement in the human mind. \n\nThe next im-not-sure-how-many pages are going to be personalized \"love vows\" including both phrases from traditional wedding vows all over the world, and personal ones like \"I will always try to remember that you like a glass of milk with your pb+js.\"\n\nCost: $0 as I already have the paper, ribbon, colored pencils and markers. When people say it's the thought that counts... That's really true! It's the THOUGHT, the TIME and the ENERGY/EFFORT that really makes something meaningful.\n\nOP, you are NTA. He could have done better, and you were not unkind in your disappointment.", "Flowers ain't even cheap. You can buy something more meaningful with 10$ than flowers.", "Yes, this!", "That's so lovely. My fiancée made me a little photo album and played music while we danced for our anniversary. It was the sweetest thing, I've kept it in a little box.", "Flowers are so low effort. It sounds like that's all she got on her special day. What about a stay in date where he cooks for her? Bakes her a cake? Gets her a card with a handwritten note, or a letter??? \n\nFlowers are a nice gesture, but if you're low on cash, any other gesture that costs the same amount would have been more personal and loving.", "Maybe think for a moment", "Absolutely no one brought up abuse you weirdo", "Awh ❤️ that's adorable! And thank you! I'm still sort of pre-planning but I'm really excited about making it!\n\nOne year for my birthday he gave me a little medicine pouch that he'd filled with heart shaped rocks and little mementos of that year together - there was like, a bottle cap from the beer we shared at a concert, a tiny piece of driftwood from our favorite beach, a lil picture of us, a bunch of little things like that. It was amazing and like ofc I am keeping that forEVER!!\n\nAll these people here thinking OP is hung up on money are totally missing the point, I think.", "Also, I really love your username! Mind if I steal the idea and draw some?", "He might have been planning to make her a nice dinner or something, but she didn't wait that long before deciding he'd fucked up. She didn't even wait to get downstairs she had to ask \"is this it?\".", "But then she said if he would have gotten her her favourite candy she would be happy. That’s also super low effort? How is that different from flowers?", "Flowers are a generic gift. He didn't pick out her favorite flowers. He just picked some up at the store and called it a day. You really shouldn't give flowers to somebody you're super super close with unless you know that they LOOOVEEE flowers. All the girls I know like flowers, but would certainly not prefer them to any other cheap gift you can get. They die in a few days anyways.\n\nAND She said her FAVORITE candy. If he had gotten her random candy that she was ok with but didnt care for much, that would be just as bad. It shows he remembers what she likes, and put some thought into it. He could have also written her a birthday card with a sweet love message that she could keep forever. He could have done anything other than flowers.", "Because they're a generic cop out gift 99% of the time. Now if it was personalised, like her favourite flowers or something, theres effort because you had to remember her favourite ones and specifically find them. However if it was just a random bunch of flowers that he grabbed during a shop, there's literally 0 effort there. \n\nIt's the same with the candy, finding her favourite candy and buying it is effort because again, he would have to remember what it is and go out of his way to buy it."]}