{"id": 15396, "submission_id": "12uvysq", "title": "AITA for more or less telling my parents that I trust my ex to care for my daughter, more than I trust them?", "selftext": "\nThis has wreaked havoc across pretty much my entire family so I wanted to see if other people think I’m in the wrong here.\n\nI (29f) have a 9yo daughter named Allie that I share split custody of with my ex bf Chris (32m). Despite us not being together, we have a really good coparenting relationship, mostly due to the fact that we both grew up in homes with dysfunctional family dynamics and we didn’t want the same for our kid.\n\nWhen he and I ended things, we both agreed to mutually make eachother the inheritors of our will & life insurance. We did this so that if something happened to one of us, the other would have the funds to care for our daughter as though both of us were still here. There is money we have set aside specifically for her to use as she wishes, but she won’t be able to access the account until she’s 18.\n\nMy parents were aware of this arrangement we had, and at the time they didn’t express any issues with it.\n\nChris is getting married soon to his fiancée Maya (31f), and after hearing about the engagement, my parents have asked me if I’m going to be naming them as my beneficiaries.\n\nI informed them that I wouldn’t be, and they got upset and told me that it’s ridiculous for me to give everything to my ex when he’ll clearly be able to support Allie with a two household income and that they would benefit from an inheritance more than he would.\n\nI said that I wouldn’t be changing my mind, and I told them that with the way they’re acting about it now, I trust Chris even more to use the money to care for our daughter than I do them.\n\nSo now my parents are telling our family members that I don’t trust them with money, or my child’s well-being if something were to happen to me. Most of my family is now calling me all sorts of names but mostly just saying how awful it is for me to think of my parents this way.\n\nHonestly I sort of don’t trust my mom and dad, mainly due to how they’re acting now, but maybe it was wrong of me to tell them that so plainly?", "created_utc": 1682141535, "permalink": "/r/AmItheAsshole/comments/12uvysq/aita_for_more_or_less_telling_my_parents_that_i/", "score": 192, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I pretty much implied to my parents that I don't trust them to care for my daughter if I left them in control of my money. 2. This could make me an AH because I know they do love my daughter, and maybe it was a bit cruel to just say something like that to them?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  There was no reason for them to even bring this up, unless they've been looking for an excuse to stick their fingers in that money from the start.  And then they *proved* they can't be trusted to respect your decisions or your intent, because instead of graciously accepting your No they roped as many uninvolved third parties as they could reasonably find to try and mass shame/guilt you into complying.\n\nPlease for the love of all that is sacred to you give these people *nothing* and make sure it goes to your child.  You are not responsible for whatever version of events your parents choose to tell others, or for how they choose to re-interpret your words to suit their own narrative.", "NTA\n\nWhy the hell are your parents even bothering about this to begin with? They know something you don't about their likelihood to outlive you? TF?", "NTA.   \n\n\nYou stated that you and Chris both come from dysfunctional families. You are showing an example this through the behavior of your parents.   \n\n\nI think it is very odd for parents of a 29-year-old to be asking about being inheritors of their own daughter. It sounds as if they feel as though they feel they are owed compensation for raising you. (Which is something that is not only common practice, but is codified in law in many east Asian cultures, by the way. If my Korean wife dies and we don't have kids, her parents are entitled to inheritance.)\n\nKeep being there for your daughter. Keep the good relationship with her father and her new step-mother. Keep that positive atmosphere for her.", "NTA\n\nIf something should happen to you, your child belongs with her other loving parent.\n\nThe only thing I can advice is that if the life  insurance / inheritance is put into some sort of trust so that it is spent for your child's needs  in case your ex remarries and possibly has more kids.  Both of you should talk about that as you have good communication, and trust  with each other.\n\nYou both seem to care about your child and that is the most important person should something happen to either of you.", "NTA. I mean what the hell, it’s super scary that they expect to outlive you. \nI don’t know any parents, no matter how shitty they are, that would even think about benefitting from their children’s inheritance.\nEven if you were terminally ill it would never ever justify them expecting to get the money rather than your ex/daughter.\n\nThe only thing I was wondering about is why your daughter isn’t inheriting the money? It could be set up so she won’t be able to access it before she is 18, but your husband is allowed to take money out for her care.", " NTA and your life sounds like the beginning of a 20/20 episode.", "NTA. I agree with you and I don’t think you said anything wrong. Most parents (imo) would be so horrified at the idea of their kids dying before them that they aren’t even thinking about what happens to the money.", "Your parents are being parasites. Ignore them.\n\nYou have an excellent relationship with your ex and really don't need parental interference. \n\nA word of caution, though: I suspect your ex might want to revisit the arrangements when he gets married, so that he leaves some of his assets to his wife. Legally, she may have a claim on them as his dependant anyway, particularly if they have kids. Likewise, if you meet a new partner/have more kids you'll likely want to change your will. It's worth thinking about the various options now so you're prepared.", "NTA", "NTA\n\nTHEY chose to make the conflict public.  Not you.  \nAnd if you do pass, Chris would get full custody as the full surviving parent.  It's upto you how you choose to set up the will and life insurance.  \n\nFWIW, you and Chris might want to consider how to setup your plans for Allie as Chris' family expands, and as yours might in the future.  Chris now has two people to plan for if he passes, and he soon might have more kids.  \n\nYour parent's opinions matter not at all.  Maya's opinion will and should matter to Chris.  So, bring it up now and talk over how to adjust your own plans, and I bet he'll be relieved to have the chance to redesign the plans a little.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nThis has wreaked havoc across pretty much my entire family so I wanted to see if other people think I’m in the wrong here.\n\nI (29f) have a 9yo daughter named Allie that I share split custody of with my ex bf Chris (32m). Despite us not being together, we have a really good coparenting relationship, mostly due to the fact that we both grew up in homes with dysfunctional family dynamics and we didn’t want the same for our kid.\n\nWhen he and I ended things, we both agreed to mutually make eachother the inheritors of our will & life insurance. We did this so that if something happened to one of us, the other would have the funds to care for our daughter as though both of us were still here. There is money we have set aside specifically for her to use as she wishes, but she won’t be able to access the account until she’s 18.\n\nMy parents were aware of this arrangement we had, and at the time they didn’t express any issues with it.\n\nChris is getting married soon to his fiancée Maya (31f), and after hearing about the engagement, my parents have asked me if I’m going to be naming them as my beneficiaries.\n\nI informed them that I wouldn’t be, and they got upset and told me that it’s ridiculous for me to give everything to my ex when he’ll clearly be able to support Allie with a two household income and that they would benefit from an inheritance more than he would.\n\nI said that I wouldn’t be changing my mind, and I told them that with the way they’re acting about it now, I trust Chris even more to use the money to care for our daughter than I do them.\n\nSo now my parents are telling our family members that I don’t trust them with money, or my child’s well-being if something were to happen to me. Most of my family is now calling me all sorts of names but mostly just saying how awful it is for me to think of my parents this way.\n\nHonestly I sort of don’t trust my mom and dad, mainly due to how they’re acting now, but maybe it was wrong of me to tell them that so plainly?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- the answer is: this money is for my daughter- either raising her, her college education, or her adult life. Chris would be caring for her and I trust him to make the best decision for what to do with it after I am gone. When she is 18, she will become the direct beneficiary.", "NTA. Your money. Your business. Period.", "NTA. She's your child, it's your money, it's your choice.", "NTA, their actions were proof, if proof were needed...", "NTA. This has nothing to do with your parents. \nThey are using Allie as a financial pawn, and need to mind their business. You are just trying to do right by your daughter.", "You didn't imply, you said I don't trust you with my child. I have to assume that you absolutely no problem with your child's new stepmother. BTW, I don't see your parents caring for your child anymore.", "NTA. You don’t trust them for good reason. If they don’t understand why, that just enforces your logic.", "NTA. Are your parents planning on burying you? This is an extremely weird conversation for them to initiate and it's even weirder that they're mad at you and have sicced their flying monkeys on you over it. Of course your estate would go to your child.", "NTA. Your parents are literally angry over a potentiality and banking on it when, in reality, they'll probably pass before you do. It's a really weird thing to have a fit over. And to say they need it more than your ex is exactly why I wouldn't trust them either. The money isn't about personal need, it's about caring for your daughter. As far as you telling them you don't trust them because of how they're acting, you said nothing wrong. But people love to play victim and run with the \"I don't trust you\" part while conveniently dumping the \"because of how you're behaving\" part.", "NTA. What parents plan to outlive their own child and then get offended about not getting a payout? Starting to understand your comment about dysfunctional childhood…", ">that they would benefit from an inheritance more than he would.\n\nThis is proof that they want the money for themselves not your daughter. Even though I would have rather taken it and put it in a trust that pays the ex monthly like child support.", "Yeah honestly them bringing it up felt odd. I'm not knocking on deaths door or anything lol.", "I'm not sure that's unique to east Asian...\n\nMy - limited - understanding is that's common practice for probate in the US. If you - and spouse - die without hiers, the default is to \"flow up\" to your ancestors (aka parents) and then start flowing out to your siblings.", "I certainly hope it doesn't end like one lol.", "And in the reverse, any money left to the ex could end up property of the new wife.\n\nWould be a great time to visit with an estate planer and ensure things are setup for the INTENDED BENEFIT of your kids.  There are mechanisms - usually trusts (even if just created as needed by the will) - that can properly address these things.\n\nFor example, if both myself and spouse die while we have a minor child, our funds go into a trust for the child. \n\nIf only one of us dies, our funds flow to the surviving spouse. But if we ever got divorced, and especially if one of us was getting remarried, I'd have our will changed such that the money would bypass the spouse and go directly to the child's trust, with provisions that the surviving spouse could have limited access to funds for the sole purpose of supporting our child. \n\nThis way you don't have to worry about the funds disappearing, or getting split between multiple families/kids.  (Although the ex's situation is going to be more challenging, as presumably he won't leave 100% to OP and children anymore...)", "He and I started talking about it when he started dating Maya, and since I don't plan to have another child, he'll remain the beneficiary. If he and Maya have a child together, he plans to name both in his will. Then, if I meet someone down the line and decide to get married, we'll all reevaluate then.", "Only if there's no will.", "Wow, you guys are doing a great job at this.", "I have assume that you have problem trusting your child' s new stepmother.", "I'd advise reconsidering this...\n\nI'm sure Chris is trustworthy, and Maya is as well, but money can make people do stupid things...\n\nAny hypothetically, let's say that you die in 7 years, by then Chris and Maya have two kids.  Chris gets all your life insurance and savings, without a pre-nup.  Let's say Chris dies later that same year. Depending on how Chris has his side setup, your Allie might get $0 or might get 25% of Chris's estate (with the rest being equally split between his spouse and two other kids).\n\nMinimally, you have the ability to set things up so Allie gets 100% of your estate (with Chris - or Allie's guard - having access if needed for Allie's benefit while underage).\n\nYou can take a small step to ensue Allie's gets the resources you'd expect if the worst occurs.", "NTA but please speak with an estate planner. There are ways to set up a trust for assets for your daughter that don’t involve leaving the money to your ex. \n\nThis may be beneficial for your ex to also speak with an estate planner to leave assets for both your daughter and his spouse", "NTA. And in the event of something happening to you,   why would your child go to your parents when your child has a fully functioning, willing and able second parent? That doesn't even make else and I question your parents motive.", "Wow. This doesn't make sense to me. If something were to happen to you, your ex will still be required to care for your daughter, and provide for her. The obvious choice is to provide him with the means to do so if possible. What would your parents do with the money? Ration it off to him as they see fit to care for your daughter, his daughter? Nah, keep it like it is.", "NTA, the chance of you or your ex passing away before your daughter becomes old enough for her to be the direct beneficiary is very slim. It's also a very slim chance that you'll be outlived by your parents. It sounds like you've made a sensible insurance policy to protect your daughter in the event of something awful happening while she's young. She's your daughter, so if you and her father are satisfied with this plan and he doesn't plan to change his will given his new relationship, that's all that matters. I'm assuming that once your daughter is old enough, you'll both change your wills? Regardless, at the end of the day it's your money and assets to do with as you wish.", "“Benefit from the inheritance more than he would”. It’s not for them. It’s for your child. NTA", "NTA you have a financial obligation to your child, not your parents.", "NTA. You told your parents the truth. There’s nothing wrong with that. If anything were to happen to you, your ex would still need the resources you plan on leaving for your daughter even if he has a wife. Probably more so because he may have other children he may have to care for. Having anything from you would allow him to continue caring for your daughter at the same level as the pair of you do now.\n\nI do not have children nor do I plan on having any. However, I told my mother that were I to have kids she would not be the person I would name as guardian if both myself and the other parent were to die young. She’s older, has less patience and has a LOT of health problems. Did she like this? No. Did it matter? No. Because I would, hypothetically, be acting in the best interests of my (fictional) child.\n\nYou have to do whatever is in the best interests of your child, regardless of who it offends or pisses off. \n\nYour ex is like to get more insurance in the future for his fiancé and any children they may have. A lot of people do this when they have children from previous relationships. You’ll likely do this as well should you form a relationship that close with someone.\n\nYour parents need to get over themselves. They had their turn in being parents, they made mistakes. You’re a mother now and your are doing everything in your power not to make the same mistakes.", "NTA", "NTA. Sounds like your parents are pretty awful. Good call not trusting them.", "NTA I’m completely lost. If you died, your ex would get full custody of the children because they are his children. Your parents would have no rights whatsoever. So your parents are saying you should disinherit your children in their favor because your ex remarried? That makes no sense. Why would they expect a penny of your money when you have heirs youself? All your money should go to the maintenance of your children.\n\nI *would* suggest revisiting your will to ensure your children are protected in the event your ex died after you. My family members ended up losing everything to their step parent because their father died, and their mother remarried and then died while they were still minors. They ended up 18 with nothing from either parents’ estate. Their stepfather owns practically everything their father and mother left behind.\n\nPutting the money in a trust with the proceeds to be used for the children’s care would make more sense than giving it to your ex outright (for example).  And your ex will also need to adjust his will in the event he has more children himself.", "Don't go on long walks by the cliffs with them... ;)", "So to recap your parents are hoping for/banking on your death so they can get money? Most parents wouldn’t be able to even think about their child dying, let alone plan on taking money from their grandkids. I’d have a lawyer write up a custody will ASAP!", "You're NTA, but it's possible they're worried the new wife would screw over your daughter if something happened. What if they have a ton of kids and decide to   use the money for something other than it's intended purpose?  It's also possible your parents are gold digging assholes. It might be worth a conversation about why they think this change needs to be made.", "Hence the person you replied to saying \"the default is\".", "NTA, you mentioned you grew up in a dysfunctional household which probably led you to the decision you made with Chris awhile ago. Fussing over money they don't have access to let's u know you made the right decision.", "NTA.  Being blunt ensures clarity and gets the drama, if there's going to be any, out in the open right away.  Sometimes parents are kind, generous, thoughtful and teach their kids to live in a healthy and happy manner.  It sounds like your parents are not really in that camp.\n\nAt least your parents showed their colors quickly and you don't have to doubt your choices about them.  This must be sad for you, but you're handling it beautifully IMO. \n\nKudos to you and Chris for being really good parents and for prioritizing your daughter.", "NTA\n\n&#x200B;\n\nYOur parents are the AHs.", "You may need to sit down and ask your parents about their financial troubles. If they have zeroed in on this recently, and not just because your ex is getting married, something is happening. And if it's not them, it I'd bet someone else in your family needs money.", "NTA. Why the hell do your parents even think they'll outlive you? Creepy AF.", "NTA but there is definitely better ways to ensure your money goes to your CHIlD and not your ex. That's what they are upset about.", "NYA. Your kids’ needs come before those of your parents. \n\nOne comment: cleanest thing to do would be to set up a trust for your daughter and have your money go into that. That would guarantee the money goes to your daughter. Trustees could ensure it’s spent appropriately until she comes of appropriate age (lawyers I talked to recommended waiting until much later than 18) \n\nIf you just leave it to your ex, there’s more wiggle room for error and/or pressure to spend the money on other things (like if your ex has more kids and needs the money for them). \n\nYou sound like very thoughtful parents. Keep up the good work.", "I would look into changing your will to a trust for your Daughter that Ex has access to for living expenses/child support until she is 18-21 and then it’s hers.", "I suspect it's just plain narcissism rather than a conscious desire to have the money.", "There was actually a woman who did that to her DIL. IIRC she turned out to be a serial murderer of family members and people close to her, including one of her own young children."]}