{"id": 15423, "submission_id": "12vbffv", "title": "AITA for telling my brother and his girlfriend she's the reason I won't play games with him anymore?", "selftext": "Throwaway to keep family out of it. \n\nMy brother (28m) and I (31m) usually play a variety of games together. A few months ago he moved his gf in with him. I thought she was cool and all was fine until we were in a match one afternoon. Some randos joined our team, they had mics, turned out to be two women playing. No problem on our end but his gf wasn't thrilled and didn't want him playing with any women. He wanted to respect her boundaries so he left the game and afterward, whenever we'd play games that we use mics and pick up randoms, we'd only play if we wound up with all guy teammates. The real problem popped up when we were playing a different game, queued up for a dungeon, and we wound up with three people in our party using women characters. She didn't like that either because my brother couldn't tell for sure if the players themselves were men or women.\n\nFor a little while I stuck it out and we wound up spending most of our time just trying to find other players that didn't step over his gf's boundaries. Honestly, I felt like we were being creepy asking players if they were a guy or gal before playing. On top of that, trying to find a party that would meet her approval if she saw him playing really cut into my limited time a lot of days. I went from playing with him two to three times a week in the afternoon to maybe once a week and it's not consistent. It's his relationship and I respect that so I didn't want to say anything and just started playing later at night for a little bit after my kids are in bed instead of in the afternoons.\n\nYesterday I went to a friend's house for their birthday and my brother and his gf were there. Things were fine until I was leaving and my brother asked if I wanted to play later this coming week, I said I'd see. He brought up how I barely play with him any more and I told him \"Nothing against you (his gf) but between work and kids I get limited time to play and I don't want to spend it looking for players that only use e-peen characters because she can't deal with pixel women being around your pixels, and I'm tired of sounding like a creep.\" I left, and got a text from him late last night that they've been fighting, and he gets why I said it because he gets frustrated too but I shouldn't have said anything and just dealt with it in silence as he does. AITA for telling them straight instead of lying or sugarcoating it?", "created_utc": 1682181383, "permalink": "/r/AmItheAsshole/comments/12vbffv/aita_for_telling_my_brother_and_his_girlfriend/", "score": 66, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > When my brother asked why I don't play games with him anymore I told him that his girlfriend's weird hang up about not playing with any women or women characters is why I don't because it makes a simple hobby hard. Might've been an asshole move because I get that he's just trying to respect her boundaries.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your brother's girlfriend is being ridiculous. She's jealous of him hearing other women's voices? She's jealous of him looking at female video game characters? She doesn't want him interacting with any other women, real or imaginary? Dude I think you were WAY nicer about this than you needed to be. You are not responsible for her insecurities or their weird ass relationship. NTA", "NTA this lady is pathetic. \nSincerely,\nAnother woman gamer", "NTA\n\nYour brother is in an abusive relationship", "Your brother asked, you answered.\n\nYour brother actually agrees with you, but you should have sucked it up like him.\n\nWell, then he shouldn't have asked..\n\nThe real problem is not you telling it as it is, but him letting GF control him.\n\nJealous of pixels today, what will she be jealous and controlling over tomorrow?\n\nYour brother moved her in, now he has to move her out.\n\nNTA", "NTA\n\nYour brother needed to hear this. His GF is crazy jealous and that's a red flag. She's being ridiculous.", "NTA. The GF is super controlling and that is not healthy. You should keep up your boundaries. Also, y’all do sound like creeps asking randoms on the internet if they are girls. So good job backing away from that situation.", "NTA. Your brother's gf is one though. Best for you to continue to play with others and leave your brother and his gf out. She is very insecure and taking it out on your brother. Unless and until he tires of her bs, just steer clear when you are gaming.", "Yikes, you’re definitely NTA! However, I sincerely hope your brother pays attention to the red flags his girlfriend is showing. She’s abusive and controlling, and it will only get worse. I hope he gets out soon. She’s really going to hurt him, which is truly sad. Keep supporting your brother.", "NTA your brother needs to get a backbone and stand up for himself instead of dealing with it in silence. That's not how a healthy relationship works", "NTA\nYou’re not responsible for bro’s gf’s insecurity. \nLol’d at “e-peen.”", "NTA. I mean you could have told him in prviate cause with that behavior it was to be expected that she'd be pissed. But honestly who cares? Her behavior is stupid and you have a solid back bone for pointing that out. Your brother will have many more opportunities to fight over stupid shit like this being in a relationship with someone that insecure. Tiptoeing around that just normalizes it.", "NTA, the gf need to get a grip, like how insecure do you have to be to be afraid that your partner is near pixelated tits. Seriously she needs help or bro needs to leave such a controlling gf.", "Nope, NTA. Anyone who gets jealous of computer generated images in an on line game has issues.", "NTA\n\nIf anything, I think you weren't harsh enough.", "NTA\n\nYou are not obligated to deal with his girlfriend's issues. That's his choice. She is being ridiculous, and his complying to her wishes is eating up your limited playing time.", "NTA.\n\n\"I shouldn't have said anything and just dealt with it in silence as he does.\"\n\nYour brother needs to grow a spine and have these conversations early on in their relationship unless he's content to just deal with this sort of abuse forever.  Not being able to even exist in the same environment as people who might even potentially be a woman is a huge red flag and is only the tip of the iceberg.", "Those aren't boundaries, those are insecurities.\n\nNTA.", ">he gets frustrated too but I shouldn't have said anything and just dealt with it in silence as he does.\n\nUh... This is not healthy, and your brother is going to be miserable in this relationship. Red flags all around this one.\n\nNTA, try and help your brother see what's really going on.", "NTA - I’m sure he gets it too actually and just wants to play with you more again, but doesn’t want to upset his gf even more. Unfortunately he’s in a sucky situation. Maybe you guys could play a different game together?", "NTA - he’s in doormat mode and doesn’t like you highlighting the truth.", "NTA. Your brother can’t get it and then want you to suffer. What a tool. He’s going to have to have a come to Jesus moment when he’s isolated away from everyone", "NTA", "NTA. She's insecure and controlling. I hope your brother snaps out of it, or he won't be able to have any female friends eventually, if he has any. The \"dealing with it in silence\" bit is super-unhealthy, and it's not dealing with it at all.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway to keep family out of it. \n\nMy brother (28m) and I (31m) usually play a variety of games together. A few months ago he moved his gf in with him. I thought she was cool and all was fine until we were in a match one afternoon. Some randos joined our team, they had mics, turned out to be two women playing. No problem on our end but his gf wasn't thrilled and didn't want him playing with any women. He wanted to respect her boundaries so he left the game and afterward, whenever we'd play games that we use mics and pick up randoms, we'd only play if we wound up with all guy teammates. The real problem popped up when we were playing a different game, queued up for a dungeon, and we wound up with three people in our party using women characters. She didn't like that either because my brother couldn't tell for sure if the players themselves were men or women.\n\nFor a little while I stuck it out and we wound up spending most of our time just trying to find other players that didn't step over his gf's boundaries. Honestly, I felt like we were being creepy asking players if they were a guy or gal before playing. On top of that, trying to find a party that would meet her approval if she saw him playing really cut into my limited time a lot of days. I went from playing with him two to three times a week in the afternoon to maybe once a week and it's not consistent. It's his relationship and I respect that so I didn't want to say anything and just started playing later at night for a little bit after my kids are in bed instead of in the afternoons.\n\nYesterday I went to a friend's house for their birthday and my brother and his gf were there. Things were fine until I was leaving and my brother asked if I wanted to play later this coming week, I said I'd see. He brought up how I barely play with him any more and I told him \"Nothing against you (his gf) but between work and kids I get limited time to play and I don't want to spend it looking for players that only use e-peen characters because she can't deal with pixel women being around your pixels, and I'm tired of sounding like a creep.\" I left, and got a text from him late last night that they've been fighting, and he gets why I said it because he gets frustrated too but I shouldn't have said anything and just dealt with it in silence as he does. AITA for telling them straight instead of lying or sugarcoating it?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA one bit", "NTA. I think, ultimately, you did him a huge favor by bringing her insecurity out into the open.", "NTA. HE can to walk on eggshells if HE wants to, but you don't. Limited game time was probably the outcome girlfriend wanted, though. Red flag?", "NTA. Even if she was in the right (she wasn't) you were respectful in your statement & def weren't the ass.", "That's the really weird part! She doesn't have any issues with his female co-workers or the few female friends he has. Just something about pixel women and women gamers I guess?", "Hope there’s some all male cast shows on netflix. Imagine if a woman appeared on the tv when he’s watching something, the gf would lose her marbles", "Any recommendations how to address it with her lol", "She's controlling. This if he was doing this to her? It's no less abusive because she's a girl.", "Maybe your brother was being inappropriate with female gamers in the past and that's why she has only this really annoying and extreme boundary and why your brother is willing to put up with it and wants you to deal with it in silence? That's the only reason I can think other women are seemingly fine to her.", "Do not address it with her. Address it with your brother. He's already said that you should have \"dealt with it in silence\" which makes me wonder what other controlling things she does that he hes afraid to talk about. I'm not gonna say this is certainly an abusive relationship based on this one thing, but it's not a good sign.", "Is it an issue that expands beyond just games?  I had an ex who would get mad if I said thank you to the cashier the wrong way.  If it's a jealousy issue then it is her problem to resolve.  She is unlikely to realize on her own she needs to change.  Your brother should be the one to bring it up and I guarantee that will not go well.  \n  \nIn reality I would think this is relationship terminating.  If you're dedicated to doing something about it yourself you should just ask her why she is concerned about playing games with women online or in character.  Explain the issue, that it's impacting the time your brother and you spend together.  Remind her he is there to play with you, not the randos.  Offer a concession like muting the lobby when you get in.  \n  \nIf you bring it up be prepared for her to try and cut you out of your brother's life.", "You don’t address it with her. You provide your brother with support so he can address it with her.", "All of this. Dealing with things in silence is how abusers and coercive controllers get away with stuff. It's not your job or place to address anything with her but make clear to your brother you're there if he needs support (i.e. in leaving the relationship....) and that you're always down to game - JUST with him. Her behaviour is not reasonable and people should not excuse it.", "No that's the weirdest thing about it all. She has no problem with his female co-workers and is friends with the few female friends my brother has. After the mic party incident, I asked him about how she was with his female friends and she's still fine with them- just something about girls online apparently.", "How old is she?  How long have they been dating in general?  It's a really weird hangup, maybe one that can be resolved just by talking to her.  The standard reddit thing would be to say run, but I understand that is often somewhat knee-jerk.  That being said, having been in a similar relationship, it starts more with not wanting \"new\" female friends introduced before doubling down and starting to make accusations of infidelity.  At a minimum he needs to be on the lookout for signs she's trying to tighten down.  Control issues like this come from insecurity.  \n  \nIf you talk to her, the above is the best advice I can give.  She needs to know that the game time is about you two, not the other people online.  I don't know what help there is with her being concerned about female characters.  You may be able to get her into some games a bit to maybe show her it's harmless.  It's your brother's relationship so obviously it will be his call, but just be aware and be there for him.  If she is doing other controlling things she will be actively trying to make him think other people are like this.  Remind him that most people aren't this crazy from time to time, because my situation became very isolating and felt hopeless.  I hope the same does not happen to him.", "Thin end of the wedge. This will escalate. She starts with girls her has no prior relationship with, get him used to obeying her demands. Then she doesn't want him doing overtime if its just other girls at work. Then she doesn't want him to see his female friends if she's not there.\n\nThis is control. Not boundaries, boundaries are aboutyour self not other people. She needs to go to therapy for her insecurities and not make them his problem.", "She's 27 and they've been together something like a year and a half. I will still be there for him, the only thing that's changed is my not gaming. Only reason I asked about speaking with her is that obviously, I'm still going to have to be around her and being prepared if she brings it up again."]}