{"id": 15423, "submission_id": "12vbffv", "title": "AITA for telling my brother and his girlfriend she's the reason I won't play games with him anymore?", "selftext": "Throwaway to keep family out of it. \n\nMy brother (28m) and I (31m) usually play a variety of games together. A few months ago he moved his gf in with him. I thought she was cool and all was fine until we were in a match one afternoon. Some randos joined our team, they had mics, turned out to be two women playing. No problem on our end but his gf wasn't thrilled and didn't want him playing with any women. He wanted to respect her boundaries so he left the game and afterward, whenever we'd play games that we use mics and pick up randoms, we'd only play if we wound up with all guy teammates. The real problem popped up when we were playing a different game, queued up for a dungeon, and we wound up with three people in our party using women characters. She didn't like that either because my brother couldn't tell for sure if the players themselves were men or women.\n\nFor a little while I stuck it out and we wound up spending most of our time just trying to find other players that didn't step over his gf's boundaries. Honestly, I felt like we were being creepy asking players if they were a guy or gal before playing. On top of that, trying to find a party that would meet her approval if she saw him playing really cut into my limited time a lot of days. I went from playing with him two to three times a week in the afternoon to maybe once a week and it's not consistent. It's his relationship and I respect that so I didn't want to say anything and just started playing later at night for a little bit after my kids are in bed instead of in the afternoons.\n\nYesterday I went to a friend's house for their birthday and my brother and his gf were there. Things were fine until I was leaving and my brother asked if I wanted to play later this coming week, I said I'd see. He brought up how I barely play with him any more and I told him \"Nothing against you (his gf) but between work and kids I get limited time to play and I don't want to spend it looking for players that only use e-peen characters because she can't deal with pixel women being around your pixels, and I'm tired of sounding like a creep.\" I left, and got a text from him late last night that they've been fighting, and he gets why I said it because he gets frustrated too but I shouldn't have said anything and just dealt with it in silence as he does. AITA for telling them straight instead of lying or sugarcoating it?", "created_utc": 1682181383, "permalink": "/r/AmItheAsshole/comments/12vbffv/aita_for_telling_my_brother_and_his_girlfriend/", "score": 430, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > When my brother asked why I don't play games with him anymore I told him that his girlfriend's weird hang up about not playing with any women or women characters is why I don't because it makes a simple hobby hard. Might've been an asshole move because I get that he's just trying to respect her boundaries.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your brother's girlfriend is being ridiculous. She's jealous of him hearing other women's voices? She's jealous of him looking at female video game characters? She doesn't want him interacting with any other women, real or imaginary? Dude I think you were WAY nicer about this than you needed to be. You are not responsible for her insecurities or their weird ass relationship. NTA", "NTA this lady is pathetic. \nSincerely,\nAnother woman gamer", "NTA\n\nYour brother is in an abusive relationship", "Your brother asked, you answered.\n\nYour brother actually agrees with you, but you should have sucked it up like him.\n\nWell, then he shouldn't have asked..\n\nThe real problem is not you telling it as it is, but him letting GF control him.\n\nJealous of pixels today, what will she be jealous and controlling over tomorrow?\n\nYour brother moved her in, now he has to move her out.\n\nNTA", "NTA\n\nYour brother needed to hear this. His GF is crazy jealous and that's a red flag. She's being ridiculous.", "NTA. The GF is super controlling and that is not healthy. You should keep up your boundaries. Also, y’all do sound like creeps asking randoms on the internet if they are girls. So good job backing away from that situation.", "NTA. Your brother's gf is one though. Best for you to continue to play with others and leave your brother and his gf out. She is very insecure and taking it out on your brother. Unless and until he tires of her bs, just steer clear when you are gaming.", "Yikes, you’re definitely NTA! However, I sincerely hope your brother pays attention to the red flags his girlfriend is showing. She’s abusive and controlling, and it will only get worse. I hope he gets out soon. She’s really going to hurt him, which is truly sad. Keep supporting your brother.", "NTA your brother needs to get a backbone and stand up for himself instead of dealing with it in silence. That's not how a healthy relationship works", "NTA\nYou’re not responsible for bro’s gf’s insecurity. \nLol’d at “e-peen.”", "NTA. I mean you could have told him in prviate cause with that behavior it was to be expected that she'd be pissed. But honestly who cares? Her behavior is stupid and you have a solid back bone for pointing that out. Your brother will have many more opportunities to fight over stupid shit like this being in a relationship with someone that insecure. Tiptoeing around that just normalizes it.", "NTA, the gf need to get a grip, like how insecure do you have to be to be afraid that your partner is near pixelated tits. Seriously she needs help or bro needs to leave such a controlling gf.", "Nope, NTA. Anyone who gets jealous of computer generated images in an on line game has issues.", "NTA\n\nIf anything, I think you weren't harsh enough.", "NTA\n\nYou are not obligated to deal with his girlfriend's issues. That's his choice. She is being ridiculous, and his complying to her wishes is eating up your limited playing time.", "NTA.\n\n\"I shouldn't have said anything and just dealt with it in silence as he does.\"\n\nYour brother needs to grow a spine and have these conversations early on in their relationship unless he's content to just deal with this sort of abuse forever.  Not being able to even exist in the same environment as people who might even potentially be a woman is a huge red flag and is only the tip of the iceberg.", "Those aren't boundaries, those are insecurities.\n\nNTA.", ">he gets frustrated too but I shouldn't have said anything and just dealt with it in silence as he does.\n\nUh... This is not healthy, and your brother is going to be miserable in this relationship. Red flags all around this one.\n\nNTA, try and help your brother see what's really going on.", "NTA - I’m sure he gets it too actually and just wants to play with you more again, but doesn’t want to upset his gf even more. Unfortunately he’s in a sucky situation. Maybe you guys could play a different game together?", "NTA - he’s in doormat mode and doesn’t like you highlighting the truth.", "NTA. Your brother can’t get it and then want you to suffer. What a tool. He’s going to have to have a come to Jesus moment when he’s isolated away from everyone", "NTA", "NTA. She's insecure and controlling. I hope your brother snaps out of it, or he won't be able to have any female friends eventually, if he has any. The \"dealing with it in silence\" bit is super-unhealthy, and it's not dealing with it at all.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway to keep family out of it. \n\nMy brother (28m) and I (31m) usually play a variety of games together. A few months ago he moved his gf in with him. I thought she was cool and all was fine until we were in a match one afternoon. Some randos joined our team, they had mics, turned out to be two women playing. No problem on our end but his gf wasn't thrilled and didn't want him playing with any women. He wanted to respect her boundaries so he left the game and afterward, whenever we'd play games that we use mics and pick up randoms, we'd only play if we wound up with all guy teammates. The real problem popped up when we were playing a different game, queued up for a dungeon, and we wound up with three people in our party using women characters. She didn't like that either because my brother couldn't tell for sure if the players themselves were men or women.\n\nFor a little while I stuck it out and we wound up spending most of our time just trying to find other players that didn't step over his gf's boundaries. Honestly, I felt like we were being creepy asking players if they were a guy or gal before playing. On top of that, trying to find a party that would meet her approval if she saw him playing really cut into my limited time a lot of days. I went from playing with him two to three times a week in the afternoon to maybe once a week and it's not consistent. It's his relationship and I respect that so I didn't want to say anything and just started playing later at night for a little bit after my kids are in bed instead of in the afternoons.\n\nYesterday I went to a friend's house for their birthday and my brother and his gf were there. Things were fine until I was leaving and my brother asked if I wanted to play later this coming week, I said I'd see. He brought up how I barely play with him any more and I told him \"Nothing against you (his gf) but between work and kids I get limited time to play and I don't want to spend it looking for players that only use e-peen characters because she can't deal with pixel women being around your pixels, and I'm tired of sounding like a creep.\" I left, and got a text from him late last night that they've been fighting, and he gets why I said it because he gets frustrated too but I shouldn't have said anything and just dealt with it in silence as he does. AITA for telling them straight instead of lying or sugarcoating it?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA one bit", "NTA. I think, ultimately, you did him a huge favor by bringing her insecurity out into the open.", "NTA. HE can to walk on eggshells if HE wants to, but you don't. Limited game time was probably the outcome girlfriend wanted, though. Red flag?", "NTA. Even if she was in the right (she wasn't) you were respectful in your statement & def weren't the ass.", "That's the really weird part! She doesn't have any issues with his female co-workers or the few female friends he has. Just something about pixel women and women gamers I guess?", "Hope there’s some all male cast shows on netflix. Imagine if a woman appeared on the tv when he’s watching something, the gf would lose her marbles", "Any recommendations how to address it with her lol", "She's controlling. This if he was doing this to her? It's no less abusive because she's a girl.", "Maybe your brother was being inappropriate with female gamers in the past and that's why she has only this really annoying and extreme boundary and why your brother is willing to put up with it and wants you to deal with it in silence? That's the only reason I can think other women are seemingly fine to her.", "Do not address it with her. Address it with your brother. He's already said that you should have \"dealt with it in silence\" which makes me wonder what other controlling things she does that he hes afraid to talk about. I'm not gonna say this is certainly an abusive relationship based on this one thing, but it's not a good sign.", "Is it an issue that expands beyond just games?  I had an ex who would get mad if I said thank you to the cashier the wrong way.  If it's a jealousy issue then it is her problem to resolve.  She is unlikely to realize on her own she needs to change.  Your brother should be the one to bring it up and I guarantee that will not go well.  \n  \nIn reality I would think this is relationship terminating.  If you're dedicated to doing something about it yourself you should just ask her why she is concerned about playing games with women online or in character.  Explain the issue, that it's impacting the time your brother and you spend together.  Remind her he is there to play with you, not the randos.  Offer a concession like muting the lobby when you get in.  \n  \nIf you bring it up be prepared for her to try and cut you out of your brother's life.", "You don’t address it with her. You provide your brother with support so he can address it with her.", "All of this. Dealing with things in silence is how abusers and coercive controllers get away with stuff. It's not your job or place to address anything with her but make clear to your brother you're there if he needs support (i.e. in leaving the relationship....) and that you're always down to game - JUST with him. Her behaviour is not reasonable and people should not excuse it.", "No that's the weirdest thing about it all. She has no problem with his female co-workers and is friends with the few female friends my brother has. After the mic party incident, I asked him about how she was with his female friends and she's still fine with them- just something about girls online apparently.", "How old is she?  How long have they been dating in general?  It's a really weird hangup, maybe one that can be resolved just by talking to her.  The standard reddit thing would be to say run, but I understand that is often somewhat knee-jerk.  That being said, having been in a similar relationship, it starts more with not wanting \"new\" female friends introduced before doubling down and starting to make accusations of infidelity.  At a minimum he needs to be on the lookout for signs she's trying to tighten down.  Control issues like this come from insecurity.  \n  \nIf you talk to her, the above is the best advice I can give.  She needs to know that the game time is about you two, not the other people online.  I don't know what help there is with her being concerned about female characters.  You may be able to get her into some games a bit to maybe show her it's harmless.  It's your brother's relationship so obviously it will be his call, but just be aware and be there for him.  If she is doing other controlling things she will be actively trying to make him think other people are like this.  Remind him that most people aren't this crazy from time to time, because my situation became very isolating and felt hopeless.  I hope the same does not happen to him.", "Thin end of the wedge. This will escalate. She starts with girls her has no prior relationship with, get him used to obeying her demands. Then she doesn't want him doing overtime if its just other girls at work. Then she doesn't want him to see his female friends if she's not there.\n\nThis is control. Not boundaries, boundaries are aboutyour self not other people. She needs to go to therapy for her insecurities and not make them his problem.", "She's 27 and they've been together something like a year and a half. I will still be there for him, the only thing that's changed is my not gaming. Only reason I asked about speaking with her is that obviously, I'm still going to have to be around her and being prepared if she brings it up again.", "I think ıts not about women but about you. Considering how she acts about his female coworkers and his few female friends from your answer to anothrr comment, ı strongly assume she is just trying to sabotage your time with your brother.", "NTA.\n\nWow, just reading and simply thinking about the whole deal in my head feels annoying.  I would hate to be in your position dealing with that.\n\nThen, I imagine saying that to my husband \"no playing games with other chicks..... \" and I feel like some insecure, immature pyscho.\n\nYea, I hope your brother has a lot of fun with that somehow because most reasonable people would hate to be dealing with that", "Girlfriend is a huge control freak. Red flags 🚩 \nI hope he doesn’t marry this person because she won’t allow him out of the house probably.\n NTA.", "NTA I personally find it controlling behaviour that he as a man can’t play with other women and/or female characters. \n\nAlso just because he ‘has to’ stay silent, doesn’t mean you have to stay silent too. You are not the one in the relationship, you did stay silent for awhile and honestly he asked why and you answered him. \n\nFor me personally, I am in a relationship with a guy who loves to game, I knew this before we started dating and know he plays with both men and women. I kind of just assumed this before anyway because newsflash women game too and doesn’t mean anything else. I never had a problem with it.", "NTA. That level on jealousy and Controlling behavior will only get worst with time", "If he asked you why, then you were totally not the AH in answering said question, unless your delivery was AHish or you caused a scene, which per your story doesn’t seem to be the case.", "It’s not your relationship so it’s not your duty to deal with it in silence, if he wants to suffer, it should be alone, lol. NTA.", "NTA.  They should get married.  I mean the complete opposite and break up already.", "She's forcing you to act like an extreme version of the stereotypical sexist male gamer (I'm not saying male gamers are sexists, I'm saying that's a stereotype) because of *her* jealousy and extreme insecurities?\n\nNTA", "NTA\nI am going to bet she gets more controlling as time goes on unless he stands up to her. She is insecure and she will expand her boundaries for him. \n\nMy husband and his brother create characters that look either as stupid as possible or they play as women when they game; there is no in-between. She would hate you gaming with them. They are both super awesome though.\n\nGirls game. Guys dressed as girls game. A lot of people game. Just have fun and don’t control the player e-genitals.", "NTA. Show your brother this thread.", "Nta, you were way too nice with her lmaooo", ">we wound up with three people in our party using women characters. She didn't like that either because my brother couldn't tell for sure if the players themselves were men or women.\n\nWhat?... 95% of dudes i play with use female avatars. There's one dude in our group who uses a male avatar most of the time to the point where when we all play together, there's an ongoing joke that he's got a harem.", "NTA\n\nNot your relationship, you don't have to keep silent so you can dip your wick.\n\nIf he didn't like her hearing your answer he should have spoke to you privately.", "NTA\n\nAnd he needs to stop putting up with it too\n His gf is seriously over the top.", "\"dealing\" with it as your brother has chosen to do is why stupid shit like things continues ....NTA..sounds like there isn't a lot of trust in their relationship.", "\"Just deal with it in silence as he does\"?? That's not your gf, you have no obligation to spare her feeling or cater to her MASSIVE insecurities. That's his problem. If he wants to keep gaming with his brother, he's gonna have to grow a spine and either tell her to get therapy or get out. Nta", "He deals with it in silence cause that’s his girlfriend. Your no way in hell obligated to do the same.", "NTA, you aren't dating her, you don't have to \"suffer in silence\", the brother shouldn't either but that's their decision", "NTA.\nYou explained why you don't have as much time to play as previously. There are more and more female gamers. Unless someone has 24 hours a day to game or they only play in private parties, it's almost impossible to find an online group with no female gamers or gamers using female avatars. \nMy husband and I game, usually not together. He likes FPS games (Battlefield, CoD) while I like sandbox RPGs (Skyrim, Fable). I've had female friends and acquaintances be genuinely surprised that I don't care that my husband games. I always answer that I knew this was a hobby of his before we got serious, I know where he is (in the living room), and if I or our daughter needs something, he responds. They then explain that, to them, it looks like he's ignoring me or not spending time with me. It sounds like this is the case with the gf. She won't buck up and say that she wants more attention so she's making it so frustrating for him to game without pissing her off that he'll stop on his own. \nI find it very, very disturbing that he actually said you should 'suffer in silence' like he does. That's not a healthy relationship dynamic AT ALL.", "It's actually kind of hilarious how insecure his gf is. At least from the outside looking in. It must be maddening for you. NTA.", "NTA, she needs a reality check. Your brother chose HER, he goes back to HER at the end of the day. \n\nI lost several of my guy friends because of this. They hated me playing with them. Even though there was nothing happening because 1. I wasn’t interested 2. I respect others relationships. It didn’t matter and well yeah, it gets old really fast.", "NTA.  She's being ridiculous and you don't have to put up with it", "NTA, his gf being this controlling, and not permitting him to interact with other women, is a red flag. This isn't \"her boundary\" this is her being controlling and abusive.\n\nThis is the gender swapped version of the jealous abusive boyfriend getting mad at his girlfriend for talking to the waiter. This is not a healthy, mature relationship.", "NTA \n\nTell your brother that him choosing to put up with her controlling BS doesn't obligate you to do the same, and she needs to know her behavior is unhealthy.", "NTA at all. The GF is TA and your brother can suffer in silence all he wants but he can't force other people to tolerate his GFs weird hang ups.", "NTA.\n\n\"Should've dealt with it in silence\"... Ooph that don't sound healthy for anyone.\n\nHis girlfriend sounds immature.", "NTA. My husband is a gamer and I am not. I have never given a second thought to who he picks up on his teams. He also plays as female characters from time to time, so you really never know who you’re playing with. His gf sounds really controlling and weird if this is a hill that she’s willing to die on.", "NTA. That sounds super controlling", "NTA. Your brother has a reason to go along with it. He likes living with his GF for other reason. There is no upside to you in tolerating it and it makes you uncomfortable. He should respect your boundaries as much as he respects his GF's.", "NTA he needed to hear how fucked in this was.\n\nAlso I feel really bad for the women you encounter and bail on. It hurts to be treated that way even if you two have good intentions", "Nope, NTA.  Sounds like GF has some SERIOUS self-conscious issues or is way too jealous.", "NTA He tolerates her being an AH because he gets to sleep with her. You don't have to tolerate it or keep your opinion to yourself when her behavior is very public.", "Yeah, NTA. Gf sounds incredibly insecure.", "NTA. She’s controlling and it’s a major red flag. \n\nSaw the comment about supposedly not having issues with co-workers and existing female friends. You don’t know how long that will last. It may be easier to start with barring online female gamers and avatars then, shift to Boys Nights and Girls Nights exclusively; or, slowly losing touch/being too busy to hang out with the female friends until they stop trying to get together. Or, it could be she’s afraid he’ll meet someone new through gaming and dump her. Absolutely none of it is okay or anything your brother should put up with. I suggest you talk to him and show him this thread. But he needs to address the issues in the relationship and understand that she’s not setting boundaries, she’s manipulating and controlling him. \n\nAn example of her setting a healthy boundary would be if she didn’t like the general content of a game he plays (maybe she doesn’t like guns or gore), so she plans to go out with her own friends during that time to avoid being exposed to it. That’s an appropriate boundary that solves her problem while not interfering with how her boyfriend lives his life.", "NTA — why should you have just dealt with it in silence?\n\nIf he chooses to tolerate his partners ridiculous insecurity and controlling behaviour, then that’s on him. If it affects his other relationships, that’s his choice. You absolutely should not have to cater to this level of ridiculousness since it impacts you negatively.", "God help that man if he decides he wants to play Tomb Raider or Horizon one day.\n\nPlaying AS a woman?!?! \n\nThere arent enough pearls in the world to clutch!", "Right? Is she just insecure that gamer women will take her man? I'm not in the Valorant queues to find a boyfriend or future husband. I'm there to shoot pixels and hate myself.  \n\n\nEDA: NTA, but I feel like he needs to realize how toxic this is.", "Both are, honestly.\n\nBrother seems to be unhappy, bit instead of bringing it up with his girlfriend, he decides to suffer in silence.\n\nHe's a coward and as pathetic as his girlfriend is.", "Why should you deal with this in silence when this is impacting you too? In essence, her manipulative controlling both of you. \n\nYou’re smart enough to back out, hopefully your brother opens his eyes a bit puts an end to this weird and petty dynamic one way or another. \n\nDefinitely NTA.", "This is absolutely nuts and wow, he's really in the deep end if he thinks \"you should suffer in silence like I do.\" I'm so sorry to hear this. Oh, and NTA.", "As a mmorpg player, maybe even your same mmorpg (you can find out from my post history if you care to): I'd resume playing with them and change my character into the sexiest female character model with the most outrageous skin baring equipment I could conceive of.", "My ex wife would act like this whenever my brother and I tried playing games or doing anything together. Her excuse was other women, whether pixelated or not. It wasn't actually about the women, just that I was trying to spend time with someone other than her. 100% not about the women. You sir, are NTA. Hopefully, your brother will wise up like I did and kick her to the curb", "Does she have an issue if they watch a movie and a women appears?", "She's either building up to keeping him away from all women, or she's just trying to stop him gaming at all.", "She probably does have issues with other women but can’t control that so she’s focusing on pixel women", "She doesn’t like him playing games so much and is trying to control that is what’s I’d guess", "You can tell her that female players already have a hard time in finding players who accept the fact they're playing with girls. \n\nIt would be very cool to not have to deal with their partners too.", "He *was* “dealing with it in silence”. By quietly just not being available very often to play under those circumstances. It’s Brother who brought it out into the open by speaking up about it.\n\nBrother can play all he wants under those limits. He can’t expect other people to continue to choose the limits required to play with him. \n\nAnd blaming fighting with his girlfriend over her weird controlling streak during gaming on OP is a low blow. Especially when he’s the one who demanded that OP give reasons for his reduced availability, then took that to his girlfriend instead of speaking up on his own behalf.", "If you're playing the same one I do, glamours FTW. (But other games have similar concepts, too!)", "Way to shift the blame on the man 🙄. Anyone can be controlling, don't justify it just because the bad one is a woman.", "> I had an ex who would get mad if I said thank you to the cashier the wrong way.\n\nBeen there. It's just terrible. If we were out and I vaguely look at an [attractive] women's direction, I was \"checking them out\". If I was polite to [attractive] servicewomen, was because I was interested.\n\nShe had no problems with my female coworkers until a new [attractive] intern started working. Me mentoring the intern was me trying to get it on with her.\n\nThe last straw was when we were on my aunt's home for holiday, and a cousin came to visit my aunt with her 14 years old child.\n\nI'm very close with this cousin since I was a child, and have know all their children and am close to them as well. Then she accused me of being too friendly with the 14 years old. And that just did it to me.\n\nI had been conditioned to accept her jealousy bit by bit. Until she would check my phone. Read my emails. Distance myself from female friends. And like the frog in the water being boiled little by little I didn't noticed how fucked up it was.\n\nBut that did it. It was the shock that woke me and made me realize how absurd everything was.", "Sadly, I don't know how it is for OP, but if we are indeed playing the same game, we can't really customize our characters without paying real money, especially not our genders.\n\nBut yeah, I'd say playing around with glamours is half of my endgame now that I'm finished with most of current content... Besides, a lot of outfits are now gender-unlocked and you can do some things...", "Yes, you're right, I was totally shifting the blame because we know 100% of the facts obviously and that's why I added at the end there that's the only reason I could think of for why someone would bother putting up with behavior that dumb. You're so smart.", "Does he do any other kind of gaming? Or if she ruins this game would he quit gaming?", "Given him saying 3 other players, I'd say it's likely to be WoW over FFXIV (5 player groups vs 4 player groups)"]}