{"id": 1545, "submission_id": "ymwq0r", "title": "AITA for refusing to translate for my sister-in-law anymore?", "selftext": "I (31f) live in Brussels with my husband (30m) \"Leo\". Leo has a brother \"Oli\" 34m who is married to \"Sarah\" 34f, who also live in Brussels. Sarah is from an English-speaking country and has never bothered to learn French (the language our husbands and their family speak), even though she's lived in Brussels for seven or eight years now. She says things like, \"Everyone here speaks English, so I don't need to!\" or \"I know how to say \"a coffee\", that's all I need.\"\n\nFrankly, she can do whatever she wants, but our husbands' parents don't speak English, so whenever we spend time with them (which is quite often, we have dinner there more or less every Friday), the conversation needs to be translated. For some reason, this now always falls on me (I'm also from an Anglophone country, but my dad is French).\n\nI didn't mind at first, but she's lived here eight years, she's *married* to a Belgian man, and she's never bothered to learn so that she can speak to his parents directly. I find it annoying that it always falls on me if her husband isn't there, because the rest of the siblings (they have another brother and another sister) find it irritating that she's never made an effort and just don't bother translating anymore).\n\nLast week I was trying to speak to my mother-in-law about something quite personal (my husband and I are trying for children and it's been hard) and Sarah kept asking me to translate for her. It was really starting to annoy me, especially as it was a sensitive conversation and translating it was quite painful, so when we left, I told her that I wasn't going to be the go-between for her anymore. I told her that she lives here and that if she wants to speak to his family, she's going to have to put in *some* effort to learn the language.\n\nEdit: Sorry I forgot to add - after this happened she was apparently in tears with her husband that night, and now both of them are upset with me. They're refusing to come to any more family dinners unless I apologise.\n\nAITA?", "created_utc": 1667661105, "permalink": "/r/AmItheAsshole/comments/ymwq0r/aita_for_refusing_to_translate_for_my_sisterinlaw/", "score": 733, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I told my sister in law I'm not translating for her anymore unless she starts learning the language \n2) It means she can't speak to our in-laws\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA- I'm American, my husband is German.  I moved to Germany when I was 23 ish. I could communicate in German, fairly competently, within 6 months.  \nThis is her own problem.  If all she wants to do is order coffee than that's on her.  She will not be able to participate in others conversations.  \nIf he husband is willing to put up with this, then he needs to stick to her side like glue.\nI personally am way too nosey to live like this!", "NTA, not your responsibility.", "NTA! I find it disrespectful not to bother to learn the language when you move to a new country.", "NTA", "NTA. SIL cannot move to a new country and marry into a family that speaks a different language than her and expect everyone around her to do the extra work of translating so that she can have a relationship with everyone in the family for the rest of her life. At some point she has to put effort into those relationships too other than just showing up. In this case, as most family dialogue is in French, that's the language she needs to function as a full member of the family and not a guest that's worn out her welcome.\n\nSIL and BIL are upset because OP saying she's had enough means that now the only member of the family who will translate for SIL is BIL. It's made clear just how ostracized SIL has become, and they don't want to own that this is the consequences of SIL's choices. I highly doubt the rest of the family is thinking anything other than \"putain enfin.\"", "NTA. This is unsustainable. If everyone speaks English, she doesn't need a translator.", "NTA she is definitely an AH my daughter 20 and I are going to be in France for 9 months next year while I go to school and she and I are just starting an accelerated course in French so we can speak the language even though my classes are in English. How entitled of her to think you need to be her personal translator after 8 years for f sake.", "NTA\n\nHer husband should be her personal translator if this is the case, not you or anyone else around the table. \n\nI mean, she has to know more than how to order coffee if she's lived there 8yrs?! You pick up languages as you go, especially when it's predominantly around you?\n\nAnd if you want to apologise, please do it in French.", "NTA. If she wants to understand she can take some effort by starting to learn the language. \nShe moved there expecting to learn no French? After 8 years? Good grief.", "NTA - Honestly OP it sounds like you aren't the only one who doesn't want to translate for SIL anymore.  You said her siblings don't want to do it. AND also if the husband is actually angry with you, maybe he also desn't feel like doing it all the time (maybe he feels like he needs a break translating and so he relies on you). This whole thing is ridiculous. After all this time, even if SIL can't speak the language she should ATLEAST be able to understand. SMH.", "Im learning polish to speak to my GFs parents. Its a big thing that cannot be expected, but like, you cant have your cake and eat it too. Burden of communication cant be outsourced to you.\n\nNTa", "NTA, not your job at all. And frankly, after this much time, not her husband’s either, I have been in a situation where I had to translate everything between my parents and my partner and it’s mentally draining. I don’t know how people can spend years in a country and just flat out refuse to assimilate because “they can get around with English”. No. She can start making an effort.", "NTA. Either she learns the language or someone else translates for her. That isn’t your responsibility.", "NTA. She definitely has to do some effort, I can understand if it was just a few months, but that many years? Girl should get a clue.", "NTA\n\nBut I feel like you have to EFFORTLY TRY to not pick ANYTHING up in 7 years\n\nI had this employee once who didnt speak a word of English, he spoke Serbian I think or whatever that language is called. No one in the workplace spoke a word of his language either [how he got hired isnt really relevant here]\n\nWithin a month we learned to communicate efficiently without knowing eachothers language and within six months we could have small simple conversations. \n\nI know it's weird to think of communication without words being a thing because we rely so much on language, but its ABSOLUTELY a thing and it doesnt take that long to grow a communication system between 2 people. \n\nSo when I say she had to put in effort to not communicate with the family, I mean it. That, or shes neurodivergent and can absolutely NOT pick up on any non-language cues.", "NTA Personally I think Sarah is not only entitled, she’s rude! Clearly, *everyone* doesn’t speak English. Her in-laws (who should be important to her) don’t. And if her husband is mad about you drawing a line, he can damn well translate.\n\nETA There’s smartphone apps for spoken translation, she could use one of those?", "NTA. Good for you. Being an interpret is exhausting...and a well paid job she's having you do for free!", "NTA\n\nIf she really doesn’t want to learn French than her husband can do the translating. It’s not your job", "If you do apologize, make sure you do it in French. \nNTA", "NTA --- If your SIL wants an apology ok sit her down and tell her if you sounded harsh then yes apologize for that as it wasn't your intention BUT, as far as playing translator, that still stands she should have made an effort to at least learn the basics after so many years there.", "NTA. It’s not your responsibility to translate. \n\nIt’s possible your SIL has a learning disability that inhibits her ability to understand a different language. I do, which broke my heart when I was in college because I very much wanted to speak Italian fluently, but despite my best efforts (including private tutoring) I could only understand it if I was reading it or the person speaking it to me went very, very slowly. It was frustrating as hell, and I used to bitterly blame it on US schools not starting kids in languages until they were teenagers (not sure that’s still the case - I hope not), after they had passed the easiest learning window for it. But it turned out to be me - I got tested and was eventually allowed to take ASL to fulfill my language requirements.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (31f) live in Brussels with my husband (30m) \"Leo\". Leo has a brother \"Oli\" 34m who is married to \"Sarah\" 34f, who also live in Brussels. Sarah is from an English-speaking country and has never bothered to learn French (the language our husbands and their family speak), even though she's lived in Brussels for seven or eight years now. She says things like, \"Everyone here speaks English, so I don't need to!\" or \"I know how to say \"a coffee\", that's all I need.\"\n\nFrankly, she can do whatever she wants, but our husbands' parents don't speak English, so whenever we spend time with them (which is quite often, we have dinner there more or less every Friday), the conversation needs to be translated. For some reason, this now always falls on me (I'm also from an Anglophone country, but my dad is French). \n\nI didn't mind at first, but she's lived here eight years, she's *married* to a Belgian man, and she's never bothered to learn so that she can speak to his parents directly. I find it annoying that it always falls on me if her husband isn't there, because the rest of the siblings (they have another brother and another sister) find it irritating that she's never made an effort and just don't bother translating anymore).\n\nLast week I was trying to speak to my mother-in-law about something quite personal (my husband and I are trying for children and it's been hard) and Sarah kept asking me to translate for her. It was really starting to annoy me, especially as it was a sensitive conversation and translating it was quite painful, so when we left, I told her that I wasn't going to be the go-between for her anymore. I told her that she lives here and that if she wants to speak to his family, she's going to have to put in *some* effort to learn the language.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Presumably her husband speaks English since they found their way into a marriage- he can translate for her if she cannot or will not learn French.", "NTA to your question about acting as translator.\n\nBut the same issue applies to your in-laws, no? In 8 years they haven't bothered to learn enough English to speak with their son's spouse?", "NTA  \n\nGeez, I, as an American who only speaks English, am astounded by your SIL behavior.    \n\nI visited France for ten days and I could order lunch, ask for help finding a location, and a few phrases that could get me by throughout the day.    And I'm horrible at languages.    I am from California, and you'd think I  would at least be able to speak Spanish,  I had several opportunities, but for some reason I struggle with learning anyhting beyond phrases.  \n(I'm the same why with math)  \n\nBut living in a country for so long and only knowing how to roder coffee is ridiculous.  \n\nAnd they want YOU to apologize?   She's ridiculous.   She should be apologizing for her disrespectful lack of effort.", "NTA and you were very generous to translate for as long as you did", "NTA, and if she won’t come to any more family dinners unless you apologize, then you won’t need to translate for her anymore. Problem solved.", "I'm confused. Isn't Brussels in Belgium? So why are they speaking French?", "NTA I would be annoyed too.", "NTA. It's not as if she just moved to a foreign place with a different language, but she has been there for more than 7 years. That's enough time to AT LEAST know the basics and hold a conversation. I understand how frustrating it is to translate everything to someone Who does not know the language, even though they've been living in that place for YEARS.", "Think she needs to bring along her own translator so the family can enjoy their personal family time together. Time to announce to all that needs to know that translating is over. It takes away from your own enjoyment and I don’t think that everybody should stop and pause speaking until she is caught up with conversations. NTA. Their loss if a no show to dinners. Can apologize as in sorry, but will not be taking on that task any more. (it is a task aka job).", "NTA\n\nWhat they are really saying is no more family dinners until you agree to be translator again.  That's not your job or fire to put out.", "NTA. How does she exist in the community if she doesn't speak the language, does she rely on people speaking English for her?", "NTA. One of my best friends is engaged to a French girl, but they live in the US and he *still* put in the effort to learn French so he could communicate with her family when he visits France.", "Why doesn’t her husband translate for her?", "NTA\n\nTranslating between his wife and parents is her husband’s job.", "NTA - Why post? did someone get angry at you for this because it sounds like everyone is annoyed at her and agrees with you, so i just dont see the need for the post. This subreddit is for people not knowing whether they did the wrong thing or not .", "NTA. After seven years, the requirement is totally fair. Stop being her crutch, and she'll learn.", "NTA\n\nHow are you supposed to enjoy family dinners or have natural conversations of your own if you need to translate for someone the whole time, every time?\n\nWhy can't her husband translate?", "NTA at this point, you’d have to make a conscious effort to NOT pick up another language if you’re surrounded by it all the time and manage to only filter it out so english is all that you can hear and absorb.\n\na few of my friends moved to europe and within 2 years, they picked up swedish and german. absolutely achievable.", "NTA. Apologize for what? Not doing unpaid work every week for an ungrateful person? \n\nI'd apologize for being a little rough about it , in French, and then tell her you aren't her service so if she wants real-time translation services she'll have to bring her own from now on, like, I don't know, maybe *her husband*.", "NTA but I have no idea why you enabled it so long", "Nta stand your ground", "It just seems disrespectful that in ~8 years she’s lived there she never once thought being able to speak to her husband’s parents was worth the effort of learning a language. NTA", "NTA. \n\nThe next time she asks I would be tempted to say, \"Everyone here speaks English. Why do you need me to translate?\"", "NTA.\nAlthough I am a bit surprised that she gets around with English. I was in Brussels a few years ago and it was very difficult to place an order in English.", "Tell her you’re in tears because of the blatant disrespect and lack of interest she’s shown her in-laws. NTA", "I find it dangerous. What if it’s an emergency and you or someone else needs help?", "I go to church with a large number of Latinos. My accent stinks and I cannot speak effectively all the time, but after 10 years I can exchange pleasantries. I can conduct business, to a point. I can understand half of Spanish mass. But to not make the attempt is an insult to my friends. You have to be TA to do something like that for that long", "Yeah her husband should have encouraged her to learn waaaay before now.", "Yeah, this is exactly what I was thinking.", "Hmm, I suppose to a degree.   \nBut they're fairly elderly, and they've lived here all their lives. Plus, one of their daughters is married to an Italian, are they meant to learn both English and Italian to speak to their son and daughter-in-law, or should the people moving to Belgium learn French? (or Dutch/German depending on where you move).", "NTA \n\nIn belgium they have three languages and most speak them too,  so learning a fourth for the little princess is in need?\n\nShe can live on only  with english but don't demand for a translator. She is not the CEO", "I can see how it might seem like that at a glance but as someone who is in a bilingual marriage, that's not the same. It's unreasonable and unrealistic to expect your in-laws to learn your native language.\n\nSIL made the choice to move to a French and Dutch-speaking region and to marry a French native speaker. By her choice, she has many family members who are French native speakers, including two monolinguals, and will encounter many other French native speakers in her daily life for the rest of her life. It would make sense for her to make the effort to learn one language to communicate with tons of people, as a result of her choices. If not, she should accept the consequences of her choice but instead, she is demanding that everyone else kowtow to her, at great efforts.\n\nMeanwhile, the in-laws did not make any choice that would require them to speak a foreign language. Due to reasons outside of their control, they have one English native speaker (not counting OP who is bilingual) and one Italian native speaker in their family. Learning a new language takes thousands of hours of efforts and it's reasonable for them to think it's not worth learning 2 languages to speak to one person per language. If they don't, they also should accept the consequences of their choice, which they do. \n\nLike I said, I am in a bilingual marriage myself. We've been together for 14 years and none of my in-laws learned my native language, nor have my family learned my spouse's. I have a French friend married to a Norwegian dude, also for 10+ years; her family didn't learn Bokmål nor did his learn French. Same when my cousin married a Thai woman, her family didn't learn our native and my uncle and aunt did not learn Thai. Etc. That's just how it goes.\n\nETA: \"and Dutch\" to the first sentence of the second paragraph, thanks /u/issy_haatin.", ">only knowing how to roder coffee is ridiculous.\n\nIs ordering a coffee that important that it is the only thing she knows?", "Pretty much. She just speaks English to everyone in shops/ restaurants/ cafés etc. It is really disrespectful.\n\nShe works in an English-speaking environment so it's not a barrier at work, but still.", "In brussels its quite easy. :)", "Brussels is the second most multicultural city in the world after Dubai. More than 80% of its inhabitants have been born abroad. Many people here survive off English because they never leave the bubble. If OPs in-laws are the only people who don't speak English that she knows in Belgium, it's very likely she never picked up any French. I also know people who have lived here 10-15 years and only know the basics (not that I approve).\n\nAnd to someone asking why she knows how to order only coffee... I swear that's the phrase I know in the most amount of languages because it's the most common order.", "Its a big thing that cannot be expected, but like, you cant have your cake and eat it too.", "Ah sorry, her husband and she are very angry - I'll edit to include it", "Exactly!", "**I agree** your SIL should learn the basics of the predominant language of the country she lives in.  It's common sense and respectful to do so. \n\nNow that you have stopped translating for her, maybe she'll step up her efforts to being bilingual. Maybe her own husband should deal with her translation issues. Or maybe your in-laws will start including her by speaking a language she can understand.  I think both sides are rude.\n\nYour attitude about this reminds me of people in the US yelling \"You're in America, speak English!\"", "Fair enough then, tell her husband to teach her french then and it has nothing to do with you anymore NTA", "I'm the opposite of that. People can of course speak any language they like, but it's quite rude not to learn the language of the country you live in, and to assume everyone will just speak English for you.  \n\n\nAnd your attitude reminds me of Americans refusing to learn foreign languages and assuming everyone else will learn English.", "I think there’s a difference between “you’re in America; speak English” and refusing to translate for someone who won’t put in effort to learn the language of the country they’ve lived in for almost a decade.\n\nOne is exasperation and the other is xenophobia.", "OP has been translating for her SIL for nearly 8 years, she also comes from an anglophone country, but speaks *at least* two languages, and you’re comparing her to the one-language speaking Americans (no, I don’t mean all Americans only speak one language, I’m referring specifically to the same subgroup you are) yelling “speak English”. That’s an utterly ridiculous comparison.\n\nAs for the parents, they probably know a few English phrases but you expect them to learn enough English at their more advanced age (it gets harder as you grow older, you know) to include someone who is wilfully excluding herself. And calling them rude for not doing so… also ridiculous!", "Exactly. Why can’t her husband translate? Why is it OPs responsibility? This shouldn’t involve OP at all, they’re just looking for someone else to blame.", "This is exactly what I was thinking. I (an American) wanted to ask you if your SIL was from the US. She  certainly fits the stereotype.\n\nEdit to add judgment: NTA!", "NTA!!\n\nMy stepson, who always used to be utterly useless at languages, married a Dutch guy and moved to Amsterdam. He immediately signed up for lessons and now 25 years later he speaks English with a Dutch accent. \n\nAbout 15 years ago they moved to France. SO HE LEARNED FRENCH TOO. I am so impressed with him. He did it because he loves his husband and wwanted to put the work in!", "NTA\n\nI don't blame you a bit. Personally I would apologize to keep the peace.\n\n\"I'm sorry, I won't be your translator.\"", "Nta, trash took itself out.", "NTA. She’s eavesdropping *and* interrupting your conversations with your MiL.", "\"I'm sorry it's been 8 years and you still haven't bothered to learn the language yet\"\n\nNTA", "NAH\n\nYou are not her personal translator and are free to opt out. If you must give an apology, do it for your tone and not your message.\n\nI honestly don't agree with others that she is a bad person for never learning French. Learning a new language is extremely difficult and a lifetime endeavor. Many people are unable to do it, even if they want to. \n\nShe obviously doesn't need to and has found coping mechanisms to live comfortably in her new environment. She hasn't been isolating herself and interacts with her neighborhood and environment.\n\nI would also point out that her in laws have not reciprocated and tried to learn some English. They have had the same 7-8 years she has had and likewise not bothered.", "NTA\n\nEven if she has auditory processing issues making it hard to learn (but it sounds like she’s not even bothering to try) why can’t her husband be her translator? It’s so weird that the responsibility falls on you instead…", "NTA", "NTA \n\nShe can learn French or *her husband* can play translator. It was never your responsibility and they are entitled to behave otherwise.", "NTA. Her husband can translate for her from now on. Don't apologize. Her husband doesn't want to come if there isn't a free translator, that's his choice.", "NTA\n\n&#x200B;\n\nTHis is easy: **She has a husband. Let him translate for her.** Not your drama.\n\n&#x200B;\n\n\"They're refusing to come to any more family dinners unless I apologise.\" .. Don't The family dinners will be less bothersome for you without her there.", "She has a husband - he can translate. It’s his job to be the mediator, not yours; she isn’t married to you. I know French is hard, but come on.\n\n\nNTA.", "Wow so that’s entitled and they are hurting themselves. Still If you want to keep peace sure apologize but you should tell her husband it’s his job and you still won’t be the interpreter\n\nNTA", "NTA", "Honestly, as an Anglophone, French is not that difficult to learn (compared to some other common language groups). So the bar is low already.. Even with MINIMAL effort she could have learned enough French to communicate a bit with his family. If she's that lazy, she should experience the consequences. NTA.", "NTA.  Let them learn or be left out. Too time consuming.", "Nta", "NTA, it isn't your responsibility to translate if she isn't learning the language it falls on her husband to translate. My family has been in the U.S. for over 20 yrs and like 1/2 of them can't speak English it's not that they don't try it just isn't sticking. They can tell you simple things but not have full conversations (some are getting there though). My husband on the other end only speaks English, I am the translator between my family and my husband, and my cousin translates between our family and her bf. My cousins, me, and my sibling translate when my family needs something from anyone else that speaks English. It sounds more like your SIL is just refusing to learn altogether so that falls all on her for refusing to even try and demanding a translator.", "NTA it is impossible to effectively interpret and also be part of a conversation. Not only is your SIL asking too much of you, she’s actively impeding your ability to interact fully with your family.", "It is possible she may have a hard time learning languages. She may have given that excuse cause shes embarrassed to not be able to learn it. It may just turned into her being used to others translating for her and never bothered to try again.\n\nI prob would have just told her you were not going to translate a personal matter to her, and she didnt need to know this info. \n\nIll still say nta since she could have at least tried more to learn and shouldnt push into having to know every conversation going on in her presence. Her husband should honestly do it for her.", "NTA - This feels like a power play on her part - Someone has to follow her around and translate everything for her special.\n\nShe can get duo-lingo. And since she is in a French immersion country she'll pick it up quick enough.", "NTA\n  \nI'm afraid to ask,  because I think I know the answer, but is she American?\n  \nI wonder if I would be more or less relieved if you say that she's from stone other English speaking country? I just don't want to have to feel embarrassed by one more person who's attitude is,  \"Everyone hear speaks English!\" that calls the good old US of A their home country. \n  \nI mean, do they KNOW that most of the founding fathers spoke at LEAST 2 (often 3 or 4) languages?!?!?!", "NTA\n\n> They're refusing to come to any more family dinners unless I apologise.\n\nSounds like the problem solved itself.", "NTA. After 8 years in the country, she should have conversational language skills at a minimum.", "NTA. Your SIL is quite entitled and honestly disrespectful. There is no excuse for not trying to learn the language of the country where she has been living for 8 years.", "That's such a good point. Bet she'll be on Duolingo quicksticks if her husband has to put the effort in.", "*chefs kiss*", "The situation you describe would be called \"language immersion\". The Serbian gentleman was *forced* to learn the new language because there was absolutely no one who spoke Serbian.\n\nThis woman is surrounded by many who speak her language. Her job is conducted in English, her husband speaks English at home, her friends speak English, and the shop workers speak at least some English. She can be comfortable and carry on without French. Your coworker could not.\n\nThe few places where there is no English, like a coffee shop, she has figured out enough French to get along. Like your co-worker did at work. So she can exchange basic greetings and likely understands more than she can respond.\n\nSo actually no, it makes complete and total sense that she hasn't learned French and that it would require actual effort for her to do so. This is actually super, super common. How do you think places like Chinatowns and Little Italies form? Entire bubbles of transposed culture and language, that those in them never need to leave.\n\n She would have to go out of her way and purposely put herself in uncomfortable, all French language, situations on a daily basis, plus take classes, and resist the urge to retreat back to the comfort of the familiar. If there was even one other person who had spoken Serbian, your coworker would not have developed the communication skills he did.", "The rest doesn't bother anymore, so why is she the villain when she did it longer than everyone else?", "Especially because over 8 years of hearing a language every day, you should start to pick up on it. You have to be intentionally willfully ignorant to not learn even the basics. Incredibly disrespectful.", "I've been studying Indonesian off and on just for vacations, but I'm also a word smith (and dork).", "I know, right?\n \nMy husband moved across the state to be with me (US). Not even a different state, just to a different state. But we live in a border town. \n  \nEveryone in my immediate (and most of my extended) family speaks English. But around here, if you want a job and friends, you need at least *some* Spanish.\n  \nHe enrolled at Spanish classes at the local college. \n  \nHe's not fluent, but he can get by now. \n  \nAnd that was within the first 6 months of living together. Does the SIL not work or go out or anything?\n  \nTo be fair, though, Brussels is a large tourist destination, so she probably gets accommodated a lot in restaurants and things. But I would get upset if I was in OP's shoes.", "Because it's one of the official and most spoken languages in Belgium.", "Are you confused by Americans speaking English as well?", "My question is why hasn’t BIL helped his wife learn French?? Them being mad at OP makes them look incredibly entitled. 🤷🏻‍♀️ NTA.", "NTA. Either she learns the language or someone else translates for her.", "*French* chef’s kiss!", "She doesn't have to go out of her way, she just has to keep attending dinner at the in- laws and try and talk to them!", "*et toi, mary?*\n\n*I  D O N T  S P E A K  F R A N C A I S*\n\n*pardon?*\n\n*ME NO HABLO FRANCAISSSS!!!*", "[deleted]", "She'll be able to order a coffee to calm down... /s", "I live in the US and it’s crazy how people will live here for 10 but not bother to learn the language. The government feels they should have a translator. They even have the drivers license test in a bunch of languages even though road signs are in English. People get upset if they get pulled over and given a ticket because they can’t read English, seems like that would be important.", "No but if I was in a random country like Mexico where they speak Spanish I would be confused if they were speaking French.", "Chef’s *French kiss*?", "JAMBON", "They get a translator because unlike most countries, there is no official language for the United States. \n\nLearning enough words to read road signs isn't difficult, you could do it in a few weeks.", "> Your attitude about this reminds me of people in the US yelling \"You're in America, speak English!\"\n\nSIL is literally the one yelling \"speak English\" at people. Well, not literally yelling: crying and demanding apologies from others for speaking their native language in her presence.\n\nSIL's attitude is the one that has major English native speaker privilege and entitlement written all over it. We regularly see stories like OP's here. Never once have we seen someone moving to the US and marrying an American then demanding that the whole family stop speaking English or that someone be their free lifelong interpret.\n\nIf the situation was reversed, say an American couple with 4 kids, one of which married a Chinese citizen and another married a French one, we would never say 8 people need to make the massive effort to learn both Chinese and French because the 2 married couples can't make a much smaller effort.", "Then why are you confused about Belgians speaking (among other things) French?", "My attitude? I have said twice already SIL should have learned the language of the country she lives in. And I am multi-lingual.\n\nYou came here asking for judgment. I have judged you **not the asshole** and you're still upset because I have dared to also offer a slightly-different perspective on the conflict, unbelievable.\n\nYou win!", "NTA.  She lives in Brussels and married to a family that speaks French.  Duh!  She can learn.  \n\nIf BIL is upset, he can translate for her.  Is SIL lazy in other aspects of her life?", "NTA.  Why would you need to apologize?  It is neither your job nor duty to be a Translator for her highness.", ">They're refusing to come to any more family dinners unless I apologise.\n\nGOOD. Then it sounds like your translating duties are done. NTA.", "NTA. I'd \"apologize\" by giving her an English to French Dictionary", "Surely it’s a win win for you - if they don’t come then you don’t need to translate! \n\nNTA. I cannot fathom how she has spent 8 YEARS living in a country and not picked up the language yet! My in laws moved abroad about 3 years ago and they can speak enough to hold a conversation with their neighbours and shop/order food at a restaurant etc. \nMy mother finds it very difficult to learn languages despite living in multiple different countries over the course of her life time but she does at least TRY and learn!", "She can use Google translate.\n\nDont apologise. If she stayed away from the Friday night dinners, it would be a blessing.\n\nNTA.", "NTA. Lived in county 8 day, don’t be silly. \n\n8 weeks, still settling in.\n\n8 months, surely taking lessons of some kind.\n\n8 year, are you shitting me?!\n\nAnd well the edit seemed to solve it, she’s not there to pester anyone with her failure to do the minimum to embrace her county of living and it’s couture.", "She refuses to learn because everyone speaks English. But apparently not. Your SILs have had enough with translating but she and her husband are upset because her other option is also fed up. How can you live in a country eight years and make so little effort? Why would you want to be so lazy? And why is this your problem. Six months of having to speak French and she'll be just fine. So - suggest resources. Duolingo - despite their latest hideous update - is a good starting point. You Tube is full of resources. Honestly it's embarrassing - half an effort and she would be fluent in a couple of years. NTA nothing will change with this on e unless it has to.", "For some people learning a new language is really hard.  NAH yeah she should try but not everyone can", "I don’t know how this is possible. I lived in the Netherlands for 2 years and despite not wanting to learn Dutch, I am now at a conversational level just from living there. Your SIL must really go out of her way not to learn French.", "NTA. I’m American. There is no way I’d not start trying to learn AS SOON as I learn I’m moving there. There’s no excuse. It’s not a vacation where you can claim “oh everyone speaks English” AND the family speaks it. It’s just rude. \n\nIt would be different if she was trying and struggling but to flat out refuse is just disrespectful", "NTA - 7-8 years?!? If she had put in any effort she would be fluent by now. This isn’t your job.", "NTA.  Call and apologize to her in French.", "NTA. INFO: Why isn't her husband the designated translator? \n\nAlso she owes you an apology for so many interruptions.", "NTA I am Canadian and have only recently wanted to start to learn conversational french as I had to move to Ottawa and knowing french is just beneficial to job prospects. I cant imagine not learning the language my in laws speak while living I  their home country where almost everyone else speaks it.", "NTA, you are being pressed to do unpaid labor. If he wants to continue to support his wife not learning the language of the country she lives in and connecting to y'all's parents, he can translate for her. Don't apologize, they shouldn't come to family dinners since she clearly doesn't want to make a connection with the family in the first place, and have been using you as unpaid labor for years", "Only speak to her in French from now on\n\nNta", "NTA-- At this point she needs to make an effort. That's her loss if she's not willing to learn", "NTA\n\nI believe SINCERELY in learning the language of a country you want to move to. It's one thing when you're new and still stumbling, but eight years is plenty of time, and I don't know why her husband encourages her laziness.", "First of all it's not your job to translate for her. Secondly this was a private conversation so she had no business in there anyways. There was no need to translate for her as she was not even part of the conversation. If she feels left out then it's her own fault. NTA", "NTA, why not be mad at his siblings who also refuse to translate? They are jerks and need to get over themselves.", "NTA\n\nIf the other siblings have backed out of translating for her anymore then you are 100% allowed to as well. Why isn't her husband being the translator?\n\nHopefully your parents in law understand.", "NTA and also Google Translate has been a thing for 15 years so.....", "NTA! Good! If they refuse to come to dinner then you won’t be a translator for her anymore 😂. Why the hell does her husband not translate for her? What do they speak at home? I always try and learn a few things when going to a foreign country on holiday nevermind living there 8 years and not speaking the language. Ridiculous!", "NTA\n But, how can you live in a French speaking country and not at least learn conversational French", "Apologize for what exactly? They’re entitled and delusional.\n\nNTA", "J'etudie la francais pour deux ans et j'ecris des phrases simples. Si vous peux me comprendre qu'elle peut apprendre aussi.\n\nNTA. I'm able to write very basic sentences after using Duolingo and watching French youtubers. I've never been to a francophone country and I have no francophone friends. She's had 8 years to learn to communicate at a basic level in french. It doesn't have to be perfect. I've never understood how people can live in a country for years and not bother to learn the language.", "NTA. And what’s her husband’s excuse for not translating for her?\n\n>\tSorry I forgot to add - after this happened she was apparently in tears with her husband that night, and now both of them are upset with me. They’re refusing to come to any more family dinners unless I apologise.\n\nWelp, problem solved then. How thoughtful of them!", "NTA, it's not your job to enable her Bad choices when She has a husband who can translate for her just as well.", "NTA> this is weird lmaooo\n\nI would not be translating for her at all. \n\nshe is ignorant as hell", "Sounds like them no longer coming to family dinners solves your problem. NTA.", "I would figure out what a translator costs an hour and hand her a bill for the approximate number of hours you have translated for her for, and tell her, that until she is current, your services are no longer available to her, and from now on she will pay a 2 hour minimum up front for each family gathering. \n\nNTA.", "NTA.  SIL is the ah.      *She says things like, \"Everyone here speaks English, so I don't need to!\"*   Proven wrong, by her husband's own parents, from day one.  By day sixtygamillion, it is way past being her own fault.", "Obviously NTA. She clearly doesn’t wanna make any effort and it should not be your responsibility to translate anything for her. Why doesn’t her husband translate if his so annoyed about you not wanting to translate?\n\nI means it’s HIS WIFE who’s not making any effort to bond with HIS FAMILY. That’s their problem \n\nNow, I’m petty so would just wait until you see then again and be like “I’m sorry that you care so little about your husband and his family that you see no use on learning the language they speak. Also I’m sorry that your husband doesn’t care that you will be excluded from any conversation with his family from now on, cause I’m done being your personal translator and he never translate for you. But look, there always google translator, maybe that will help you”", "This. OP, they're upset because it was EASIER to make you do all the work, for her to sit there and not learn anything, and for him not to go to every event with her. That's their problem. You did nothing wrong. In fact, you've done more for her than most people would.", "Husband does translate, only when husband isn’t there does OP translate", "Brussels is the 'capital' of the EU. Not everyone 'dispatched' there will learn dutch or french like the locals. Most locals can understand English, and shops / restaurants will definitely be able to help you get rid of money in English.", "I don't suppose you've been to Europe? It being a multilingual continent is the reason why we have Erasmus programme. You can easily live half a year or a year in another country without learning the whole language. Sure, you won't have a small talk with the cashier, but aside from that you'll be able to have a full social life. Restaurants, cafés, museums all can be navigated with English only. Even plays very often have options of English subtitles on some days. University is in English too and if you have to (Erasmus is paid, so it isn't always necessary to work) you can work without local language like in Uber or food delivery.", "It also sounds like the trash taking itself out. Who’s going to miss her at family dinner if she can’t communicate in the language everyone else — especially her in-laws — is using? And ZERO effort for 8 YEARS? Despite having studied the language spoken by my former in-laws, I initially had difficulty understanding their rapid and colloquial speech, but I asked questions and learned. And while visiting in their HOME?! I certainly never expected anyone to translate for me or switch to English. She’s a very disrespectful DIL!", "What else would they be speaking, Portuguese? Edited to clarify;  I picked a random language to be obnoxious.  \n\nI'm from the US and I know that the official languages of Brussels are French and Dutch.  Geography is my area of interest;  I know some stuff about other countries.  Not enough, but some.", "NTA. I'd say this actually borders on weaponized incompetence - OP's SIL had 8+ years living in a foreign country to learn a new language, which she refused to do. The moment OP tells her she doesn't want to be her personal translator anymore, SIL pulls in BIL to gang up on OP.", "This is embarrassingly common in Brit/American \"expat\" communities.", "NTA. How does she exist in the community if she doesn't speak the language,", "[removed]", "The difference between Chinatowns and Little Italy's in America is the access to education. If you're a poorer, working immigrant, you have less resources (time, money, transport etc) to be able to afford to learn english. If you're an American/Brit living abroad, it's relatively affordable and easy to access.", "Hell I read a post where the parents of a deaf child wouldn't learn sign language because the older sibling learned it so they forced her to translate. Insanity.", "I mean, the in laws probably understand english fine enough, but like most of an older generation are uncomfortable conversing in it.", "> shops / restaurants will definitely be able to help you get rid of money in English\n\nI don't know why this made me laugh so hard, but I have a friend whose father was Quebecois. Let me just say, IYKYK.", "I am from California, and you'd think I would at least be able to speak Spanish, I had several opportunities, but for some reason I struggle with learning anyhting beyond phrases.", "Eh... Most belgians will be able to understand basic English, they'll not always be able to respond though.", "> French-speaking region\n\nYeah no, don't go shouting that. Brussels is officially both french and dutch speaking.", "I mean, you can lead a horse to water but you can’t make it drink. I think BIL maybe gave up on her learning French, then got an extremely one-sided story from his wife.", "It's almost impressive that she has lived there that long and not managed to pick up the language at all", "Bad bot, stealing comment just above, but the other users name is too hard to type and I'm on mobile", "You are an American, aren't you?", "[removed]", "This is gross. Unlike other European countries, the US doesnt have an official language. You can live here your whole life and be in a community that doesn't need english because we have so many languages here and the US is very accommodating to that. I think it's super cool and something to be celebrated. English entitlement is stupid in a country that has a non-English official language.", "Fair enough. I didn't mean to offend. My post was starting to be too long and I took a shortcut. That doesn't change my overall point, which is you can't reasonably expect your in-laws to learn your native language.", "[removed]", "No worries we appreciate you for pointing it out, thanks", "You people make my ass twitch", "WIN WIN for OP. NTA", ">  but it's quite rude not to learn the language of the country you live in\n\nCaveat being Belgium has 3 official languages, hows your dutch and german?\n\nI agree she should have put more effort in learning her husbands language to converse with his family, but learning the local language for Belgium isn't as straightforward. Hell, most belgians will be able to converse in English", "It says OP translates if BIL isn’t there with his wife (third paragraph). So, yeah, he speaks English and French.", "That's not usually the part that gets kissed during a French kiss....", "Then she can stick close to her husband at all times, or MAKE HIM stay in the place She wants to be when the splitting off into smaller groups during family gastjerings happens."]}