{"id": 15521, "submission_id": "12wn9fq", "title": "AITA for \"ruining\" my friend's wedding by wearing a \"attention whore\" outfit?", "selftext": "TA for privacy\n\nI (23F) and my husband (24M) were invited to one of my close friends wedding. This friend and I were besties since high school and I'm incredibly grateful for her friendship. It was a destination wedding that took place in Italy. My friend had initially asked me to be a bridesmaid but I had to turn it down because most of the wedding planning and other important events were going to be in Italy and because I'm a resident doctor, I wouldn't be able to make the commitment. My friend added me to a group chat of her and her bridesmaids though so I could see the updates and join in for any event that I was free for. I still didn't think it would be nice for me to just go without having put in any of what should've been my share of responsibilities so I never went for any of the events.\n\nWhen my friend sent the invites she mentioned a dress code for us guests. It was \"Full black, anything but dresses for women and full black business casual for men\"\n\nThe only wedding appropriate outfit I had was straight leg full length satin pants and a leather corset top. I asked my friend (along with a picture of the fit) if it was ok to wear that and if she felt uncomfortable with it, I'd get something else immediately. My friend said \"It looks gorg and quite frankly m/n I couldn't care less if you turned up butt naked as long as you came to the wedding. Please don't fret about the outfit too much. I miss you and just really wish for you to be there.\" I got the bride's approval so that is what I wore to the wedding. My husband wore a turtleneck, blazer and jeans (all black). The wedding went beautifully, and my friend and I reconnected after a long time and all I felt was happiness for her and how much I was going to miss her.\n\nThen out of the blue, one cousin of the bride (26?M) came to me and said that my outfit was inappropriate and that I was ruining the wedding. One of the bridesmaids came and in a very huffy tone agreed with him. I explained to them that I had gotten the bride's approval so I didn't see the problem and that there were other women dressed in dresses which broke the dress code so I didn't see why they were only coming for me. They replied with a \"yeah but the bride is spending more time with you than them so you're really ruining it with your attention whore outfit. All the wedding photos are going to look so out of place because of you\". My husband tried defending me but they were adamant on blaming me so I just borrowed my husband's blazer and wore it for the rest of the evening. It didn't feel right to ask the bride about this so I just left it but I need to know if I'm TA.", "created_utc": 1682278469, "permalink": "/r/AmItheAsshole/comments/12wn9fq/aita_for_ruining_my_friends_wedding_by_wearing_a/", "score": 363, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) My decision to wear a bride approved outfit to her wedding that was apparently a very attention seeking one a photo ruining one.\n(2) It might make me TA because maybe my discerning abilities should've been better and I should've worn something else anyway despite the bride's approval.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. And bonus points for not dragging your friend the bride into the drama.", "NTA. the bride approved it. It was her wedding. The cousins opinions dont matter. Leave it alone.", "NTA because you checked with your friend, the BRIDE and she didn't just say yes she was totally utterly happy for you to attend wearing that outfit.\n\nThat other members of her family or wedding party are busybody prudes is not your problem. I'm sad you felt the need to cover up though I understand why you wouldn't want to get the bride involved. \n\n1000% NTA", "NTA - considering you got the bride's approval prior to the wedding, you did nothing wrong. I personally wonder if those complaining were just jealous...", "NTA ... for one simple reason .. the bride OK'd it. If you'd shown up with no heads up, then yes, she'd have every right - if it offended her - to be offended.  Everyone else can go pound sand ... its not their wedding. Unless the bride and groom say it's ruined, ignore everyone else", "NTA, sounds like they people complaining were jealous of how much time your friend was spending with you instead of them and wanted to shit on you because of it. They are the ahs here.", "NTA - for the fact the bride okayed it and was happy to see you.\n\nPretty sure this isn't about the outfit at all. The outfit is the thing these people were able to cling to as a way to vent their feelings about how close you are to the bride. They aren't mad that you are taking attention away from the bride but are mad that the bride is giving you attention. \n\nIt could even be that they aren't the jealous ones but are running messages for the actual jealous party. Either way you did nothing wrong here.", "As a soon-to-be-bride, please let the bride know what happened like a week or two after their honeymoon, I'd really want to know if a family member slut-shamed a friend at my wedding like this. I'd be so pissed on your behalf. You don't deserve to be treated like that, you had done nothing wrong. NTA.", "Nta.  \n\nWhy do you care what some random person had to say about it?\n\nYour friend. The bride. Liked it and approved it.   That's all that matters.", "NTA - These wedding people are killing me.", "[deleted]", "NTA. They're presumptuous, and probably envious.", "NTA\n\nDid I read this correctly, no dresses allowed?\n\nThat's really an insane rule for a wedding", "NTA. When it comes to weddings I don't care about anyone's opinion except the bride and groom. If they're okay with what you wore, no one else matters.", "NTA \nYou checked with the bride so that's all that really matters\n\nYou followed her weird dress code\n\nYou flew to Italy \n\nF*ck these people, the bride wasn't upset so they're probably just mad they didn't come up with an outfit that looked as good\n\nAlso, good job on not bugging the bride or groom, this is petty drama and you've done the right thing", "Nta", "YTA for your lack of commitment to your friend, she wanted you to be involved and you took part of none of it. Sounds like all you did was show up. Did you even buy her a gift?\n\nNTA for your question, the bride said ok. But not buying a dress to fit the code is just another example of your lack of effort.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTA for privacy\n\nI (23F) and my husband (24M) were invited to one of my close friend's wedding. This friend and I were besties since high school and I'm incredibly grateful for her friendship. It was a destination wedding that took place in Italy. My friend had initially asked me to be a bridesmaid but I had to turn it down because most of the wedding planning and other important events were going to be in Italy and because I'm a resident doctor, I wouldn't be able to make the commitment. My friend added me to a group chat of her and her bridesmaids though so I could see the updates and join in for any event that I was free for. I still didn't think it would be nice for me to just go without having put in any of what should've been my share of responsibilities so I never went for any of the events.\n\nWhen my friend sent the invites she mentioned a dress code for us guests. It was \"Full black, anything but dresses for women and full black business casual for men\"\n\nThe only wedding appropriate outfit I had was straight leg full length satin pants and a leather corset top. I asked my friend (along with a picture of the fit) if it was ok to wear that and if she felt uncomfortable with it, I'd get something else immediately. My friend said \"It looks gorg and quite frankly m/n I couldn't care less if you turned up butt naked as long as you came to the wedding. Please don't fret about the outfit too much. I miss you and just really wish for you to be there.\" I got the bride's approval so that is what I wore to the wedding. My husband wore a turtleneck, blazer and jeans (all black). The wedding went beautifully, and my friend and I reconnected after a long time and all I felt was happiness for her and how much I was going to miss her. \n\nThen out of the blue, one cousin of the bride (26?M) came to me and said that my outfit was inappropriate and that I was ruining the wedding. One of the bridesmaids came and in a very huffy tone agreed with him. I explained to them that I had gotten the bride's approval so I didn't see the problem and that there were other women dressed in dresses which broke the dress code so I didn't see why they were only coming for me. They replied with a \"yeah but the bride is spending more time with you than them so you're really ruining it with your attention whore outfit. All the wedding photos are going to look so out of place because of you\". My husband tried defending me but they were adamant on blaming me so I just borrowed my husband's blazer and wore it for the rest of the evening. It didn't feel right to ask the bride about this so I just left it but I need to know if I'm TA.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, if the bride said it was okay then who are they to say different. Let the bride know that her cousins and bridesmaid tried to start trouble at her wedding. Sounds like they were just trying to pick a fight for no reason.", "NTA. If the bride approved and she didn't say anything, that's a very heavy story they made up in their minds to mess with you.\n\nTbh, I would talk to the bride about this.", "Agreed, NTA.\n\nSounds like the bridesmaids are jealous of your friendship with the bride.", "That is the same top she bought me for the first event we went to together..", "I've been to weddings where guests have worn smart corsets.", "Username checks out.", "How did OP break the dress code?", "[deleted]", "Neither..we were going for a seminar that her husband (who's also a medical professional) was organizing.", "I'm just so confused on women not being allowed to wear dresses to a wedding. Wtf is that dress code.", "NTA - you had the Bride's seal of approval.   Someone is always going to be offended, so just live your life and have fun.", "NTA. The bride gave green lights ahead of the event. Just ignore those folks. They were probably jealous.", "NTA\n\nSometimes people just need to get into other people’s business and give unnecessary advices and feedbacks. If the Bride have no problem and approved your attire then other people shouldn’t have any issues.", "Wedding police strike again.", "NTA ngl I would've thought about only responding \"complain to the bride then\" but that would've been an ah move on her special day", "nta - they were just jealous that they wouldnt have pulled it off like u did.  bitterness comes in all forms", "OP NTA. Your friend, the bride, gave the okay for the outfit. Those complaining are just jealous of your friendship with the bride.", "NTA - the dress code was black but they were mad because you made them green with envy 👌", "NTA and it sounds like they were pissed because you and your friend, the BRIDE, were spending time together away from them. \nJeeze,  jealous much?", "This.", "NTA they sound jealous of both how good you looked & that the bride 1. Didn’t care 2. Likes you the most & 3. Wants to spend more time w u than them (probably bc they’re rude vibe killers)", "Having been thru residency I'm impressed you could make the wedding in Italy. The outfit sounds amazing\n\nNTA", "NTA.   Hell No!    I think that they were just trying to start something.  Your outfit was approved by the bride, but that wasn’t the problem.  They had a problem with the amount of time your friend was spending with you, which was her choice.  You didn’t ruin the wedding, it’s a ridiculous claim and you shouldn’t lend any weight to it.  NTA", "NTA... bride ok-ed  the outfit. Not much more you can do...", "NTA, Bride approved, and am I the only one reading 26?M cousin as being creepy as hell??", "NTA! You and your husband have better decorum than I think I’d have if someone verbally attacked my wife like that. Props for maintaining composure! Sorry that happened, please check in with the bride though to make sure you guys are all good!", "NTA. \n\nThey are insecure.", "NTA", "If the bride and groom approve it everyone else can drop dead (metaphorically)", "NTA. The bride approved and that’s all that mattered.", "NTA - if anything a guest wears RUINS someone’s wedding then the wedding wasn’t much to begin with.", "NTA. It’s not their day, their opinion doesn’t matter. In fact, they are being disrespectful to her wishes and causing drama where there doesn’t need to be, which I think is selfish.\n\nWe had a casual outdoor wedding and we called the dress code “farm formal”. One of my husband’s cousin showed up with a button down shirt with overalls (nice ones) on top. I thought it was funny and didn’t care at all. But other people did, and I found the discussion to be more annoying than the outfit. I couldn’t care less what people wore, guest’s outfits were the last thing I cared about. Sounds like your friend is the same.!", "NTA not al all.  Your friend approved it.", "YTA for this fake-ass story. \n\n>I (23F) and my husband (24M) \n\neyeroll\n\n>I'm a resident doctor\n\nYou are not a resident at 23", "The others are TA. They shouldn’t have created drama at a wedding. Agreed that you’re extra good for not bringing it up to the bride during her special day and taking care of it in your own way. While you didn’t have to wear your bf blazer, it was your way of not causing additional drama and kudos to you for that.", "Doesn’t sound like the bride cared! She hung out with her friend, it was the cousin that was pissy about the outfit.", "Well, their original objection was that she was getting more attention from the bride.  So, yes, I would say they were jealous.", "So glad you asked, I’m feeling a little dense. Is some punctuation missing?", "Did you ever read the damned post ?", "Uh.  The invite said no dresses so your response confuses me.  Also, did the OP say she didn't buy a gift?  The rest of your comment is just, eh.", "Or just jealous in general."]}