{"id": 15531, "submission_id": "12wpk0w", "title": "AITA for going skinny dipping in my own backyard?", "selftext": "Pretty much what the title said lol. \nMe and hubby got wine drunk last night and decided to go skinny dipping at around 10 in the evening. Our pool is obscured by our trees so it does offer some shade and privacy from the neighbors. Our neighbor came over this morning and told me that her son[11m] saw us skinny dipping last night. It wasn’t a huge argument or anything, we just had a debate about privacy and whatnot.\n\nBasically it boiled down to her saying that we shouldn’t do it when there’s children around. I said, we should be able to do whatever we want in our home, especially at night when our pool is covered by trees.\n\nSo reddit, AITA?", "created_utc": 1682282777, "permalink": "/r/AmItheAsshole/comments/12wpk0w/aita_for_going_skinny_dipping_in_my_own_backyard/", "score": 162, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the AH because I could take her concerns about skinny dipping more seriously.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: What exactly does \"some\" privacy mean? Is this a \"if you look really hard through a certain window between some leaves\" privacy or is your yard observable to someone walking outside to let their dog out?", "INFO:  \nWhen you say obscured, do you mean partially concealed or blocked completely?\n\nDo you understand how he was able to see you? If you go out into your garden, from the pool or stood at the side of the pool, can you see your neighbour's son's bedroom window? If not, how close would the kid have had to be to see what you and your husband were up to? \n\nWas your pool area fully light, or did you have dim lighting?  (If you had the pool floodlit, it and you might have been more visible than you realise.)\n\nNow you know it is not as screened as you thought, would you consider changing your behaviour in future or adding additional screening?", "NTA. \n\nMaybe she should be having words with her kid about watching naked people out of the window.", "Not really an asshole, but when we do that we enter the pool clothed  and don't come out before a towel is wrapped around us.  Don't want to give the neighbors a heart attack, they are very old.  Edit: As far as being in your own back yard, in some states if you stand naked in front of a window, it's considered public and indecent even if you are in your own house.", "What exactly does she want you to do? I’m assuming her son lives there.... so there’s always going to be a kid around. Tell her to invest in shades.\n\nNTA\n\neta — sounds like you’re a nicer neighbor than I am... I would’ve laughed & told her if her son spends his nights peeping at neighbors she’s the one with the problem. We live in the middle of the woods in nowhereville for just this reason...", "Aside from the whole AITA inquiry, you're likely in the wrong (technically). It all depends on the laws where you live. Many US states, for example, do not allow genitalia to be exposed when others can see you. So, if your neighbors can see into your backyard, then full nudity would be illegal even though you're on your own property. But, I'd want to skinny-dip too.\n\nFrom a web site I looked up:\n\"Some states make a distinction based on whether other people can see you. This is where concerns related to indecent exposure arise. For example, if you sunbathe in your backyard, you may face trouble with the law. Being nude where others can see you may be illegal based on your state and local laws, even if you are on your own private property.\"", "NTA. The description is redundant really..you can do anything in your own backyard..if someone looks, peaks or snoops around that's on them. Kudos for the skinny dipping, it's fun!", "NTA - it sounds like their kid was violating your privacy", "YTA, and depending on where you live and the applicable laws, you’re lucky the cops weren’t called.", "NTA your property for one. Secondly, it's screened by trees. If someone has to actively try to see in, that's them invading your privacy, regardless of their age. Besides, swimming nude always feels better IMO", "NTA you can do whatever you want in your own yard.", "NTA.  I’d have to see your backyard to offer an opinion on whether it’s secluded enough to hang out naked back there, but it’s not like you two were doing anything outrageous.", "NTA - If it’s legal where you live then theres no problem", "NTA - Your neighbor needs to grow the f*ck up.", "NTA It's your home and you have cover. If it were something that happened more often you should probably get a fence though", "NTA. If you're ok at the possibility of a child watching, fine. If not put some additional privacy items up. If they want their son to stop then they can. Unlikely to get a preteen boy to stop watching a naked (or even semi naked) woman in the yard next to him though.", "You said the trees offered \" some\" privacy. That means you could be seen. YTA", "NTA. This should have been past the kid's bedtime. And where was he that he was able to spy on you? Peeking through the bushes maybe?", "Oh dear, I don't think there are enough pearls in the world to clutch over this!!! Lol! \n\nNTA, how are you supposed to know her son is anywhere near, or watching you, or playing peeping tom? Was he straddled on the fence, or on a ladder propped against the gate? I'd like to think that 10 is late enough in the suburbs to (conceivably) skinny dip without being exhibitionistic about it.   Are you certain it was her son and not her husband she caught ogling y'all??? \n\nAnd oh dear, a child saw \"NEKKID PEEPLE\"!!!! 😵😵😵😵\n\nIf we would stop forcing these poisonous puritanical mindsets on our children, we'd ALL be a much healthier and less repressed society.  Nudity is perfectly normal. The people who live in the happiest countries in the world are those who take a pragmatic view of nudity, breastfeeding and normal bodily functions as PART OF LIVING. Because that's all it is, it's life. Babies are not born pre-swaddled and sporting a onesie! Ffs some people.", "NTA. It wasn’t even light out. It’s past that kids bedtime.", "“you don’t like? Don’t look.”", "It's your yard, they shouldn't be looking in. Nta", "Nah wtf are these comments.\n\nYTA - it’s obvious that your pool doesn’t have enough cover if an 11 year old saw you skinny dipping. Either get more cover or be more considerate of your neighbors.", "NTA. Wtf was the kid doing up at 10 staring into the neighbor’s backyard anyway?\n\nBtw your husband is a lucky guy because if my neighbors told my wife they saw her skinny dipping it wouldn’t happen again for a long, long time.", "YTA", "Just seconding the fact that from a legal perspective, you should check your local laws. From a moral perspective, I would say you can do what you want on your property at 10pm in the dark. NTA", "ESH\n\nThe mother should mind her own business, and understand that, unless modern laws of your location are violated, your business is your own.\n\nYou, however, should set the example for such a public display. Drunken swimming may be of a far greater danger than a sober version. If you both had drowned, your fault would have correlated. Whatsoever therefore is consequent to a time of immense immaturity by adults. Your life is yours, but do not expect modern society to have a commodious welcoming party.", "Her kid is creepy", "NTA", "NTA. She needs to tell baby Peeping Tom that if you have to peer through trees late at night to see something, you should stop doing that.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nPretty much what the title said lol. \nMe and hubby got wine drunk last night and decided to go skinny dipping at around 10 in the evening. Our pool is obscured by our trees so it does offer some shade and privacy from the neighbors. Our neighbor came over this morning and told me that her son[11m] saw us skinny dipping last night. It wasn’t a huge argument or anything, we just had a debate about privacy and whatnot.\n\nBasically it boiled down to her saying that we shouldn’t do it when there’s children around. I said, we should be able to do whatever we want in our home, especially at night when our pool is covered by trees.\n\nSo reddit, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Especially based on the photo you shared of a comparison of your yard.", "If I saw my neighbour skinny dipping I’d ask how the water was and sit back down. NTA", "NTA. Tell your neighbor to watch her kid and keep him from being a peeping tom. You're absolutely right your  house you can do what you want.", "NTA, it's your yard. But maybe dim the lights next time unless you want to end up on tiktok or wherever kids post things nowadays.", "NTA.\n\nTell her to tell her kid to not be a Peeping Tom.", "NTA. \"...when there’s children around.\" There were no children around. You were on private property. Neighbor needs to teach her kid not to be a creepy voyeur.", "NTA.  We use to swim naked in our pool all the time. No one ever said anything.", "This is my question as well. What’s some privacy? Can OP see their neighbors homes still from the pool/see into their windows from the pool? Or is it as you said, a look really hard situation. Because if he just casually looked out his window and saw it then I’m included to rule against OP.", "Where do you get the \"some\" privacy from?  I've read and re-read the post looking for that and the only thing I can find is this:\n\n>Our pool is obscured by our trees so it does offer some shade and privacy from the neighbors.\n\nI think you are assigning \"some\" to privacy as well and ignoring the first bit about the trees obscuring the view.  So, the trees offer privacy and *some* shade not some shade and some privacy.  Look at the trees in your yard, they don't fully shade the yard they only shade *some* part of it, but you can have trees that completely block the neighbor's view but don't shade the entire yard.\n\nAlso here is the link to OP's reply answering your question.  Turns out the kid had to go to a specific window on the second floor:\n\n[https://www.reddit.com/r/AmItheAsshole/comments/12wpk0w/aita\\_for\\_going\\_skinny\\_dipping\\_in\\_my\\_own\\_backyard/jhg0m51/?context=3](https://www.reddit.com/r/AmItheAsshole/comments/12wpk0w/aita_for_going_skinny_dipping_in_my_own_backyard/jhg0m51/?context=3) \n\ntagging u/Budge1025", "This should give you an idea of what my backyard looks like, only the trees are taller and further spaced out: https://cdn.decorpad.com/photos/2015/08/22/pool-trees-built-in-seating-firepit.jpg\n\nOur backyard is completely unviewable from the street. From what I understand, her son was able to view us from one of their upstairs rooms. I've been to their house a couple of times and I can't see into my backyard from their windows, but that is only the ground floor.\n\nAs for lighting well.... We had our deck lit up with Phillips Hue lights, which can be bright. And our pool lights are multi-colored.", "Who said he was looking out a window?", "Yup. When I was a kid, I discovered my neighbor liked to skinny dip so I just stopped climbing the trees on that side of the yard. \n\nWhat you do in your backyard is your own business NTA", "Exactly this.  I guess they are ok with an 11 year old possibly wanking off to him or his wife.  I'd be horrified.   Edit: we turn off the lights at least when we skinny dip and get in the pool clothed then don't come out without a towel wrapped around us first.  Also an Austinite!", "It’s their backyard. Little 11 year old should be taught to mind their business.", "Their neighbour's shouldn't be peeking in their yard.", "It’s a very different conversation for a neighbor to say ... hey FYI just so you know our son is can see you at night in your pool. Opposed to change your behavior for our son who is choosing to watch you. \n\nTalk to your son & tell him to stop gawking at the neighbors. That’s rude.", "Did you just open a dictionary to write this comment? Haha", "Her lack of clarification and vague description makes me lean towards her yard being a lot more in public view than she wants to say. Maybe OP has vouyer kink.", "Depending on local law OP could be in trouble for indecent exposure. I saw the picture she provided...she doesn't have a fence and said her trees are  apart than what's shown in the picture. AKA..nothing like the photo lol.  No reasonable person would consider that a private yard\n\nEdit: OP also states her backyard  and pool are well lit, making it very visible at night", "Lmao this isn’t that deep but thanks for the tag, I guess. If all is as OP says I’d say YTA as final judgment. It might be his bedroom window that looks into the pool. According to the comment, OP has never been up there and wouldn’t know if it looks out. Can’t really fault the kid for looking out a window and seeing nudity.", "Surely a simple solution would be to turn off the deck and pool lights when skinny dipping then? Would also allow you to see the stars", "You didn't even turn the lights off?   That cracks me up.  Way braver than we are.", "Is there also a fence in your backyard? Because if not it seems like based on the pic and description you provided here there doesn’t seem to be much privacy at all, especially if your trees are taller and further spaced out. And if your deck and pool were lit up it was sort of like a spotlight on you.", "OP did.\n\n[https://www.reddit.com/r/AmItheAsshole/comments/12wpk0w/aita\\_for\\_going\\_skinny\\_dipping\\_in\\_my\\_own\\_backyard/jhg0m51/?context=3](https://www.reddit.com/r/AmItheAsshole/comments/12wpk0w/aita_for_going_skinny_dipping_in_my_own_backyard/jhg0m51/?context=3)", "Its not exactly peeking if he accidentally caught a glimpse.", "You said that it’s rude to tell people to change their behavior…\nBut then immediately want the child to change their behavior?\n\nI agree btw, children shouldn’t be snooping in their neighbor’s backyard; its rude and disrespectful.\n\nBut you also shouldn’t be drunk skinny-dipping where children can easily see you, to me it’s just as rude and ignorant.", "I'm unsure of the humor in my comment that warranted your digital laughter. None of what I wrote has yet to be complex, though its density differs from what you would normally see on Reddit. \"Commodious\" is a beautiful word I discovered upon reading Thomas Hobbes' \"The Leviathan.\" I have fallen in love with the beauty of complex English, though I still have many years left for practice, to incorporate the styles of Hobbes, Lovecraft, Poe, Shakespeare, Tolkien, Blackwood, among others. There was no malignance attempted by me, but just an attempt to spread the love of stimulating English amongst the modern population. You asked for the public's opinion, which I have provided. An analysis of it would be appreciated.", "I think technically it would be an exhibitionist kink", "Depending on local law, the kid could get in legal trouble for \"invasion of privacy\" by doing that.  It's okay to do a quick glance and look away but not stare.  Mom should put up curtains or close the blinds at night to keep the kid from looking out.  One must question what a child was doing awake that late at night.  When I was that age, my bedtime was 9pm even on the weekends.  OP says they didn't go skinny dipping until 10pm.  Hell, my 11-year-old nephew is asleep at 10pm even on the weekends.", "It’s not rude to skinny dip in your own pool.... on your private property that you pay for. They didn’t have a naked party free-for-all.\n\nNgl... we live on a mountain in the middle of the woods with a pool & hot tub that we often go in without any clothing but we have exactly zero neighbors so I may not be the best judge on this one.", "Having a vocabulary doesn’t mean you are not a pompous ass.", "You didn’t even use the word “commodious”correctly.  It means spacious, roomy, or (archaically) convenient.\n\nMaybe you **should** have opened a dictionary to write your comment.", "Hey, if you like flashing your bits to the neighborhood children, that's between you and law enforcement.", "Lmao you sound real fun. Depending on local law, OP could also get in trouble for public nudity, as many others have pointed out. The kid was on his own property, so the invasion of privacy argument is a bit of a stretch. He can’t help what he sees, and your argument is predicated on a peeping Tom argument which would be tough to prove if you actually CAN see into their pool from their upstairs windows. If you can’t, then sure, the kid is in the wrong. But we don’t have that of information.\n\nLike I said, this isn’t that deep, I would just not skinny dip at home in the future. Book a cabin in the woods for a weekend where no one is around. The suburbs just aren’t built for this. Not like it’s a huge loss.", "I’d say it’s rude if people can easily see into their yard from their house, it shows a lack of respect for people around them.\n\nAnd the way they phrased it i’d say it’s not that rural, it seems like the neighbors can easily walk up to their house.", "I read that whole thing in the voice of Isaac from The Orville.", "You may be my new best friend.", "Haha, it’s such an underrated show! My husband and I have watched the entire series multiple times, really hope they get a new season together.", "I miss sci-fi for people with a sense of humor.", "As much as I empathize with the want to skinny dip in your own pool, you are lucky your neighbors didn’t call police. You can be charged. The trees are clearly not enough coverage.", "NTA... a previous GF & I did it all the time only 4' fences around the back yard.", "If this was midday, I think I may have some sympathy with your neighbor, but your yard, at night, this is totally within your rights NTA. Additionally if you were just skinny dipping as opposed to being sexual, I’m even more on your side as there is nothing sexual or shameful about the human body in its nude state.", "Nta. Warn her that her peeping Tom will be prosecuted if he persists. Lol", "NTA, you can do whatever you want in your own home within reason, and so long as you don't mind being seen naked, there is no problem.", "Nah fuck that. You're on your property. and my opinion? Nudity isn't the problem people say it is.", "NTA But a privacy would solve the problem.", "NTA.\n\nWhat you do in your backyard is your business. Your neighbor should teach her kid about privacy and how not to get caught if he's going to be a peeping tom.", "Why is an 11 yr old up at 10pm, and why are the curtains/blinds not closed. NTA.", "\"look at my eyes!!!\"\n  \nDoes anyone get that reference? I think I might be older than I feel.", "No way, he was in his own home. If she was naked where he could see from his own window, that’s on her, not the 11-year-old child.", "She is on her own property so no she can’t get in trouble with the law and they can’t tell her to put clothes on especially since they was in their pool! Also the backyard is cover and the child was spying from an upstairs window into their yard!", "You might want to go read it again! The pool is completely covered by trees, and the child had to be in an upstairs window, looking down on them, spying to be able to see them", "Well he is trying- he’s only 11.", "NAH. I think it’s okay that you went skinny dipping but next time, out of respect for your neighbors, I’d cut the pool lights. \n\nI’m also really uncomfortable with everyone labeling an 11-year-old boy a “peeping Tom” or a “creeper”. He’s a child in his own home. If you, OP, decide to be nude in a backyard that is only semi-private, people might see you. They might be offended. That doesn’t mean they’re peeping or spying on you. \n\nThat being said, I don’t think nudity is that big of a deal. Just turn off the lights next time.", "That's not confirmed, OP is assuming and also gasp little Timmy is going to see things he doesn't like. It doesn't sound like the OP was doing anything other than being naked.", "You can be charged with indecent exposure, even when you’re on your own property.\n\nThe laws vary, but a lot of places have laws making it illegal to be naked and visible from off your property (so no standing naked in front of windows, no being naked in your yard, etc.)", "Looking out the window in your own home is not spying. Have you never glanced outside your window and seen something you weren't expecting to see? That's what happened here.", "In his own bedroom, though? He wasn’t peeping through HER window.", "No. She clarified it in her comments. Her backyard is not seen on street level. The kid was looking for a second story window.", "No fence? She can't live in the US then right? Everywhere I've lived had rules about fences around pools.", "Yeah I just talked about this with my husband, if you’re naked inside your house and someone looks in they could be in “trouble” (aka peeping Tom laws). If you’re in your yard naked and someone looks in then you the nude person are in “trouble”.", "Except you are wrong, she does have a fence.", "Looks like walls around the yard to me.", "Well to be fair we were drunk, so we probably didn't make the smartest decisions lol.\n\nThere is a fence behind the trees, its 6 feet tall, but now I think we may need an 8 foot tall fence.", "If you go and look at the laws, indecent exposure can only be charged if they knew that the someone was able to see them. And according to the OP, the child had to go to a second story window, and watch. This means that the child had to go specifically into a room, open the blinds and/or curtains, and stay in there and watch these individuals in their pool long enough to figure out they were naked.", "It would be different if the child glanced and was like oh somebody is playing in the pool and turned away but instead, he stood there long enough to notice that these individuals in a pool was naked. I don’t know about you, but from a quick glance I’ve never been able to tell if anybody had a swimsuit on in the water unless they were laying on top of a float! Also, to your statement about not spying, I don’t know any family that doesn’t have their blinds and or curtains, drawn late at night especially a 11 year old.", "How often do you find yourself looking into your neighbors backyard from your window at 10pm? If the answer is larger than 0, you need to mind your business.", "Great point, I think I'll start watching porn on my backyard projector screen. You can't see that from the front of the house so I should be good to go!", "I think that depends on state and county legislation, not federal. But I am not up to date on all fence laws lol.", "Yeah, I don’t think an 11-year-old is going to get in legal trouble for looking out his own window. If he had been peeping in HER window, that’s different. He’s just living life and- wham- naked neighbors. Depending on the neighbors that could be a real nightmare.", "This is why I said the laws vary.\n\nIn some places, they have to know someone is watching.\n\nIn others, it’s enough that they are exposing their genitals / button to the public, whether they are aware that people are currently around to see it or not.", "It doesn't take long to notice if someone has on a swimsuit, especially as OP said the pool was \"lit up\". The boy did nothing wrong. He wouldn't have told his mother what he saw if he was a little voyeur. He'd have kept quiet hoping it happened again.\n\nWe keep our blinds and curtains shut at night. That doesn't stop us from glancing out sometimes. Sometimes we just like a quick look at the moon, etc.", "Words can be used in a figurative meaning. Think of any modern slang.", "Porn is not the same as naked bodies. Were OP and her husband fucking in the pool, or just swimming?", "Okay fair enough lol.", "Don't ask me, ask OP.\n\nFear not, I'll only watch soft core,  just naked bodies touching eachother like OP and her husband. That should be okay", "I can not imagine being this terrified of nudity", "Your definition of swimming is very different than mine, it seems!", "I am positively quivering. My husband and I only mime sex while wearing matching track suits due to my terror 😔", "No I'm sure you're right. A drunk husband and wife naked in the pool at 10pm....like obviously they're just playing mermaids and doing handstand contests"]}