{"id": 15588, "submission_id": "12xn6f7", "title": "AITA for not giving my wife money to invest in her \"business\"", "selftext": "My (31M) wife (27F) is a stay at home mom of our 2 year old. Meanwhile I'm the sole breadwinner of the family. My wife has a friend, also a stay at home mum, who recently got into selling some dietary supplements and is trying to convince my wife to do the same. She claims she makes good money on it. Now my wife is asking me for a $500 initial investment. This whole thing seems like an obvious MLM to me so I said no and that it's a waste of money. Now my wife is mad that I'm trying to stop her from having her own source of income, which is not true, I wouldn't mind her having a part time job, just this particular idea seems sketchy to me. I really don't want to be a controlling husband, I just think this is going to be a waste of our money and her energy. Am I in the wrong here?\n\nUpdate: My wife has done some reading on the company and agreed that this wasn't a good idea. She told me the conversation with her friend made her realize she wants to come back to work. She felt hurt after coming to me excited about it, just for me to say it was bullshit. I understand, I should have communicated it better. I was too harsh. This is what made me TA, not that I was against investing in the MLM. We'll be thinking of other options for my wife to work from home. Anyway, thank you for all the replies!", "created_utc": 1682351790, "permalink": "/r/AmItheAsshole/comments/12xn6f7/aita_for_not_giving_my_wife_money_to_invest_in/", "score": 1223, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) objecting to my wife taking money out of our account to invest is an MLM \n(2) maybe I'm being too controlling as this is her money too and she has the right to do what she wants with it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. MLM are a scam. Of course, her friend is going to tell her she is doing great money : the only way she COULD make money is if she recruits other gullible people. \n\nDon't let your partner loose money on those scams. Google the name of the company and show her all the testimonies of people that were duped and maybe she'll understand.", "NTA!! MLMs only make the people your wife would be buying her crap from money. You did good. If she wants a job, there are plenty out there that don’t ask you to pay to work.", "\"Hey Bossbabe! ♥️ Come join me and make lots of cash! 💰🤑💲💵\"\n\nI imagine that's exactly how the 'friend' asked. \nNTA", "NTA. This is definitely a bad idea, and a very poor investment. MLMs are scams at best and cults at worst. \n\nHowever, just saying \"no\" is going to anger and maybe even hurt your wife. If she's interested in making her own money, maybe to talk to her about other opportunities, like a part-time job. If she's dead set on this, I would recommend that you ask her to promise you that this $500 will be the only investment you'll have to make. Explain that new business ventures are risky, and that you can't jeopardize your families finances for this.", "NTA, and I’d suggest you have your wife do research into MLMs so she can see for herself what a scam these things are.", "No how about she doesn’t waste $500 (and infinitely more) on a MLM scheme. She needs to find a source of income that does not require selling useless crap to family and friends. \n\nNTA.", "NTA. A business should be paying your wife; not the other way around.\n\nWell, if your wife were starting her own business providing goods or services, there would be some startup costs, but nothing like this.", "MLM is not a source of income\n\nNTA", "NTA. This clearly sounds like a MLM. Has she read up about MLM? Or the products she is supposed to peddle??", "NTA. \n\nSit down with her and do some research into the company. As others have said, have her look in to reviews and feedback.", "NTA! Have your wife watch LuLaRich to better understand how these \"businesses\" work!", "Please check her emails to be sure she’s not communicating with her new friend the Prince of Nigeria.\n\nNTA. There’s things she can do PT that aren’t obvious scams.", "NTA \n\nMLMs should be avoided at all costs", "NTA your not investing in her \"business\" your lining some persons pockets for no return. I would assume if she had a legit business idea you'd actually give her an ear.", "NTA - No, youre not an AH for stopping her from investing in a MLM", "NTA\n\nMLMs are pure scams. My MIL and FIL did that for a while. Dietary supplements. \n\nit was \"herbal life\"", "NTA. It does not sound like you are trying to control your wife financially, because you are more than plus with her finding a part time job. Oftentimes MLM’s suck in SAHM’s with the lure of being able to make their own hours and work only a couple of hours a week. While she will have to work more than two hours a week (that claim isn’t really true), she can do it with the kids around. So if you want to be supportive  of her having her own source of income, which will likely require her to work outside of the home, you will need to be flexible and make some consessions. You all have to expect she might need to work some evenings and weekends and accept less time with her and more time with the kids and accepts that maybe the house isn’t as clean or whatnot. I’m not saying, you WONT do these things, just that maybe your wife is thinking this way she can contribute without things have to change much for you and kids and she my feel bad if it does. So if you assure her you support her in a part time job outside the house, she might not be so attracted to MLM’s. And seriously there are so many MLM’s now it’s ridiculous. And the only way you can make any real money is if you get people underneath you to sell and then you get a percentage of what they sell. I did MLM for a bit and the most I ever made after expenses was 400 for the a month. That was ONE time in a year otherwise, I maybe pulled in a couple hundred and it was more time than it was worth as I also had another full time job.", "NTA but she should have access to money that you don’t oversee.  You should budget for necessities and then each have some personal spending or fun money (if possible). She should be able to save up to do this if she chooses.  It may be a dumb choice but if it comes out of her personal fun money let her make her own mistakes", "NTA, its a scam from the beginning and she can do a part time job to raise the initial capital like everyone else and see if she still wants to invest. Suddenly she would feel a lot different. Most of these MLM scams only involve the founders from getting rich on those who is not smart enough to join.", "A legitimate business can provide P&L statements signed by a CPA. Her friend won't. Because she is not being honest.", "NTA. You’re right-it’s an MLM and she should run for the hills.", "Read MLM, hard pass! NTA", "NTA - MLMs are so predatory. \n\nThey are required to post income disclosure statements on their websites. I would pull the table and show it to your wife. If it’s so lucrative, her friend should be willing to show her stubs as well. \n\nStick to your guns on this.", "NTA\n\nScam scam scam", "NTA\n\nAnd I say this as a SAHM who did the Juice Plus supplements, Younique make up and PartyLite candles. \n\nIt takes over your life and you end up fabricating this false hyped-up version of yourself to convince your friends and family to part with their money.", "NTA. That's not in any way an investment. You are really just not allowing her to pay $500 to pay more money later.", "Ask her to Google some of these schemes and see how many people lose money. \n\nNTA", "Ask to see her friends books or taxes.  \n\n\nI do taxes for a living, and have been doing so for about 15 years now.  I have never, ever seen any of these direct-sell, MLM bullshit \"businesses\" turn anything resembling a worthwhile profit.  It's not a \"source of income\", it's an expensive hobby.", "It's  a pyramid  scheme.  Don't  help.", "NTA- it 100% sounds like an MLM and those companies are not to be trusted. If it was a startup cost to start her own, independent business based on a skill or hobby she had that would be one thing- but these sorts of selling and marketing schemes are costly to get into, difficult to make a profit off of, and can very easily land someone in a rabbit hole of constant fees, purchases, and debt. I strongly recommend doing some online research into the company your wife's friend is invested in, chances are if they are an MLM they'll have countless reviews and websites calling them out as a scam. Find those and show them to your wife. Explain why you're uncomfortable with this and maybe suggest your idea of a part-time job, or starting up her own thing.", "NTA mlms are scams. Ask her friend to see the  checks for this “good money” she is making. Her friend is trying to recruit her because that’s one of the ways they make money, the “friend” will get a cut of the $500 initial investment.", "NTA ask the friend to provide info on earnings as well as time spent on the business. Encourage her to find another way to earn money ETSY is a great place for SAHM to be creative and make money. Pyramid schemes are never the way to go", "Of course you're NTA\n\nI would suggest that you send her some articles and stats on the reality of MLMs outside of the propaganda her \"friend\" (who has an obvious bias since she's literally trying to recruit your wife to her downline and make money off her) is sharing with her.\n\nI'd start with the FTC's study that showed that **99% of recruited sellers lose money in MLMs**. That's not just \"most\" . . . it's literally all but the top 1%, which means that it's likely a whopping lie that her friend is turning a profit either. \n\nI would also show her some of the articles and documentaries about all of the MLMs that have been sued, lost, literally been proven to be scamming to people, gotten warning after warning from the government, and yet continue to do business and prey on the unsuspecting.\n\nOn top of which, many of the \"health\"-related MLMs (and I use the word \"health\" reluctantly), from the essential oil companies to the ones selling \"nutritional supplements\" like your wife is looking at, have the additional foulness of often making questionable claims and sometimes being downright unsafe (either overall or based on the claims and suggestions that they make, which are neither scientific nor medically accurate). It would be bad enough if your wife were looking to sell cheap leggings, but messing with people's health and selling \"nutritional\" products with questionable claims isn't just poor business, it's potentially harmful to customers as well. \n\nYou are for sure NTA. Tell her that you would support her starting a LEGITIMATE small business, or getting a part-time job, but that you cannot in good conscience support her preying on people, or participating in a de facto pyramid scheme.", "NTA\n\nObviously MLMs are a bad idea, but you should approach this gently.\n\nSaying \"that sounds like a waste of money\" can come across as dismissive, even if it's true. It would help if you explained why it's a waste of money, by giving examples of what other MLMs are like.\n\nMLMs are usually targeted towards women who stay at home, they use fabricated or cherry-picked statistics to manipulate people into \"partnering with them\" (read; working without being paid) and the only actual way to make money in them is by convincing a whole bunch of other people to make the same mistake you did.", "NTA Yes, it's an MLM, and, yes, it's a scam.", "NTA. Selling supplements will not make her a boss babe and business owner. MLMs do not empower anyone but the first few.", "NTA just show her the Herbalife documentary on Netflix", "NTA. These sales businesses pretty much are all MLMs. It’s a ponzi and should stay away. \n\nBut maybe this is a sign that your wife wants to do something for herself. Maybe turn it around to talk about passions and interests she has that she could turn into a business. \n\nMaking things to sell on sites like Etsy, or buying/selling collectibles from car boot sales or flea markets, or taking a course to then do therapy or coaching online. \n\nThere are lots of things out there that might suit your family and give her something “for her”.", "NTA however you probably will need to research anti-MLM tactics. Her friend knows exactly what to say to make you seem like you're being controlling, tactics which her friend gets from the scheme to help her recruit people.", "NTA. there's loads of research out there on MLMs. Might wanna sit her down and go over the hard facts, mainly the fact that the majority of people who join an MLM actually lose money.", "People out there still acting brand new and falling for MLMs despite so much information out there on them.\n\nNTA", "Have her get a part time job. Make sure the job paychecks pays the household back for things like gasoline, uniforms, etc. Other than that, let her save the money. When she has saved $500, see if she wants to invest HER $500 into the MLM.", "NTA. Do not let her join a cult. Show her the lularich documentary on Netflix, or the income statesments some MLM's publish.", "The sub reddit antiMLM can help you talk to her", "Your wife sounds like she wants to build tombs for Pharaohs. NTA  Foot pics are easier to sell and more profitable. JS", "NTA\n\nThis is a tough one.  Ultimately, this is MLM of course.  \n\nINFO: How do you split the money up and how much is $500 to your family \"in the grand scheme of things\".  If giving my wife $500 stopped a fight, I would let her blow it and learn a hard lesson.  If you only clear $500/week - I'm not sure I give a week of income for a bad decision.\n\nIf you two have your own \"allowances\", then its her decision to make with her side of the money.  But, if it requires a mutual sacrifice, it needs to be a mutual decision.  \n\nIn short: if you decided to go to the casino to spend $500, would you feel entitled to do it without \"permission\"?  If so, consider this her casino money.  Just because you're the \"breadwinner\" shouldn't entitle you to all financial decisions.", "Well, I think you are kinda being a controlling husband tbh. With good intentions obviously, but still. MLMs are VERY attractive to SAHMs because of that promise of quick easy money that is flexible hours of work and can fit around a child's schedule. That's the hook! \n\nCan you possibly persuade your wife to do more research? Can you ask her to watch some of the documentaries about MLMs (I've seen a few on Netflix)? Ask her - once she's tapped out friends and family, who, where and how does she plan to get new clients? \n\nNTA OP, just hope you can frame your refusal in a way that doesn't upset your wife too much.", "NAH. You're Not ta for not wanting to invest in a pyramid scheme, of course. But she's not ta for wanting to have access to money.\n\nBut I'm concerned about the framing of the question and its implications for the way you share finances with your spouse, particularly the \"controlling husband\" bit. If you were going to spend $500 on a Bitcoin purchase, would you feel the need to tell your wife beforehand? If no, you are already a controlling husband.", "Yeah you're kind of TA.\n\nA marriage is a partnership, so you guys need to decide together. Ultimately who cares if it's a bad opportunity? It's a *life* opportunity, and she will enjoy it and learn something from it.\n\nIf it helps you get past the idea that it's a dumb business, think of it as a hobby. If your wife wanted to put $500 into a hobby would you be agreeable to it? I say be supportive and encouraging, let her give it a shot and see what happens and be her biggest fan in this and all things in life.", "Even if it is mlm why don't you let her find out herself? Or offer alternatives. I don't think it's right for you making decisions for your wife. If you can't afford to that's fine but that's something that needs to be communicated.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (31M) wife (27F) is stay at home mom of our 2 year old. Meanwhile I'm the sole breadwinner of the family. My wife has a friend, also a stay at home mum, who recently got into selling some dietary supplements and is trying to convince my wife to do the same. She claims she makes good mone on it. Now my wife is asking me for a $500 initial investment. This whole thing seems like an obvious MLM to me so I said no and that it's a waste of money. Now my wife is mad that I'm trying to stop her from having her own source of income, which is not true, I wouldn't mind her having a part time job, just this particular idea seems sketchy to me. I really don't want to be a controlling husband, I just think this is going to be a waste of our money and her energy. Am I in the wrong here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  And yeah, this sounds like an MLM centered around scam/fraudulent nutritional supplements.  Bad, bad idea.", "NTA. I was gonna say maybe give her the 500 so she can learn for herself however I’ve seen the horror of when people get into this and the lies, deceit and destruction so I wouldn’t risk it.", "NTA But \"no\" doesn't stop the MLM urge. Also why does your wife specifically have to ask for money, doesn't she have a certain amount set aside for herself that she could just save up?", "No. It’s all bs.", "NTA, but it sounds like you might need to put in some more work to this.  Do some internet research on this MLM.  Compile horror stories.  Show her, really, how MLM's work.  *Make sure not to make it about her friend, but about the company.*   Once she really gets it, if she's reasonable, she'll appreciate you helping her dodge a bullet.   If she really wants a part time job, there are a TON of opportunities out there to work from home.  This might also be some more emotional labor on your part, but maybe do a little research and find her a couple of opportunities to apply for after you break the news to her about the MLM.  That way, she won't feel like you're trying to restrict her - make it clear you're not trying to stop her from earning.  \"Of course I want you to be able to branch out a little on your own, just not with this.  What about this, this or this?\"", "NTA\n\nSomething similar almost happened to my dad, the only difference is they're asking him to sell soap after paying.\n\nIt was an uphill battle trying to make him understand that this is a huge scam", "NTA.  r/antiMLM", "NTA\n\nHave your wife look at r/antimlm to see why investing is such a bad idea.", "NTA.  Yeah, it's definitely an MLM.", "So very much NTA, don't stop.\n\nLook for some anti MLM education material, perhaps on anti MLM sub reddit. \n\nYou can be confident in your advice, focus on the premise, they all have variations to disguise the root. Make sure she knows you are advocating because you value her time and efforts and believe she can succeed in something good and true.\n\nFresh out of college I spent the better part of a day interviewing at and learning about one, the red flags will just keep coming, if she knows where to look she will see them.\n\nHer friend will be the trickiest part, because they rely on the credibility of the victims. She likely feels your pushback as an attack on her and her friends credibility.\n\nI don't think it's easy to treat a friend as a victim and predator at the same time but that's the reality.", "NTA, this is a scam.", "NTA mlm people suck and annoying everyone around then. Nothing is worse than being contacted by a \"friend\" who wants to tell me about their product. Nope. Your wife could do other things like sell stuff on easy (if she's crafty) or do a work from home call center job if she really wants her own income.", "NTA, and it may be an idea to show her r/antiMLM sometime.\n\nThey're pyramid schemes, the person asking for the money isn't making money from selling supplements and thinking \"I want to share this wealth\", they're making it from the 'investments' from the next rung down the chain, i.e. your wife.\n\nIf people don't fall for it and buy in, their income doesn't meet their costs of having to buy the supplements from their supplier.", "NTA NTA NTA\n\nNever encourage MLMs in any way.\n\nYou might as well burn your money, but that would at least be somewhat fun", "NTA, if she wants her own source of income so bad, she should get a job.", "NTA. There are many MLM documentaries on YouTube you could show her, some of which are probably focused on the MLM her friend is trying to recruit her to. I’d show her a few of those videos. If she really wants employment outside of being a SAHM she can get a real part time job.", "You would only be the asshole for letting your wife fall victim to a pyramid scheme. \n\nI would treat it like an actual investment conversation where she is coming to you to seek investment. Ask her to lay out her business plan, do some research on the company so she can explain it in detail to you, etc. \n\nHopefully by the time she does some research and checks some reviews she will see it's a scam. If not, still don't invest.\n\nNTA.", "NTA.  It's not just the money she will lose.  It will be all your friends and family as well.  You will be ostracized and unfriended.\n\nFor support, check out r/antiMLM", "NTA ask what she will be getting paid and when.\nSay you want to see a business plan with numbers before you 'invest'.", "Nta, sounds like an MLM.", "Reminds me of a comment I read where someone trying to recruit intuitive an MLM said they were \"half way to earning six figures.\" While the $100 they confessed to making (after much pushing for an actual number) is technically \"half way,\" it's not the common usage of the phrase.", "NTA. Not supporting her to join the money cult that MLMs are makes you a good partner.", "NTA. Maybe suggest selling Avon or something if she want to do something low pressure from home.", "NTA, but recognise she's looking for engagement and perhaps identity outside of being a SAHM. MLMs prey on people who have a need or lack of fulfilment as well as the promised income. \n\nDon't just be (justifiably) negative about this suggestion, try and work with her to find and support healthy opportunities. This can involve compromise around your work, and being the breadwinner/having your career is probably also part of your identity in addition to the financial aspect.", "There would be a lot more startup\nCosts on her own, but the thing is, it would be HER business. MLM’s like to make you think it’s your business, but it’s really not.", "There are only 2 kind of person in a MLM : the ones that are losing a shit ton of money, and the one that are profiting from the one losing a shit ton of money.", "Also the John Oliver bit on MLMs.", "yeah. i watched/binged how to get rich on netflix this weekend and this was discussed on the show, since on of the participants was involved in an MLM.", "Agreed, but if this is a MLM she’s going to be hitting up their friends, family, strangers up the street, EVERYONE. It’ll affect his life a lot more than just the $500.\n\nAnd it’s never just $500. That’s just the down payment.", "Agreed on this one. \nIf the money isn't the biggest problem, I'd give it. She'd get busy for a while and learn the hard way. Or who knows maybe she's really good at recruiting more people and make it work. 😅", "This is my favorite kind of AITA post. Not just giving the AH determination but also giving context and a reasonable opinion on the underlying causes \n\nHave an upvote!", "Exactly right.", "And 99.99% of MLM huns belong to the former group.", "I disagree. Don’t let her get into this at all. She’ll be contacting family and friends and it will get to the point where no one will want to interact with them.", "NTA, but realize that this is about your wife feeling like she doesn't have anything for herself, or maybe she feels like she isn't contributing to the household (she is, parenting is a fucking huge amount of work, but doesn't get viewed the same because no income) and wants to feel like she is.\n\nAdvise that you speak with her and see if you can't find something she can do, a part time job, or something she can do from home maybe, whatever, because right now, I'm guessing your wife doesn't feel like she's accomplished anything recently, and rightly or wrongly, it sucks to feel that way.", "You are getting alot of NTA because it is an mlm.\nI am going yo go another route, \nYTA if you gatekeep personal money to your wife.   She is eligible  for personal money as well as yourself.   If that is 100 dollars a month, or 1000,  finances should be shared, not approved.", "NTA.  Ask her to look up the income disclosure statement for whatever company she's being pushed to join", "NTA, and absolutely not wrong to not want to be involved anywhere near that MLM bs. You're not stopping your wife from getting a part time or even full time job, you're merely not letting her piss away the family's money on a scam. It's not even like this is even debatable at this point, there's so many resources out there about what a nightmare MLM's are, and if your wife is gullible enough to fall for her \"friends\" nonsense about how much money she's making, then your wife has got bigger problems than $500.", "Nta", "NTA: go to r/antimlm\nLook up the company name and you’ll get a lot of info to show her", "NTA. MLMs are a pain in the ass. If she's serious maybe help her figure out a real side hustle.", "NTA r/antiMLM", "NTA spend 5 minutes on r/antimlm and ask your wife to do the same.", "NTA - show her it’s an MLM and all the negatives, then offer to invest in a business she creates. There are tons of low cost ways to start a business, and if she has the time and drive she can totally do it on her own.", "There is a ton of anti-MLM creators on YouTube. I'd personaly recommend CC Suarez, Savannah Marie or Isabela Lantern. You can probably find a deep dive or  \"Watch this video before you join\" for whatever scam your wife is getting sucked into and watch it with her. Try helping your wife find a way to get out of the house, so there are less ways for an MLM to prey on her. \n\nNTA and good luck", "If she wants to make money,  sit down with her and think of ways to do that. As sahm mom for 22 years,   I've done everything from pampered chef to princess house to amway to juice plus to melaluca.  I didn't do herbalife thank God because my friend got really sick from their stuff.  But all of them were scams.  Mlm designed to steal more money from me than make it.  Oh,  let me get into the essential oils,  lord,  did I lose money on that!!", "NTA.\n\nIt's an MLM scam.", "NTA. Definitely sounds like an MLM. You can look up their income disclosure statement and share that with her. You could also show her John Oliver’s MLM episode. It’s free on YouTube. They prey on SAHM, Military spouses, teachers, etc.", "NTA. But you should consider that these mlms don't sell products. They sell a community, feelings that one can contribute financially, and other feelings based on nothing. \n\nFind out what your wife was being sold by her friend and help her find a way to scratch that itch without falling into a con.", "NTA, this just doesn't sound like a good idea at all.", "NTA, but how much research did you actually do?", "NTA- you need to sit her down and explain you want to support her 100% but part of the support is a reality check. Even if she had the $500 to invest to get started, it’s all about finding new people to recruit. If her friend is already selling the product she has hit up everyone in the friend group, unless your wife is very social with many groups she will have no one to pounce on. There are many other jobs she can do and the first thing to look for is a job should not cost you any money to start unless you want a new outfit or something like that but a real company with supply all needs for the job. If she still won’t believe you, tell her to do some research and reach out to her friends and ask how many will support her before she puts out the $500 and hopefully one of her friends will tell her straight.", "NTA.\n\nI don't get how people still fall for this, in 2023. Incredibly dumb and naive. \n\nIf she does find the money somehow, I would divorce her - she's gonna drag you down with her. It will be your debt too, maybe lose the house, etc. If she wants to do it, let her do it single.", "NTA. Your wife has not done the work to determine if this is a viable business. \n\nTell your wife that if she wants to start a business, she has to write a business plan. She needs to list all of her projected expenses in addition to the initial $500---the amount of product she has to buy monthly, the special promotions that will require her to buy supplies and product, the monthly fee for using the company software, any other monthly fees, etc. How much will spend on gas going to parties? Include wear and tear on the car. Will she be buying drinks and snacks for the parties? Decorations? \n\nOnce she's laid out ALL of her expenses for the year, she needs to figure out how much product she'll need to sell to make a profit. She'll need to include a market survey, asking her friends and family if they'd buy the product every month. Did enough of them say \"yes\" to meet her monthly sales goal? Does she understand that only a small percentage of those people will actually buy? And that most of them will not buy every month?", "NTA - but I think you maybe need to talk to your wife about her dreams and what should could practically do to make that happen. Maybe she is bored? Or feeling insecure about her contribution to the family? Or needs to get out of mommy-mode and do something grown up?", "Make her watch Becoming a God in Central Florida all the way through then decide \n\nNTA", "NTA. MLM's are predatory and a huge waste of time, money, and friends you'll lose trying to make them part of your \"business.\"", "Hard no to mlm and NTA. It’s great she wants some income, there are so many other ways to get an income instead of a mlm scam. She can apply to jobs shes qualified for, she can take a course and seek employment in that field, she can go back to school, she can turn a hobby into a business.", "NTA can you watch your child while your wife works at a part time job? As a SAHM she watches your child while you go to work.Then, she can earn her own $500 to piss away on the MLM and she won't be able to blame you.", "NTA. Does your wife know what MLM is?", "NTA, I suggest you send her this: https://ellebeaublog.com/poonique/", "NTA. How do people still fall for these?", "NTA, but here's a way to possibly diffuse the situation. MLM's are legally required to disclose certain statistics about the percentage breakdown of income. Like, 1% of people earned $70,000 or more per year, 15% earned $10,000 or more, 20% earned over $1000, and 64% earned less than $500 per year. That sort of thing. They will always try to hide and downplay it, but it exists, and can be seen before any investment is made, by law. Every one of these sleazy bastards has a breakdown that looks more or less like the one I made up, with a huge majority making almost nothing. \n\nAll you need to do is agree to your wife's request, but with one condition. She finds this info and it shows that more than 50% or more earn at least a few thousand per year... or whatever numbers you'd care to substitute, that would make this worth her time. Every one of these companies have numbers that look so appallingly bad, that it's effectively impossible for anyone to win that argument, and the only way to see those numbers and join anyways, is complete willful ignorance. You can say something like, \"look, this is your money as much as it's mine, but it seems fair that we go in with our eyes open, so let's agree to understand the stats about actual people like us, and how likely average people are to make money at this. If most people are succeeding at this, I support your decision.\" \n\nP.S. They will often say things like most people just use the products and don't sell or lots of people quit and skew the numbers. Those are lies. The numbers are real accurate representations of compensation paid by these companies.", "I'm gonna say NTA. But if you have five hundred disposable I personally would do it. It's your wife. If it's what you think it is and it fails don't say I told you so either. If you don't have it to lose explain why. I assume you intend to spend the rest of your life with her. Don't make her feel like her ideas are silly. If it were me I'd be very hesitant and go into great detail why.  But c'mon man, it's your person.", "NTA There needs to be like an education course for stay at home parents on how to not get caught up in MLM bs.", "Definitely NTA. MLMs are a HUGE scam. If she has the time you should have her watch the John Oliver [Piece](https://youtu.be/s6MwGeOm8iI) on MLMs!", "Nta - remind her jobs pay her....she shouldn't pay them to work!", "NTA\n\nI blew 1k of my own money on an MLM not realizing what it was/how bad it was w/my husband's support. He and I trusted his sister, and I'm still frustrated almost 5 years later. Yeah, maybe 1k isn't much to some, but I'd been saving that for a while, and so many people were pushing a side hustle as the only way to really make money.", "NTA\n\nI understand her wanting to earn her own money but if it was as easy as that everyone would do it.\n\nJust show her videos on it and reviews on the company", "NTA\n\nIt def sounds like an MLM which have been covered by documentaries and several news reports on how the **only way** to make money in it is to recruit more people into it.", " NTA but...\n\nShe needs something to make money and be her own person.  Help her find something else.", "There are a few MLM reddit groups that might be worth a look. \n\n\n r/MLM\n\n\nr/MLMscams\n\n\nr/MLMrecovery", "Sounds like Beachbody. NTA, multilevel marketing is a scam of massive proportions.", "NTA. And yes, MLM.", "NTA- you are protecting her from falling for a scam. Encourage her to get involved in your community in other ways", "NTA but instead of treating your spouse like a child who asked for candy at the store, maybe try to help her understand why it’s a bad idea and offer alternatives for making her own money on the side.", "NTA.  And send her the link to John Oliver’s segment on MLMs. I already knew that MLMs were bad news before I watched it, but that piece is something else. \n\nHopefully, she will realise (and you guys can also discuss) that there are better alternatives for her to make money and/or have something to interest her career-wise.", "NTA.. sorta. \n\n\nMlms are scams and this sounds like a scam. \n\nBut that aside you should both have some amount of funds that you each can spend on things you care about and your partner thinks are silly.", "MLMs are a scam, and the friend is the one who will earn money from your wife joining, albeit not that much money though.", "NTA. Please make your wife watch some youtube videos about MLMs. I can't believe people are falling for this in 2023.", "NTA - MLMs are not real jobs. When she calms down, support her in finding a real job.", "Sounds like a ponzi type scheme.", "I'm just hoping they talked about his concerns. If his wife is just listening to her friend she might now be aware why op is reacting the way he is. I hope he properly communicates why he thinks it's an mlm and also what an mlm is, there's still way to many people who don't know. Op is NTA but it would suck if he just said \"no\" and left it at that.", "OP, definitely take a look over at r/antiMLM, they have a bunch of great resources, including a comprehensive list of MLMs. The community there could also give some great advice and support to help get through to your wife (assuming she's not in too deep yet).", "Or….Hey Hon! 🙄😆", "Her friend won't even be able to provide a simple spreadsheet listing income and expenses. Her friend will just have checks from the company that she claims is money she made but she won't have deducted expenses from that \"profit.\"", "The initial $500 will just be the beginning. She'll have to buy a certain amount of product every month. There will be special promotions and she'll have to buy product and supplies for that. She may have to pay a monthly membership fee. She'll have to use the company's software and there will be a charge for that. There will be additional costs every month.", "This is what I was thinking too! Like ya it’s a stupid way for her to spend money, but withholding money from a SAH parent is kind of shitty. Like if it’s an issue, and she really wants the money, come up with an allowance from the income that he makes for BOTH of them to have so they have spending money.\n\nJust because you took on the role that makes money while she raises the kids (a lot of work and not a lot of monetary recognition), doesn’t give you sole financial decision making.\n\nSo I guess NTA if you guys don’t have 500 to spend, but YTA if you’re withholding money just because you don’t like an idea. Might set a bad standard going forward and it’s a better idea to have the precedence that the money is shared than cross that line even if it’s a mlm (obviously different if you don’t have the money but even then it’s a mutual discussion).", "What a brain dead suggestion", "Agreed 100%! These two are partners, he's not her parent. He should be able to tell her honestly what he thinks, but then let her make her own decision and live her own adventure!\n\nThe only caveat would be if they really can't afford to lose $500...", "Absolutely not. MLM's do not deserve a penny. There's no \"life opportunity\" here, and OP justifiably shouldn't even want his family's name anywhere near the embarrassment of falling for MLM bullshit.", "This is an important aspect that I don't think people talk about enough with regard to MLMs - you will lose friends in the process.  All of these MLMs try to get people to \"leverage their network\" or whatever jargon they use - when really they mean you should hound everyone you know to go buy whatever it is that you are selling.", "Take my broke person’s award as tribute. 🏆", "Yes, this! OP, it's your money, you can say yes or no as you please, but this is your wife, definitely explain to her why.", "Ooky jeeky ukka wubba... hon solo", "Exactly. I'm married, and if I found out my spouse had gotten on the MLM train and started trying to hawk any of that bullshit to friends and family I would be mortified. Thankfully I don't have that issue, but OP needs to put a stop to that crap immediately.", "Next thing he knows, she's been talked into a monthly auto-shipment to become \"The product of the product\" because \"how can you promote something you don't use?\". MLM distributors make up most of MLM customers", "Seriously! Like he shouldn’t be setting the expectation that he controls financial decisions.", "As a married couple, it’s their money. Not his money. Agree that the wife should not pay money to get into a MLM scheme, hope she can find a better part time job.", "TA \n\nNot because you cautioned your wife against investing in an MLM. I’m glad you convinced her to do the important investigation. \n\nWhy you are TA is that is sounds like your wife has no disposable income of her own. While you may be the one bringing in outside income, she is doing important and expensive labor and deserves a degree of financial independence (not having to ask you for everything like a child would). \n\nIt would have definitely be a NTA if this was phrased as she decided to invest $500 of the family finances or $500 of what is set aside for her discretionary use and you cautioned her against it.", "I'd ask her to do some serious digging into the business or even create a business plan to show how she \"in detail\" plans on making the return investment & profit.\nMLM are terrible with their general BS language.\n\nAlso let her know you'd rather her invest in her own business or anything but an MLM", "NTA but recognize that often MLM’s do help one’s self esteem and mental health, even if all one does is attend the Ra-RA meetings and buy in and do nothing else. \n\nIf you as a family can afford the $500, then sometimes the small amount expanded and a few nights a month are enough to see them for the fraud they are.  \n\nAlternatively, does your wife have real skills that would allow an actual part time job?  With a 2 year old, sometimes you can find one or two day a week care for a reasonable amount, particularly if the child is toilet trained, and a professional position would be good for your wife’s mental health.", "YTA if you really think you’re “giving your wife money.” That’s is everyone’s money.", "NTA\n\nYou shouldn’t have to invest to work for a living! Have her look into other jobs if she wants to work so bad! Her friend may be too pushy and she’s too embarrassed to say no!", "MLM are pyramid scheme which are illegal in the US. NTA", "NTA\n\nTell her that buying a starter kit does not make her a business owner. Find out the name of the MLM then look up the CEO of the company and show her to really drive home the fact that she doesn’t have any ownership of the business, and she is really just buying products from a major corporation.", "The friend makes good money by recruiting other friends. \n\nSome people can make money with MLMs, but the odds are that any one individual will not. If she really thinks she can make money, have her first think of how many friends/acquaintances  she has that do not know the other friend (and do not already know someone selling this product). Then have her ask those friends, before she invests any money, how interested they would be in buying the product. If they are interested, how much they think they would buy regularly. Have her figure out how much she would have to sell to pay for the initial investment and her time. If she's at all rational, she will see that it's unlikely that she will make any money.", "Total scam. NTA", "NTA. It’s a scam. All MLMs are a scam. If you have to invest money up front, run from it.", "NTA. highly recommend watching one of the documentaries I'm sure you've gotten dozens of recommendations for, especially if they're about the specific company she was thinking about.\n\ncould you potentially cut back your hours or try to take over some of the parenting responsibilities? maybe she could get a real job and use that money to save up for the initial investment if she wants, and maybe through it she'll get the social interaction she needs. being at home all day with a 2 y.o. is probably really alienating, and I've known tons of people to get \"toddler brain\" where they spend too much time around children and content made for them to the point where they kind of forget how to have conversations with adults.", "NTA- it's an MLM scam aimed at SAHM. You can actually get paid to work now. It's a miracle!", "NTA. My mom did this exact thing and now we have $650 worth of unsold Juice Plus. Thanks Mrs Taylor for getting my mom into MLMs. Very cool", "NTA\n\nBut, your approach needs some work. Do you both work out the family budget or do you handle everything? She may not realize how much of a chunk of the monthly budget she's asking for. Even when there is only one breadwinner, it's better for both spouses to set the budget.\n\nCould you sit down with her to research the company that your wife's friend is involved with? If it's like so many MLMs, red flags will jump off the internet search at you both. Even if it is not one of the zillion and three scammy MLMs, there won't be an immediate profit. This link might help you both. [https://www.ramseysolutions.com/saving/multi-level-marketing](https://www.ramseysolutions.com/saving/multi-level-marketing) \n\nIf she wants to add to the family finances and has the time, help her look for a part-time position or work-from-home job that she would enjoy. This doesn't have to be a negative situation.", "NTA it is MLM and they’re toxic AF! I got sucked into the same one “that crazy wrap thing” they tell you to use your personal page, and will tell you to block anyone who says anything logical like “this doesn’t work”\n\nSave her from herself. This isn’t her business. She doesn’t make money off profits.", "I’m here after the edit. Just a heads up that if your wife wants to go into business for herself, maybe she can create a product, I’ve known a few people that make their own businesses from home. For example, one of my friends started a small business from her house and all she was doing was making jelly. She loved her garden and decided to get some blueberry bushes one year and eventually had way too many blueberries. So she made it into jelly and started to give it away. Then she realized that she could sell it to local grocery stores. Another lady I met did this with BBQ sauce. She always liked making her own and decided to try selling it, fast forward a few years and now it’s in multiple states. There’s a lot she can do if she doesn’t want to work for someone else.", "Would it be possible for her to take on a part time job ? Maybe take some certification classes of some kind like bookkeeping etc. MLM’s are predatory at best and it’s understandable that you don’t want to see your wife fall down that route", "NTA, do NOT put a dime into an MLM scam, which is what that \"company\" is!", "Congratulations to your wife for saving herself from an MLM! And well done for supporting her in doing this - you were doing a kind thing, even if it was harshly phrased in the moment.", "Also OP be careful, these MLMs are not above encouraging people to go full on scorched earth if anyone gets in the way of them joining. They will provide scripts to the recruiters on what to say, and they escalate to the point of suggesting you are a victim of financial abuse if your partner won’t support you joining. People have divorced over MLMs, sometimes before they even signed on.", "MLM's have ongoing costs so it won't end at $500.  The continued costs are how people get into massive credit card debt for MLM's.", "Most people consider burning money at the casino as a waste and unethical. Same applies here. Stop trying to paint him as a controlling breadwinner who spends money but restricts his wife.", "Lmao nice work making up a completely bullshit scenario out of thin air with the sole purpose of making the husband look like a financial abuser.", "100% agree and weird this is getting downvotes. She’s a SAHM but he controls all the money?", "Lmao what bullshit.\n\n>A marriage is a partnership, so you guys need to decide together.\n\nIs this some codeword for \"let wife do whatever she wants?\"\n\nLooks like its coming out of a shared account so both parties need to consent and **decide together.** They can't come to a mutual decision because they are disagreeing. \n\n>If it helps you get past the idea that it's a dumb business, think of it  \n as a hobby. If your wife wanted to put $500 into a hobby would you be   \nagreeable to it? I say be supportive and encouraging, let her give it a   \nshot and see what happens and be her biggest fan in this and all things   \nin life.\n\nHobbies have positive benefits. MLMs have negative impacts, drain money with no benefits, ruin relationships with friends and family because of the need to sell shit and are built on a foundation of lies and preying on the vulnerable.\n\nI guess if the wife wanted to steal the Mona Lisa the husband should go and buy her a van and some tools so he is a good little supportive husband? Sometimes being a good partner is keeping your other half out of trouble", "Came to say the same! Beat me to it. \n\nSeriously OP, get your wife educated on MLMs- there are a few documentaries too like the one about Lularoe", "Hey girly! 👋 🤮", "Depending on the mlm, there's often a ton of people that are breakeven or making below minimum wage.\n\nFor example, in Herbalife, the median is around $0, with 99% under min wage:\n\nhttps://imgur.com/gallery/7fYhCjc", "This is what I came here to say. His bit on MLM's was wonderful.", "If she doesn't have access to $500, she has no financial agency, and she's working full time as a parent with no income. He may not be an abuser, but if you can't see the imbalance in this arrangement, that's not my fault.", "Its getting downvoted because its the typical AITA strategy of blame the husband for the wife's AH actions\n\n&#x200B;\n\n>She’s a SAHM but he controls all the money?\n\nIf you take a \"man bad\" reading of the post sure. But can you quote where he said he \"controls the money?\"\n\nIt looks like it is coming from a shared account and requires mutual consent which husband is wary to give because its a fucking MLM. But nice work pulling shit out of your ass purely to vote the husband an AH", "People often see MLM victims and potential victims as responsible for their own fate, rather then targeting the MLM itself for its predation. This woman just wants to have some financial agency, because her parenting occupation isn't rewarded financially in our society.", "I know right!  So refreshing to actual advise that isn’t clearly the word vomit of a 12 year old.", "Doesn't look like he has access to $500 dollars either. \n\nThe most likely scenario is that they have shared finances so while wife has access to money, big purchases that may be recurring need to have mutual consent. This applies to wife's and husband's big purchases. \n\n&#x200B;\n\n>If you were going to spend $500 on a Bitcoin purchase, would you feel   \nthe need to tell your wife beforehand? If no, you are already a   \ncontrolling husband.\n\nLike I said, nice work pulling shit out of your ass to make the husband look bad", "I guess I misinterpreted the sentence “she is asking me for a $500 initial investment.” To me that implies he controls the money. If that’s not the case, I would totally agree NTA.", "I totally do think MLMs are bad and he should discourage her from doing it, but it just seems weird to me that she would need to beg permission for $500. If it was $50,000 maybe, but this seems extremely controlling.", "Irony, thy name is…", "Uhm, unless you’ve talked to op and asked them how they do their finances, that’s a pretty blanket statement, just sayin, not everyone combines finances", "You seem confused about how hypothetical and conditional statements work", "If the wife smashed OP's phone with a hammer, locked him in the basement for 3 days and cleaned out their joint accounts to buy a pickup truck and rammed in into the house, she would be an AH.\n\nTwo can play at the \"conditional statement\" game mate.", "Her \"friend\" is not a friend.  Tell her to cut her off if she's smart -\\_-", "NTA she should be mature enough not to fall for an MLM or scam.", "Check out Amazon FBA. Lots of money to be made. Not a scam. I got started with like 800.", "NTA for your initial reaction although you could have phrased it better. Yay for communication making things better and clearing up the initial misunderstanding.", "NTA. MLMs are predatory", "NTA - if she wants to work, figure out a way to get her back to an actual job -- not a multi-level marketing scheme like MaryKay or whatever the newest scam of the month is.  I'm glad she figured out it wasn't a good idea.", "NTA you sound rad after the edit. You sounded, not wrong, before the edit.", "r/antimlm", "NTA. \n\nI was the SAHM looking for anyway to feel like I mattered in the world. I did the “phone interview” and just knew if I bought in, I’d be a financially contributing partner and all of our problems would be solved.\n\nMy husband was gentle and googled along side me. It’s always a scam. But he saw the need that drove my willingness to accept the scam and we worked it out. I got a part time, going nowhere, job and got to interact with adults again.\n\nShe’s searching for something. Listen to her.", "NTA these MLMs literally prey on people like your wife.", "That is one of the many ways MLMs suck, legit businesses don't expect their salespeople to pay for inventory", "My mom did pampered chef and Mary Kay and had good success for extra cash. I think people need to be realistic about it and know how to sell things. Also we all liked the product so we did it for a discount lol", "Yeah, Etsy might be good for if she's into arts and crafts. It helps to sell something you're already familiar with and have product/supplies for.\nI collect/play with LEGO and Magic the Gathering and sell on BrickLink and TCGPlayer respectively (the latter is set up for many trading card games and a few other nerd collectibles), other things I put on eBay if I can't sell directly to another collector\n\nThese all have straightforward per item/sale and percentage fees, much of which includes credit card processing fees. Part of the MLM scam is confusing commission systems, and additional purchases like training materials", "... So he should just let his wife get scammed because it's \"right\" to do so? What are you on about?", "Wow that’s pretty cool I’ll have to check those sites out!", ">Just because you took on the role that makes money while she raises the   \nkids (a lot of work and not a lot of monetary recognition), doesn’t give  \n you sole financial decision making.\n\nThis is what happens when AITA commenters get their greasy little sausage fingers on the post and apply their \"man bad\" take on it.\n\nWhere does it say that he has **sole financial control?**\n\nWhat is more likely than him being a financial abuser is them both using a shared account where normal purchases are fair game but anything somewhat big and classed as something like an investment/life decision requires mutual consent. In this case the wife is asking her husband if it is a good idea to spend a somewhat significant amount of their money on something that is a life decision. She is seeking his approval because it is likely a shared account which requires his consent too. And if the shoe was on the other foot it would also happen. This is how many couples and families operate.\n\nI don't know how you can read this in the context of big bad man forces meek little wife to be locked at home with kids and forces her to ask her permission to open the tap and drink water. But then again AITA commenters never cease to amaze me with how bad their takes are", "The Lularoe one was very eye-opening. I expected the company to be predatory and all, but it reached whole new levels of predatory that I wasn't expecting.", ">People often see MLM victims and potential victims as responsible for   \ntheir own fate, rather then targeting the MLM itself for its predation.\n\nNobody is saying that MLM's aren't evil predators. But this is 2023. You have the internet and your own \"if it is too good to be true it probably isn't true\" intuition. If you believe their lies you are also at fault. Stop justifying her bad decisions", "NAH.\n\nWhile it’s absolutely wild and deeply unwise to join an MLM, she might not be so vulnerable to an MLM scam if you didn’t frame your family’s division of labor as “I’m the sole breadwinner” without noting her contributions to your household.\n\nDo you know how much childcare, cooking, cleaning, and general family/social organization costs when you outsource it? She may not be bringing in $$$ but she is performing tens (if not hundreds) of dollars worth of labor as a SAHM.\n\nThese MLMs prey primarily on women who are undervalued and want to take a chance on themselves/prove people wrong within the confines of their family roles. Empower your wife to not only see her value, but also identify legitimate ways she can bring in money in a WFH capacity!", "Beware the Boss Babes….  Also I bet your wife will find her friend will not be one once she finds out you won’t be investing", "Red  Aspen is a MLM but it only requires 14.00 to start.  I have a friend that is making 70k a year off of it. It all depends on her personality and how hard she's willing to work, as well as a large friend group. MLM's on the whole are terrible.", "Hey, as a SAHM and ardent anti-MLMer - tell your wife to look into becoming a virtual assistant. As long as she has basic computer skills, she can easily work that into her schedule. I’ve done it for four years now - as an independent contractor, I’m my own boss. I set my own rates, work my own hours, and it flexes around my life. \n\nI know a lot of women who get into MLMs, and I get the appeal. Being a SAHM is lonely. She wants to contribute to finances, and having her own money feels good, and not like she’s taking money from the household. Encourage her to find some sort of mom group - MOPS (Mothers of Preschoolers), Mom Walk Collective, or set up a time to meet other moms and walk in a park or something. Encourage her to be social. That, combined with some sort of freelance work, really can make a huge difference. \n\nAlso, encourage her to study up on MLMs - a.k.a. direct sales, network marketing, social selling, “shop club” in Melaleuca’s case. Many deny being MLMs because they’re using other terms, but they still are. It’s easy to get caught up in something when you’re in a vulnerable place.", "NTA! Also, I really appreciate that you realized the communication issues and took responsibility when most people wouldn’t have.", "You two are a lovely couple who deserve every happiness.", "NTA - MLM", "BL is great for buying/selling individual pieces/figures, though it also covers complete sets. Likewise, TCGPlayer is popular for single cards as well as sealed product.\n\nThis is great as a legit business model of buying whole sets and/or random packs so customers don't have to. Also, there's synergy when you want some of the components for your own playing/collecting but don't need the rest.\n\nAs those sites are focused on specific products, there's more detail and easier listing, including it being feasible to include lower value items", ">stay at home mom of our 2 year old\n\n>I'm the sole breadwinner\n\nPretty safe to assume they \"share\" finances, otherwise it'd be wild financial abuse.", "NTA don’t support your partner in making terrible decisions even if it upsets them. Also, she can watch this John Oliver on MLMs. \n\nhttps://youtu.be/s6MwGeOm8iI", "nta. she finally figured it out but does she have any hobbies or like crafting and things like that? she could do them for fun and then probably post them and sell them. that is if she doesn't want to work a retail/office job. that's personally what I'd do if I was a sahm 🤷🏽‍♀️", "And definitely don't want to lose money on scams either!", "Hell, she’d get more out of volunteer work than she would out of an MLM.", "Amen. This is the comment I was looking for. I am 100% against MLMs but I’m more against husbands controlling the finances so women have to ask daddy if they want to make a purchase. Yeah, an MLM is a bad investment but I’m guessing he’s made a bad investment in his life and his wife didn’t get to override him in it because he made the money. SAHMs work too, and she gets no monetary compensation for her labor. I’d rather see her fail at an MLM than have him take her adult decision making abilities away.", "And it would be A BUSINESS, not hocking supplements that you have no stake in.", "Being realistic is realizing that 99% of people in MLMs lose money, and those who don't get it by taking advantage of others.", "Wow I knew they were bad, but that’s just shameful.", "People in healthy relationships don't spend 500 dollars of their mutual funds without having a conversation with their partner."]}