{"id": 15584, "submission_id": "12xgkbx", "title": "AITA for wanting my mother-in-law to move out?", "selftext": "My mother-in-law has lived with my wife and I since her dad died in 2019. My mother-in-law complains anytime my wife and I go to the store if we buy our 3 year old a new toy. All my mother-in-law does is sits in the recliner from the time she gets up until she goes to bed. The home my wife and I picked is a 3 bedroom home my parents cosigned on with us for. My mother-in-law does not help clean the house at all. She has a bathroom that she is the only one who uses it. She wont even clean that bathroom. I work from home/on road meaning my office is in my home I have actually never met my manger. By having my mother-in-law here still means I have to use space in the bedroom for my office. I understand that family is important but feel like my mother-in-law is just using my wife and I. My wife feels I am an asshole at times for expressing how I feel other times she completely agrees. I know I can be an asshole at times just not sure if this is one were I am in the wrong. I know everyone has different opions and honestly everyone can think I am being an asshole. I see my parents who are a little older than my wifes mom always staying busy and look about 10 years younger than my wifes mom. Don't get me wrong I love my wifes family just different upbringings and so not sure this time.", "created_utc": 1682344412, "permalink": "/r/AmItheAsshole/comments/12xgkbx/aita_for_wanting_my_motherinlaw_to_move_out/", "score": 48, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I have yelled at my mother-in-law to get up and help. So that would make me an asshole as I didn't show respect to her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, she sounds intolerable.\n\nBut insisiting on  this will be make or break for your marriage, if your wife can't agree.\n\nSo I suggest you and your wife (and just the two of you!) thrash this out with a couples' therapist as referee.\n\ngood luck", "NTA. Why did you take her in after her husbands death in the first place? She had a place where she lived with him right? Or is she ill and cannot take care of herself? If so, it would have helped if you had mentioned it.", "NTA - You married your wife, not her and her mom. I can understand that grief can take time to process but your confort of life has been impacted for a long time now ! Maybe she could find a place close by so she can still be nearby but not in the house in itself ? Good luck !", "NTA and a free loader needs a new home as it would give you more space and also won't have to deal with all the negative energy associated with her. Also its your parents who cosigned for the house and her contributions appears to be nothing. At least she could behave better or its fair for you to want to not have to deal with her as much as possible.", "how old is she? does she have any medical problem preventing her from living alone or to clean stuff ?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mother-in-law has lived with my wife and I since her dad died in 2019. My mother-in-law complains anytime my wife and I go to the store if we buy our 3 year old a new toy. All my mother-in-law does is sits in the recliner from the time she gets up until she goes to bed. The home my wife and I picked is a 3 bedroom home my parents cosigned on with us for. My mother-in-law does not help clean the house at all. She has a bathroom that she is the only one who uses it. She wont even clean that bathroom. I work from home/on road meaning my office is in my home I have actually never met my manger. By having my mother-in-law here still means I have to use space in the bedroom for my office. I understand that family is important but feel like my mother-in-law is just using my wife and I. My wife feels I am an asshole at times for expressing how I feel other times she completely agrees. I know I can be an asshole at times just not sure if this is one were I am in the wrong. I know everyone has different opions and honestly everyone can think I am being an asshole. I see my parents who are a little older than my wifes mom always staying busy and look about 10 years younger than my wifes mom. Don't get me wrong I love my wifes family just different upbringings and so not sure this time.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Take a page from her son. Kick her out. Him kicking her out have been a sign. Being nice to her wouldn't end well. She has worn out the welcome mat.", "Hold up. Your MIL has been living in your house for 4 years? Did you marry your wife, or your MIL? I'm assuming she's living there rent free as well considering she sits around all day. Like, I understand people can grieve differently, but 4 years? Come on, that's a little much, don't you think? You and your wife need to have a serious sit down conversation about this, because it sounds like her living there is putting a serious strain on your marriage. Serious to the point where if she can't agree that MIL needs to go, divorce might be on the table. I don't normally say that, but this sounds like divorce territory. \n\nNTA. Your wife needs to decide who she wants to keep. Your marriage, or her mother.", "YWTAH if you didn't try and and at least remedy the situation first.\n\nMaybe your MIL is sick or is depressed.  Does she have any possible physical impediments or chronic pain that could prevent her from being more helpful?\n\nYou need to get to the bottom of the reason why she's being unhelpful and discuss things going forward.  \n\nWe haven't heard your MIL's side of the story.  We don't know what is troubling her.  \n\nI understand that sometimes family members are just plain selfish and don't want to help because they are not invested in you.  I don't have any contact with my own immediate family and most of my husband's family are like this also.  They only care about themselves after being given multiple chances to make it up to us.", "OP - what is the end game here? Was there an agreed timeframe she would be there? Pre-agreements about expectations etc?", "I think we need more INFO for a judgement.\n\nSounds like your MIL was living in her dad's house. Was she caring for him, or just sitting in a recliner in his house? I'm assuming from context that she has almost no income, and moved in to your place because she couldn't afford a place of her own. Is she retired? Did she have a job? What job? Is she physically capable of looking after herself (normal household cooking and cleaning etc.) or not?\n\nUnder what terms did she move in with you? If she's going to be part of your household, then she owes an equal share of labor to support the household, which would mean doing her share of the household chores. Or she owes monetary support or something...", "Toss her out.", "NTA but my question is why did she move in in the first place? There's no granny flat in your property for her so this is a very difficult situation for you. Try and talk to her about senior housing or the marriage is truly over", "The loss of our oldest son due to birth defect couldn't break us. This issue will just be a speed bump compared to that.", "My father-in-law had the house in his name only as it was a rent to own my mother-in-law didn't have her name on the home at all. So when my father-in-law passed my mother-in-law moved in with her son and his family until they kicked her out. I don't know the details on that situation as I didn't want to pry.", "My mother-in-law is 64 and she does have some issues with walking or standing for long periods of time. I have bought her walkers to help with mobility and she has several canes but refuses to use any of them.", "I would never tell my wife to make a choice like that.", "I hope you are right. But actually that   bereavement could cause her to double down on keeping her mum there: \"I can't 'lose' another one\". Couples counselling, dude. I draw your attention to this: \"My wife feels I am an asshole at times for expressing how I feel\". That's bad.", "I still suggest you get a (experienced and neutral) mediator because this is a very delicate situation", ">until they kicked her out.\n\nno shit\n\n>I don't know the details on that situation as I didn't want to pry.\n\nYou should *absolutely* have found out why they kicked her out, before letting her through your door.  Big mistake.", "She could have the lease contract transferred to her name, she should have discussed it with the landlord. Nothing unusual about that when someone dies. \nSo her son threw her out after a while? Did you ask him why before you took her in? It sounds like you should have, then you would have known beforehand what a pain in the ass she is. Anyway, that’s hindsight, now just find her a nice appartment or home for the elderly and move her into it.", "Dude, I’m older than that and still working and running my own household.", "> I would never tell my wife to make a choice like that.\n\nAnd yet she must make that exact choice, because it is totally unreasonable to expect you, her husband, to tolerate the behaviour of her, her mother.", "ESH - You are unhappy and becoming resentful, but it seems like other than complaining you are not actually doing anything to address the situation. Complaining is not the same thing as communicating. You need to have an actual conversation with your wife about this.", "If your MIL has been using the death of her husband for the past 4 years as an excuse to be living rent free in your house, she totally is just using you guys as a free ride. It's obvious from your post that it's been taking a toll on your mental health and marriage. Your wife can't see past family to realize what it's doing to her husband. Hell, half the time she's calling you the AH for expressing how you feel about the situation.\n\nI've seen similar situations like yours play out and it never ends well. Almost always ending in a breakup. This will fester to the point where you'll end up at a crossroads and have to make a tough discission. Or, you can do nothing and let it be made for you, and I can promise you wont like it.\n\nOP, I don't want to come off sounding like a jerk, you need to wake up and see what's happening here. MIL is taking advantage of you and your wife. Your wife can't see it and is enabling MIL. She's allowing this to affect your mental health and marriage. Whether you like it or not, you two are going to have to make a tough choice. Whether you present this choice yourself, or you let it happen naturally, it's going to happen either way.", "I know it sounds bad but I have issues expressing myself the right way at times. Those are the times she feels I am being an asshole. My wife knows my mental health issues and so has to remind me when I am being an asshole from time to time.", "My sentiment exactly. OP is only complaining and allowing resentment to build instead of actually addressing the problem. Part of being married is addressing possible problems with the marriage and addressing them together. There seems to be zero communication between OP and the wife, and instead of fixing it they're allowing it to fester. I can only see this marriage ending in divorce if they continue down this path.", "One more thing supporting counseling.\nAnd do not let her gaslighting your valid concerns as beeing an asshole.\nEspecially if your MIL is around you all the time, how can you have an honest and open conversation.with your wife?", "Honestly? The way your MIL treats you, I think you are allowed to be as much of an asshole as you like about this. If you called her names to her face until she WANTS to leave, I personally would not judge you for it.", "My wife and I are always open and honest with each other. We both work and honestly still talk on the phone for 3 hours a day we after 7 years of living together."]}