{"id": 15636, "submission_id": "12ydr8e", "title": "AITA for not letting the passenger in front of me recline their seat on a flight?", "selftext": "I (25M) am around 6'5 or 196 cm, but my legs are long. Normally I purchase economy plane seats because I have no issue being uncomfortable for a while, especially for shorter flights. I should mention that I take care to never intrude on other people's space around me, although occasionally with another tall person with wide shoulders it can be tight. \n\nLast week, I was on a 4-hour international flight with my knees crammed into the seat in front of me. The passenger directly in front of me tried to recline, but realized that my knees were preventing her from doing so. She turned around, gave me a dirty look, and attempted to recline again with more force. I was a little annoyed, but apologized and told her I could not move my legs out of the way without encroaching on the spaces beside me (i.e., moving my legs to the side into other people's spaces, freeing up space for her). She accused me of doing this on purpose just because I wanted more room for myself, calling me an asshole and saying that if I could not fit into a normal economy plane seat that I should pay extra for an emergency exit seat so that people around me can have more free space. If I'm honest, I feel that people who recline their seats in economy are annoying and inconsiderate, so I didn't exactly bend over backwards to accommodate for her.\n\nFor more context, no, I did not check to see if this flight in particular had extra emergency exit seats. Like I said, usually I do not feel the need. I do not often run into issues with seats beside me, although this issue with people in front of me not being able to recline has occurred before, though not always, and has earned me some dirty looks from those in front of me in the past. \n\nSo, am I the asshole? Should I pay extra for seats with more leg room so that people in front of me can recline even though this is not always a problem?\n\nEdit: wow this was controversial—some people think it’s unacceptable to recline at all and others think it’s a basic right. I will keep this in mind on future flights :)", "created_utc": 1682413961, "permalink": "/r/AmItheAsshole/comments/12ydr8e/aita_for_not_letting_the_passenger_in_front_of_me/", "score": 4055, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I realize that people ordinarily have some room to recline on flights, and that if they get me behind them, then they are just unlucky and they can't. I worry that I am the asshole, in other words, because my being behind people effectively takes away their ability to recline, which they normally would have.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - I'm a big guy and it's a common problem. They squeezed every inch out of those aircraft and it's uncomfortable. She should have been more understanding of reality. Maybe you could have gotten an isle seat but you paid for your seat as well and are entitled to your space.", "NTA\n\nI travel a lot.\n\nIf I pay for a recline seat, if we can recline the seat, I don't know why it should be inconsiderate to not recline it. \n\nThat being said, \n\nIf I have an issue, I just go the flying crew. Asking them to find a solution or, if not possible, write a mail afterward.\n\nI am not going to ask you tu cut your legs, that's ridiculous. \n\nMy last trip, I was upgraded in premium. \n\nI couldn't recline my seat, I was forcing AF. \n\nI turned around and I saw the legs of the passenger behind me touching my seat. \n\nHe looked at me laughing, shacking his head and said \"I am 6ft10\".\n\nI knew I was fucked. Plane was full. Trip from 11pm to 6 am.", "NAH, only asshole here is the airline.\n\n>I feel that people who recline their seats in economy are annoying and inconsiderate\n\nNo, they're just trying to get comfortable in their own tiny seat.\n\n>Should I pay extra for seats with more leg room so that people in front of me can recline even though this is not always a problem?\n\nMaybe, if it makes sense for you financially. Sounds like you'd be more comfortable too.\n\nEdit: since people keep commenting on this, yes, she's a bit of an asshole for calling you an asshole. Her frustration at not being able to recline her seat is understandable, but it's her frustration to deal with, not your problem.", "NTA. It’s not your fault you’re too tall for her to recline.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (25M) am around 6'5 or 196 cm, but my legs are long. Normally I purchase economy plane seats because I have no issue being uncomfortable for a while, especially for shorter flights. I should mention that I take care to never intrude on other people's space around me, although occasionally with another tall person with wide shoulders it can be tight. \n\nLast week, I was on a 4-hour international flight with my knees crammed into the seat in front of me. The passenger directly in front of me tried to recline, but realized that my knees were preventing her from doing so. She turned around, gave me a dirty look, and attempted to recline again with more force. I was a little annoyed, but apologized and told her I could not move my legs out of the way without encroaching on the spaces beside me (i.e., moving my legs to the side into other people's spaces, freeing up space for her). She accused me of doing this on purpose just because I wanted more room for myself, calling me an asshole and saying that if I could not fit into a normal economy plane seat that I should pay extra for an emergency exit seat so that people around me can have more free space. If I'm honest, I feel that people who recline their seats in economy are annoying and inconsiderate, so I didn't exactly bend over backwards to accommodate for her.\n\nFor more context, no, I did not check to see if this flight in particular had extra emergency exit seats. Like I said, usually I do not feel the need. I do not often run into issues with seats beside me, although this issue with people in front of me not being able to recline has occurred before, though not always, and has earned me some dirty looks from those in front of me in the past. \n\nSo, am I the asshole? Should I pay extra for seats with more leg room so that people in front of me can recline even though this is not always a problem?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", ">If I'm honest, I feel that people who recline their seats in economy are annoying and inconsiderate, so I didn't exactly bend over backwards to accommodate for her.\n\nI thought not the AH until I read this and then it became YTA\n\nThis is part of what everyone pays for in their ticket. They are not AHs for wishing to avail of something that is part of normal seat functionality. \n\nMy husband is 6'6\" and all of that extra height is in his legs but we don't blame other passengers for the lack of legroom in economy, that's down to the airlines. We ask with respect and politeness if they would be willing to sacrifice use of their reclining seat so he is able to fit into the space. And are grateful if they do.\n\nBut we also look to minimise this issue coming up by paying extra for emergency aisle or premium economy seats with extra legroom. \n\nThe lack of legroom for tall passengers sucks but it's not the other passengers' faults either.\n\nYTA", "NTA. Flights are already expensive, and it was a relatively short flight. If the flight starts to go longer, I would encourage you to maybe go for the emergency seats so people can recline a bit to get some sleep. I get you can't control the bs the airlines do by cramming us in like sardines or your size, but you can always try to take some steps to help out your fellow passengers in the future", "NTA. It’s not the passenger’s fault that airlines cram in a lot of seats. The person in front is not an AH for wanting to recline but they are an AH for making such a fuss", "Yta for expecting people not to recline", "YTA because of this sentence: I feel that people who decline their seats in economy are annoying and inconsiderate. Newsflash, they pay for that. Your whole idea of not encroaching into other peoples space is bullshit if you’re preventing her from using the full capacity of the seat she purchased. This issue has happened before. You knew going into this flight that you were going to affect the person in front of you negatively. This is the same thing as someone being too wide to fit in just one seat", "YTA. \n\n\nIt’s not your fault that you’re tall and you deserve a comfortable plane ride. I understand that you didn’t want to encroach on your neighbor’s space either. \n\nHowever, YTA for thinking she doesn’t deserve to recline. Some people are banking on being able to recline a little bit for sleep. If you need more leg room, pay for the upgraded seat or at least speak to the flight crew about a possible upgrade. It makes you AH that you’re inconsiderate of her comfort too, not just your own.", "YTA, rather upgrade or check in early to see if you can get an exit row seat for free.", "YTA\n\nYou say you don't encroach on other people's space. Yes you do.\n\nYta for lying here.\n\nThe chairs can recline and that space belongs to the person in front.\n\nYta", "YTA.\nThe person in front of of you has paid for the seat and it‘s recline.\nIf you are close to 2m, then buy business class tickets or seats with more space. \nOr fly a airline with larger space between the eco seats. They are there ;)", "YTA\n\nThose seats are meant to be reclined, everyone has a right to do it. I don't believe that you're so tall that you can't stretch your legs out straight under the seat in front of you.", "That. Is fking tall.", "I never fly. Is it bad to expect to be able to recline, since that's what the seats do?", "This is it.\n\nIt isn't a case of not allowing someone to recline if the space provided is not big enough to do so. Seat spaces are very poorly designed for taller or larger people.\n\nI'm with you on this one - NAH.", "Why can't his legs go under the seat in front? His height is the issue, why can't he adjust himself to not take away someone else's space?", "Orrrrr since he can’t control his proportions.,,,she could have paid to upgrade if she needed to recline that badly. \n\nHe didn’t need more room. He fit. Just meant she couldn’t recline. Too bad. So sad. Why was her comfort more important than OPs or his seat mates.", "He is the tallest guy I have ever met.\n\nOf course, he was behind me.\n\nKicking my seat when moving. \n\nI can't ask him to be less tall lol", "No, reclining is normal. My opinion is that OP stopping someone from reclining is the AH. Since it was physically impossible, there is nothing OP could do on this flight, but now that they know this going forward I would consider them the AH if they don’t purchase a larger seat so as not to inconvenience the people around them.", "But he doesn’t fit if she wants to recline. And she does. So he does not fit. \n\nHer seat reclines and she’s entitled to be comfortable. So if he can’t fit when she’s utilizing the amenity of her seat’s recline feature, then he does not fit, IMO.", "Also… her comfort isn’t more important. Everyone should be comfortable. This guy is making HER uncomfortable. HE is encroaching on the space she is provided by the seat recline. \n\nShe shouldn’t have to pay the price for someone else’s proportions. He shouldn’t be an AH and he should get a seat that doesn’t inconvenience people. Those seats exist.. he’s just choosing to not even ask for one.", "Yes, everyone expect the woman to give up her comfort to benefit a man and keep him comfortable.🙄\n\nI doubt he would have tired this shit if it was a guy in uniform or one bigger than him, probably not even if it was just another man.", "Thank you!", "Fwiw, you say “with another tall person with wide shoulders it can be tight” which means if a smaller person is next to you it doesn’t feel as tight, so you are likely encroaching on their space whether you realize it or not. \n\nIf you stay completely in your space, then it shouldn’t matter what size the person next to you is.  Your space is the same size either way.", "NAH.\n\nBut reclining seats is a feature, and the passenger in front has every \"right\" to do that.\n\nYes, tall travellers do get the short end of the stick here.\n\nThe airlines are the arseholes. \n\n>I feel that people who recline their seats in economy are annoying and inconsiderate, so I didn't exactly bend over backwards to accommodate for her\n\nThis is so entitled regardless of your height. \n\nIt is a literal feature of seats in legacy carriers. They spend millions in R&D doing their seat designs, yes even economy seats, and everyone should be able to use the function of all of the seat without being judged. \n\nBe less judgemental.", "NTA. I agree that people who recline their seats in economy class are TA", "Lmao where are all the ppl who demand fat ppl buy an extra seat? Theres a section for taller ppl too.", "Would have been N A H, but this - \n\n>She accused me of doing this on purpose just because I wanted more room for myself, calling me an asshole\n\nmoved it squarely to NTA. I would have responded that if she wanted more room for *her* self, she should have booked a lie-flat seat in 1st class.", "NTA.\nIt would have been NAH because it's the airline's fault for not having enough room for people to recline while offering the option but honestly the fact she doubled down to try and force your knees into submission so she could recline makes her an AH. Her 'need' to recline isn't more important than your joints. Both her and her selfish attitude can bugger off, right alongside the airline.", "Airlines are TA. Full stop. No discussions here. Airlines need to be held accountable for the situations that their uncontrollable greed has created. It’s outrageous the amount of coddling airlines get from the government just to turn around and bend the customers over at every possible juncture, from checked bag fees to seat fees. Just a reminder that airlines have been bailed out by the US government multiple times to the tune of tens of billions in the past 25 years.", "\"If I could not fit into a normal economy plane seat I should pay extra\".\n\n\nBut you do fit. There's no rule that states you must have xcm clearance between your knees and the seat in front. The fact she realised you were up against the seat, and tried to brute force your knee caps makes her the ass hole. I like how she decides to blame you rather than the airline.\n\n\nAlso, people that recline seats on short haul flights are a pain in the arse. I'm a big guy too, and I'll happily block the seat from reclining, it doesent need to be down on a short haul flight.", "To be honest they should just remove the recline feature in economy. NTA. In economy you can’t recline your seat without creating a worse experience for the person behind you and possibly making their tray unusable. Overall, it’s just bad design.", "NTA. You could fit just fine into the seat, until she tried reclining hers. You'd be paying extra for her comfort, not for yours. \n\nI wish they'd just get rid of the recline on economy seats, to be honest. Or at least have it somehow centrally controlled so that it's only possible on night flights. But while it's present, someone is going to get the short end of the stick. This time, it was her.", "The airlines are the real AH. You as extremely tall are also because you put yourself in the situation. Knowing the reality of flying you should get an aisle, exit row or business class to fit you. Not expect others to be inconvenienced to accommodate you.", "NTA - I don't even understand why standard economy seats are made to recline, it's so annoying, especially if you have a drink or something on the little pull down table.", "NTA. I'm only 5'3 and I *hate* when the person in front of my reclines their seat. It makes my tray table basically useless, same with my screen.", "Light YTA especially because you said that you've caused this issue to people before. \n\nI know you can't change your height but we pressure fat people to buy 2 seats to not inconvenience those around them so it should be reasonable to expect you to pay for leg room to not inconvenience the people around you. She paid for a seat that reclines and should have every right to recline even if you disagree.", "NTA I'm not tall just over a foot shorter than you but I wish seats didn't recline because I do not need to see someone's head in front of me because they want to recline. The spaces are ridiculous without someone encroaching on the tiny space you've paid for.", "YTA.  You know the issue occurs. Seats are made to recline and people are allowed to recline them, otherwise why have the recline feature at all? People might have been travelling for ten or fifteen hours already and need to sleep. They may have arthritis or other serious back pain. Not all injuries are visible. You're the inconsiderate one. Let people use the features they've paid for, and pay for the extra leg room that *you* require._", "NTA.  Just because you CAN recline does not mean you should.  The airlines are the biggest assholes, but people who recline are inconsiderate to the people behind them.", "I think airlines need a row or 2 for tall people. If they try and make seats bigger to accommodate heavier passengers they should do the same with taller people. Nah", "NTA.  I feel like economy is a form of hell.  We all must endure the torture given us in the hope of salvation:a quick flight and instant deboarding with all luggage waiting.  Being nasty should give them increased torture.  You did fine.", "NTA. Also I’m obviously in the minority here but I agree with you that reclining is inconsiderate. Everyone may have a right to do it, but does that make it right? I personally never recline because I know I dislike it when the seat in front of me has been pushed even closer to me. I treat others how I wish to be treated. I don’t think people who do recline are assholes or anything, but I think its nice to consider being courteous to the others around you.", "NTA\n\nI’m a firm believer that economy seats should not recline at all, shouldn’t even have the button and hinge. It’s just not okay to take away what little breathing space the person behind you has. And no, you’re not more comfortable for the 11.4 degree slant you’ve now tilted your chair back, don’t try to delude yourself or anyone else by claiming you are.\n\nIf people want to recline they can book a higher class ticket where there’s flatbed reclining seats.", "I want to say NTA, as I've never fully understood people who want to recline \"because they paid for it\". But I do highly recommend you search for seats with more legspace when you fly more than 3 hours. People like to nap. The situation also fully depends on whether you have a day- or night flight in my opinion.   \n\n\nAs someone who unfortunately has to fly often for work, usually short flights, I like to keep my seat up to not be inconsiderate to others. Unless I want to nap (think early morning flight, lots of meetings later that I prefer not to do in a brain-fog).  \nI've flown twice for a long flight (10+ hours) with sort of being the woman who sat in front of you. The first time the person behind me was just very tall (almost 2meters) and I couldn't recline without hurting his knees. I noticed, looked behind me a bit annoyed as I had hoped to catch some sleep but he explained he couldn't help it. I understood and didn't try to recline anymore. It was a dayflight, so I could read or just look outside (never realised how incredibly big the Sahara desert is until I flew over it). Again: it was a dayflight and he coulnd't help his height as much as I can't help mine, which is why I didn't mind. If this was your situation, I strongly vote NTA.  \n\n\nIt changes if your situation was a bit like the second interaction with a tall person I had. The second time I flew through the night and I had run out of vacation days so I had to work the next morning (literally had to log in 2 hours after getting out of the plane, yes it was very tight). The person behind me did everything in their power to prevent me from reclining. Pushing my seat so it was difficult to recline, putting their feet next to the little movie-screen and kicking and pushing there. When I came back from the bathroom they had taken it upon themselves to move my seat back into the upright position. The plane was fully booked, the flight attendants couldn't help me or him. He was a tall man, but I checked and he had just a bit of space between my seat reclined and his knees (not much though, I will admit that). He called me \"extremely selfish and entitled\" for wanting to recline my seat (I was wearing a sleep mask, headphones, and took a hefty dose of melatonin so it was very clear what my intentions were). He was an extreme a-hole and I even heard him complaing (loudly) to the person next to him that \"normally the airline upgrades him for free when he checked in and they saw he was fairly tall\". So he hadn't bought a seat with extra leg space because he wanted that upgrade for free, all the while he knew this would be a potential problem! Again, he had some space left, but not much. Let's say if he put a bigger snack in the little bag in front of him that would've touched his knees.  \nLet's say I had one hell of a night and flight, had multiple stab-y thoughts, and had an extremely hard time staying awake the next day during meetings.", "YTA.  I pay extra for more space because I know I need it.  Yes, the airlines are assholes for making everything so uncomfortable, but that's not your fellow passengers' fault.", "YTA.\n\n>If I'm honest, I feel that people who recline their seats in economy are annoying and inconsiderate, so I didn't exactly bend over backwards to accommodate for her.\n\nWhy is it inconsiderate for people to use the seat as designed??? Your attitude is shite.", "NTA-once I realized that your height was the reason why I couldn’t recline my seat I would have been overly apologetic and embarrassed that I didn’t even think to remember the possibility of a tall person sitting behind me.", "NTA. Tall people have a right to exist in public. The idea there should be an extra tax you're forced to pay, so you aren't in other peoples way is offensive and discriminatory.\n\nIMO if she cant sit up straight without sitting at a slight angle maybe she should buy first class seats instead? Because you had zero problems.", "Hilarious that some people on here will say a fat person needs two seats and then give a tall person a pass for not getting a seat with extra leg room. \n\nKind of an AH. She had a right to recline. Sorry you don’t fit. Short people have to use things design for taller people every moment of every day. Sorry on flights you don’t fit, but won’t pay for more leg room.", "NAH.  The real culprit are the airlines who created seating that gives 6 inches of leg room and reclining seats.  She wanted to recline (as her seat allows) but your legs are too long to fit in the space provided.  She shouldn't have gotten mad at you but the airlines created this mess by trying to cram more seats into their flying tin cans.", "I personally feel like on a plane they should do away  the reclining seats.  Ntah.", "NTA.\nIf you're big you're big.\n\nIt's annoying for other people, but that's economy, you get what you pay for & just pray you're not sat next to a giant, large in width person, or screaming child. It's a gamble, and you don't always win.", "Light yta. She's allowed to recline her seat just like anyone else, she paid for that. You know you're 6'5 and don't fit in the way a normal person would. You knew you were gonna impede someone's ability to recline in economy. If fat people need to pay for 2 seats, you need to pay for business class and get some leg room.", "YTA. I agree that if you have special circumstances that require you to have more than normal space, you need to pay for the extra emergency row. The seat reclined is a normal function of the normal economy seats, so she should’ve been able to use it. It’s not your fault you’re tall, but it’s even less her fault! So I don’t see why she should be the one to suffer for it.", "YTA - And lying to yourself. You are intruding into the space around you by making sure the person in front of you can't recline their seat. They're allowed to do that. You are too big for the seat. Yes, the seats are too f-ing small. I'm stupidly short and sometimes it feels like the seats are too close for me to be comfortable but that doesn't mean you get to punish the people around you. If you don't fit in the seat for whatever reason then you need to buy a seat that you do fit in.", "I'm 6'5\" and 300 lbs, I have just enough space to squeeze in and keep my legs away from the passengers on either side, it's a struggle to bring the tray down sometimes but I keep to myself and not disturb anyone. It's incredibly rude, entitled and honestly maybe even ableist for someone to call you names and and tell you to upgrade your seat just because they can't recline their seat. I have never attempted to recline my seat because you don't know the situation of the person sitting behind you and it's entirely possible to settle in and take a nap with the seat fully erect, even at my size. \n\nNTA, OP. They need an attitude adjustment and a reality check.", "NTA, I am tall (6ft) and I back issues and find that plane seats are very upright which can hurt my back, but if someone behind me was as tall as you I am not gonna crush their knees and make them uncomfortable, just to make myself comfortable..", "I think its weird we have these expectations that bigger people need to pay more for existing. We should focus on the fact that airlines onky cater to the 5'6 150 lb and below humans.", "I think that the airline industry loves it when the passengers blame each other for the uncomfortable seating they packed into the plane.\n\nNo, you are NTA for refusing to make yourself and one or more people uncomfortable to suit someone who doesn't understand that your legs are the length they grew, and that it is the airlines who are the real assholes for cramming people in like sardines.", "INFO: would you be comfortable potentially having to help folks if you were in an exit / wing seat during an accident?\n\nIf so, then I would say going forward, provided you can afford to do so, then it would be best to go for an extra legroom seat (including emergency exit seats). \n\nOtherwise, I would say NTA because you can’t help how small planes are. I’ve been right at the back of the plane with someone reclining and it was awful - and I’m 5ft3!", "NTA. If you recline on a flight without asking the person behind you when you're going to be encroaching on their personal space, you're an asshole. It doesn't matter if it's \"what you paid for\". People can pay others to lobby for shitty laws, does that make them not assholes because \"they paid for it and it's their right\"? \n\nThe arguments pretty much boil down to this: \"I know airlines don't give everyone enough space. There really isn't space for the other person if I recline my seat. But they made the seat able to recline, and I'm more comfortable being reclined, so I'm going to make another person uncomfortable and potentially hurt them for MY comfort and convenience!\" Like....you are an asshole if that's your justification. The acknowledgement that you believe your comfort is worth imposing upon others' and you believe that because an unfair system has made it easier to do that, you're in the clear for doing so. \"It's a nine hour flight and my head falls forward!!\" Get a neck donut. Sleep before your flight. You're imposing on other people, again, for your own convenience and comfort. You chose to fly, stop making it everyone else's problem that you did. \n\nCommunicate with the people you want to impose upon and see if they're willing to help you out as a fellow person who has failings and human desires. Stop acting like a mindless corporate consumer who forgets you're surrounded by a ton of other PEOPLE as opposed to other consumer drones who exist solely in a pre-determined PVP area where comfort is a limited resource that you need to fight over.", "YTA.   Seats recline and she has every right to recline.    If you recline your seat as well it all equals out.  If you sat in a seat like the back row that can't recline, that is your fault for not planning ahead.   If you know you can't fit in a certain seat, plan ahead and choose your seat.  Or pay extra for the privilege of picking a better seat.", "NTA\n4h is not that long tbh. She could have just sat straight up. For longer and/or redeye flights, I think it is ok for everyone to recline anyway, like when the light is out. But for a 4h flight, even if it's at 11pm, i think it too much for reclining protocol. \nImo, for 7 or more flights, best to pay for exit row. \n\nShe is the ahole for accusing you of doing it on purpose.", "NTA - Really it is the airlines who are the real assholes, I am not sure there are many folks who fit comfortably in airline seats.\n\nI am also larger and fly a fair amount and take care not to encroach on the space of passengers next to me. I try to get an exit row if possible but they are not always available or affordable so sometimes you get what you get. You did nothing wrong.", "I never recline the seat. The 1-2 inches doesn’t really help anyway.", "NTA, I don’t see why people need to recline, the seats sitting up seem plenty comfortable enough to me.", "If it is a day flight, don’t recline. Meaning, if the majority of people are not sleeping, don’t recline.\nIf it is an overnight flight and the majority of people are sleeping, recline all you want. \n\nHere, NAH. You weren’t rude. You can’t help being tall. She  (or anyone) also isn’t beholden to use my rule of thumb. Seat overflow is generally more of a lateral issue, not longitudinal. Although, FWIW, use the seat map. Pony up for a little extra room next time.", "I'm going with NTA.\n\nI'm of the opinion that it's only ever appropriate to recline on long haul flights. \nIt was a 4hr flight...\n\nMany airlines have actually disabled reclining on their shorter services now so they don't have to have their flight attendants deal with this bullshit.", "NTA - The seats recline half an inch tops. What good is that actually doing for the person in front?", "NTA. I’m also very tall and having the person in front of me recline and further encroach on my space makes a miserable experience even worse. I don’t say anything to the person in front but do want to just despair every time it happens. I have got off many a flight with bruised knees from the pressure of the seat in front bearing down on them. I also never recline my own seat as I don’t want to cause the person behind me such discomfort.", "NTA. You can’t change your height. Also, the flight was only 4 hours, not 14 or something where people would be expected to sleep during it. If she wanted to sleep that bad, then she can do so without reclining the seat too, it’s not impossible; I should know, I have slept on most flights I’ve been on, but I have never reclined my seat on a plane.", "YTA. I have a bad back and absolutely have to recline my seat when travelling long haul. Being prevented from doing this could take days or more to recover from. Get emergency exit seats so others aren't prevented from getting comfortable.", "NTA - but she is . There was no need for her to be rude", "NTA\n\nYou couldn't help it. It sucks. Like a fat person who oozes under the armrest. It is what it is. At least the fat person can buy two seats... buying two seats wouldn't really help you.\n\n&#x200B;\n\nEveryone who does it on purpose IS the asshole.", "NTA", "I was going to say N-A-H until I saw this:\n\n> I feel that people who recline their seats in economy are annoying and inconsiderate\n\nYTA. People are allowed to recline their seats regardless of what class they fly in, and they are not “annoying and inconsiderate” for doing so. You should pay for a seat with extra leg room or an aisle seat if you are able to do so, otherwise you can discuss the issue with the flight attendant.\n\nI was on the opposite end of this this past weekend on a 9 hour red-eye flight when the man behind me put his hand out to prevent me from reclining my seat, and would push on my seat throughout the flight to try to get more space. I’m sure he was uncomfortable, but so was I. Just pay for the extra leg room if you need it.", "YTA - she paid for a reclining seat, why do you get to say she can’t use it? Complain to the airline that they didn’t accommodate you or pay for a better seat.", "People keep saying if the seat is made to recline you should be allowed to, but I completely disagree with that.\n\nDo you recline your passenger car seat if someone is behind you? No, it would be inconsiderate. Same thing on a plane. The functionality being built in doesn’t mean it isn’t disrespectful to do so if there are others around you impacted by it.", "NTA\nYou didn't choose to be 6'5", "YTA, it's the same problem as a 600 pounder spilling into the seat next to them enveloping some poor petite soul in a mess of fat and BO. That's not what the other passenger paid for, they paid the same price to have the same amenities afforded to you. It's inconsiderate to those around you at the very least if you are too big or  tall to fit in a regular seat. Causing the passenger's seat in front to not recline and work within its specifications, where it would have otherwise due to your legs jutting up against it means you do not fit in the seat correctly. spring for the extra leg room.", "YTA. You ARE encroaching on other people's space. She paid for a seat the can recline. They advertise it. Maybe the person in front is on the second leg of a long journey and needs to sleep. Maybe they have a condition that requires them to recline. If you don't fit it is up to you to sort out a better solution, such as organzing an exit row seat.", "YTA. She had a right to recline her seat. You did not have a right to stop her. The fact your physical size physically stopped her from being comfortable in a seat she paid for is your fault and problem. Shes right you should have paid for extra legroom or asked for you to be moved to accomodate her needs. I hate people like you on planes. You know your huge, why do you all insist on making it everyone elses problem.", "NAH. Being tall is beyond your control. Airlines treat people like cattle and we let them because cheap tickets. I understand the lady in front of you too. She had bad luck but that doesn’t make you an asshole.", "even on a 12 hour overnight flight I don't recline my seat, she needs to learn how to deal\n\nNTA obviously", " *If I'm honest, I feel that people who recline their seats in economy are annoying and inconsiderate, so I didn't exactly bend over backwards to accommodate for her.*\n\nI travel often.  I am sorry, but if I take a 7 hours overnight flight to Europe from America, I will recline my seat, as it is made to do, and sleep for most of the flight.  It's hard enough to sleep on a recline seat, it's almost impossible to sleep on an upright seat.  If the airlines don't want me to recline my seat then they just have to make them fix.  I don't see how it's inconsiderate and annoying to use a seat in the way is designed to be used.  I never get upset if the person in front of me recline their seat.", "YTA. You know you're tall. buy a seat with more space. flying sucks and if the seat reclines, the occupant should be able to use a feature they paid for and be comfortable. A lack of planning on your part shouldn't also make someone else miserable.....", "YTA.\n\nI understand where you are coming from, but it's not your seat, it is their seat. They have the right to recline.  If you need extra room then it is your responsibility to purchase appropriate accommodations (first row, exit tow, extra room).", "YTA get extra leg room or take it up with airlines trying to stuff planes like sardines. If the seat wasn't meant to recline it wouldn't have that feature.", "ESH", "NTA \n\nI think people who recline their seats in economy are selfish arses. I’m 5f 5ins and I find it uncomfortable when someone in front of me does it. I can’t understand why airlines haven’t stopped it, it causes so much aggro", "ESH. You should make sure you get an exit row. She has the right to put her seat back, but on a short flight it’s pointless.", "NTA. I don't care if you paid for a reclining seat, I paid for the amount of room I have. And for people thinking I could have paid for more space, so could you.", "Next time you have uninstalled your legs, clearly you can Mr. Potato Head, NTA, regardless of whether it is a cheap seat or not, nobody can dictate your space, if she wants a seat in which to recline, she must pay an upgrade", "NTA", "YTA. She has every right to recline. You should buy an emergency exit seat.", "Those seats should not recline at all.", "YTA. You know you will uncomfortable and not fit into the seating in the main cabin, you should book yourself extra legroom seats.", "honestly i feel YTA (although i dont feel that's the correct term here either as i get your frustration). \n\nhowever, really i feel the airline is at fault for not providing enough space. i also  feel the person on the flight is NTA either though for reclining. none of us have enough space generally on a plane. and yet we all accept paying the high price tags for them to cram us all in like sardines to maximise their profits, and then blame each other for stuff like this. how is it her fault? she paid for that seat, that reclines...  i think they had a right to recline their seat personally. if they chose not to for your comfort, then i believe they were genuinely being a nice person that has done you a favour and gone above and beyond when they didnt have to do so. i dont think anyone \"likes\" when the person in front reclines. its still the airlines fault for not providing enough space for its passengers and our faults for accepting it as the status quo. same with trains imo. either not big enough or not enough of them to cater for the amount of people using them and yet prices of tickets going up and up every year. \n\nim sure ill be downvoted for my opinion but im being honest. its the airlines fault.. not hers.", "YTA for knowing youve had similar issues in the past and do not attempt to prevent them happening in the future.", "This sub when it's an overweight person encroaching on the person beside them: OMG BUY TWO SEATS FATTIE I CANT BELIEVE YOURE SUCH AN AH!!!\n\nThis sub when it's a tall person encroaching on the person in front of them: oh you poor baby I can't believe they had the audacity to use a function of their seat without groveling at your feet first!\n\n\nYTA, don't like it, upgrade your seat or don't fly.", "YTA\n\nI agree with multiple other people saying the primary issue is the fact he has beef with people reclining in economy.\n\nDude. I get you’re tall, but pick the real enemy here; the airline making you suffer in a tiny ass seat so they can shove more fuckin people on that metal tube. The customer likely paid an egregious amount of money for that seat, even if it’s economy, and the recline function is part of that. \n\nI’m sorry, but for someone who’s that tall, you’re going to run into this issue unless you upgrade your seat. It’s really sad, but that’s the case with airlines right now. I truly understand the irritation, but still, YTA.", "YTA. Unpopular opinion I’m sure, but here is why:\n\nAll these parole are saying N T A because you are tall, and you can’t help it, etc. but you are, in fact, encroaching on her space. She should be able to recline the seat she paid for. And all these people that are giving you a free pass for being tall would ALSO tell a fat person that doesn’t fit in their seat to buy 2 tickets, or buy a first class seat, because it is there responsibility to make sure they purchase enough space to fit themselves appropriately. You don’t need 2 seats, but you do need to make arrangements for appropriate leg room. Which is very do-able with emergency exit or business class+ seats.", "ESH  The woman shouldn't have lowered herself to name calling.  You, because you admit you don't like people who recline their seats and sound a little proud that you made no effort to accommodate her.  I've been in the position of having the person in front of me recline their seat then having the person behind me pull a face when I have to recline my seat to have a tiny bit of room.  \n\nBut the really \"villain\" here are the airlines who have systematically reduced the size of the seats in an effort to increase profits.  Given the fact that the \"reclining seat wars\" are becoming so common the airlines either need to include something about passengers having a right to recline their seat in the preflight lecture OR fix the seats so that they simply can't recline.", "Interesting to compare the comments here to the vitriol fat people get when on planes, with a lot of rage and blame about them not buying 2 seats if anyone around them is slightly uncomfortable. You’re NTA, but maybe people can keep this same energy of blaming either no one or the airline for making such miserably small designs.", "When did using a seat as intended make you an asshole?  Not a comment on OP's chosen knee position but more aimed at the people who automatically assume anyone who reclines their seat is a selfish prick.  This thread is so ridiculous. Can we stop pretending the 2 inches the airline seats recline is that big of an intrusion.  All the seats recline, so if the person in front of you does it and you feel too close, just recline yours, and you get the space back.  It's magic. \n\nYes, airplanes are uncomfortable, and they make things too cramped. Why can't we all just accept that everyone is uncomfortable and just keep our mouths shut and get through it. Instead, we bodyshame and try to make character assessments of complete strangers. Weird.", "Your physical existence doesn't mean you're responsible for the luxury comforts of those around you; if you know that your body dimensions fit within one unit of a product, then you only need to purchase one unit of the product you want.\n\n\nIf you secretly pulled a raccoon out of your pocket and you'd trained it to pickpocket everyone around you on a contained flight, then YTA.  But not for the scenario you've posted.", "YTA, it’s a recurring problem", "Yta", "NAH\n\nI mean you obviously couldn't move your legs without taking others' space and were not doing anything intentionally but at the same time the lady was not wrong too in wanting to recline her seat backwards", "NTA.", "If you can afford the emergency exit seat Def get it, not because it's better for others, but because it's really 1 million times more comfortable. It's basically business class in terms of leg space, and as long legged people, that's all we really care about. Don't do it because she said it, do it for yourself. The lady was rude to accuse you of doing it ok purpose, esp after trying to push back with more force, that's not how that works....big NTA", "NTA reclining your seat in economy makes you a class traitor", "NAH, the AH is the guy who designed planes to be so freaking cramped.  She SHOULD be able to recline her seat and you SHOULD be allowed to sit somewhere without getting your legs crushed.  Travel sucks.  Definitely pay for the seat with more leg room if you can, because it's not really reasonable to buy the regular seat with the expectation of  someone else accommodating you by not doing something that's in fact completely acceptable and reasonable.  The seats recline so that people can recline them.  You're all trapped in the same uncomfortable tin can just trying to get through the next few hours.", "People should be able to recline their seats up to a certain point and that limit was reached here.  You handled it fine and weren't being an AH about it but that lady sure was. NTA", "Definitely NTA. I mostly agree with you about reclining. Sometimes someone needs to recline (overnight flight, back problems, whatever) but I think it’s more polite not to do it.", "NTA - the asshole is the airlines who make seats smaller and smaller. Also those seats barely recline. Who books economy seats for “comfort”. You book them, accept the discomfort and get to where you need to go.", "NORMALLY I would say splurge for a bigger seat or business class but it’s not like you were purposely preventing them from reclining. \n\nWould I be annoyed if I couldn’t recline… yes. I’m small but I will upgrade to business class, economy plus, or exit row because my husband is large. NAH", "NTA.\n\nThese airlines really shouldn't install chairs that recline if they are cramping the plane with seats to make as much money as possible.\n\nI am tall woman myself, and I once had a lady trying to recline in front of me on a european budget airline, it hurt, so I said \"ouch, I am sorry but my knees are in the way, I am afraid this won't work\". She screamed in my face (maskless during covid) that \"it was her right to recline\". I told her again I am sorry but my legs had nowhere else to go. Rest of the flight she kept aggressively forcing her seat to recline with no success and kept giving me dirty looks. I managed to find a way to minimise the hurt she caused for my knees, and was just very thankful this flight was only 2 hours.", "NTA\n\nDo seat recline on a plane? Yes. Should you encroach on your neighbor behind you just because you can? No. \n\nI use the recline just slightly so I'm not sitting straight up but not so much so it bothers the neighbor behind me. And I always make sure my recline isn't bothering them by asking.\n\nIt's common plane courtesy. Just because something is there doesn't mean it should be used.", "NTA. Each seat comes with a certain amount of leg room. Due to his height, he requires all of this space.  When people recline their seats they are infringing upon the space of the person behind them.  Reclining is the AH move unless the person behind you is fine with it.", "NTA the airlines need to make seats that fit the people and not make them recline when there isn’t enough room for them to.", "NTA - I'm only 5'8\" with a 36\" inseam and I am always cramped on flights.", "I think reclining is only really OK on a late night or overnight flight. If you’re flying from like noon to four, just sit up and watch your iPad or read your kindle or whatever you like.", "NTA.  You literally couldn't let them recline. This is like saying AITA for being tall.  \n\nIt was a four hour flight.  I think it's the norm not to recline on short flights.  Between take-off, landing and in-flight service, you don't really have time to snooze.  Most people use their laptops, drink tea/wine, read a book on short flights. \n\nJust make sure you buy exit row seats on any long-haul flights where people are going to be trying to sleep.", "NTA.  I personally find reclining annoying.", "NTA, but everyone here trying to add to the tall tax is totally TA. Short people like to think just because they don’t take up space we can magically change the laws of physics and do the same. You’re not TA simply for being tall.", "NTA. I have a similar problem for similar reasons and my solution is to scream very loudly in pain if the person in front makes a forceful attempt to recline into my legs. Very loudly. There is never a second attempt.", "NTA - airlines have been making cabins more cramped for years - trying to fit more passengers on board. They are the AHs. \n\nYou can't help how tall you are. Plus, I don't know many people these days that feel it's their \"right\" to be able to recline their chairs 3\" (if that) on an already cramped airplane.", "NTA, you can't help being tall while not wanting to encroach on the personal space of others in an already small area. The fact she pushed harder against your knees just to prove some kind of point, I would have told an attendant.", "NTA. I a women so I'm not as tall as you but my dad is and our thighs are almost the same length. When people recline the seat the wire of the basket digs into my nee caps and as the seat bounces when people move it doubly hurts. I pad my nees with the blanket or cushion provided and work very hard at preventing the person in front from recling. First I ask nicely but if hat doesn't work I physically block it with my legs or arms until they give up. I understand ot sucks to have the recling person infront of them chair in their face but I wouldn't hurt someone else to marginally increase my comfort so I don't let people do it to me. Even when I was shorter, I felt that recling, like using other people's leg room is rude.", "YTA. You knew the conditions of you flying on that plane prior to getting on it. You knew the seat would likely be cramped, you knew the seats could recline, you knew you were tall. If you had any issues with this knowledge it's YOUR responsibility to find a solution. Not inconvenience someone else who knew all of this as well and wanted to put their seat back. Anyone who thinks otherwise is entitled AF. Yeah the way they do planes is not fair but a lot of things in life aren't fair and you don't get by on inconveniencing other people because of that.", "YTA - they paid for that seat and are entitled to use all the features. It’s as simple as that.", "NTA. You were passively existing, she was actively reclining. The person who is acting is responsible for the results of their actions.\n\nThe fact that you were physically unable to allow her to recline isn't your fault, and she wouldn't be an AH unless she didn't get snippy over it.", "You're NTA for taking up space but people who recline are not either.  The airlines are assholes for giving everyone so little space.  It's crazy to me that people turn on eachother for actually using the tiny bit of space they are given.", "NTA. If the person in front of you attempts to recline, looks back and sees the situation and proceeds to have negative feelings and/or suggests you spend more of your money to sit elsewhere, they’re an awful person. People who dig into others’ wallets are assholes.", "NAH. Listen, I understand your pain (not personally as I’m average height) as I’ve got bad knees and need the leg room to be able to move myself into many positions so I’m not stuck hobbling when I get off the plane.\n\nI disagree about the reclining seats being rude though. Every flight I’ve been on, the reclining is super minimal and doesn’t truly interfere with anything I’m doing (from perspective of the person in front of me reclining). I don’t think I’ve ever been on a flight where no one around me immediately reclined as soon as they could. Maybe I’ve just never had to sit next to people that the seats weren’t made for size wise.\n\nJust because something irks you doesn’t mean it’s rude. Same for you and for the woman in front of you. It just sucks.", "YTA1 Larger wider people have to pay for seats to accommodate their size, so should you. it’s not your fault your tall, but it isn’t her fault either. She has every right to use the functions on the seat she paid for.", "NTA- short person here- why should you as a tall person not be provided seats to accomodate your height when everyone else can?  Why should you have to pay for extra leg room because your tall?  \nDid the other person expect you to cut off your feet so she could recline?\nNta.", "NTA. Anyone on a plane knows how little space there is. Recliners are assholes.", "NTA\n\n>I should pay extra for an emergency exit seat\n\nMaybe she should buy a seat in front of an emergency exit row so she can recline. But I'm wondering if they even recline. She's a jerk and should've realized you're a human too. If she wanted to recline bad enough she could've switched seats with someone or just not reclined. The shoving with more force is true jerk move.", "NTA", "NTA. It’s not your fault you are tall. You don’t control that. My husband is 6’5 and deals with this regularly on flights. Some lady actually started smashing herself back against her seat repeatedly trying to get it to recline which just kept smashing into his poor knees.", "In this case, NTA. Idk what she wanted you to do. Your knees were literally at her back. Not like you can throw them over your shoulders...", "YTA", "NTA. I'm 6'4\". When someone in front of me tries to recline I'll shove the chair back forward before they can let go of the button. I'm 6'4\" and 300lbs, if they want to fight about it, I'm game.", "Lol NTA. You're not doing ANYTHING on purpose. She can give you the stink eye all she wants, it's something everyone is aware can be a possibility when going on a flight. \n\nFrankly she was trying tp recline and forcefully, indicating if she hurt you she wouldn't have cared so long as she got what she wanted. That's the real ah move.", "yta - people who are too big for the seat (whether wide or tall) need to pay for a seat that can accommodate them.", "YTA.\n\nIf the seats recline, they are allowed to recline them.  It is your job to make sure you accommodate your own needs.  If your height prevents others from using the product they purchased to use, then you need to be somewhere else.", "NTA. \nI also have long legs and fitting them into leg spaces can be difficult af. You can't just take them off and put them in the over head compartment.\nShe's a bit of an asshole for giving you a dirty look and accusing you of not moving to annoy her. Where were you supposed to move them? Encroach on the people beside you for 4 hours? \nShe should be happy you're not a seat kicking 5 year old or crying baby smh.", "NTA. If you recline your seat on a cramped plane without asking the person behind you first you’re an asshole.", "HMMM, i'm honestly split. \n\nI wouldnt have thought you were the AH, but then again, I'm a firm believer that very overweight people who take up more than one seat should buy two.  I dont have a good reason to think that quite tall people who take up more than their fair share of room shouldnt also have to buy extra space.", "A better solution would be if the recline function had seats that slid forward. The seat back would no longer encroach on the passenger behind, and would only be limited by the size of the person reclining.", "NTA. She handled your request really poorly. \n\nI would reconsider your travel strategy. If you’re able to tolerate a couple hours in economy, cool. For longer flights, you might consider paying extra for more leg room.", "NTA... People who recline when it's not an overnight flight are selfish AHs", "YTA for your comment about people reclining their seats.  People have the right to want to recline their seats, economy or no, and you’re an AH for thinking that this makes someone an AH.", "This is clearly an unpopular opinion but I do think YTA. If someone wants to recline on a 4 hour flight then they should be able to. They also paid for the seats. Just like I would say an obese person would be inconsiderate if they expect the person next to them to just let half of their body be on the other passengers seat. I know it’s not your fault at all so I’m not saying YTA intentionally. But it was just a tough situation for everyone.", "The real dick move in economy is anything that interferes with your fellow passenger chances of falling asleep or worse that wakes someone up.\n\nI fly all the time most people are assholes on planes even if they aren’t otherwise. Using the features of the seat you paid for doesn’t make you an asshole.\n\nAirlines suck, not paying more for a seat shouldn’t be required, so not get an exit seat or something doesn’t makes you an AH. \n\nI would say the person in front who can’t recline does have every right to be frustrated. Being politely frustrated is no issues. \n\nSo in summary, flying economy sucks balls. The person who knowingly made a seat choice that would deny someone the ability to recline is closer to an AH then the person frustrated by it, assuming everyone is generally polite about dealing with the reality of a shitty situation. But again if everyone is generally courteous NAH.\n\nNow for the Rant:\n\nI’d much rather have someone recline the seat in front of me then try to use a laptop in a middle seat where they definitely have to dig their elbows into the people next to them to fit. Half the time a 13 inch laptop barely fits in a basic economy seat nowadays. \n\nI’d also much rather have the person in the window and middle recline and sleep. Literally my last international flight, computer McGee middle seat asked me to get up 4 times in a sub 7 hour flight. I sit in the aisle so I can get up and not once did he go while I was already up.\n\nPersonally I’ve never had an issue with someone reclining the seats. They barely recline anymore anyway. Even before they recline I’m to tall to sleep leaning forward on the tray table. Like yeah it’s annoying there seat is closer but I’ve literally never seen a reclined seat touch the chest of a person sitting back in their own seat.\n\nI may not be overly tall, still above average, but I do have broad shoulders and have been fairly heavy at points in my life. Never once has a reclined seat touched me in my seat. Kept me from getting up, or stopped me from using my tray table. It does make using a laptop impossible, but like news flash it’s impossible to use a laptop on a basic economy seat without being an asshole to anyone you share an armrest with as you almost certainly got to elbow an inch over the arm rest to use it. So  computer users are basically doing a constant moving elbow knead massage to the person next to you: how blissful.\n\nMy theory based on personal experience is there is a ton of overlap in the ven-diagram of no recline people and economy laptop users. In large part because that’s what reclining really makes impossible. Thus for the people in the overlap, the sense of superiority is ridiculous. I mention the computer because I’ve frequently been by a member of team no recline that only hates it because then they can’t get out their laptop to elbow other people for however many hours. \n\nIf you need to work on a flight, that’s literally the purpose of business class. If you hate reclining you can get seat by the steward staging area or other parts of the plane where it can’t impact you. Check a service like seatgurus if you are that particular.\n\nThinking people are assholes for reclining on any flight where they shut off the cabin lighting is particularly ridiculous.\n\nBasically my position is the no-recline crew sucks for expecting everyone else to conform to their belief system. \n\nIf you are in camp no recline so you can bang away on a laptop, YTA. If no recline because tall like your situation, it’s just a shitty situation, but it is important to recognize you are the only person who knowingly got the opportunity to make a decision to be be in the situation so you are closer to being an asshole than someone who is politely frustrated they can’t recline because you are tall.\n\nIn conclusion people who use laptops in economy are the real assholes.", "INFO: Do you recline your seat?\n\nFYI: international flights often account for reclining, since the assumption is that passengers will sleep. This is why seats can feel cramped while upright. **The expectation is to recline.** Reclining is a feature.", "NAH except the airline. i’m 5’4 and it still encroaches on my space when people recline the seat. they shouldn’t design them like that; bigger people shouldn’t have to pay more for a seat just to be able to fly.", "NTA I had this last year when a woman shouted at me for not letting her recline when it was already crushing my knees. I said unfortunately I couldn’t remove my legs so she could recline but she was more than welcome to ask to move, she then told me I should be the one to move since I was causing an inconvenience 😂", "My husband was 6'8\" or 2 meters tall. I always paid extra for exit row or bulkhead seats for him, or premium economy, or if feasible, business class because his comfort was important to me. I don't know how someone 6'5\" can even fit in regular economy.", "NTA\n\nI wish they'd get rid of reclining seats all together.", "NTA. Honestly, at this point, the airlines shouldn't even offer reclining seats as an option (or, you know, configure planes with fewer seats, spaced appropriately for human beings of normal dimensions).", "I fly twice a week for work I think there are unspoken rules when flying do not recline your seat ever regardless how tall someone is it still encroaches on their limited space, Shouldn’t recline at all imo. Whoever is sat in the middle of three seats gets both armrests, if you’re a family and need seats together book them when booking your flight don’t board expecting people to move for you who might have paid extra for that seat.", "YTA, but if we’re honest, airlines robbing us of all spaces are the real culprit. \n\nBut look, it is what it is. The seats are designed to recline. She’s allowed to recline it. If you don’t fit (again, airlines screwing us all is the real issue), you can get a seat with more leg room. \n\nSo light YTA, mostly based on your attitude about reclining.", "NTA. Airlines are assholes for still allowing seats to recline!!!", "YTA", "NTA - the person in front of you is, though. It's not like you could magically make your legs shorter. And it is super rude to recline your seat on a cramped flight. People can be so entitled.", "The only asshole here is the airline", ">I feel that people who recline their seats in economy are annoying and inconsiderate\n\nWhat a ridiculous take.  If the seat reclines, then that's their space to do so.  Your beef is with the airline.\n\n>Should I pay extra for seats with more leg room so that people in front of me can recline even though this is not always a problem?\n\nYou should complain to the airline, but let's be real, they won't fix this.  So yes, just like the morbidly obese person who makes the person next to them uncomfortable, you should pay extra to accommodate your needs when you know beforehand that this is going to be an issue.\n\nYTA for your attitude about people who want to use the recline feature of the seat they paid for, but the airlines are the true AH here for using planes the with smallest legroom possible to cram more people into it.", "NTA I think people who recline are assholes. I was putting my laptop under my seat (yes before takeoff) when the guy in front of me nearly took me out reclining his seat.", "Oh goodness, NTA\n\nPlane seats shouldn't recline. They need to take that feature away completely.", "Noo tall lady here whose knee got destroyed by an aircraft trolley. This is not a solution to sit in the aisle seat.", "I prefer aisle seats being 6’4 and usually sit at an angle, however my aisle leg usually sits outside the seat boundary. More times than not, the drink cart hits my knee with a great amount of force.", "NTA As a frequent traveller on 14 hour flights and short enough that I can stretch my legs out in economy, I will say that people who recline are assholes. Someone almost snapped my laptop because it was on the tray table and I had to slam it shut before they reclined. I don’t know why you’d design them that way but honestly, between being kicked by kids behind and having a seat slammed into my face if I try to lean forward to stretch my back, there’s never a time where reclining is more comfortable than the inconvenience they cause. I also have to shimmy and hop to get out for the bathroom when the seat is reclined. All Recliners are Assholes (ARAH).\n\nEdit: Clarity, those who recline immediately to the fullest extent. You can recline a tiny bit for a small gain and limited inconvenience and this works out much more favourably for all.", "But she paid for her seat too.  And the seat she paid for includes the area where her seat reclines.  I don't like it either when the person in front of me fully reclines, but that isn't actually my space.  Yes, it's all of the airlines' fault for squeezing too many rows into each plane--That doesn't make the other woman the asshole at all though.", "This comes up regularly and the real answer is it's the airlines who are TA, but as a similarly tall guy (6'3\"), sorry, but in this case YTA.  If the person in front of the person in front of OP reclined, the person in front of OP is now royally screwed, and not able to use space she *paid* for.  OP is also wrong - if you scoot your butt all the way to the back of the seat and slide your feet under the seat in front of you, you absolutely can put your legs in a position that doesn't spread to your neighbors and lets the seat in front of you recline.  Yes, it sucks, but I've had to do it on 15 hour flights, so OP, you need to suck it up, buttercup.  You are the one who didn't check for extra leg room, that's on you, not the person in front of you.", "And she paid for her seat that can recline. \n\nOP needs to bitch about the airline; not another fellow customer using the available recliner option.", "I notice that short people expect the rest of us to help them get their bags into the overhead bin;  why is it \"all for one\" during boarding, but as soon as you're on the plane, it's \"jam your seat back no matter what?\"\n\nTo be fair, most people don't recline.  And lots of us check bags rather than try to jam one more thing into the overhead bins.\n\nAnd, honestly, dude should probably have paid a little extra for the emergency row (only occasionally available) if he's really that tall and knew it'd be a problem and didn't bother to check availability.", "NTA- Unpopular opinion but reclining the seat full back is just rude these days. The lack of space between seats these days is appalling. I'll try to get one with more leg room but it's not always possible. I always get an aisle seat but then I am in the way of the attendants and others going to the restroom. If the person in front reclines to the fullest, I have to splay my legs to even fit in the seat which means I intrude on my seat mates space.", "As a frequent traveler there are two aspects of reclining the seat.\n\n1) I can’t sleep otherwise, head falls forward and not backward\n2) It can result in the squeeze where the person in front of me has reclined and I have not.\n\nThat said - having a tall person behind you mean you are screwed and you deal with it. I wouldn’t call that person an A-hole.", "NTA.    \n\n\nTaking more comfort by impeding upon anothers comfort is absolutely annoying, inconsiderate, and being the dick.    \n\n\nIf I turn the heat up to 72 degrees because I like it warmer, putting my roommate who is comfortable around 67 in an uncomfortable spot.  I have prioritized my comfort over anothers.  I am the dick, I am the AH, I am the problem.  Just as if they prioritized 67 over my 72.  \n\n\nThe fact that the airline is small is just how it is.  What you choose to do on it to others is wholly your responsibility and accountability.  So, we both vibe at 69 (Nice) and are only mildly uncomfortable.", "The woman acted like an asshole? how is she not an asshole? You berate strangers for their body you are an asshole", "NAH, and agree that the airline is to blame.", "Just because they are tall, doesn’t mean they should have to pay extra. I don’t think being tall is a disability, but it’s not the tall person’s fault they were born tall. Tall people have to suffer bending over in the USA for ADA requirements for things like ATMs and drinking fountains. I’m not comparing being in a wheel chair to being tall, but in both cases it’s not the fault of the person.\n\nEdit to add: I have a bad back so bending over for things that are placed to be more accessible is a challenge at times. My back is hurting this morning so I am a little more crotchety. I’m all for the ADA though even if it doesn’t benefit me personally.", "I'm confused though why OP wouldn't even ask if there are any (free) spare emergency row seats available, once they're on the plane. \n\nThey say \"I don't mind being uncomfortable\", but in not investigating this possibility they're also making someone else's trip less comfortable.", "People who recline are TA.", "No one is truly comfortable in today's airplanes riding economy and that's because of the greed within every airline....\nProfit over Passengers so they made sure to take every single square inch of these planes to squeeze seats in...\nOP paid for his ticket also but yet, He can't get comfortable but can care less about his situation...\nSmh..", "Yeah, I agree here. Everyone's trying to make their own travel as bearable as possible. In an ideal world there'd be enough space between rows to let people recline in comfort.", "It is inconsiderate as you are not showing consideration. The airlines have made seats that when reclined reduce the comfort of people behind you, making it your moral imperative to decide on whether to put your comfort above others. You are \\*allowed\\* to, it does however make you inconsiderate.", "Last time someone reclined their seat in front of me, it spilled my drink and crushed my tablet. My face was also only inches away from this lady's poofy hair (I'm only 6' 2”) for three hours. Just because you technically can doesn't mean you're not an asshole. We can blame the airline, but this is the reality we have to deal with.", "The lady in front wasn’t an AH for trying to recline her seat, but she WAS an AH for being rude with the OP when she realized she couldn’t recline.", ">But reclining seats is a feature, and the passenger in front has every \"right\" to do that.\n\nLet's be real here, it's a \"feature\" that isn't actually a feature because airlines fucking suck. What it is is false advertising by the airlines.", "Did you actually just compare being fat to being tall? Hahahahahaha", "That’s like saying they should allow smoking on a plane because they allow inhalers. Asthma can’t be controlled but a smoking addiction can", "Hahaha - something you literally can control comparing to something you can’t. Genius.", "Being overweight is a choice and a lifestyle issue. Being tall is not something you can change. They are not remotely comparable.\n\nThat said, my vote is ESH. The woman is an AH for her behavior. The OP is an AH for knowing this is an ongoing problem and making zero effort to address it like booking bulkhead or emergency row seats, and the airlines are AHs for having such cramped coach designs with reclining seats in the first place.", "You can go on a diet to lose weight, you can't lose height. It's not a great comparison.", "so why didn't OP do this and you recommend he do this? He knows he's tall....", "She paid for a seat that she fits in “comfortably”. A seat that is designed to recline. The reason the seat isn’t working properly is because of OP not her. \n\nI’d counter you saying she should buy a first class ticket by saying maybe it’s OP who should be paying for more leg room.", "The only time I've seen it used well is on night flights where everyone has there seat reclined\n\nOtherwise all I've seen it do is piss the person behind off no matter how tall they are", "I’ve actually been on a plane with non-reclinable seats", "My husband is also 6' 6\" and after years of suffering \"coach\" he now flys firstclass AND tries to always book row 1 for the extra legroom. Before realizing we could afford first class, we'd always try to book emergency row seats or the bulkhead row.", "Most airplanes have reclining seats and if the person in front of me used it (in economy) I’d absolutely think they were an AH. They don’t NEED to recline and sure, we all would love to, but as you pointed out, there’s already not enough room in economy as it is. So people choosing to recline into an already tight space is an AH.", "You literally gain minimal comfort reclining vs not reclining but completely encroach on someone else's space and make them much less comfortable. Congrats on being an AH", "I agree. Not only that, this is not the first time this has happened. He routinely doesn’t let people recline their seats but only sometimes they complain. And he does not look to buy a seat with extra legroom even though this happens regularly.", "I really don't understand all these NTA ones. If he were overweight he would be expected to pay for 2 seats. So he has room to move. In this case him being tall he should get the emergency row or any row that has more legg room. \n\nInstead he doesn't let people, who paid the same money for their ticket to recline their seat. While he probably will be reclining his own seat", "I agree. I was with him until about halfway and then it was clear YTA. If this was a fat person they would have been ripped apart in these comments. He knows he is making others uncomfortable and he really doesn’t care. It’s one thing if he can’t afford economy select or there are no seats available. However these are the types of people that extra leg room seats were made for. Just because he doesn’t think people in economy should decline even on long flights (wtf) doesn’t make it so. We", ">This is part of what everyone pays for in their ticket.\n\nC'mon man, it's not what people pay for, people pay for the trip. Reclining seats is false advertising because it requires that you know that the person behind you will be short enough to allow your seat to recline. It's a deliberate choice by the airlines to build seats this way to cram more people in, and you cannot blame anyone who is tall for thinking that people trying to recline in economy are assholes.", "Agreed. As a short person basically all of the world is not made to fit me. If I resented everyone around me for whom public use items are made to fit and tried to force my own comfort it would make me a huge pain in the ass.", "Yeah, no.", "Give me a break. If you were sitting in the passenger seat of a small car and your grandma was in the back are you going to say “hey grandma! Fuck you, I’m gonna recline because I can”? No, you wouldn’t. It’s only because it’s a stranger behind you that apparently being a prick is ok. OP is squarely NTA.", "But the tall person has the option to recline or “encroach the space” another has paid for as well.\n\nIn this situation, the lady:1) paid for her small seat; and 2) the functionality to recline. Lady got her seat but cannot recline.\n\nTall guy (OP) also: 1) paid for his small seat; and 2) the ability to recline. So even though he is cramped, he got his seat. And presuming the person behind him is much shorter, he also has the ability to recline.\n\nSo really, he got both things while the lady only received one. Op isn’t an asshole but I don’t think the lady is either. The only asshole is the airline. I hate how much they squeeze people. Economy was doable back in the day. But now, it’s hell. So I feel for everybody in this situation.", "So you would recline your seat in a small car with your grandma sitting in the back because “fuck grandma! It’s my RIGHT to recline my seat!” What a shitty take.", "Because if you actually fly and know the limited space allowed you give consideration to your fellow passengers. Honestly just because you can recline doesn’t mean you should. You are all in a small space be respectful.", "So if your in the backseat of a car and the passenger reclines all the way, they’re not an asshole? I mean the seat was being used as designed.\n\nThe functionality was built for plane seats to recline. That does not mean 100% of circumstances it is acceptable to. \n\nHonestly they just shouldn’t allow them to recline anymore because people are incapable of nuanced thought and think it’s acceptable to do it 100% of the time because an extremely generic version of a seat is made to recline.", "Why shouldn't OP buy a better seat instead?", "I agree, only short people and rich people should be allowed to fly.\n\nNo heighties on my planes!", "I get what you are intending to say, but the \"you are intruding into the space around you by making sure the person on front of you can't recline\" isn't exactly a good statement. The whole point of why he is upset is because someone reclining their seat intrudes into his already small space. They are leaning back into him.", "yeah, it's sad that seat size is tightly built around an assumed average airline passenger. If you know you don't fit that profile - unfortunately you're the one who can predict the issue and not the airline.", "Here’s a thought, you can pay extra instead of forcing other people to.", "If you really need your sleep on the flight and can’t without reclining the why wouldn’t you pay more money and get a seat you can sprawl out on?", "Bingo. I don’t think it’s rude the recline your seat. Especially if this scenario has happened a few times before, OP needs to think about buying emergency exit seats with more leg room to be considerate of other passengers. Does it suck to have to do something extra so that others are comfortable? Yes. But you got handed a tall card in life, and you just have to deal with it.", "Do you recline a seat in a small car with your grandma in the back? No? Didn’t think so. The only reason you think it’s acceptable on a plane is because it’s a stranger and strangers can fuck themselves, am I right??", "Never mind that reclining like that intrudes into someone else's space and is very uncomfortable.\n\nTbh, short haul flights should do away with them. Too many people with more entitlement than consideration are just assholes with them because \"well I paid for it and I really don't care that you also paid for  seat\".", "If you want to recline YOU can buy upgraded tickets too. I paid for the space I got.", "What? I'm 5'6\", I fly a lot, and I've never been able to stretch my legs under the seat. One, because my carry-on is under the seat, and two, because the seat in front of me is so close that I *have* to bend my legs. It's delusional to thinking someone a foot taller than me could get anywhere near that", "Downvote all you want, but you guys are the entitled ones, not me.", "Why? Her seat already reclines.", "Even more interesting if you compare it to this 3 year old post. https://www.reddit.com/r/AmItheAsshole/comments/clkq3j/aita_for_stopping_entitled_recliners_from_eating/", "I agree the lady was rude but it sounds like she wasn't able to recline at all. I have a bad knee from hockey and reclining helps me stretch it out so it doesn't get sore. If I was in front of this guy I wouldn't be happy either", "That sounds horrible! Why did you tell me this 😂 this is nightmare fuel! I love my knees!", "Your knee okay? Hope it gets better soon🤞", "I am 6’5” and I got really lucky that the flight attendant tapped me on the shoulder to warn me the trolley was coming before she took out my knee. 3 days ago, return flight tomorrow, booked a window. Fuck it. 4 hour flight", "There’s a difference between reclining into someone’s space and reclining into someone’s BODY. A shorter person is losing leg room, sure, but where TF is someone supposed to put their whole-ass legs? The other woman is an AH if she cannot understand the difference between limbs and open space.", "No, you don’t “pay for space to recline” also. That is the person behind you’d space, as indicated by the tray, tv and other amenities offered on the back of a seat. \n\nIf she wanted spacious room to recline she should’ve paid for a first class seat or an exit row seat  where she had the space to. In all honesty they should just remove the reclining feature from most economy seats, the people at the back row can’t recline as they are back against the wall that’s pretty much the bathrooms so your point is kind of moot depending on where you are in the plane", "That doesn’t give her the right to be ass and try to force her seat into op legs. She was being shitty and entitled. Recliner seats need to be fully removed because they cause more problems then they are worth.", "This right here. She paid for a reclining seat...he paid for a seat that shouldn't be too small to accommodate a normal sized person. The problem is with the airlines, who continue to shrink seat sizes in spite of a population that is increasing in height and weight.", ">And she paid for her seat that can recline. \n\nOP also paid for his seat that can let him put his legs without invading nearby passengers' space. \n\nThey both paid for the same type of seat, she had no higher ground here. \n\nAnd OP wasn't the one bitching though, it was the reclining woman who bitched about it to the point of OP doubting himself and come here for outside opinions. Love how your mental gymnastics completely flipped what actually happened and blamed it on OP.\n\nAt first, both were innocent and the airlines was the only one to blame. Then the woman made herself the AH by dumping it on a fellow passenger.", "This may be controversial, but I think reclining gives a way bigger disadvantage to the person behind you as compared to the advantage you get by doing it. I won’t go as far as to say people who recline are AHs but I do wish the seats just didn’t recline at all", "I like to do a half recline if I need the space. If it’s an overnight long flight it’s much more acceptable to fully recline.", "Nope. It is not. You paid for a seat and a seat reclines. But nothing you can do about it if the person behind you is tall. They can’t help it either. Airlines suck.", "The seats in the back row can’t recline, which means the row in front of them can’t recline without laying down in their lap, which means its rude for them to try. Which means the row in front of them shouldn’t, either; all the way up to the first row. So generally nobody in economy class should be in a hurry to recline.", "I hi k it depends on the flight. Short flight during the daytime? Yeah if you recline you’re an asshole. Long flight or overnight? Recline that’s fine. \n\nJust my opinion though.", "No, you're supposed to recline, that's why they make reclining seats.\n\n&#x200B;\n\nIt is bad to do it during meals.", "I’d say soft AH if you recline the seat, but more blame falls onto the airlines.  If you recline your seat now the person behind you has no where to eat, drink, put their laptop/electronics because the table won’t sit at an appropriate height, you’ve also got a seat inches from your body in front of you, and generally just eliminates any semblance of personal space you might have on a plane. HOWEVER a lot of that blame falls on airlines for putting more and more seats in planes! Honestly with how tight plans seating has gotten I think they need to just remove the recline feature.", "It's one of the most commonly debated subjects on the internet with no clear conclusion aside from \"the airlines are run by greedy fucks\"", "It is cuz people who do are genuinely assholes.. the person infront of me reclined his chair while I had food and hot drink on my table and I thank the God's my husband was holding our child at the time far away from me.\n\nNow imagine hot drink and all of your food all over you. \n\nI also saw one poor guy have his laptop broken cuz a person reclined a seat. Normally it's fine to do so if you ask, but a lot of people don't give a shit and then those things happen 🤷‍♀️", "At this point, airline seats are poorly designed for anyone larger than the average American 10 year old.", "Eh, she's an asshole. She called him an asshole.", "I think the problem with this lady is that she said he was doing it on purpose, even after he explained he couldn't help it.", "I agree with this 💯 and want to add a third point. I have been traveling with my daughter for two years now and when she naps, I recline the seat so she is more comfortable and we have a bit more space being two of us. (She just turned two, yes she has her own seat but she likes being held when falling asleep especially not in her own bed).\n\nEdited to add the airlines have definitely made the spacing between the seats all around smaller. All they think about is the bottom 💸💸💸\n\nOP NAH. She should have been more understanding and you can’t help that you are tall or that the spacing is small between seats.", "For issue 1, turn a neck pillow round so that it supports your chin.", "The problem is that larger seats means more expensive flights. Which is why people have the option to purchase larger seats if they need them.", "There are never any available seats in emergency rows or whatever comfort plus the airline offers because they will always bump others into those seats, usually based on frequency of travel. My husband is 6'6\" so we've asked. And repeatedly been told it will never happen just because he's tall and we asked nicely. Those are perks given out based on monetary factors alone.", ">They say \"I don't mind being uncomfortable\",\n\nI mean they're also saying this and then making an entire post complaining about how much they mind being uncomfortable...", "How so? Isn’t the airline the asshole for giving you tinier and tinier space? I don’t care if people recline in front of me I can barely tell the difference. TA are people who can’t tolerate anything others do that mildly inconvenience them. It’s okay to use your brain cells, if the guy behind you can’t physically let you recline then don’t recline. If not, then it’s okay to recline.", "> We can blame the airline\n\nPerhaps airlines will start creating seats that no longer recline that we can stop blaming them. /s", "This happened to me once with assholes who had booked the window and aisle in the hopes that no one booked the center. I was in the center behind the empty seat and they reclined the empty seat as soon as we could without any warning, which I clearly never expected, spilling my drink all over me and the person next to me. I got a yelling lecture about how they were allowed to recline the seat instead of an apology.  I’ve never found that people who insist on reclining are very empathetic or emotionally intelligent", "Should the lady in front be forced to sit between her fully upright seat and the reclined seat of the person in front of her, or should she be allowed to in turn prevent that person from reclining?", "Both are unpreventable to change in the moment, it’s an apt comparison", "Youre missing the point entirely lol.", "His legs were in his space and he was fine with it. Not having room to move them so the seat ahead of him could recline isn't OP's problem.", "Depending on the length of your legs, they may not angle to go under the seat in front. He is tall enough that his knees automatically touch the seat in front of him. No one is entitled to recline their seat.\n\nThe space is a shared space, but I think that a person has more “right” to the space in front of them than behind them. Your tray is typically on the back of the seat in front of you and no one would suggest that tray belongs to the person on whose seat it is mounted. Also, you put your stuff under the seat in front of you, not under your own. \n\nIt’s bad luck all around. In his position I would try very hard to get an exit row.", "No, the airline is the AH for shrinking the size of the seats over and over and over again until there is no way to be comfortable.", "Agree completely. I was on a flight last month, and the woman next to me asked if I would be willing to switch seats with her friend who was directly behind me. I didn’t really want to move but agreed to the swap. Shortly after the flight attendant made the announcement, these two fully reclined their seats, knocking my iPad on the tray table over in the process. I’m only 5’6” and not a big person, but I felt very squished and resentful that I agreed to switch for the entire flight.", "You may think no one needs to, but I have four slipped disks. If I sit up that straight for more than take off and landing, I’ll be in excruciating pain and struggle to walk after. We all have our reasons.", "It depends. I have no issue if people want to recline on red eye flights. If you're that tall and have issues with people reclining on such long flights, please just do the polite thing and book a seat with extra leg room if possible.", "What happens when the person IN FRONT of that person reclines their seat?  and FYI people with back and hip problems do oftimes to have to recline their seats?   The airlines need to either design specific \"recline\" sections with more room OR fix the seats so none recline.", "Reclining your seat makes you an asshole? In this case, cursing and getting mad at the tall guy for something he had no control over(his height) makes them an asshole, but reclining your seat is a privilege that you pay for when you're paying for your ticket, and does not make you an AH.", "You don't know if they need to or not. Some of us have spinal problems.", "Completely agree. The recline feature is minimal as the recliner.  It does not do anything significant for the person reclining, but it absolutely makes a difference to the person behind you.  I never recline, and I feel people that do are AH.", "[deleted]", "\"While he probably will be reclining his own seat\"\n\nI think that's highly unlikely. Myself and every other tall (over 6' or so) person I know that I've talked about this issue with never recline themselves because they consider it an AH move. Short people don't. Its just how it is.", "Well, downvotes be dammed but... obesity vs height: one of those is controllable.", "He buys his seat *knowing* that the person in front of him won't be able to recline. I have a bad knee from hockey and I need to recline sometimes to stretch it out. If his grandma was in front of him and he purposely sat behind her so she couldn't recline and relive the pressure from her knees is he now the AH?", "> he also has the ability to recline.\n\nYeah but noone except complete assholes actually recline their seat.", "People vary so wildly on this! I’m 5’3” and never recline cause I’d feel bad for the person behind me even though people recline into me. I just can’t do it. \n\nNTA in particular cause of her attitude, but also cause OP is really only responsible for fitting in his seat (which he does), not ensuring the people around him can recline into that space. If there’s a medical concern, call a flight attendant to see what can be done.", "Nonsensical extrapolation.", "Um, because the seats can recline, but he can't shrink his legs?", "If your knees are touching the seat in front of you, you don't fit.", "No, and frankly shocked by so many NTA here. He can’t control his proportions, but he lived with them his whole life, they’re not a surprise. \n\nESH including the airline as the biggest bad of course, but she paid for a seat that reclines. If another passenger prevents her from reclining, they’re encroaching on her space, it doesn’t matter which side it’s from. If you have problems with reclining, petition airlines not to have recline seats, not blame passengers for using functionality that is there for their use. That said, she should have called a flight attendant instead of starting a fight with him. OP is definitely the AH for presuming people shouldn’t recline. And yes, just like people of any bigger proportions, should consider looking for seats that would be more comfortable for his stature, without impacting anyone else’s comfort.", "But i did pay for my seat and the right to recline. Plane tickets are expensive and other peoples uncomfort is not my problem. Although mines not theres either. But until the airlines change it im not spending 4hrs uncomfortable so someone iv never met or will meet is comfortable for 4hrs. That called being a push over. The airline should move him to somewhere else if hes not comfy.", "I usually put my carry-on under my knees so give my thighs extra support and well as to let me stretch my legs out fully.\n\nSuper nice, flight attendants aren't the biggest fan of it as technically the carryon needs to be under the seat, but most don't comment", "Yea but that's what happens when people bargain hunt flights at the cheapest airlines in the cheapest seats. It's not worth the discomfort.", "I'm also a tall lady. 5'9'' but mostly leg so my inseam is the same as my >6' dad and brother. The aisle seat still works but you gotta be *paranoid*. The day you forget to pay attention and the trolley smashes into your knee, you learn your lesson right quick!!\n\n(I still always get aisle seats because on longer transatlantic flights companies have taken to charging absurd amounts for exit rows.)", "Lol it was bruised for a while won't make that mistake again but all good now", "Maybe she needed to recline for other reasons. Similar to reasons OP can’t cope with someone reclining their seat an inch.\n\nThe seat she paid for reclines. She can do that. Why should she not be able to just because the guy behind her has long legs?\n\nComplain to the airline if you want them to make more room for tall people.", "OP isn’t a normal-sized person though? Even if the seats were built for the average person, OP’s legs would still be in the way of the seat reclining.", "That may be true but if the person behind is 6'5 and the planes are not built like they built them in the 80's and 90's with more room then what?..\n\nI mean.... You are aware the at times ppl purchase tickets and don't even get to board the plane... They are offered a refund with an upgrade to a diff flight...\nReclining Lady needs to deal with the inconvenience of flying like every other economy flyer...", "She used a function on her seat she paid for. \n\nAgain, if you have a problem with recline seats on planes complain to the airline. \n\nThis complaint is as old as the hill.", "It's viewed that rudely? I always recline because of joint issues. If I don't, my back is screwed for at least a week best case. Worst case, my wheelchair is needed till I recover. If I recline I can adjust enough to reduce the risk notably.", "I don't fly often, but that's also how I feel about airline seats. When I have attempted to recline a seat, I never felt a noticeable difference. But when a seat is reclined back towards me, it feels like I've lost inches of space. Especially if I have my tray down. And I have the advantage of being shorter.", "I am a frequent flyer and consider that reclining, without asking the person behind first and accepting a refusal, is an AH move.  \nIf someone recline without asking first, i instantly lose all respect for them and consider they have no issue with me getting the laptop out and start typing for the whole flight making their sit jump up and down in the process (lets say my keyboard typing is not gentle).", ">I think reclining gives a way bigger disadvantage to the person behind you as compared to the advantage you get by doing it.\n\nI suspect you don't have a back injury.\n\nReclining even a couple inches is ESSENTIAL for a lot of people. Personally, it's the difference between being able to comfortably walk off the plane myself or needing help from my partner because I'm in pain. \n\n>I do wish the seats just didn’t recline at all\n\nI definitely don't if they stay shaped the way they currently are! They are not ergonomic at all.\n\nI can sit upright in an office chair all day with zero issues. But a couple hours upright in a plane seat would be excruciating.", "100% - I can barely feel that my own seat is reclined, but if the person in front of my reclines, it changed my whole situation! I fly a lot and find that most people don’t recline. NAH except airlines!!", "Yes, they do, at least in most European airlines + Air Canada, which are the ones I take the most often. I always try to seat in the last row and it's great because I can recline without bothering anyone.", "> The seats in the back row can’t recline\n\nI've had to take about 20 flights this year so far, sometimes hundreds in years past. I cannot remember the last time I was on a plane where the back row doesn't recline. How do I know? If I am flying economy, I always book the back row when I can, because I hate having my seat kicked.", "I swear, this question is like a litmus test for egocentric people.\n\nThe airline sells the same space twice, to the person in front as space for their seat to recline into, and to the person behind as leg space. This allows them to sell the seats as reclining without actually making room for it, and creates a situation where it's the problem of the person behind you, rather than the airline, when there isn't enough space for the chair to recline. By reclining, you're saying that you deserve two seats' worth of space for your comfort, making another person miserable, so you can feel slightly better during the flight. It is, objectively, an asshole thing to do.\n\nAs for the argument of \"Well, the seat allows me to do this, so it's not my fault!\" - the positioning of the seat also easily allows me to kick the seat of the person in front of me until they get back up. So I guess anyone making the functionality argument is perfectly okay with me doing that. After all, it's something that's possible to do, so that means it's okay, right?", "It's quite rude to recline when someone is seated behind you, they have the ability to recline because it is needed on long haul flights when people are sleeping. If you are just doing it on a 2 hour domestic flight when everyone is awake, you are an AH imo", "Not true. Car seats can recline but you’re not supposed to do it if someone is behind you. Same with a plane.", "Not true. Car seats can recline but you’re not supposed to do it if someone is behind you. Same with a plane.", "Terrible take, OP has to be inconvenienced at their own cost why?", "Bai-Cha is the AH", "Interesting that this is getting so many downvotes-- but if you suggest an overweight person buy two seats you'd have 500 upvotes.", "Do you also think fat people are morally obligated to purchase 2 seats as to not inconvenience people around them ?", "What a terrible opinion. Can't believe people like this exist", "Agreed. I’m short and can usually at least lean over and rest my head on my tray in front of me. However, one time when I was flying back on an international flight, the seats were so close that I just rested my head on the back of the seat in front of me. Way less comfortable, but it did allow the person in front of me to recline. Either way, for someone that has a super short torso to lean forward and hit another seat, it’s a sign that the seats are entirely too small.", "Reclining a two year old's seat? Oh, I bet the people behind absolutely love you.", "Yeah, it doesn’t work for me (I have 5 different neck pillows each with a new revolutionary approach).\n\nIdeal sleep position for me is window seat, recline with a small pillow wedged between the seat and the plane.", "Or, just use the feature of your seat that you paid for that is designed to solve this issue.", "Airlines don’t put people in exit rows, they sell those seats for extra money. If you need one, just buy one.", "Airlines are always AHs. However, because not all seats on an airplane can recline, doing so eventually takes away someone else’s space that can’t reclaim it by reclining themselves. So it’s effectually a “f-you, I’ve got mine” lack of courtesy to fellow passengers.", "Well, seeing as how she was physically unable to recline because OP isn't made of liquid, it's not really relevant. OP is passively existing and the recliner is actively moving, so the resulting conflict is on her.", "He didn’t say “morally you shouldn’t recline.”\nHis legs were in the way. The only way she could have reclined would be if he turned to the side and put his legs in his neighbor’s space. Should his neighbor have had to deal with that so she could recline? The reclining is a bonus but you’re not entitled to more than occupying your seat, which is what he was doing and she had to do because of it. If reclining is non-negotiable she should only ever book the seat in front of the emergency exit row so she doesn’t again have an issue of someone so tall behind her that they obstruct the reclining function", "Fat is definitely preventable. Not sure what planet youre living on", " Nah, no-one has to be fat, being tall isnt a choice.", "I choose to be poor and can’t afford to fly!  Take THAT greedy airlines!!", "Enlighten me then.", "So he should've paid for business class if he knew he wanted leg room in economy. It's not like he got this tall after he bought his ticket.", "I would have turned on the overhead A/C to full and aimed it at the top of her head", "I have scoliosis as well as RA and I’m in masses amount of pain with my back each day. I sit on plenty of none reclining in my every day life, so I wouldn’t make someone else uncomfortable for my own comfort. I get this is a more nuanced argument and there will always be reasons one way or another.", "I found out I had scoliosis when I ended up with a herniated disk after a particularly long flight. The back pain was annoying and a few weeks later, something must have popped in my back while I was stretching. I can not describe how awful it was to have radiating pain from my back to my knees. I don’t cry often but that day I did. I dread flights now.", "For sure there is room for nuance and most scenarios would be a case by case basis. I was just talking in general terms.", "This is the issue. I would guess 80% of people on flights recline their seats. I would also guess that about half do it, not out of overwhelming desire to move 5 inches, but because the person in front of them did it. Sitting upright doesn’t bother me in the least on short flights, but if the person in front of me took up some of the very limited space, I am probably going to do the same.", "In economy? Yeah it does. \n\nAnd lol no it isn’t, unless you’re paying for something other than economy, there is no ‘privilege’, you’re not paying extra for it. Everyone is crammed in already, reclining your seat just because it’s an option in already cramped spaces it just asshole behaviour.", "It's not a privilege, basically all seats recline, it's not like you pay extra for a reclining seat. And this is ultimately the airline's issue, they just should stop advertising this bullshit of reclining seats.", "Yeah, I’m one of them. I have Scoliosis, doesn’t mean I would recline back leaving someone with very little room.", "“for more context, no, I did not check to see if this flight in particular had extra emergency exit seats. Like I said, usually I do not feel the need….Although this issue with people in front of me not being able to recline has occurred before, though not always, and has earned me some dirty looks from those in front of me in the past. \n\nSo am I the asshole? Should I pay extra for seats with more legroom so that people in front of me can recline even though this is not always a problem?“", "Lol. You couldn’t answer my question so you try to deflect with nonsense hypotheticals. Just because a seat can recline doesn’t mean you always should. Your knee hurts? Go buy extra legroom for yourself.", "Lol, don’t know what airlines you are flying on. But whenever I’m flying, everyone reclines their seat.\n\nEspecially on international flights. The only time I’ve seen seats in upright positions are when reclining is prohibited or when people are eating.\n\nIf it’s such known “ asshole/inconsiderate thing why have them in the first place?", "Most people's backs are fine without reclining though. If it's that important to you and you don't want any inconvenience then surely it's worth paying for. There's not much difference between your situation and OP's.  \n\n\n>Get emergency exit seats so others aren't prevented from getting comfortable.\n\nAren't you preventing others from getting comfortable by reclining your seat when a tall person is behind you?", "Seats can recline, doesn’t mean they should. That’s such a lazy argument.\n\nDo you always recline your car passenger seat if people are behind you? The seats can do, they were built to, so why not? Maybe because different situations means you can’t use a generically engineered device the same way depending on the circumstances.", "That sounds like  a whole lot of mental gymnastics.  Neither person here are comfortable.", "The airline reclining ongoing row is nothing to do with anyone's gender, knock it off.\n\nAlthough I suspect he wouldn't have said \"yessir, excuse me while I chop my legs off for you sir!\" to this mighty man of manliness you're imagining either.", "Quite the reach for sexism…and as someone who’s 6’5”…the answer doesn’t change whether it’s a guy in uniform or another dude. I’m still 6’5” and they change nothing about how we fit in planes. Emergency aisles are often taken up pretty quickly by either other tall people or short people who want extra room.", "That’s good", "Because there was no room he had no place to move his legs then she tried to literally smash his legs down with her seat to recline. Why does she have right to try hurt someone just to recline again they should just remove recline seats fully and put in fixed seats no recline there isn’t any space in planes for for reclining.", "Reclining is a want. Having space for your body parts is a *need.*", "He also used a function he paid for (putting his legs in the damn designated leg space). \n\nBoth of them were uncomfortable because of the airplane greedy settings (him with not enough leg space, her with not enough reclining space). Both were blameless for the other party being uncomfortable. \n\nHe sucked it up and did not bother other passengers. She rudely demanded that he and the passengers in his line being more uncomfortable (spreading his legs into their space) for her to be more comfortable (having more reclining space) and. That turned her from an innocent party into the AH. \n\n>Again, if you have a problem with recline seats on planes complain to the airline. \n\nIf you have a problem with recline seats (*cough* *cough* not being able to recline), complain it to the airline, not the passenger behind you. Don't you see your blatant double standard and hypocrisy?", "I only recline in two situations: a red eye when everyone is trying to get some sleep, or as a defensive move away from someone who has reclined in front (and even then I look behind me to check that they're not a giant / someone with a baby / using their tray table etc).\n\nReclining etiquette is fascinating and reveals so much about people’s obliviousness of what’s around them.\n\nI once sat behind someone who reclined during the meal service (classic asshole behaviour to begin with) and then, frustrated that he was now too far away from his tray, *leant forward in his reclined seat* to eat. Boggles the mind how oblivious you’d have to be.", "This is absolutely ridiculous. In my 30 years of flying I've never once had a person ask before reclining. That is not common etiquette at all.", "Also a frequent flyer, and I agree with this 100%.  I'll add that I consider it poor form to recline at all unless it's a longer or overnight flight.  It's one thing to recline when everyone in the cabin is trying to sleep during a transcontinental route; it's another thing entirely when the cabin is lit and most people are awake and active.", "Yeah, especially because the last time someone in front of me reclined without asking, they knocked my tablet off my tray table and the screen cracked.", "And I would knock the fuck out of my own seat and make your laptop dance. Your typing would not be accurate. Be careful who you try to match asshole with. We out here.", "I'm a person without any (known) back injuries, but with a long waist and I find the shape of airline seats really painful for my back. I'm an average/slightly above average height woman of normal weight, so I don't have some glaringly obvious reason why I don't fit right into the seats.\n\nPoint being, yeah they're not REMOTELY ergonomic. I don't think it would be quite so bad with a little leg room, but as it stands (heh) there's almost no way to move to relieve some of the pressure on your spine either. If I can shift my hips/legs around a bit now and then I can handle an uncomfortable seat back, but you really can't move in modern airline seats.\n\nI don't like the claustrophobia of the person in front of me reclining, but I do understand. If I can't recline my seat at all I find that the seats push my shoulders/neck/head forward in a way that's horrendously uncomfortable.", "I’m in a similar boat. My back is absolutely murdered by airline seats and I need to recline at least an inch or two to not be in pain the whole flight", "Hey there. Severe chronic pain that flares up from sitting down and would be greatly relieved by just a little recline. I cannot sit in an egornomic office chair all day, max a couple of hours amd the pain starts getting ridiculous. I still don't do it, because I absolutely detest when they do this to me as a tall person, especially because it almost forces me to recline and the person at the last row os screwed and I believe it's inconsiderate, especially to not even check. NTA.\n\nBut maybe I should, seems like people with no exceptional circumstances think it's fine to do.\n\nETA: I can't even sit at emergency rows due to disability. People with reduced mobility are not allowed to be there.", "I have never been in a US domestic aircraft where the back seat reclines.", "I was pushed into the back row of a plane (not by choice) twice and the seats did not recline.", "It’s not about ego, it’s about using the seat as it was designed. The assumption is that during cruising seats will be reclined because this is the comfortable position, and during taxi, takeoff, landing, and meals, seats will be up because this is the safe position and the one most convenient for eating.", "I regret that I have but one like to give.", "I agree! A good litmus test for sure.\n\nI always thought reclining was rude UNLESS the stewards turn off the cabin lights (which is a signal for everyone to GO. TO. SLEEP.).\n\nTHAT is the reason we have recline function people. Not for those of y'all to indulge your inner AH.", "Exactly this. The only time I recline is when I’m on an international flight.", "This is the most ridiculous thing I ever heard of. When the lights go out, people recline. Not sure where you have been flying but I've never been on a plane where people didn't. They wouldn't make the seats recline if you weren't supposed to. Unlike a car, they do not recline all the way down in economy.\n\n&#x200B;\n\nExcept during meals.", "There’s always someone behind you on a plane.", "Extremely overweight people need to buy 2 seats as well. It’s unfortunate that airlines suck, but it doesn’t change the reality. He should get upgrade if he wants to be comfortable. Seats recline for a reason.", "On your view, the person in front has to be inconvenienced at their cost if OP doesn’t, since they can’t use a feature of their seat, which they’ve paid for.", "Because they're the one impeding other's ability to enjoy the recline feature that they paid for.", "Because OP is too big for a regular economy seat and is taking room that belongs to a different passenger.", "Why is it interesting? An overweight person is encroaching on the comfort of everyone near them. A tall person is not doing that because reclining is absolutely not necessary on any non red eye/long haul flight.", "Of course.", "If they can’t fit in a single seat I would hope so for their own benefit and the passengers around them. Everyone’s flight will be better.", "I know at one time (eight or nine years ago) Southwest required purchasing two seats HOWEVER if the flight wasn't sold out there was a form to fill out and the second seat price was refunded.  NO idea if they still do it this way but that seemed pretty equitable.", "The feeling is mutual, I assure you.", "Same. I’m 5’0 and can do this.", "No, Mama is holding the two-year-old to get her to sleep, so it's Mama who's reclining.", "No, I am sorry if I was unclear. When I am holding her to put her to sleep, I recline my seat.", "Huh, ideal sleep position for me is leaning forward onto the tray in front of me. That is until the person in front of me inevitably reclines their chair into my head.", "OP said that this is a recurring problem for them and they have decided to take no action to fix it. There are larger seats that OP could choose to purchase instead of restricting the normal use of someone else’s seat.", "So lady in front of OP is now stuck in the few inches of space between their chair that is being prevented from reclining and the person in front of her who is using their recline function in the usual way? \n\nAirline seats are designed to recline during cruising, because this is the most comfortable position, and they are designed to be upright for taxi, takeoff, landing, and meals. Preventing someone from using their seat in the manner intended by the designers is an AH move, especially when there are larger seats available for purchase and OP says that this is a recurring problem that they have made the decision not to do that.", "It preventable, but it isn’t something you can change IN THE MOMENT.  If someone is already overweight then they’re overweight.  It’s not like they can do jumping jacks in the aisle and slim down real fast, a weight loss journey takes months or years.", "That…is not correct", "You both can't change it in the moment? I mean yeah you can work to reduce weight (which is not always easy or possible but in general), but that won't help you if you're already on the plane. Both being fat and being tall are both things you can't change right that moment. \n\nEven so. I expect a fat person wouldn't go \"oh I have a flight in a year, better get dieting so the people around me aren't uncomfortable!\"", "If someone is already overweight and boarding a plane, there’s nothing they can do in that moment to avoid taking up too much room.  They take up that much room.  It’s not like they can do jumping jacks in the aisle and slim down real quick, that isn’t how it works.  It is certainly possible to lose weight, but it takes TIME.  An overweight person would need to start their weight loss journey months or years in advance, so saying “well you can just lose weight” is really unreasonable.", "Might be my height being a fellow tall person is making me extra empathetic, but he didn’t want the leg room though. He was fine with the situation. \n\nAnd making tall people pay an additional cost to fly seems kind of ridiculous especially when they plan only on using the space allotted to them.", "But he didn't want leg room. Sounds like he was fine with it, it just made the seat in front unable to recline.", "Why would you sit in chairs that cause you pain regularly? I don’t do it in normal situations and I don’t on a plane. \n\nIt’s unfortunate because a tall person and someone with other pain deserve comfort. But claiming one has more right than the other isn’t the answer.", "Oh no :( I’m sorry. It’s really hard on flights. I just flew for vacation and it’s brutal. I also have a connective tissue disorder and my hips slide partially out and I was just slowly leaking tears the whole time. Extra leg room seats add a little comfort in that I can shimmy around but that’s minimal. \n\nI hope you’ve found something that helps with your pain.", "In your opinion", "If it's a 1 hour flight, sure it's not a problem. But in a flight of 6hours or more, you best believe I'd want to get comfortable. I do agree that it's on the airline to make sure that the person behind you has enough space to keep their legs, even after reclining. Sounds like basic common sense.", "It's not always a choice. If I paid for the seat, I'm not spending the flight in pain because the extra tall person behind me didn't accommodate for their own physical differences.", "I’ve flown a lot — mainly internationally (between Asia and the US since infancy) and a bit later in life, domestically within the US. Etiquette seems to be completely different between the two. For international flights, my experience is that pretty much everybody reclines for the entire duration of the flight except meal times. For short-haul domestic flights, most people don’t recline — and I don’t either. \n\nI can see someone switching between international and domestic travel being very thrown off by the difference in expectations around that.", "Lol ok", "He said he could have moved his legs but didn’t want to impose on others space.\nIt’s his problem, not the paying customer in front using the recline option. \n\nAnd the seats recline about an inch. Hardly much difference.\n\nIf you think commercial planes don’t have space for chairs that recline; take it up with the airline?", "So lobby the airline for change!", "So complain to the airline!!!!\n\nAnd a seat on an airplane reclines no more than an inch. You’re being a bit dramatic.", "Reclining etiquette is a case study in how awful the average person can be. I've had it happen at least twice now that a dude will just randomly - out of nowhere, once during meal service - absolutely *slam* his seat back. Just abruptly flinging it backwards. Ever gotten sucker punched by a laptop before? It stings a wee bit.", "Woooooooow that’s some obliviousness! I bet if the person in front of them reclined, they’d make no connection between their situation and your situation!", "In my experience most people do recline their seats because it's so dang uncomfortable not to... like they don't recline back very far at all, I don't get the issue..If the person in front of you reclines, then just recline your seat too?", "For 30 years the person behind you has thought you're an AH. They've just been too polite to say anything.", "I do not mind AT all when ppl recline. It is so weird to me that ppl think this is some sort of faux pas. What a bunch of weirdos. And for the record I fly a lot and have never had someone give me a heads up. I don’t need it because I fit JUST FINE with their seat up or reclined.", "Really? Until the last few years I don't think I'd ever had someone do it *without* asking. (Edit: except maybe once in 2018, but that was just a flight within the USA). It does seem increasingly less common now, but I definitely think of it as the norm.", "LMAO! Right, I bought the whole seat so I'm gonna use the whole seat.", "Tbh it just sounds like you're being an asshole to yourself. You have listed multiple reasons to recline so it's your own fault for being stubbornly uncomfortable.\n\nIf it makes you feel better, give the person behind you a heads up. But sitting in severe pain because of pride isn't very smart when alternatives are available.", "You say\n\n>When the lights go out, people recline.\n\nAnd\n\n>Except during meals.\n\nBut meals are not the only time the lights stay on.  For daytime flights and short flights the lights are on and there's no reason to recline.", "You have to be making shit up. Everyone reclines when the lights go out? \n\nNot sure if you’ve flown since the 80s but things have changed since then.", "Well that’s just false. And a complaint you can have to an airline, not other people.", "OP was fine being uncomfortable.", "It could be argued that being extremely overweight is a choice for many that could be remedied…being tall is not a choice for anyone.", "I'll take not being able to use a feature of the seat I paid for over squashing someone.\n\nI may be entitled to be an ass to the person behind me, but..like..basic social consideration for others.", "If they recline and I can’t use the tray table, who is the inconsiderate one exactly?\nNot to mention that many seats now have screens in the back. Bit hard to watch if its reclined. \nTh person reclining needs to be aware they are encroaching into someone’s space. \nThe airlines should also limit the possible incline.", "Every single reclining seat with a seat behind it, is limited specifically by the amount of leg room of the person behind them. How is that not common sense? If you want to recline all the way or even at all if you're unlucky enough to have OP behind you, PURCHASE THE SEAT BEHIND YOU. OP did NOT affect the seat in any way while it was positioned normally. Buy first class if you want more comfort but understand that's not the purpose of an air plane. Private jets might be more your style.", "> On your view, the person in front has to be inconvenienced at their cost if OP doesn’t, since they can’t use a feature of their seat, which they’ve paid for.\n\nSome airlines still have old seats with ashtrays.\n\nIf someone complains about the person next to them smoking, is the complainer TA because the smoker is just using \"a feature of their seat, which they've paid for\"?", "You don't pay for reclining specifically, you pay for a seat just like OP did. Do you expect to be compensated if your seat doesn't recline? Lol", "No, a passenger doesn't get the space behind their seat when purchasing a ticket.", "Thank you! You are correct.", "OP isn't obligated to shell out extra money for someone else's comfort unless they're spilling over into someone else's seat. Which they're not, they're just taking up space in front of them, which is included in the ticket.", "Yes correct, that is what she is stuck with just like if her reclining function were jammed by poor maintenance, as happens often. Well observed.", "Being tall is something you can't change, Full stop.\n\nThey are not the same", "Please - losing weight isn’t just beneficial for flights. It’s beneficial for one’s life. Maybe people shouldn’t weigh four hundred fucking pounds and pretend they can’t change it.", "That’s beyond ridiculous- a tall person cannot lose their height. A fat person can always lose weight.", "He wasn't using the space allotted to him if the person in front of him couldn't use their seat functions because of him.", "He admits he does this on a regular basis. That's an asshole move. Sorry, not sorry.", "Yes…", "What about you accommodating for your physical issues? Who gets the win here, the person who is too tall to allow seats to recline, or the person who has a medical condition? Both are out of the people's control.", "So he should impose on someone else to make it possible for her to impose on him? How about we all just try to stay inside our own spaces?", "That is called being respectful of others on the plane no imposing on their space she was being rude by imposing on his space. He was trying to be polite she was the moved into AH territory when she tried to force he seat back the second time she could have caused him an injury. And why should have impose on the other just get to recline why is her comfort more important then their’s.", "Because, invariably, I've got someone like OP behind me and cannot recline the seat", "When was the last time you flew on a plane without someone behind you? It’s not like a car where the backseat is often unoccupied. The airplane seats are designed assuming most seats will be full most of the time.", "OP was making the decision to be uncomfortable not only for himself, but also for the person in front of them.", "It’s a bad argument. You don’t know anybody’s medical situation and you would be an asshole to ask.", "Or basic social consideration being if you can’t fit into a seat without inconveniencing others, you pay for the additional cost to upgrade to one. It’s not significantly extra to get an exit row. \n\nMuch as we expect obese passengers to pay for 2 seats rather than saying the person next to them who is squished should suck it up, the same applies to tall people.", "Hence why when meals are served they tell you to cease reclining so the tray can be used. \n\nIf you want to use the tray for your entire flight and the other person wants to recline, that’s for you to work out between yourselves. You both want to use features you’re entitled to use, so neither are an asshole. \n\nI’ve watched the screen on the back when the person in front has reclined - it wasn’t any more difficult.", "The function is built in. It’s intended to be a feature of the seat. Yes, it’s limited by the manufacturer and idk if there’s confusion but I have no issue with it being limited by the manufacturer. Someone buying an economy seat is entitled to expect to be able to use the features of that seat. Like if they purchase a window seat, they expect to be able to use the shade. If they purchase a seat on a flight with a screen, to expect to be able to use that screen. If the seat has a limited recline function, to be able to use it. \n\nNone of that is expecting first class. \n\nAlso, you expect them to pay for first class to have comfort, but not for OP to pay for the additional legroom so he isn’t inconveniencing others? I don’t understand your logic. \n\nPerson wants to use function of economy seat —> you say they should pay for first class \n\nPerson doesn’t fit in seat and therefore prevents others using function of seat —> other people should pay for first class \n\nIf an obese person doesn’t book 2 seats, do you think the person next to them should have booked first class to ensure they could be comfortable?", "Given there’s a ban everywhere on smoking on commercial airlines, that doesn’t logically work.\n\nEdit: if the complainer happens to somehow be on a plane that allows smoking and there’s an ashtray, then yep, they’re using a feature of the seat. \n\nIf they’re on a flight that has an ashtray because it’s old, but the airline bans smoking, then they’re not objecting to using a feature of the seat but to a breach of the airline’s rules.", "If the seat is designed to recline and functions in such a manner as to do so, she has the right to use the feature, as she paid for the seat and all of the amenities it includes.", "Seats come with a recline function, and I am paying to have that option. Just like seats come with an armrest, and I’m paying for that function too. If you are too big for your seat without inconveniencing others (either too tall or too fat), then you need to purchase a larger seat.", "So person in front of OP gets screwed because OP knows they are too large for the normal economy seat and chose not to do anything about it when they booked. OP is clearly the AH here.", "Im sensing a lot of passion here.", "A fat person can take months or years of intense effort to lose weight, yes.  But if a person is boarding the plane it is too late, they needed to start losing weight months or years ago in order to slim down for this flight.\n\nAgain, it’s not like they can just do some workouts in the aisle and slim down real fast.  That isn’t how it works.", "Where is the divide for seat space then? If it’s not in front of you the process seems arbitrary at best.", "Does what on a regular basis? Have long legs?", "But it wasn't out of his control. He knew his knees were going to touch the seat in front of him and prevent whatever person was unlucky enough to be in front of him to not be able to recline their seat. He said in his post that this has happened before. He chooses to do this because he doesn't want to pay for business class, which has the leg room he actually needs and still allows for the other passengers to use the features of their seats and fly comfortably all around.", "Where her seat reclines is her space.", "Caused him an injury???\nWow. \nIf he’s that precious he should book a bigger seat.\n\nIt’s clear you think his comfort is more important than hers. She paid for a seat that reclines.", "About a year and a half ago, half full plane. I don’t fly too much either so it’s not like 1 out of 100.\n\nAnd that doesn’t change the fact that a generic version of a seat that has capability to recline does not mean it is automatically acceptable to do so. This is a common sense question, it doesn’t have to do with the decision of airplane seat manufacturers.", "Nope, OP didn't move their chair past it's normal position.", "You would be an asshole to ask why someone is fat. Doesn't change the fact that being tall is 100% out of a person's control, while the same cannot be said about every overweight person. \n\nIt's the fault of the airlines that the seats are as cramped as they are. OP doesn't intrude into other people's space, their long legs just make it impossible for someone to recline (which imo is encroaching on OP's space to begin with, but that's neither here nor there). Honestly, the only rude thing that happened was the other passenger forcefully trying to recline their seat after it obviously won't work. Like we're they hoping to hurt OP and bully them out of their seat?", "Or to recliners. It's a short haul flight in cramped quarters, leave your spreadeagling until you get to your hotel.\n\nI'm 5'8 and don't want the top of your head in my face either. I may be inclined to count dandruff.", "Anyone who reclines their seat in coach is an asshole", "But you think someone using the available leg space between the seats is an asshole. \n\nPeople don’t actually need to recline, particularly on short flights. ASI said, the answer is to limit the recline on the seats. Not expect to be able to encroach into someone else’s space.", "> The function is built in. It’s intended to be a feature of the seat. \n\nDoesn't make it okay to be rude about it.\n\nThere's a seatback tray table. It's a feature of the seat. I could spend the whole flight banging it up and down and annoying everyone around me.\n\nIn fact maybe that's what I should start doing when people recline in front of me, since we're both just using \"a feature of the seat\",  after all. Hopefully that person will be you.", "Apples and oranges. OP was in their seat and had all the leg room that came with the purchase of their ticket. OP didn't stick their legs over the seat or into the seats next to them. How do you not see that the person in front of OP is inconveniencing them by reclining into their damn legs?! Why do you get to tell someone they have to pay more to sit in the seat they purchased and they fit in because the seat in front wants to encroach on the space behind them?", "Nahhhh", "> Seats come with a recline function, and I am paying to have that option.\n\nNo you're not, there's no \"recline\" charge.\n\nIf for some reason you need that space, by your own argument, you should be purchasing the seat behind you so that it will remain empty for your use as a reclining zone.", "Tell me how a tall person loses height?", "And where his knees go is his space.", "Yes by trying force the seat back into his legs she could caused him an Injury those seat have hard plastic trays in the back mashing that into someone’s knee she could hurt him. If wants to recline so bad maybe she buy a upgrade seat that has more room.", "A year and a half ago was Covid. That’s an unusual situation. Almost all planes are full or mostly full.\n\nThe seats are designed to recline. The correct use of the seat is to recline during cruising, because this is the most comfortable position for airline seats, and have the seat upright for taxi, takeoff, landing, and meals. Preventing someone else from using their seat in the way it was designed to be used is selfish.", "Neither did the person in front of them when they tried to recline, since recline is a normal position for all airline seats.\n\nIf the person in front of OP is unable to recline because of OP, then they get squished between their upright chair and the person in front of them reclining. Does the whole column of seats now have to stop using the recline function because of OP, or is someone in the column forced to sit in an extra small space?\n\nCan I stop someone from reclining for any reason, or just because I’m tall?", "Okay, but if you put aside being all technical about it he did stop the person in front of him from reclining with his freakishly huge body. Going forward he should spend a little extra money and choose an emergency/exit row.", "Making bigger seats in the whole plane would cause ticket prices to go up for everyone. As it is now, you have the choice of paying extra for a larger seat if you need one.", "You may not want someone to recline, but they’re entitled to. If you’re so anti recline, book the first row. Otherwise, get over it - someone’s using a feature of the seat they paid for. You don’t get to dictate otherwise. You didn’t pay for that privilege.", "Someone using more leg space than a seat is built to accommodate (note I said built to accommodate - not the amount it can maximally accommodate if other people decide not to use features of their chair) is inconsiderate for booking a seat that they know means their size will encroach into others. \n\nIt’s the same principle applied to obese passengers. There’s no logical difference. We expect someone to pay more to ensure they don’t limit the functionality available to someone else, because we acknowledge that they deserve to be able to use their seat in the amount of relative comfort enabled. \n\nI agree the answer goes to the airline. But in the absence of aircraft manufacturers increasing space so we’re not all jammed in, the blame doesn’t fall on the person who just wants to use the seat they paid for in a normal and expected way (hence the function being built in the first place).", "Banging it isn’t an intended use, so you’d quite properly be told off. But if you want to have your tray down for the entire flight to have your possessions on it, go for it, it’s an intended use", "There’s also no need to be rude - I’m not being rude to you.", "He exceeds the dimensions the seat was built to accommodate. There is a difference between what something is designed to accommodate, and the maximum dimensions that it can. \n\nWhen you technically fit into something but only by impeding functionality, you don’t fit. \n\nIt’s much like how many seats have a weight limit that they’re designed to accommodate - someone a little greater than that weight can usually sit in them without breaking it, but they’re exceeding the designed dimensions. \n\nYou don’t fit into a seat if the only way that you can involves other people being unable to use their seat. \n\nIf this was purely static seating it wouldn’t be an issue. But the seats aren’t static, they’re designed to be able to recline. \n\nHe doesn’t fit.", "Very well thought out argument.", "Lol, just take the seat behind you. This is a recursive problem until you get to the back of the plane (which are the best seats). \n\nRecline is a function of every seat, and it is meant to be used. The seats are designed so that during normal cruising people recline because this is the most comfortable position. During taxi, takeoff, landing, and meals seats are upright for those purposes. Not wanting others to use their seat that they paid for in the way it was designed to be used is selfish.", "They dont, they pay the extra to sit in the places designed to accomadate them.", "I didn’t say he was an asshole. But neither is she. The fact that her space and his potentially overlap is the fault of the airlines. Though he is a bit of an asshole if he knows this to be a recurring problem and didn’t even check to see if a seat with more leg room would be available.", "What injury would it seriously cause him? If he’s that fragile maybe don’t fly economy class?\n\nMaybe she had a back injury and needed to recline the reclining seat she paid for?", "End of 2021 was Covid? Lol no, many flights were full. We were about 8 months into vaccines at that point.\n\nAnd you’re just so incapable of thinking that maybe a seat was designed to be used in different ways depending on the situation. But of course assholes like you have to exist and prance around believing you don’t have to adapt at all if someone else is affected.", "They tried to recline into someone. You have a terrible argument.", "Every single person has the ability and right to stop the seat in front from reclining on them. The seat ahead should've opted for better seats if they demand comfort on an airplane.", "Ticket prices have already gone up coupled with downsizing of set-size. Personally, I try to avoid flying whenever possible because its nearly guaranteed that I'm not going to enjoy the experience (Am a lean 6'2\" with long legs, and while I fit in seats fine, it IS uncomfortablewhenever the person in front reclines, though I don't tell them they can't). Honestly, the biggest AH in this whole situation is the fact that people HAVE to fly everywhere to begin with. Our world needs to invest heavily in high-speed rail systems.", "And he's entitled to an economy seat. He didn't do anything malicious, it was physically impossible for the seat to recline. Why should he have to pay more because of something he can't control? Id mostly blame the airline but until they make it policy that tall people can't book economy, hes fully entitled to be there.", "I didn't pay for the privilege of seat space? I guess I missed the bit where only recliners pay.\n\nI really hope you get a tall person reclining into your space for the next few flights you take. 👍", "There's a continuum from gently lowering it once in the flight, to raising and lowering it each time I want to rest an object for a moment. There are plenty of ways to \"legitimately\" use the tray while being highly annoying to the person in front of me. Believe me, I've experienced it.\n\nSo again, the main point is that being considerate of people around me trumps everything else other than health and safety. It's a small packed space and we all owe that to each other.\n\nI'm allowed to talk on the plane. Doesn't mean I should have a loud conversation all night long. \n\nI'm allowed to get up and go to the bathroom. Doesn't mean I should do so from the window seat every few minutes just to stretch my legs because I find it pleasurable.", "You're expressing a preference to be rude to others in general.", "Well you seem to think no one gets leg room so it's pointless arguing with someone who doesn't use logic.", "Those spaces aren't designed for that, they're designed to be an exit row. \n\nIn any case, this argument sort of falls apart because there's also usually exactly 1 row of them in the entire plane. In a big transatlantic plane like a 747-400, that's a whopping 8-10 seats out of like 650. In a smaller plane it's even less. Many planes for shorter trips don't even have an exit row.\n\nI've literally only been able to book an exit row seat maybe once in my life despite planning months ahead of time. They're the first seats to get snapped up, including by shorter people who want extra room.", "NAH but some of these comments are just ridiculous. Like etiquette is to not decline? Losing respect for people who recline? Like the seats are designed to be reclined and the flight is shitty enough, it’s a lot worse if we have to stay in default position. Especially most of my flights are 13+ hours these comments better not expect people to sleep 90 degrees.\n\nIt’s so crazy that rich companies make poor people suffer but we are just fighting amongst ourselves instead of the real problem 🙄.", "People who recline on planes are the real A H. NTA, OP", "The REAL asshole is the airline for squeezing people in like sardines.", "The Assholes are the people who make the seats as close as the possibly can", "The airlines are the AHs.", "The only assholes here are the plane companies making plane seating more cramped so they can increase their profits.\n\nShe has the right to be annoyed, you have the right to stay where you are and not apologize for your body.", "I understand what OP means about leaning back. I always feel uncomfortable doing it, because I don't want to encumber the person behind me even more than we already are. I'll lean a tiny bit, but using the full recline is a bit much.", "NAH\n\nShe purchased a ticket, and she's entitled to be able to recline her seat.\n\nYou didn't choose to be tall and have longer legs. You weren't trying to prevent her from reclining the seat on purpose. It was literally out of your control.\n\nOnly AH would be airlines for making seats so small.", "They really need to remove the recline function in economy.", "NAH. Here we go again. Every airline right now is in a race to the bottom. everything about air travel sucks right now, and it serves the airlines if they can get their customers/passengers to blame each other for their shitty experiences instead of the airline.", "Airlines are the AH here.", "Frequent international traveler here, NTA. People who recline their seats are annoying as hell and should be ejected. I'm going to try this next time I'm flying, and they won't be able to do anything since I'm a minor.", "ESH... Mildly. You are both being a bit petty. Should you have to say please? No. Would it be better if you did? Yes.\n\nIf you don't say please, I think that's pretty normal for people who are around each other a lot. But you should still be saying thanks afterwards. Not sure if that's happening as it wasn't mentioned in your post.\n\nI don't think please is necessary if you are starting with \"would you be able to ___\" or even \"can you ___ for me?\" I think it important to show that you know you are asking them to do something for you.\n\nWhen it's her own mess, assuming it's been there awhile, i wouldn't say please. And if she asked you to say please,then I'd probably get pretty passive aggressive.\" can you *please* clean up your own messes without me having to ask you as if you were a toddler?\"\n\nI don't know, I also kind of get the feeling that you ask for a lot of these little favours. It doesn't matter if they are already up. You are asking them to waste 10 seconds of *their* time, so you can save 20 seconds of yours.", "NAH, nothing you could do but she has the right to try to recline her seat. That's why it's designed to", "YTA for the comment -\n\n“If I’m honest I feel people who recline their seats in economy are annoying and inconsistent”\n\nThe seats are designed to recline. There is an expectation people should be able to recline.\n\nI’m quite short but have suffered with back pain nearly all my life and flights are a nightmare due to the long time sitting. I don’t fly much (for this reason, and cost) but have close family abroad so it’s sometimes unavoidable. If someone told me I couldn’t recline my seat I would then face serious pain for the coming flight - no matter the length.", ">  I feel that people who recline their seats in economy are annoying and inconsiderate\n\n> I did not check to see if this flight in particular had extra emergency exit seats\n\n> this issue with people in front of me not being able to recline has occurred before\n\nThis is because YTA", "I typically don't recline but I don't have a problem with ppl that do bc they paid for their seat just like I did and they are made to recline.  It amazes me the sheer number of ppl that think it's rude to recline or that the person should ask PERMISSION to recline the seat they paid for... It's misplaced anger, be mad at the airlines not the passenger", "ESH. You are tall and therefore need to pay for more space on a plane. It sucks and it’s not something you can control, but you’re an asshole for preventing her from using all the functionality of the seat she paid for. If there weren’t exit row seats or extra leg room, then there’s nothing you could do, but you didn’t even check which makes you an asshole\n\nShe’s the asshole for yelling at you about it and trying to force it. There’s nothing either you could’ve done at that point, and while she was reasonably upset, she didn’t need to tell you off", "I'm of the opinion that anyone that reclines their seat in an airplane is an asshole. Anyone that does it to me is going to constantly get my knee shoved into their back thru their seat, and I don't give a fuck if they give me dirty looks or say anything about it, which has happened to me before. \n\nThey don't care about my comfort when they recline back, so, by the same token, I don't give two tugs on a dead dog's cock about their comfort.", "YTA.\n\nAt 196cm (compared to my 165cm) here are some painful life experiences I face all the time that you will never have:\n\n* Going to shows, plays, movies, etc. and getting stuck behind someone taller than you\n* Wanting something from the top shelf and facing the indignity of asking for help or using a ladder\n* Any pants you buy off the shelf or online will be too long\n* Simply can't ever try to hop fences or walls or barriers of any kind\n* Having to bounce off of bar stools or leap off tall chairs\n* Not being taken seriously when upset\n* Having to always look up at people in conversation\n\nEconomy class on airplanes are one of the only times that it must suck for you to be tall. Do you make accommodations for short people when you're sitting in front of them at a show? Do you help short people out when they need a favour from a taller friend? If not, then why should a short person accommodate your needs on the rare occasion where your size goes from being an incredible advantage in life to a slight inconvience?", "Weird that last week, same story but from the person in the front seat reclining the seat. He was nta too", "Literally just forked out £1,500 so I don’t have to be squeezed into an economy seat on my return trip home on an 8 hour flight.  I’m a big guy, and I always feel super bad for my seat mates on these flights because I know I accidentally encroach on their space.  Even though the seat was a reasonable size, the spacing between them is non existent.", "It’s inconsiderate.  Have you sat behind someone with their seat reclined?  Especially on a plane with movies on the back headrest.", "I interpreted this as he fills his seat 100%, so if the person next door also fills their seat 100%, they can't avoid touching (arms or legs or shoulders, perhaps) whereas if the neighbor is smaller, they fit within the confines of the seat and nobody touches. Not necessarily that he's taking extra space. Obv I'm not op that's just how I read it.", "> They spend millions in R&D doing their seat designs\n\nThose seats were designed to have much more room between them. When airlines started packing them in tighter, the designers intentions went out the window.", "Not when it makes it difficult to impossible to sit in their seat. You want does not trump someone's need.", "Well, nobody hates tall people.", "If everyone over 6ft booked that section there wouldn't be enough seats", "I'm the same height as this dude.  The problem I've had is that I want the seats in that section but they're *always* sold out.  And then when I get on the plane, it's just some normal sized person.  \n\nYou can buy two seats next to each other anywhere in any plane, but there's usually only like 9-18 seats total with extra legroom in a plane.", "There are a lot more seats on a plane than there seats with extra leg room. Seats with more leg room are often booked way in advance. It's much easier to buy two adjoining seats.", "Born tall, litteraly cannot help it.", "In my opinion, you’re entitled to the full width of your seat, but not necessarily the full reclining capabilities of the chair. You get to recline until it touches the knees of the person behind you, and if that person is really tall, tough luck. \n\nIf you absolutely need to be able to recline to tolerate the flight, you also have the choice to pay for a premium section.", "It’s called window seat or bulkhead.", "I swear the “it’s rude to recline” group must never fly. I fly a lot for work and every single flight I’ve been on, the people in front of me recline and I recline as well and I’ve never been asked if it’s “okay” to recline, because that’s just expected.", "I travel often. I hate when people recline into my space so I don't do it to others - the exception being long haul flights, and there is still a way to do so respectfully. I also try my best to get an exit row seat when possible to avoid this issue.\n\nThat said, I would never try to stop someone in  front of me from reclining their seat or make another passerger's flight more uncomfortable because I need accomodations. If OP is aware that their height poses a challenge, they need to look into more space options.", "Nah, I’m blown away by this take.  Having to pay extra $ because of their literal height is a much bigger ask than to not be able to recline. If the person in front really *needs* that accommodation then they can ask the flight attendant rather than being a dick about it to the person behind them. The airlines are the real assholes here for cramming economy as tightly as they do.", "When short/small people have paid for a seat: they should be allowed to take up as much space as possible.\n\nWhen tall/big people have paid for a seat: they should be forced to buy two seats, emergency exit, or first class.\n\n>Seats are made to recline and people are allowed to recline them\n\nSome people were made big, and they should have a right to exist. Why is someone's right to recline more important than someone's right to have long legs?\n\n>People might have been travelling for ten or fifteen hours already and need to sleep.\n\nThat is WAY more of a choice than to be born with long legs. Shouldn't a person who needs to sleep on a four hour flight be obliged to then splurge on a more expensive ticket than someone who always has long legs?\n\n>You're the inconsiderate one.\n\nNo, you're the inconsiderate one. You just relate more to someone who wants to recline than someone who is absolutely crammed into their seat, trying not to manspread into their neighbor's seat.\n\nOP is NTA", "Man I’m poor af, you’re telling me because I’m tall I just shouldn’t fly? You make do with the situation you’re in, plenty of features exist in things that are uncourteous to use. If you’ve got back pain or arthritis, tell me or the flight attendant about it and we can sort something out, maybe you should be the one buying a more comfortable seat? This is obv not a black and white issue. \n\nI’ve got great speakers on my phone, why would I use headphones on the bus? That’s about the same logic as the ‘it’s a feature’ one. You’re in shared space. Act like it", "Seats have ashtrays too and people should not use the feature.", "Being overweight to the point of needing multiple seats is preventable, height is not. Apples to oranges comparison there.", "Agree.  This is the correct response.", "Same!", "It is his fault tho, if he knows he’s 196cm tall, then pay for an extra legroom seat or simply don’t fly.", "I've flown about once or twice a year for much of my life and I've never reclined a seat. It changes by like a degree (maybe the planes I've been on are shitty) I can barely tell a difference. And at home I sit in a reclining chair all the time so it's not like I don't enjoy it in general. So many people here are acting like it's life or death! You know what else doesn't recline? Most train and bus seats. Which are also crammed in to get as many as possible. If you're in the back seat of a car it generally doesn't recline. Sports games and older theaters. Regular chairs don't recline.... Basically my point is, many seats are uncomfortable.", "I have literally never been bothered by the seat in front of me being reclined on a flight. Tray tables are always still usable by design. It only reclines a few inches anyways, y'all act like reclining cuts your space in half or something.", "I’ve been hit in the face with backs of seats several times so I never recline just to be safe", "Holy shit this is the worst fucking take. Jesus Christ. Not a goddamn shred of consideration for others.", "As a tall person whose knees naturally stop someone in front of me reclining I try and book the exit rows so I don't inconvenience anyone or get into this argument with them.\n\nBut more often that not we get bumped out of them at the last minute because there are passengers with health conditions/impairments (which is obviously fine), or sometimes families with babies (which is understandable, no issue with that). Before anyone says \"But babies aren't allowed in exit rows\" - yes, some airlines in the world do still allow babies in exit rows.\n\nAnd sometimes I just can't get exit row seats as they've been booked, or because the airline doesn't allow early booking of them as they want to keep them for passengers with health conditions.\n\nSo lets look for a part of the plane with guaranteed more leg room..  premium economy.\n\nI'm looking at flights right now for a trip. Average prices are 109 a seat for economy, well over double at 318 for premium economy - 209 extra. Except its not 209 extra, as there are 2 of us and the other is a nervous flyer and can't really sit by themselves. So its 418 extra and if I'm travelling with the kids as well then its 836 extra.\n\nWe can't afford that. So instead I stick to economy, hope I can get the exit row, and I pack my kneepads in my hand luggage just in case I can't or we get moved.\n\nIf buying a seat that I can better fit in was a sensible amount, like 20 extra or something, then I'd agree with you - but its not as simple as that.\n\nTo OP, NTA - the real A are the airlines who squeeze people in and charge ridiculous amounts of extra money for exit rows/extra leg space.", "6'4\" guy here.  I always take window and origami myself to remain in only my allotted space.  It sucks, but 100% better than being clipped by the snack and drink carts.  I also never recline my seat since out of respect for the person behind me and as karmic payment for the person in front of me whose seat is pinned against my knee caps.", "This. As a tall person I've tried sitting at an angle in aisle seats but its no solution, you end up being hit by trollies, run over by trollies, and with people tripping over you as they walk past. It just makes it worse, and dangerous, for everyone.", "Feel sorry for you leggyboys on planes. I'm 6'4 but more in my torso. I don't fit in cars with sunroofs but my knees fit almost perfect in plane seats..", "The airlines are the true assholes, they would have us in cattle cars if they thought they could get the laws passed.", "One of the best things about Ryanair is that the seats don't recline. Bliss.", "I was on a spirit airline flight. We were in the way back of the airplane. So we had no leg room and my knees were jammed into the seat back. Half way through the flight the guy in front of me started violently forcing his seat back into my knees hurting me. So I held the seat back up so he couldn’t recline.  He called over the flight attendant to make me let him recline his seat. I refused stating it was hurting me. They kept yelling at me.  I just kept repeating he is not entitled to hurt me. Eventually the flight attendant gave up when he saw I was not moving my stance.  The flight attendant gave the guy a beer to pacify him. The real assholes are the airlines.", "Alternative perspective. I can’t sit at 90 degrees due to disability and multiple surgeries. If I don’t recline I’ll be in agony and struggle to walk afterwards. Some people need to recline and neithers needs trump the others. Reclining is part of the ticket you’ve paid for. There’s extra leg space seats if needed. Recliners should always check behind first to make sure they don’t break a laptop or hurt someone though.", "I NEED to recline in any flight that's more than 4 hrs or I won't be able to walk straight for 2 days after the flight, there are some airlines I won't take because the seats recline too little to avoid my back pain (I'm looking at you united).\n\nEven if I stand and walk around every 1hour I still need to recline the seat, and I have neck and dorsal pillows.\n\nNow, if the person behind me is too big, I would propose to exchange seats with them if the person in front of me is not reclining their seat.", "Some of us have medical issues (scoliosis in my case) that make it unbearable to sit fully upright for long spans of time. It takes several days of pain for my back and neck to recover to their normal pain level after traveling and being unable to recline the seat.", "I've had people recline into my legs on a 17 hour flight. They were in emergency exit seats...I couldn't get up once during the flight. I was stuck in window seat even though I booked aisle. I have arthritis in my knees and need to get up and down. They didn't even put up their seat during meals.  \n\n\nThe next flight it happened, I made sure the guy couldn't recline back into me, by leaving the tray table down. I'm big...the tray table couldn't move any further...He was also in emergency exit row.", "I just do not get it, if I am sitting in front of you, and I recline, I am using the seat as intended, as it is designed to be used and I am within my rights to do so. Don't like it complain to the airline, don't take it out on me.", "My opinion is that no one should be reclining on a short flight but on overnight flights, when the lights are turned off on the plane, everyone should be able to recline.", "It's not so much the reclining itself as the fact that they don't ask first. And of course, if they ask, they're an asshole if they can't take a \"no\".", "It’s actually not an unpopular opinion. Fights break out over this very issue. Delta removed the reclining ability of their seats in some planes. People are generally split evenly on whether or not reclining is acceptable or rude.\n\nI *must* recline or else I get severe acid reflux due to my GERD. And no, antacids don’t work. The seats don’t even start at 90 degrees; the shape of some of those cushions actually make me hunch forward, which constricts my hiatal hernia, causing reflux. I pay for seats that recline. I have a right to recline. If I were the woman in this situation, I would have simply asked OP to switch seats with me so he was in front of me and I could recline without hitting knees. Otherwise, I would take up a bathroom stall sitting on the closed toilet seat and reclining against the wall the entire flight. (Yes I’ve done that.)", "If the person in front of her reclined, she really has no other option to recline also or else now she has only 50% of her space. He could recline too, which would free up some leg inches.\n\nAlso why don't his legs extend under the seat in front? At worst, his feet would start poking out under her legs in front. Signed, a tall person.\n\nI don't personally recline my seat unless it's a very long international flight, but I acknowledge that it's allowed for others to do it.", "By that logic, the seat I paid for includes the screen on the back of her seat, and I can't take full advantage of that service when she's all the way reclined.", "So really,  it's the airline that's TA", "Funny that there was a post here a few months ago asking if they were the AH because they wanted to recline, but couldn't because of someone behind them. Many people said that they don't like the recline feature on airplane seats, but told them they WERE NOT the AH & they should have been able to recline. Redditors can't make up their minds!!", "She’s not the AH for wanting to recline, she’s the AH for complaining to OP that she couldn’t do it when it wasn’t his fault.", "I live in Turkey and fly frequently. The flights here take 1-2 hours max and I don’t think I have ever seen anybody reclining their seat unless the seat behind them is empty.", "It’s not bad, per say, and most people only use the reclining feature to give themselves like an inch and make sure the seat isn’t completely vertical. Some people want to recline their seats to the fullest extent possible, and that’s where you get issues like the one OP had. The biggest AH is the airlines who refuse to provide accommodation for the unyielding nature of human height (I can’t just grow shorter sorry), but much of society involves giving each other grace. If someone leans back half an inch and you get all pissy, you’re an AH. If you see the person behind you is 6 foot 7 and you lean your chair back into their lap, you’re an AH. \n\nIt’s context dependent to me.", "Not at all. Everyone paid for a reclining seat. Everyone goes in knowing that.", "It is if you're banging into someone's knees. If you're over 6' or so, your knees will already touch the seat in front of you, so someone reclining is actually painful. Some people will ignore this and actually push their seat into your legs.\n\nIf it's an AH move to dig your elbows into the person next to you because you want more space, it's an AH move to dig your seat into the person behind you.", "> I'm confused though why OP wouldn't even ask if there are any (free) spare emergency row seats available, once they're on the plane.\n\nYou must not fly very much, hence your confusion. Those seats, if even available, cost $30-60 or even more just for the seat selection, on top of the ticket price. They are complementary for certain airline status holders so they tend to go quick.", "I get very worried about using my laptop on the tray for this reason. Very worried about the chair in from coming back on it. The thing barely fits on the tray as it is, given that the screen has to be tilted away from me to see it, but the chair behind it is tilted towards me.", "I disagree. Both you and the passenger behind you have paid for space to be used.  The person behind you can also recline, and both of you should be able to use what you pay for. \n\nIf you're obese and your body spills into other people's seats, that's not included in your ticket price. That's why airlines offer accommodations like exit rows, bulkheads, or ask you to buy an extra seat. \n\nIt's unfortunate for you, even if it's not your choice, but it doesn't mean OTHERS are assholes for not wanting to accommodate your comfort if you don't want to pay extra.", "I sit behind people who reclined their seat approximately 2 times a month on international flights.\n\nIf I don't want to be bothered by people when they recline their seats they have paid for, I either go to business or don't take the plane.\n\nIf I buy a flight ticket, I know what I sign for.", "Even with 99% seat capacity, it can get pretty chummy", "Well, if OP was fat rather than tall, no one would be on his side. OP should have gotten a more roomy seat. ESH.", "Yes but people all over this thread are saying people are AHs for even considering reclining.", "Agreed. Airplane seats really shouldn’t be able to recline because the only way they can is to encroach on the person behind you. With how little space everyone already has, they just need to make the seats static.", "^Yup ^this", "Booked by people who have the capacity to plan ahead. No one is stopping this dude from buying his tickets earlier.", "same thing applies if you’re tall…if you’re tall pay for seats with extra leg room (this is coming from a tall person too)", "Oh look, we've found the person who understands nothing about weight issues.", "LOL someone existing and causing discomfort in a seat youve paid for and having a valid solution (fat ppl buy extra seat, tall ppl pay extra leg room) is the issue though? Not how the person came to exist in a manner that causes said discomfort. \n\nAre you saying that youre happy to have paid for a seat and be made to feel extra uncomfortable because the tall guy cant control his height? Even though they sell seats for people in his situation?", "EXACTLY. frequent fliers get it. I never recline as a default, or at all on a short daytime flight. But on a long and/or night flight of course i recline and I fully expect others to as well. Also, for the “my drink was spilled/laptop was a smashed” cohort - that’s on you too. I’ve taken hundreds of flights and have never had this happen even with a comically large work laptop because I know it’s a possibility that I anticipate and account for… not that hard.", "Yeah I fly all the time and nearly everyone reclines. I never have heard a single person complain except on the internet. It’s kind of just expected that you would, the seat is made to do it so why would they put the feature if they didn’t want you to? Plus if everyone reclines you get the exact same amount of space, it’s just tilted backward in a more comfortable way.", "I really think they're chronically online. I've never heard someone complain about it until reddit", "Glad I found this. I was scrolling down the messages and thought I was both insane and an AH.", "Thank you.\nI had to scroll way too far to find this comment. My husband flies much more than I do. When I say \"much more\" I mean he's reached some level of super-platinum status or whatever. (Just asked. He's got 1.5 million miles with one airline and another .5 million across other airlines.) He's also 6'4\".\n\nHe always puts his seat back and he thinks everyone has the right to do so. I told him about this thread and he was surprised by the reddit outrage. \nIt's not \"rude\" to use the provided seat as intended.\n\nThat said, I think it's polite to put your seat back slowly. No reason to smack someone.", "Reddit doesn't get out of the house much. Air travel and driving threads really drive that point home.", "On a bus I should just stretch out and take three seats right? Why not. I feel tall. \n\nTall guy should spring for economy plus at the minimum and not demand the space the other passengers are paying for.", "> Man I’m poor af, you’re telling me because I’m tall I just shouldn’t fly?\n\nI've seen greater stretches on Reddit threads tbh. \n\nI've seen threads about airline travel blaming people for connecting, and when the flight attendant announces \"We have some passengers with tight connections, please allow them to deplane first,\" saying that they should've paid for first class or found a way to go direct.", "Man if your arm rest still has ashtrays you’re flying some cheap ass dated airline.", "Being big, wide isn’t always preventable. It is apples to apples when you don’t fit the seat, for whatever reason. You proved my point about fat shaming, that people give tall people a pass and will discriminate against fat people or short people.", "Yeah we have recently been able to do that but for many have years at would show up to airports to be first in church in line so we could get emergency exit seats (they never used to sell them separately back then). Once they started selling them we would book those and pay extra as needed. Then premium economy became common and we started booking that...", "Those seats fill up quickly and not readily avaiiable.", "Disagree. The seats are incredibly uncomfortable unless reclined for some of us with back/neck issues. If I book a seat expecting to be able to recline it, why should I not be allowed to do so? If you want more leg room, you can book a bulkhead or exit row seat.", "If everyone over 6ft booked economy there wouldn't be enough seats on the plane.", "I personally don't recline as I don't find it comfortable. \n\nBut I don't blame others for wanting to use a function that is provided in their paid for seats.\n\nFar better than raging against other passengers would be lobbying the airlines to a) provide sufficient legroom and b) get rid of the recliner feature, on some or all seats.", "Those extra legroom seats are very limited and often sell out quickly, and I'm not gonna stop flying just because I'm tall. No chance.", "Windows are the way to go. As a 6'4\" guy with broad shoulders that' extra window well space is essential to not encroaching on the middle seat.", "If you live in an area Delta serves, I highly recommend Delta Comfort + because you get 3\" more legroom.  I'm a 5'9\" tall woman but most of my height comes from my legs.  Comfort + is better than a bulkhead row or exit row and comes with reserved overhead bin space right over your seat and get to board before the rest of economy.  It is slightly more expensive than a regular economy but well worth it.\n\ntagging u/Sea2Chi, u/pocketplayground", "I was on a flight this weekend, and the flight attendants were loudly calling out, \"Trolley incoming! Please keep your knees, elbows, heads, shoulders, and toes out of the aisle!\" They saved a lot of people that day.", "There were designs published that had passengers standing with essentially a bicycle seat to rest on, packed in so tightly.", "AAAA All Airlines Are Assholes", "From Wikipedia:\n\n\"In aviation, safety measures require all passengers and crew to be seated during take-off and landing, so airlines do not allow passengers to travel without a seat. However, in 2010, Ryanair, a low-cost airline proposed a \"vertical seat\" design for use by standing passengers on its aircraft.[6]\"\n\nThey're trying.", "It’s the *only* good thing about Ryanair, except that sometimes their tickets are cheap even if you take into account the fees charged on top for luggage etc.", "Ohhh, that explains why I have never really experienced that issue. The vast majority of the flights I've ever been on have been Ryanair!", "I agree: the real a**holes are the airlines.  They assume everyone is 5'2\" and weighs 120 lbs.", "Just know there is a reasonable chance someone's knees are going to hit you in the back all flight then.", "Totally understand.  And I am the same way. \n\nSo I pay for the seats that have more leg room so I know that I can recline with (some) ease. I don't want to chance that it won't be doable and then expect the person behind me to sacrifice their needs (which might have just as valid medical needs attached) in order to meet mine.", "Ditto, I have herniated discs in neck and back and a spine condition. Being able to shift and move when my back and neck start to get too painful is really important. If I have to sit at 90 degrees for an entire flight I'm going to be in a ton of pain.", "Your last paragraph shows you are kind and decent. I hope your back feels good today!", "Surely if the person behind you also reclines they regain the lost space?", "Is that why I always get back pain when traveling? I have scoliosis, not super bad, but enough to affect me a bit. Anytime I am on a long flight or drive for hours I have to take painkillers.", "My legs straight up don’t bend enough to go under the seat of a lot of flights. I’ve tried but the angles just don’t work. \n\nHonestly, I get people want to lie back, but I really think it’s a feature that needs to be used based on those around them, not just an automatic one. You’re in a shared space. Treat it like one, grow up and ask the person behind you if they mind.", "Then the airline should remove the recline buttons.\n\nThey dont, so the recline buttons are a feature youve paid for.", "Wrong! The airline seats can recline and thus when you pay for them you pay for the ability to use the recline feature. Saying they should have paid for first class makes you sound like a corporate shill. The only one who is the asshole is the airlines. They should stop boxing people in like canned fish.", "Maybe OP should have paid for the premium cabin?", "I think that's why this is a little gray  It's not her fault either. And while OP's height is not his fault, it is his burden more than those around him.", "That’s easy to say, but as a very short person, I cannot sit normally on the airplane chair because the back makes it so I am slighly bent over to the front. So, in order to gain a neutral position, I have to slightly recline the chair.", "For tall people, the person in front reclining smashes their legs. For short people, the weird chair shape can cause a lot of neck pain when not reclined. So the only AH here is the airline.", "That will be the next step...they will make the seats so they can't recline.  I personally dont recline my seat because I know how small the seats are and reclining doesn't give me much more space and why bother.  I can't even bring my laptop on flights anymore because it's so crammed I can use it anyway.", "Idk, I have scoliosis in my lower back, and depending on the airline and the length of the flight, sitting fully erect in those seats for more than an hour is really really uncomfortable for me. I don’t think there are hard and fast rules to what should be allowed on the plane, bc you don’t know everyone’s medical issues. Planes are too small and cramped for absolutely everyone.", "I have chronic back pain and would kindly ask the person behind if I could recline for a short while, making sure they weren't using their table tray. It's really all about being considerate of other people and their space, but it can be important for certain reasons.", "I am an aircraft electronics tech, my trainers, colleagues and me don't understand why they have that option either, most likely is as it is the same seat models as in economy+ and business class, where you get more leg room anyway and thus don't bother whoever sits behind you... \n\nhowever, reclining seats are slowly vanishing from airlines.\nWhich is a good thing in my book, as it is better for flight safety anyway", "Yeah I am a frequent flyer and never recline for this reason. I’ve experienced enough bad flights with the person in front of me reclining that I don’t want to do that to other people.", "For my part, I fly occasionally and have never been able to successfully recline a plane seat. Either I’m big dumb and just can’t figure out how it works or every seat I’ve been in has been broken. Not sure which", "It's like being at a concert with seats.  As soon as one person stands, the people behind them have to stand, and so on...  If the person in front of you reclines, it makes it so you have to recline, and so on all the way down the rows.  It's stupid.", "Completely agree. It’s a function that should just be disabled on all seats. While I would never directly call anyone an AH for reclining their seat, I am definitely thinking it. We are all uncomfortable. Why should I be made more uncomfortable for you?", "I think it's sort of a placebo - i.e. I did the thing that should make me more comfortable, ergo I'm definitely more comfortable now?", "Yes, it's annoying for everyone, even shorter people. It feels like you're getting squished and confined, and that you don't have enough space to breathe. You're stuck with the top of the back rest really close to your face / head.", "Ditto. I feel like reclining a few inches is fine, but reclining all the way is a no-no unless it's a red-eye where everyone is reclining to sleep.", "If doing something makes you an inch more comfortable and makes someone else a mile less comfortable, it's a dick move.", "Fly Delta, then. They removed the recline ability on some of their planes. Both times I’ve flown with them, the seats didn’t even have the gear in them anymore. I had to pay for an upgrade to comfort plus to recline.", "The price to upgrade leg room can be prohibitive. I think the most recent flight I was on charged $75 for more leg room. If you're living paycheck to paycheck and flying to a funeral you shouldn't be obligated to destroy your grocery budget just so someone else can recline. This is on the airline industry. They have a tendency to take, take, take.\n\nI'd rather spread the cost of a few more inches per person out between the tickets, but that means that airline can't charge as many: carry on fees, check bag fees, assigned seat fees, food/beverage menu orders. It also means fewer people listening to their airline credit card advertisment mid-flight. They literally have you trapped in a tube in the air with only their products and advertising.", "Shoulda switched seats with him lol", "I mean in reality they should. As a frequent flyer who is small even I feel pressed on by seat recliners. It just shouldn’t be an available function when even a 5’1 relatively thin person feels squished in the barely comfortable seats. It doesn’t actually make it more comfortable to sit in, it just pisses off the person behind you.", "They should", "I honestly don't know how people use those trays for anything anymore. I hesitate to even put anything with liquid on it just out of fear of a recline.", "I can't help being tall. Born this way. Fuck airlines. It has gotten worse and I cannot always get the extra leg room", "I don't understand why you think the fact that you have paid for something allows you to be inconsiderate with that thing.  I paid for a car with a horn, but if I drive around at 2 AM honking it constantly I'm an asshole.", "If the situation were different, people would feel differently. Sure.", "Most people with weight issues have the ability to lose weight with habit changes. I understand mental health and whatnot can play a factor. But don't pretend like overweight people can't lose weight.\n\nMaybe you're the one with a lack of understanding.", "Lol “in the moment” is such a weasel.  They’re not actually comparable without that and, as the saying goes, poor planning on your part doesn’t constitute an emergency on mine.  Meanwhile the only way for me to get shorter would be to literally chop my legs off.", "Yeah i dont understand how that even happens? How do their electronics get any damage?", "And by changing the angle of your back, you're also changing the angle of your knees and legs which would make it easier to use the space under the seat in front of you.", "Someone sitting in their own seat isn't demanding space that other passengers are paying for. Where the fuck is someone's legs supposed to go, if not in front of where they're sitting? It is solely the airlines fault for double selling the space. By someone reclining they are taking away the space from the person behind them.", "Sometimes you find the exit row seat with NO seat in front of you! There’s no feeling like getting that seat! If my husband or I are traveling alone and this seat is available we grab it, otherwise we have to go first class for the leg room too.   \n\n\nIt’s not just 5 hours of discomfort, the pain stays with you long after you leave the airport.", "I am short and consider it an AH move absolutely. It makes it impossible to use the tray table and can make it annoying to use built in screens. Especially on short flights, it’s extremely inconsiderate. (Overnight/international I understand.)", "I'm 6'1\"(which is not that tall) and it is not an AH move tor recline. Everyone payed for the recline (except last rows and rows in from of exit rows) and everyone is allowed to use it.\n\nThere is nothing more selfish than saying \"You need to sacrifice to accommodate my needs\". The person behind can ask but that is all.  Imagine if you neighbor stopped you from cutting a tree because they like the shade. \n\nAdditionally, modern airline seats down actually move back very much in the knee area when recline. Some not at all and actually move the seat forward.\n\nFinally there are ways to get your legs under the seat in front. You can stretch them out to lower the knees. Diagnal etc.", "As a fat person I absolutely agree with you. He literally can't do anything about his height and seats with more legroom are limited. And depending on his physical condition he may not even get a seat at the emergency exits.", "I don't even have any existing back injuries, but if I don't recline on a >3.5 hour flight for at least an hour or two, my upper and mid-back are in pain for about 24 hours following it.", "Nobody except complete assholes thinks others are assholes for reclining their seats. I recline on a flight every time, and so do the majority of passengers on every flight I've been on. You're ridiculous.", "6'4\" and broad shouldered, too. I got stuck in a middle seat due to a last minute booking for a trip I had no control over. a 4 hour flight with my knees jammed into the seat in front of me left me with pretty major bruises on both knees and shins for a week or so.", "Girl same. I'm 5'8 and I have a longer inseam than my 6'' boyfriend. If I could buy pants at the store without ordering them online, my life would be complete. I try not to be in other people's way, but sometimes it happens. Luckily most people are understanding, and I help out by reaching things on shelves that they can't.", "That is so true - I’ve paid over $250 for exit row seats, which while they have extra leg room, have a few challenges as well (if the exit is near the bathroom, you have people standing in your space waiting for the bathroom.)   The TV comes out from beside your seat, rather than being on the back of the seat in front of you, and it can be a real pain to maneuver the TV when your tray table is out (which also comes from beside you rather than being attached to the seat in front of you, if you’re facing a wall.)\n\nPremium economy has more leg room but it’s a lot of money and business class prices are ridiculous.\n\nSomeday someone needs to take the airlines to task for giving passengers less and less space and charging more.   I truly believe that the CEO of each airline should be forced to spend at least 100 hours in the worst seat on their planes; it might change their perspective.", "They made me bring my legs into my space and keep them out of the aisle. no advantage to the aisle set without that. :(", "I'm 5'4\" and my knees hit the seats too. I don't even understand it. I have a very short torso, but like, my legs can't be THAT long.", "I understand needing to recline and am ok with people doing that.  But, just because you have extra leg room doesn’t mean the people behind you do.  Just saying. I always get extra leg room and recline for longer flights, but I don’t think it solves the problem for people behind. That’s the airlines issue.", "Probably, yes. There is physical therapy that may be able to improve it by strengthening the muscles that support your spine.", "So if the recline button is broken, you deserve a refund because you aren't getting what you paid for?", "Yep, I avoid airlines where the seats don't recline in any flight longer than 1 hour because I get back and neck pain if I don't recline, even using neck and dorsal pillows.\n\nI don't use united either because the seats recline too little for me, last time I was in one of their planes for 8 hours I had back pain for 3 days.", "Same. I also have a bad back and hips (arthritis) so leaning slightly forward is excruciating. I need that, like, one inch of recline to be able to sit somewhat normally. I do try to be aware of who’s behind me and I don’t recline into super tall people, but yeah the difference for me is significant.", "Same here, also have a bad back.", "OP's comment about people leaning back, \"I feel that people who recline their seats in economy are annoying and inconsiderate\" is assholeish. \n\nYes, airlines suck for cheaping out, but OP should book an exit row if they are truly squished into their seat this much, and not call others \"annoying and inconsiderate\" for trying to get as comfortable as possible, by leaning back 5 degrees.\n\nYTA.", "This!! I shattered my tailbone years ago and sitting in the unreclined seat causes me so much pain. I only recline just as little as I can to take the pressure off my tailbone. I hate to do it cuz I’m not tall at all but otherwise I’d also be in tears pain. The real asshole is the airlines. Im so sick of them squeezing everything out of us and making flights even more uncomfortable!!", "Exactly. My back issues make reclining essential to being able to function for the next few days. If someone has the option to purchase legroom and chooses not to, that shouldn't mean I end up in agony. I don't even need extra legroom, just for my seat to not be fully upright, which is rarely something one can buy except on an international flight.", "yes, I came here to say this. I injured my back, hip, and damaged my si joint in the army 28 years ago.  Sitting upright is excruciating. I gently recline as soon as I can in planes. My car seat is always reclined.  \n\n\nOP needs to understand while he has physical constraints, so do others.  Mine is solved by reclining in any seat except last row.  I only made that mistake once and was bent over and limping my whole vacay. Likewise, tall guys like him need to pay for tickets that accomodate him.", "Agreed. I am someone who also needs at least a slight recline or I am screwed on my right side for a minimum of a few days, and it can even effect my grip strength. I have to be careful with everything I do and a plane is one of the worst places it happens. I once was in the last row (seat was against wall so no recline), in the middle next to my bf with broad shoulders and the aisle seat had an even larger man who spread his leg completely into my space, dominated the armrest and kept pushing me in on purpose taking up some space in my own seat as well. The pain I felt after was terrible and I was limited for days after, maybe even a week. It was still one of the worst experiences ever and I even recorded him pushing my arm off the armrest. He was aggressive on top of it and I couldn’t do anything about it, I was actually really upset because he was also veryyy muscular so his pushing really hurt. Thankfully it was only from Las Vegas to Reno but by far the worst flight of my life (and I’ve been flying since I was 2 weeks old). I could barely carry my backpack after because my nerve got so severely pinched.", "This. Its part of the reason I generally fly first class (not hugely expensive to upgrade for domestic flights for only 2 people). Its not a solution to the back injury for a lot of people because its added cost. I look drunk when I stand up after sitting upright for more than 30 minutes. Its horribly uncomfortable too. Its easy for tall people to say \"well people with back injuries should shell out for first class\". I can just as easily say they should be the ones shelling out since they clearly don't fit into their allotted space. My partner is a big guy. He likes first class for actually having leg room. I hate when I'm in coach and people recline but ultimately its not them I should have beef with. Its the airline.\n\nIts not rude to prioritize yourself over people who are saying you are rude so they can prioritize themselves by shaming you into giving them priority.", "Counterpoint - Let's say I'm 6'6\" with a bad knee.  Who says your bad back takes precedence over my bad knee? These are both things that we cannot control, and we both have the option to get bigger seats. The airline basically sold the same space twice because you are not able to recline with my knees in the way.\n\nIn real life, I am 6'6\" but with two good knees (for now), and I will usually grab the aisle seat and try to pay attention to trolley movement and hang one out, which gives the person in front of me the ability to recline.  I'm not overly excited about it, but like you said, some people will be in less pain if they are able to lay back a couple inches.  You might take a unintentional chair shake or two while I readjust during the flight, but that's just the give and take of it. \n\nThe main issue here is the airlines, and to a lesser extent, manners.  Some issues can be resolved by just being polite to the person behind you and explaining the situation, unless that person is a dick, which seems to be more commonplace nowadays.", "I think one of the biggest problems with the seat design (other than space) is the angle of the headrest.   It goes slightly forward, making it pretty much impossible to sleep without your head bobbing, even with a neck pillow.   I’m sure they do it in case of a crash, but I’m willing to sign off on possible neck injuries if I could just lay my head back on every plane I take from now on.   I wouldn’t need to recline if I could just lay my head back.", "It has never occurred to me to ask to recline. Nor has anyone ever asked me if they could. I absolutely would not complain about someone typing on their tray… unless you were aggressively doing so to make a point, which is a passive-aggressive AH move. \n\nThe airlines have designed this hell for us. Reclining, and using the tray in front of you, is to be expected.", "for real??? I've never thought to ask. I just do it slowly so I don't hit someone. I don't believe asking is expected.", "Same fly twice a week and think that no one should ever recline, shouldn’t even be a function on the seat.", "LOL I have never heard of anyone asking to recline. I'm over 6 feet and no one has asked to recline nor have I asked to recline.", "Wow, purposefully shaking someone’s seat because they didn’t defer to you about the use of their own seat.  You sound like a real peach.", "this is kind of a dick move, sorry. I've only ever flown twice in my life (one trip there, one back) way back in 2014 and I wouldn't know this weird unspoken etiquette thing, especially because nobody asked me about reclining before reclining their seats in front of me. I just followed their lead and what you'd do to me for the crime of not knowing an unspoken magical airline rule is make me motion sick, nauseous and then I'd have panic attacks because I'm terrified of vomiting. Not cool.", "Many don't recline. But not every flight is 100% packed and these should be the last assigned seats.", "Nah, you're wrong. This is 100% the airlines fault. You should assume the person in front of you is reclining and you should too. If you randomly get the back row that can't recline, that sucks, but blame the shitty airline's corner cutting capitalism. You're functionality metaphor also makes no sense-- reclining is a structural feature built into a device. Kicking is not a feature of the chair.", "I feel like everyone in here is being self-centered, because we’re all discussing a situation where we’re competing to get as close as possible to having the bare minimum of our human needs met.\n\nI have chronic hip and back pain and if I don’t recline I will be in agony the whole flight. If this were fixable in some other way where it didn’t impact anyone (like if I had long legs and could take an emergency row seat), I would do that. It is not. So we all have to do our best. Reclining or not does not an asshole make.", "I thought about it but the row in front of me was for people with disabilities, kids (you know with extra space and the wall in front of them). \n\nSo, I would have been confortable and bother someone else who needed to lay down way more than I need :(", "Car horns are not designed to be reasonably used at 2AM to wake people up. Airline seats are designed to be reasonably used to recline for your comfort, just like the seat of the person behind you. \n\nYour use of it as it is intended is absolutely reasonable and not an asshole thing to do.", "Yup. The only time my knees touch or get close is when not reclining. As soon as I recline, everything lines up.", "Do you not see the hypocrisy of your post? You say it's selfish to tell someone to sacrifice for your tain - which is EXACTLY what you do when you recline. You remove the space available from the person behind you when you recline. Not to mention you remove their ability to use their tray for food, drink and ability to watch / use the screen on the chairs.", "Yea the seats are terrible. The airline is clearly the villain for raking in money hand over fist while we struggle for basic comfort. It sucks.", "It's amazing how even with back issues you're completely lacking in empathy for others. What's even more interesting is that you think your lack of empathy means other people are assholes, rather than the obvious conclusion most people would draw.", "The seats that can’t recline are discounted just like middle seats are.", "Agreed! I have never heard of such a thing.", "There's the truth. Why is the standard women's inseam 28''?? Why can't we have waist x inseam sizes INSTORE like men do?? I need a 32'' for skinny pants and a 33-34'' for wider ones. At the very least. My brother/my dad can walk into an American Eagle and grab a pair of 32x34 or 34x34 jeans off the shelf but I have to stalk the website on the off chance that model was made in a Long. ???", "So you're also on the \"Pantleg should reach to the top of my heel but instead sits 5 inches above my ankle\" train?", "My whole family has long legs and short torso’s.   I’m only 5’5 but I’m like 75% leg.  Belts look absolutely ridiculous on me. Pants and jeans are always an issue.", "Man, I'm jealous of you guys at 5'8 and 5'9. I am 6'2 and the struggle to find pants is unreal. I have relegated myself to joggers and ankle swingers as they're in style. Where in the heck do you order long enough pants/jeans online?", "Where are you buying pants online? I have this issue too and am tired of pants not fitting correctly.", "The airlines are screwing everyone over. They are the enemy in all of this.", "The real AH here is the airline that charges BOTH passengers that same space when only one could use it at a time.", "If the button is broken you can take off the seat cushion and pull a cable/lever and the seat will recline just fine. ;)", "Sure. Cant hurt to try.\n\nEdit: the fact that even this comment is heavily downvoted with no responses says everything I need to know. I've activated the hive mind and no one will see reason, at this point.", "I mean technically yes. \n\nIta a shit set up and I think reclining is rude but it IS part of the advertised seat. The fact that it sucks is irrelevant when it comes to what she/OP  paid for", "I am 4\"11 and those seats are definitely not made for my body. My feet don't reach the ground, I have tailbone pain and the curve of the seat in trains and planes and busses stack my body such that my entire weight is balanced on my ass bone. Even before the tailbone pain, my lower back would go numb sometimes from the weird position. I never had to recline before but I definitely do now.", "Since \"ergonomic\" usually means it fits the average man I imagine that if you are the average woman the seat isn't going to be comfortable at all.", ">I only recline just as little as I can to take the pressure off my tailbone. \n\nIsn't it amazing how the slight change in angle can make a huge difference??\n\nI also only recline slightly usually (the exception being if it's a long flight, then everyone reclines fully to sleep) because I just need the seat to shift a bit. When it's upright, I feel like I'm being curled inward and my spine is screaming but just edging back slightly brings so much relief.", "If I don't recline for at least an hour on a >3.5 hour flight, my upper and mid back will hurt for about 24 hours.", ">Let's say I'm 6'6\" with a bad knee. Who says your bad back takes precedence over my bad knee?\n\nSomeone with a bad knee may be able to angle into the aisle a bit - someone with a bad back can't. It is a conflict between valid physical needs, but I will prioritize the needs which have no alternative over the needs which have an undesirable but available alternative.\n\nIf someone cannot angle their knee out for some unknown reason (not sure why they wouldn't but let's pretend) then I'd say we should contact a flight attendant to see about switching seats.\n\n>These are both things that we cannot control, and we both have the option to get bigger seats.\n\nNope. \n\nGetting a bigger seat would help your leg - it would not help my back. The size of the seat isn't an issue, it's the angle they're built at. There is no upgrade that I can pay for that helps without reclining a couple of inches. Other than a private jet maybe...but I don't think that is a reasonable alternative.\n\n>The airline basically sold the same space twice because you are not able to recline with my knees in the way.\n\nYep. Which is why the airline is the real asshole here.\n\n>Some issues can be resolved by just being polite to the person behind you and explaining the situation, unless that person is a dick, which seems to be more commonplace nowadays.\n\nSure, if the person behind me protests I will explain why I am reclining. And I will usually only recline partway (the exception being a very long flight / overnight flight) because my back doesn't require the full recline so I don't intrude any further than needed. I won't ask permission for - this is something that I am both entitled to and that I require. I will be as considerate as possible *without* causing myself undue harm.", "Getting more legroom would help for your knee issue, but not for my back issue. I'm quite small, but have scoliosis. I need to be slightly reclined, not in a bigger seat or with more legroom. You can pay extra and solve your issue, I cannot.", "You can buy a seat that allows for more leg room. I can’t buy a seat that lets me recline if someone behind me thinks they matter more than everyone else", ">I wouldn’t need to recline if I could just lay my head back.\n\nShit this is exactly my issue too. I commented elsewhere that when the seat is upright, my spine is actually being curled forward and that's what causes so much pain. I need to recline because the upright position isn't ergonomic at all.\n\nI was already of the opinion that the airlines are the assholes but now I'm completely convinced.", "Also in my 30 years of flying I have to say I’m shocked by so many people saying you’re an AH for reclining your flight seat. I have never once met someone that thinks it’s rude to utilize their reclining feature.\n\nI forget how wildly out of touch with reality Reddit is sometimes.\n\nAnd my brother, who is a frequent travel partner, is 6’2 and he’s never once thought to get pissy with folks for reclining their seat, and same goes for my boyfriend who is also 6’2.\n\nIf space is that much of a concern for you buy two seats like this sub always tells obese people to.", "Frequent flier myself - can confirm. Does this thread not leave their house or something?", "Agreed. If anything I never recline all the way, that would make me feel self-conscious. But a little? It's not even an afterthought.", "Was looking for this post. A transcontinental flight is a different ballgame altogether", "That's ridiculous, the seats are designed to recline, it's the first thing I do. It's the difference between really uncomfortable and bearable.", "Out of curiosity, which airline? Airlines where I've been in a reclining back row this year include KLM, Singapore Airlines, Air India, British Airways, Thai Airways, Emirates, Etihad, and Lufthansa.", "It’s fine for you to think that, but are you going to be a jerk to me everytime I have to move and knee your seat? If you recline, I WILL knee your seat anytime I shift. If you’re all good with that, then I’m good with you reclining into my lap, but if you’re going to be a jerk about my knees then keep your seat upright. I am physically incapable of being shorter for your convenience. \n\nThe ego part is thinking you’re entitled to making other people physically uncomfortable without being physically uncomfortable yourself. If you understand that the tall person behind you is going to make you uncomfortable when they move, then godspeed spider-man recline to your hearts content!\n\nETA: If someone is intentionally kicking/kneeing your seat then they’re an AH. Tall people (anything over 5’8, which isn’t actually tall but w/e) are going to knee your seat completely accidentally. Trust me. We don’t like this situation any more than you do and I don’t get to control when I travel for work", "Not sure where you are, but I also have long legs and have found Silver Jeans, Maurice's Jeans, and INC jeans in long right off the shelf. They also have huge selections online. It took me forever to find regular jeans in a long. My western jeans were easy to find in long lengths but regular jeans were a pain to find if they even made them. Hope this helps!", "*psssst* *gestures you closer*\n\nBuy men's pants. Get them tailored, if need be! I've been doing this for years!", "I’m 5’2” and don’t understand what y’all are complaining about!😂😂😇😂", "I’m short and the standard inseam is waaaay too long. Why do they think all women are the same height?", "Old Navy has talls that should fit you!  The skinny jeans on me have some extra length, so I think they’d work for you.  I used to do American Eagle, but finding their extra-longs (the longs aren’t long enough for me) is almost impossible.", "Old Navy!  Get the talls, not the longs.  They are often on sale and are a good length!  I used to do American Eagle, but they are always out of the longs or extra-longs.  I switched to Old Navy and I’m never going back.  Their WOW jeans are cheap and a good quality!  The flares do fit bigger than the skinny jeans though; I wear a 12 in the flares and a 14 in the skinny jeans.  The 14T in the flares were huge on me.", "Ya, they go back like 15cm at the top and considerable less at the bottom, it's not like you're laying down in their lap. I feel like whenever I've flown like 80% of people recline and never seen someone complain so I have no clue why Reddit decided it's evil", "Etiquette to me is no one reclines. Ever sat in the last row where you can’t recline and have someone in front of you recline makes for a shit flight", "I don't either, but I am very short. I didn't even realize this was a problem til a tall person explained it to me. People reclining in front of me don't threaten my legs. It's great that you fit just fine either way, but not everyone does.", "I fly for loong hours like shortest flight is 5 hours before a stop over. I never recline my seat if theirs someone behind me, and when the person Infront of me does, it ruins my whole flight.\n\nI'm really small too. But, when the person Infront of me reclines, my screen goes down too so watching anything is a hassle and getting out and back in to my seat becomes really uncomfortable. \n\nI get that they've paid for it which is why I don't say anything but it's still very annoying.", "> If space is that much of a concern for you buy two seats like this sub always tells obese people to.\n\nThat would not do a damn thing for those of us with long legs.", "I think it's interesting that people keep saying no one around them has ever gotten upset about reclining before in real life.\n\nThat's absolutely not true.\n\nPeople behind you just didn't feel like saying anything because they perhaps didn't want any kind of confrontation and you had a right to recline. Even if they were uncomfortable.", "The person behind me thinks I'm an AH because the person in front of me reclined without asking? Interesting.", "Air travel in general really brings out the main character in people.", "That's the only scenario I've had someone complain IRL. The lady behind my fiancee threw a tantrum kicking and yelling for 10 minutes when maybe 90% of seats in the cabin were reclined.", "On US domestic flights I’ve never had one that does recline. But every non-US airline I’ve flown had the back row recline. More reasons that I’m glad to not live in the US (so I don’t often need to fly US domestic)", "You just listed the entire \"Best economy seats on a flight\" airlines lol", "If you knee my seat, I’ll just call the flight attendant. Reclining is normal, kneeing seats is being an AH. You don’t get to dictate how I use my seat, and you’re the only one here with an ego thinking that you have that right.", "They almost are though? His knees are effecting her space", "Exactly. The woman in front of OP is also not required to shell out for a seat with more reclining space to protect OPs comfort. The ticket includes both how far your chair can recline and the space in front of you. Take it up with the airline for selling the same space twice.", "Why not? If OP was 400 lbs would they just claim the space of the seats next to them too?", "OP is expected to shell out extra money because they are too big for the seat they purchased. Just because it doesn’t inconvenience them is not the issue, it inconveniences others who are just trying to use their seat as it was designed to be used. \n\nThe same thing goes for obese people who are too big for the economy seats.", "The person who is tall can pay for a seat with more leg room. Everyone pays for a seat that reclines, and if the seat can’t recline due to location it’s cheaper.", "People who are too fat have to buy extra tickets. No different than tall folks paying for an upgrade.", "I don’t think I’ve ever seen those brands in store here (I’m up in Canada, maybe that’s the difference.) The only store I’ve found that has longer inseams in stock is Levi’s *sometimes* but it’s luck of the draw even there.  \n\nAlas! But I appreciate the recs.", "I’ve tried!! But in order to get a pair that fits my hips they end up baggy and weird in the legs, even if I get the waist taken in. \n\nMy favourite jeans are a men’s pair I thrifted but they’re the skinny extra stretchy kind so you can’t really tell.", "Right!? I don't get this either. Admittedly, I think it's a bit unnecessary on say...a < 3 hour flight unless (as some people earlier commented), they have back pain or other issues and need the comfort.\n\nBut I do a lot of trans-Atlantic flights (\\~10 hrs) and pretty much every single person will recline their seat during those flights, and I have never once seen anyone kick up a fuss about it. Tbh, I think OP is in the wrong here. If you need the extra legroom, you should make the effort to choose a more spacious seat. I think it is akin to wanting to switch seats with someone so you can sit with your party. If you didn't make the effort to choose seats together in the first place, your discomfort is on you.", "Some seats even slide forward at the base when the top reclines. I think the Airbus 321 and 220 do it.", "I do think on a long, overnight flight, you should be able to recline once they turn the lights off.", "You're really going to take a 12 hour overnight flight without reclining your seat? Doubt it.", "Well then you got a shit buddy, that sucks but is not the problem of the person in front of you. These setts designed to recline.", "I'm 6'2 with long legs, I've never had an issue with a reclining seat and legs. Most chairs recline little or not at all at the base, some even slide forward when they recline. \n\nThis is a Reddit argument, not a real-world one.", "I am very short and never reclined until recently, because I have tailbone pain and have to in order to get relief. My legs never touch the ground either, so literally my entire weight is balanced on my busted ass bone. It fucking hurts. I will definitely recline a couple inches unless some sort of Goliath is sitting behind me.", "I think you're right and I also think a lot of the opinions on this thread are from people who fly in mostly US domestic economy. I fly a lot internationally, all 6hrs+ and everyone always reclines without asking and the back row always has room to recline. US airlines are hell compared to almost everywhere else.", "Good luck proving to the flight attendant that I'm doing it intentionally and it's not just a consequence of the lack of space.  All you're going to do is look like an asshole to flight staff and everyone around you, but you do you.", "So you get to dictate that I’m not allowed to move? How is that remotely okay? I’m not talking about intentionally kneeing your seat. I’m tall enough that if *you* recline *your seat* all the way, you will pin my knees. I can’t control that. If I have to use the bathroom or even remotely shift in my seat, I will knee you *unintentionally*. \n\nThe intended function of the seat is *firstly* to sit. I don’t see how I’m the asshole for just…. sitting.\n\nIf you recline and understand that every so often you might be bumped a little by my knees, we’re good. You can’t recline and then throw a temper tantrum that the person you’re inconveniencing is…. sitting there?", ">almost\n\nAlso, that space is his just as much as it is hers, the only difference is he doesn't have a choice in whether or not he uses it. \n\nActually, I'd say it's more his, since in the default state of the airplane, it is his.", "OP's comfort is protected by the fact that the person in front physically can't recline. She wasn't an AH for trying imo, but she was an AH for making her problem his problem.", "That literally happens all the time and most people just understand that no matter how big you are, they're still a person that the airline decided profits were more important than?\n\nLike grumble in your seat, no one's saying the situation doesn't suck, but don't take it out on a person who can't magically change their bodies or financial situations on a whim, damn.", "> If OP was 400 lbs would they just claim the space of the seats next to them too?\n\nThat's a different situation. Your ticket entitles you to your leg room, it doesn't entitle you to the seat next to you.", "No, everyone pays for a seat, and airlines falsely advertise that they can recline. They literally put trays, phone holders, etc on the seat backs. Get mad at the airline not the tall guy behind you.", "So he has to go from paying for economy … to paying for business class ? LOL\n\nSo he pays double the price because he’s 5 inches taller than the average sized man ?\n\nWhat planet do you live on?", "I wouldn't consider myself unlucky to be in front of him, because I never recline my seat because I think it is super rude. If everyone over 6ft on a flight booked business class there wouldn't be enough seats for everyone.", "And you know that you have spine issues, so YOU should pay for business class to guarantee you can recline. My point was the man's height is out of his control. Given the insane price differences between economy and business, we should be far angrier at the airlines instead of each other, because people of certain heights and with spine issues shouldn't have to pay a bunch of extra money for a basic accommodation.", "Why should he have to spend money to accommodate you? You should pay for business class if you need to recline", "Levi's are definitely hit and miss. INC is International Concepts so hopefully something easy to find. Silver Jeans also has their own website. Both of those brands are found at Macy's if there is a Macy's where you are. I am in the US. Good luck!!", "Maurice's is def up here in Canada (there is an actual brick and mortar store in Ottawa for example), Also Old Navy Tall, if you are a hefty gal, Torrid has Long and X-Long that go to 36 inches.", "Had to apologize for reclining on my latest trans-atlantic flight. There was something wrong with the reclining mechanism so after the first 3cm it just free-fell backward. Sent me flying back at mach 5 :D / :(", "Yeah just don't book the last row lol", "I can only imagine how much compassion you have for those around you to not give two fucks about discomforting someone else a lot over a small gain for yourself for a couple of hour flight", "I brok my tailbone too, and a tailbone cushion is sooo worth carrying around.", "I like how in your head purposefully injuring someone with your kneeing is somehow not being an asshole.", "You’re allowed to move. Recline your seat during cruising like a normal person. Like the seat was intended to be used.", "They can recline and it’s part of what you pay for. If your seat backs up to a bulkhead and literally can’t recline the seat is cheaper.", "Ha oh man, that is one thing that worries me! I try to recline gently and to not move my seat around too much once I've got it into a good position. But sometimes it's stiff and then you have to give it a shove or it's just flying backwards and you feel terrible! \n\nI think what irritates me, rather than the actual reclining, is when people keep moving the seat up and down constantly. If the person in front of me reclines, I get adjusted to the new position so it's more of an inconvenience if they keep moving it than to just recline and stay put.", "Someone reclining in front of me has almost zero impact on me. It doesn't affect most people so most people have no problem reclining. I've never hit someone's legs reclining, but if I did I would sit back up. Why are y'all so bothered by it? Y'all are acting like babies", "Okay then we’re on the same page! If you recline you’re going to be uncomfy every so often when I move and I’m going to be uncomfy because you’ve pinned my knees. No problem with that.\n\nWould advise not getting the flight attendant though. In my experience they’re more likely to tell you to stop reclining than they are to tell me to chop my legs off or grow shorter or buy an additional seat.", "It's not. I'm looking at flights right now, the back row is the exact same price. If you hover over the seat, it even says \"Limited or no recline.\"", "NTA I’m a small person (5’1 115 lb) and even I hate when people recline on me. Airplanes simply are not big enough for anyone to be doing that.", "NTA\n\nI once sat with my fist pushed into the seat ahead of me for a 3 1/2 hour flight so the child in front of me (whose legs dangled from the seat) couldn't recline.  Whoever designed airplane seats to recline needs to step on a Lego in the dark.", "Nta. As a fellow tall person who can do nothing to shorten my bones, if I fits I sits and if I pay I stay. Pretty sure no one is 100% comfy on economy planes by design, else no one would pay to upgrade. So it's a bit pants but everyone's in the same boat. I'm always open to a nice conversation with someone about it, I like to compromise  because everyone's comfort is equally important. But if I smell entitlement, my stubborn mule kicks in.", "NAH. She has the right to recline her seat, she paid for it. You physically can’t let her without encroaching on someone else’s space. 6’5” is tall but I know tons of people that height and varying weights that I consider on the bigger side of normal but not uncommon. The airlines are the AH here. If you’re 7’ and 300lbs then I understand you need to get a non-economy seat but there is too many people your size to not accommodate.", "As someone who generally prefers at least a slight recline (I have a shoulder/arm/wrist injury that leads to a pinched nerve often) I say NTA. Your communication was clear and given your height I’m sure the other passenger could tell. I think it’s very considerate of you to not take up the people’s space next to you, and the person in front of you should have been able to understand all of this. I would have sacrificed my need to recline because of your situation, and just let the pain in my shoulder-wrist/hand exist for a few days after since I can fix it with enough stretching, because sometimes that is necessary. I know people will say I’m an AH for reclining at all but I cannot express the pain I experience after flights I can’t recline a little in, and I have to take care of myself (I’ve been to an orthopedist and the most they can do is physical therapy).\n\nANYWAY. Again, you are NTA in my opinion. And the BIGGEST AH in all of this are airlines/whoever shrunk the space in planes to fit more people for bigger profits. Remember when planes had normal space for people, and over the years it’s gotten smaller and smaller for everyone? Pepperidge Farm remembers. So yeah, fuck the airlines & people that shrunk space in planes, because that’s the biggest issue.", "NTA - Reclining your seat gets you what..a quarter inch?  That 1/4\" is much more important to the guy behind you if his knees are already touching the seat than it is to the person who wants to recline.  I actually never recline my seat knowing that it's provides much less benefit to me than the level of annoyance it creates for the person behind me.", "NTA being tall isn’t something you can change.", "NTA, these people are evil", "NTA. I’m 5’5” and I rarely recline the seat. I mean why? It’s what an inch for me, but four for the person behind me. If I do recline, I do it slowly and make sure that the person behind me isn’t inconvenienced. I’m short enough to put my jacket or a pillow to support my lower back after sliding the inch in my seat and forget about reclining. I wish people could be kinder these days.", "NTA, reclining seats is a privilege not a right.", "It not your fault that the she cant recline , airline cramp seats close and closer together with every new planes they purchase . There was a concept design of standing seating in future airlines which is terrible idea just for profit .", "NTA as a fellow tall person with long legs people that insist on reclining make me want to lose my damn mind. We can’t help how we were born, you can decide to recline and be an asshole to the person behind you", "People who recline are indeed TA", "NAH.  The only asshole here is the airline for not providing enough room for passengers.", "Yes, it's a shared space, and everyone is uncomfortable in economy.", "The airline and the other passenger are the assholes here. You don't get to berate a complete stranger because the airline inconvenienced you. OP is the only NTA here.", "I agree that reclining isn't inherently an AH move. But when the situation is what OP faced, yeah, that person is being inconsiderate to the person behind them (OP). \n\nOP also shouldn't be expected to pay more for comfort they don't feel is necessary, regardless if they can afford it or not. \n\nThe airline is ultimately the ones at the root cause of this for cramming their planes. But do not give that rude woman a pass. She was an AH, through and through.", "I fail to see how she isn't TA when he made it clear he can do nothing about this predicament and she insisted on absolutely needing to recline her seat for a short flight like a spoiled brat", "> No, they're just trying to get comfortable in their own tiny seat.\n\nIf person A reclines their chair on a flight, with the knowledge that this will infringe on someone else's space, this is pretty douchey. Yes, it's ultimately the airline's fault, but in that moment, only two ppl are involved. She's saying she wants more space at the expense of someone else's space. If she doesn't move, she has equal space as the person behind her. The only way for her idea of space to be reciprocal is every person on the airline also leans back. She also claimed he was gaslighting her as opposed to actually having a valid reason for not wanting her to recline.\n\nObviously, if some tall guy goes on flights just to call out other ppl and to guilt them, he's an AH. OP goes out of his way to emphasize his respect for other people's space. He mentions when another big person is next to him, it can get touchy, but this implies that he is capable of compromise and getting through the tougher situations. \n\nLastly, \n\n> Maybe, if it makes sense for you financially. Sounds like you'd be more comfortable too.\n\nThis is almost a blame the victim mentality. You said \"maybe\", \"it if makes sense\", \"sounds like\". Three different ways to make OP \"think more\" about the issue, as if some rational thinking will make him realize he is wrong or can make better decisions. The same logic could apply to the woman in front of him. If she could afford it, sounds like she would also be more comfortable upgrading the seat. It's not like he is spilling into double the seat territory, he just wants legroom that should legally be allotted to someone that can purchase that seat.", "This. OP is tall and that causes visible discomfort. Someone with abdominal, pelvic or hip pain might be even more uncomfortable, but he wouldn’t know it to look at them. Flying sucks for all bodies; everyone, especially airlines, could be a bit kinder about that.", "As a small person I can attest that all of the tall and wide shouldered men have absolutely encroached on my space to get more comfortable with no qualms because I don't \"need\" it. I haven't sat by any women above average in size so I can't speak to that experience.", "reclining on a 4 hour flight is ridiculous everybody knows reclining on relatively short flights is inconsiderate and creates a domino effect of discomfort its so pointless and isn't even that comfortable", "Exactly!", "Perhaps the worst take in this entire thread, but a great reminder to never get your morals from Reddit lmao", "Why have the feature of a tray at all if it can’t be used if someone reclines? It literally goes both ways.", "Paying extra on top of an already-expensive airline ticket just simply isn’t an option for a lot of people. Genuinely curious what you’d suggest they do?", "Reclining is part of the seat they paid for tho, how are they inconsiderate? If people have a problem with the person in front reclining, pay for a business class seat then!", "[removed]", "The laptop crushers are the worst. I fly a lot and am always working on my laptop. The first thing i do after boarding is to check out the person in front of me. You'd be surprised how accurately you can predict who is going to slam their seat back without warning.", "You're an idiot.  Not reclining on a 14 hour flight??? Give me a god damn break.  The seats are meant to recline, and if you pay for your seat you can do whatever you want with it.  Get a grip you moron.", "If you recline, you're basically lowering your head into the lap of the person behind you. It's that close. Even if you recline only a little bit, they are basically breathing on the top of your head.", "I'd rather have the ability to recline, and the person in front of me reclines, than having no reclining ability. So not everyone agrees with you.", "If nobody's leaving their space, nobody touches. Ever. Dude probably doesn't realize that he's encroaching on his neighbours space because they're politely moving away and not bitching at him for it.", "I don’t live in the U.S. anymore and now mostly fly business class on European and Asian carriers thanks to status and points (look into this folks, you don’t have to be rich to be in the front of the plane), but back in the early days of my career I flew Southwest around the U.S. a lot and always was in the first boarding group. As a 160cm, fairly narrow lady, I NEVER took a bulkhead or exit row seat, I just didn’t need the space, so I would have felt guilty. I also was a “never recline” person until my first 6+ hour flight in economy, and then I realized how much that slight recline impacts long-term back comfort. I would say that on long haul flights, economy reclining is expected and considered polite once the full meal service has finished.", ">I swear the “it’s rude to recline” group must never fly.\n\nI was blown away reading it in the OP but seeing it so much in the comments is really making me feel crazy. How is it rude to recline your own seat? Now, I see the issue of encroaching on other passengers' space, but that's on the airline. I have never and will never ask for permission to recline my own seat. \n\nWhat I do to make it good for everyone is recline slowly, basically with a short movement to communicate \"I am reclining now\" then slowly adjust to where I want it. That way if they have something in the way, they can move or stabilize it. I already felt like that was going above and beyond.", ">You literally gain minimal comfort reclining vs not reclining\n\nYour experience is not universal. For someone with spinal issues, reclining even a little bit makes a huge difference.", "She should pay for extra space if she wants to recline", "But he is the one who has abnormally long legs that don't fit in the leg room provided where most people's do. \nSo there are options for him to accommodate without being an inconvenience to others.\nShe isn't doing anything wrong by making use of her seat that she's paid for to be comfortable for a 4 hour ride. \nThe seats recline. People recline it. \nThe leg room is limited. If your legs don't fit, get another seat. Your  height is your problem not someone else's don't make others around you miserable bevause you csnt be considerate. \nIf plus sized heavy set people travel, *they buy more than 1 seat*. They're expected to. So that they don't encroach on someone else's space. \nIf the leg room isn't enough, pay to fit your extra long legs. It's your problem. It's not everyone else's job to accommodate.", "I don’t know if I love mine, but I sure need them.", "I'm confused here - every Spirit flight I've been on has had non-reclining seats.", "This is the exact issue - the airlines are the asshole. They set up this impossible situation on purpose. There was a video I recently watched about it where they basically said the airlines refuse to validate who the space behind the seat belongs to (either the passenger who is sitting in the front or the back of it), and instead are just wanting to pacify the customers. They're basically wanting to keep their feet on both sides of the line so they don't have to take a strong stance either way. They're the assholes.", ">If I don’t recline I’ll be in agony and struggle to walk afterwards\n\nAnd if the person in front of me reclines and traps my knees (as has happened) Then I'm in agony and struggle to walk. \n\nAnd I disagree with the claim that reclining is part of the ticket you paid for - first claim on the space in front of your seat belongs to the person paying for the seat, and second claim to the other people in the row who need that space to be able to go to the bathroom or get out of their seat for another reason (like people who need to move to avoid blood clots).", "i have scoliosis & a 35” inseam. a seat jammed into my knees is acutely worse.  \ni pay for legroom whenever possible, but i’m absolutely holding up a seat before someone jams it further into my knees.", "Yeah, I understand that some people have physical requirements that make reclining close to a necessity (to avoid major pain, acid reflux, etc). That's completely fair. But there are also situations, like here, where it may not be physically possible (your need to recline does not magically make the person behind you smaller). I appreciate people like you who try to find solutions vs. repeatedly jamming their seat into someone's knees (which isn't effective - knees don't squish down).", "I agree that  space under the seat in front of you is where you should be trying to put your legs.   I’m not sure if the angles just don’t work for super tall people, but that’s what I do.   Of course, that means your carry-on has to go in the bin above, and that’s a whole other can of worms, but these days, I try to only bring a small carry-on that I can put between me and my husband, so that I can stretch my legs under the seat in front of me.", "People do it without warning and I have had times where I wasn't paying attention and bending forward in my seat and got hit pretty hard in the head. I don't like it.", "I’ve never reclined a seat. Even on long haulers. Won’t do it.", "In defense of recliners, they may only recline because the person in front of them did.  \n\nI try not to recline on flights for the sake of the person behind me - also, I rarely sleep, so there is no need. But if the person in front of me reclines, I kinda have little choice even though I am petite. If one person reclines, it sets off a chain reaction for all to do it.", "I tell my husband to be less tall all the time (he's 6'8\").  But you're not married to the guy behind you so that might make it awkward, I guess.", "Everyone here talking about how they are allowed to use recline forget that by doing so, they are taking away a function from your space like the drink tray.", "I see your /s but honestly not the worst idea lol. I suspect the recline is required for other functions on the plane though like if you have to give CPR in the chair or something.", "I mean, I guess I wasn't specific enough, I meant touching as in like, you're going to brush against each other with turbulence, when one of you gets up, when shifting your weight, stuff like that. Not cuddling.", "Right, because people can stay completely still during an entire flight", "Any suggestions on cards with good travel points?", "Sure. I disagree with those people. Recline your seat if you can but be courteous about it and don’t throw a fit if you can’t.", "100% agree they being static, I never recline my seat. It's like hunger games of discomfort that airline is playing, making people to \"justify\" that your little comfort is more important, while ruining it for people behind you.", "Wait, so this suggests that two passengers pay for the same space. She’s reclining, behind her, into his legroom, which you say she pays to be able to do. He obviously pays for his seat and the space in front of him where his legs go(this would include the fact that seats have the shelves to put trays on and little tv’s to watch). I think the way airline seats are set up are total BS because they rely on this unfair “sharing” situation that really just makes everyone uncomfortable. If you’re using one feature you’re “entitled” to, then someone is likely can’t use the other feature they are “entitled” to.", "That is correct. BUT just because it isn't controllable doesn't mean you don't do anything about it. \n\nIf you couldn't help from shitting your pants, chances are you'd wear a diaper instead of griping to everyone complaining of shit smell that you can't control it", "Yeah, the people saying “just pay extra or don’t fly at all!” are really showing how out of touch they are. Can’t believe some of the things I’ve read in the replies here", "Ah, I seem to have found my Tribe.  Tall women with long legs who can never find pants long enough to cover our ankles.  Greetings!", "I was on a 757 this weekend in the window seat for a 5 hour and there was less shoulder/head room due to the curvature of the plane, I'm super short so no issues for me, but it would have been very tight had I been a few inches taller, flight out i had the exit row window seat, spent the whole flight terrified and freezing cos the door was draughty, flying just sucks, I can't imagine how much more if you aren't \"economy proportioned\" in the economy seats.", "So the seats didn’t fully recline but they did go back a few inches.  You could sort of rock them.  It wasn’t much but with how aggressively he was forcing the chair back and how tight the spaces were he was jamming the chair into my legs.", "I only recline if there is no one behind me or if they're very tiny. I get nausea from claustrophobia on flights and I wouldn't want to do that to someone else. Unfortunately for people who recline on me, my feeling sick af/getting up a lot might not be more relaxing than the reclining. I can't help it. \n\nI once politely asked someone to not recline all the way back and move up at least a little on a 6 hour international flight and they threw a fit. People can be really selfish and irrational. It is what it is. They weren't deterred by my vomiting all night.", "*Rage Typing* is the BEST typing :-)", "> making another person miserable\n\nI'm more miserable being unable to recline, so I happily take the trade off of the person in front of me reclining. I think a lot of people would agree", "Its just as much of an asshole thing to not allow people to recline when they have a bad back or something. Its just as egotistical. You were both sold the same space but you think your needs take precedence.\n\nIts absolutely hilarious that you can't see what a hypocrite you are. Throw a fit at the airline instead of complaining about people prioritizing themselves over you. You clearly will prioritize yourself over others. Why should anyone else prioritize you too?", "🤣🤣 \"excuuuuuse me sir! Can you try being Less tall ? I feel like you aren't even trying! Yes...yes...wayyyy better THANKYOUUUU\"", "I suspect the recline is because they are too cheap the replace the seats and they've always done that.", "This is an absurd false equivalency.\n\nAirline seats are designed to recline for the comfort of the passenger in them. A car horn is not designed to be blasted at 2 AM for no reason.\n\nLike... how did this even get upvoted lol", "You drive it on the road, so you're creating more traffic. That's inconsiderate. That's a better analogy of what you're saying. \n\nYour analogy is over the top and you know it. Your analogy would be fitting if someone was asking if they're the asshole because they put their feet between the seats on a flight.", "That’s actually illegal, so not a great analogy", "It is true the airlines are the ones at fault.", "Yeah people are getting confused. Just because the airline (or any other authority for that matter) allows you to do something doesn’t mean it’s not selfish or annoying. \n\n\nSay I go to a potluck dinner where I know there’s barely enough food for everyone buy there’s a sign on the table that says “take as much as you want!” If I load up multiple plates with bunch of everything so I can try it all, knowing I won’t finish, am I an asshole? \n\nThe rules clearly state that I’m allowed to take as much as I want, and I wanted to try everything. So I can’t be wrong, right?", "You aren't sacrificing anything by not reclining unless it is a long haul flight or you have health issues. In these cases it is acceptable, otherwise no", "Inflatable lumbar pillow. The little log looking ones. Has saved my back on more than one occasion.", "All seats but exit row recline and rhe last row. So you can pick a seat that does recline", "There's a bunch of us struggling with the unwanted ankle pants phenomenon! And the unexpected capris!", "But if someone was 6'5 behind you, would you accuse them of faking needing space simply to prevent you from reclining? I am 6'1, clearly not as tall, but I have never reclined on a flight, or at least not in my adult life, unless there is nobody behind me. I can see it being fine if someone wants to recline slightly, understanding the person behind them won't be bothered by it. Also, I have never seen someone \"ask\" I don't think, but if I was randomly made known of person A nonchalantly reclining their chair and making person B less comfortable, I do feel like that must reflect on aspects of who they are other than how they decide to ride in a flight. At the very least, one individual is okay with saying \"I want to be 10% more comfortable at your expense\". Even if you never see ppl asking, I feel like it's clear that OP is more considerate than the person he encountered on the flight. I am not trying to say either is in the wrong or is an AH, but he is definitely much more considerate of people around him.\n\nIt's like ppl who don't put carts back, I see it regularly, but I also feel justified in questioning their overall character. Do I think this makes them an AH, not necessarily.", "I wouldn't recline my seat without asking, and I consider people who recline without asking to be assholes. Thirty years ago things were different - there was more room on the plane. But not any more.", "Okay but you can't use the tray properly when the seat in front is reclined. You think it's a design feature to end up with a drink spilled all over your lap because the person unilaterally decided it's recline time?", "Delta removed the function on some of their planes.", "They have special rows for people with disabilities? On UK airlines I just have to pray that the person behind me isn't a fan of kicking seats. Too many times have I ended up in front of kids whose parents let them kick to their heart's content.", "And plane seats are not designed to be reasonably used, they are designed to be the minimum amount of space that can be given to a passenger before they would consider it not worth even attempting a flight", "As a tall person who IS interested in those seats, I  will tell you, some airlines block purchase of exit row/bulkhead/economy+ seats for anyone but frequent fliers and first/business class is prohibitively expensive for many people. Almost every flight I take it's $50-$100 per leg of the flight to get an exit row, and those are only available for purchase by like 1/3 to maybe 1/2 of airlines that I've come across in the US. So it's not always just feasible to \"buy more legroom\".", "Nope, sorry. You can buy the deeper row seat, too, and that would allow you to recline without imposing on the person behind you as much. Your physical difference is something you can accommodate for when travelling. \n\nThis is not solely on the long-legged dude.", "Did you just read what you wrote? You want people to be mindful of your physical differences but someone else should pay more to accommodate themselves. If you want room to recline and be comfortable, then you accommodate for that. His tallness is no more his fault than you having to live in pain is your fault, the only difference is you think it makes you entitled.\n\nOr we can all use economy and all be miserable.", "Exactly. I travel frequently on long haul flights and there’s no way in hell I’m not reclining. Most people on these flights do. I don’t understand the AH replies for reclining.", "To give my experience as a trans guy whose therefore shopped in both sections: the mens method IS better than the incongruos mystery that is womens sizing, but unfortunately its still stupidly hard to find a good fit if you have an uncommon body type. I mean, you mentioned 28\" inseam; I don't think I've ever seen that inseam shopping for mens clothing, and its the one I need!! Ntm im a big guy, so finding a 44-28\" pair of jeans is literally impossible. I feel ur pain and we definitely need to standardize sizing in the womens section with the inseam-waistband measurements, BUT I'm almost certain they would still only carry the sizes they think are \"common\" unfortunately :/ it's so stupid. \n\nAlso, for suggestions for jeans/pants that are Long in our current capatalist hellscape: I assure you literally no-one will care if you buy your jeans from the mens section. No-one will even be able to tell. You might have to go up a size or so because mens jeans are more rigid and made out of thicker material (that lasts longer, too!!) and they don't account for the possibikity of having broader hips. There're plenty of styles that look exactly the same as womens, except they have pockets you can put a whole nintendo switch in and they dont fall apart within the year. Obviously I'm not saying stop buying womens pants, but if you happen to find a pair you like don't bother worrying about which section it comes from!", "28\"!? Where do you shop, because my 29\" inseam wants that. Even if I buy the \"short\" version of pants, I have to hem a couple inches still. I usually see 32-34\" on most things I buy.", "Target has these amazingly soft sleep pants that, for a beautiful, brief moment, carried them in long length of 34” inseam. Then they stopped. I bought 2 pairs at Target and found 2 pairs via PoshMark and eBay but they won’t last forever.   \n\n\nWhy, why, why? Why do they hate us?", "Amen sis. The few times I've mentioned the too-short pants problem, my tiny friends will be like, \"Ugh! Tell me about it! Everything I buy is too long!\" and I think to myself, \"Um... just hem them? That's an easier problem to solve. I'm not going to sew fabric to the bottom of my highwater pantlegs\". Would be a DREAM if assorted inseams were offered by all brands and in all stores.", "Hear ya! The girls used to give me crap about wearing \"Mom\" jeans. I'm 5'5\" with a 32-34\" inseam and naturally high waist. \n\nMy inseam is longer than my husband's at 6'.\n\nI need leg room, as well.", "Really just here for the where do tall women buy jeans convo 😅. I’ve had good luck at banana republic!", "Ever tried using your table when someone reclined? It gets almost impossible to use. Things just will fall off. Drinks, devices, food, etc", "It often impacts how well you can utilize your tray table.", "My personal experience is, that they recline with force and the drink and what ever you have on your little tablet is just going for a fly if you have not good reaction skills. Just followed by somebody who is throwing the long hairs into your own coke. I would prefer this seats had not the function. It was a good function when you still had more space, but not anymore.", "Being reclined in an airline seat is more uncomfortable than not because it doesn't recline far enough so if I want to look at anything like a book or my phone I have to push my neck forward uncomfortably.\n\nBut I also like my car seats more upright than most people do so maybe it's just my body proportions/height (I'm 6'1\")", "they wouldn't even need to buy 2 seats, they can upgrade to seats with extra leg room", "I fly every week for work and everyone I know thinks it's extremely rude to recline. My coworker even bought us all knee defenders to help out. If it wasn't a common idea that it's rude to recline why is there a well selling device that has been featured in a lot of newspapers and magazines to prevent it? The NYT even had an editorial praising the knee defender for protecting your space.", "I've been on multiple flights where my drink or food has been spilled because I'm using the tray table and the asshole in front of me decides it's recline time. It happens a lot.", "It definitely has happened to me. I try to check behind and recline as gently as possible but there's only so much any of us can do.  \n\n\nI don't think it's a design feature, I just don't think the airlines particularly took our comfort into consideration when designing this.", "This is so weird because only last week or so, another AITA thread with the same theme concluded that longleggedy people should buy the seats with extra legroom. \n\nAnd here OP is blithely stating that they know the problem, know there is a solution, and do not use it.\n\nReddit is odd", "Wonder if you'd make the same argumet for someone overweight.", "It's a huge assumption that someone else can afford to pay for extra anything", "Hey! I appreciate you and yeah, the men's section is still definitely hard to find stuff in! I just find it especially frustrating as I can hem pants if they're too long but I can't make them longer if they're not, unless they have a ton of leftover material rolled over which most brands don't.\n\nI have tried men's jeans/pants so many times hoping I could make it work like you said - maybe by tailoring the waist in after sizing up for the hips - but so far I have not really succeeded at finding a pair. There's always something weird going on with excess fabric in one place or not enough in another. The only exception so far is I thrifted a pair of AE skinny jeans in a 28x32 that I love. I only realized they were men's jeans when I could put a whole phone in the pocket, haha. But they seem to be a unicorn...\n\nI'm always down to shop whatever fits. I have very broad shoulders for a cis woman so I thrift a decent number of men's button downs for example, and I love vintage suiting so big fan of thrifting those. Just something about my bottom half's shape is not friendly with men's cuts :((", "When you start lopping off several inches, the proportions get reallyyyy screwy. Hemming works if they're a touch too long, but if you've really short legs it's not a great option.", "Lol right? Hemming can't fix everything since sometimes it means the ankle opening ends up being too wide or weirdly shaped, but it's at least doable. Can't really do the reverse.", "Yeah mine is about the same as my Dad’s who is 6’2 lol.", "Yeah sorry, I get horrible neck cramps if I can't recline.  I've been in the back seats a few times and I think everyone should recline if they have space.  I've never seen the person in front ask permission.\n\nIf the person behind is crowded, they can ask the reclined person to negotiate the amount of recline, or ask if they can swap with a nearby passenger sitting behind a non-recliner", "I’ve never been on a flight where people don’t recline their seats. From the UK if that makes a difference? Can’t say I’ve flown very much though!", "So you’re saying all 100+ passengers on the flight should be uncomfortable in order to avoid a situation where the 6-12 people sat in the uncomfortable back row are… uncomfortable?", "Her space? It's LITERALLY his space. He's sitting in seat he paid for, while some lady is smashing her seat into his legs.", "I just commented above, but the Asos and Long Tall Sally websites have been lifesavers to me. I’m a 36”-38” inseam and finding long enough pants in regular stores is impossible. Asos has a huge “tall” section (they carry a lot of different brands) and Long Tall Sally is 100% made for taller women. I’m pretty sure their return policies are good as well. I wish these sites had been around when i was younger.", "Yeah just sit up during meal times and you’re doing as good as can be expected imo", "No I’m from the US and all the flights I’ve been on the majority of the people on the plane recline their seats. I’ve never been asked, and I’ve never asked if it’s okay."]}