{"id": 15736, "submission_id": "12zj7zk", "title": "AITA for \"pressuring\" my daughter in law to let me help her during her pregnancy?", "selftext": "We live in the US. I (f) have two kids Kylie (f28) and Chris (m25), both of them are married. My daughter has two kids (m5 and m2) I had helped her though both of her pregnancies as that was something she wanted. I stayed over at her and her husband's house for about a month for both pregnancies.\n\nMy son got married to a foreign girl Camila (f24), she's from latin america. They announced a couple months ago that they're expecting their first baby. Camila has no family here so we're really her only family in the country. I told her to count of me for whatever she needed with the pregnancy since I know that first pregnancies can be scary if you're alone. She thanked me and sometimes calls me to know if something's normal, or she tells me that she feels \"X\" thing and asks if she should go to the doctor and such. \n\nShe's now close to the 30 weeks now. We celebrated her baby shower last weekend with friends and family. The baby shower was held in my house, after everyone left my son, her and my daughter's family stayed over to have dinner together. I asked Camila if her mom will come to visit and help her though the delivery and postpartum weeks to which she said she wasn't going to since her mom works and it's not something that people use to do in Uruguay (her native country) because couple's trend to want some alone time after the baby's born there.\n\nI told her that sounds sad, to be all alone, I told her that here is rather common for grandma's to go and help around when a baby's born, that I did it for my daughter like my mom did it for me and etc. I told her that I could help her if she wants, I can go stay over at her house for a couple weeks before the birth so she can rest. I can cook, do laundry, clean and all those stuff so she doesn't have to. And then I can stay over after the baby is here to continue helping with the house and the baby. She told me it's not necessary since my son will have paternity leave so he can do all of those stuff. \n\nI told her that there are some stuff that he will not be able to do either (like helping with postpartum) and that they're both first time parents so both of them have a lot to learn and it's helpful to have someone who already did it around. My son agreed, he said that's true and that he won't be able to provide the same help and support that another mother can. We continued talking a bit more about that until she said its ok for me to help. They left after dinner. My daughter stayed a bit over because she wanted to talk to me. she said I was overstepping because camila was obviously very uncomfortable with me staying over and that will add stress to her. she said I'm not respecting her wishes of having alone time after the birth like she's used to. She also said I basically pressured her into telling me what I wanted to hear. Is she right about all of this? I just want to help them out", "created_utc": 1682519217, "permalink": "/r/AmItheAsshole/comments/12zj7zk/aita_for_pressuring_my_daughter_in_law_to_let_me/", "score": 127, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my DIL that I can help her during the last weeks of her pregnancy and after the birth. I might be the asshole because maybe she feels pressure to say yes and doesn't really wants me to help since it's not something they do in her country\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA.\n\nYou: This is how we do it.\n\nHer: This is how we do it.\n\nYou: Your way is sad and wrong. My way better.\n\nHer: We will still do it our way.\n\nYou: Your way won't work. It won't I say. My way is superior.\n\nSon: Sure mom, your way has benefits.\n\nYou: See??? My way!! MY WAY!!!\n\nHer: Fine. Sure.\n\nDaughter: Voice of Reason.\n\nShe is 100% right. Even if you just want to help out, you were rude, insulting and badgering. What is your son to do here? Turn you down? Turn down the help?  Argue against notion that you have special experience? Complete AH. \n\nTry to LISTEN to your DIL moving forward.", "You sound pushy AND vaguely xenophobic", "YTA\n\nYour daughter is correct. When Camila responded to your query about her mom, that was your answer, esp considering she added “because couples want some alone time after the baby is born.” That was her way of saying no thank you, and you proceeded to steamroll her regardless.", "She said no, that should have been the end of it. You absolutely pressured her, and your son helped.  YTA", "YTA. You bullied your way to get what you wanted, and I hope to god that your DIL finds her spine soon and tells you to back off so her pregnancy experience isn’t ruined.", "Help doesn’t feel like help if you are crossing boundaries to do so. YTA.", "YTA I agree with your daughter you tried to bulldoze your way into their home after the birth of their child. A lot of new parents want time to bond with their babies one on one. You put your daughter in law on the spot and were way too pushy.", "YTA \n\nShe doesn’t want you there when she’s just given birth and she’s made that very clear.\n\nBack off", "YTA-offering the first time is fine, but you keep pushing yourself on her. It honestly sounds somewhat disrespectful to keep harping on her needing help when she’s stated her preferences. \n\nYou are not her mother. Frankly, most people would be extremely bothered by having someone in their home who isn’t their direct blood relation or spouse—lots of people don’t feel comfortable being naked around their in-laws. If you’re in her home she’ll have to navigate not only having a new baby, but also work out the logistics of what she’s comfortable with you doing, and communicating it so she doesn’t offend you, plus constantly having to hold her boundaries when you push back (since you’re not taking no for an answer now, there’s no way it won’t be worse if you’re living there!)\n\nLet her experience motherhood the way she wants to, without having to manage your expectations as well. If they need help, they’ll ask. But right now she’s not only not asking, but is clearly telling you to stop offering.\n\nBack off, apologize for being pushy, and thank your daughter for pointing out the issue.", "Mild YTA. Based on your description of the conversation, it sounds like your daughter is right and you did indeed pressure your DIL into telling you what you wanted to hear. Your daughter was there during the conversation; I was not. If she says your pressured your DIL, there's a very good chance that you pressured your DIL.\n\nTime to take a step back. Tell your DIL that you will let her tell you what kind of help, if any, she wants, and when and how. Let her make those decisions. Give her the help she wants, not the help you think she needs.", "YTA. You wanting to help doesn't override the fact that SHE DOESNT WANT YOU THERE. just because your daughter was happy to have you around for two months doesn't mean your DIL should do the same.\n\nYou owe Camila an apology for over stepping and that you will provide help when she asks for it. You meant well but this isn't about you. It's about what will best make Camile comfortable in the run up to and just after giving birth.", "YTA. You are absolutely forcing yourself on her. I get you’re trying to be helpful, but you should have taken her “No thank you” as the end of it. They’re new parents, yes. But because they are new parents, they deserve the time to get comfortable and figure things out for themselves. Just because your mom moved in with you and you moved in with your daughter doesn’t mean you HAVE to do it for your son and daughter in law. \n\nIf you NEED do something, ask about bringing a meal over after they are home from the hospital. ASK FIRST. Don’t just show up with a casserole. \n\nAlso. Your son can ABSOLUTELY help with postpartum stuff, if he doesn’t, then that’s disappointing. If you think your daughter in law being home alone with only her husband and their newborn is “all alone”, then you need to look at the man you raised. They are a family, a unit. Let them be that while they figure things out.", "YTA.\n\nYou said your daughter WANTED your help.  Your DIL has CLEARLY said she does NOT want your help.  Even your daughter told you to back off.\n\nI think you’re excited and want to be helpful.  And you can still be very helpful without staying with them.  Drop off meals, groceries, errands.  But be sure to keep your visits to a minimum or even drop off meals and don’t visit.  Please don’t ice them out or be frosty, they want to do things a different way and that is fine.  Her family is far, and she may need you, but if she feels you’re being judgmental/frosty, she may not reach out when she needs to.  How you handle this could determine the relationship you have with your new grandchild and your son & DIL.", "YTA. It's fine to offer help, but it shouldn't be about what you want. It doesn't matter what you've done before or what you think is sad: it's her experience and her choice.", "YTA based on this you did keep pushing. Also maybe it's the way you want it done or how your family does it, but I wouldn't say it's common in the US for a mother or MIL to stay over and help out right after the birth. I have a very large extended family and never saw it happen from my grandmothers or any in-laws.\n\nIf they need you they can let you know but until then I wouldn't just plan on them being okay with you moving in for a month once they get home from the hospital.", "YTA\n\nI’m going to have to go light with this one but if she said no and you kept pushing for your way then that’s not cool.\n\nSpeak with your son and let him make the discussion with his wife. Maybe she just said “yes” get you off her back but doesn’t really want it? Maybe she needs it and doesn’t know it? Maybe she will say no and regret it?\n\nEither way that is for the couple to decide. They are making their own traditions, not yours.", "YTA, you basically made her uncomfortable enough to eventually say yes. She probably did this because otherwise you would’ve kept pushing it. I get you’re trying to be helpful, but some people do prefer to do things solely with their partner.", "YTA. You could have just said it slightly differently (well if you change your mind let me know - I know I found it helpful when I had a baby) and not been as dismissive of her feelings. How far do you live? Could you stay in a hotel nearby so they have their own time with the baby? My mum helped me postpartum by bringing shopping I requested and coming in to clean when I asked her to but stayed away unless I specifically asked for help. I get on really well with my mum but I definitely wouldn't have liked someone staying in the house for weeks when I had a new baby. Plus, what postpartum things can a mother-in-law deal with better than a husband?? That just sounds sexist. There is nothing I needed my mother or mother-in-law for that my husband wouldn't have been more help with.", "YTA. The woman will ask for your help when she needs or wants it. Keep pushing and you could be shut out. Think about.", "Yes your daughter is right. It is nice from you to offer help, but the way you did it, sounds like you pressured her to take your help and do it your way. You even pulled your son but more important her husband and baby father on your side.\n\nShe has her own cultural background and knows how this things go by her family traditions. Don't try to turn this all around.\n\nI would suggest, you appologice for oversteping, and tell her, that she can call you anytime she needs help. But that you will not pressure her to let you in. So if she needs help, she can have it. But she will not feel forced to let someone in, if she is not ready", "YTA, though not a malicious one and you share blame with your son. I understand you were only trying to help. But it does sound like she felt outnumbered by you and your son and only agreed because she didn't want to keep having the argument. After making the offer, you should've stopped pushing for your position and just let her and your son decide by themselves (in private).", "YTA, you're trying to push your way of doing things when your daughter in-law has clearly said she doesn't want you around and you seemed to have lobbied your son into it too. Would have been better if you just told he she has the option if she needs it and left it at that.", "YTA a bit. Sounds like you’re coming from a place of generosity and your offer is a lovely one I wish I’d had when I gave birth. But that’s just not what your DIL is up for right now and you should honor her wishes. That will show her you respect her as a person, not just bc she’s your grand baby’s mom/Son’s wife…and that’s a great starting point for this baby and his parents…and you!", "YTA\n\nShe doesn't want you there OP so back off. Obviously things work differently in her country. You are refusing to acknowledge that. \n\nLeave your DIL alone. She doesn't need your help or your company.", "YTA. I get it - you're excited about the new baby and want to show how invested and helpful you are. But, your DIL clearly doesn't want this. She said no, but felt pressured and agreed. Sure, they are both new parents, but they can figure it out just the two of them. They'll be fine (and exhausted, like new parents everywhere!) \n\nSuggested fix: Call your DIL and say, I think in my excitement about the birth of the new baby, I may have been a bit pushy. So, as of this moment, I am not planning on coming to stay with you and the new baby. That being said, I am still available if you want me to. Just reach out and I'll be there.\n\nCongrats on the new grandbaby!", "I understand that from your perspective your offer seems really reasonable and generous and it doesn’t make sense why someone would turn it down, this is a big moment in someone’s life and you just want to help. But “helping” somebody is only actually beneficial when they actually want/need it. Plenty of parents make it through this time without a grandparent living in the house or assisting at all. If that is what she wants (or what she thinks she wants, maybe after the baby is born she might’ve decided she wanted help), she is allowed to feel that way, and it’s not appropriate for you to tell her whether the way she feels is right. Some people prefer to figure things out on their own, and need that space. \n  \nContinuing to argue against someone’s refusal of your help or explain why you think their perspective is wrong is pressuring them to agree. What was her other option? Escalate the conflict? Leave abruptly and cause a scene? You didn’t actually change her mind, you just wore her down. And you shouldn’t try to change her mind. You can hope that she eventually comes to that conclusion on her own, but this is her baby and her experience. \n  \n\nYou have to let her and your son, but especially her because your relationship with her is different and newer, set the boundaries for how you are involved in their parenting. They will be grateful for whatever they need from you that you provide, so long as you respect their boundaries about what they actually need. Insisting that you be involved without them wanting you to be there will only hurt your relationship with them, and your presence will be in their minds as the reason their new parent experience was stressful. \n  \nYou should privately apologize to her for steamrolling and not respecting her perspective. Tell her your offer to help however *she* needs it still stands if she ever wants it, but that you will not involve yourself without her asking. And then actually do that. If not, YTA, sorry.", "YTA. You asked. She said no. You kept pushing. She's not your daughter and her culture is different. Adjust your expectations.", "YTA. You offered, that's fine. But she said no and then you continued to try and talk her into it and didn't stop until she relented. That *is* pressuring.", "YTA - Unless your daughter has some ulterior motive for wanting to keep you away from your DIL, I think you need to take her word for it that you were pressuring DIL into this. \n\nIt also sounds like you are completely undermining your son's role as the father and his ability to parent his own child. Yes, both of them are first time parents - but he is her partner and that baby's parent. He might need advice on how to support his wife after she gives birth, but anything you can do for her, he can do for her. \n\nYou should be encouraging your son to be a full and active parent and a supportive partner, not reinforcing the stereotype that fathers are less capable parents.", "Sorry but YTA\n\nYou meant good, still it was pressuring and might have made your daughter-in-law uncomfortable", "YTA   Ditto others’ reasons.  I don’t have kids, but 4 sisters, several nieces and tons of friends with kids and grandchildren.  I don’t know of anyone who needed live-in help for their first child.", "Yeah, YTA. Your intentions were good, but she very obviously does not want you there and now feels like she's not allowed to say no. \n\nCall her, apologise and let her know that you didn't pick up on her discomfort, but it has been explained to you now and you will stay home unless she explicitly asks you to come. Let her know that she's in control, and you'll provide whatever help she needs and only the help she needs.", "You are now EXTENDED Family and need to respect the boundaries of other adults.  If/when your DIL decides she needs help, she will be the one to ask.  Do NOT pressure her to do what YOU WANT!", "YTA. This type of insisting on getting your way (AND having your son support you over his own wife) is one way of completely destroying any type of relationship with your daughter in law. Keep it up and we'll see you in another sub whining about why your DIL keeps the grandkids away from you.", "Mild YTA you are overstepping her boundaries and the way she likes to do thkngs because you think it is better to have someone elsed in your house. I for instance found it insane to have my MIL helping around the house in a moment of full stress. Like ..i would only want to be with my husband and my baby. That is it. You should tell her that she cant tell you if she needs help and that you will be happy to...but dont be overbearing. Besides this is also something cultural it seems.", "YTA-You mean well but she’s clearly stated that she doesn’t want the extra help you’ll provide and instead of accepting that you disagreed and told her what your son, her husband will not be able to do for her.", "Info: what exactly are you claiming your son can't help with, and why can't he help with it?", "YTA\n\nRespect her decision. Some people love to have always people around, others prefer to be \"alone\". She won't be alone, she will be with the father. \n\nThey are starting together a new family, a new adventure, they are both adults capable of making their own decisions as a couple and now as a family. And it looks like she thanks and value your help, calling and talking about the baby, but it's more like a privacy and not dealing with the background noise and crowding once the baby is born", "I know you think you're helping, but you're coming off as very \"mother knows best\" and YTA for it.\n\nWhen she said she didn't want your help you *badgered* her into it. You've now convinced your son that the things he *should* be responsible for are \"women's work\". The only thing you have to offer in the first few weeks is experience, and that can be provided over the phone. If they want more they can ask for it.\n\nYour DIL will be vulnerable, but more than that, she wants to build her new family. Becoming a mother on her own terms. She's been imagining her time, getting to know their new little one, forming the family with the three of them. And now you're going to be right in the middle of it.\n\nDon't do it. Don't go an insert yourself. Talk to your DIL. Let her know that you support her and you'll be there the moment she or her husband ask for help, but that you won't come unless you're called for. Don't be another stressor in her life at the moment.", "Soft YTA.", "Slightly YTA. I know you were truly trying to be helpful but I think you need to ask your son to talk to his wife in private about if she really wants you there or not.", "Very soft YTA. Your heart is in the right place, and you were only trying to help. But it’s clear that your daughter-in-law was uncomfortable with the idea of you staying over after she gives birth and would really like to be alone with her husband and new baby for a bit. This is normal for many people, including many families in the U.S. Telling her it “sounds sad” was just your opinion, and it wasn’t asked for (it came off as kind of rude). The entire reason many families do this is so parents and baby can bond and learn to function healthily as a new family unit. \n\nAlso, why are you saying your son won’t be able to help? He’s the father, and he absolutely should be helping in any way he can. Saying he won’t be able to and letting him believe it is just setting him up for failure as both a father and a husband.\n\nYou can still make it clear that you’re available to help, but don’t force your way in— especially not right after she’s given birth.", "Very gentle YTA. I can tell your heart is in the right place, but now it’s time to realize DIL is the mom and these are her decisions to make. Even though you’ve had your own kids and helped your daughter with hers, that does not automatically make you the authority on parenting. She is the authority on parenting her baby, her choices come first, she says what is best - Not grandma. Your role is to be supportive in whatever way she wants you to, not force her to change her wants so they align with yours because “you know better”. Work on this. It could really damage your relationship in the future.", "YTA. Everyone handles birth differently and you basically told her that the way people in her culture manage it is \"sad\". Some people prefer to be alone after birth, while others welcome some help - it's a very personal decision. You did basically pressure her into saying what you wanted instead of respecting her polite response about it not being necessary. You should apologize for this while making clear that you're willing to offer whatever type of support is best for her.", "YTA, your daughter is right. The worst of what you did was to get your son to agree with you that he is not as qualified as you are because he is not another mother. I can only imagine how your DIL felt—her heart must have sunk at the thought that she is about to have a baby with a momma's boy. So do the right thing. Apologize, back off, and don't make excuses for why your son is not competent enough to do what his wife has every right to expect of him.", "Yea your daughter is right. In this instance, YTA. It's a shame your son didn't stand up for his wife here.", "YTA.  So is your son.  The both of you need to work on your listening skills and trust Camila.  If I were her friend, I'd be pulling her aside and making sure she was taking notes of the massive red flags that both you and her husband are throwing.  She told y'all she's got this, so she's got this.  There's also no reason why her husband can't help with postpartum.  If I were Camila I would be very concerned about how quickly my husband tossed me to his mother when I clearly said he can help.", "I’m sorry but YTA \n\nYou’re sweet to offer support, but that’s it. Offer. Back off now and let her speak up if she wants anything. You are being pushy and cranky I don’t like the way you talk about her being “foreign.”", "YTA. It’s very presumptuous to assume that your DIL would be comfortable with you helping her with postpartum stuff. \n\nYour DIL pretty clearly told you twice that she is not interested in the level of help you were offering, and instead of showing her respect, you insulted her culture, and kept pushing. \n\nIf you have any interest in having a good relationship with your DIL moving forward, you should listen to your daughter, apologize, and start respecting her as a parent instead of pushing what you want/think is right.", "Seriously?! YTA - massively.\n\nShe was politely telling you to back off. She even made mention of the fact that in her culture, the parents like to bond with the baby.\n\nAnd I’m confused about what kind of help you’re planning to provide your daughter-in-law postpartum? Who wants their mother-in-law to see their mesh underwear?\n\nI didn’t want my mom to stay with me. \nI didn’t want my mother-in-law to stay with me. \nFor either one of my pregnancies. \n\nI wanted to figure it out on my own and have the embarrassing moments without an audience. It hurt my mom’s feelings I think honestly, but I’m so grateful she just backed the fuck off and let me figure it out.\n\nI was pressured by my husband to have my mother-in-law come for our second kid and it was shitty. Thankfully, she ended up only staying for two days instead of a week. \n\nAnd I love my mother-in-law it’s not a slight.\n\nApologize. For real.", "Can I suggest just being ready at the drop of a hat to dash over? Maybe right now she doesn't think she needs the help. But when it's actually happening she might want it. I'd just reinforce you're ready to jump over if needed or give them space.", "NAH yet. I think you mean well, but some people are more private. You don't want to wear out your welcome and/or make things more stressful for them. I think you are ok to offer, but not push. Just remind her that you would love to help, but only if she would like you to.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe live in the US. I (f) have two kids Kylie (f28) and Chris (m25), both of them are married. My daughter has two kids (m5 and m2) I had helped her though both of her pregnancies as that was something she wanted. I stayed over at her and her husband's house for about a month for both pregnancies.\n\nMy son got married to a foreign girl Camila (f24), she's from latin america. They announced a couple months ago that they're expecting their first baby. Camila has no family here so we're really her only family in the country. I told her to count of me for whatever she needed with the pregnancy since I know that first pregnancies can be scary if you're alone. She thanked me and sometimes calls me to know if something's normal, or she tells me that she feels \"X\" thing and asks if she should go to the doctor and such. \n\nShe's now close to the 30 weeks now. We celebrated her baby shower last weekend with friends and family. The baby shower was held in my house, after everyone left my son, her and my daughter's family stayed over to have dinner together. I asked Camila if her mom will come to visit and help her though the delivery and postpartum weeks to which she said she wasn't going to since her mom works and it's not something that people use to do in Uruguay (her native country) because couple's trend to want some alone time after the baby's born there.\n\nI told her that sounds sad, to be all alone, I told her that here is rather common for grandma's to go and help around when a baby's born, that I did it for my daughter like my mom did it for me and etc. I told her that I could help her if she wants, I can go stay over at her house for a couple weeks before the birth so she can rest. I can cook, do laundry, clean and all those stuff so she doesn't have to. And then I can stay over after the baby is here to continue helping with the house and the baby. She told me it's not necessary since my son will have paternity leave so he can do all of those stuff. \n\nI told her that there are some stuff that he will not be able to do either (like helping with postpartum) and that they're both first time parents so both of them have a lot to learn and it's helpful to have someone who already did it around. My son agreed, he said that's true and that he won't be able to provide the same help and support that another mother can. We continued talking a bit more about that until she said its ok for me to help. They left after dinner. My daughter stayed a bit over because she wanted to talk to me. she said I was overstepping because camila was obviously very uncomfortable with me staying over and that will add stress to her. she said I'm not respecting her wishes of having alone time after the birth like she's used to. She also said I basically pressured her into telling me what I wanted to hear. Is she right about all of this? I just want to help them out\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA, mother does not equal MIL. She does not have the same comfort with you as your daughter or son have which is normal. I would have never wanted my MIL living in my home after I gave birth. I actually didn't invite my mom either, I enjoyed that first few months just with my baby and husband and would have felt another person intrusive.", "YTA your daughter 100% correct. Keep this up and you'll be here whining that they are going low contact with you.", "YTA.", "YTA. She said no. That's it. Not everyone wants their MIL breathing over their shoulder while they are trying to adjust to new life with baby. Some people genuinely enjoy the time and space for family bonding and to get the hang of things without 3rd party input. Back off lady", "So mild YTA. It was nice of you to offer. But she doesn't feel sad that she'll have alone time as a new family. My mil did this to me and it sucked. We have different ways of parenting, advice is different now than it was 40 years ago when she was giving birth and refuses to acknowledge it. She insisted on doing my laundry. I refused multiple times. She did it anyway. Well now my mother in law has seen my lingerie and commented on how much underwear I own. This makes me wildly uncomfortable and all bc she refused to listen when I asked her to please not do my laundry. I appreciate her help in watching my kids while I was giving birth. I appreciate her loving and caring for my children. I don't appreciate her never taking no for an answer and folding my freaking thongs. She wants it to be just them, let her have this. It's her birth not yours. You want to help? Bring them food once the baby is born.", "Why not call her and have a real convo? Explain that you might have overstepped and want to check-in. Explain that your offer of help was exactly that--help for a first-time Mom. Ask her what support she wants and listen. Maybe ask her about her family traditions around birth and just listen to her. It sounds like you might have been pushy in this convo but have a good relationship overall if she's been calling you to ask questions about pregnancy. Any hurt feelings or misunderstandings can be cleared up if you take the time to listen to what she wants and needs.", "This is an amazing recap of the conversation. Well done.", "“A foreign girl” 🙄", "Yes, this!  There is a big difference between your mom and your MIL.  The amount of women who actually want their MIL around during the most vulnerable time of their live is sliiiiiiiim.  Especially when said MIL calls you \"foreign\" and steam rolls over you.", "I agree with this, but lean towards YouWouldBeTA if you kept pushing. Bogbabe's advice is great.", "Adding another comment to tell OP that they need to stop referring to their daughter in law as “a foreign girl”. It’s giving xenophobia.", "I mean \"alone\" from women support, of course he can help (and will) but I think the husband's support is different from other's mom's help\n\nPD. When did I said I was her mom? You guys need better reading comprehension since I said it's different help from ANOTHER mother vs husband, I never I said I was her mom, just another woman who went thought pregnancy/ birth too", "Yes I can have another conversation with her about this, there's still some time before the birth. Maybe she'll need extra help later on", "> I think you are ok to offer, but not push. \n\nOP did push, though.  Her DIL said no and OP just kept telling her why her help was needed. DIL just said yes to get OP to stop asking.", "Right? Even my gramma doesn’t say that and she’s pretty sheltered", "Why is it wrong to say she's foreign?", ">I think the husband's support is different from other's mom's help\n\nThat's the thing OP. Your DIL doesn't want your help. She hasn't exclusively asked for it. Your butting your way into something she doesn't want.", "You’re only classifying it as being different because she rejected your offer to help. She said no. Just Drop it. Apologize for pushing the topic and making her uncomfortable.", "There is literally nothing special about “another mom’s” help that will require you or anyone else other than her husband to be at their home post birth.  Her husband is there if she needs physical/personal help.  If she has questions for you, it’s much easier to call you/her mom/friends then have another person in your home when you just want to focus on your baby and husband.  Just back off.  If DIL changes her mind, I’m sure she’ll let you know.", "Except she is not your daughter and it's normal in her culture for the parents to spend alone time. She does not want you help 'mom'.", "It's not your decision and you are not her mother.", "Yes it would be a different type of support but in this case that is not wanted by your DIL at this stage. You should have stopped when she said no thank you instead of pushing your own agenda on her.", "It is not.  I've had two kids, and having my husband by my side for birth and recovery was far better than having to deal with my mom.  Much less my MIL, good grief.", "because it's not an important detail in this story.  you can find people in many places that like having alone time after pregnancy ..so it more reveals that it may be an important detail to you.", "You sound like a southern mom who raised a mommy’s babyboy who can’t stand up to you. I mean if you want to perpetuate the stereotype be my guest…this Texan ain’t about that.", "It's wrong to say that she's foreign if you're using that as an excuse to bully her into doing things your way, which is what you did repeatedly in your conversation with her.", "Nearly everyone I know from here has got help from someone after birth, maybe it's not normal where you live?", "I said she's foreign to note that things are done differently where she's from, nothing else", "“Normal” doesn’t mean “right.”  Loss of bladder control after birth is common but not right. \n\nIt was kind of you to offer. Everything after that was pushy, insulting and rude. You didn’t respect her no, insulted her wants and customs, and pushed until her own husband caved and pressured her with you. You also insulted her husband saying he wouldn’t be able to help with postpartum. News flash, many husbands are able to help just fine if they are willing to learn and care. \n\nYTA. Apologize to your  DIL for overstepping and pressuring her and let her know you’re available to support her in whatever capacity makes HER comfortable. And thank your daughter for being a voice of reason.", "there is no 'normal' where i live. as you'd expect just a lot of people finding their own ways through life.  \n\n\nlook you went through the trouble to posting this to the internet in hopes of getting some outside perspective..now you have it.  You be you but I'd take your Son aside and explain to him that while you only want to help you by no means want to interfere and that you're fine with whatever decision they make.    \n\n\nLet them talk about it and be prepared for a no.  If  she has changed her mind and welcomes your help with open arms ..great..but if she wants to do this on her own ..respect it.", "Americans do not want their pushy ass MILs over after child birth either.  It's not her culture,  it's YOU.", "I think I'll talk to her to make sure that I'm not pushing her, since my son also agrees with me. I'll let her know that that was not my intention and that she can think about it and if she doesn't want that kind of help it's ok\n\nGod, guys I know my son's opinion matter very little here, that's why I said I'll talk to HER and not him. We're literally saying the same thing but for whatever reason y'all want to argue, we're on the same page there", "He’s your SON, not your SPOUSE. JFC…cut the umbilical cord already", "YTA. She doesn’t want you there.\n\nI’m a Caucasian American and I allowed NO ONE over. No one in the delivery room. No one stayed with me and my husband was able to handle literally everything I need help with.\n\nI don’t care at ALL how you think “you do things here” that’s not a thing. What is a thing is the mom doing exactly whatever the hell she wants.\n\nAlso, acknowledging your super supportive daughter who knows you’re being ridiculous and called you out.", "YTA, quit steamrolling her.", "YTA you sound like my MIL. Take a step back and seriously reflect on what's being said here. She tried to tell you no thank you and you are steam rolling them. My MIL was just like you and our relationship is strained now. Even her sons relationship is strained. Take a step back", "YTA you overstepped. Maybe your daughter pointed it out because you overstepped with her as well and she did not say anything because you're her mother and she knows how pushy you can be.", "You offered, which was fine. She politely declined, as is her right. You didn’t accept her answer, and continued to push, even recruiting your son to back you up. That’s not fine. You might want to visit r/justnoMIL to see what happens with overbearing MILs. YTA", "YTA\n\nYou were very pushy and would not take no for an answer. Then you had to get your son to back you up! I feel very sorry for your DIL.\n\nJust let her be! She clearly does not want you staying with her either before or after the baby is born.", "YTA. This is her pregnancy and you shouldn’t pressure her into anything.  Just because your daughter wanted the help it doesn’t mean your daughter-in-law wants the same thing.", "Why won't her husband be able to help with postpartum, but the MIL can? What does that even mean?", "YTA. She told you NO several times. Back off of you want to have a good relationship with your DIL and be able to see your grandkid. I don’t know what you mean about your son can’t help with after the birth because my husband helped me with it all. Including going to the bathroom, showering etc.  Just because you are used to a certain way it doesn’t mean she wants it that way.  I can see you telling her how to raise her kid and causing problems in their marriage too.", "Man, people are freaking out in these comments. NAH at the moment. I think it'd be worth having another convo with her, maybe even apologizing for pressuring her to agree, and let her know that the offer is on the table if she wants to take you up on it, both before or after giving birth. Assure her you won't be offended if they choose NOT to have you come stay, but you want her to know she's not alone in this and she has the support of another woman in her (now) family, but on HER terms.", "NAH I think you did over step but from the way you're writing you could tell you have good intentions and just want to help apologize and explain what you're thinking but give her space because not everybody does  things the way you do you know", "NAH - you are making a generous offer to a person who is used to being independent and is inexperienced in this area. Your heart is in the right place. Let her make her own decision, and respect the decision she makes, including if she ultimately declines your assistance. But don't expect a bunch of people on Reddit to really know what your dynamic is like, and keep in mind that people on this platform are very likely to take one word you've used and extrapolate it into an entire worldview.", "YTA….you way overstepped.  Do you want to be that mother in law?  There is no reason to stay over at their house for weeks on end.  If you live near by, you can offer assistance a few times a week, (after the first week home, so mom and dad can adjust to baby and have alone time), and only for a few hours at a time.", "YTA. You sound insufferable.", "Your intentions are great, but PLEASE, if you value your relationship with her and your son, do not pressure her or just show up or otherwise insert yourself beyond what THEY specifically ask for. I straight up told my mother I wanted two days home alone with my newborn son so my husband and I could have a couple days alone with him to bond. She showed up the day we came home and it did some serious damage to our relationship. It's not your choice. You are sweet to offer, but read the room and don't overstep. PLEASE.", "Yes. At least your daughter’s not an asshole. \n\nYou offer. That’s it. \n\nYTA", "YTA \nHere's why. If she needs help she will ask. You were very pushy expecting her to want what you wanted or your daughter. She, like millions of other first time moms, just wants to bond with her immediate family. That means her child and her spouse. \n\nYour comments cement the fact that you came on here expecting to hear how right you are and when you found out otherwise, continue to double down on your behavior and come off sounding totally out of touch with reality. \n\nLeave your DIL alone. Let her come to you. Don't push your way in.", "Yta it's not 'rather common'.  Its person by person, and she doesn't want her friggen pushy in law around for a month judging her every move.\n\n\nLOTS of people here in the US don't want any visitors for a few weeks after baby is born.  \n\nYou were incredibly rude to your dil and are shocked, just *shocked*,  that she didn't take your criticism laying down.\n\nHelping them out would be actually *listening* to what you're told.  She doesn't want people around?  No problem, you can ask for their fav resturant and arrange a dinner delivery for a few nights.", "YTA, yes.\n\n\"Hey, if there's anything at all we can do to help, just ask.\"\n\nThat's how you offer help without pressure.\n\n\"I have a cultural expectation of living at your house for a month after you give birth, and while I love my son, he's not equipped to be an adult, so.....\"\n\nThat's pressure.\n\nTo reiterate: 'help' is 'asking people what they need, then doing what they ask, as they requested it.'  If you ever find yourself saying \"I was only trying to help,\" you obviously were not trying to help, because nobody would get mad at you for doing something they asked you to.  No, you were doing something that you decided they needed, without asking, and expecting them to fall over in gratitude.", "op=LIGHT AH.\n\nI'm going to take you at your post--that this is ALL good intentions(and not JUSTNOMIL territory).\n\nYour DIL expressed that she wants time alone after birth--that it's NOT her cultural custom to have the Mother/MIL in house right after birth.  Listen to her, Tell her that you understand she wants alone time but that she can call any time for help if she needs/want it.  Then look at things you can do from a distance.\n\nCheck if you can pre-make meals that your Son can pick up and freeze.  Can you do grocery trips for them(So that Son can stay with wife).  Look at ways to HELP that fits their needs/wants.  Don't insist, Offer once, let them think about it and get back to you.\n\nAnd let them be able to change their minds later when they experience the reality of parenthood.\n\nYour DIL clearly wants to make you and her husband happy, but she's also expressed discomfort(to your Daughter at least).  She is going through a body/life changing event.  Please **listen** to her needs.", "Soft YTA this is her pregnancy experience. Her newborn experience. She is entitled to have that experience however she wants it. She doesn’t know how hard it is and how valuable your help will be. \n\nShe’s said no to the help, so leave it at that. You’re being pushy by forcing it on her and she’ll be reluctant to turn to you in the future. \n\nLet them get on with it, but let them know you’re on standby to help. I’m sure they’ll call. \n\nMy mum came to stay with me for the first month of having a newborn. It was a massive help.", "YTA\n\nYou are forcing yourself upon her and bullied her by acting like what is normal in her culture is not valid and inferior. \n\nHorrible.", "YTA, and you need to back off. Now. \n\nYour daughter asked for your support. DIL has not and has been backed into a corner because you haven't respected her wishes or culture. \n\nThe one thing you have forgotten is this: if you want access to baby, you need to respect and listen to the wishes of the mum. If you don't do this, you will end up having limited access.\n\nOh, and just to add, the comment about her being foreign is incredibly racist.", "I’m a grandma also and I’m here to tell you that you overstepped. It would have been one thing if you offered help, listened to what your daughter-in-law said and accepted the answer….. Instead you continued to push YOUR agenda to such a point your daughter felt the need to speak with you about it. Actions like this have consequences, perhaps consequences that will ruin your relationship with your son and daughter-in-law. \n\nYTA", "We weren't there to see body language or hear inflections. We don't know Camila.\n\nHowever, if your daughter heard and saw it, then you should listen. You were trying to be helpful, but now you need to stop. If they do need your help, they know you will be there for them. They know you are willing to do a lot for them. Leave it up to them as to whether they ask for help or not.\n\nYTA", "There is bullshit here. My mom is from Uruguay, she married a guy from the states, when my sister, brother, and I were born, her mom came up to do all this stuff and her older sister came up with my youngest brother after her mom died. All my cousins and friends in Uruguay had this same thing occur. Either she is lieing to you to keep you away, when her mom can’t do this, or you Mr story is a lie.", ">some stuff that he will not be able to do either (like helping with postpartum)\n\nLol I doubt you'd be able to help with that either. If anything, you'd probably make it worse considering how much she didn't want you there. YTA", "YTA.  She told you no, & that answer wasn't acceptable to you so you kept pressing til you got the answer you wanted.  She clearly is uncomfortable having you stay there.  And she's probably not comfortable enough to stand up for herself.  It's understandable that you want to help, but you must respect people's boundaries.  It's not what she's used to & she just doesn't want you there.  Accept it.  Just be there for her when she asks.", "YTA you're definitely infringing on her personal space. You're also the same person that will keep giving unsolicited advice.  Just stop... they are adults and will figure things out unless they ask for help. Don't ruin the relationship before it's too late.", "YTA", "It would stressful having my MIL being here for a few weeks, forget while giving birth.\n\nI would go N-A-H but it feels like you pushed it (with a side of prejudice that it is done differently there) which pushes it to YTA,\n\nJust let them know you are there if needed and they can call you any time, there is no need to move yourself in for weeks", "Yta. She told you what her customs are & that she didnt need you. You pushed & pushed until she said what you wanted to hear. I get it, being a grandma is awesome & its exciting  but wait for them to call you for help", "YTA. More accurate to say it’s something you’ve done in your family, but by no stretch of the imagination is it cultural. I’m from the US and while I’ve chosen not to have children I can assure you that it was not normal for either of my grandparents to be around. When my Moms mom did try to help she just stressed my mom out. Agree that her being “foreign” sounds off since it’s really not relevant, since it’s not a cultural difference, it’s just something that you did in your family. What exactly can the son not help with? There are things he might be less comfortable with but I assume since he helped get her in that condition he’s able to ask doctors questions and help with absolutely anything. The only thing he probably couldn’t help with is breastfeeding, but then again, you can’t help with that either. Beyond an initial offer, which is nice, anything else is pushy especially when she told you she wants to have time for just the parents to bond with their child.", "You sound very pushy and not taking the cues your DIL was giving.\n\nIt is one thing to offer. And to say she knows where you are if she changes her mind. But she sounds like she was pressured into accepting an offer she didn't want which makes YTA.", "Yta. I think your intentions are good but you are pushing in. Let them have this time alone as a little family.", "YTA. Not everyone wants extra people around after giving birth. Having my MIL stay with me sounds like a total nightmare. If you want to help out, find out what would actually he helpful, not what you think Is helpful", "Info: why can't your son help with postpartum issues?", "YTA\n\nWow I been a while since I have read subtle racism.  \n\n \"a foreign girl\", come on, this is so cringe.\n\n \"...it's not something that people use to do in Uruguay (her native country) because couple's trend to want some alone time after the baby's born there.\", she gave you an out, and double down and you go on to imply we don't do that here.\n\nWhile I believe (and hope), there is no malcontent, I do believe you like everything done how you like it.  Stay out of their lane, maybe she will change her mind, but you becoming an live in maid seems much.", "Fuck off and leave her alone, fucking creep", "YTA. You ket her know you're available to help. Done. If she wants your help she'll call. Back off.", "YTA", "YTA, and your daughter who has dealt with your antics for years was the one to notice it! Please stop inserting yourself where you don’t belong and enjoy whatever they are willing to give you as far as time with the grandchildren because you are entitled to nothing!! Not because you’re a women, or a mother, or even a grandmother. And try to learn people’s subtle cues of saying “no” before you just steamroll over everything precious in your life", "I can see that you meant well and want to be a supportive MIL, but I am afraid that **YTA**. \n\nAsking her if she wanted helped was fine. But when she said no, you should have said, \"I completely understand. You need to do what you find the most comfortable. Please know that my offer always stands if you change your mind\".  \n\nThen, drop it.\n\nInstead, what you did is insult her culture (\"that sounds sad\") and pressure her (\"they're both first time parents...have a lot to learn...it's helpful to have someone who already did it around\") in front of your family.  The fact that your daughter noticed her discomfort makes it even worse.", "YTA you’re being overbearing. Give them an opportunity to figure it out and ask for help if they need it.", "YTA and vaguely racist/xenophobic. Your daughter is right, back off.", "YTA\n\nYou're being overbearing and pushy. If my family didn't give me space, I'd be No contact...like we are with my MIL. \n\nShe didn't back off or respect us as parents. You see, she thought she knew better than anyone else.  We don't miss her, my child doesn't even know she exists.  \n\n My husband managed to help me with every single thing I needed and it's sexist to suggest your son can't be a good partner and father because he's a man.", "YTA. There are other countries and cultures besides the US. I am from the US, but live in Sweden. Here, no one visits when you are in the hospital having a baby (except siblings of the baby.) New parents are often in the hospital for 3-6 days, then home for a week or two before even the grandparents visit. The concept was foreign (pun intended) to me, but it was fantastic. I wouldn’t trade it for the drama and stress that my friends in the US deal with as far as who is going to be in the delivery room and who is coming to visit when and idiot partners who act like they don’t know how to do anything. We got what we called our “baby bubble” and it was beautiful. Respect your DIL and her culture. She knows herself and she doesn’t need you. Good parenting is 90% instinct.", "YTA. Your daughter is right. You overstepped big time and basically browbeat your DIL into complying with what YOU wanted. Cause clearly she is a breeding cow and her wants, needs and preferences don't matter. Only yours.", "Your heart was in the right place, but it's important for you not to push too much here, which you may have done.  Lots of young women in Camila's situation do not want company in their homes after giving birth.\n\nI would suggest calling her, apologizing for pushing this issue at the dinner, and letting her know that you want her to be totally comfortable with the situation, you are 100% fine with spending as much or as little time in Camila's house as she likes (and that she can change her mind anytime), and your feelings won't be hurt if she would prefer not to have company during that time.", "YTA.\n\nYou overstepped, and stop pushing yourself on this \"foreign girl, \" as you call her.\n\nYou've let her know you are available. She knows she is free to ask for help.\n\nNow butt out.\n\n&#x200B;\n\n.", "YTA.  Back off.  Lots of new moms don't want visitors right away, let alone visitors staying for weeks.", "I think calling her back and giving her some more space to express her thoughts would be good. I also think sometimes new parents aren’t sure what things will be like. So maybe her idea of what help she needs will change when the baby arrives. It might be better for you to say, I’m available to come if you need me. Let her say no for now, and then be gracious if she asks you to come after. Leave the offer on the table. I do think your heart is in the right place and that kind of help would be really nice.", "Her first no should have been where you respected her decision.\n\nYTA", "Didn’t have the read the post to know YTA", "YTA. Question: Do you always act like a bully to get it just the way you want it? Because you are not doing yourself any favours with your combative replies.\n\nYou keep hammering on and on about your son being unable \"to help like a mother would.\" Why do you think so little of your son and his wife? People have kids all the time, they will figure it out, the whole \"back in my day...\" stick is just so demeaning.", "YTA.\n\nMy husband and I had no help when our kids were born, and we managed. Even though my husband wasn't experiencing postpartum, he helped. Even though we were first time parents. \n\nMy MIL would have totally stressed me out if she was there. You son sounds like a mama's boy in the worst possible way, and you sound like a MIL who gives MILs a bad name.", "YTA.  Your daughter is right.  You need to step back.  It's great that you want to help but this is not your daughter.  Camila is right - the FATHER of this child will be there to help and if they don't know how or what to do then I'm sure they'll either figure it out or ask for help. But please, if they ask for help know your boundaries!!!", "YTA.\n\nListen to your daughter. Tell your son to ask other fathers about what to expect and how he could best help her. \n\nYou offered the help (which is nice). They know the offer is out there. They can refuse to accept or deny it.\n\nShe set a boundary and you stomped on it.\n\nAnd unless you really are xenophobic, lose the \"foreign girl\" phrase.", "YTA, you need to call her and let know that you spoke with your daughter and she let you know how you \"unintentionally\" over stepped and that you will only come when requested.", "YTA.  You don't seem to get it.  It isn't about what your son wants it is what the mother of his child, his wife wants.  Your feelings don't mean a damned thing.  You need to back off.  You are clearly not understanding that NO is a full sentence and the decision is not for your precious son to make but his wife.  God!  I hope the move far away from you", "Yes, if you are pressuring her or even if she just says 'no', you drop the issue and move on.  My mom and my MIL both constantly tried to butt in without my late wife and I asking for ANY advice with both of our girls.  We finally moved 4 states away from her parents and went LC almost, NC with mine because they simply wouldn't stop bothering us and let us raise our children...  You were REALLY rude to tell her that 'her way' was the wrong way.  If they need your help, they will ask, otherwise, BUTT OUT!!!  You are definitely TAH...", "YTA she made it clear several times she didn't want your help that way. She even told you it wasn't a part of her culture. You bullied her until your son was on your side and then you all ganged up on her to get her to change her mind. I know it doesn't feel like that to you, but that's what happened from her point of view.", "YTA. Get a hobby, this is not a do over baby for you.", "I’m sorry I got to the part where you said there was some stuff the husband couldn’t do and I stopped.   Listen you need to back off, this crazy grandma shit that’s so popular now is not okay. It’s about their family and that husband better be able to handle everything or they shouldn’t have had a child. I am tired of this shit. If you want or help great!!! That’s amazing be there IF she calls you, don’t push don’t tell her that bonding with her husband and their baby is sad. The father of my children and his family are so toxic about babies everything about my motherhood was ripped away because my mother in law has more of a right to bond and get her way. Every moment she can steal she does every time the father of my children has a parenting task around his mother she swoops in and does it for him stating how he shouldn’t need to do it.\n\n\nPlease just let this poor girl be a mom.", "Why do you claim your son can’t “help with postpartum“? \n(Not even mentioning the foreign girl stuff, because yikes)", "This. Plus OP is non-stop arguing her position in the comments and saying she'll reach out to offer help to her DIL again. \n\nNO. Just...no. You are seriously risking a relationship with your DIL and even your grandchild if you can't respect her boundaries. \n\nSHE DOESN'T WANT YOU THERE. And given your comments here, I can see why, OP.", "This is telling actually. I imagine this dismissive and correcting way of speaking to her DIL would extend to other parenting decisions, making OP staying in their home uncomfortable at best. It would not be worth the help. \n\nI personally would hate what OP is suggesting. Unless I had a very trusting relationship with the person offering to help, I would hate having someone in my space at my most intimate and venerable moments for so long. OP can help without moving in and interferring with the bonding process. Also, she's letting her son off the hook. He should be helping and parenting from the start.", "I think it's strictly prejudice against introverted traits. \"You want privacy? You don't want company? You freak! You owe it to me to be what I call normal!\"\n\nOP, I can't emphasize strongly enough how much YTA!", "*Vaguely?*", "I'm actually wondering if the daughter DID want her there after her reaction to her pushy mother.\n\nYTA", "I have a feeling that her son only “agreed” to shut her up knowing full well they won’t take up her offer.", "Not inly her country, but also in the US.  More couple don’t have grandma there than that do, and especially if it’s the paternal grandmother.", "Especially when the father has paternal leave.", "I was wondering the same thing. There's absolutely nothing she can do that her son can't do for his wife.", "Yes I'll do that, thanks", "I agree with this! I would suggest stepping back a little but letting your son and daughter in law know that if they start to feel overwhelmed or decide they may need you, to let you know. And, maybe that you want to give them their space to do things their way, but you’re happy to help in any way they want/need.", "Really, man. She’s annoying AF. And I’m 67 years old!", "I cringed so hard that I may have hurt myself. My dad is 83 and occasionally inadvertently racist, but even he wouldn't say something so blatantly othering.", "That was off-putting to me, too.", "When I have kids I expect to want the alone time as well and of anyone called that \"sad\" they'd be waiting a lot longer than a couple weeks to meet that baby. \n\nEven if she had conceded she should be apologizing for that comment alone", "In what way? I birthed two children and I only had their father with me after we brought our newborns home. \n\nI cannot think of a single thing I needed that he could not do, that would have required a woman to do properly.", "But you aren't the MOM in this scenario. You're the MIL and a to-be grandma. Your DIL didn't want help from either of them. If she wanted a mom, she'd ask her own.\n\nAlso please ease up on the middle age ideology of only women can help women with \"women-ly\" things. If your son is capable of impregnating someone, he sure as hell should be capable of handling ALL of the other duties that entail pre, during and post birth.\n\nAnd you're right, a husband's support IS different than anyone else's. He's the only other party directly concerned with this pregnancy and his support will mean a hell of a lot more to her than anyone else's and you know why? BECAUSE SHE DIDN'T ASK FOR ANYONE ELSE'S HELP.\n\nYTA", "I'll tell you what would actually help both of them. Offer to pay for someone to come and do the cleaning *when they want a cleaner*. Otherwise, let them have their babymoon. Let them do what almost all new parents do: look at the tiny human they've created and wonder where the instruction booklet is.", "You're being bull-headed and not listening. Camila does not want your help. She does not even want her own mother's help. When she has her child, she wants to be able to bond with that child one-on-one so that she can figure out how to look after her child. She wants her husband to have that same experience and for them to bond as a family together.  \n\nShe doesn't want you telling her what to do, and yes, you will do that. You're doing it now. She told you what she wants, you've decided that you know better, so you brow-beat her into giving in. She does not need you doing that when she is post-partum and looking after a newborn. \n\nBelieve it or not, not everyone wants to do things your way. You may think you're being helpful, but what you're actually doing is being intrusive, interfering, dismissive, and aggressively overbearing. This isn't about her being 'foreign' (seriously, that's the word you chose? As if the silly little non-American just doesn't know how things are supposed to work and needs you to set her straight) this is about her wanting to make her own decisions for her family. \n\nIncidentally, what do you mean the husband's support is different from a woman's support? Do you think he can't help her with all the same things you can? Do you think your son is incapable of meeting the needs of his wife and newborn? He is the father. His job is to support his wife and child, not let his mommy do it for him because she thinks she knows best. \n\nYTA. You need to back off and let your son and DIL do what they feel is best. And no, that doesn't mean go running to your son so that he's put in the middle and it either damages his marriage or he has to put you in your place. Just back off. Apologise to Camila for overstepping and let her know you're there to help her if she wants you to, but otherwise you'll let her and your son enjoy their time together as a new family.", "I genuinely don't know what you mean. What support can't he offer her? I personally almost died my last pregnancy and still didn't need my mom's help specifically with anything , my SO did just fine", "You’re not her mom though, you’re her mother-in-law which is completely different.", "You need to get better at your verbal comprehension. Your DIL said no and you ignored that to convince her she would need you. Even if you think she will need you it's not your place to insist that. What you did was rude, insulting, and uncalled for. YTA. You should listen to your daughter, she speaks with wisdom.", "Nope. She doesn’t need the help of another woman. She needs the help of her child’s other parent. She wants to do this without your help. She told you that multiple times. I get that to YOU it feels weird. It isn’t. It’s an antiquated idea of gender roles and parenting and birth recovery being “women’s work.” If your daughter-in-law has faith in your son’s ability to be what she needs, why can’t you?", "A partners support can be different from another women's.  But not all women experience the same thing or would even be a great help.\n\nI had an unplanned emergency home birth.  Who I wanted, needed, and was a fantastic support was my spouse. He caught our baby. No one else was there. If I had to choose who could be with me during that scary time. Is him, not my mother, not my MIL, not my women friends. \n\nThe support from other women I welcomed afterwards were when I was well past the initial post partum stage.", "Important. When she tells you something that you don't agree with don't tell her your way is better and her way is sad. \n\nDon't repeat your conversation where you forced your way in. Instead try to actually listen to her, and take her needs into consideration. Because you did no such thing last time. It was all \"Me me me me me me.\"\n\nUntil now it seems you've been 110% focused on doing things your way, and your way only. But newsflash, ITS NOT YOUR KID. So when they say they don't want anyone there for the first few weeks while they bond with the baby you need to accept it and wait your turn.\n\nBased on your overbearing behavior, I wouldn't want you anywhere near me when I was settling in with my newborn...\n\nFun fact: Since you said no one in America does that, my SIL had her kid a month ago, and her parents just visited for the first time this last weekend. They went a whole month without your help, they don't even know you, and they're doing just fine. In fact, it's perfect because that is what they wanted in the first place. And their parents knew how to respect that.", "There is a VAST difference between saying 'She's from Uruguay' and calling her a 'foreign girl'. The former is a statement of fact. The latter is condescending and xenophobic. Hope that helps.", "Because it literally emphasises not the fact that she's from another place, but specifically that she's \"not like us\". It's a phrase that's only about her \"differentness\".\n\nYou could have just said, \"My DIL is from Uruguay,\" which would have indicated that she comes from a different culture. Instead you used a phrase which is both patronising (she's not a girl, she's a grown woman) and tells us absolutely nothing meaningful about her other than that she's, \"Not from here.\"  \n\nI'm sure that you mean well. I'm equally sure that we all understand now why Camila would rather not have her intrusive MIL who sees her as exotically different and other, move into her home at one of the most vulnerable periods of her life.", "You say foreign like she won't understand in your country it's normal for MIL to camp out for a month.  I assure you not everyone in your country thinks it's normal.  You see her as a foreigner who doesn't know what's right rather than an individual .", "Shes not \" a foreigner from latin america\", she's Uruguayan.", "Yup to the 'waiting longer than a couple weeks' comment.", "I am from the US and this is not a US custom. It is not \"normal\" where I live in the US.", "Where are you from? Nobody I know (as in know personally) in Texas or Michigan in my age group had or *wanted* a parent staying with them immediately before or after giving birth. Especially not immediately after, that's for bonding between parents and baby and the immediate recovery from giving birth.\n\nMy MIL came to help me out for a few days the weekend before I popped, but only because I was having trouble safely walking our dog the required multiple times a day while my husband was at work. It was a safety issue for us.", "someone like...your own mother? Or someone like your MIL?", "I live in the US, and can say neither way is the “normal” way.  Many couples have a parents come and help and many others don’t.  You are an AH trying to force yourself into the couple’s business.  If they want your help they will ask for it, until then butt out.", "Your normal doesn't mean right for everyone.  I would have felt uncomfortable with weeks before and weeks after.  I don't know anyone who has this.    A few days when asked, yes, but you kept pushing until she said yes to have it end.   A husband can help with everything including bodily functions post pregnancy.  A husband should know what his wife is going through.\n\nYou didn't let them, the parents, have a private conversation to decide what they wanted.", "I was born and raised in the US. I don’t personally know anyone who did it your way. All of my relatives and friends wanted privacy afterwards to bond with their new child.", "It doesn't matter, it's normal here she grew up and it's what she wanted. Who are you to tell her it's \"sad\" and wrong? YTA", "Op I think you mean well but your staying to help your daughter is different from your daughter in law. She may not be comfortable having you involved in something so personal. I’ve prepared myself for the time that my son has a child, my relationship and interactions will be adjusted to take his wife into consideration. My daughter would not mind me helping her go to the restroom or with showering, etc. My daughter in law will likely want her own mother or to be alone and that’s okay. She is the recovering mother, her comfort has to come before your feelings.", "If you want to help offer to drop dinner off AT THE DOOR, or have food delivered. Pick up their laundry AT THE DOOR and take it home to do it.  Invading someone's space isn't helping, its hindering.", "There’s a huge difference between helping and moving in for a month.  That is NOT normal.", "Maybe regional, maybe generational.  But it's rare with those that I know who had the help you are describing unless they come from a culture where this is common and/or already lived with family.  \nEveryone I know with kids wanted to and spent the initial period of just after birth with just their partner.  Family came to visit later or minimal help.", "Where is “here?”", "Nope, the moment she told you how she does things was the moment you should have dropped it. Instead, you steamrolled her in the conversation and then got your son to help bully her when she wouldn't back down.", "It is far from the 'norm' to move yourself in for a month in most countries", "I think you technically said the way they do things are sad and wrong, not \"different\"", "Then you simply say she’s from Uruguay.  Calling her a foreign girl is so condescending and racist.  Guarantee you wouldn’t have called her that if she was European", "I suspect it's not that the husband caved so much as he thinks having mom around to help let's him off the hook to use the paternity leave as vacation...", "Seriously. At most you get some meal trains and grandma's might come over for an evening or night at a time, but that's at the new parents' request. At least in the region of the US I'm from. Most of it is just friends bringing food and/or offering to come by for an hour or two and run some laundry or do some dishes for mom/dad, or otherwise be another adult human in the house so mom/dad can grab a nap, and then leaving again. \n\nSlightly different if you live really far from grandma(s). My mom and my MIL will likely come stay for a bit after I eventually have a kid, but that's mostly cause they're both a whole multihour plane ride away. But even then, it'll only be for like a week-ish, and probably not right away anyway.", "Some do.  I live in Georgia, and my mother-in-law flew down to stay with us and help out my wife (they are very close).  Meanwhile my sister never had out mother do that when she had kids.\n\nEither way, the dynamic is completely different with a mother vs a mother-in-law, and even then varies from person to person.", "Exactly, the dynamic is completely different with a mother vs. a mother-in-law.  While my wife loved having her mother around, there’s no way she’d want mine there.", "Talk to your son. Leave her be.\n\nEdit\nWhile youre at it talk to him about having her back and following her lead about her needs. That's actually how a loving person shows support.", "You’re not listening. Stop trying to justify your behavior and simply listen, reflect for a bit. Because you are pushing her, this is a fact. There’s no “make sure I’m not pushing” in your story. You pushed. \n\nAs a woman with a very loving, often overstepping, mother in law, I confidently say that you need to quit your bullshit now or do irreparable damage to this relationship. You clearly love your son and DIL. So listen – then do what DIL wants, not what you think she needs. Let her know you are there to support her in whatever way she wants/needs your help. It is not actually helpful if you’re simply pushing yourself onto others.", "It doesn't really matter if you son agrees though.. she's the mother. I'm not saying Dad's shouldn't get a say, but we're talking about *her* recovery after childbirth. She's the one who would have just pushed a baby out.", "Your son doesn’t really agree with you, he just wanted the conversation to end. You pushed and pushed. Just give her space and let her know that if she needs anything, you’re there but let that be it. \n\nI just had twins and my MIL was like you. God it was awful. I just wanted to concentrate on myself, my husband and our babies, and she just kept inserting herself. We have mouths and we’ve made it this far in life. If we need or want help, we can ask. You don’t need to keep pushing and pushing.", "Your son isnt the one that will have clots coming out of the vagina, cracked nipples, possibly stitches, etc", "It doesn’t matter what your son AKA man with mommy issues, thinks", "You are not listening!!!  You will cause marriage issues between the two, is that what you want????  \"My son also agrees with me\"  because you keep pushing and pushing, he was probably sick of listening to you.  Your son should be siding with his pregnant wife.  Do not go stay with them, you will be doing more damage than help.  Step back", "OP--This make it sound like you are going to Stand by the deal you pushed on her unless she now retracts her agreement.\n\nI really think you need to go with.  \"Let's restart this.  I want to help you.  HOW can I help you?  If you need your space at first-I absolutely respect that.  But surely there are ways I can help, while not invading those first few weeks you need of Family only time.  You TELL ME what I can do.  Food prep, cleaning up house while you are at a doctor's appt?  Or even before you come home, Could I do something to help welcome you home(ie clean, cook before she is released from hospital).", "Did I miss something? Is your son the one giving birth?", "Just because your son approves, doesn't mean you're right. At the end of the day, the mother has the final say and you pushing when you didn't like the response makes you the AH\n\nYTA", "If you talk to her the way you’ve responded to comments here then I feel sorry for the poor girl.  You’re like a steam roller completely oblivious to the inappropriateness of your actions and opinions.", "The way you deliver your message is important. \n\n**Do Not**: Ask her of she felt pressured. Remind her of what is \"normal\" for you. Reiterate how she and your son will need you after birth. Remind her of how you have already helped her. Make excuses for being pushy (\"I just wanted to help\").\n\n**Do:** Apologize for being pushy and tell her you are there if she needs you; e.g., \"I realize that I was being pushy when I asked you if you wanted me to stay with you after birth. I am so sorry. You need to do what you feel the most comfortable with. I am here to help you in any way you need.\"", "YOU ARE PUSHING HER. She made that clear. Leave her alone. Allow her to parent her way. She does not want you there.", "What? Honestly this comment is very dumb", "Yes, exactly, that's why I'll talk to her because my son can feel however he wants, but only his wife will have to experience childbirth and that's why I need to talk to her about this and not him, I'll apologize to her for overstepping and I'll let her know I'll be available to help hrr with whatever she needs", "Ugh you just gave me a flashback of right after my 1st was born my MIL charged into the room an grabbed my boob to \"help\" with breastfeeding. What a nightmare. \n\nShe died during my 2nd pregnancy, so luckily I didnt have to put up with that crap again", "That's why I'll talk to her and not him", "I'll tell her I'll be there for her for whatever she needs me/ is comfortable with me doing like I did at the very start of her pregnancy. She appreciated my help though the pregnancy and she reached out to me when she felt she needed it, I'll tell her she can still count on me for whatever she needs and I won't push her to stay over anymore, she'll get to decide that", "Try to read this in a soft tone, not an agry one:\n\nIt's because you are considering your son's will more than the will of the pegnant woman you were pressuring. He is her husband, and it's THEIR decision, not yours and your sons - he's not your husband. Cutting the chord means letting the grown ups be grown ups and respect their decision. It means not being in cahoots your son, but respect his will, and his decision making. How would you have felt if your husband and you mother in law decided thing for you? \n\nThey are grown up people, not children. You don't force your will and views on a grown person, thats incredibly condescending and inconsiderate. If you really want to help and your son wants your help, teach him how to care for her in post partum, and be available for any questions any of them have, but that's it. They will have the final say. You can say \"I respect you decision, and I still am available for any questions you may have. If you ask for my help, I will go and not linger or force myself onto your lives more than necessary.\"\n\nAlso, it's not sad to want to be alone after a birth. It's a choice!  In my country we also don't go to other peoples homes after birth, unless they request it or for a planned quick visit with no meals or ligering. It's simple courtesy. Don't be so close minded. In my country, your style would be frowned upon by many people, because maternity leave is long for bot parents and because people are too tired to put up with a mother in law. That's doesn't mean it's wrong, it's just different.\n\nI advise you to read the poem \"Your Children are not your Children\" by Kalil Gibran. It a refreshing view on parenthood.\n\nSorry, but YTA", "I'd go with unnecessarily rude. You seem to have overstepped, and have learned here. You have taken on advice from people. \n\nIf this process helps you realise that you can help most by asking your son and daughter in law what is best for them, its going to happen through constructive criticism not abusive language.", "Sounds like Mommy's boy gave in just to get you to shut up about it.", "That's a change of heart from your OP where you COMPLETELY IGNORED her and latched on to the one somewhat agreeable thing your son said. \n\nIf the you from the comments was the same you that had this conversation you wouldn't be here. The you in the comments is pretending to be nice and pretending that your DIL matters. The you from the OP couldnt even pretend she mattered. \n\nI wonder which version your DIL will get on the phone? The real you (overbearing) or the fake internet you(nice, but I'm not buying it)?", "My point was your son's opinion really doesn't matter here.", "Take what you learned previously, offers of help and then she will reach out as needed. \n\nI worry when you say \"I will talk to her\" because it's very much coming across it's to soothe your own conscience. A talk isn't needed, an apology is. \n\"I realize I came across a little pushy about helping before and after labor, I'm sorry for that. I will back off and let you lead with what YOU need for your pregnancy and birth journey. I am here to help if you need but will let you determine how much that is.\"\n\nAnd even if she does ask for help, keep it simple, don't push and back-off. It sounds like she is a more private person, who is also alone in this country, and may feel pressure from you, whether your intent or not. Let them figure out their needs and be a support system, not a manager."]}