{"id": 15738, "submission_id": "12zk7c3", "title": "AITA for only only offering to adopt 1 of 2 orphans who are siblings?", "selftext": "A friend suggested I post here and helped with this post.\n\nMany years ago, I was close friends with a couple (Eric & Emi) who asked me to be godfather (closest translation) to their first child. I agreed.\n\nAfter the birth, they moved to a different country and our contact decreased. The last time we met was over 5 years ago and towards the end we only exchanged messages maybe once or twice a year.\n\nMore recently, Eric and Emi were in a brutal accident. Eric passed away and Emi is on life support. I received word only when I was contacted to see if I could take their 2 children, Jo (17F) and Mo (13M). In their affairs, it mentioned to contact me about the kids as the next-in-line guardian.\n\nIt was news to me that I was listed as a guardian to Mo. I don't have much of a relationship with Mo. They never asked me to be Mo's godfather and never said a word when I would send gifts to Jo for her birthday but not Mo. I always assumed Mo had a separate godparent.\n\nI made arrangements to go see the kids. Jo has memories of me but the last time I saw Mo, he was 6. The kids are currently staying with relatives but the relatives can't take them permanently.\n\nMy wife and I are child free though more because of our lifestyle rather than a dislike of kids.My wife isn't too put out at the idea of Jo living with us since Jo is nearly an adult but wife is not interested in being any kind of adult figure to Mo. I travel a great deal for work and don't have time to watch over a young teen.\n\nIf I don't take them, they will be deported from where they are. Jo may be able to have herself declared an adult in the home country. But then she's on her own. Having spoken to her, I know she's terrified of the idea.\n\nI've offered to take Jo for the remainder of her high school and put her through college. Jo is currently thinking it over. The case officer suggested it would be best if the siblings were kept together but I told them I can only take Jo.\n\nI was talking to a friend about all this and she said it was kind of an AH move to take one kid but not the other.\n\nAITA? I hate the idea of fulfilling the technicality and not the spirit but I don't have the time and I feel like it would be better to do what I can than half-ass things.\n\n**Extra info**\n\nJo and Mo are on a visa where they currently live. They're kind of in legal limbo at the moment since their mother is technically alive. Emi requires full time care and I'm still working out how long they can afford to do so but safe to say maybe 3 years tops if they don't end life support. If they pull support early, they save money they would badly need but would likely get deported within a couple of months.\n\nHowever, I'm a citizen of that country. If I adopt Jo, at least she can finish out high school where she is.\n\n**More Info**\n\nTo everyone saying Jo can adopt Mo at 18, courts aren't just going to approve an adoption. Jo would have to show that she can handle the responsibility of a minor by herself, and if she can't, Mo remains in the system.\n\nTo everyone else saying just provide money, it's not that simple. Mo is young enough that the courts will insist that he either have a legal guardian or become a ward of the state. In the case of  a legal guardian, the money would be made accessible to them. In this case, there are relatives and there's a reason why the parents didn't want the relatives taking them in.\n\nIf I knowingly circumvent the guardians to put money directly in Mo's hands, I assume a degree of legal responsibility. If I had time to actually parent Mo, not a big deal, but I don't have that time.", "created_utc": 1682521436, "permalink": "/r/AmItheAsshole/comments/12zk7c3/aita_for_only_only_offering_to_adopt_1_of_2/", "score": 80, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I only want to take the child I took formal responsibility for; (2) this leaves a second younger child without support.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I can understand objectively why taking Jo seems doable to you and your wife, especially given that you're child free and you never knew that you were their listed next of kin. \n\nHowever, both children lost their parents and the younger of the two likely needs to be near their sibling. \n\nThis will be a case of YWBTA if you're willing to separate the kids. If you cannot reasonably take in both, then either re-assess your stance on having a two teenagers with you or ask for the relatives to re-assess their's.", "YWBTA for not taking both kids together. It’s a huge commitment and clearly your friends should have asked you. I would understand why you wouldn’t want to take them but I think it’s morally wrong to split them up.\n\nEdited to add- if you can’t provide a LOVING home to both kids maybe you can provide financial support from a distance.", "YTA. Not only are you separating siblings, but you're putting it on a 17 year old to decide whether she abandons her brother or gives up the life she has.", "YWBTA.\n\nFor 2 reasons.\n- Separating siblings when they need to be together the most\n- Separating siblings, when it is likely that by adopting only 1 child, the second will be deported. Just think on that. A 13 year old child will be deported to somewhere they likely have never been to in years, and likely have no family", "Soft YTA. It’s all or nothing.  Kids should not be split up.", "NAH. No one should ever take a person that they can't treat with love and care.  But separating them by a country when grieving so hard is heartless.  It is literally best to be kept together and you would be ignoring expert opinion.   Deported could mean a country the youngest doesn't even know the language of.\n\n  Take both or take neither.  14 isn't that far away and at 18, 19 the oldest may be able to take the 14 year old.  the 17 year should have a voice.", "Wow, this is an incredibly unfortunate and unfair situation exacerbated by visa issues. I feel really bad for Jo and Mo.", "YTA. You're not the ah for not being willing to adopt more than one kid. It's a big undertaking and there are very few situations where someone would be an AH for declining to adopt someone else's kid. But that being said, you can't really think it's reasonable to split up siblings when their family has fallen apart in tragedy. Particularly leaving the younger kid behind is introducing a whole new trauma to already traumatic events. Plus, you're putting an impossible choice on a grieving teenager. So you're perfectly fine for not wanting to take both kids, but you should have had the forethought to know not to make an offer that splits them up.", "Yta so its better for 1 kid to be deported???  At least they'd be together. \n\nCan you not take both, with the understanding that Jo will be adopting her sibling at 18?  If you can help her through college then surely she can do part time and stay with her sibling.  Mo is 13, not 3.", "YTA! You're really going to separate these two kids when all they have is each other? What an AH you are.", "NAH...Everyone here is put in a terrible situation, and I don't envy the decision before you.  If you don't feel you can take on the situation, then you probably shouldn't. Personally, I'm surprised that the oldest would be willing to come without her sibling. I hope this works out well for everyone eventually.", "Info: why does no one care about what happens to Mo? You go on about jo, but fuck mo because he’s a few years younger? I just don’t get it, he’s not a baby, he’s 13. Why break up grieving siblings and basically telling Jo after losing her parents to choose between staying with her brother or staying with you and abandoning him? That’s a really unfair thing to put on a kid that’s just lost their parents, sorry not lost both but losing one and watching the other die. I can’t even imagine being godparent to one sibling and then completely ignoring the other just because you weren’t asked to be godparent. Boggles the mind. \n\nYou’re not obligated to take either of them but to break them up like that over such shitty excuses would make you an Ah. My heart breaks for Mo, the kid no one wants purely because he’s a few years younger. Jo gets to stay in school and have her college paid for and Mo not only gets deported but thrown through the system to a life of foster care. You’re kinda half assing it already, you say you guys have no interest in being any form of adult figure in Mo’s life but you do know you have to be an adult figure for Jo? She’s only 17, she’s still a minor who’s losing both parents. It isn’t going to be a case of just letting her stay with you, she’s going to need help advice and guidance throughout her life and will fall back on you as the only adult figures she has around. She’s going to be traumatised from everything that’s going on and if you took only her she’ll be dealing with the guilt of not knowing where her brother is. It’s not going to be a walk in the park. \n\nWhy not, if you can afford it, provide money for both kid’s education and money for Jo if she took on guardianship and take neither? That way you help with a safety net without splitting them.", "YTA, these kids have just lost their parents, you can't ask them to lose each other too.", "YTA. \n\nThere is a lot of tragic stuff going on right now. They just lost two parents. And your thought is lets make them loose each other. Siblings of 13 years. It would be one thing if these were babies. Still horrible to separate but they wouldn't know. These are fully aware Teens... These two will need each other as they mourn the loss of their parents... Why would you want to throw even more of a wrench into there already wrecked world...", "YTA. You take both or you take none. Separating two grieving children will cause them immense amounts of trauma. Life altering. Do not under any circumstances force two children who have lost their entire world to be ripped apart from the only thing they have left.", "YTA for separating bereaved orphaned siblings and it's a little scary that you need to be told that.", "I would advise you not to take the eldest unless you take both. They just lost their parents. It seems cruel that they should be taken from each other as well. These kids have just had the rug ripped out from under them and they probably need one another. Maybe think about taking both on a trial basis. At least give Jo a little time to get her life together in case she needs to take custody of Mo.", "Soft YTA it could've also happened at a time that Jo was minor. Then you would also have abandoned her? Or still just Mo?", "What country deports minor children?", "It’s not two choices here but three! You would not be the asshole for refusing to take them together, that’s a financial and emotional burden that you explained you are not able to do, but you would be the asshole for taking only one of them and leaving the other in limbo. The third choice is taking neither.", "YWBTA - It should be a package deal for the kid's sake.  If you just can't take both, you should take neither.", "If the kids can stay together they should. I’m conflicted on AH status here. But you should be Jo’s last option, not her first.", "YWBTA. These kids lost their parents, why would you want them to lose each other too?", "YWBTA\n\nDefinitely both or none. \n\nBut explore your options. \n\nPerhaps you can have Jo declared Mo's legal guardian and you support HER in the role. They don't live with you but you help with all logistics etc.", "idk man. i'm on the fence. the one thing that really stood out to me was the fact that you said \"i would send gifts to Jo for her birthday but not Mo.\" and \"...not interested in being any kind of adult figure to Mo.\" it honestly sounds like you just don't like or don't care about one of the children. you're fine with taking Jo \"because she's almost an adult\" and you'd be fine with sending her through college but taking in Mo would be crossing a line for you? I'd try to help contact other family or friends to see if they could take them both in because they do not need to be separated. also, you mentioned that you spoke to Jo and know she's terrified of being declared a legal adult at 17 (rightfully so) but you don't seem to care or acknowledge Mo's imminent struggles as a young teen boy. it screams choosing favorites to me. you do not need to take either of them in if you can't take both. support from a distance and be involved in their lives if you want to.\nEDIT TO ADD - i'm only on the fence because i do personally think you're a soft AH, but, you have no real obligations to the children. they aren't your children nor are they your actual blood relatives. you didn't even know you were listed as a guardian so you don't HAVE to do anything.", "NAH. Also what does Jo want? You say that if you adopt her she can stay where she is to finish school. Is it possible that she would be willing to “raise” her brother if you adopt him as well. I know she deserves to have a childhood and not worry about a kid but if she wants to that is different. Then maybe you could just be financially responsible for him and not responsible for raising him.", "NTA The objective truth is, the parents are for NOT DISCUSSING THIS WITH THE PERSON THEY LISTED AS GUARDIAN! Adoption is a HUGE change, not a small favor or small inconvenience. You had ZERO warning. Nobody can ask you to completely reformat your and your partner's lives because someone listed you as a guardian without your knowledge. Anybody saying it's cruel not to adopt both is free to volunteer to adopt both, including the Y T A-ers in this post. There is no argument that can be made that you have more moral obligation to do this than anyone replying to this post does.", "Ywbta\n\nYou said they have relatives here right? Cant you arrange with them so you can take mo’s guard but she stays most of the time with her relatives?", "NAH - I understand the dilemma but the right thing to do is to try to take both kids. Or find a different way to help them. But please don’t cause more trauma to already suffering children. But your kindness to even consider helping Jo is already wonderful.\n\nAlso remember that Jo may be willing to take responsibility for her brother in the absence of hands on parenting from you and your wife.", "What happens if you take neither of them? Are they going to end up together? \n\nAll these comments seen to think if you don't take them both, they'll magically end up together in another country. Where is this coming from? Do they have ties there? \n\nI'm not going to call you an asshole for only being able to take care of one kid. Who is going to take care of the 13 year old? Jo? You're traveling, your wife isn't interested....so? NAH.", "YWBTA yeah. Take them both or not at all.", "YWBTA 100% \n\nIf you can’t take both (which can be understandable) then don’t take either. \n\nBoth children just went through something traumatic, but Mo is also at that age where it could seriously impact them in the long run if they are separated from the only family they really have aka they’re sister.", "YWBTA\n\nI agree with other commenters. It’s all or nothing. \n\nI fear for what will happen if you don’t take them honestly but you do have the right to say no. \n\n17 and 13? At bare minimum you would be committed for 5 years until the younger is 18. Their situation is very fluid  and fragile right now..you could be that structure until they are old enough or until the other relatives are able to figure things out. \n\nIdk. It’s tough if you empathize with what will happen to the kids. Don’t separate them if you can’t do both. They need to be together to grieve.", "I mean hoenstly Mo is still better off with his sister in a home where one guardian doesn't have time for him and the other who doesn't want him that much than in an orphanage.\nSo you'd still do him a favor.\nPlease take him in.", "NTA too many parents don’t bother to have plans with willing parties for their children in the event that they themselves pass away. Parents pass away all the time. There needs to be a plan beyond “oh I’m sure *someone* will take on this massive responsibility. That’s that.” I feel really badly for the children. On top of grief, not knowing what’ll happen to them next. I think it’s best that the children aren’t separated. I hope that happens for them.", "Try to take them both. I know it's a huge undertaking, and no you would not be the A if you didn't, because if you can't, well, you can't... But it's the opportunity to make a huge difference in both children's lives. It's the opportunity to be a really good man, and these opportunities don't come often in a life.\n\nIt might happen to me soon. For complicated reasons I might have to take care of a thirteen years old if my best friend dies. Hopefully she will rally and this won't happen! \n\nNo judgment, I think it's a very complicated matter, but you can make a difference here.", "NAH. You shouldn't take in a child you have doubts about raising, it probably won't end well.\n\nYou talk about them being deported though. You talk about being able to stop Jo being deported and finishing school where she is. You talk about supporting Jo. All of that is lovely. But it feels icky that you don't seem to care that *Mo* will be *deported*. That *Mo* won't be able to finish school where he is. It feels like you are a hand reaching down from on high saying \"this one is worthy\".\n\nI think my ick factor is that, while they're both probably minors, one is significantly more at risk, and that's the one who is *definitely* going to be abandoned. \n\nYou're not the AH if you only take in Jo, but I think, ethically, it's both or neither as far as fostering/sponsoring/adoption goes. Would you be willing to offer Jo financial (or any other) support *without* adopting her?", "NAH\n\nIt's usually best to keep siblings together but you know your situation best.\n\nThis is way above reddit's pay grade though.\n\nWorry less about being an asshole and more about honoring your own conscience right now.", "YTA. You don't get to pick and choose what children you want like yiu are shopping for candy.", "NAH but the right thing to do is take both of them.  But that doesn’t mean it’s a moral obligation since you never agreed to it, so not doing it doesn’t make you TA.  Their parents should definitely have spoken with you about being their guardian.  You might consider taking them both temporarily while something more permanent can be figured out - that would seem to be reasonable if that’s an option - and you might consider trying to find other family or friends to help.\n\nIf it were me though, I’d take them both.  Even if not what I originally planned for or wanted it’s the right thing to do, and the rewards for you could be great as well.  I know you don’t feel that connection now but you might develop it.  Also, just the fact that you feel a connection with the older one and care about her should lead you to think about taking them both as separating them will be so much harder on her.  She has already lost her parents, and her sibling is all she has left of a life that was taken so suddenly from her.\n\nSo even if not morally required, I’d strongly consider thinking about finding a place in your heart for them.", "NTA.\n\nYou can only offer a choice to Jo and let her know you can’t take her sibling if she stays with you. Then anything she decides, will be up to her. \n\nBetter than taking a kid whom you don’t want because raising kids come with financial and emotional responsibilities. You are not their blood relative and hold no obligations to them.", "I'm going to go with YTA for being so all or nothing with this. Why are you willing to put the oldest one through collage but not care for the youngest? Is possible to have them both for a year and then have the oldest take in their sibling? It would obviously still mean an economic burden for you, but maybe it's less jarring in concept for you and your wife?", "YTA- Take both in; life happens and yes it is unfortunate that you and your wife weren't consulted about being listed as secondary guardians but you losing your 'child-free lifestyle' is nothing compared to what these children are going through.", "YWBTA: all of nothing. They have already lost their parents, and now you want them to loose eachother? Have a THIRTEEN YEARS OLD KID DEPORTED? By themselves? Like how is that acceptable or even ok to write down?", "These kids have lost both parents & you want to separate them or worse have them deported if you don't take them?   I can't imagine being in your position, but I know I would not separate those kids & I would find a way even if it meant sacrificing, to take them both.  YWBTA if you separate these kids or allow them to get deported.", "YTA, because you are forcing a 17-year-old who just lost her parents and is facing deportation and the loss of everything and everyone she knows to decide whether to accept staying with you and going to college here--but leaving her younger brother to be deported alone, away from everything and everyone he knows. That is a horrible position to put her in. If she chooses to stay, she could damage her relationship with him forever--and who knows if she'd be able to find him or get him back once she's an adult, or what might have happened to him? \n\nAlso, 13 is old enough to be home while you travel for work, especially if your wife is there, if not interested in doing parenting--she'd at least, I hope, make sure he doesn't accidentally burn the house down or throw a rager-- and Jo would be there too for the first year as well, and may be able to take him all or part time once she's an adult, or at least in just a few years. I would say it's not a good idea to take him in if you and your wife don't want to parent him/don't have time to devote to him-- but the alternative here is splitting up two siblings and sending one to another country, where it sounds like he hasn't lived for a long time if ever and doesn't have relatives, to be thrown into a foster system in a totally unfamiliar place...", "Soft YTA. Take both or none. Jo can help raise Mo and can get a job and hopefully move out at 18 and bring Mo. I’ve had a friend who was 19 get legal custody of her 15yr old sister and they lived in a small 2 bedroom apartment. Please don’t just take 1. It’s incredibly cruel to separate them now and I would not want to live with that in my mind for years, especially if this gets bad for Mo you’ll feel so much guilt.", "YTA, you do not split up siblings especially after a tragic event. Like how would you feel it this was done to you? Figure it out and make it work with both the kids or let them both go.", "This is a difficult one. \n\nMy question is....would you want to be separated if you were in this situation? \n\nYWBTA if you only took one, but on the flip side...you care enough to consider trying. So very difficult to make a judgement on you. Good luck with your decision.", "YTA \n\nYou essentially gave a teenager the choice to try save them selves from being deported or go with their younger sibling and face who knows what, when they are going through the toughest moment of their lives. \n\nWOW\n\nWhen you accepted to become godfather you basically accepted to be a guardian in the event of the parents deaths regardless of age. Yes you didn’t on the second child but would you have the taken the same oldest had they been 13 when this happened? \n\nTake both or neither, it’s a few years of your life to give them the best start in life. \n\nWhich decision will you regret most? That’s your answer.", "YTA. You made their parents a promise. The worst has happened to them, and you promised to protect their child. Separating their children is the last thing the parents would ever want.\n\nObviously, legally this is still your decision. Morally, you made your decision many years ago when you promised to protect their children if something happened to them. Something did. Your real choice is whether you are willing to do right by your friends or not.", "NAH. Can't really blame you here. But maybe there are some adjustments that can be done to make it work out for everyone. I don't think they should be separated either at this delicate moment. But she's almost 18. She'll be his legal guardian soon. Idk the financial aspect of all of this, if you have enough money for this or they will Inherit something that will be of help to their future, so if it's possible, I'd suggest to take them both untill she's 18, then assist them with getting their own little place, and take a more \"advisory\" position, to help them with money, studies...etc.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA friend suggested I post here and helped with this post. \n\nMany years ago, I was close friends with a couple (Eric & Emi) who asked me to be godfather (closest translation) to their first child. I agreed.\n\nAfter the birth, they moved to a different country and our contact decreased. The last time we met was over 5 years ago and towards the end we only exchanged messages maybe once or twice a year.\n\nMore recently, Eric and Emi were in a brutal accident. Eric passed away and Emi is on life support. I received word only when I was contacted to see if I could take their 2 children, Jo (17F) and Mo (13M). In their affairs, it mentioned to contact me about the kids as the next-in-line guardian. \n\nIt was news to me that I was listed as a guardian to Mo. I don't have much of a relationship with Mo. They never asked me to be Mo's godfather and never said a word when I would send gifts to Jo for her birthday but not Mo. I always assumed Mo had a separate godparent.\n\nI made arrangements to go see the kids. Jo has memories of me but the last time I saw Mo, he was 6. The kids are currently staying with relatives but the relatives can't take them permanently. \n\nMy wife and I are child free though more because of our lifestyle rather than a dislike of kids.My wife isn't too put out at the idea of Jo living with us since Jo is nearly an adult but wife is not interested in being any kind of adult figure to Mo. I travel a great deal for work and don't have time to watch over a young teen. \n\nIf I don't take them, they will be deported from where they are. Jo may be able to have herself declared an adult in the home country. But then she's on her own. Having spoken to her, I know she's terrified of the idea.\n\nI've offered to take Jo for the remainder of her high school and put her through college. Jo is currently thinking it over. The case officer suggested it would be best if the siblings were kept together but I told them I can only take Jo. \n\nI was talking to a friend about all this and she said it was kind of an AH move to take one kid but not the other. \n\nAITA? I hate the idea of fulfilling the technicality and not the spirit but I don't have the time and I feel like it would be better to do what I can than half-ass things.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I wouldn’t say AH because it’s really not your responsibility from what I understand, but it’s sad to think that the siblings will be separated.", "Yea, YTA if you separate siblings like this. Take both or neither.", "While I understand that taking on the responsibility of 2 teens is hard.... ywbta if you split up 2 siblings who just lost their parents. They are all each other has atm....", "What a hard thing!  Could you take them both while looking for a better solution for Mo?", "INFO What are the legal options open to you? Are we talking legal adoption where they legally become your children? Is there any sort of non-permanent guardianship available? Can you take them both temporarily and see how things go?\n\nI don't think you have an actual obligation to either of them here, but on the other hand, I don't think it would be appropriate to adopt one and reject the other. If there's any way you can manage to care for both of them non-permanently, I think that would be awfully good of you to do.", "Second post I see today about separating siblings in adoption...", "Do you live on a remote island?  \n\nSeriously, involve your community. If you are part of a religious community, a sports community, anything. Friends can and almost certainly will help. \n\nYou were thrown into this situation and are reacting the way one would react if they suddenly got tossed into a cold lake in the dark. You are flailing and that’s understandable. Take a deep breath and look for help. \n\nI don’t know where you live, nor what your circumstances are, but remember, they can (eventually, they are grieving) be a big help to you in return. These children will be adults soon enough, but even as teens they can help around the home, maybe get part time work, and when you are elderly, you may look back on this as the best decision you ever made. \n\nBy offering this to the daughter, who is considering it, you are giving her a Faustian choice. Her brother will hate her if she says yes, and she will hate you for putting her in that situation. If she says no, she may resent her brother and he will live with maddening guilt. \n\nPlease don’t separate them. Ask for help, but take them.", "If this was in my circuit you'd be torn apart and they wouldn't let you keep either kid lmao YTA", "Yes YWBTA if you separate siblings", "They are real human beings who are siblings and have lost their parents (your dear friends) in a traumatic accident. You talk about them like they're just bonded dogs or something. \nSo I do think YTA. Sometimes life happens and you get in situations where the right thing to do is putting someone else first", "NTA. obviously very complicated and all your feelings are very valid. Here is my brutal response. If the mother won’t recover, take her off life support, take custody of both children and make it known to Jo that once she’s 18 and finished high school, she’ll have the money and responsibility for her brother. That you’ll be there to help her make good decisions and as emotional support, and maybe some financial if you have the means, but that you and your wife do not want children. \n\nIn opposition to this though, let me tell you my story. I did not want children, but at 23 my sister fled domestic abuse and I found myself looking after her 5 children (3,5,8,12,13) for a year full time, and most weekends and summers (I was getting an advanced degree at the time) for the following 5 years. I love them with all my heart. My sister is much older than me, and I had little to no contact with her or her children my whole life before this. I just happened to be down interviewing at a university near her place when she needed to leave. \n\nToday her daughter, now 23 and thriving came over with the eldest sons baby and his wife. I am happily childfree but as I was passed the baby for the first time, his mum jokingly asked “how does it feel to be a grandma at 36”. We all laughed and she my niece piped up “none of us would be here without you”. I cried \n\nSometimes the curve balls life throws you, are ok to catch. You and your wife might find you too fall in love with 2 kids that were never meant to be yours.", "YWBTA, honestly if you’re so insufferable to even think separating siblings who just lost their parents is a remotely good idea, you shouldn’t take custody of any child ever. You either take both siblings or neither - you don’t induce further harm by separating them.\n\nBeyond that, be realistic with yourself - if you and your wife were to take in Jo & Mo, or even just Jo, would you actually be genuinely good people & care for them? Or would you constantly make them feel like burdens for their parents dying and impacting the “lifestyle” you value so much? Because the way you talk about this situation is making the latter seem much more likely.", "Please take them both. YWBTA", "YTA  ... The kid is 13 not 5; they can be mostly independent at that age with the proper guidance and education. \n\nAnd it's only a few years. They just lost their patents and their life is about to change dramatically. Be a better role model", "YWBTA. Separating the siblings when they’ve just been through such horrific trauma would be cruel.\n\nFigure out a way to take both in or to help them stay together.", "Not just separate them…the younger kid would be deported to god knows where and god knows who. \n\nThis isn’t a “grandma can only take the younger one and we can only take the older and she lives an hour away, so you’ll get to see each other all the time and you are in safe homes.” Type situation.", "So would they be AH if they refused to.take either? Seems like damned either way.", "If I do nothing, things will get worse for both. Guaranteed deportation. A significantly worse system in our home country. Fewer future prospects all around. \n\nI guess I see it as, if I help Jo find her feet ASAP, she can then help her brother the way he actually needs.", "What does YWBTA mean?", "In an ideal world they wouldn't be. But we don't live in an ideal world.", "so it's heartless to separate them but OP isn't an AH for planning to do so?? that makes no sense", "They don't have the time. They have to make some hard decisions fairly quickly. This sounds harsh, but every day Emi is kept alive is a sizable cost. If I weren't part of the picture, they'd still have to face this decision now. \n\nI made the offer to give them as much room as I can. Delaying would only make things worse.", "Courts are unlikely to approve an 18 year old who doesn't have the means to support herself adopting a minor.\n\nThere are also legal considerations to housing and sheltering a minor. You carry a degree of liability no matter what if a minor is living in your residence.\n\nI actually wouldn't mind providing a place for Mo to live in my country since our laws are more lax, but the legal considerations aren't so simple where they are. However, neither really wants to move.", "In our culture, the god parent is literally to take in the child if anything happens to the parents. I was looking for the translation and this seems to be the closest thing in English.\n\nI only talk about Jo because I was her official god father. I put in time and effort to build a relationship with her as a child. Her parents made her available for me to connect with.\n\nBy the time Mo came around, there was already some distance. I also didn't want to simply presume that I was his god father since it's pretty common for different kids to have different god parents.\n\nTo the last of your questions, it's related to law. You can't just provide housing and money to a minor without assuming a measure of responsibility legally. Also Mo is young enough that most legal systems will insist that he has a guardian or become a ward of the state. So if I refuse to become his official guardian they will put him in the system no matter what, or in this case, deport him to another system.", "The United States, for one.\n\nIf a foreign national is working in the US on a work visa and their foreign national kids/spouse are dependents on that work visa, then the kids/spouse can be deported if the visa holding spouse dies.\n\n[Here is one such example.](https://timesofindia.indiatimes.com/city/hyderabad/h1b-visa-woes-deceased-mans-family-to-be-deported-from-us/articleshow/77642659.cms) A father working on an H1-B visa died of leukemia. His surviving wife and child had to leave the US. Horrifically, he had continued to work right up until the end so as to maintain his family's lawful visa status. [Another such case](https://www.indianeagle.com/travelbeats/greencard-limbo-leaves-h4-family-helpless/) resulted from the death of the primary visa holder due to a heart attack.\n\nOf course if the kids are US citizen they cannot be forcibly deported.\n\nIt all depends on the exact visa the parent had and whether they have begun the Adjustment of Status process to change to a permanent Green Card.", "Most of them", "what country doesn't?", "The gifts thing is normal to me-- my siblings and I each have different godparents, and they would generally only send gifts to the child they are the godparent of. Our godparents are not the people who would have taken custody of us if our parents had passed while we were minors, though. \n\nBut it's horrific to take only one of these children--and to ask Jo to decide whether to lose her brother and send him to another country alone or to lose everything and everyone else she knows? Jesus.", "That is not a fair burden to put on Jos shoulders. She is a child herself and deserves to be a kid.", "This is what I was thinking. Is there any guarantee they would even end up together? Like I don't know where they would be deported to but wouldn't the 17 year old age out at some point and be separated anyway. Honestly I agree with NAH. It's a tough situation.", "Forcing that decision on a child is absolutely horrible and inhumane.", "I wouldn't think that they would be the AH if he and his wife chose not to care for children they didn't know that they would be responsible for in the event of such tragic circumstances. Raising children is a big responsibility and its one OP and his wife clearly considered when it came to any family planning of their own.", "You may \"see it\" that way, but in practice you're basically just proposing to let a bereaved teen stay in a room in your house for a year while their much younger sibling goes into that \"much worse\" system alone, and then putting all responsibility for rectifying it onto the teen, including fighting with transnational custody laws surrounding Mo.\n\nEdit: YTA btw. Either take both or neither. It's messed up to try to kick it down the road like this, in hopes that they'll just both age out of care before you really have to do anything.", "You fail to see the emotional impact and devastation it will cause to both siblings if they are separated. Or you think it is not equally important than meeting other needs. I was separated from my younger sibling for years when he was 10 and I was 20. I was much older and did not suffer the death of a parent and it still hurts. Also I lost my older sibling years later, everyday it feels like I'm walking around and missing a part of me. Either take them both or take none.", "I know it’s not what you wanted, but the right thing is to take both.  It’s not like mo is 3, he’ll be off to college in 5 years, that’s not so long that it’s insurmountable.  You’d be a hero if you take them both.  It’s your life and your decision, but I think you know deep down that’s it’s the right thing to do.  Good luck to you either way. Nah", "Be honest with Jo. She's old enough that she can help look out after Mo. if you adopt both of them, they don't get deported. That's the goal right now.", "Either take both or stop pretending you actually care", "You could try to help them find some other relative willing to take them in if you can't take both, or help them financially once the oldest can legally become the youngest guardian. It might seem like the lesser evil to separate them and let the youngest get deported, but the kids will resent you for sure.", "It’s right to take both of them op.", "So then can't you just take both and still get Jo on her feet ASAP so she can take her brother and support him? \n\nI understand not wanting to disrupt your whole life but can't you take the disruption for a year or so until they can fend for themselves and support each other? Surely that's better than either of the other outcomes", "The reality here though is that Jo is a long ways off from being able to help her brother. She is 17. By the time she has genuinely secure footing, Mo will likely be an adult and the situation for reunification becomes a lot harder.", "You Would Be The Asshole. Basically a future YTA.", "Not yet the asshole, but he would be if he actually did them.  \"You Would Be The A \"\nTook me a while to figure out the acronyms lol", "You would be the a**", "He only agreed to be a godparent to one.   So in one way, he has responsibility to only one.   So there's a situation where there's what he agreed to, and what is morally right vs wrong.  So I see it from both sides. That's why morally I said he should take both or none. But I also recognize he only has responsibility of one.", "OP hasn’t done it yet. I think the mere fact they’re here means they’re questioning the morality of the situation.", "Sizeable cost…. You said in another comment they have three years worth of time. So no they don’t need to decide right now. YTA. You said they are in limbo as long as their mother is alive. They have time to figure out a better solution. Or can wait it out until one is a legal adult to adopt the other. YTA does mo know about your offer to Jo? I’d be devastate and there would be nothing you could do to save any relationship if she accepts. It should have been more thought out. Like I said they have3 years worth of time. YTA", "It sounds like they are moving one way or the other. With you or deported. \n\nA court is far more likely to grant guardianship to an 18yo for their 14yo sibling if they have a support system, which you've already said you would be. Financially, at least.", "When it's a sibling adopting due to the death of their parents it's usually an exception, and they prioritize keeping the family together over everything else.\n\nShe would need financial help though to get started at least and be willing to do it with all the sacrifice it entails. If your option is one or neither, might be worth exploring.", "That makes sense, but your examples contain a surviving spouse.   What happens if both parents die at the same time, and the minor children are suddenly out of status?", "I don’t know.  Perhaps you could enlighten me.", "None of this is fair", "Agreed. It’s a crappy situation. But if she’s only presented with the option to be separated from her brother or fend entirely for herself…shes facing an impossible choice.", "By finding her feet, I mean getting her through college and started on a career.", "They have 3 years if they liquidate everything in the near future. If you're only counting liquid assets, then may be a year. We're still figuring this out.", "Soooo, until such time as Mo is an adult? And you don't think that would do anything horrific to their relationship?", "Letting the last of her close family be deported will knock the feet right out from under her, though. You'd be starting her at a severe disadvantage.", "That’s *at least* five years—while the other child spends that time with no help or support. And no guarantee that Jo will be instantly positioned to do anything significant for her brother upon finishing college.", "This young woman may be grieving a long time and not able to just handle college and starting a career as easily as a peer her age, keep that in mind that she will be dealing with the trauma of losing potentially both parents and sibling. You might find yourself caring for her longer than you are comfortable.", "Pretty sure Jo will not \"find her feet\" knowing her brother is suffering.", "I'm also scratching my head at OP's logic here. Really doesn't make sense to take one in for 4-5 years when they'd both legally be adults by then and be able to live on their own. Why separate them based on a technicality? \n\nI get that it's his life and he can do what he wants, but this is clearly a case of take both or none.\n\nSorry OP YTA. These poor kids deserve someone who actually do what's best for them and at this point, it's to keep them together.", "It's a better solution than these kids being deported. If they take in Jo then Mo will be kept in the country and hopefully not be deported. It's an awful situation all around. The real AHs are the parents for not having a will in place. Why didn't they keep in touch with the OP?", "It's not a technicality. I assumed certain responsibilities when they asked me to god parent Jo. I built a relationship with her as a child and her parents encouraged it.\n\nThere was none of that with Mo. It was a very real surprise to me that they listed me as the next-in-line guardian to Mo because I always thought he had an equivalent elsewhere."]}