{"id": 15802, "submission_id": "130jy73", "title": "AITA for not giving my mom my old medication?", "selftext": "NSFW due to mentions of drugs\n\nI am a recovering addict. I used to have xanax prescribed to me for panic attacks but it was discontinued. I kept an old bottle in the cupboard just in case (I know, I know.)\n\nOn Saturday my parents came over. I told them how I was doing in my recovery and that I was going to properly dispose of my old Xanax at the pharmacy or police department. \n\nFor the sake of brevity, she asked me for the drugs and I said No. My No was not respected. When I said no she said “well why, I’m not an addict!” She then proceeded to rub my nose in the fact that I stole drugs from her when I was in active addiction, and basically said I owed her. \n\nI was so upset, that I brought up a time she medicated me without a doctor’s consent or prescription when I was a child. She then gaslit me, saying I was making it up and that never happened. I kicked her out of my house. \n\nI’m so upset. I’m in very early recovery and trying my hardest to get well. We haven’t spoken since I kicked her out and my heart hurts. I just wanted my mom to be proud of me, but instead she tried to guilt me for my old medication. So Reddit, AITA?\n\n(I disposed of the medicine the next day at the police department). I’m 7 days sober from my drug of choice today.\n\nEdit: I just want to say thank you to everyone for wishing me well in my sobriety. I appreciate all of you and your responses so, so much!", "created_utc": 1682597174, "permalink": "/r/AmItheAsshole/comments/130jy73/aita_for_not_giving_my_mom_my_old_medication/", "score": 487, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I might be the asshole because she’s my mom and has always been there for me. But I know what she was asking me was wrong and also illegal. I’m very torn up.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If she needs the meds let her get them prescribed. Well done on your seven days.", "NTA. Meds are prescribed for you and for you only. And especially Xanax isn't candy you can just hand out.\n\nThe fact that you stole meds from her in the past has nothing to do with that. In fact, reconsider how often you see your mother if she's continuously going to bring up your past to get something from you.", "NTA. You acted responsibly, and I’m not sure how old you are, but your mother seems to treat you like a child still. Good luck on your recovery.", "NTA\n\nCongratulations.  Addiction is hard and I commend you for choosing sober living today.  It sounds like your mom is an enabler.  It might be hard for you to maintain a close relationship knowing that she is also abusing medications that are not prescribed to her.  I don't knowi if you are going to meetings/counseling but if you are maybe invite your mom along for the experience, and maybe a heart to heart about the best ways she can support your sobriety.  Best of luck to you!", "NTA. It’s inappropriate for your mother (or anyone) to ask for prescription medication from you. \n\nAs you evolve in your recovery, you’ll find it gets less challenging to navigate conflict. This conversation devolved into score keeping which never feels good. The response to her request could have been, “I’m trying to develop habits that will keep me in recovery. Exchanging prescription pills is something I used to do, but no longer. Turning these into the police is a step I need to take to be healthier. Please respect that.”", "NTA, pretty sure it is illegal to give someone else prescribed drugs.", "NTA and I'm proud of you!!!!   For standing up to her.  For doing the right thing.  Mostly for SEVEN days!!!   The first week is the hardest, you got this!!!!", "NTA. But I’m wondering, is the drug you previously took from her also Xanax? \n\nIf so, she can get a prescription filled herself. \nIf not, that’s *very* concerning.", "Info: why did she ask you for the drugs? To take them for her own personal consumption or because she doesn’t want a daughter in early recovery to have a highly addictive substance in her apartment?", "Firstly, congratulations on the first 7 days. The beginning of recovery is  so hard. I'm not your mum, but I'm a mum, I want you to know how proud I am of you. \nI'm sorry your mum isn't as supportive as she should be, but you have done the right thing", "NTA. You acted responsibly and in accordance with your treatment. I am concerned by your mother's behavior, though. Congratulations on 7 days sober! That's no easy feat. Keep up the hard work.", "My mother also has this belief it is a good idea to save painkillers. It's not! You may or may not be generalizing, and have made a decision about your responsibility for community and well being. It is your decision to make. Nta\n\n(Edit:) Sorry you had two things get mixed up in your situation.", "NTA. Whether she’s an addict or not doesn’t matter. Even having this awful conversation with anyone is asshole move, but with a very newly sober person is colossal monumental asshole behavior. It feels like sabotage. \n\nIt seems to me that mommy dearest isn’t conducive to your recovery, and you may want to take a bit of a timeout from her. She doesn’t seem to have your best interest at heart.", "NTA.\n\n(Firstly: So proud of you for taking those first steps, even prouder that despite your mother's cruel words you stuck at it and I wish you the best in your recovery journey darling.)\n\nIn light of that, kicking someone while they're in the very vulnerable state of committing to recovery is such a low blow and totally uncalled for. Yes, there's been history when you were in active addiction but it's so senselessly cruel to throw that in your face when you've made the decision to change your behaviour. \n\nIf she had asked for the drugs as a safeguard FOR YOU, as in worried you may take them and fall back into addiction, I'd be leaning more towards a different judgement but that isn't the case here. \n\nI hope you have other people in your life that are supporting you through this, chasing maternal love can become as much of an ingrained behaviour as addiction and when you aren't getting the return it can lead to dark places. Don't let her break you, and best of luck with everything ❤️", "NTA, not by a long shot. Wishing you strength in your recovery, well done for taking these important steps.", "This was a perfect response! NTA at all! I'm proud of you!", "NTA - sharing prescription medications is illegal in some regions. \nHood luck with the sobriety, you're doing great.", "NTA\n\nNever give your prescription drugs to anyone. This is the right course of action.", "NTA. I get why she would be concerned, especially since it's still a relatively new phase of your life, but she could have asked if you'd like you to go out for coffee or lunch and dispose of it. Basically make a date of it while making a really nice memory.\n\nI hope and pray that you keep getting better OP, and that you stay strong! You're not going through this alone. :)", "NTA. Your mom sounds extremely manipulative.\n\nI’m glad you were able to dispose of them safely and hope things only look up from here.", "NTA- Agree with the posts saying that trading prescription pills is not good for your sobriety, you are absolutely right to hold your boundary.  Your mother’s request was completely inappropriate. \n\nAlso some encouragement from someone who’s been there- 7 days is AMAZING! You are going to have lots of big feelings during this time, so congratulations on navigating a difficult situation. It will get much, much easier, and it’s definitely better on this side.", "NTA. It's really never ok to give someone else your own prescription and you did the right thing to dispose of it appropriately. End of story. I'm sorry for the conflict with your mom - she seems like she might be a pretty unhealthy influence in your life with respect to the relationship with substances and other things.", "Congrats on your recovery!", "She is saying exactly what a drug dealer or addict would say. Congratulations on your first Big test! There will be plenty but you got this!", "NTA\n\nSo your mother claims not to be an addict, makes you feel bad for being an addict in the past while acting like an addict herself??\n\nThe audacity.", "NTA she should go get her own prescription", "NTA. Good for you to stand your ground! What she said was beyond cruel and you DID NOT deserve it. I’m very proud of you, this is a big deal. Wishing you much positivity with your recovery 🤗", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNSFW due to mentions of drugs\n\nI am a recovering addict. I used to have xanax prescribed to me for panic attacks but it was discontinued. I kept an old bottle in the cupboard just in case (I know, I know.)\n\nOn Saturday my parents came over. I told them how I was doing in my recovery and that I was going to properly dispose of my old Xanax at the pharmacy or police department. \n\nFor the sake of brevity, she asked me for the drugs and I said No. My No was not respected. When I said no she said “well why, I’m not an addict!” She then proceeded to rub my nose in the fact that I stole drugs from her when I was in active addiction, and basically said I owed her. \n\nI was so upset, that I brought up a time she medicated me without a doctor’s consent or prescription when I was a child. She then gaslit me, saying I was making it up and that never happened. I kicked her out of my house. \n\nI’m so upset. I’m in very early recovery and trying my hardest to get well. We haven’t spoken since I kicked her out and my heart hurts. I just wanted my mom to be proud of me, but instead she tried to guilt me for my old medication. So Reddit, AITA?\n\n(I disposed of the medicine the next day at the police department). I’m 7 days sober from my drug of choice today.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Did you used to get high with your mom? Also how many years has she been prescribed them? \n\nGonna go with NTA but there may be a dynamic shift based off how you two have interacted before. Like if casual drug use was common place between you two. So old dogs don’t really learn new tricks.", "I had taken Valium and oxycodone from her in the past. Neither of which she has an ongoing prescription for- she kept the medications after dental/medical procedures. So she cannot get those refilled. \n\nI still feel horrible for my past actions and have actually asked her forgiveness before. I suppose she still has resentments about the whole situation which is fair.", "Thank you for your question. She told me she wanted them for herself, in case she needed them.", "We never used together. As far as I know, she doesn’t have issues with substance use. But that could be false. \nHer scripts are old and without refills. 10-15 years old, and she saved them in her dresser drawer. I stole from her maybe ~10 years ago", "Then she has no need for Xanax and it’s concerning for to even ask. Your mother should be supporting you in your recovery, not using it as an opportunity to grab free drugs. I wish you luck in your journey.", "Yeah NTA. And good job for dealing with the stress of early recovery and knowing to set boundaries as well and for throwing that stuff out the next day. Good luck!", "OH then NTA at all!! Nope, SHE displayed addict behavior and look at you at 7 days sober doing the right thing, I'm so proud of you! Keep walking your sober journey.", "Thank you, I appreciate it!", "NTA, and congrats on 7 days sober!", "I’m so proud of you for sticking to your guns and boundaries. Wishing you more strength and continued success in your recovery!!!!! NTA. Your mom sucks", "NTA.\n\nAnd, addictions don't come out of no where, they are born of pain. Your mother's behavior was a lot of 🚩 regarding the origins of that pain.", "At least from where I am from, sharing a prescription is just as illegal as selling them on the street. Good on you for disposing of them", "Well done on 7 days. You can do this.", "NTA. First off, congratulations. You have done something amazing. Disposing of the drugs yourself would be important to me as a step of healing. You're doing very well. Keep up the good work!", "NTA but your mom is for not supporting you. Good on you for getting rid of the pills and I wish you continued sobriety. 7 days is already a great start. Good luck!", "Nope.  She wanted you to do something illegal.  \n\nNTA.  You took responsibility, and disposed of the old meds legally.  \n\nYou did the right thing.  If she won't accept that, take a break from talking to her for a while, because you have enough to handle without her being toxic at you for being a responsible person.", "My friend, 7 days is a long time, and I'm so proud of you. When I was in early recovery, it was 7 days and 10,000 nights, so please just know that I'm beyond proud of you for this! \n\nSounds to me like your mom's an addict.\n\nNTA.", "NTA. Basic medicine safety protocol is to never give anyone your prescribed medications, regardless of reason.", "Honey- first off Congratulations on your sobriety AND on your good decision making in not giving that old prescription to your Mother or keeping temptation around you either! \nYou made great decisions and should be applauded for them - not berated! \nIt sounds like your Mom may have some addiction issues of her own- asking for medication not prescribed to her. \nThis stranger on the internet is proud of you for your strength!", "NTA , What if something bad happened as a result of the medication you gave her?", "NTA. You mom does not sound like she's ever been supportive of you. If she wants pills she can ger her own prescription,  using your past addiction to start her own is awful. Good on you for properly disposing the pills. Keep up the good work.", "Omg congratulations! What an accomplishment! \n\nNTA. Xanax are not candies to be passed around. It's your recovery prossess; kick anyone who might compromise your sobriety. You're brave !!!!", "NTA. Handing out drugs that are prescribed for you to another person is dangerous for the person who didn't get it prescribed.", "NTA, congrats on your seven days of sobriety. One day at a time. \n\nYour mom doesn't sound like she has your best interests at heart. You were right to establish boundaries. Be careful with her.", "NTA. And her asking for the drugs and getting funky when told no indicates there may be some substance abuse on her end.", "“I’m not an addict” says the woman trying to coerce her son into giving her drugs.\n\nNTA at all.", "NTA \n\nAnd what's more. You are amazing. You are strong. You can do this. It is 7 days now, but these 7 days will build and become 7 weeks soon, then 7 months, then 7 years and so on.\n\nDo not let the people who you love hurt you. Past is the past and now there is a whole future waiting for you.", "You’re not the AH. Your mom either has her own drug problem or she wanted to get them out of your house to keep you from taking any, maybe. Either way, not the AH and good on you for keeping boundaries.", "NTA - part of being in recovery is NOT being a drug dealer as well. Giving controlled substances to someone other than the name on the Rx is illegal. No additional discussion needed.", "NTA. I'm so very proud of you and the hard work you do.", "My police station used to have a place to dispose of medication and I do believe this month walgreens is helping take medication too.", "Congratulations on your sobriety! You're doing wonderfully, especially in setting boundaries with your mom. NTA and keep on truckin, my friend.", "NTA! Good job standing up to her and great job with your recovery so far! Doesn't sound like mom is good for your recovery. Good luck!", "NTA. Congratulations on your sobriety. I know how hard it can be, and how tempting these things can be.\n\nMy dad was an alcoholic, and during his recovery, he relapsed multiple times. I wish you strength, happiness and success!", "NTA. If she needs drugs she go get the prescription properly. \n\nAs for your sobreity fair play to you. Addiction is fucking hard to kick. So yes you are awesome.", "NTA, xanax is prescription only for a reason. It is highly addictive in a short time, it may counteract any medication prescribed by your mum's doctor. You did absolutely the right thing.\nWell done on your recovery, you should be proud of yourself.", "NTA at all. Also - SEVEN DAYS! GO YOU!! Incredible job.", "NTA, I think I might see where some of your addictive tendencies come from...", "NTA", "NTA. I'm not an addict is a classic excuse for addict.", "NTA. You know you did the right thing. I have 31 years straight and sober, but I started right where you are, feeling like I was heading out without a map. One of the most difficult things in early sobriety is when you have to cut those close to you out, often because your sobriety forces them to put a spotlight on themselves. They see things in themselves they don't want to see. This means they are the ones who have the most investment in you remaining as you were, and they will try everything to sabotage you. The irony is that they frequently don't even realize what they are doing. It's not logical, but it's common. Even 30+ years on I have to limit contact with some people - my sobriety threatens them.\n\nThe most important thing for you to do is establish a positive support system. Congratulations to you!", "First of all, congratulations on 7 days of sobriety! Second, NTA. One should NEVER share drugs you don't have a prescription for, and your mom should 100% know better. In fact, I'd go so far as to say your mom is also addicted to Xanax, but has just done a better job at hiding it. For the sake of your recovery, it might be smart to go LC with her for the time being. Good luck on your recovery OP!", "NTA. It is illegal to give someone else your prescription medication and I really sympathize with you because a “friend” tried to do this to me when I stopped taking my ADHD meds. Your Mom should treat you with more respect.", "NTA. If your mum needs them so badly, she can go to a doctor, get a prescription, and get her own damn medication. \n\nYour mother sounds like a piece of work. Guilt tripping and gaslighting is not okay, but it’s especially bad when you’re doing it to a freshly sober addict. She deserved to be kicked out - frankly, of your life, considering she once drugged you. \n\nWishing you all the best in your sobriety. I hope it’s the smoothest journey that it could possibly be, and that you get all the love and support you deserve.", "NTA. I swear, everyone becomes a greedy beggar when you're prescribed the good stuff. Your mom might not be good for you, my friend, she's exhibiting classic addict behavior herself.", "NTA and I’m proud of you and your sobriety.", "NTA. Congrats on your seven days sober. You can do this.", "no, i understand how you felt and i feel like even if you are but you post on here, it means you regret it.", "How is this even a question.", "NTA\n\nThis isn't some basic medication, it's a controlled substance. You could be arrested just for giving it to her. What if she keeps the bottle and they are found in her possession? That's a discussion you don't want to have.\n\nBut if you want to dispose of them, you can safely dispose of them in the trash mixed in with used cat litter or coffee grounds.", "Why wouldn’t you just let her have them? I would be annoyed aswell", "[removed]", "First things first: congratulations!!! Sobriety is *not* an easy decision to make or an easy path to stay on and I’m so proud of you for taking the necessary steps. (I don’t know if this will help, but give yourself time to heal and forgiveness if you falter. You’re allowed to take baby steps and consider every one of them an accomplishment, because it is. Take everything one day at a time.)\n\nThat being said: NTA\n\nYou are not responsible to provide for people even if you have the means, **especially** when it involves this kind of request. You made a decision and stuck your ground. The resulting situation was super shitty, but it wasn’t your fault. I’m so sorry that your mom put you in this particular situation regardless of past actions. \n\nAnd congratulations on getting the temptation out of your space!!! That is such a **HUGE** accomplishment, and I hope you allow yourself to bask in that for a moment!!! \n\nIf your mom isn’t going to be a supportive fixture in your life at the moment, please consider us to be your cheerleading team!", "NTA as you got rid of the substances in the proper fashion the very next day. MashaAllah on the sobriety OP wishing you the very best! Please feel free to reach out if you need anything!", "This. The fact that mom got hostile and accusatory when told \"no\" gives the lie to her \"I'm not an addict\" line. That's problematic drug-seeking behavior, no two ways about it.", "This.  NTA OP.  It's illegal to give your prescription to your mom\n\n\nCongrats on your recovery!!  I'm so proud of you!! I'm 10 years clean from heroin and pills and I know exactly how you're feeling.   I remember when my mom kept talking about \"when I relapse\" after I got clean.  It hurt because eventhough I knew I was done but she didn't.   You have to build trust back with people you hurt in active addiction and it takes time.  You'll get there, I promise.  \n\nYou are definitely NTA.  If your mom doesn't support you in your recovery or keeps her behavior up it might be good to keep your distance for a bit.  Diverting prescription drugs is a crime and part of recovery is abstaining from old behaviors that might put you back in that mindset.", "Yup, it makes you a supplier of a protected substance", "Exactly what I was thinking. Regardless of if she's an addict or not, why the hell did she think it was smart to verbally beat her (newly recovering) child down over *pills*?", "In all of the US it is illegal", "Because it’s illegal, for one. And two- it’s not healthy behavior to share drugs.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Was my first thought as well, that's addict behaviour.", "“a time she medicated me without a doctor’s consent or prescription when I was a child.”\n\nWhat is this about, it didn’t start your addiction, did it?", "NTA \n\nBut I wonder if she wanted to take the meds bc she (clumsily) thought that would be helping with your recovery? Can’t tell from your post that she wanted the pills for herself to use", "You think your mum is going to snitch on you? Lol idk I just think it’s a bit strange to not just give someone a few Xanax that’s just going to be thrown away. If she has a problem with them then fair enough but it doesn’t sound like she does", ">that's addict behaviour.\n\nOr anyone who has had to deal with doctors in the last few years and not been believed by them because of the 'results' of the opioid epidemic.", "> Your mother should be supporting you in your recovery, not using it as an opportunity to grab free drugs\n\nTHIS EXACTLY ⬆️", "These medications can be useful to keep around if you don't have \"a problem\" with them, where it can be not worth the hassle or expense of getting a prescription even if you can.\n\nIn the past I've had some Xanax passed to me by a friend, I used maybe 3 a year for a couple of years when the situation demanded it and gave away a few more.  I'll happily accept some again, but I'm not going to go to the Doctor to get some and that wouldn't be feasible in a \"Having real trouble sleeping tonight...\" scenario.\n\nXanax and valium are pretty similar, so it seems reasonable for OPs mum to ask that at least what OP stole was replaced.\n\nIf in the US, medical *anything* can be costly to deal with as I understand it.", "I can’t say for sure if it did or not. But she gave me one of her Valium prior to going to the dentist when I was a kid. As a child (and now, at 28 years old) I’ve always had horrible anxiety. So her solution was to give me one of her pills, which she now denies ever happened", "Sorry, I should have included it in the post. She told me she wanted them for herself in case she needs them for the dentist. I suggested she could ask the dentist to prescribe her something and she looked at me with disappointment in her eyes. \n\nThis whole situation is really confusing.", "You don’t know what op’s mom will do, who knows maybe in the future she’ll use that against op \n\nIt’s not strange that op doesn’t want to break the law", "Sorry, why does that mean she needs to berate, mock, insult, and overall just put her child down? Yes, it's extremely annoying (and worse) to not have  a doctor believe you but how does that make it okay for her to treat people like that?\n\nI've only had addicts get *that* way about anything.", "I’m not a doctor but the fact that you can’t be sure one way or the other, especially in the face of a gaslighting mother is kinda sus.", "That is weird since she can get her own prescription \n\nUnless she was pretending it was for her use but she just wanted to get the meds from you? And thought saying that would imply she didn’t believe in your recovery?\n\nHas she been supportive?\n\nI knows that might sound far fetched but this subreddit is so much about poor communication between people!\n\nAnd congrats on 7 days! One day at a time…", "Yeah who knows I suppose to me in the right circumstances it’s not a big deal. But different strokes for different folkes it’s not my family.", "She hasn’t been the most supportive. Continues to drink in front of me when I’ve let her know I’m struggling (of course she’s allowed to drink, I just had hoped she would not in front of me in order to be supportive) and also got upset that I cut up my medical marijuana card.", "It’s literally illegal though.", "Ah that sucks. Sorry to hear that.", "It’s illegal to drive over the speed limit people still do it. Is everyone here a puritan or something?", "Have you thought about saying something that doesn’t sound dumb?", "Have any of you thought about loosening up a bit? Jesus feel like I’m talking to the clergy lol", "The cops love it when people speed, the faster the better. They love so much that they’ll follow you with their rave lights on, it’s so cool."]}