{"id": 15810, "submission_id": "130ng9c", "title": "UPDATE: AITA for forcing my daughter to share a birthday celebration with her twin brother?", "selftext": "Original post here: [https://www.reddit.com/r/AmItheAsshole/comments/12tfszz/aita\\_for\\_forcing\\_my\\_daughter\\_to\\_share\\_a\\_birthday/](https://www.reddit.com/r/AmItheAsshole/comments/12tfszz/aita_for_forcing_my_daughter_to_share_a_birthday/)\n\nI’ve had several DMs asking how the situation turned out and if I apologized to Paige so I figured I’d just make an update.\n\nSo I talked with both Paige and Dylan over the weekend and told them that I wouldn’t make them share their birthday party.\n\nI told Paige I realized that forcing her to share a birthday party with Dylan was an unfair punishment, because I knew it was more important to treat her like an individual and not like one half of a matching set, and I apologized for forgetting that and told her I wouldn’t let it happen again. Paige asked if that meant that she could still have the birthday party that she and her friends had planned. I told her that I wasn’t sure because I still wasn’t happy with her for lying to me in the first place. Paige said that she was more way upset about having to tell her friends that her party was cancelled than about having to share a party with Dylan, and that she didn’t really get why I was apologizing for that instead. I asked Paige what she thought a more appropriate consequence for lying was instead of having her party cancelled, and she suggested getting grounded, so that’s what we’re going with. Lastly I told Paige that since I know she and Dylan are getting older now, I’ll just assume going forward that they want to have separate parties every year. Paige said that she only did this year because her friends decided they didn’t want any boys. I told her that was fine and I guessed we’d just talk about it again next year.\n\nAnd then I told Dylan that I was letting Paige have her all-girls party with her friends, and that I realized I shouldn’t have used sharing a birthday party with him as a punishment because that wasn’t fair to either one of them. Dylan said it was okay and that if he was having a solo party after all, he knew what he wanted to do for it. I also told Dylan that since he and Paige are getting older now, I’d start assuming that they want separate parties unless they tell me otherwise. Dylan said he guessed that made sense.\n\nSo that’s pretty much it, Dylan and Paige are each having their own party. And at some point they talked it out between themselves as far as Dylan’s feelings being hurt that Paige hadn’t talked to him about what she wanted to do this year, I wasn’t involved in the conversation but they’ve been friends again since it happened.", "created_utc": 1682604813, "permalink": "/r/AmItheAsshole/comments/130ng9c/update_aita_for_forcing_my_daughter_to_share_a/", "score": 2458, "replies": ["I am glad it worked out, BUT I think you need to think about WHY she lied?  Does she feel that you always favor Dylan?", "That's more like it!\n\nHowever: that grounding had better be a token brief one. Yes she lied, but in response to an unreasonable situation that *you* created.", "Nice to see a happy ending, glad this got resolved. And happy birthday to your kids!", "INFO: What's Dylan planning on doing for his party? Also you never mention a partner anywhere so if you supervise one party, who would supervise the other?\n\nI think you made the right choice, just a few worries about logistics", "Couldn't ask for a better resolution.", "I missed your original post, but I think you were judged too harshly by the responses.\n\nI am a twin and I am (or have been) friends with 7 or 8 sets of twins throughout the course of my life. Sharing a birthday party, as a minor, is par for the course.\n\nIt isn't an egregious affront to individuality. It just often makes the most sense logistically and it also pays homage to the fact that they were born together.\n\nThere is no hard and fast rule that says they have to share the same party, but lying and trying to manipulate your way into a separate party (without even discussing it with your twin) is a bullshit move.\n\nThere are multiple ways to address this situation, but it begins with open communication, not manipulative tactics, to get what you want.\n\n\nAs parents of a twin, it is important to support their individuality. It is also important to address unnecessarily manipulative behavior by any child.\n\nThrowing two separate parties is great, if you can pull it off both logistically and financially. \n\nIt is just as important to hammer home the message that honest communication is the best means with which to advocate for your needs and desires while balancing these against the needs and desires of the people you care about.\n\nIt is great that both children were ultimately happy with the solution. It just needs to be made clear that lying and manipulation aren't the best tools for getting what you want.", "Perfect in my opinion.", "I don’t really understand why Paige is being punished for lying. She lied because you force them to each be half of a matching set, and probably because she knew how you’d react. I’m still seeing this as a you issue. \n\nGlad they both get their own party now.", ">but in response to an unreasonable situation that *you* created.\n\nI still don't entirely agree with that, because Paige made it pretty clear that she never had a problem with the concept of a sharing a party and that wasn't the reason behind her lying. But that said, yes, she's only grounded for a week.", "A movie and then laser tag, he found a place that does a birthday package for X number of guests. I'm not too worried about the logistics, I think they're old enough that I probably don't need to supervise either party.", "Forcing 14 year old twins to share a birthday isn't cool. Neither is the concept that if one wants to share and the other doesn't, too bad so sad, you're sharing. \n\nI'd be more focused on the fact that she was afraid to be open than the fact that she lied. This isn't a pattern of behavior for her. Someone forced her hand here. She made a mistake, but let's not go crazy about it.", ">I missed your original post, but I think you were judged too harshly by the responses.\n\nThanks, I think so too. A lot of people really went off the rails and made the issue into something completely different.", "Really pleased all has worked out now.", "Good lord, people are being unreasonable here.  Yes, the shared birthday party was an incorrect punishment, but of course the lying needed punishing.  Am I going crazy here?  Do we need to make every single thing about gender?", "If she had talked to her brother and he had said he wants to share a party, would she still have been forced to have a joint party? It sounds like up til now, it hasn't been a 2 yes-1 no situation.", "I’ll be honest here, I don’t agree with the majority of the comments that are team Paige being all in the right here. She knowingly lied, knowingly hurt her brothers feelings…because her friends told her to. Then she doubles down and gripes about her party being cancelled as a potential punishment…because her friends will be upset with her. I’m not loving her friends. I also think she’s getting off super light here with being “grounded”, though it’s never expressed what that actually entails.", "I like a good success story. Way to make it right!", "Honestly you shouldn't ground her. \n\nYou created a really bad situation and yes she rebelled. When children sneak and lie it's usually due to fear, mistrust etc. You created an untrusting environment. Are you getting grounded for being an AH?\n\nMove on let her be.", "Here's a wild parenting philosophy: not every thing a kid does that's \"wrong\" needs a consequence/punishment. \n\nSometimes just talking about an issue calmly together can have a more meaningful impact. If another person has been hurt by a child's actions, making that up to them is a better approach.", "She shouldn't be punished. You need to take responsibility for creating that situation.", "It amazes me that parents these days are letting their kids have a democratic voice in their punishment at 14 years old as if a 14 y/o has any reasonable brain development to honestly tell their own parents how to raise them. I’m also astounded that the mother apologized to the child for her own oversight rather than the child apologizing for lying and planning expenditures that presumably the mother would be covering without asking her mother if those expenditures and plans were permissible. \nThis is just crazy. OP could have recognized and reconciled her own oversight without permitting the child to lie and dictate the terms of her own punishment. I wonder what society would be like if adults dictated their own punishments for their crimes. This practice simply doesn’t scale up to a mature worldview. And this child totally runs the house. \nBring on the downvotes from the army of Reddit teens.", "Tell Paige she’s not important. You already showed her that", "You're still TA here. \n\nPaige wanted to have her own party and be treated like her own person. By you assuming that Paige and Dylan would both want to have a joint party and would have to decide between themselves and then tell you otherwise, you were treating them as a unit and not as individuals. This put Paige in a position where, to get what she wants (independent party) she has to risk hurting her brother's feelings and disrupting his plans. So she opted to tell a lie about a decision, that should have been hers to make anyway, because it was easier than telling the truth. Why do you think that is?\n\nOpting straight to punishing her by taking away her autonomy was a bad move. It's good that you backpedaled on that, but you still haven't looked into why she felt the need to lie in the first place. In your comments, you mention you don't think it was deeply motivated; I don't think you're looking deep enough yourself. \n\nAlso, canceling a birthday party or grounding Paige is a disproportioned response to a white lie. Considering Paige and Dylan have worked this out themselves with 0 input from you (you don't even know how they worked it out!), the only reason for the punishment is lying about to get out of a situation that you put her in. You should take time to understand why she felt like she had to lie, rather than talk to you about it; punishing her without understanding that is only going to make her less likely to open up to you in the future.", "Honestly, if there's any message to be taken from this, it's that you need to get better at communicating with your children. \n\nIt sounds like if you'd just spoke to them both and seen both sides things would've gone a lot smoother. Paige just wanted more freedom but didn't feel like she could properly ask for it. Dylan didn't actually care about not getting the joint party he just wanted to at least be consulted first. It seems like this whole family just needs to learn how to communicate properly.\n\nHonestly, the actual \"punishment\" you should have gotten here is just sitting both twins down, have Paige apologise to Dylan and then smooth things out between them. Then just a slap on the wrist for Paige for lying. Maybe ask her to help out in preparing Dylan's party as a token gesture.", "\\> I’ll just assume going forward that they want to have separate parties every year. Paige said that she only did this year because her friends decided they didn’t want any boys. I told her that was fine and I guessed we’d just talk about it again next year.\n\n\\> I also told Dylan that since he and Paige are getting older now, I’d start assuming that they want separate parties unless they tell me otherwise.\n\nYou keep leading with your own assumptions instead of simply asking and letting the kids tell you what they want to do. I'm not sure you've fully grasped the lesson this situation is offering.", "Unless she always lie, I feel like a verbal warning would have been better, after all, she just didn't ask her brother what to do and lied about it. To me, it feels way too strict and feel like you want to force a punishment because you already did a bad punishment with the joint party.", "pretty great resolution.\n\nI'm glad you talked to them.  And it's funny that she felt you apologized for the \"wrong\" thing.", "I think this is one of the most controversial Reddit posts I’ve seen so far this year, holy chalupa", "What does Dylan want to do for his party?", "Good job. Paige needed to know that lying isn't okay, especially when all she had to do was communicate with you or her brother. Glad it all worked out.", "No, the \"why\" behind Paige lying really wasn't that deeply motivated. She wasn't afraid that Dylan would be favored over her or that she wouldn't get what she wanted unless she lied, she just skipped talking to him about birthday plans for normal teenager reasons but then lied about it because she felt bad afterwards.", "Hell with that, Paige did nothing wrong in my view", " Why are you ignoring how her lies and manipulation made him feel? Why are you only throwing yourself into the perspective of the daughter?", "I really don’t see being forced into a matching set in this story, and I speak as a twin. Most years they’ve chosen to share a party, that’s not unusual. Then Paige lied that she’d already talked to her brother about it, which understandably hurt him. It sounded I’m the original post that if she’d either talked to him beforehand or told OP the truth, that she hadn’t spoken to him yet, OP would have been just fine with that.", "I wonder what society would be like if adults dictated their own punishments for their crimes. This practice simply doesn’t scale up to a mature worldview.", ">She lied because you force them to each be half of a matching set\n\nOutside of this incident, which I do agree was a big misstep on my part, I've never done this.", ">And happy birthday to your kids!\n\nThanks!", "It feels a lot like they had similar experiences in childhood and still hadn't gotten over them and/or never acknowledged fault. If the mom hadn't talked to the son, there's a good chance he'd have been left out to dry when the day itself came and he realized his sister wasn't there. These repliers have zero consideration for the brother or if he got hurt by his sister's lie. Her feelings should not only trump the brother's, but she did nothing wrong by deceiving him. It's narcissistic, but what teenager isn't? I'd have hoped those (presumably adult) repliers ITT would have grown out of it, though.", "These replies are wild. And it really concerns me how many people think that lying should be encouraged.", ">Do we need to make every single thing about gender?\n\nI don't fully understand how that became the main focus either.", "I think I skipped the lying part what did she lie about?", "I feel like I’m going crazy too. Everyone is fixating on how the lying shouldn’t be punished because OP created an expectation- but OP literally SAYS that the kids have chosen every year whether they want a joint party or not. How is there an expectation?", ">If she had talked to her brother and he had said he wants to share a party, would she still have been forced to have a joint party?\n\nNo, if this had happened then there wouldn't have been a joint party. In the past Paige and Dylan always happened to agree and both wanted the joint party, but if only one of them had then I wouldn't have made the other one go along with it.", "So giving her her own separate party like she wanted, is showing her she’s not important?", "Did you read where Paige said \"her friends decided they wanted a girls party\" and she was only upset because she would be upsetting her friends by not having the party they wanted...\n\nPaige wasn't trying to exert her individuality.  She even said she didn't care if it was joint with her brother, she only cares that her friends would be disappointed.  OP isn't the asshole for grounding her child for lying.  Lying where the result cause someone to be emotionally hurt.  OP took the overly harsh criticism and reaching and talked to her children and everyone walked away happy.  Paige even said an appropriate punishment was being grounded!  She could have said more chores.  She could have said something confiscated.  Plus you don't even know the perameters of grounding.  It could have been lightly over a weekend.  Your making it sound like a grounding lasts weeks and is a terrible punishment to inflict on any child.", "A movie and laser tag, he found a place that offers a pizza party deal alongside the laser tag.", "> She wasn't afraid that Dylan would be favored over her\n\nIs she?  Since she mentioned she wanted all-girl party, I say.... she may be annoyed when girls talk about Dylan all times. You know girls talk about boys.  \n\nTeenagers.", "Kinda easy to say it’s not deeply motivated when you don’t want to look further in to it", "Why are you grounding her? There's no reason to, you're punishing Paige for you not being on the ball as a mother.\n\nIn what world does two 14yr olds want to share a birthday anyways? I find it incredibly hard to believe this came out of left field, a 14yo girl doesn't want her brother there when she's with her friends.", "IF Paige  does not  habiitually lie, I think you need to look at this further.", "[deleted]", "She shouldn't be punished for lying. It's not like she planned to do anything illegal. She just didn't say anything about her own birthday. I think you're just looking for a reason to show her you're always right, and punishing her is your way to maintain control over her. It's not healthy.", "Sound sto me like shebdoesnt trust you, and doesn't feel comfortable talking openly with you. \n\nBecause you flyboff the handle bars and punish her unjustly. \n\nShe lied about her own birthday. Its not that big of a deal, but uou want to make it a big deal so that you have reason to make her share her birthday and punish her. \n\nSounds like you dont really care and are just looking for a reason to punish her. \n\nLying isn't that big of a deal, especially when it's used to spare someone's feelings. \n\nThis isn't worth grounding or punishing her over. \n\nIt also sounds like you do favor your son over her. \n\nSounds like yourbjust trying to exert control and show her who the boss is. That no matter what, she'll always be the kid and your to always be listened to. \n\nYou keep going and she'll have little to do with you after 18.", "YTA still for these comments", "I agree.   I only said \"that's better\" bcs now she gets her party. The grounding is BS.", "I mean plan the party you want to have but doing so to specifically exclude someone and then intentionally lying about it because you didn’t want to hurt their feelings *is* kinda a shit thing to do. That being said 14 year olds lie all the time and hurt each others feelings so it’s not surprising", "Why is how he felt relevant in this case?  His feelings aren't her responsibility.\n\nShit, I'd even hesitate to call her saying 'we don't want a combined party' vs 'I don't want a combined party' as a 'lie' given that Mom proved that Paige would be punished for daring to be an individual.", "Bcs OP is supposed to be an adult and the kid is a kid who was having her *birthday party* sabotaged. OP's feelings are not relevant here. OP needs to suck it up. And apparently is doing just that", "Because Paige has worked it out with Dylan, so she shouldn't be 'punished' for something she's already made amends for.", "I guess the silver lining of forcing a grounding for a situation you caused is that she’ll be a lot better with her lying next time.", "I mean, thats great and all, but still YTA for not accepting that its YOUR parenting style that is giving her reason to lie.", "You still don’t get it. You seem incapable of getting it. I feel so bad for your children to have such an unreflective and myopic parent.", "> she's only grounded for a week\n\nIMHO still excessive but I guess it's a good compromise. I can't say I'd have handled it as well as you did in the end!", "So she’s being punished why?", "...if you're planning to allow two groups of young teenagers completely unsupervised birthday parties, please make sure the other guests' parents know.\n\nYes, the chance for actual shenanigans is low, but I'd be pissed if I found out after the fact that my kid(s) were just dropped off without an adult at least hanging around nearby.", "I mean, different kids mature differently, but I feel like 14 is kind of young to have an adult-free birthday party. It's less about worry that the kids and their friends won't be safe, and more that they might be entitled little hooligans.", "I don't have teenagers, but this seems weird?  You're going to leave these kids on their own?  I think 14 year olds deserve a fair amount of autonomy, but I'm not sure that I'd trust them in a big group that I was essentially responsible for creating.  I'd stick close, but not be all up in their business.", "You are like a bad manager at a workplace. Create a dumb expectation, people jerk around it, it causes issues, so you punish. Then wonder why people lie and don't show you respect.", "theyre talking ab the daughter lying to her mom ab talking to her brother ab a separate birthday party", "Well that's good to hear. \n\nI can still see why she felt the need to lie tho. It's weird to me that they needed to run their potential bday plans by the other before they can make any plans for their own bday. Planning a kids bday is between the kid and the adult(s), not between the kids and THEN the adults. When kids feel they are backed into a corner, they don't have many options(or the mental capabilities to think of many) to come up with logical reactions so they'll typically lie or lash out. Paige went with lying instead of lashing out. Not that it matters now tho since the dynamic has obviously changed lol. I just hope her punishment is a token grounding and not a full fledged, several week punishment. She's young and clearly didn't know how to navigate an adult-level issue, where she was obviously uncomfortable, that's not really her fault.", "You're twin-splaining", "What are you talking about? This isn't what happened. Her daughter was lying and purposefully manipulative.\n\nWhen her daughter approached her and explained that she and her brother had discussed their upcoming birthday and that they wanted separate parties, she happily obliged.\n\nThis is proof that her mother was open to the idea.\n\nIn reality, OP's daughter and friends decided that they wanted a girls only party (which is fine), but then she chose to lie and manipulate her way into getting what she wanted (which isn't fine).\n\nThe whole issue could have been avoided if she just chose to be honest and to discuss it with her twin and her parents.\n\nThe brother wasn't against a separate party because, in the end, he was happy with having his own celebration. He was just hurt by his sister lying and not discussing it with him.\n\nLying and manipulation are wrong and they were entirely unnecessary in this situation. \n\nWhy are you twisting yourself into knots to excuse it?", "Well of course you do, because everyone was calling you a AH.", "Sure everyone is wrong and you and this person are right 🥱", "[deleted]", "Sounds awesome! I think both parties will be great", "Teenagers lie for bad reasons or no reason sometimes. They're still figuring out how to lie, so they fuck up. Its not always doom and gloom.", "Kind easy to say that when you're not involved outside of reddit", "you know, sometimes people just lie.  it’s not always some big conspiracy, it’s just a lie.", "In what world do you not face a punishment for lying to your parent?", "She's grounded for attempting to manipulate her family through deceit instead of being honest and communicating what she wanted. Its something good parents try and teach their children is bad.", "Exactly. OP created this whole situation.", ">So she was right, you proved her right \n\n?", "I do understand what you're all saying, I just don't agree with your assessment of the dynamic.", "Only for lying.", "I definitely will, no worries.", "I think its a different culture kinda of thing, but at 14 i was already doing everything at my own, school, going out, etc, and movies and laser tag woud be only a sunday with friends, not something that an adult would need any intervention or interaction.\n\nEven more about the stay at home party........\n\nSo at least to me, its not that big of a deal having the parties the way OP its organizing.", "That's entirely fair, of the kids that I know are likely to be invited I'm not particularly worried about any of them not behaving themselves, but if I feel differently when I see the actual guest list I'll reconsider.", "I think it depends on the activity that they're doing, but the movie and laser tag are both in the same mall and I feel like at 15 they can probably navigate hanging out there for a few hours on their own.\n\nAnd then Paige and her friends aren't planning to go out and I don't anticipate them setting the house on fire, so I don't think they really need me to watch them too closely.", "Calm the heck down, bro. \nI see it differently than you. Two people can have differing opinions. \nI don't know why she had to get brother's permission.", "That's not what I'm talking about, I agreed I was the asshole for forcing the joint party. I meant everyone saying that I was being sexist and that I habitually favor Dylan.", "I don't think the daughter was wrong for wanting a separate party. That is its own issue.\n\nI just think it was wrong to lie and manipulate in order to get what you want.\n\nUltimately, OP was open to the idea of the separate parties. She was upset that her daughter was lying to make it happen.\n\nForcing her daughter to have a shared birthday wasn't the best response (and OP did come to that conclusion eventually) but the manipulation and lying still needs to be addressed as a related but separate issue.", "ah reddit! She already accepted she was wrong and you think you know her whole life based on one post. this is crazy", "Isn’t that what she supposed to do after being called the asshole? Isn’t that how every asshole story supposed to go? So she’s an asshole for corrected her asshole mistake? Weird.", "I don’t totally disagree with you but as op is still punishing her daughter for the lie I think it’s a fair point", "Most teenagers lie whiteout realizing it. They assume an answer and when they’re wrong they don’t understand how it was lying", "Fair, but her still punishing Paige for this makes me question it 🤷‍♀️", "> In what world do you not face a punishment for lying to your parent?\n\nIn a world where the parent fucked up so badly that a lie was required to restore order to the universe. Such as here.", "OP created this situation by ASSUMING her two teenaged children would want to share a bday. \n\nMaybe if OP was able to have open and honest conversations w her kids this wouldn't've happened, but clearly the kids feel they can't trust her not to push her own wants onto them. Must be cheaper to force your kids to have one bday vs two", "Paige did that because her parent expected her to get her brother's permission to have a separate party, which is unreasonable and unfair.  She knew if Dylan said he wanted to have a joint party, that is what would have happened.", "[removed]", "Oops I read that as was afraid instead of wasn't.  My mistake, thank you", "From a Mama, I just want to say that you are entirely right to not agree with the majority of the commenters here. It was actually mindboggling for me to read most of them...", "We are saying that because your comments do not reflect and understanding of why people are saying that you were wrong. \n\nNo one here can force you to look at this differently, but when your statements reinforce the negative things we all think about you, it becomes increasingly difficult to give you the benefit of the doubt. \n\nIt all comes off as a defensive justification.", "To be fair grounding has alot of complex specifics that can determine whether or not you're being too harsh. A few days away from friends outside of school and electronics doesn't sound too bad if the home relationships aren't too toxic.", "Because you planned on treating her unfairly?", "If anything I'd have them check in periodically to make sure everyone is fine. I won't tell you how to supervise your children that I don't know. I doubt they'll go an commit felonies from the way you write about them", "Calm down?\n\nYou are the one getting heated here.\n\nYou obviously aren't a twin, so you simply don't understand the dynamic.  \n\nThey share a birthday and they have always shared a party. Discussing her desire for separate parties, with her brother, isn't seeking permission. It is what open and honest communication looks like.\n\nLying and manipulation isn't a healthy way to advocate for what you want. \n\nWhy didn't you address the points I made in the previous post?\n\nThe mother was open to separate parties. The twin brother was, as well.\n\nThe problems arose because OP's daughter chose to lie and manipulate her way into getting what she wanted. This hurt her twin brother. \n\nWhy are you ignoring how her lies and manipulation made him feel? Why are you only throwing yourself into the perspective of the daughter?\n\nGaining independence and a sense of individuality as twin is very important, but it is also tricky ground. Striving to be seen as an individual is natural but if it is handled poorly (like lying and being manipulative) then it is all but guaranteed to unnecessarily hurt their twin in the process.\n\nI know this because I have been there.", ">I meant everyone saying that I was being sexist and that I habitually favor Dylan.\n\nAn awful lot of people came to the same conclusion. I would ask you to look within yourself to check there is absolutely no shred of it. Because it sure looked that way.", "Op refuses to do so as she stated in another comment lmao", "People are weird. Still trying to find a reason to call her an asshole and actually resolving this in a really good way.", "Good point. Deleted.", "This is a first occurrence. Patterns should be investigated, but I think making mistakes should be addressed and moved on from. Making a mountain out of a molehill will often do more harm than good with children.", "Adults too, tbh.", "Why are you questioning her for punishing her child for lying for no reason? That’s a relatively normal thing to get grounded for. Lying and it being found out was the most common reason that my younger sister got grounded when we were middle and high schoolers, and it was usually for lying over stupid shit like having talked to someone and gotten their agreement about something. (Biggest example: telling one parent that the other parent had said yes to her going out with friends, when she had never asked and it wasn’t the “asked” parent’s custody time)", "I also don't agree with the punishment tbh", "Apparently the parent think she’s never in the wrong, and doesn’t need to second guess themselves", "How did the fuck up? By asking them what they wanted to do for their birthday?", "Go back and read the original post, she asks the kids to let her know what they want to do for their birthday. The daughter lies and says they both talked and wanted separate birthdays. \n\nOP was totally fine with separate parties, she wasn’t fine learning that her children hadn’t discussed it and Paige had lied saying they had. \n\nIt’s sounds like if Paige had actually talked to her brother, he would have been fine with separate birthdays. Had she done that, none of this would have happened.", "What? OP didn't force anything, she asked a very normal question to ask people who share a birthday and got lied to. She tried to have an open conversation and got lied to. She gave them the *option* of sharing a party as they'd eagerly chosen to do so in the past.", ">OP created this situation by ASSUMING her two teenaged children would want to share a bday.\n\nThe OP never made this assumption. What she did do was ask her daughter what sort of Bday she wanted and the daughter chose to lie and say that she had talked to Dylan about it.\n\nSimple solution that doesn't require lying:\n\n\"I haven't spoken to Dylan, but I would really like to have a solo party this year\"\n\nInstead the daughter said:\n\n\"I've spoken with Dylan and we both want separate parties this year\"", ">her parent expected her to get her brother's permission to have a separate party\n\nThey never said that, they just wanted her to check in with her brother because they normally share birthdays\n\n>She knew if Dylan said he wanted to have a joint party, that is what would have happened.\n\nOh I didn't realize that you're like their cousin or uncle or something and that you know them personally. Cuz that is the only way you can say that because there is zero proof that is the situation. When you come here you're supposed to talk about what's actually in the post not the stuff that you're making up in your mind cuz that's how you think it's going to go based off your own personal history with your family.", "You seem very sure.", ">touch some grass\n\nOh boy. Take a breath, friend.", "From a person with reading comprehension, I agree with this statement. Good lord with these comments.", "No?", "[removed]", "Couldn't ask for a better resolution.", "She’s like ‘well I changed the punishment from forcing them to share a party to grounding her so I’m clearly a different person from a week ago’", "> eagerly chosen to in the past \n\nWe must be reading different posts bc OP said herself they'd had separate parties in the past\n\nGood parents typically want to find out the root cause of a problem, not just blindly punish their kids without caring as to what made them behave differently. OP is acting like she exhausted all possible reasons why her daughter felt she had to lie by asking kiddo ONCE", "I think the guy didn’t get his own party or something😭😭", "Seems you haven’t learned much from this. \n\nI get the vibe she’s being punished because you don’t want to be the only one who was wrong in this situation. \n\nGood luck, OP.", "What would have happened if she had never lied?  What if Dylan wanted a joint party and Paige wanted a separate party, what would have happened?", "Her kid lied in a way that hurt her brother; that deserves punishment. OP *consulted* with the kid and they came to a punishment *the kid agreed* was fair.\n\nI dont get why you're railing on a good mom who made a mistake, asks for advice, and then *takes* that advise to amend the situation? like, what the everloving fuck do you want from her?\n\nFFS reddit is brutal sometimes.", "If you had read the original post, you would see where it said they had separate birthdays like twice prior. Before that they typically shared their birthdays. It's not that you guys are reading different posts, it's just that you're not actually paying attention to what you're reading, and making stuff up. The Root cause of the problem is that she lied to her parents about talking with her brother about them having separate birthdays. When they asked the son, the son said that never happened. When they confronted the daughter she confirmed that she lied. When asked why she lied, the reason is because she wanted to have a birthday party on her own without any boys and just her girlfriends. In essence you can say she lied because she wasn't mature enough to just tell her parents she wanted to have a birthday on her own and did not communicate that to her brother.", "Nope, same post. OP said they've chosen both.\n\nThis isn't \"Am I The Good Parent\", and obvi OP isn't one or she wouldn't be posting here. Based on what we know there *isn't* anything else OP can do yet without pushing her daughter away. Having her around could even give OP the opportunity to work on their relationship and talk to her daughter to try to find out what's going on. But I guess that would require, I dunno, not being some online rando who thinks that a child lying to get what they want is not the child's decision.", "Nope. In the original post they have chosen to do both separate parties and shared in the past. The norm is the siblings discuss it, OP asks what they decided to do, and they do that. OP asked her daughter what the plan was, and her daughter lied as a first option. The root problem was that her friends decided they didn’t want boys at the party, so OP’s daughter chose to lie and say they agreed to do a separate party. OP even [stated](https://www.reddit.com/r/AmItheAsshole/comments/130ng9c/update_aita_for_forcing_my_daughter_to_share_a/jhy23at/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) that if Paige had just said that she didn’t want a shared party even though her brother did groom the beginning, they would’ve gotten separate parties.", ">I get the vibe she’s being punished because you don’t want to be the only one who was wrong in this situation.\n\nInteresting that you're getting that vibe. That doesn't even make sense to me.", "Then they would've had separate birthday parties.", "Because most people here are also assholes. That's why people like to come in and talk smack about other people being assholes.", "They really are. They got issues.", "> OP herself said they'd had separate parties in the past\n\nI litchrally said they'd had separate parties before?", "Because you didn’t address the fact you obviously favor your son over your daughter 🤷🏻‍♀️", "She lied to remedy something you did that you admit was wrong. She did not trust you to be fair (and rightly so) and lying is a rational response when you don't trust someone.", "Right, it dose not make sense to you because you are grossly obtuse. Either deliberately obtuse or lacking the mental faculties to recognize when you are avoiding looking your mistakes in the eye. \n\nBut no one here can make you a better person, so honestly you should probably just stop engaging as you are not listening and this defensiveness seems like an exhausting exercise.", "That's just inaccurate, I don't favor Dylan over Paige.", ">She lied to remedy something you did that you admit was wrong. \n\nI think you have the order of events confused, actually.", "Good job OP!", ">Paige said that she was more way upset about having to tell her friends that her party was cancelled than about having to share a party with Dylan, and that she didn’t really get why I was apologizing for that instead.\n\nI'd tell her that you apologized for the shared party because that was your mistake. Her having to tell her friends her party was cancelled was the result of her lying to you (and them in a way). If she lies about something and it doesn't turn out the way she wanted because of what the truth is, then that's her fault. I'd say the embarrassment may be punishment enough, though, along with her apologizing to Dylan about lying and promising to not do the same again.", "Great communication :)", "Glad to hear this update OP. I am glad you were able to work this out with the kids.", "Its incredible how many have the nerve to judge your parenting based on one incident. However, I’m so happy to see a parent that admits when they’re wrong and apologises for it and makes it right! You clearly have an open mind to see other perspectives, which is quite rare with many parents unfortunately…\nAnd I think asking Paige what a “fair” punishment would be was very smart. I think it teaches her that lying is wrong, and that there are consequences but fair ones! And at the same time she’s not going to hate you for it since it was her idea of what she believed she deserved as punishment. It’s actually a very good tactic used in many negotiations.", "I think a lot of people are projecting at you here...\n\nI think the resolution is fine, especially as you've changed the expectations for the parties going forward to learn from your mistake (reactive overpunishment).\n\nYou've got young teenagers so this won't be the last of these situations you'll have to navigate haha. Happy Birthday to them!", "I'm over here still stuck on the fact that you let the 14-year-old decide her punishment. 😳", "TIL that it’s wrong to punish a child for lying if the lie is intended to avoid a hypothetical reality that they don’t want. This is somehow different than lying to get what you want. Lying because you felt guilty about something careless or unkind you did is also cool.", "I'd really like for you to reflect on how you had a conversation with Paige wherein you both admitted fault and yet only one of you was punished. Part of treating Paige with respect is knowing when to call things quits, in this case you both hurt her and she had to suffer the humiliation of telling her friends that her party was cancelled for a really flimsy reason- now you expect her to punish herself too?\n\nThis doesn't read like you learned your lesson, yes you said the right things, but it's clear you don't want to be the only bad guy in this situation so you had to remind Paige that she lied. It's her birthday, learn to let things go. It isnt a productive conversation if she still comes out of this the ultimate loser.\n\nReading this makes me upset for her, I am hoping she has a great birthday just about her. Maybe you'll get it right next year.", "I’m sorry OP but I still see you as ah. \nYou created the problem expecting they will decide between them. But if one say yes and the other day no, what’s the final decision?\nAnd did she go to you and told you “Dylan and I decided” or I want a party separately and you asked if she spoke you Dylan before? \nThe lie is your creation and now you punish her for it. \n\nAlso, I know she hurt his feelings, but you butting in and trying to mediate is not the answer. Most of the time kids will resolve the problem without parents being involved.", "rule 10", "Still think you're TA for punishing Paige at all for this. You created the situation where she felt she had to lie. Why are you such a party dictator?", "you a degrassi fan, fresh-tower?", "My oldest three children were all born in February three years apart. We started with the first two sharing a party but the didn’t last too long so we went with separate parties. Their birthdays were two weeks apart so it worked out. \n\nNumber three was born the day after number two. I think we had one joint party for two and three for about two years, but then went to separate parties. By about eleven, my oldest just wanted sleepovers. My son opted out of parties around ten.", "great they're getting their own bdays now but I dont see the point in grounding her", "NTA. Good update OP", "Honestly, parenting twins seems quite complicated. Im happy they are both having their party and it is good to assume there will be separate parties in the future. I think you ended up handling it really well!", "She's a 14 year old. Is it really that surprising that a teenage girl would dramatically feel like she's overcome with mortification if her birthday party got canceled? There's a good chance she and all her friends will grow up to be fantastic people, but right now they're hormonal and perpetually feel like their life will be over due to the smallest things. I don't think they're doing anything that's out of the bounds of a regular teenage girl thing, and I think she learned a good lesson from this. Part of this age is making mistakes and learning from them. The important thing is that OP steps in if this behavior repeats, and that OP is there as someone she can talk to if issues with her friends escalate. Part of parenting teenagers is balancing teaching them important lessons and being accessable that they trust you with issues in their life. \n\nYou seem more bothered about this grounding than either OP or her son, who was the one who was actually affected. The twins made up. What purpose does canceling her party serve, other than making her feel like her mom doesn't understand her at all?", "Or just because they are kids? I remember a number of lies I did just because it was easier than admitting to something. My mother never even punished us really, we were never grounded, but there were time I just didn't want to hear a 'lecture' so decided to not admit to something.", "How did OP create that situation at all? They clearly allowed them to choose beforehand, and they always complied with a lot of stuff the kids wanted to do. They didn't create that situation, it happened without their control.", "I am so confused by your comment because I don’t understand why people are saying she needed to lie when OP stated they would have separate birthdays in the past? Also how was it a white lie because that means it was harmless even though the brother could have gotten hurt? What if OP never talked to the son and he didn’t know they were having separate parties? Now not only is his feelings hurt but he also doesn’t get a birthday party.", "Paige literally lied and manipulated to get what she wanted? How should that not be punishable. In fact, she *chose* to get grounded instead of getting her party cancelled.", "Whatever it takes, I know I can make it through", "Fair enough, and that's what I figured happened. I'm glad that you spoke with your kids and worked out a solution. \n\nThey're at the age where whitelies are commonplace. Double checking with both of them if they said they spoke isn't a bad plan. Also making it clear you're doing that helps build clear communication!", "“Normal teenager reasons” “wasn’t deeply motivated” \n\nGrounded. You’re STILL acting disproportionately and letting her ‘choose the punishment’ as you literally couldn’t think of one shows you’re just pushing the power play. Feel sorry for your daughter", "That kinda feels like something to look into. What made her think Dylan would be favored? Originally, he was actually being favored. Maybe you should look into how you're treating them to make her (accurately it seems) feel this way.", "So you're ok with lying to your parents?  No, that's wrong.", "Exactly.  I get that gender is one hot button issue and “matched pair” twins is a lesser but still present hot button issue, but neither is at play here that I can see.  The kids are making the decisions on that.", "Just saw someone do the good old \"hIs FeeLings AreN'T her reEpoNSiBility\". 🙄 They are if they're an innocent party and you did something that could predictably hurt another's feelings. And you could easily predict that some might find not being given the courteousy of being informed of a decision involving them was made and having to hear it through a third-party as hurtful.", "She said she had already informed her brother when she hadn't.", "I’m not “bothered” by the grounding specifically, more so that I don’t think the punishment in this case fit the crime. What teenager is going to choose an appropriate punishment themselves? They’re going to choose what they’re the most comfortable with, which isn’t necessarily the point of it at all. \n\nI get that there are different family dynamics out there but I just think this was too lenient and I think OP is getting manipulated by her teen—which isn’t going to get better as more hormones continue to roll in.", ">Did you read where Paige said \"her friends decided they wanted a girls party\n\nWhat I read was: \"Paige asked if that meant that she could still have the birthday party that ***she*** and her friends had planned.\" Emphasis mine.   \n\n\n>Paige even said an appropriate punishment was being grounded! \n\nOP \"asked Paige what she thought a more appropriate consequence for lying was instead of having her party cancelled, and she suggested getting grounded.\" In that instance, I doubt Paige actually meant that getting punished was appropriate but was opting to take a different punishment to still be able to have her party. \n\n&#x200B;\n\n>Plus you don't even know the perameters of grounding. It could have been lightly over a weekend\n\nAside from a \"Token grounding,\" I just don't think punishment is really warranted here. I think if OP sat down with her daughter and tried to figure out why Paige felt the need to lie, they could come to better understand each other and open the door for Paige to talk to OP rather than trying to lie in the future. Especially considering that OP placing the expectation on Paige and Dylan to have a joint party unless otherwise specified and that they had to discuss between themselves whether or not they did the party together, it created the scenario where Paige felt she needed to lie or she'd end up hurting her brother's feelings. It should have been the other way around. OP should treat them as separate people in all instances, unless the twins get together and tell her otherwise.", ">OP stated they would have separate birthdays in the past\n\nTrue, but OP also assumes they will have them together and places the expectation on Paige & Dylan to decide between themselves if they have separate parties then to tell her. This means that Paige has to tell Dylan she doesn't want to have a party with him and is afraid of hurting his feelings. This is why I feel OP placed Paige in a position where she either had to hurt her brother's feelings or lie about it. \n\n&#x200B;\n\n>Also how was it a white lie because that means it was harmless even though the brother could have gotten hurt\n\nI consider this a white lie, because A) while her brother did get emotionally hurt, Paige has made amends and they are okay with it and B) the decision to have separate parties should have been Paige's alone. She shouldn't have had to include her brother in the decision making, so I don't think it should have mattered if he had agreed to it. Granted, it's still a lie but it's on the lowest rung of them.\n\n&#x200B;\n\n>What if OP never talked to the son and he didn’t know they were having separate parties? Now not only is his feelings hurt but he also doesn’t get a birthday party.\n\nI doubt that would have happened. At one point in time OP would have needed to confirm plans with Dylan. It might have been a lot later and more messed up, but I'm sure he would have still gotten his party.", "/Lied and manipulated/ she's 14, not some master criminal. What she wanted was a birthday for herself, something most kids don't need to ask for. She chose to get grounded because her mom wanted her punished despite both having faults in this.", "I truly don't think its as deep as you're making it. She thought it was easier to just lie, teenagers do that lol", "She lied and said this was the right punishment.", "Wow you need therapy", ">She lied about her own birthday. Its not that big of a deal  \n>  \n>...  \n>  \n>Lying isn't that big of a deal, especially when it's used to spare someone's feelings.\n\nDo you frequently lie to people?\n\nAlso, considering her brother *did* feel hurt it wasn't like she actually \"spared his feelings\".", ">letting her ‘choose the punishment’ as you literally couldn’t think of one shows you’re just pushing the power play.\n\nI honestly don't understand your logic here. I asked Paige for her input on the punishment because I knew that I had gone overboard the first time and I didn't want to make the same mistake twice. I don't understand why you're calling it a power play.", "There isn't anything to that in reality, people just got fixated on the impression that Dylan was being favored and/or Paige feeling that way was the motivation behind her lying.", "Plan the party with your friends to do “girly stuff”, know that your friends will not feel comfortable with your twin brother. And “planning” was probably more like spontaneous discussion. And then realising it’s done, but now you need to tell your brother you don’t want him there. \nTeenagers also panic. She lied because it was easy at the moment. Kinda shitty, but 14 is not mental capacity to see long term effects. She didn’t think it would be a problem. Should she? Maybe now she will as she learnt something.", "> Why is how he felt relevant in this case?\n\nIt is relevant because her lies caused the hurt feelings? This could all have been avoided if she had talked to him instead of lying, it's really not that hard to understand my dude.", "It must be nice to not have kids", "Actions have punishments, it doesn't matter if you say sorry to your brother.", "But she chose to be grounded???\n\nNot only that, but she was punished because she lied to her mother in order to avoid a situation she didn't want. What responsible parent wouldn't punish their child for that? \n\nAlso how did OP cause this problem at all? It was almost entirely Paige, besides OP almost cancelling Paige's party and forcing a joint party, which she even backed off on because she knew it was too far.", "??? where the fuck are you getting this from", "Do you have kids? Have you worked closely with young kids and teenagers? I'm not a parent, actively childfree, but I've worked with kids and nannied for quite some time. \n\nTwins sharing birthdays and then deciding to do their own eventually is normal. She said in the original post that they normally told her a few weeks before and planned accordingly. This is probably why she went with the assumption that her daughter wasn't lying if this is the first time it happens. \n\nTeenagers are learning boundaries and testing their limits. That's what they do. Little lies, focusing on the social aspect, all of that is normal. OP apologized for the actions (including making a group party a punishment which that's awesome insight) and asked what punishment the daughter thought was fair for lying. Daughter chose, OP went with it. \n\nSounds like OP is doing what you're supposed to do as a parent. Not every situation is going to be perfect, and Reddit has an odd tendency to go through extremes even when the posters do everything they're supposedly supposed to do during conflict.", "Because she lied. \n\nIf there has been a system for over a decade that the family has used, and the kids have decided to have parties together and apart with this system, there is no reason for the daughter to have lied. \n\nThe fact that OP believed the story immediately also shows a good amount of trust with the kids. She also apologized to her daughter and son for the oversteps, but lying isn't okay. So she and her daughter discussed a punishment and agreed on it. \n\nOP did exactly what you're told to do when dealing with a teenager.", "What post did you read because OP said I am wrong talked to the child asked how to fix this and did what the child wanted", "Ah ok ok", "My sisters are twins so it's cool. (My sisters are twins, but I am being silly with this comment). \n\nI know of a pair of non-twins who also had to share their birthday and hated it. (They were born on the same day 3 years apart). Not 100% the same, but I feel like the principle overlaps.", "Hi, this is it. This is it exactly. I am flabbergasted at any other interpretation of the events.", "Maybe you skipped over this part, but what I read was:  \n\"Paige said that she only did this year because her friends decided they didn’t want any boys.\"\n\nHere, it sounds like Paige wanted to go along with what her friends wanted. \n\n&#x200B;\n\nAlso, pay attention to the \"she only did this year,\" which would mean that she isn't opposed to the idea of a joint party, and that she wasn't upset that there was \"an expectation\" put on her, she was upset that she had to tell her friends that the party was cancelled, as seen in this sentence:  \n\"Paige said that she was more way upset about having to tell her friends that her party was cancelled than about having to share a party with Dylan.\"", "Twins normally do share birthdays so of course that would be the expectation until told otherwise, and the people to make that decision would be the twins so yea OP would expect them to share until they said otherwise. \n\nOP said in another comment that even if Dylan wanted to share a birthday and Paige didn’t she wouldn’t force Paige to share so it’s once again still their decision. Sure Dylan would probably eventually get a birthday but it would still hurt him not to get one on his actual birthday while Paige is celebrating just because she lied about it. I seriously don’t understand why people are justifying that and completely disregarding Dylan. There is nothing wrong with wanting to celebrate separately as most teenagers would but lying about it and hurting the other party is.", "How was OP at fault besides the threat of cancelling Paige's party? She had clearly given them the choice, and has said in the replies that if they disagreed, she'd give them their own parties anyway. If anything, the only problem that'd cause would be someone being annoyed at no joint party. And knowing 14 year olds, they'd likely both want solo parties anyway.\n\nAlso Paige could've easily talked it over with her brother first, and he likely would've said yes, especially since he's happily doing his own party. She didn't ask him anything because she wanted to avoid the possibility of a situation she didn't want, aka Dylan saying no. \n\nSo instead of asking her brother, Paige directly went to her mom and lied to her so that she could get what she wanted. That's textbook lying and manipulation.\n\nLying to your parent to get what you want is bad and very much deserves punishment. Paige is lucky that her mother even gave her a choice, as I know many parents who wouldn't.", "Thank you. Seriously.", "And literally hundreds of people gave you guidance on this stating that a sincere apology would suffice. Especially for something you say was normal teenager things. \n\nYou stated in your previous post that she intentionally left him out but also that she just got carried away. These are very different things. \n\nThere’s no reason at all why she should be grounded for such a non issue. You just wanted to see her punished for your perceived slight.\n\nAlso Dylan doesn’t even care anymore. Only you.", "Hint. You’re the parent.", "I feel like as long as she made up with her brother too the grounding is silly. She clearly owned up to her wrongs.", ">Actions have punishments\n\nDisagree. If the offending party and the offended can work things out amicably, there is no need for punishment for that action. Things can be \"settled out of court.\"", "people skipping over this fr", "Can I just say that I appreciate that you are treating your teenagers like reasonable people who can make reasonable decisions? \n\nI feel like the ability to go do things on my own or with friends starting at like 12 or 13 was really valuable to me growing up, and it's really distressing seeing the extent to which Reddit seems to think minors are incapable of being safe on their own. (Honestly, the entire \"your elementary school aged kids have to be supervised even in their own neighborhood\" thing is distressing too.) Thank you for trusting your kids to be reasonable human beings, do things in the world on their own, and to be involved in their own discipline. It's one of those things that really helps develop feelings of control and agency over your life at that age.", "That's my take too. Isn't 14 high school freshman age for Americans? Not sure where OP's from, but I remember going to friend's birthdays in middle school with minimal to zero adult supervision.", "Welcome to this sub, it's absolutely crazy.  I can't believe you gave a great update and people are just jumping on you again to nitpick your parenting choices. Wtf?!?", ">\"Paige said that she only did this year because her friends decided they didn’t want any boys.\"\r  \n\r  \nHere, it sounds like Paige wanted to go along with what her friends wanted.\n\nIt's possible Paige only wanted to go along with her friends. It's also possible that she wanted a party without boys or without her brother too but was already in trouble and trying to not make it worse.\n\n&#x200B;\n\n>\"Paige said that she was more way upset about having to tell her friends that her party was cancelled than about having to share a party with Dylan.\"\n\nJust because she's more upset about canceling the party, doesn't mean she isn't upset about having to share a party with her brother. You may be right, she may not be upset to share a party with Dylan at all. But I do not think that should be the option by default.", ">Twins normally do share birthdays so of course that would be the expectation until told otherwise, and the people to make that decision would be the twins so yea OP would expect them to share until they said otherwise.\n\nThis is because people tend to treat twins as a \"unit\" and not as separate entities. Expecting both of them to want to do things together unless told otherwise is part of this. \n\n&#x200B;\n\n>OP said in another comment that even if Dylan wanted to share a birthday and Paige didn’t she wouldn’t force Paige to share so it’s once again still their decision.\n\nWhile OP said this, OP also [said](https://www.reddit.com/r/AmItheAsshole/comments/12tfszz/comment/jh5r5og/?utm_source=share&utm_medium=web2x&context=3) \"*I suppose the answer is that Paige and Dylan have the expectation of each other to discuss these things or at least give the other a heads up. Paige normally would've done so but didn't only because she got caught up in planning with her friends, and then felt badly about it because she knew Dylan's feelings would be hurt.*\" OP has set the expectation that Paige and Dylan will do things together or that they need to decide together if they want to do things separately. OP also realizes that Paige saying she doesn't want to do things with Dylan will hurt his feelings. That places Paige in the position to where if she wants to do something herself, she need to be tell her brother that and likely hurt his feelings. OP also [admits](https://www.reddit.com/r/AmItheAsshole/comments/12tfszz/comment/jh5zcbs/?utm_source=share&utm_medium=web2x&context=3) that expecting them to do birthdays together was a bad call.", "Yeah, I can remember doing a lot of \"I don't want to have the conversation that will result from saying yes, so I will say no\" thing a lot as a teenager.", "Wait, assuming an answer and being wrong is lying? Why isn't it just being mistaken, or wrong?", "How does it make you question it?", "Maybe you need to read the story and not the fantasy you created", "Nope, once again you didn't read the original post, or maybe you just didn't understand it. She didn't need her brother's permission, she just needed to talk to him about it. She wanted her own party - fine - she lied about talking to him - not fine.\n\nWhat did your parents do to you that has you so invested in making OP into Terrible Mom?", ">buddy go touch some grass.\n\nBe the change you want to see and  take this advice you've given. \n\n> it shouldn't've been assumed she wanted a co bday.\n\nIf they've always done that, it shouldn't be assumed that she didn't want the shared party either. Parents aren't mind readers, we still need the kids to verbalize their thoughts and wishes. There are twins out there *still* sharing a birthday party as adults, it isn't unheard of in the slightest. \n\nYou are railing against OP for things that you are actively doing yourself (making assumptions, being uninformed in the situation.) Seeing as you so easily fell into the same trap, pretty easy to see how every parent ever has done the same.", ">There’s no reason at all why she should be grounded for such a non issue. You just wanted to see her punished for your perceived slight.\n\nI just take lying very seriously and think that it should always be punished, full stop.", "Honestly most of the time kids/teenagers will resolve the problem with the parents involved. Sometime when parents do and side with one of them it just makes the matter worse. \nFrom the post the kids generally get along with each other, so there was no need to be involved so much in this matter (other then the financial aspect of having to pay for 2 different parties instead of 1)", "Yeah punishment for the sake of punishment isn't great for kids. She owned up to what she did wrong, which is half the motivation for something like a grounding. Hopefully it's pretty minimal, this feels like a no TV for a couple days kind of issue. Definitely not at the scale of you don't get a birthday party.", "Popping a child out your hoohaa doesn’t automatically make you a paragon of parenthood", "Tbh the negative things that YOU all think about her are kind of how do I put this... wrong?", "I wholeheartedly agree. I am not from the US and I am always baffled about the amount of supervision that is happening around children even reagrdless of age sometimes. For kids the age of Dylan and Paige it is super normal to go to the movies alone or have some friends over without an adult closely supervising. I personally think its super important to gradually develop some indipendence as kids get older. Kids over here walk to school alone at six years old and they are damn proud of it the first few days until it gets routine. :)", "My sisters are twins. I am not a twin. I obviously don't get all nuance of twinness, but at least I grew up with it.\nI didn't address your points because I disagree with you on several areas, you seem really passionate about what you're saying, and I don't want have an in-depth argument on the internet.", ">I would ask you to look within yourself to check there is absolutely no shred of it.\n\nI assure you that I have done this, and I'm absolutely certain that it's untrue. But there's literally nothing I could say or do to convince anyone in this comment section otherwise, *because* everyone already jumped to that conclusion based on very little information.", "Which is why OP didn’t force them to celebrate together but is still punishing the lying and manipulating. Finding out your aren’t celebrating your birthday on the day of your birthday would have been 100x worse than just being told before hand. I still don’t see why your trying to justify the lying when it definitely would have hurt Dylan much more than just telling him she wanted to have her own birthday. Maybe it’s because I grew up in a household that didn’t like lying and promoted honesty so I’m biased.", "[removed]", "It depends, but generally if someone claims to know something that they don't, I consider it a lie. Not that they're lying about the fact at hand, but that they're lying about knowing.", "[deleted]", "Or maybe you just failed to provide anything that would convince her she was wrong.\n\n(Although, isn't this post mostly about her admitting she handled it wrong?)", "What on earth are you talking about, using nuance in a real world scenario!?!!!!?? Gtfo", "As I said in another comment, in WHAT WORLD does a 14tr old girl wish to spend her bday w her 14yr old brother? Mom should definitely not be assuming her teenaged children will be having a co bday bc they have before \n\nDaughter shouldn't've lied but if her brother wanted a co bday, did that automatically mean they'd be having one? I just feel like there's a decent reason why the daughter felt like she couldn't just say 'we're gonna have separate bdays' like you suggested!", "Well on one hands you're incorrect bc OP herself said they had previously had separate bday parties and that's why I was confused OP seemed to want them to have a co bday as teenagers\n\nOn the other hands, OP has revealed new information that makes my previous statements null and void\n\n>be the change you want to see \nLmfao kay?", "And you cannot see it from any other point of view? You can’t deviate even when you say yourself this was normal behaviour and not motivated by malice? \n\nWhat the hell happened to you to make you so militant to the point you are unable to see reason??? She is a child. She will make mistakes and when you say she’s well behaved, considerate and kind and that this was on no way driven by malice then you are WRONG. \n\nYou will make mistakes. You will have lied to her a million times probably over much more serious things then this. Please gain some perspective. This life is hard enough without you cracking the whip.", "You can tell the teenagers really brigaded this post and/or people projecting their own trauma from their upbringing.", "You have said so over and over, so either you genuinely are equitable, or you genuinely think you are. But like I say, to me and to dozens of others, it sure looks like you favour him. I think perhaps you are too close to it to be objective. I think you need to ask friends and relations for their opinions. And indeed the kid. Let's hope we're wrong, but I think you are too dismissive of what might be a genuine and damaging issue. \n\nTLDR Get external opinions from people who know you.", ">I still don’t see why your trying to justify the lying when it definitely would have hurt Dylan much more than just telling him she wanted to have her own birthday\n\nBecause Paige should not have had to tell Dylan she wanted to have her own birthday. That's the issue. \n\nOP was treating them like a twin 'unit' by defaulting them to having the same party which put Paige in a position where she had to give up her own party, hurt her brother's feelings by saying she wanted a separate party, or attempt a lie. Paige didn't make a good choice, but she shouldn't have been in that catch 22 situation in the first place", "Who is making this about gender??", "Wow, that’s the first time I’ve had my own post copied.  Bad bot.", "That is different and if you cannot see the difference something is wrong with you", "But do you lie to them about things they’re facilitating and paying for, or about something where the responsibility lies solely with you to pay for and set up?", "[removed]", "\"As I said in another comment, in WHAT WORLD does a 14tr old girl wish to spend her bday w her 14yr old brother?\"  \n\n\n...in this one? Are you even reading the post before commenting? OP said, and I quote:  \n\n\n\"...I’ll just assume going forward that they want to have separate parties every year. Paige said that she only did this year because her friends decided they didn’t want any boys.\"", "Did you read this update post? Daughter has specifically said she was fine with having joint parties in general.", ">in WHAT WORLD does a 14tr old girl wish to spend her bday w her 14yr old brother?\n\nI mean... in basically any world where two siblings in the same age range are friends.\n\n>Mom should definitely not be assuming her teenaged children will be having a co bday\n\nMom *never made that assumption*.\n\n>Daughter shouldn't've lied but if her brother wanted a co bday, did that automatically mean they'd be having one?\n\nNo, but for the past 14 years (excluding when they were too young) she and her brother have mostly chosen to have a shared birthday party. Even when they haven't they have talked about it first. Paige doesn't need to share her birthday party, but her brother does deserve to be told.\n\n>I just feel like there's a decent reason why the daughter felt like she couldn't just say 'we're gonna have separate bdays' like you suggested!\n\nHow about because she realized she was being kinda a dick to her brother and was embarrassed?\n\n>she admitted that she and her friends had decided on their own to exclude Dylan because they felt that a boy would wreck the activities they had planned\n\nThis wasn't a \"I want my own party\" decision. It was \"I don't want Dylan at my party\". Specifically it was \"my friends don't want a *boy* at my party\"\n\nShe was embarrassed by her decision to exclude Dylan and so she avoided actually talking to him, instead leaving him in the dark.\n\nShe wanted to hide that she was avoiding talking to Dylan so she lied to her mother.\n\nTo be clear she was not *obligated* to include Dylan in her party but:\n\n1. When you choose exclude someone you are necessarily telling them that they are not as important to you. In this case Paige chose to side with her friends against Dylan^(1)\n2. Regardless Dylan deserved to be told by her, rather than hearing it second hand.\n\n^(1: The simple way to avoid this is) ^(to talk to Dylan. If you want to prioritize someone without having them necessarily attend you can talk to them to tell them why. \"Hey bro, at my birthday party my friends and I want to spend a lot of time talking about which boys we have crushes on. We think that would be a little bit awkward to do while you are there\" \" Yeah I don't want to be there, but I hope you have fun!\")", "New information? You mean information that was in the original post that you neglected to read?", "Just because lying is \"normal behavior\" doesn't mean that it isn't wrong.", "I just don't think anyone here has reasonable grounds to conclude that I favor Dylan based on hearing about one situation.", "Once again you don’t seem to understand how twins work. Expecting to share a birthday isn’t bad and horrible like your making it out to be, and it’s only a problem if you force them to. Every brother/sister twins I know used the share birthdays with each other and they didn’t care until they were in their teens in which case they simply celebrate independently. So yes she should have told Dylan and not lied about it because for some reason you don’t seem to understand or just don’t care how that hurts Dylan.", "The grounding should at most be three days. If it's a week or longer I'm calling OP an asshole.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Hm well with this new information I'll have to retract my statement!", "I have been made aware of this new information, thank you!", "I would love to live in a world where 14yo olds have the communication skills you must think they have \n\nBesides, due to the new information from OP I've retracted my previous statements!", "reading is hard!", "An apology would have sufficed.", "I assume you've stopped reading responses by now, but please don't listen to these people. Punishing a teenager for lying is completely appropriate and good for their development. Paige needs to learn to be honest about her wants and needs, as I'm sure you are aware. As long as you've had an actual conversation about why she lied and why it was wrong, and you don't intimidate or abuse her in some way that makes her uncomfortable with being honest, you are doing the right thing.", "You clearly are not open to a discussion about this.  Stop being so stubborn, and go seek opinions from people who actually know you and your family in real life. It can't hurt to ask. If you are right, no harm done. If you are deluding yourself and/or unconsciously favouring him, isn't it better to find out?  I repeat: Get external opinions from people who know you.", ">Expecting to share a birthday isn’t bad and horrible like your making it out to be\n\nI'm not saying \"sharing birthdays is bad.\" I'm saying OP defaulting the twins to sharing and expecting them to decide together is bad because it puts Paige and Dylan in a dilemma if they want to do something separately and know it will hurt the other's feelings. Which is what happened here.\n\n&#x200B;\n\n>So yes she should have told Dylan and not lied about it because for some reason you don’t seem to understand or just don’t care how that hurts Dylan.\n\nOP [mentioned](https://www.reddit.com/r/AmItheAsshole/comments/12tfszz/comment/jh5r5og/?utm_source=share&utm_medium=web2x&context=3) Paige knew Dylan's feeling's would be hurt if she told him. She hurts him if she tells him or she hurts him if she lies; this is what a catch 22 is. It's a bad situation for Paige and happened because OP treated them as a twin 'unit' that would share a birthday and shifted the responsibility to change that expectation to the 15yo teens.", "Most of them with their parents. OMG you didn’t let you 12 year old go visit that internet friend they met online? It’s like when I was forced to baby sit my brothers and sisters and was beaten 6 times a day\n\n\nNo no it’s not leave your issues in therapy", "Whatever it is the kid is in agreement on its fairness. \n\nShe's updating, not asking for judgement.", "I don't expect 14 year olds to always communicate perfectly, but I do expect 14 year olds to know enough to not lie.\n\nIt's normal for teenagers to make mistakes, but the appropriate response isn't to ignore the mistake. Being 14 doesn't make it okay to lie, especially since not lying is something that has been covered since kindergarten.", "100% this ....... I have the same issue Even as someone in their late twenties.... My parents always favor my sister and everything so I was lie and don't tell them what my plans are because they will ruin it and involve my sister who is in her thirties..... It's pathetic but the only way around it is to lie to them all the time. Op I hope you check your favoritism and be honest with yourself about it so that your relationship with your daughter isn't ruined in the future.", "Once again while it may hurt his feeling, finding out about it on his actual birthday is 100x worse and something she shouldn’t have lied. You are still completely disregarding Dylan in this scenario acting like the lying wasn’t bad. \n\nSure OP should have changed how birthdays are celebrated but the twins might have liked celebrating together and since they have celebrated individually before OP might not have seen a problem with letting the twins chose. I’m not saying OP handled everything perfectly obviously but acting like the lying shouldn’t be punished and wasn’t hurting anyone is ridiculous.", "As a twin girl with a twin brother, same thing. We shared a lot of birthdays till we didn’t. It’s just easier. The lying cause she wasn’t mature enough to talk to her brother tho isn’t cool. At the very least she needs to understand that what seem like white lies can actually really hurt people’s feelings. The fact that y’all agreed on grounding makes it seem reasonable to me.", "I think you're setting an unfair expectation for punishing your daughter over a harmless lie. \n\nPeople are allowed to lie. Kids are allowed to either lie, omit truth, or simply not inform their parents. When you punish them when a lie doesn't hurt anyone, and the only consequence of said lie is that you are offended for not being told the truth, you're then setting an unhealthy communication expectation in your kids.\n\nI lie, = I get punished. I don't share = no risk of punishment. I get accused of lying when I'm not sharing, then I see no reason to tell you the truth because you're going to be mad anyway. Solution = I'll just lie anyway. At a certain age, you literally can't do anything to punish her, and she still won't trust you. \n\nThese lies are also important in your children's discovery of themselves as they establish their independence. You don't want to hinder that by smothering them with expectations that don't actually have consequences other than hurt feelings. \n\nLies should have consequences if there's a real-world consequence of the lie. But otherwise, let your feelings be heard and move on.", "So we’re letting kids choose their punishments now? Wow, wish I would have been born about 20 years later then….", "WHY IS SHE GROUNDED???? WTF??? You created this situation. My vote still stands YTA.", "YTA", "I don't think I've ever had a birthday party after I was 2. I feel sad now.", "OP, thanks for taking judgment constructively and reassessing your actions.", "As an identical twin forced to share my birthday, DNA, and looks with someone I HATE I still resent it. I'm happy you changed your mind.", "I love a happy ending!\n\nThanks for the update!", "Girl twin to a boy twin. My bro and I started to have separate parties starting at 12 years old, because we both have different friends AND he wanted to do “boy things” and I wanted to do “girl things.” I put those in quotes because the activities we chose BOTH genders can/could do. At 16, we had our “sweet 16” together and it was a blast! But I’m blessed that I was able to have my own autonomy, because for a VERY long time we were treated as 1 person and not 2(I still get “oh you’re so and so’s twin sister” and we are 35).  Is lying bad? Yea. But I get it.", "Paige shouldn't have gotten a party at all. She lied and tried to force her brother to have his birthday her way. To lienante on her. And apologizing to her when she hasn't done the same is bad too. She'll try to pull stuff again. I feel for the boy, his sister is spoiled and selfish", "If I was your son I don't know who I would be upset with more. Either my twin for not wanting me at her birthday party or you for thinking that making her share her birthday party with me was punishment.\n\nI'm glad it worked out, but be careful because that might boomerang back on you one day.", "As a triplet who never got a party of her own, good that you realized this. Make them feel like they exist as individuals and not just as a pair", "I was like wait, why is Paige still being punished?", "Yup. Can’t believe she’s still acting like she lied about murder. At least she’s getting her birthday party. Poor kid.", "The most controversial low stakes post for sure. People seem more upset than any of the three people actually involved.", "Yes this is reddit where everything has a nuance behind it /j", "Yean, please never have kids' punishment and consequences. They need to he taught that having a conversation doesn't teach that", "I just asked one of my twin daughters if she ever wanted an individual birthday party. After reading this I was feeling a little guilty because they always shared birthday celebrations. Her response was “Why? That’s just too much effort for everybody”. I love my girls.", "OP literally states after your first quote he'll be having a conversation with them next year about it.", "So she was right…", "lol i don’t understand why people are harping on this. as someone who was a teenage girl i can tell you 100% it’s just kinda what they do. aita reads everything like the script of a lifetime movie i stg", "I think she lied because you wouldn’t respect her wishes if you thought Dylan wouldn’t be okay with it.", "Then why did you say that you specifically told Paige that you knew it was important to her not to be treated like half of a matching set and apologize for forgetting that?\n\nI mean, I’m not down for most of what’s being said and assumptions being made, but the notion that it’s something you knew and forgot seems to imply that you have treated them as a matching set in the past?", ">OP literally states after your first quote he'll be having a conversation with them next year about it.\n\nOP is saying both things... a la \"I’d start assuming that they want separate parties\", and going with both strategies will lead to the same dramas.", "They are 14.  This is age appropriate mildly obnoxious typical teenage behavior.  They don’t think ahead consistently. They think about one thing, then just wave their hands at everything else, and don’t think out the rest of the consequences.  Sure, it’s immature.  But, 14 yr olds are SUPPOSED to be immature.", "Lying to your parents saying your sibling agreed to something they certainly did not is a time-honored tradition.", "It's a defense mechanism. If you think you might be wrong, you lie to protect your pride. Everyone does it, to some extent. Some may have gotten over it in childhood, while some perfectionist adults have a hard time letting go even if they know it's a problem.", "Garbage take right here ∆", "I remember this one from the first post. An awful lot of people made a lot of assumptions there too.", "It's literally developmentally appropriate for kids to lie! Testing boundaries is natural, and unless it's habitual, it isn't a problem. You should be more concerned about children who are too afraid to let down their parent and are unwilling to do anything outside the norm. Kids are just burgeoning adults who are learning as they go and that takes times and experience. This experience went about as well as it can go.", "Absolutely terrible way to view it. I'm sorry, but the feelings of others **that happen as a direct result of our actions** absolutely are our responsibility. That doesn't mean they have to control what actions we take, but by **definition** they are our responsibility.\n\nIf I tell my wife I don't want to go to dinner with her because I think she looks fat today that would be psychotic. The feelings she will feel as a result **are absolutely** my responsibility, because I have caused her pain.\n\n&#x200B;\n\nI'm not saying she should have been forced to have a joint party...but saying it's not a big deal that she lied to get there is wild. It's literally the entire point of \"The ends don't justify the means\" - If you're fine hurting whomever you want on the way to getting what you want you're an AH, which is literally what we're here to decide.", "I was just referring to this instance of forcing them to have a joint birthday of being when I forgot.", "eh. this comes off a bit helicopter-y. a lot of people start driving at/around 16, at which point they're unsupervised almost everywhere. letting your kid out in relatively tame/safe settings unsupervised 14/15 seems pretty reasonable IMO.", "How dare you imply that we have to be considerate of the feeling of people we care about /s\n\nWhile there are situations where you have to prioritize yourself, only an AH goes around doing whatever they want while walking over other people.", "I misread your comment. I read \"wasn't\" as \"was.\" My bad.", "Honestly, this parade of attacking you is silly. The whole story sounded like a human raising humans that made a mistep but course corrected and reconnected. I mean, your kid felt comfortable enough to point out that she felt you weren't even apologizing for the right thing before helping you pick a punishment; that doesn't sound like a strained relationship.", "She doesn't want a joint birthday.  She knows that mom will force her to have a joint birthday.  So she lies, because she's an idiot teenager.\n\nAnd by saying 'well what about his feelings,' you're justifying her lie.  \"His feelings\" have no bearing on her right to not be involuntarily joined to his hip.\n\nWhat about her feelings?  Driven to lie because she knows that if she just asks, she'll be told 'no.'", "Honestly, some of these people are going overboard. At 15, I would think all you'd really need is a few texts to make sure they arrived safely and changed activities on time and when they are ready to be picked up and that's it.", "Not only that, but admitted fault and that they were unreasonable, then discussed what will be done instead and gave her daughter input on the alternative.\n\nThat seems like some decent corrective behaviour and more than any manager has ever done for me in the working world", "Thank you for saying so. \n\nFor a while there, I felt like everyone else was reading a different post.", "Go to therapy before ever having kids. Bless.", "I disagree. Punishment is there to prevent people from doing something similar in the future (or preventing it altogether, knowing that there's punishment involved).\n\nIf you steal something from the store and when you're caught the only thing you have to do is pay back the store **everyone will try stealing** first, because at the very worst you just have to pay for the thing you were taking anyway. She got caught lying because she didn't want to have an uncomfortable conversation, but the reality is **sometimes you have to have those** as an adult, and getting comfortable with putting the feelings of others high enough to not want to just lie to avoid the conversation is a bad precedent to set.\n\n&#x200B;\n\nShe owned up to what she did and made up with her brother, but none of that is a reason why she wouldn't try it again in the future. Actions have to have consequences, or there's no reason for people to not just be total dicks to each other.", "Where did you get that \"she'll be told no\"? OP goes along with her request when she asked, the brother is also ok with it now and didn't seem that bothered to have a separate party, as OP said \"he guessed that made sense.\"", ">She knows that mom will force her to have a joint birthday.\n\nWhy so many people are making up the same BS? That never happened.", "Where as an adult can you do things wrong and simply say sorry with no repercussions ever? You're raising adults, and they learn in the safe confines of being a child, but that doesn't mean you set an expectation that doesn't exist once they turn 18.", "I'm seriously surprised at the number of people who are like... Fine.... with a 14 year old lying to their parent just because, and screwing her twin brother in the process...\n\nEspecially when all she had to do is say \"I haven't talked to him about this yet but I will tonight\".", "Well fuck. of TwizzlerStitches doesn't agree! Better reconsider OP....", "I'll give you the best parenting advice that you can find on reddit: *don't take parenting advice from reddit.*", "Call it a gut instinct, but I honestly don't believe you would be punishing your son if the roles were reversed. Favoritism very much is in play here, and your daughter is noticing. If she cuts you off in the future and you wonder why, I hope you look back here and realize.", "Like all the times teenagers unironically assert in plain language that one of their peers is sexually prolific despite having never witnessed any proof and being unable to offer any proof when questioned.", "U ok bud?", "I'm sure there's nothing I could say to convince you otherwise.", "What is wrong with your comprehension? He spoke to his daughter before speaking with his son. She said she spoke with her twin and they both agreed to do separate parties. She lied. Afterwards he spoke with his son and found out she lied. What is wrong with the punishment? He revoked the punishment he originally set because he realized it was too far, but she still lied to him with no motivation. This isn't the  deep-rooted conflict you're trying to make it. They've had separate parties before. This is just a teenager being a teenager. Why do you want to hate op so much?", "God forbid anyone make conversation.", "Just because something is wrong doesnt mean it deserves a punishment.", "God forbid people keep the conversation on the same topic. Adults lying to parents about what they’re doing is much different from a child lying and expecting the parent to (financially) pay for the lie.", "Twice in what, 14 years? That's less than 15% of separate birthdays and 85% of shared birthdays. Maybe if I put in numbers is easier to get the point?", "If you want to raise shitty people, sure"]}