{"id": 15821, "submission_id": "130wubj", "title": "AITA for being too hard on my 11 year old son?", "selftext": "My 8 year old daughter and 11 year old son have a set of chores they rotate every week. One folds the laundry and takes out the trash and one washes the dishes. They both get $10 a week to do these things. Well I found out my 11 year old hadn’t been doing the dishes that week.\n\nHe promised our 8 year old daughter if she did the dishes she could get the $10 for dishes for this week. So she has been doing the dishes as well as folding laundry and taking out the trash. I didn’t know about their agreement and at end of the week because the dishes were done I just gave them the money. Then my 8 year old cried to me the 11 year old won’t give her the money and the 11 year old said she was just doing a favor for him and he never promised her the money. \n\nBut she did do the dishes as well as her other chores so the next week after they both did their chores I gave $20 to my 8 year old to “back pay” her for the week she did both of their chores and didn’t give my 11 year old anything. \n\nHe cried and tried to get his dad to gave him the money. Now my husband and I are arguing because he thinks I’m too harsh with our 11 year old and $10 just enough to fight about. To me it’s about him making his sister do work and then pocketing the money anyway and how he needs to know if he didn’t do the work he doesn’t get the money.", "created_utc": 1682615157, "permalink": "/r/AmItheAsshole/comments/130wubj/aita_for_being_too_hard_on_my_11_year_old_son/", "score": 3577, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for not giving my son money for chores he never did?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - good on you for not raising a boy who thinks he can hand everything off to the women in his life without anything in return.", "NTA- He’s gotta learn. If he’s old enough to come up with this scam he’s old enough to get the consequences", "NTA\n\nSounds like the only reason you're on here is because your husband made you feel bad for disciplining your son. Idk how your husband was raised but he clearly is a softy if he doesn't think this is a fair consequence for what your son did.", "NTA. \n\nI think it was a perfect solution. I don't understand, at all, why your husband thinks it's too harsh. It wasn't too harsh when the 8 year old got scammed?", "NTA. he lied and tricked her into doing work for him, now he’s mad that he’s facing consequences. too bad. now he’ll know not to do to do it again", "Whoever does the chores gets the pay. It's really that simple. What messed up values is your husband trying to teach your son? \n\nNTA", "NTA. He tried to burn his lil sis out of $10 and he doesn't deserve an allowance if he didn't  complete his end of the bargain. What's your husband's reasoning for wanting to give him the money?", "Your husband is wrong. Don't teach your son that it's okay to do nothing and get paid. Don't teach him it's okay to use other people, especially family. NTA.", "NTA. A huge problem these days is parents not teaching their kids that actions have consequences. you taught your kid not only do actions have consequences, but the problems that arise by breaking their word / promises.", "NTA\n\nHe's old enough to know better and old enough to learn there are consequences", "NTA. 11yo just learnt that he has to pay his subcontractors.", "NTA.  He didn't earn the money.  Essentially he \"hired\" his sister to do the work for him so she deserves the money.  He would get nothing because he did nothing.", "How is this too harsh? But at the same time 10 dollars is nothing to fight over for?\n\nKids need healthy boundaries. Your son got his sister to do the work with a promise of money. The money was not paid and your son lied about the agreement. If you don't show him that actions have consequences he will do it again. You didn't 'steal' the money or anything, you repayed his debt to his sister. Its an important lesson.", "NTA\n\nOtherwise you teach both your children that lying and scheming is ok....", "NTA\n\nIt's not about $10. It's about teaching your son early about the importance of being an honourable person, and that cheating and manipulating people and lying for personal gain is not okay. \n\nYou literally didn't punish him for not doing his chores, or even technically withhold the $10. He just had a debt of $10 to his sister for a deal that he'd made with her, and you ensured that debt was paid. You put a lien on his allowance, as it were. This is what happens when people don't pay their debts: their creditors are allowed to seek the money owed them by appealing to the authorities.  You may actually want to have that talk with him as a follow-up, a reminder that this was not done to punish him, but to ensure that he kept his word and paid his debts, and that this is how things work in the world at large as well.", "NTA your son was being dishonest, broke the trust of his sister AND you, and is now reaping what he sowed.", "NTA. Your son needs to honor his obligations and lying about them won't get them anywhere. I don't know too many people who would just offer to do someone else's paying job for them out of the kindness of their heart, especially an 8y.o. and not expect something. \n\nThis will be a good life lesson for him.", "NTA. Hopefully he's learnt a valuable lesson.", "NTA. It's unclear who was telling the truth about whether the money was promised or not, but if the money is explicitly for doing the chores, whoever did the chores should get it.", "NTA your son is old enough to understand that his actions have consequences", "NTA - there was no way it was a “favor”. He was trying to pay her to do his chores and backed out.\n\nIt’s not about cost. It’s about the principal of if.", "Nta thats reasonable and hes old enough he cant get away with cheating and rewarded for cheating", "NTA, that's what we call a teachable moment. Hopefully your son learns from this.", " Essentially he \"hired\" his sister to do the work for him so she deserves the money.", "NTA \n\nYour son tried to get his younger sibling to do his chores and keep the money for the chores. She will not be inclined to help him in the future.", "I'm with OP.  Tell Tom Sawyer he doesn't get pay if he shirks his chores.", "NTA, You did the right thing. Your son needs to understand that it is not fair to burden his sister with the chores he’s assigned to and he needs to learn that as a family member he has to help out as well. He also needs to learn he cannot go around making promises then breaking them afterwards and take advantage of others. Your husband is trying to teach your son that it’s okay to ditch his responsibilities in favor of being lazy, he has broken both yours and his sister’s trust and he should know by now that trust takes a while to repair", "NTA, and please explain to both your husband and son that even if it was a \"favor,\" that wasn't part of the original agreement. You get money for chores. He did not do his chores. End of story. Tell your kiddo that it's not about whether or not the chores get done, but about teaching responsibility, and he did not learn the lesson. If he continues with this attitude, you might just promote his sister to \"management\" and she gets to check his work and take a portion of his income. LOL", "Info - why didn't you just force your son to give your daughter the money he owed her?", "NTA... should of gave her the money the same week she did all chores for  him to fully learn... your husband is a AH he needs to realize the older your son gets he cant have others do his work and expect to get paid or rewarded for not doing anything....", "NTA.  I’m sure your husband understands the concept of work for money. \nIt’s even more disturbing that your husband thinks that if a boy does it, he should get money but if a girl does it for him, then it’s a favor. Bad message to send.", "NTA.\n\nThis is a natural consequence, which imo is the best way to parent. He won’t do it again.", "He promised her the money he needs to give it to her.  She did his chores.  A deals a deal.", "Gender pay gaps start young these days.\n\n(Edit: NTA)", "NTA.\n\nThis is actually a good teaching lesson.\n\nThat if you're not willing to put in the work then you don't get the pay to reflect the job done.", "NTA- He tried to trick his sister and found out the consequences. If he did what he said he would do, he would have gotten the money as well. But, since he owed his sister, you were fair.", "NTA honestly this title is very misleading,, this felt like an extremely appropriate reaction to the situation.", "NTA. Sounds totally fair for this time, \nbut let your daughter know that in the future, she should get the agreement in writing from him first, and they both have to sign it.", "NTA NTA NTA!! Your son sounds like an enterprising young man, who may as well learn now rather than later that there are consequence to not paying your vendors. It's not about the money, it's about fairness and honesty (he lied to you to cheat his sister!) which are values worth feeling some pain over.", "NTA.\n\nYou did the right thing—it’s only fair. And your husband needs to get it together.", "It's really that simple.", "NTA. I would have taken the money off of him the very week I learned about what he'd done. *And* he would have been grounded for two weeks for duping his younger sister into doing his chores: one week for the duping, another for trying to get out of his chores. Honestly, if this were a few years ago, for the duping alone I'd probably have sent him outside to get a switch. (But according to the latest research corporal punishment has more detrimental effects than positive ones, so I've since adjusted my parenting toolkit.)\n\nYou *should* be stricter on the eldest child, especially if the behavior you're correcting is them taking advantage of a younger sibling. Your husband is an enabler and he should really examine why he's so willing to give that kind of behavior a pass.", "What is wrong with your husband? Is this just boys being boys or something? Does he want him to grow up into a shiesty jerk who renegs on deals?", "NTA in fact I think you should have added additional chores for him to do because he lied to you & to his sister.", "NTA. I was actually in a similar situation as a child, one time my older sister convinced me to do her chores and she would give me all the tv privileges for the weekend (we didn't receive money for doing the chores lol we just had to do it) and I accepted it. But during the weekend she stole the remote, and she put on her series on the tv, when I complained to my mom she just said we had to share the tv and take turns (dismissing our previous negotiation) and I remember feeling so betrayed by both my mom and sister. I had to learn the hard way to not trust so easily, but she didn't get her lesson at that time.\n\nYour son didn't do his chores, he doesn't get anything. If he is old enough to trick his sister, he's old enough to understand that actions have consequences.", "NTA babe good job on the fair discipline", "NTA - He scammed his little sister. It's not even a punishment. He's just not being paid for work he didn't do. That's how life works.", "NTA. You need to nip this stuff in the bud when it's only $10 at stake.", "NTA. Your son got paid $10 last week for doing no work, he essentially had an advance on his allowance for working the following week. It’s net zero at this point. I think you are being completely fair in not paying him this week.  Being a hard-ass would be imposing more punishment and also somewhat justified. Some could say your sim has gotten off pretty easy.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy 8 year old daughter and 11 year old son have a set of chores they rotate every week. One folds the laundry and takes out the trash and one washes the dishes. They both get $10 a week to do these things. Well I found out my 11 year old hasn’t been doing the dishes. He promised our 8 year old daughter if she did the dishes she could get the $10 for this week. So she has been doing the dishes and at the end of the week because the dishes were done I just gave them the money. Then my 8 year old cried to me the 11 year old won’t give her the money and the 11 year old said she was just doing a favor for him and he never promised her the money. But she did do the dishes as well as her other chores so the next week after they both did their chores I gave $20 to the 8 year old to “back pay” her for the week she did both of their chores and didn’t give my 11 year old anything. He cried and tried to get his dad to gave him the money. Now my husband and I are arguing because he thinks I’m too harsh with our 11 year old and $10 just enough to fight about. To me it’s about him making his sister do work and then pocketing the money anyway and how he needs to know if he didn’t do the work he doesn’t get the money.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. You should have got the money back from him and given it to his sister the week it happened. Leaving it a week before implementing consequences isn't reasonable at that age - you're not teaching anything at that point, you're just being mean. You should at least have told him that's what was going to happen at the beginning of the week.", "[deleted]", "ESH. You had to give notice this was going to happen. Just like its wrong for your son to tell sis she would get paid and then not pay, its wrong for you to tell son same.", "Absolutely NTA, you did the right thing in my opinion. He did something wrong so there must be a consequence, and I think that your husband maybe doesn't want to deal with an upset child.", "NTA. Keep doing what you’re doing! Your husband is enabling this behavior by taking that stance. Unless your 11 yr old has some sort of learning or behavioral disorder, I think his age is plenty old enough to begin learning these lessons. It will serve him well once he hits his teenage years and people become less forgiving (teachers especially) for manipulative behavior.", "NTA but you should have made him do all of the chores for the next week and then give the entire $20 to the sister.", "Why does your husband encourage laziness in your son? must be because he knows mommy takes care of daddy, and now sissy will take care of brother. NTA", "old enough to understand that his actions have consequences.", "My husband is Disneyland daddy", "He wants me to also pay my son and just given an extra $10 to my daughter. I don’t want my son to feel like he can get away with things", "Right!!! Scammers don’t get rewarded… if they do these are really f’ed up values to be teaching and 11 year old. \n\nOf course when he turns 16 he’ll figure out scammers do get rewarded, but right now we should start out with the right values, not the hard truth.", "Curious, were you a lil pissed like me he said he'dgive her the full 10 and no like 5 or 9?", "And he’s learning that if you don’t go to work, you don’t get paid! NTA", "I'm betting that the father has a favorite child and it's not the daughter", "Exactly, my husband argues my daughter was doing a favor. I don’t think my daughter was given how pissed off she was when she didn’t get her money. Also it should be based on who did what so she should get it. My husband wants me to pay my son the normal amount and give my daughter an extra $10. I think it would just teach my son he can get away with not paying what he owes and my daughter that her work won’t be payed", "He spent it already", "Yup", ">Leaving it a week before implementing consequences isn't reasonable at that age - you're not teaching anything at that point, you're just being mean\n\nThey are not dogs, I'm pretty sure they remember what happend a week ago...", "The boy is 11, not 3. Almost in junior high and you don't think the kid can remember back a week?", "Might want to reread the post. That's exactly what is happening.", "Oof! Don't budge. Someone has to be responsible for not raising little AHs.", "He needs to ask himself *why* he’s a Disneyland daddy because it’s simply not useful. NTA\n\nETA: phrased it this way bc my own dad bordered on Disneyland and it’s clear that it was because he lost his own father right as he entered his teenage years (still caused an uneven punishment system, uneven parenting decisions, and a lot of broken promises in our house). Idk his trauma so I’m not gonna judge him on why. If there’s a reason, his taking the effort to find it would allow him move past playing this role which is, again, useless.", "Would your husband give your son the $10 behind your back? Cuz if so, your son would be learning all sorts of bad lessons even worse than if you did what your husband wants (which is to give your daughter $10 extra).\n\nI'd rather compromise and give your daughter the extra, then to be in the far worse situation if your husband giving your son $10 behind your back.\n\nEither way, I think you are absolutely right, but make sure you and your husband can finally see eye to eye on this.", "Absolutely not! Your son needs to feel what it's like to work all week and then not get paid. \n\nPaying your son for not doing his chores is such a bad idea. Also, he didn't honor his agreement with 8 year old. And he lied about it. \n\nI think you are handling it perfectly.", "No, just thought he was dumb.\\\n\\\n11yo also just learnt to factor in profit margins.", "Why should your son be paid the normal amount when he didn't do the chores? Your husband would be teaching him entitlement. He is not entitled to money for work he didn't do. It's that simple. We haven't even gotten into him duping his younger sister into doing his work.", "Oof you're NTA\n\nAsk your husband if your son should learn this lesson now in a safe space, or as an adult in the real world, and tell him to really think about how that's going to go. You're teaching them how to survive life and every lesson is a building block for success when they leave your house.", "That's also bullshit though, because there's still an imbalance of power between an 11 year old and and an 8 year old, so in all likelihood, any such \"favour\" would have been coerced, even without the offer of money. And apparently also an imbalance between a boy and a girl in this house, based on Dad's position on his son exploiting his sister. He just wants to condone it.\n\nDig your heels in, Mom. You're NTA for wanting to teach your son integrity and ethics. And even more importantly, for not wanting to teach your daughter she should go through life accepting people taking advantage of her. All the generations before her did more than our share of that. That's not on the menu anymore.", "I'm with you on this one. I'm assuming that if one week neither of them did their chores, nobody would get any money. And that if one of them did their chores, but the other didn't, only the one who did them gets paid. \n\nI'd probably quibble if one kid was racing to do all the chores to make $20/wk and stiff their sibling, but you said they alternate responsibility, so it shouldn't come up without an agreement between them.", "A favor is consensual, though, and changing the terms of a deal renders prior consent null and void under the rule of sibling law", "From the story it sounded like your daughter was upset quite immediately after getting the money though, how did he spend it so quickly?\n\nNTA but I do think this should have been communicated to your son as soon as you knew of the situation.", "Can't give back what you don't have. That little con man", "They remember but it's not an effective way to show that the actions have consequences if he gets away with it and then emotionally moves on before anything happens.", "Because it makes his life easier and results in a more positive attitude from children. \n\nOP is stuck with the real parenting work, while he offers a *different perspective* that he didn't have to put any effort in.", "Get it together child!", "And her husband would be teaching him that it’s okay to take advantage of others (especially woman’s work). Not okay. NTA.", "I don’t think you have a preteen, if they know it’s not their money they will spend it the second they get it", "I don't know if it's the case here, but my 13yo drops his whole allowance on Robux within seconds of getting it LOL", "Haha, I definitely do not! But given the phrasing I thought it was cash, and one (preteen or otherwise) usually has to leave the house to spend cash. I realise that was an assumption on my part though and it could have been an e-transfer or something!", "These are things my siblings and I tried to do to one another too. These are naturally occurring, developmentally appropriate, real life lessons. We grow and learn from things like this. Unfortunately, some lessons are expensive. This one cost $10. Hopefully, it will help prevent an even more costly lesson in the future. NTA", "Please don't let him do this. My husband used to do the same thing with his siblings. Would pay them to do his chores or he would withhold something they needed in order for them to do his chores. We've now been married for 23 years and trying to get him to do anything around the house has been a nightmare. Your son needs to know that he is responsible for helping to keep his living area clean.", "YHTA - You're not!  Husband should have had your back, Son needs to learn there are consequences for his actions... Daughter deserved the extra $$$", "NTA. I’m glad you’re stopping the future “middle manager” in the making. Seriously though just tell them if they ever want this arrangement going forward they have to clear it with you", "NTA - good for you for teaching your son he can’t make false promises and break his agreements without consequences", "NTA but your husband is leaning in that direction.  Your son fobbed off his chores on his sister and then LIED about it.  Why would there NOT be consequences?  That's basic Parenting 101.  Honestly, he should have ALSO had to do his sister's chores for no pay at least 3 days as well.", "NTA. FIFO this is just natural consequences. Don’t do the work, don’t get paid.", "Sounds like the father is an enabler. Don’t budge on this. Someone has to be the adult here.", "NTA! \nYou’re teaching your 11 year old  the work ethic he’ll need to get by as an adult. Both in maintains the house and in professional life. \nAsk your husband if he wants your 11 year old to still be living at home when he’s fifty because he can’t hold down a job. \nAnd if your son complains it’s not fair! Tell him what my dad always told me and I told my kids, life ain’t fair. Get used it.", "NTA, curious if the roles were reversed if he’d stand up for your daughter tricking your son out of money", "NTA\n\nYou've covered compensatory damages, but where are the punitive damages?", "NTA. Your punishment is the most fair, he didn't do his chores so he doesn't get any money. An alternative would be to make him do both chores for one week to make up for it. Your daughter still deserves the extra money though.", "not.  Son also lied to you... and that to me should be a firm limit on when you start encouraging that \"it doesn't matter if I do or don't \" mentality that the world does not need fostered in another human- we have plenty with that attitude already.\n\nH is wrong imo.", "It's not an allowance, it's paying them for work. he did not do the work so he doesn't get paid. It's just like an adult job. If somebody covers your shift you don't get paid for that shift. And he needs to learn that sooner than later. Good job mama!", "NTA and not a good sign for your husband to not support you, especially if your son knows about your disagreement.  Your son will know who and how to manipulate if both of you are not a united front.", "NTA -- it isn't about doing the dishes. It's about lying to his sister and cheating her of the money he promised. His claim that the sister was just doing him a favour is such bs and he is using her -- he's her big brother, and she's only 8 and of course trusts him. \n\nAnd for the little sister it's a lesson in where to put your trust.", "NTA. And this is an important life lesson for your son. If your husband caves and gives him money after he tried to manipulate and take advantage of his younger sister, this will become a pattern for life. DO NOT CAVE TO HIS EMOTIONAL MANIPULATION.", "NTA I hope your doesn’t go behind your back and pay your son the $10 anyway…", "NTA and please stick to your guns.  He manipulated her into doing the dishes for him.  Sounds like your husband is sexist tbh.", "NTA.\n\nYour son is old enough to know better. He's eleven, so he's what, 5th, 6th grade? Kids that age absolutely understand that when you say something and don't follow through, that's a lie and that's bad. Kids that age are also little shitheads at times. He was trying to exploit his younger sister's labor, and he found out there are consequences for that. That's a very good lesson to learn, no matter what your husband thinks.", "NTA. Your husband needs to understand that the real issue isn’t that your son missed a week of chores. The biggest issue here is that your son bullied his younger sister. And if husband things docking $10 allowance is “too harsh” a punishment for bullying his sister, that’s a problem.", "I find it messed up that your husband made you feel bad for giving your son a teachable moment. Your son didn't do his assigned chores and lied to his sister that he'd give her the money if she did them for him. Do not budge on what you did because what you did is the correct thing. Your son has to learn that if he's going to try to play stupid games, he's going to win stupid prizes.\n\nI highly suggest that you keep an eye on your husband so he doesn't go behind your back and give your son 10 dollars. I would also suggest that if your husband does try to do that that you stop that immediately because your son will never learn that actions have consequences and he will learn that his dad will let him get away with things.\n\nmy verdict? NTA", "NTA\n\nHe conned his way out of chores, your husband being cool with it is a little jarring.  He doesn't believe in defined male and female roles does he?", "NTA - You are an excellent boy mom. It wouldn't be OK for him to do this to another male child. It's doubly so that he is not to do this to a female child. It's a good lesson for all involved.", "Ask your husband if he is OK with your daughter going no or low contact with him when she's older. \nBecause that's more than likely what's going to happen if he keeps up with favoring your son, and he'll have no one else to blame but himself.", "He promised her the $10 if he wants to trade chores for the money then he has to cough up.", "NTA. Make him pay interest on it too - next week he only gets $5 and she gets the other $5. Otherwise he hasn’t lost actually anything and will try it again.", "NTA At 11yrs old your son knew what he was doing. He was being a scam to your daughter. A lesson was definitely needed. He's old enough to learn the realities of life: No work no pay.", "NTA\n\nYour son was being a brat and being a brat has consequences. Giving children consequences for their actions and explaining why what they did is wrong and undeserving of positive reinforcement is how you raise a well adjusted child who doesn’t grow up thinking it’s okay to outsource his responsibilities while still profiting off it. No one hit him or screamed in his face; he just didn’t get extra money that he didnt deserve. Wtf does your husband think discipline is?", "NTA, and an 11 y/o crying over an unsuccessful attempt to scam his 8 year old sister is just trying to be manipulative.", "NTA. It’s a real life consequence which is most effective. He owed her money. You garnished his wages. 😉", "NTA- and it’s not *really* about the money, I feel like, but the principle. Of course the money aspect is important, yes, but this is a great teaching moment about morals. Your husband should know better.", "You have a spouse that you are raising these children with. If you are going to introduce a new punishment like that, you should have talked to your spouse about it first.\n\nInstead, you put him in a difficult spot. He disagrees with you, but can't go behind your back to fix it. That would destroy the dynamic you both have with your children if he did. Instead, he has to back you up and deal with an aftermath he thinks never should have happened. You should have had a discussion. You should have come to an agreement before acting out what turned into a week-long punishment.\n\nYTA. Not for how you treated your son, but for how you treated you partner. You forced an agreement out of him, when you should have discussed one.", "YTA\n\nNOT because you are wrong for not giving your son money. Your daughter did extra work so should be rewarded based on the established agreement within your household.\n\nHowever... YTA for tying household chores to monetary gain. You're teaching your children that they should only do chores when they get something out of it, not because it's just something that should be done.", "Definitely a clear case of NTA. Hold firm, you're doing it right", "NTA \n\nYou're absolutely right. Your son needs to learn to keep his word. If he learns that he can get away with things like that, it isn't going to help him or anyone else in the future.", "NTA. Does your husband help around the house? It’s important for you to stick to what you’re doing, otherwise your son will grow up believing a woman will clean up after him whenever he doesn’t feel like doing it!", "NTA & good on you.  I could do with a bit of your strength.", "NTA. \n\nConsider this though - disassociate their allowance from doing chores. You don't need to pay them to chip in around the house.", "NTA - this is good parenting.", "NTA\nYour 11 year old is a smart kid....But not smart enough haha.\nI wonder what other kinda stuff he got going on lol.", "NTA. Good job teaching him a lesson. His dad is the type to create entitled grownups who cut corners and never learn consequences", "NTA. If he wants to give his sister his allowance and have her do his share of the chores, fine, if she agrees. But he can’t back out of his end of the agreement. Good for you for not letting him get away with it. You are not being tough on him at all. Sister was not doing him a favor. He said he’d give her the money if she did his chores then tried to back out saying he never promised her.", "NTA he promised that she could have the £10 if she did his chores and she did so you where just evening things out. Also how didn't you notice she was doing the dished instead of him???", "This is a learning lesson for both kids. Don’t take advantage of people and make sure you get the money upfront. \n\nWhat is your husband’s solution to this?", "NTA, that is the right thing to do.  \n\nOne idea, from a lawyer, is to also make him research \"quantum meruit\" contract law and \"performance as evidence of contract.\"  Then he'd learn that he is not the first to think of this trick and the law has ways of handling these things.", "NTA. Your husband is right, it isn't a lot of money. But this isn't about the money. Having no repercussions for the son is not only teaching him that it is okay to lie, cheat, and steal; it is teaching him that it is okay to do it to family (let alone the most vulnerable person in that family). Honestly, I feel like your son may still be getting off a little light because you are only enforcing their original agreement and not punishing him for trying to take advantage of his sister", "NTA. I think you're absolutely right.", "Heck Id have had him do all the chores next week and they both get paid.", "Well now you know where he gets his assholery from. Ntah", "NTA something that needs to be learned. If you don’t do the work you don’t get paid and technically it was an advance on his allowance for the next week. I’m glad the eight year old got her back pay she deserved it!", "NTA that’s a perfect lesson for life. Money you keep or money you pay someone to do something.", "NTA. I get the feeling your husband wants to be the nice dad that just fixes things to make everyone happy 100% of the time. While a nice idea, he’s not going to always be around to clean things up nicely throughout your kids whole lives. What happens at your son’s future jobs? What happens if he gets in trouble with a boss for not actually doing his work and giving it to other people with empty promises to do something else for them? What happens if he does this to his future spouse and they don’t tolerate it? Is he going to pay off people then? It’s also getting to the point where your son is very much aware that his dad was going to be the one to give him his way. This is going to keep happening over and over with anything he thinks he can get your husband to overrule. It will cause issues with all of your relationships. You and your husband, you and your children, your husband and your children and how your children get along. It’s going to keep being a problem if this is his brand of parenting. This 100% needs to be a serious conversation and not nit picking arguments.", "NTA but you don't really need us to tell ya that, do ya? You know he was being a brat and you called him on it, good for you! Dad needs to grow a pair unless he plans on having a spoiled monster teenager.", "NTA good life lesson because he was definitely manipulating the situation", "NTA - you're raising a good man and also your daughter seeing you do this will respect and strengthen your bond. Well done.", "NTA. If your husband caves in over this, he's teaching your son a very bad lesson. You're doing the right thing; it's not so much about the money (although $10 can be huge to a 10yo), it's about taking responsibility for your actions and keeping your word.\n\nYou're a good mom. Keep it up!", "NTA you've taught your son a good lesson here", "y'all be getting money for doing chores now?", "NTA. he’s gotta learn to pull his own weight", "Sooooo NTA. Your husband needs to put his grown up pants on and realize that this is more than just about $10. It’s about him tricking and taking advantage his sister into doing his chores and him still getting paid for it while she doesn’t. Your husband should definitely be on your side. This is a perfect lesson for him to learn - and apparently your narrow minded husband as well.", "NTA. Good parenting. Show kids their actions have consequences without actually negatively affecting their live in the long or even medium term. Well done.", "NTA, I would have done the same thing. He conned his little sister into doing his chores and then lied about their agreement. Cause and effect. Well done Op", "Nicely handled. Being fair to your daughter and teaching your son a lesson about lying. You need to tell your husband to back you on your discipline.", "NTA- yeah he’s a kid but he needs to learn the consequences of his actions. The consequence for not doing chores himself is no money. You can have a gentle talk with him about it, assuring him this is about his behavior not him (ie you still love him) but you’re standing firm on not paying him when he pawned his chores off on his sister and tricked her. Siblings will always occasionally be jerks to each other but when you talk to him, discuss why he tricked her and how he can be a better big brother in the future, seeing his sister as a friend not someone to pick on or exploit.", "NTA and you sound like a great mom!", "NTA but your husband is. You have to teach children empathy, he's doing the opposite and that's a problem, you don't allow a child to manipulate someone with no consequences. You also don't teach them they can get out of consequences if you cry because dad feels bad.", "NTA", "NTA your husband needs to race it so that he lied to his sister to get her to do his chores. Yes siblings do these things however there are consequences. Bet he won't do it again and I would ask before giving the money.", "NTA. He needs to learn that he doesn’t get to profit off of other hard work and he can’t lie in order to get people to do things for him.", "It's literally not even a punishment because he got 20 last week. Tbh your daughter should've gotten 30 this week since she did double chores last week and the chores this week. And your son should also get nothing next week. Give him some actual consequences for his actions. NTA", "NTA. And you're not being too hard on your son.\n\nYour son manipulated his little sister, made her do *his* work, and clearly thought he was very clever for coming up with this mean little scheme. One would think he would be ashamed - my brother was 3 years older than me, and he never did anything like this to me. In my experience older siblings want to protect the younger ones...\n\nAnyway, OP, you did the right thing. I don't really understand why your husband is taking your son's side in this, your son was clearly in the wrong.\n\nWhat I don't understand is why this whole situation festered for a week? I think one of the reasons your son went off like he did is this week he did do his chores as asked, so why is his money being taken away?!\n\n(I get why, I just think it might have been better to deal with this whole mess there and then... but that's not a cut at you, there are so many moving parts when it comes to parenting...)", "NTA! My mom probably would have done the same thing. If you don’t do the work you don’t get paid and that is a super important life lesson for him to have learned!", "NTA\n\nThis is a natural consequence. The gold standard in parenting. He didn't do his chores so he gets no money. She did double so she gets double.\n\nNatural consequences are great because the \"punishment\" isn't emotionally driven. It's just what happens. Dad needs a reality check.", "Mama of 4 here - I absolutely agree with you. Great job.\n\nNTA.", "NTA\n\nYour 11 year old shouldn't have done it AND I think it would be great to also teach your 8 year old how to deal with being taken advantage of, or what being taken advantage of looks like. Because there will be times in her life where people will try...and the earlier she learns what that looks like and how to react, the better.\n\n\"Next time someone does this, Susie, write up a contract and have them sign it!\"", "NTA. 11 is old enough to know right from wrong, including taking advantage of his sister. And if he doesn’t know the difference yet, this is an inexpensive lesson. \n\nIf your husband thinks this is about $10, he is more shortsighted than I would want in a partner raising children. Best of luck, OP!", "NTA\n\nYou're teaching him an important life lesson.", "Yes. Let them be kids. Not house-elves.", "I am sorry, you paid him for this week's chores last week, I don't see a problem. If this were my son then his paid chore days would be over; but I did grow up in a \"Room and Board\" household, if you wanted money you did Jobs, not chores.", "NTA does your husband always favor his son? I'm happy that you are sticking up for your daughter and giving a reasonable lesson to your son. A shame dad wants to reward the son for what he did.", "NTA i think this is exactly what you should have done. could have even gone further tbh", "NTA but a serious side eye to your husband. He sounds like a “boys will be boys” type of guy.", "So your husband is okay with your son, lying and scamming?\n\nGreat lesson to teach son.  OP=NTA", "NTA. He shouldnt be paid for not doing the work.  \nI would probably make him do a week of all the chores so his sister can catch a break too.   \n\n\nMy kids at that age were all doing their own laundry (wash and put away) as well as preparing food for the family one day a week. As I told my kids, if kids on the other side of the planet can make shoes and shirts they can certainly handle putting them in the washing machine and dryer.", "NTA…although why didn’t you take away the $10 instead of waiting for the next time?\n\nThat sort of showed him he could get away with it, if he was just sneakier next time…", "NTA. Good on you", "NTA. The only alternative I could think of would be sitting him down with your husband included and having a discussion with him about why what he did was wrong, and how he needs to be responsible and own up to his mistake. From there you could have him apologize to his sister and make him give her the original $10 himself. This way he doesn’t feel like he’s been unfairly refused money that he technically did work for that week— but he also doesn’t get to keep the money he DIDNT work for, and he learns a lesson about accountability in the process.", "NTA. He has to learn not to scam people. At the same time, maybe it would have a bigger impact on him if OP sat down with him and really talked about how his word has a value. He sets that value by his actions (or lack of), and the value drops fast if he doesn’t value it himself. If OP could make him hand those money over to his sister himself, wouldn’t the learning experience have been greater? But the husband doesn’t get it. This is an valuable lesson for the boy, much more than $10 worth. To skip it is to set him up for failure. \n\nPS I have three older brothers. They did sh** like this to me all the time when we were kids. I don’t think our parents ever found out as it was between us. They still turned out as outstanding, great guys, all of them. I guess they learned in other ways. Just wanted to say this as I see some people in here are judging his future a bit harsh", "Love all of the comments saying \"good on you for not raising a boy who thinks he can hand everything off to the women\"\n\nThey're kids, they're not adults who have an idea of politics or social norms or anything. They wake up, go to school, come home, do chores then act like kids. This was simply a sibling thing, NOT a gender-related thing, stop doing that to kids. \n\nYou're NTA but it's because you're teaching your CHILD that he can't make promises to SOMEONE for money then when that service is fulfilled your CHILD can NOT say \"sike\" and say it was just a favor. \n\nThis is an early example of real-life transactions, you promise to pay for services, you pay, you move on. You don't promise to pay for services, tell the other person to get lost and move on.", "NTA. You haven't even punished your son yet. All you did was force him to abide by his own agreement after he received the services. His current position is the one that he already agreed to. You still haven't actually punished him yet for LYING.\n\nYou should've given his sister the money he owed her (just resetting the situation to even), and then made your son do all of the chores for the week (his actual punishment for lying).", "NTA. Actions have consequences. Hire someone to do a chore for you? Gotta pay up.", "NTA\n\nI came here thinking you must have done something over the top and be told that you were absolutely TA. But no. All you’ve done is give the money that is rightfully your daughters. You’ve taught your son a valuable lesson in not taking advantage of people. All you did was right his wrong. You should not feel bad at all", "NTA. You’re right, husband is wrong. Your husband’s way won’t teach him anything", "He had a week off from doing his chores and had his sister take up the slack. What's worse, your son reneged on a deal. You aren't being too hard on him; if anything, you're keeping him honest. If there's a next time--provided swapping chores is allowed--he'll know better. NTA.", "NTA \n\nHe’s being a jerk to his sister. She did the work, she deserves the money.", "NAT. Honestly, this seems pretty fair. Now he knows what it feels like to be in his sister's situation. 11 is old enough to know that he did wrong, and to suffer the consequences.", "Have him tell your daughter why it was ok for her brother to lie to her and take money for work she did.", "Not the way I thought this was going to go. NTA", "NTA. Parenting win for you! When we misbehave, there are consequences. Your husband is wrong. You guys need to get on the same page when it comes to punishment. A united front is important. Good luck!", "NTA, charge him interest too and a fine for fraud.\n\nThat's what will happen in the real world when he is caught and ask your husband why he didn't intervene when the 8yr old was conned.", "NTA. First off you need a united front. That he went crying to dad is a big problem. Not only is your solution fair, there should be consequences for lying, scamming, manipulating and making false promises.", "NTA", "NTA but your husband clearly is, like father like son is coming into mind. You daughter worked extra hard probably thinking about something nice she could buy with the money only to be cheated. Had you not taught your son a lesson you would be guilty of teaching your daughter its okay to be used by people and that she should just take it, shut up and not complain. Its 2023 not 1923, the time of women only do the house work is over.", "NTA\nI would go ahead and give him the $10 AND make him do his sister's chores in addition to his for the week.", "Their dad was raised by a single mom or a weak father figure", "What your son did is called bullying and you did the right thing teaching him a lesson. I have no idea what your husband is thinking. \n\nNTA", "NTA\n\nHe surely can survive the \"trauma\" of not getting $10 for lying", "NTA - Why on Earth does your husband think you should reward the child who lied and manipulated his sister into doing his work then stiffed her on the pay?? He's certainly the asshole here.", "ABSOLUTELY NTA.\n\nHow would your husband feel working for a friend all weekend for promised pay then get shafted? That's what he's saying is okay for not only his son to do to others, but that it's acceptable period!\nUnfortunately the boy made a promise, then lied about it, he should be held accountable, not be given rewards out of pity.\nShe did the work, she should be paid for it.\nYou SHOULD have corrected it immediately instead of doing it on the next payout, or as soon as you found out about it. But stand your ground, because it's not okay to lie, steal, or cheat. And that's what he did :(", "NTA. \n\nIf you want your son to be a spoiled, entitled, garbage-can-version of an adult that no one wants to deal with, go ahead and listen to the hubby. If you don't want that, hold your ground here. \n\nSometimes you can be parents and friends. Sometimes you have to be parents. Letting your son lie and intentionally manipulate his younger sister would be setting an awful precedence that will only lead to more manipulation and bad behavior in the future – especially in regards to how he treats women and people that he may feel authority over. \n\nYour husband needs to support you. You should be in this parenting thing together. Also, you're in the right. If he can't believe his little golden boy would do that to his sister, well, you're in for a world of hurt later. If his father succeeds in making you change your mind or goes behind your back to support your son instead of you, it's quite likely your son will feel like he won and it's okay to act that way – and I would definitely worry that there would be a gender component to that bad lesson too.", "NTA good job for not allowing your don to get away with lying and manipulation.", "NTA, it's better he learns in small case that he has to keep his end of a deal. He promised her the money, he has to pay.", "NTA. You taught your 11 year old an excellent lesson about integrity. The only suggestion I’d make is that you should have made the 11 cough up the $10 immediately. Especially when dealing with young children, linking consequences to behaviors more immediately tends to help then learn the lesson faster.", "NTA you're right to nip this behavior in the bud now. You don't want to raise a kid who thinks it's ok to scam others and take advantage of them.", "NTA! \n\nThis is what it looks like holding boys accountable so they won’t grow up with the incorrect notion that offloading labor onto girls/women is ok.", "Can’t make a good deal with a bad guy. Your son was the bad guy in this, he should not get $, and in fact….should do his and his sister’s’ chores one week as a favor to her for being a liar and a cheat and then explain to everybody how shitty the tasks done as a favor for nothing in return made him feel.  Your husband needs a spanking for being a promoter for misogynists.", "NTA, good job!", "NTA: That’s a fair way of dealing with it.", "NTA.  Thank you for teaching your son that chores are everyone family member's responsibility.  Why does your husband think your son should be able to get your daughter to do his chores for free?", "Nta. That is not too harsh.", "NTA\n\nShe did the work and she deserves the money.\n\nIt's fine if they want to make these kinds of agreements but they both need to have the integrity to honor them.", "My older brothers played this exact trick on me. My dad didn't believe me. I was 4 years old. Never forgot it. And I didn't fall for the trick again.  NTA. I wish my parents had listened.", "NTA. Please don't let your husband pressure you, your son needs to learn this lesson. It's not that he got his sister to do the chores, it's that he got greedy and didn't want pay her. He can't go through life doing things like that, and he can't always go crying to Dad either. \n\nI will say that this post did make me laugh though...LOL Good luck!", "NTA\n\nHe needs to learn that he cannot lie and take advantage of other people. If he wants someone to clean for him as an adult, he'll have to pay a cleaner.", "NTA. Kid's gotta learn that if you call the tune, you pay the piper.", "Smart move. Son needs to understand actions have consequences.", "OP you are both. For this situation you are not ah and acted correctly. \nBut why are you paying them to do the chores? What are they learning from it? The power of money? \nShould it be better for them to learn that you do have chores and won’t get paid for them as adult? You just do them as they are your responsibility? \nYou created the problem without “money” involved you daughter would not be doing it and your son would not deceive her. His chores would be done by him or not, but you would know it. \nYour daughter clearly learnt the value of money, but none of them learn responsibility.", "NTA, little boy effed around and found out. Good time for him to learn that he shouldn't go through life trying to take advantage of people. Good on you!", "NTA - And don’t give in!!  \n\nI was a single mom and let my father convince me that the chores I had my son doing (around 10) were “too hard” and he shouldn’t work “for free” so thats why he didn’t do them.  Ok, understood so he got softball chores with an added bonus of an allowance, and those were always completed half-assed or subbed out to his sister… now he’s a very lazy 17 yr old who doesn’t do anything unless he’s paid.  His future roommates are going to have major beef with him.\n\nAnd before anyone comes for me: I’ve battled this for years but my parents undermined my authority, challenged my decisions, and meddled constantly.  When theres cell phones for direct communication around me, then it makes the situation very difficult.  I work full time and raise another child too so fighting everyone endlessly isn’t possible.", "NTA. I would give your daughter another 20 next week to make sure you son understands that snitching we lead to bad outcomes.", "NTA but I slightly disagree with how you handled it. Personally I would’ve confiscated the 11y/o money the very week he exploited his sister to show that the money wasn’t earned. Then made him go a couple weeks with no allowance as punishment. 11 years is old enough to know that was wrong and letting him keep that money was probably sending a wrong message", "NTA. It's the principle. If he were paying her part of his money to do his chores that would be smartish. He's just trying to hustle and that ain't cool.", "NTA. But your husband is one if he doesn't understand why your son should live up to his word. This has nothing to do with sexism. Is has to do with your son being a lying brat. I am sure he would just as happily try to cheat a brother with the same trick. \n\nIf your son had kept his word I have no problem with him paying his sister to do his chores. That is learning negotiation skills and they would each benefit. \n\nIs your husband always so unethical?", "NTA- is your hubby cool with your son lying and scamming people?", "NTA- I'd be interested to hear what your husband thinks is a fair solution.", "NTA - the money is for the chores, not entitled to, earned, and your reaction was teaching values - not just the value of earning your money, but also respect for others, especially his sibling. \n\nIf Disney dad doesn’t like it, tell him he is welcome to do your sons chores on his behalf", "NTA, but how come nobody noticed daughter was doing the dishes for a week? I mean, parents must be around? Find it hard to believe it only came out because daughter was crying when she didn't get the money after the whole week.", "aw", "YTA for tying allowance with chores. \n\nHousehold chores are not something to be paid for, they are something that we all do to live in a home that is clean, organized, and runs efficiently. They are what we all do when living either by ourselves or with other people. \n\nAllowance is money you give your kids for either going above and beyond regular chores, or as spending money kids can do with what they will.", "NTA. The fuck? This is simple as it gets.", "First of all, NTA. I think it’s a good lesson.\nBut I don’t think that this is an; “it’s only downhill from here” case.\nI agree with the people saying that others need to calm down.\nLet’s not regulate this child to the role of “future wife beater” or whatever.\nMom sounds like she’s working on raising him to be a sensitive and capable young man.", "Definitely NTA.  Don't do the work?  Don't get the mons, hons.", "NTA - Not a budding misogynist, but that was shady!  He made a deal then backed out when it was time to pay up. If he’s old enough to scheme like that, he’s old enough to face the consequences.", "ESH You should have made your son give the money to his sister. Unless he is forced to abide by his agreement, he doesn't learn his lesson. Your husband is insane for thinking his son should be rewarded for cheating his own sister.", "NTA. My 10 yr old tried this BS with my 7 yr old. Not ony watch tiny monster.", "NTA\n\nDoes your husband do chores around the house? \n\nIf he doesn’t, your son will keep resisting to do his as he grows up, because his male reference doesn’t have to do them. \n\nCongrats on being fair to your kids, I would die in this hill to show my son responsibility and accountability and my daughter that she is worth the same and to demand fair treatment as an adult.", "1. NTA\n\n2. What is wrong with your husband?", "NTA. You’re trying to teach your children at an early age that actions have consequences as does breaking one’s word. You’re a hero and your husband is the A H for trying to undermine you.", "You are definitely NTA, but boy oh boy, your husband is!  He's actually saying it's ok for your 11 year old to scam your 8 year old of out 10 bucks AND dump his chores off on his younger sibling.  What a great lesson, dad!", "NTA. He owed his sister that $10, you just didnt give him a choice in paying her back. You're husband is right, thats only $10, thats a pretty inexpensive lesson right there.", "NTA you didn't even give him any punishment, all he got was the consequence of his own actions(which is recommended parenting). It's not too harsh at all.", "NTA. But ask your husband why he's ok with your son lying to and manipulating your daughter.", "NTA. Ask your husband what kind of son he wants to raise? Right now he's signaling that it is ok to lie to your family member, then lie again to cover it up, and to go to daddy to fix it when he doesn't get his way.\n\n11 is more than old enough to learn this is not acceptable behaviour.", "NTA", "NTA", "NTA - I don't think that's harsh at all. It's not even a punishment, just holding him accountable to his word. If I had done something like that as a kid, I would have been doing double chores and still lost the money.", "NTA but he's definitely got the right mentality to become Jeff Bezos 2.0 lol", "NTA. you thought of the perfect solution", "NTA\n\nThis is exactly how you should have handled this. He made a fair deal with his sister. She fulfilled her end of the deal. He tried to renege on his end. You made him uphold his word. Absolutely nothing about this was you being too hard on your son. \n\nYour husband though, he’s an AH who is trying to teach both of your kids that girls and women can be dumped on and lied to and that it’s perfectly fine to go back on their promises and agreements. He’s also showing your daughter that she can’t trust him to protect her.", "NTA - Your teaching him to not be a con artist!", "NTA,.natural and appropriate consequence imo.", "NTA. She did both of the tasks, she gets all of the money. Your son thought that he could use his 3 year advantage to be lazy and trick her into doing his work. Yes, it's $10, which is enough to be a valuable lesson for both of your children going forward.", "Absolutely NTA.\n\nIf she said he offered her $10 and he said no, she was doing him a favor, sounds like someone is lying. If it’s him, then that’s even more reason why he needs to have consequences. If it’s her, she needs to learn not to do things for someone and then expect something in return without discussion \n\nIf he makes an agreement then he needs to follow through on what they agreed. This is where they learn how important it is to 1. How important it is to keep your work and 2. Not make agreements you’re not willing to follow through on. \n\nNever too early to start learning those lessons. When my kids make those deals they are expected to follow through!", "NTA. Your husband though- MAJOR AH. \nI respect you standing up for your daughter and also keeping your son grounded.", "NTA!  Speaking as a little sister who used to do her big brother's chores ALL the time, THANK YOU FOR BEING A REAL PARENT! \n\nSure, $10 may not *seem* like a big deal, but it is the principle of the matter! He told his sister that she would be paid for doing his chore but he backed out in the end to keep his money.  That's BS and it is better to nip that habit in the bud before it becomes a personality trait.  \n\nWay to go mamma! You did great!  (If your husband is still salty about this matter, tell him he can start doing the chores then lol!)", "NTA\n\nYou did the right thing here.  The issue isn't that he didn't do the chores, but that he swindled his sister.  I guess you could have also just made him to all the chores the second week to even the score, but both are acceptable.\n\nAsk your husband if he thinks it is okay for your son to swindle people especially women or family?\n\nYour husband is being a bit of an AH here.", "NTA, it's just a $10 punishment, it's fair", "NTA, this is about your son being manipulative, lazy, and greedy, not good traits in an adult and it should be nipped in the bud now before he becomes a teenager and becomes even worse.", "My only issue is that you did this deceptively. You should have told your son upfront that you were going to do that. Trust is important. \n\nYou made the right decision to pay your daughter what she was owed out of your son's allowance.", "This is what we like to call 'a lesson.'  NTA, good job, and your husband is nuts.", "NTA\nYour son is at an age where he can understand that he can’t just pawn off his work on to others. Plus later in life he won’t get paid to do his share of the house work. As I’ve seen others comment on here, don’t reward bad behavior!", "NTA, you're holding him accountable for his words, and his not taking care of his responsibility.   He's not too young to learn these things.", "NTA. You’re not being too hard on your son, you are appropriately punishing him for lying and taking advantage of his sister! You are teaching him that there are consequences for treating others badly. \n\nDid your husband suggest any other punishment for your son’s actions? Or did he think that your son did nothing wrong?", "NTA, but that’s already pretty clear.\n\nWhat I’m worried about is what your husband is teaching your children. I hope you two can communicate on this and he quits this “Disneyland Daddy” nonsense so you two can become a unified parenting party versus good-guy bad-guy. This is not healthy for your kids, and god forbid if another incident like this happens again where Daddy opts out of proper parenting. Nothing I’m sure you don’t already know but I’d be interested in hearing if this ends up turning out well and you can successfully speak with him privately about how this is affecting your kids. There can be good but not without discipline\n\nProps to you for standing your ground. Don’t let this divide your family", "NTA - And honestly, at the end of the day, regardless of whether the son agreed to give her the money for doing his chores or not, if she did ALL the chores, she should get the money regardless. She did the work, so she should get the pay.", "NTA- he needs to learn that lying and taking advantage of someone more vulnerable will not pay off and is a really mean thing to do.", "Perfect perspective. NTA.", "I don't think the consequences were handled appropriately. It shouldn't have been a surprise to a kid to not get paid by the parent-it's inconsistent. Should have made the son do all the chores for only $10, or talk to him ahead of time. The surprise drop on payday isn't just \"consequences\" in a he said she said between siblings, it's another abuse of trust in the family (the first potentially being the scam between siblings)   \n   \nEdit:   \nPeople, she's NAH with the husband, but the punishment itself shouldn't include lying by omission to an 11yo", "Yeah, you have to help direct this scamminess, so it will be a force for good!", "> NTA- He’s gotta learn. If he’s old enough to come up with this scam he’s old enough to get the consequences\n\nDo we *know* for a fact he scammed the 8 year old? He may just have asked her to do it. \n\nI still think he shouldn't get the money, you do the work -> you get the money, but I'm not sure if he's being a scheming little scammer either (he probably is, I'm just not certain) and were I OP I'd be framing it more as \"She did the work, she gets the money\" and less as \"You're a lying scammer\".", ">I think it was a perfect solution.\n\nI think it's too lenient. It balances the pay, but it doesn't balance the being a shitty asshole part that 11M pulled.\n\nOp NTA", "It's only perfect if you don't think there should be a consequence to the dishonesty. Mum enforced the deal the son proposed, but he got away from the scamming scot free. Personally i'd make sister whole and might withhold another weeks money as a consequence of attempting to scam a family member. Of course this requires one to be sure of the brother -sister deal.", "ThAt BoYs WiLl Be BoYs", "I completely agree with this. Your son needs to learn that what he did was not right. Still, I think you should talk with your son so he knows that what you have done is to give her sister what is due to her. He has to understand this while he is still young so he does not grow up as an adult and go cheating on other people.\n\nAlso, discuss this with your husband too. You need to be seen as a united front so son doesn't learn to go to dad everytime he messes up so he doesn't have to face the consequences.", "Right. Letting him get away with swindling his sister out of the money she was promised for doing his portion of the work teaches him that he is entitled to behave that way without consequences in the future. That’s not a precedent that you want to set with a kid, because the real world simply doesn’t work that way. \n\nIf he wants to make money, he has to do the work and earn it himself. Tricking people into doing work for him without fairly compensating them simply doesn’t fly. Does OP’s husband want his son to grow up to be an entitled adult with poor character? Because that’s what being soft on him with stuff like this has the potential to do in the long run.", "This is the angle they need to go with this for sure-", "This right here!", "How else is he going to learn that he can't exploit his younger sister or not fulfill his part of a deal?", "NTA It's not about $10. It's about integrity. He lied to his sister and manipulated her for his own benefit. He absolutely has to learn that can't be allowed to happen. If I were the parent, I'd give 8f a month off chores while 11m has to do them all and they both still get their $10.\n\nYou're never too young to learn about FAFO.", "Let's be clear:  this boy isn't going to stop with manipulating women this way.  It will extend to EVERYONE in his life:  women, men, pets.   Your husband is enabling this behavior.  I would never have cheated my sister this way and he should learn this kind of horrible behavior has consequences.  NTA at all.   Your husband, though, get a big YTA.   Watch your son and husband.  They'll teach your daughter to grow up thinking being used by others is okay.  \n\n\nEdit:  Editing because people think I'm sounding draconian.  I am not saying that this kid is Dr. Evil or anything like this, but a proportionate punishment would be required  and the father doesn't seem to think that one is worthy at all.", "It’s about accountability and it’s never too early to teach kids these lessons. NTA, your husband is though", "Completely agree OP is doing the right thing here but it's a bit weird you are turning this into some patriarch issue. I think this scenario would have played out the same if the 11 year old had a little a brother instead of a sister. I don't think there's anything here to suggest the brother is taking advantage of his sister because she's a girl, but rather because she's the younger sibling.", "The first one already came out doing it about machismo hahaha, they are children, it's simple, he saw how to cheat the system and he tried, he didn't do it because he thinks his sister is less for being a woman, OP's punishment is deserved but stop looking for ghosts where there is no", "Exactly!! Plus, he got the $10 the week before, and didn't do the work, nor pay it to his sister.  No work, no pay.  \nNTA indeed!!", "It’s not about handing it off to women specifically. If his little sister was a little brother instead he would’ve done the same thing. It’s not unheard of for older siblings try to make deals with the younger siblings, regardless of gender.", " You realize it would have been the same if the 8yo was a little brother.\nEither way NTA", "Jesus what is with you people?? This is an 11-year old kid trying to scam their younger sibling and get out of work, this has nothing to do with gender, sex, or sexism!", "yes. this. NTA.", "I don't know that it is a gender thing.\n\nWent through the same thing when I was a kid and we're all boys.\n\nFell for it once and lesson learned. Payment upfront or GTFO.", "This- this isn't about gender", "Weird to project your insecurities on an 11 year old boy but okay", "Exactly- my grandmother does this still and we’re 20. I go over there and do jobs for her (she insists on paying me and I don’t feel like fighting her because it will be a 40 minute thing) and she’ll send me home with $30 for my 3 hours of work and $20 for my brother.. who was at home playing video games. 💀", "Exactly, this is being so fair to an extent that there is barely any lesson being taught to the son. The fact that your son thinks he should get another $10 and that your husband agrees is not only wrong but moving the goal posts way off the field.", "OP wrote in another comment that son spent it before OP found out.", "Your idea is sound in principal, but OPs husband doesn't want to punish the son for doing something wrong. OP wants to punish the son for doing something wrong. Arguing the type of punishment is one thing. The difference between punishment and no punishment is way different IMO", "Not every disciplinary action needs to be discussed with a spouse. \"You didn't do your chores, so you don't get your allowance\" is the sort of *extremely obvious and reasonable* piece of discipline that doesn't require a full on sit down conversation prior to enacting.\n\nParents need to have leeway to operate when the other parent is around.\n\nNow, if the kid was going to be punished more severely, over an extended period of time? Sure. But we're talking about ten bucks. No one needs to make a stink over this. \n\nIt's like quibbling about a fifteen minute time out. We don't need to summon a jury to evaluate it.", "What? So your judgement should be NTA", "What does that have to do with anything? We're not here to judge chore strategies. Someone isn't an asshole because you *personally* disagree with how we dole out allowance.", "Yeah mf, I'm sure the kid is gonna learn if you give him the bare minimum consequences. Harsher you are the better, it will prevent kids from doing it again. \n\nThey won't be kids forever, might as well teach them lessons now, than have them do shit like that when they're adults and face more serious consequences.", "But only for his son", "I'm sorry that you're going to be forced to be the \"bad guy\" because you actually want to correct problematic behavior.", "what does that mean?", "Pay him for what, exactly? Lies to you, or the lies to his sister?  NTA.", "I hate to quote Dr. Phil, but “We don’t reward bad behaviour “ is one I used on my son . Actions have consequences. You’re teaching your boy right . NTA OP!", "Pay him for what? He already got paid for this week’s work last week.", "There are different schools of thought on this, but I think the root of the problem is that the allowance is tied to chores.  If you do that, then children only do chores when they are motivated to earn some money and they may refuse to do anything chore-like if money is not promised.\n\nIf you disconnect allowance and chores, then the chores become something a person just has to do as a member of the family.  Sometimes they need to do more, sometimes less, but it is expected.  Not pulling your weight should have natural consequences (e.g. no screen time until chores completed), just not tied to the allowance.", "Shoot, you're right! He lied and scammed. There was no punishment for that.", "$10 says OP’s husband has uttered this exact sentence to excuse his son’s behavior at least once.", "The only AH here is OPs husband. Nice message he’s sending his daughter: you get to do all the work and your brother STILL gets the same amount of money you do AND promises don’t mean a thing.  Geeze I wonder where 11YO learned to act this way. Her problem isn’t the kid, OF COURSE he won’t want to lose out on the money. But he needs to learn to keep his word and not foist work off on others if you won’t reimburse the person for the work. Her real problem is the unsupportive hubby. NTA but boy howdy does OP need to have a serious talk with her husband", "[removed]", "I concur. NTA.", "Plus, these chores are also not just about the money. Chores are about being part of a family and contributing to the running of that family and caring about the home. And also learning HOW to do those things. If son is always pawning off his chores to his sister, EVEN IF HE ALWAYS PAYS HER, he is NOT being part of the family unit.", "Alright, I’m a card carrying feminist but this is kind of a lot. He’s an 11 year old kid who wanted to get out of doing chores, I don’t think he’s getting off on “manipulating women.”\n\nEdit: To be clear, I think it’s worth a chat to say “Hey, it’s important that everybody helps out around the house regardless of if they’re a boy, girl, or other. I want you to learn these things so you can succeed as an adult.” But I feel like there’s no way it’s good for a young boy’s development to be like “hey you little sicko, you think tricking women is cool????” Just feels like a one way ticket to inceldom. I’m sure this young man will grow up to be a fine adult, especially since OP is obviously committed to raising him and his sister right.", "Redditors trying not to jump to the most insane conclusions for 10 seconds:", "Are we calling little kids woman hating incels and misogynists for attempting to pawn off the chores to their younger siblings?\n\n\n> Let's be clear: this boy isn't going to stop with manipulating women this way. It will extend to EVERYONE in his life: women, men, pets. \n\nLet’s make broad sweeping generalisations (heading into borderline criminal territory) about a 11 year old kid’s entire future trajectory. I’m not even religious but Jesus Christ.\n\nYou need to stop projecting your unresolved issues on kids and get some therapy.", "Well that escalated quickly\n\nMy sister and I would have absolutely done this to each other growing up. We didn't get an allowance for chores. But we totally tried to trick each other into doing the others chores. We also tried to cheat each other out of chocolates. And guess what neither of us turned into evil manipulating people.", "He's an 11 year old who tricked his sister into doing his chores\n\nYou saying he's manipulating women and will manipulate women his entire life is a big fucking stretch 🤣", "you need to go outside", "I don’t know, kids try to get away with a lot at that age. He needs to learn the lesson but I wouldn’t exactly claim he’s not going to stop being manipulative.", "Please pull back on the hyperbole a little. Not every older child who mistreats/cheats their younger siblings is going to grow up to be a misogynist/misandrist. \n\nYou are chronically online if you believe otherwise.", "Way too overboard of analysis just for an 11 year old being a little shit.", "Yes and no…it may happen the same way if the genders are reversed, but where the patriarchy issue comes in is with what the parents do not what the children do. If he got away with it, this could be the first in a long lesson of learning how to push responsibility off on others.", "I think some are misinterpreting my comment - it's not that the kid was being intentionally sexist, it's that if the parents had declined to teach him a lesson about this issue, the lesson the kid would've taken away is that he can pin his work on his sister. Lessons like that become unconscious bias down the line if not handled early on.\r  \n\r  \nI'm more saying that the parents need to look at this with that worldview in ensuring that they address the concern, not that the kid was intentionally picking out a woman to dump on.", "I think some are misinterpreting my comment - it's not that the kid was being intentionally sexist, it's that if the parents had declined to teach him a lesson about this issue, the lesson the kid would've taken away is that he can pin his work on his sister. Lessons like that become unconscious bias down the line if not handled early on.\r  \n\r  \nI'm more saying that the parents need to look at this with that worldview in ensuring that they address the concern, not that the kid was intentionally picking out a woman to dump on.", "I think some are misinterpreting my comment - it's not that the kid was being intentionally sexist, it's that if the parents had declined to teach him a lesson about this issue, the lesson the kid would've taken away is that he can pin his work on his sister. Lessons like that become unconscious bias down the line if not handled early on.\r  \n\r  \nI'm more saying that the parents need to look at this with that worldview in ensuring that they address the concern, not that the kid was intentionally picking out a woman to dump on.", "Ahhh- so you garnished his check. (I can’t think of the exact term but close enough) Good work, that’s exactly what happens when you don’t have the means to pay your debts haha", "How could your husband possibly believe that your daughter did all the chores as a favor? As Judge Judy says, if it doesn’t make sense it’s not true. This is a red flag, does your husband always favor your son like that?\n\nPaying your son anyway and giving your daughter extra because of son’s shenanigans sends a terrible message, that son can get away with lying and stealing and face no consequences.", "I cannot believe your husband thinks an 8 year old girl would just take on her brothers chores as a favor for no reason. I mean sure, if 11 was sick, injured or had a thing to do with friends and asked his sis nicely, sure. But for her to do them all week? For nothing? Heck no. And, even if he did ask her as a favor, that's BS too because 11 would be getting out of chores just bc 8 is too nice to say no or whatever.", "All this will do is teach your son that he gets $10 per week whether or not he’s doing his agreed upon chores!", "I kinda wanna call his \"favor\" bullshit out. Son can get paid only IF he does his sister's chores for the week. See how quickly he changes his tune.", "Wow your husband needs to get a grip. NTA", "NTA-- what's going on with this father? of course the daughter wasn't just doing her big brother a favour for nothing (why?). The big brother was scamming her, hurting her, cheating her. That is so obvious. Why is the father defending the son's cheating?", "Did you not notice that your daughter was doing all of the chores?", "He wouldn’t get paid at work if he didn’t do his job. You’re just setting him up for the real world", "Kids lie. I can’t think of one logical reason why your daughter would volunteer to do both sets of chores. Your son might have presented this deal in a confusing way but he knew that she expected payment.\n\nIf your husband wants to pay your son (I don’t think he should) then come up with $10 more work for your son to do… any leaves need raking?\n\nIt’s only a week of missed money which will have little to no impact on his life. It can be on the person doing  the services to explain their terms but it is also on the person getting the services to understand the cost. e.g if you let someone pave your driveway without agreeing to a price, a court would still rule that you owe something, it doesn’t default to free.", "You should argue back that since your daughter was doing him a favor he got paid for work he did not do and therefore was in the hole $10\n\nNTA", "It's not about remembering, it's the emotional reaction to having an immediate consequence Vs getting away with it and then later having a consequence. It doesn't work as well to help him learn. And it doesn't help the daughter trust she will have things solved for her in a timely manner.", "Then the sister should have been given $10 immediately and the son told he would get no money at the end of the week.", "But compromise should have been discussed and explored beforehand. We only know that he thinks the punishment was harsh after the matter. They may have been able to agree on a punishment if they discussed it beforehand, which there is no sign of happening. It was one parent deciding they new best, and going with it. Justify it all you want, but this parenting decision was completely one-sided. The husband was still not treated properly in this situation. He was not treated as an equal parent.", "You shouldn't lie by omission for an 11yo punishment.", "The mother being the default parent who handles all the less fun tasks of parenting (including discipline) while the dad “contributes” by playing with the kids is too common. \n\nAt a certain point, regardless of what trauma may or may not have occurred, a parent has the responsibility to behave like a parent, not a visiting uncle.", "A disney dad refers to a father who leaves all the actual care tasks that come with children (replacing outgrown clothes/shoes, feeding them, researching what is needed for their next developmental phase, arranging childcare, handling school responsibilities, bathing, putting them to bed, teaching them necessary skills, doctor/dentist/eye appointments, clean clothes and bedding, discipline, packing up needed items for outings, etc) to be solely the mother’s responsibility and instead only participates in the fun parts like playing with the kids.", "Eh, I’m sure Dr. Phil wasn’t the first person to come up with that one!", "Dr.Phil would probably send the kid to wildernis theraphy.", "Op mentioned that he's a Disneyland daddy. He just doesn't want to see the 11 year old suffer. I mean he should but I see where the dad is coming from", "[removed]", "Yea I strongly suspect he'd have tried this irrespective of having a little sister or a little brother.", "That’s what I was thinking. It’s one sibling tricking another sibling. Would everyone be just as outraged if the 8 year old was a boy too?\n\nNot everything requires to rally the rioters.", "Right? Boy just didn't want to do chores and sister wanted to make some extra cash. Shitty he lied about it (allegedly) to pocket the cash. I'd bump up my daugher's pay to $15 ($25 including bro's chores) just to make an example of her willingness to step up and do more work for the reward. Good work ethic can be hard to teach.\n\nNow show me the plot twist where little sister actually got paid by her brother and is just conning the parents.", "Thank you lol. Everyone is jumping on the wagon of \"young boy is taught early to exploit women\". Like, they're just KIDS. I did this to my little brother when I was younger, my older cousin did this to me when I was even younger. \n\nThis is literally just kids learning about responsibility and respectfulness, this has nothing to do with gender of any kind and anyone who is making it out like that are completely missing the point of the story.", "Agreed. Kids will do lots of stuff to get out of their chores but still avoid the consequences. While it *could* be misogyny, it's kind of over the top to say that's it at this point.\n\nTo me it sounds more like a husband who just is lazy and doesn't want to deal with disciplining his kid and a kid who's just doing normal (but still bad and worthy of some discipline and consequences) kid stuff. There *could* be some misogyny there, but that's a huge assumption to make.", "AITA comments so often assume much more than they should. I feel like I’m taking crazy pills sometimes when I read the comments here.", "I would normally agree with you but the fact that the dad is on the son's side is what's throwing up red flags to me.", "It doesn't start as 'manipulating women' but i come from a fairly equal chores house too, my brother started asking me to do his chores very politely and sometimes for favours when i was 7-8 (like allowing me to hang out with him with his friends, offering me time on his PC). My mother put a stop to it when he started doing the same to mom ( asking very politely as if he just can't do it himself, i would jump to help my big brother out and my mother would stop me) It is manipulation and it is sexist even though he is not fully aware of it.", "I think some are misinterpreting my comment - it's not that the kid was being intentionally sexist, it's that if the parents had declined to teach him a lesson about this issue, the lesson the kid would've taken away is that he can pin his work on his sister. Lessons like that become unconscious bias down the line if not handled early on. \n\nI'm more saying that the parents need to look at this with that worldview in ensuring that they address the concern, not that the kid was intentionally picking out a woman to dump on.", "Doesn't matter what age. A boy who mistreats a female is going to grow up to be a misogynist, regardless of intention, according to this subreddit. 🙄\n\nMy older sister forced me to babysit the children she got paid to watch when we were kids/pre teens. I never receieved a dime for helping. Lo and behold, she didn't grow up to be a misandrist.", "Homie jumped off the cliff headfirst for this comment", "Kids do pull a lot of crap on each other. It is then the parents' job to teach them why this is wrong. And to learn that there are consequences for bad behaviour. \n\nOP is a good mother.", "I think some are misinterpreting my comment - it's not that the kid was being intentionally sexist, it's that if the parents had declined to teach him a lesson about this issue, the lesson the kid would've taken away is that he can pin his work on his sister. Lessons like that become unconscious bias down the line if not handled early on.\r  \n\r  \nI'm more saying that the parents need to look at this with that worldview in ensuring that they address the concern, not that the kid was intentionally picking out a woman to dump on.", "He's 11.  He stole from  his sister by lying to her and his parents about his responsibilities.  And his father seems to encourage this behavior.   It doesn't seem like a one off.", "I'm not so much worried about him.  I'm worried about his dad seeing this as not worthy of consequences.", "Precisely. It's not about what the kid did, it's about the parents response and how that translates to future behavior down the line.", ">If he got away with it, this could be the first in a long lesson of learning how to push responsibility off on others.\n\nYes, I agree that this is the exact thing you are trying to prevent. But this has nothing to do with gender or the patriarchy. Even in your own quote above, you use the term \"others\" and not women or girls because this isn't a lesson in how to treat girls with respect. It's a lesson in how to treat all people with respect.", "He picked his _sibling_, it had nothing to do with her being a woman, you're assuming that if this behavior wasn't punished, he would go on to do this with the _women_ in his life, and not the _people_ in general", "Exactly! There is no reason for him to not do it again. Sure, his sister gets 20, but he still gets 10. The only one being screwed over is the sister, because she may get more money in absolute numbers, but the workload also became twice as much for no increase in pay, while brother has no workload anymore, but doesn't get a paycut. If anything sister should get the salary promotion she deserves for doing all the work. I suggest giving son 0 and daughter 30 for showing she is reliable and a hard worker.", "Do your want op to time travel and warn her past self?", "Timely manner? Lol I gotta disagree. An emotional reaction would be handing down a severe punishment immediately rather than rationally. Son knows he did something wrong and learns a lesson. Daughter got scammed and it was remedied. This whole one week passing thing is pretty inconsequential to the lesson learned.", "OPs husband wants to give the son $10 and give the daughter $20 because the son told his dad it wasn't fair that he got $0. I don't know if you have kids, but it doesn't sound like you have kids. You seem to think it's the husband/son vs the mom, when it should always be the husband/wife vs the kids. That's how a united front works, and that includes when one parent does something the other parent would have done differently.", "HYFR!", "I do the accent, too.", "An 11 year old isn't suffering because they didn't get $10. Especially when Dad buys him everything he wants.", "So only the daughter should suffer. Got it.", "Like if the kid said “well she’s a girl so she has to clean!” that would ring some alarm bells. But it seems like he’s just being a snarky little preteen. Who among us wasn’t!", "When I was little my sister would trick me into giving her money by trading pennies for quarters. She’d give me two pennies for each quarter because “two is more than one” and I hadn’t learned about money yet. Exploiting your younger sibling is just a sibling thing to do, but I think it’s great OP is trying to nip that in the bud because the sibling will keep doing that until the younger sibling wises up, someone intervenes, or they potentially mature and gain a bit of empathy which isn’t guaranteed.", "I think the other dynamic is that the mom is on the daughter’s side and the dad thinks the son’s behavior is fine, but even with those parallels this is not necessarily misogyny.", "I think some are misinterpreting my comment - it's not that the kid was being intentionally sexist, it's that if the parents had declined to teach him a lesson about this issue, the lesson the kid would've taken away is that he can pin his work on his sister. Lessons like that become unconscious bias down the line if not handled early on.\r  \n\r  \nI'm more saying that the parents need to look at this with that worldview in ensuring that they address the concern, not that the kid was intentionally picking out a woman to dump on.", "The Dad isn’t right at all, but I don’t think it’s a sure fire sign he’s going to grow up to be a manipulative asshole.", "Eh, not to invalidate your experience, but this is literally what older siblings do regardless of gender. I used to do this to my little brother and my oldest son does this to his younger brother. It’s more about age/power dynamics than sex/gender.", "Is it sexist if he (the OP’s kid) would’ve done it irrespective of the gender of the sibling? You are projecting your own situations into an unrelated conflict.", "Maybe but sometimes it just takes the kid to get caught doing something. I’d suggest OP keeps an eye out but Reddit may be adding more than it is.", "It is a patriarchy and gender issue. Boys are more likely to get away with this behavior and the “others” in question are usually girls and women. Girls are taught the be respectful and considerate to a fault while boys often don’t get the same lessons.", "I don't think that's how AITA works...", "Agree to disagree. I know as an adult I would hate for a week to pass before my stolen money came back, and it would feel less fair if I thought I got away with a warning if I had done something wrong and a consequence came later.", "I agree on the united front part. That's also why I said he was forced into the agreement. Because he has to put on the united front, even if it's not about something he agrees with. I understand that there are going to be differences. I understand that any disagreement need to be behind closed doors. I'm saying that the disagreement should have been addressed before the punishment, and not after.\n\nMaybe the punishment would have changed, and maybe not. That's not the issue here. There could have been a conversation about why the specific punishment was or was not needed. That could have potentially led to both parents agreeing on the necessity and method.\n\nIt took OP a week to execute this punishment. No sign that anything was said to the husband before it was enacted. So it sounds like OP likely knew that he would have a problem with it, and decided to do it despite that. If you know your partner is going to disagree with your ruling, and you do it anyways, is that really equal parenting? If they did that to you, would you feel that they saw you as an equal parent to your children?", "Maybe he is. How do you know? 10$ is a big deal to a 11 year old", "This may be the most reasonable conversation I’ve ever sent on this sub!", "Listen, I hate to be that guy. I don't like picking fights much but I mean, c'mon. \n\nYour comment said \"good on you for not raising a boy who thinks he can hand everything off to the women in his life without anything in return.\"\n\nIf you were talking about how this would effect their worldview then you would've addressed it that way. You knew the wording you were using and you knew it was easier to put a spin on it that way. You still just made it purely about gender when like I said before, this was not about gender in the slightest, not even to begin with. \n\nThis is just a pure simple life lesson that needs to be taught to everyone, regardless of gender. I don't think I nor anyone else \"misinterpreted\" what you were saying, what you said was very straight forward and it was sexist plain and simple.", "Unfortunately it's a way for it to start. As innocent as this first example may be, if it sets a precedent where anything he does wrong he can just go to his dad to be on his side that's not going to go well in the long run.\n\nJust something for OP to keep in mind, that they should present a united front to their kids.", "Well that is probably also very true. I think what made me think of this was how he went on expecting the same tactics to work on our mother. But he was a kid/teenager so i can't say for sure if he wouldn't try it on a male sibling/ our father if he was around.\n\nEdit: My dad was around, just living in a different city so we didn't see him much and when we went to spend the summer at his house he would just give us money for during the day and take us to a restaurant where he can drink in the evening. He wasn't there for chores, a helping lady helped a few times a month.", "Have you talked to the kid?", "We are just going to have to disagree on this one. To me, your definition of what a patriarchy issue is seems so broad that it loses virtually all meaning.", "If op did this months or a year out, then you would have a point, but a week is perfectly reasonable amount of time for son to learn his lesson.", "I'll reiterate, the son is 11.", "If my partner and I have a disagreement on a punishment that was already levied, you talk about it going forward. You don't let a kid upset the balance of authority. This isn't a question of equal parenting. The mom and dad aren't equals, they are one unit. United front. One parent disciplining a kid without the others input happens. This is common. This does not make OP an AH.", "Have you? You are the one making an assumption, not me. The burden of proof is on you.\n\nYou’re the one who made the assumption that a kid is a raging misogynist out of nowhere. Older siblings try to make younger ones do their chores all the time.\n\n> my brother started asking me to do his chores very politely and sometimes for favours when i was 7-8 (like allowing me to hang out with him with his friends, offering me time on his PC). My mother put a stop to it when he started doing the same to mom ( asking very politely as if he just can't do it himself, i would jump to help my big brother out and my mother would stop me) It is manipulation and it is sexist even though he is not fully aware of it.\n\nAll of this is irrelevant because the situation is not similar at all.\nYou’re projecting with no evidence other than the fact that the younger sibling happens to be a girl.", "Maybe it's missing in the OP but I just don't understand why you wouldn't tell him immediately when you found out what had happened that he would be giving the money back - waiting until it was time to give them the money before telling them the stealing was being remedied just leaves multiple days where the daughter feels let down and the son thinks he got away with it... I don't see how that's good parenting when it would have been so simple to address it immediately.", "You say it's not a question of equal parenting. I would agree, if it wasn't a punishment a week in the making. That's where my issue lies. A week without any conversation about the punishment you're going to enact on your child? That sounds intentional.\n\nI will agree about the punishments moving forward part. It's done, and backtracking would easily be harmful. Do not recommend. Adjust for future disciplinary actions, but what's done is done.\n\nI just feel like this specific incident was inappropriate. Not because of what the punishment was, but because it sounds like one parent intentionally hid it from the other until it was too late. They chose to parent their children a specific way, and spent a week not telling their partner what they planned. That does not sound equal at all. I still believe OP to be the AH.", "We don’t know how much later op found out, but it was long enough for son to have spent the money already. I’m sure op told daughter that this is what would be happening. \n\nIt’s a pretty obvious solution: son spent the money already, his pay goes to his sister.", "Maybe I misread it - but it came across to me that neither kid knew until it was time to pay the next week. It sounds like you agree that that wouldn't be fair to the daughter.", "NTA. GEEZE! Can't people discipline their own kids? If you give them set chores to do, every day, but there are no consequences for when they do not do them, and they lie about it, you may as well just tell them to do the chores when they feel like it. Your son did not earn the money the week he did not wash the dished. People do not normally get rewarded with pay when they fail to do the work.", "We have family rules based on the book Positive Parenting with a Plan. We have a rule for \"busting a deal\", which is what is happening here. So in our house, we would punish the child who broke the deal and we would also make sure that the other child got paid.\n\nSo 100% NTA", "NTA and tell your husband that is he doesn't want to raise another Elon Musk he should quit giving you grief about it. Your son lied, there were consequences for his lie.", "NTA...but... and with respect, you may be a very mild asshole for waiting a week to deal out consequences. It's good that you want to teach him that he can't take advantage of his sister, but in my opinion the best way to do that would have been to make him give his $10 to his sister, as he promised, the week she did the dishes. By waiting a week to bring about the consequences, you risk a mental disconnect between what he did and what he's being disciplined for. In his mind, he did his chores and now he doesn't get paid, which isn't fair. It will feel especially unfair to him if you didn't set expectations, ie \"Because you sister worked extra all this week without pay, you will work without pay next week as a consequence of your manipulation and dishonestly.\" So he can digest it, and feel the lesson all week. He may not process the lesson well now, with the one week delay. It could feel more like spite than discipline.", "I would have let the two of them work it out. Especially since you weren't aware of the original agreement.", "I think there are some important lessons both of them can learn from it, and neither you nor your husband is helping them to learn them. Unless you know objectively somehow what the actual agreement was, you're not helping by stepping in and making the decision. If they were adults and she went to court with \"but he said...\" she wouldn't get anywhere. Deciding which child to believe isn't helpful. ESH; there's no winning when you take a side (even though logically your daughter is likely being more truthful) rather than helping them to work through it themselves.", "NTA - I like your solution, but I also think that you should have been direct about it from the beginning, instead of surprising him at the end of the week.", "It's not even really punishment. He's basically just being forced to pay back what he owed his sister. Make him do the chores for a while without any pay. It's what was expected of most of us growing up anyways", "Also, the consequence was absolutely right in line with the action. There was no yelling, no berating, no outlandish grounding or humiliating- he got to experience the same thing his sister did. He told his sister that if she did his chores, she would get money. His mom told him if he did his chores he would get money. He did not fulfill his end of the bargain with sis, while she did the work. Mom did not fulfill her end of the bargain with son, while he did the work. \n\nKids test the waters. We, as parents/teachers/adults in charge, have to guide them appropriately. Kid wasn’t even sorry for what he did. But he fucked around and found out how it would feel. I think it’s pretty masterful parenting. \n\nGood job, OP. NTA. Your husband needs to pull his head out of his ass and back you up, though. Otherwise, those teen years can rip y’all apart.", "And he still broke even. He still has the same $20 after two weeks. He just got an advance on this week's.", "Hopping on the top comment - If I get someone to cover my shift, as a favour or for any other reason, guess who gets paid? NTA", ">What's your husband's reasoning for wanting to give him the money?\n\nit's easier than real parenting", "I agree, NTA here, but i didnt read this like that at all. The way i see it is if he had an 8 year old brother he wouldve tried the same thing. This isnt about manipulating women, its about being dishonest and not keeping your word. Typical reddit response with thousands of upvotes though.", "Good grief, he might have done the same to his little brother.", "Good on you for for taking an issue between two children that has zero to do with their sex and trying to play it as being related to gender roles.  The kid would have done the exact same thing with a little brother, as it has nothing to do with male/female in the slightest.", "Alright, let's calm down on the sexism based off how an 11 year old acts with his sibling...", "I don’t think this has anything to do with gender. Just a older sibling taking advantage of the little one", "Man this sub. How do you come up with \"handing everything to a woman\" between 2 very young siblings. It is just standard older sibling using the younger one and trying to screw her over. If 8 year old was the boy the older one would do the same.", "TAKE MY UPVOTE!   \n\n\nOP is NTA... OP is a great parent, teaching the consequences of one's actions to both children. Now if she can teach the Father..", "Children start learning gender roles around age 2-3. So yeah, they do have an idea.", "Looks like he wants to teach your son to be useless too 🤢", "But he’s he Disneyland dad for both of them and equally lenient on both ? What did he say after the first week when your daughter complained about doing the chores and not getting paid did he have an opinion about what to do and in that circumstance, did he say anything about giving your daughter extra money to quiet her up or does she not complain as intensely as your son. And did you tell your son beforehand that he wasn’t going to get his next allowance because he didn’t do the chores before or did you just spring this on him\n\nAnd also is there some reason why you just implicitly believe your daughter , and is it possible perhaps it was a misunderstanding like your son saying he might give her the money and not saying for sure he would even though it’s still tricking her he’s technically not lying about saying he never promised he would give her the money . is there a history of your son being unfair  To his sister or tricking her to do things for him or backing out on his promises to her?", "So manipulating his daughter into doing his chores, more chores, and then  pocketing the money isn’t alarming to him?\n\nLike I guess we can say it’s not that serious. But I saw a child scam their sister. He didn’t do the chores he doesn’t get the money. I’d ask Disney daddy why he thinks his son deserves money for work his daughter did. It wasn’t even harsh. You didn’t make him pay her the 20.. he just didn’t get any  money this week…", "Yeah in fact there should be a fine for breaking the contract. Not just ending up where he was supposed to be if he honoured the agreement in the first place.", "Yeah, that’s the wild part.  He didn’t even actually get any punishment.  He just got $10 a week early.  I’d have taken the initial $10, and then paid him $5 the week after, so he’s be actually punished.  But I am not a parent.", "Your son literally scammed his sister out of $10. Totally unacceptable, he needs to learn consequences.", "whoa, so your son can learn he can scam people and get caught but still get paid? stand ya ground OP. husband is wrong wrong wrong", "> I don’t want my son to feel like he can get away with things\n\nGood, and you should absolutely not budge. You are raising him to be a decent person and your husband is undermining you.\n\nNTA but husband definitely is", "Exacly! That boy needs to learn about limits, before he thinks that he's entitled to everything and can exploit his sister (and others). And talk to your husband, what kind of message are he passing to your children??", "11yo and OP's husband are T.A. in this situation.  \n\n11yo should know better and the punishment fits the crime.\n\nHusband is a pushover and an enabler.\n\n&#x200B;\n\nRelatable personal experience: When I was 9yo, Pokémon was the hot new thing and all of my friends were into it - myself included.  One day I traded cards with my good friend (it was an even trade of holographic cards).  A few hour later I asked for trade-backs and my friend said no. I then had the genius idea of swapping out the cards when he wasn't looking. I rationalized it by thinking that since I had the card originally, it was okay. Boy was I wrong. The result was that he told his parents, who told my parents, who punished me by giving said friend my entire Pokémon card collection.  For a brief period I thought my life was over (LOL), and while it was on the harsher end of the spectrum, I guarantee you that I learned my lesson.", "He actually lied to his parents too, letting them think he was doing his chores.", "seriously, how the hell does this stuff get upvoted??\n\nHE'S ELEVEN, FFS!!! he's not some evil mastermind genius bent on destroying the world or fucking over women. he's an older sibling taking advantage of a younger sibling. it's a tale as old as time itself and is not an indicator for his long term future behaviour towards others. christ!! it's great you and your sibs don't do that but lots do and they do not grow up to be awful adults. siblings can just be assholes when they are kids cause guess what, sometimes kids can act like assholes once in a while. \n\ni know it might be shocking for some in this sub but not everything is lvl 10 nefarious, nor does it need to be made that.", "I agree that this is a horrible lesson, but why are you so focused in on \"treating women this way\" rather than \"treating people this way\" when there is nothing to suggest that this 11 year old boy was making a gendered decision?", "Bro that’s kinda heavy for an 11 year old. Kids HAVE to make mistakes to learn.", "So how long have you hated men?", "This all day long.", "This isn't even a punishment lol. This is exactly what natural consequences for not doing his chores is. He got off easy with the lying and trying to scam the sister.", "I'll take that bet. ^but ^not ^pay ^if ^I ^lose...", "I'd say the 11yo is also TA. By that age he should know that isn't an ok thing to do. And as someone who was once the younger sibling in this dynamic, I think OP needs to explain to both kids that it's not ok to pay another sibling to do your work. Especially at those ages, they need to learn to take responsibility for their own tasks first, and with the age difference there's to much risk for abuse and the older brother taking advantage", ">He cried and tried to get his dad to gave him the money. Now my husband and I are arguing because he thinks I’m too harsh with our 11 year old and $10 just enough to fight about. To me it’s about him making his sister do work and then pocketing the money anyway and how he needs to know if he didn’t do the work he doesn’t get the money.\n\nDad is sowing the seeds of his (and the 11 y.o.'s) destruction. Also, that manipulation and reneging on a deal is *totally cool, totally fine* as long as the amount isn't *too* much.\n\nThen, when the 11 y.o. cheats/manipulates *him* out of some \"real money\", cue *shocked Pikachu* about how this happened, and where he thought this behavior was okay, now that he's burned *him*?!", "This exactly!! Husband is employing the ol’ “boys will be boys” excuse to let his son rip off his daughter.", "Good point. That certainly warrants a significant punishment.", "I gotta say, even at 11 kids can be pretty d@mn manipulative. It really depends on how they were raised and positive vs negative influences.", "I agree, I don't think it being his sister would make a difference.  He would have done the same thing if it was his brother.", "Finally, some sanity thrown in with the advice and condemnation.", "> Alright, I’m a card carrying feminist but this is kind of a lot. He’s an 11 year old kid who wanted to get out of doing chores, I don’t think he’s getting off on “manipulating women.”\n> \n> \n\nRight, as a big sister, this is classic big sibling behavior. You trick the littler ones, it's your birthright", "The question for me is that if it were an 8-year-old little brother, would the DAD have reacted differently?\n\nI'm worried the answer is yes.", "Lmao happy to see I’m not the only one who said “HOLY FUCK” while reading this comment", "It's reddit. People jump to abuse at the drop of a hat.", "The comment you're referring to isn't that far off. \n\nIf kids do a injurious behavior, and there are no consequences or teachable moments about changing that behavior, it's seen as okay. It's naive to think that they'll *just* do it in the one instance, but not perpetrate is on others.", "Isn't this just the same type of handwaving the issue that OPs husband is doing, but with extra steps?", "You'll notice I put men and women and pets.  I think you mean to respond to the person above me (because I agree, I don't think this behavior stops at gender).", "It doesn't seem like kid thought specifically \"I'll get sister to do it she's just a woman\".\n\nThis is a younger sibling thing, it could happen reverse genders or same gender or whatever. I remember doing mean shit like convince my brother to do chores I hated.", "You're assuming that the kid was on a misogynistic path and the parents are correcting that. You're assuming this leads to an unconscious bias. That's a pretty wild jump.\n\nThe lesson is you can't just take advantage of {someone else} and reap the reward. Gender is not a factor.", "No, there’s no misinterpreting your comment. You turned this into something about sexism when it’s about a kid screwing over their sibling. None of what OP said had to do with sexism.", "You can explain your first comment all you want, it still sound, \"he did it cuz he is a sexist pig\"", "This giving the daughter the $10 up front would have been fine but OPs decision to have the son find out he wasn’t getting paid on payday for his previous actions is appropriate. He ends up feeling what his sister did when he didn’t pay her and can learn to empathize on why his actions were wrong. Obviously there needs to be parental guidance in that thought process but it’s worth more than “Hey don’t do that”", "I always knew it as Kodak Dad! I've never heard of Disney Dad before!", "Seriously this! I thought the AH behavior was going to be something like withholding allowance money for extra weeks, or something. Not just enacting the deal that was agreed upon.", "And he's not worth quoting lol", "I agree with pretty much everything you are saying here except the part where the 11 year old is old enough to know better. In my experience, about 11 us when kids start thinking up and trying stunts like this. They learn that this isn't ok from their parents reacting like the OP did.", "Part of the learning experience. Chores, responsibility, allowance. Contract law to some degree. Kids try to get around stuff and find loopholes, which honestly is a skill as well. \n\nSet those expectations and this is just another teachable scenario.", " OP is being lenient, not harsh.  All OP has done is enforce the promise (contract) her son made.  She isn’t punishing him for lying.  In fact, she isn’t punishing him at all.  He promised he would pay his sister $10 if she did his chores, and now he has.  \n\nOP’s husband, on the other hand, wants to reward the son for his fraud. The husband seems to believe that if his son promises an exchange when he gets something now but must pay in the future, he doesn’t have to pay when the future rolls around.  In effect, the husband want to teach their son that lying for profit is fine.   That’s the wrong lesson to teach an 11-year old.   \n\nNTA.", "I think my parents had a great approach on paying siblings to do chores: they had to be present for all negotiations. Because of who they are, exploitation would have been VERY hard to do after they made that rule, and left no reason to try and circumvent a straight up ban.", "This reminds me of The Great Brain young adult books by JD Fitzgerald. Tom would pay half of his allowance to his friends to do his farm chores. They were okay with the money because they were poor and needed a little extra work. \n\nLater, his younger brother John tried it but his dad just gave him more chores that were harder because he must need more chores if he already got his done. John stopped and did his own normal chores from then on", "Kids exhibit AH behaviors, that’s normal. They don’t become AHs unless their parents refuse to correct the behavior.", "[removed]", "He’s just a little kid and not a jerk *yet*. I think the other commenter meant if this behavior is allowed or encouraged by dad going forward, he would grow up to be a jerk that exploits the people around him. It’s a critical life lesson - acting out in little kid ways is normal, but can’t be left unchecked.\n\nHowever, the dad’s reaction is an indication that he’s a jerk with some sexist biases. Or he’s a coward that avoids responsible parenting. I hope OP is able to get some sense into him.", "True. But if the genders were reversed, would dad still hold the same attitude?", "My sister and female cousin absolutely exploited me (f), my brother, and our 2 other male cousins and when I caught on, they absolutely iced me out! I got super upset and went crying to our parents about it, but as everyone is saying, this is just normal sibling/cousin stuff!", "Where does mysogyny come from? I don’t think most people start out with the intention of teaching their kids to be sexist. That comes from things like this happening and being allowed to slide. I’ve seen some of it first hand. My brother was given a lot more freedom when we were kids because “hes a boy” and when he got into trouble he was bailed out time and again by my grandmother. I was expected to figure out how to get myself out of trouble. Now my brother expects women to wait on him hand and foot. He’s the eldest but Ive long been seen as the responsible one.", "There was absolutely nothing wrong with your comment and I 100% agree with you. I am responding to the person above me who said “this boy isn’t going to stop manipulating women this way.”", "Fair, I totally agree. I'm all for correcting sexism too, I just didn't see evidence of that here. I think I read too much into the \"manipulating women this way\" part of the comment.", "Lmfao", "It originates from referring to a divorced dad with minimal custody (hence referring to him taking the kids to disneyland when he finally has his custody time) and resulting in him appearing to the kids as the fun parent since he’s never present for the less fun parts. But there are plenty who are not divorced but still follow the spirit of the Disney Dad and the mother might as well be divorced considering all the contributions he makes.", "That's abuse!\n\n(I did the accent in my head.)", "The daughter is getting an extra 10$", "Good point. I was thinking more that they should know not to promise something and then change their mind and lie about having agreed in the first place, but you're right that this is an age where they're testing a lot of this out and need to clearly learn it's not ok", "my sister and I conspired and convinced our brother that a wife would want him to know how to do housework and our shores wpuld be good pracfice. He actually paid me 25 cents a day to make my bed for a while there.\n\nwe were severely punished when we got found out but years later my dad said he was actually impressed and terrified we could be so convincing.", "Not when you're 11 and 8 in my opinion, especially when the older one is a boy with a father who is backing up him taking advantage of his little sister. They can learn to come to their mom if they need to adjust their workload, but using your younger siblings to get out of your responsibilities isn't ok, and there are better ways to teach contract law. An 8yo isn't old enough to be forced to learn how to evaluate when their big sib is trying to take advantage of them and how to stand up to them, it'll just cause unhealthy dynamics", "That does sound like a good way of doing it", ">She’d give me two pennies for each quarter because “two is more than one” \n\nLO; my husband used to do the same thing with his little brother 😂", "Exactly, then it would show he has double standards for girls, and I would agree very much with focusing on the gendered aspect. Otherwise, the gendered concerns seem out of context for an 11 year old scamming their younger sibling (aside from the fact that the Dad is defending it, but I don't know enough to know the reason).\n\nIt's bad behaviour that should be punished. IMO the OP did the right thing, and the son should lose the privilege of assigning his chores to another until he can show that he can honor his commitments. But nothing about the OP's post suggests this was a gendered decision.", "Huh. My brother and I are a year and a half apart in age and when something was blatantly unfair, we'd set it right. If this situation (the one with the $10) happened between the two of us, we'd huff a little, but know that we'd be upset if the shoe were on the other foot and just hand over what the other was owed. It meant less conflict, and it didn't matter as much to us because we'd often pool our allowances together anyway to get a shared toy or video game.\n\nI guess this... isn't a common thing? I don't understand OP's son in this case because it's just not how my brother and I were raised.", "I think it is on the dad’s part, not necessarily the son’s.", "I think the idea was that it could lead to a more misogynistic mind set later on. This wasn't necessarily misogyny (he was just being a nasty older brother) but it could lead him to learn that he can exploit others and get away with it. Part of it was teaching him what is and isn't ok but it could also be taken in a feminist way by showing him that gender doesn't matter you should treat everyone with respect.\n\nThe kid wasn't being misogynistic but something to note is that he has been shown an example of accountability and fair treatment which is also extended to girls.\n\nI don't think the incident was misogyny, it was feminism. I think it was about raising a better generation of boys who don't view women as less.", "Oh lmao hahah thank you sorry about that", "It's really not that serious. It's a kid trying to scam their younger sibling. A tale as old as time. Genders have nothing to do with it as it happens with any mix of older-younger siblings gender-wise.", "You're allowed to be wrong.", "Not if he plays fortnite. I babysat a kid who would immediately spend all his money there as soon as he got it. Kids these days don't have physically go out to spend money anymore.", "Exact same as the Kodak Dad. Interesting to know there's another name for it :)", "So Robin Williams dad before he went drag in Mrs. Doubtfire...", "Then he should have done the chores. You don’t do the chores, you don’t get paid for the chores. That is an extremely reasonable consequence, it’s barely even a punishment.", "It's a bigger deal to an 8 year old.", "The daughter is also watching her brother get $10 for doing nothing and lying about it, if they both get the money.", "I see you hit a sweet spot where your brother was gullible AND girls were not yucky. Well played!", "Oh not condoning the $10 isn't a big deal statement. \n\nThe value of money is a very real lesson. Dad handled it poorly.  They had an agreement, it happened and the 11 year old tried to back out. \n\nOne week. Maybe there's more going on but I'll take it as isolated. Great discussion topic once the parents realized what happened with the family. \"From now on tasks are not transferable. \" Set expectations from there.", "An 8-year-old is old enough to learn not to trust her brother or her dad, which may be even worse in the long run. Hurray for Mom!", "Lol, we used to trade nickels for dimes because they were bigger coins, so they must be worth more! XD I fully agree this is just a sibling thing to do. I know I made worse deals with my sisters (older and younger) because I could/did get away with it. I did have a healthy dose of guilt once it had time to fester, though, and I'd often reverse the deals to assuage my conscience.\n\nBut yeah, backing out of the deal, too? That's crossing a whole other line. Where is the honor? The deceit is only fun when you're clever enough to set the rules in your favor, not breaking them to get ahead. Initially, I read the post as, \"chore money is X amount, and brother pockets Y amount and pays sister to do the work at a % of X.\" Not the case, and the reality was worse. Yeek!", ">I think the idea was that it could lead to a more misogynistic mind set later on.\n\nEXACTLY.\n\nYes, right now this was just older sibling taking advantage of younger sibling -- which is *also* an unbalanced power dynamic.\n\nSo if brother gets away with it, he's going to learn that you can take advantage of people who are younger than you or who are less experienced/know less than you.\n\nBut if dad overrides mom's action, then brother is *also* going to learn that: \n\n- what dad says is more important than what mom says\n- when sister is upset, there's no problem, but when brother is upset, things have to be fixed to make brother happy\n- mom takes sister's side, dad takes brother's side \n\n*Right now,* this is all happening in the microcosm of their 4-person family, but these kids exist in the world and live in society, where they will both be bombarded with messages that 1) if you are stronger, louder, have more power/money/supporters, you get away with taking advantage of others; and 2) men get (and \"deserve\") more respect than women.\n\nNo, the kid did not act out of intentional, malicious misogyny... but *how the parents address the situation* plants the seeds of the lessons they will learn, **including** the power and gender dynamics involved.", "uh, no, I actually very much did not spin that intentionally. It's one sentence, I can own that I should've expanded, which I then went to do in the comments for clarity. Turns out the majority of my comments on Reddit don't blow up to over 2,000 upvotes. But you're very much being \"that guy\" with this one, so thanks for that.", "Yup. He was a shitty parent and partner while he was married, and as an adult I can say that his ex-wife did the right thing in divorcing him.", "If it keeps people from being sexist towards women AND men then I'll happily be that guy. \n\nHave a good one.", "You too!"]}