{"id": 15834, "submission_id": "130td3l", "title": "AITA for embarrassing my soon to be in laws?", "selftext": "I’m (21f) from India. \n\nHello everyone. English is not my first language, so excuse any grammar errors, please. \n\nMy sister(26f) is engaged to get married to Krish(28m). I don’t know this family very well as it’s an arranged marriage and I just returned home two weeks ago from France (I’m studying there).\n\nKrish and his family came over last week to visit my sister and see me.  IDK why but that was their first time seeing me, lol. Tbh the family is super conservative, and I feel like my sister could do so much better. Once they left, I pulled my sister aside and shared my concerns with her, and she agreed but decided to go with the marriage because my dad knew the family and parents/relatives were annoying her to get married. \n\nAnyway, two days ago, they came back again but this time with their extended family. Krish’s brother, Sanjay(26M), finds me attractive and wants to get married to me. Feeling disgusted and angry, I immediately told them to fuck off. \n\nMy parents weren’t happy with the proposal and tried arguing that I was still young and in school. S went on to say I can continue studying in my country. (I have two more years in France). Like heck, I’m leaving France. My parents said no, and they kept pushing it, so I told them all to leave cause they’re disgusting cunts who can’t take no for an answer. \n\nThey were embarrassed and now don’t feel comfortable letting Krish get married to my sister. My sister is happy, lol. My parents are on my side, but they think I was a little disrespectful by calling them names. My sister also broke down and told them she needs time and is uncomfortable getting married now. They realised their mistake and apologised. So I think the engagement is probably broken. \n\nMy extended family is the issue now. My grandparents and uncles/aunts are calling me the AH cause I embarrassed K’s family, and I should’ve let the adults deal with it instead. Also, I'm known for being super blunt, and they are saying no one would marry me, and I should've accepted the marriage proposal. AITA?", "created_utc": 1682611005, "permalink": "/r/AmItheAsshole/comments/130td3l/aita_for_embarrassing_my_soon_to_be_in_laws/", "score": 343, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Embarrassing Krish’s family \n2) my family knows them (my grandparents and uncles included) so they’re saying i probs ruined the relationship between them by embarrassing Krish’s family\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you saved a fucking life. \n\n(More like 4 lives but still)", "Good Riddance!!! I didn't know that these things were still happening here. Like the proposal is for your sister, but how dare they bring someone else and are trying to get you engaged and not taking no for an answer!!! I mean the audacity of your ex-future in-laws!!\n\nI am happy that you and your sister dodged bullets and NTA", "NTA. I'm trying to not put a Western spin on it, but the reality stands: Sanjay was a stranger, he doesn't get to push an impromptu marriage proposal directly like that. He wants to arrange it, have him do the traditional method. \n\nNow, with the Western spin: NTA because you have the right to forcibly push back on some rando demanding that you marry him and that you could settle your world for his as if, at the first meeting, he's worth that.  \n\nFor both: The family has nothing to be embarrassed about, you call them names and if anything they should be offended, not embarrassed. Using embarrassment is just their way to punish you and your family for your behavior. That's evidenced by them describing you as unmarriable and that their son was doing you a favor by proposing. \n\nI'm glad your direct family isn't taking the bait. I know Indian culture works different than the West, but hopefully your parents can assuage the extended family.", "NTA — Krish’s family is treating marriage like a BOGO sale. You made it clear that you and your sister are not commodities.", "NTA because you probably saved your sister from marrying into a terrible family. Ignore your extended family as long as your parents and sister are agreeable that this is not the family to become in laws with. \n\nBut you are a young adult. There are ways to convey disagreement without resorting to terrible language. Because imagine if your sister had wanted to marry him, it could have been a terrible outcome.", "Dear chhoti bahen, \nPlease continue to be true to yourself. Finish your education in the country of your choice. Many people will want to marry you without changing you. You might just have saved your sister from a terrible marriage with intolerable in-laws. Ignore the extended family and just work towards being your best. How do I know this? I’ve been married for nearly 3 decades now and even my own mother thought I was not marriageable.\n    The only thing I would do differently is to work on your tact. You don’t need to let someone else’s idiocy and backwardness change how you want to present yourself. These goondas shouldn’t take your grace and confidence away from you.", "NTA\n\nYour sister agreeing to marry a guy that she doesn't really like, just for the sake of your family is probably the condition of almost every Indian girl. That's sad.\n\nBut the groom's younger brother trying to marry you and pushing you to give up your Education is bullshit. Yeah they say that you can continue your education in India.but come on.. we all know that it's not gonna happen. \n\nWere you a little harsh? If \"fuck off\" were ur exact words.. yeah a little. \n\nDo they deserve that? Heck yeah!!\n\nGood riddance for your sister! Cheer her up! She has dodged a bullet.", "...youre 21, a legal adult. I understand arranged marrages are  normalnfor your culture but the fact S wouldn't take no for an answer is extremely troubling. \n\nFuck what extended family thinks. Overall your soster is happy with the possibility of the engagement being called off and your parents backing your side is enough to let us know you're not the asshole. Could there have been a better way to handle it? Probably. But if s wasnt taking no for an answer being aggressive with it was most likely the only way to pull his head out of his entitled ass.", "You were undiplomatic, but you weren't wrong; and if the future in-laws refused to accept your and your parents' rejection then they pretty much had it coming.\\\n\\\nNTA.", "NTA- Throwing aside all my views on arranged marriages, K's family should be the one who is embarrassed. You dont force people together who say NO, even more so when the other families parents are saying no as well.  You're in France, chances are you'll meet someone with your own more progressive views or heck get a matchmaker.  Sister dodged a bullet with being tied to that family.", "Hell no. NTA.  They should not have been so pushy.", "NTA \n\nPersonally c*onservative* families always make the alarms go off in my brain, because you know how \"Conservative Indians\" are. \n\nYou're an adult im pretty sure you can make your own decision as to if you want to get married to a dude or not, and your anger and response is completely valid because they refuse to take a no.", "NTA, not one little bit. Krish's family was obnoxious and refused to hear you. If you can't make someone hear with diplomacy, it's time to move to stronger measures. They earned what they got, and any embarrassment is entirely their fault.", "NTA. You’re the type of sister everyone needs in their corner/life.", "Do not give up a European education for one in India. They do not hold equal value in the workplace and if you move to another country, that becomes more obvious.", "Are you the asshole for rejecting being bought?  \n\nNTA. \n\nThank *insert preferred powers or lack thereof here* and you deserve so much for giving your sister time to think. \n\n🙌", "You werent wrong and they were bad. But you used alot of foul language first and ‘she could do better’ on the first meeting? Really elitist much?\n\nIts great your family are happy now and better off but your attitude sucks as a person", "The name calling wasn’t necessary but if they wouldn’t back down when you said no I can understand why it escalated to that.\nI think you saw some red flags for both your sister and yourself good for you for speaking up if you hadn’t you’d be planning your wedding next. NTA unfortunately your family doesn’t see it that way\n\nETA: you didn’t embarrass that family he did. They only encouraged the behavior", "ESH. At first I was thinking you could have said No in a more polite way, but then again, maybe you did have to be that forceful with people who don't take No for an answer.\n\nYour sister's happy and your parents are on your side. Sounds like a win/win.", "If your exact words were \"fuck off\" after the initial conversation ESH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m (21f) from India. \n\nHello everyone. English is not my first language, so excuse any grammar errors, please. \n\nMy sister(26f) is engaged to get married to K(28m). I don’t know this family very well as it’s an arranged marriage and I just returned home two weeks ago from France (I’m studying there).\n\nK and his family came over last week to visit my sister and see me.  IDK why but that was their first time seeing me, lol. Tbh the family is super conservative, and I feel like my sister could do so much better. Once they left, I pulled my sister aside and shared my concerns with her, and she agreed but decided to go with the marriage because my dad knew the family and parents/relatives were annoying her to get married. \n\nAnyway, two days ago, they came back again but this time with their extended family. K’s brother, S(26M), finds me attractive and wants to get married to me. Feeling disgusted and angry, I immediately told them to fuck off. \n\nMy parents weren’t happy with the proposal and tried arguing that I was still young and in school. S went on to say I can continue studying in my country. (I have two more years in France). Like heck, I’m leaving France. My parents said no, and they kept pushing it, so I told them all to leave cause they’re disgusting cunts who can’t take no for an answer. \n\nThey were embarrassed and now don’t feel comfortable letting K get married to my sister. My sister is happy, lol. My parents are on my side, but they think I was a little disrespectful by calling them names. My sister also broke down and told them she needs time and is uncomfortable getting married now. They realised their mistake and apologised. So I think the engagement is probably broken. \n\nMy extended family is the issue now. My grandparents and uncles/aunts are calling me the AH cause I embarrassed K’s family, and I should’ve let the adults deal with it instead. Also, I'm known for being super blunt, and they are saying no one would marry me, and I should've accepted the marriage proposal. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. \"I don't like you in that way Sanjay. I look forward to being your friend since my sister is becoming a member of your family.\"\n\nLather. Rinse. Repeat. And run like hell far, far away from Sanjay. He is thirsty AH, if you ask me. And if the extended family wants to marry into Krish and Sanjay's family - send them all the contact information and tell them to hurry up. Don't miss the chance to sign on with these people.  ;-)", "NTA - no means no for everything, but the fact an entire family just keeps pushing you to marry someone you don't know, after your said no, yeah I'm on your side. Fuck em", "NTA - you're better off, your sis is better off, I call that a win. If you're blunt you can still marry a French guy they're used to blunt women! Let your extended family talk.", "NTA!!! OMG you dodged a bullet there. Sounds like maybe your sister did too.", "NTA.  Time to tell your extended family to fuck off.  Those people need to learn their boundaries.", "NTA and you go girl!  I hope the engagement for your sister is broken and she can find a spouse she wants and not the one she feels obligated to have.", "NTA\n\nBravo to you and with the added benefit of saving your sister!\n\nI know it's not easy in a culture of arranged marriages so good for you.", "Krish and Sanjay are still on the marriage market if you want them aunties! I just don't want them. Run. Don't miss your chance!", "It happens a lot. Thank god my parents care about us. My cousins were forced to stop their education and marry the guys their parents brought in. Scary", "No it wasn't. \n\nIf somebody tried to buy me what I say to them would be the least of their concerns. **GIRLS** are taken with family members to India on pretext and forcibly married.\n\nEveryone involved in human trafficking *which is what this is* deserves to be a footnote.\n\nI will die on this hill.", "ok it was “what??? NO” then they were like “oh come on blah blah blah” then i went “fuck off”", "It is called \"human trafficking\".  \nIt not legal *anywhere* to sell your children.\n\nYour parents are also major a h.  \nThey were selling your sister.  \nAnd they were about to sell you.\n\nThat's what an \"arranged marriage\" is.", "NTA\n\nYour bright, shiny spine is an inspiration to all of us!  Never let it tarnish!\n\nAs to your auntie saying no one will marry you - well, as one of *my* aunties used to say:  \"Better to be alone than be badly accompanied.\"", "No.  \n\nWait.  \n\nSomeone who thought they had just bought your sister was about to buy **you** and you told them to...\n\nchecks notes, because Reddit,  \n\n*\"Fuck off?\"*  \n\nThe audacity.", "I stick with ESH. Small one for you though.  You're 21 just now you can talk with people without cursing them out", "The parents were not selling the sister, and they were not going to sell her. Read the post. It says her parents were completely on her side, and it is only the extended family kicking up a fuss.\n\nBy the way, arranged marriages are not forced marriages. Two completely different things. Arranged marriages you're introduced and you make the decision. The sister originally agreed but then later changed her mind. If it was forced that would not have been allowed", "An arranged marriage is something that’s organised by a family or network and involves consent by all parties. It feels strange from a western perspective,  but given high divorce rates it’s hard to argue that ‘love marriages’ are necessarily more successful. What you‘re referring to is forced marriage which is a whole different ball game and is not ethical or ok. But they‘re not interchangeable terms. Given how responsive and supportive her parents were when they knew she was unhappy your comment sounds a bit ignorant and reductive", "We are talking about *arranged marriage*.  \nSo slavery is ok to you?", "I do wonder how often it's an arranged marriage technically, but the enormous pressure from family/other person's family more or less makes one person feel like they have to accept.", "There's a big difference. \n\nMany cultures embrace arranged marriages and couples end up very happy together.  I'm not one to judge someone over their culture.  \n\nBut there's no such thing as a happy slave so no I don't agree with that.", "NTA.  The adults weren't \"dealing with it\".  If you hadn't spoken up, you'd have been married off along with your sister who seems REALLY happy to be out of this marriage.  Maybe you could have used less colorful language but you certainly got your point across.", "NTA I would go back to France, and STAY there permanently. In your country you will be constantly harassed about getting married, having kids, etc. You sound smart, feisty, and independent so I am pretty sure you would rather have a root canal with no anesthesia that have an arranged marriage.", "Yes, the adults should deal with it. You are 21 and your sister is 26. You are adults. You dealt with it. NTA (Although admittedly you were a bit rude - but your essential message was fine.)", "YTA - you could have gotten your point across with some manners. This whole post is supposed to read as badass, but all I see is immaturity and lack of manners. \n\nWhile certainly marriage was a bad idea and they were not suitable, little elegance in dealing with matters goes a long way. For someone who is so proud of her education, it seems it hasn’t done much.", "Lol I am super blunt, I had no trouble finding someone to marry me. NTA", ">I didn't know that these things were still happening here.\n\nFamily pressure is really tough to deal with. When I was in India for a wedding, my relatives, including my usually very picky father, were very upset/confused that I rejected some guy they ambushed me with. He was the son of a family friend of my dad's uncle, and he seemed nice enough, if a bit dull. But it was a no from me. \n\nMy dad was pissed that I rejected his uncle's good judgement. To clarify, normally, my dad wouldn't even let me read their resumes unless the guy had an Ivy League education, was tall, and handsome. This guy met none of those criteria. But because my Dad's uncle vetted him, I was expected to say yes. Thankfully by the time we got back to the US, the fog of family obligation had lifted and I ended up marrying a guy who did fit my dad's criteria (and mine. I was allowed to choose in America. Just not in India.)\n\nOP, as long as you and your sister are happy, and your parents have realized that your happiness is more important than your relatives social status, you will never be TA.", "When I was growing up my mom had a close friend who had never married and when people would ask her why she said she hadn't yet met a man who deserved to be as happy as she would make him.\n\nThat always made me laugh.  (She was a lovely woman and not at all hating on men, just her snarky response to a terribly rude question.)", "You need to google what an arranged marriage is, and what human trafficking is, because you have no clue. Nobody should be FORCED to marry anyone, but that is completely different.", "You are wildly ignorant. It is not human trafficking, it is not selling. And forced marriage is not the same as arranged marriage. See how the daughters in this story were able to say no? That's an arranged marriage.", "I am begging you to log off the internet and go outside.", "Oh, that's a great response!!", "NTA I'm really sorry but arranged marriages make me sick. No one should be forced/threatened/socially pressured into a marriage, now if someone somehow of their own volition decides that they want someone else to handle their marriage, all the best for them but arranged marriages make a mockery of the concept of consent. Marriage should be entirely about you and the other person no family involved, as someone who's had to face their mortality very deeply recently I don't want people to waste the limited time they have been given out like an item.", "Behen. You dodged a MAJOR bullet and so did your sister. Fuck your extended family - they're not the ones who would have had to live with men who don't know how to take No for an answer. Can you imagine what else you or your sister wouldn't be able to say No to in the future if y'all married these men?? It's terrifying to think about.\n\nSanjay is not only an asshole but a dangerous one at that and his entire family are enabling him if they didn't tell him to STFU when he was trying to pressure you into marrying him.\n\nTu France main khushi khushi reh aur kisi French aadmi se shaadi karle (apni behen aur maa baap ko bhi saath le chal) because if these are the kind of men y'all are finding in India, it ain't worth it.\n\nEdit: In case it wasn't obvious, NTA", "NTA. Your extended family can fuck off. What’s the point of calling you an asshole now and telling you what you should’ve done? The engagement is over and neither you or sister have to get married to guys you don’t like or love. It’s a great thing all around.", ">***\"\"...parents/relatives were annoying her to get married...\"***\n\nWell that's certainly a reason to jump into a lifelong commitment with a stranger, if I've ever heard one.\n\nNTA.\n\n&#x200B;\n\n.", "There is absolutely nothing wrong with a lack of manners here. You think it was good manners to try to force a marriage onto a stranger just because you found them attractive? That's honestly akin to rape culture.\n\nSometimes, people need to be given a taste of their own medicine. Sanjay is clearly an entitled brat who has never heard no for an answer. He needed a reality check and OP gave him one. Nothing wrong with that.\n\nHer response was mature and assertive and necessary. Now, that family knows who they're talking to and won't dare disrespect her again. Hell, she even got an apology out of them, which we all know is rare in India.\n\nPeople in India just aren't used to seeing strong women voice their discontent even when they're being disrespected.\n\nYou disrespect someone - you get disrespected back. End of story.", "Real arranged marriages are no different from being introduced to someone via a third party or family friend. It is very common not just in South Asia, but even Europe, Japan, Africa, just known by different names.\n\nIn Japan, for example, they are known as omiai, and in China, Xiangqin, also known as marrigae interviews.\n\nIn fact, the process has, in some cases, been quite modernised. For example, in the Southall area of London, there is a service whereby a group of matchmakers will be the ones to so this introduction, based on trying to match similar individuals on factors like religion, ethnic background, social background and other factors.", "That’s absolutely disgusting. It’s 2023, that shit should not be happening", "I'm willing to believe ones exist like you describe but it also sounds like the no true Scotsman fallacy to say \"real arranged marriages\". I'm simply against any people being forced together (normally women being forced to marry men) in some places you get literal honour killings over women saying no for not \"respecting\" their families.", ">An arranged marriage is something that’s organised by a family or network and involves consent by all parties. It feels strange from a western perspective,  but given high divorce rates it’s hard to argue that ‘love marriages’ are necessarily more successful. What you‘re referring to is forced marriage which is a whole different ball game and is not ethical or ok. But they‘re not interchangeable terms. Given how responsive and supportive her parents were when they knew she was unhappy your comment sounds a bit ignorant and reductive\n\nA contested divorce is almost impossible to get in India. It's a significant reason the divorce rate is so low. \n\n&#x200B;\n\nhttps://divorcelawyersindia.com/family-law-guide/contested-divorce/", "If someone's family is conservative enough to subject their kids to an arranged marriage, they're also probably conservative enough to think that divorce is a sin.\n\n  \nJust because arranged marriages have a lower divorce rate doesn't mean people are happier in them. More people are likely just trapped and can't leave because of familial and societal pressures.", "Not all people are Christians.", "What does this mean? lol", "NTA. As a side note, my parents also thought that I was too argumentative to be marriageable. Turned out that I married a lawyer who likes arguing for fun. It worked out well for me.", "NTA\n\nYou will find someone that you want, and they will want you as well.\n\nNo K's family embarrassed themselves by not reading the room (subtle hint of fuck off) :) and pressing the issue. You are spot on.", "NTA.  But I am curious - what was the exact word you used for them? Chutiya? Something in another language? Curious minds want to know!", "Obv NTA. One day you’ll find a match who falls in love with you for your fire! Your sister and parents are lucky to have you. Burn bright to light the way for others, as you did💓\n\nGirl power✊", "NTA. You’re ALL adults not just the older family members, and you just saved your sister from a miserable existence.", "NTA. Good for you! And your sister!", "They basically want to own you. NTA. Arranged marriages are disgusting.", "Me too and he's Indian.  His parents didn't approve but we've been married 20 years so obviously their disapproval didn't matter.", "You aren't obligated to respect people that are LITERALLY trying to force you into marrying somebody, OP did nothing wrong, imagine a random guy you just met wants to marry you all of a sudden and his ENTIRE family is trying to convince you to marry him, they were told no politely several times before OP blew up, it's pretty justifiable if you ask me and most people in this thread", "Happy cake day🎂🎉", "It's interesting that you say this because I've met plenty of my husband's extended family who used the term \"arranged marriages\" for what you call forced marriages.  The older generation arranges the marriages and the younger generation does what they're told. It worked for their generation, even if it really didn't, so it will work for their children and grandchildren.", "This.", "She says she immediately told him to fuck off. Even in arranged marriage settings, guy has right to ask. She immediately started insulting. \n\nPretty trashy.", "Omg what makes you think the guy could ask her to marry him?? \nthe arranged marriage seeting was for the sister and not her\nit is very creepy for a random guy to just ask you to marry him and his entire family trying to convince you to marry him at the first meet, OP's reaction could have been softer, but they could have read the room and stopped, but they didn't so yeah I still think her reply is pretty justifiable.", "Maybe he is bad at reading social cues! It’s not everyday setting. 🤦🏻‍♀️\n\nIt could have been and should have been handled more delicately. We don’t start just cussing people out because they miss read us. We give polite at least once. \n\nWhat planet do you live on where it’s ok to start cussing people out and just go off in fairly formal setting just because someone expressed interest in you? He couldn’t have read her mind.\n\nI bet you are same type that goes ewwwwww no gross when anyone who you don’t like takes a chance. No maturity or manners.", "This exactly. Arranged marriages are much more likely to happen in societies where divorce is taboo and women have less rights, autonomy, and/or freedom. \n\nThey're harder to leave. That doesn't make them more successful.", "Bro what, did you miss the part where they were told no multiple times, if somebody is incapable of reading social cues, it's their problem not OP's, and why attack me homie💀 where are your manners at??lmao", "You lack basic reading skills. Re read paragraph. \n\nIt’s also often in arranged marriage setting to propose solutions which can be again declined politely. You lack reading comprehension, understanding of other cultures and manners. \n\nAnd if someone can’t read social cues, it’s their problem? So autistic people deserve to be cussed out. Someone who misread signals? How very progressive of you.", "Divorce isn’t a sin in most religions, that’s what they meant by not everyone is Christian.", "What are you even on about, it's very rude on insisting somebody to marry you at first sight, and OP wasn't obligated to be respectful.\n\nAnd YES it is their own problem if they donot understand social cues, and how very progressive of YOU to assume autistic people donot understand social cues, don't stigmatise people that are already struggling to be accepted in the society\n\nAnd again, why're you attacking me when you're preaching on and on about manners💀", "I didn't mean it as a defined \"sin\" in a religious text. I meant is as severely discouraged and taboo. Especially in Indian society where arranged marriages are more common, divorce is like social suicide. No one even says the word out loud if they don't have to."]}