{"id": 15892, "submission_id": "131lsvz", "title": "AITA for not wanting to celebrate my daughter's 18th birthday", "selftext": "This is the first time I have done this but I have seen posts similar to this on both facebook reels and youtube shorts I don't like sharing my life on the internet but I need opinions outside of my family and friends. Also sorry for my grammar, english is not my first language.To start this off, I (47 m) have a 17 year old daughter who will be 18 in 2 days, I will call her Lili for privacy purposes. Lili's quite  independent and has her life put together, she works a part time job to pay her school projects and rarely asks me or my wife money and if she does she would pay it back when she gets paid from her job. I don't remember when she stopped depending on our money but I encourage it since we're struggling financially.My wife, mom, siblings, and relatives have been talking about Lili's 18th birthday and they would like to have a grand celebration for it. 18th birthdays are quite a big deal in my country since it was this \"path to adulthood\" as they say, but I don't believe that, I feel like it's a waste of money for just one day and my daughter has commented that she is satisfied just celebrating at home. But my wife has consulted me about this months before and I have told her no. My mother consulted Lili about her 18th birthday and she has told her that any celebration is fine as long as it's not too much. I thought that was the end of it, but my brothers visited me and talked to me about Lili's debutante party. Everything was settled and paid for by my sister. I was furious and have lashed out to them and told them how they could've just given that money for Lili's college funds instead of this stupid party but they told me how selfish I was for thinking it was all about money and how I should pay more attention to my daughter's feelings and saying that Lili deserves this after all the years she worked hard for herself. I tried to give them my reasoning but they kept berating me, calling me heartless and how a daughter shouldn't feel obligated to support herself when she's barely an adult herself, but Lili's independence and part time job was all her decision, my reasoning is not selfish I am thinking about my daughter and how the money could've been spent on something useful instead of a party that wouldn't even last a day but my brothers are crying and kept telling that I don't get it.Yes I don't get it, I really don't and I want to know what I am missing that a party like this is and if I am an asshole for not wanting this party for my daughter.\n\n&#x200B;\n\nUpdate:  \nI'm really stupid for asking strangers on the internet for validation when I could've talk to my daughter first and I ashamed that I just realized that just now. I have talked to Lili about the party and her feelings. This is the first time in years since we've talk this long and now I feel like a piece of shit for not noticing any of this sooner.  \nWhen Lili was just a child she was energetic and clingy to me, she was basically a daddy's girl, she always kept me in her thoughts and even tells me everything that goes in her day. But when she reached teen years she has grown distant from me and only has bonded with her mother and younger sister, I always thought it was just the usual phase teens go through and she'll bounce back.  \nI was wrong, it wasn't a phase, it was my fault. Years before I had suffered from severe illness which forced me to quit my job and stay at home, I couldn't provide for my family and in return my mental state change drastically because of the debt and bills piling up. I easily get angry and my issues unfortunately affected my daughter. Lili has mentioned she started becoming independent because she didn't want to feel burdened or feel like she owes me every single penny. She recalled how I would always use the food, the school projects, gifts and money I have given to her as a \"weapon\", in her words \"If I fail a subject, make a mistake, or even just misbehave, you would always tell me how disappointed you are to me and how your sacrifices are all for nothing and how you would threaten to take them away and sell them off\". I never realized those words could affect her this much, I even forgot I told her those words when she was younger. My anger got the best of me and in return I lost my daughter emotionally. I saw her independence as something good instead of being concerned why she doesn't want me to provide for her.   \nI feel so shit, she did want to have a debutante party, she wanted to experience what her female cousins felt during their 18th birthdays with their pretty gowns and fancy cakes. But she just said \"anything is fine\" because she didn't want to look like a spoiled brat in front me and her grandmother. This is the first time I have seen her cry and I am so heartbroken to know that I broke my own daughter and made her feel like she is undeserving of any gifts and celebration, I made her feel like every gift has a payment and now I couldn't stop crying. The guilt I never knew I had started piling up and I just hugged her tightly.  \nNow I know what my brothers were telling me all this time and god I was so stupid for being this dense.   \nThe party will go on, I want my daughter to feel special and I want to atone for all those years where she suffered in silent because of me. I will attend the party and apologize to my siblings for lashing out.", "created_utc": 1682671003, "permalink": "/r/AmItheAsshole/comments/131lsvz/aita_for_not_wanting_to_celebrate_my_daughters/", "score": 117, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My relatives see me as someone selfish and I have this feeling that it might be true. I want my daughter to be happy but the money could've been use more in other things, I guess not giving my daughter a chance to celebrate her birthday is an asshole move\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I mean, obviously YTA. The real question is, why are you so determined not to let your 18-year-old daughter have a party that you don’t have to pay for? As she and the rest of your family, happy, and it won’t impinge on you, why on earth would you stand in their way? Do you try and take candy off babies too?", "YTA\n\nLet me see if i got this right:\n\n- sometime during her childhood you stopped being your minor child's provider for many things that you were obligated by law - \"all the years she worked hard for herself\" \n\n- after seeing that you don't want to provide for her she started working so she can buy her things (that you refused to) \n\n- she knows she cannot rely on you at all so she lowered her expectations for a birthday party (i wonder how many times she missed one)\n\n- your wife, mother, siblings all want to throw her a party and you refuse\n\n- your sister already planned and paid for her party and you refuse to let your still minor child to attend\n\nYou are selfish.\n\nI wonder how much rent is she paying and how much money she spends on the bills/groceries.\n\nYou only see $$$$ whenever you look at her.\n\nEdit to correct", "Oh, boy, here we go.\n\n>Lili's quite independent and has her life put together, she works a part time job to pay her school projects and rarely asks me or my wife money and if she does she would pay it back when she gets paid from her job\n\nSo, you neglected her, she learned early on she can't rely on you. You know that early independence is actually BAD, right? It's a sign of poor parenting.\n\n>I don't remember when she stopped depending on our money but I encourage it since we're struggling financially.\n\nWhen you decided to have a child, you took on an obligation. The financial obligation, at minimum, is for eighteen years. Not sixteen years. Not seventeen years. Eighteen years. Financial struggles or no.\n\n>18th birthdays are quite a big deal in my country since it was this \"path to adulthood\" as they say, but I don't believe that, I feel like it's a waste of money for just one day\n\nLet me guess. *You* didn't get one?\n\n>my daughter has commented that she is satisfied just celebrating at home\n\nI'll take another guess and say you haven't been quiet in your disapproval of the eighteenth birthdays, and your daughter is trying to protect her feelings by saying this. If she says she is satisfied with a home celebration, she can't be disappointed when you let her down.\n\n>But my wife has consulted me about this months before and I have told her no.\n\nOh? Who the fuck died and made you king?\n\n>My mother consulted Lili about her 18th birthday and she has told her that any celebration is fine as long as it's not too much.\n\nOh yes, daughter is *definitely* trying not to get her hopes up, knowing you will disappoint her.\n\n>I thought that was the end of it, but my brothers visited me and talked to me about Lili's debutante party. Everything was settled and paid for by my sister..\n\nWhat a lovely, generous gift from your siblings.\n\n>I was furious and have lashed out to them and told them how they could've just given that money for Lili's college funds instead of this stupid party but they told me how selfish I was for thinking it was all about money and how I should pay more attention to my daughter's feelings and saying that Lili deserves this after all the years she worked hard for herself\n\nYour siblings are right. It's not all about money. Do you even *like* your daughter?\n\n>I tried to give them my reasoning but they kept berating me, calling me heartless and how a daughter shouldn't feel obligated to support herself when she's barely an adult herself, but Lili's independence and part time job was all her decision, my reasoning is not selfish I am thinking about my daughter and how the money could've been spent on something useful instead of a party that wouldn't even last a day\n\nYOUR DAUGHTER SHOULD NOT HAVE HAD TO SUPPORT HERSELF! SHE SUPPORTED HERSELF BECAUSE YOU DID NOT CARE FOR HER!\n\nAGAIN: DO YOU EVEN LIKE YOUR DAUGHTER?\n\nI agree with your siblings' assessment. You're a selfish, heartless asshole who has neglected his own child.\n\nYTA.\n\nEDIT: Wow, your edit makes you look so much worse. You get how your edit makes you look so much worse, right? You weren't just a neglectful selfish heartless asshole, you're an ABUSIVE selfish heartless asshole. And you're STILL making it all about you!", "YTA\n\nThey decided to pay for the party, your daughter said anything is fine as long as it’s not too much. You are the one who doesn’t want a party not your daughter who is the birthday girl. You state she has worked hard for years, yet the girl is only about to be 18. \nYou are not paying for it, but you have demands on how your sister will spend her money? Mind your own business. You are selfish as f.", "Literally the only opinion that matters here is lili's.\n\nYTA for making her party all about yourself and not listening to what she wants. If it turns out the party was too much, then the rest of your family are assholes for the same reason.", "YTA\n\nYes money is important, but your daughter will only turn 18 once and it’s a big step in adulthood in many cultures, your daughter will remember how all her family came together to celebrate her and she will treasure the memories \n\nIt’s great that your daughter is independent and almost definitely will do well, but your scourge views of counting pennies is going to grow to resentment", "Yep, YTA. her independence might have been her decision, which you heavily encouraged as you are financially struggling. It sounds like she could either focus on her own finances or struggle with you, which isn't much of a choice and more of a necessity.\n\nIf relatives want to pay for a party for her, you get absolutely zero say in it. You don't decide how they spend their money, you don't get to decide whether your daughter will like it or not. It's her decision, she's independent from you. You are an asshole for deciding you don't want your daughter to be celebrated. Probably best you stick a big fake smile on, go to the party and pretend you want to celebrate your daughter too.", "YTA.\n\nYour daughter sees that you're poor and is doing what she can to not be a burden. She **wants** nice things, but know you can't afford them, so she says it's fine so you don't feel guilty.\n\nYou're content to let your daughter go without something YOU AREN'T PAYING FOR because you're too prideful.\n\nHell, you're even happy your child is supporting herself because you failed as a parent to provide for her, and you think that's a good thing.", "YTA. \n\nIt’s not a waste of money. It’s a celebration of your daughter becoming an adult. It’s a milestone birthday. You should be making plans and making sure that she feels loved and appreciated. But you think money is more important than she is. \n\nWhen you look back on it in the future and wish you’d done things differently, there’ll be no way to rectify it. Do something now before it’s too late.", "Ooooooh nooooo.  YTA.  Do you love your daughter?  Do you want to see her have a day where everyone she loves is celebrating her?  Don't you want to see that smile when she walks into the party?   \n\nDude, no one is obligated to throw the party or pay for your daughter's college, or whatever.  So just look at your sister paying for the party as one thing you don't have to stress about and be thankful", "YTA. It's your daughter's birthday party that was paid for by family to give her a nice memory she can have for the rest of her life and you are complaining and basically ruining it for her.", "YTA\n\n\nIt honestly sounds like you don't love your daughter and this for quiet some time. \n\n\n\nAnd that you told your wife is an irk too. Why do you have the power over everything?", "I really have a hard time believing some of these stories. Story was posted 3 hours ago and within that time OP has already had a heart-to-heart with his daughter, had an epiphany how he was a shitty parent, and everything's all right in the world again. In 3 hours.", "YTA for making this all about you - you don’t want her to have a birthday party so no one gets to give her that. \n\nYou are really selfish. It’s not that she doesn’t want a party, it’s that she’s learned to be disappointed in you and is scared of your reactions.", "Your daughter is just saying she’s satisfied with just celebrating at home because she knows you can’t/won’t spend a lot on her birthday anyway. \n\nAlso, being “satisfied” is not the same as being excited and happy.\n\nIt’s not your money that’s being spent. Would you even give your daughter the money if your sister handed you a check for Lili’s 18th? Why would you feel entitled to the difference in money that is spent on a less lavish party? It’s important to your sister to give your daughter something you won’t even host on your own. So she’s stepping up.\n\nYTA.", "YTA.  And I don’t believe your edit for a second. “I didnt know saying semi threatening, cruel, and aggressive things to you constantly throughout your childhood would affect you” \n\nYou: *surprised pikashu face*", "YTA! \nFor you it is just money being wasted. \n\nWhat it really is, is memories!  Memories for life for your daughter. A sign that she is loved and appreciated which all of her family want to show her except for you.", "YTA. Please don’t go to the party and spoil it for her. She deserves a day to celebrate her.", ">Yes I don't get it, I really don't\n\nLet me help: You don't get to demand that someone's generous gift - to someone ELSE - be used for a different thing. Your feelings on someone else's party that you refuse to host or pay for are irrelevant. YTA", "YTA and that edit made it all worse. I didn’t get big birthday parties. I didn’t get a sweet 16 or a big 18 blowout. I didn’t go out on my 21st. But that was all MY choice. My parents put money aside for them just in case I changed my mind. I just never did good with a bunch of people. I preferred pie with my parents and siblings.", "\"She recalled how I would always use the food, the school projects, gifts and money I have given to her as a \"weapon\", in her words \"If I fail a subject, make a mistake, or even just misbehave, you would always tell me how disappointed you are to me and how your sacrifices are all for nothing and how you would threaten to take them away and sell them off\".\"\n\nYou do realize she is no longer your daughter right? You aren't a father, or a father figure, or even a figure in her life now.\n\nYou are a failure. You failed as a parent. You failed her. You failed your wife. You failed your family.\n\nYou have nothing to give them but the shame you have brought them.\n\nYTA. And if she ONLY goes no contact and not nuclear in sharing what you have done to her with your family, you better thank her and leave her to live her life away from your abuse. The judgement doesn't even cover what you are.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis is the first time I have done this but I have seen posts similar to this on both facebook reels and youtube shorts I don't like sharing my life on the internet but I need opinions outside of my family and friends. Also sorry for my grammar, english is not my first language.  \nTo start this off, I (47 m) have a 17 year old daughter who will be 18 in 2 days, I will call her Lili for privacy purposes. Lili's quite  independent and has her life put together, she works a part time job to pay her school projects and rarely asks me or my wife money and if she does she would pay it back when she gets paid from her job. I don't remember when she stopped depending on our money but I encourage it since we're struggling financially.  \nMy wife, mom, siblings, and relatives have been talking about Lili's 18th birthday and they would like to have a grand celebration for it. 18th birthdays are quite a big deal in my country since it was this \"path to adulthood\" as they say, but I don't believe that, I feel like it's a waste of money for just one day and my daughter has commented that she is satisfied just celebrating at home. But my wife has consulted me about this months before and I have told her no. My mother consulted Lili about her 18th birthday and she has told her that any celebration is fine as long as it's not too much. I thought that was the end of it, but my brothers visited me and talked to me about Lili's debutante party. Everything was settled and paid for by my sister. I was furious and have lashed out to them and told them how they could've just given that money for Lili's college funds instead of this stupid party but they told me how selfish I was for thinking it was all about money and how I should pay more attention to my daughter's feelings and saying that Lili deserves this after all the years she worked hard for herself. I tried to give them my reasoning but they kept berating me, calling me heartless and how a daughter shouldn't feel obligated to support herself when she's barely an adult herself, but Lili's independence and part time job was all her decision, my reasoning is not selfish I am thinking about my daughter and how the money could've been spent on something useful instead of a party that wouldn't even last a day but my brothers are crying and kept telling that I don't get it.  \nYes I don't get it, I really don't and I want to know what I am missing that a party like this is and if I am an asshole for not wanting this party for my daughter.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA it's not even your money and you are bitching about it. FFS, stop being an ass and celebrate your daughter. It might be a nice change for her since you don't seem to care about her at all.", "No, you needed us STUPID people for a few reasons. 1st you needed to actually write out the issue. For you to see there was one. 2nd yiu needed people to call you a AH and somewhere listen to a kernel of advice that said talk to your daughter. \nYour still a AH but a better one", "I know it's hard to see people spending money on something that doesn't last when you're struggling financially, and of course you're her parent, but at 18 it's not completely your decision. If no party is what your daughter honestly wants, she should tell them. Otherwise you'll need to give in graciously. NAH.", "NTA\n\nYour daughter clearly didn't want a grand event and they ignored her wishes. It's her party, let her have what she wanted. I just hope no one went silly and spent the price of a car on the party.", "YTA", "I feel so so sorry for your daughter. Please allow her to feel like she matters to you for once. Act like a real dad. Give her the best day she possibly can have. She deserves it. You have a lot to make up to her. You should have never allowed her to support herself as a minor. That was your job.", "I'm going to go NTA with the edit of this one (definite Y T A before). You didn't \"break\" her OP, you did cause her problems but you two are talking about it and coming together. That's healthy! Acknowledging issues and working on fixing them. The fact that she feels comfortable talking to you about this at all is good (I could never have a similar conversation with my own parents for example).\n\nI hope you two enjoy the party together. =)", "I hope Lili has a wonderful time at a beautiful party and gets a lovely gown.", "Man really saw his minor child providing for herself and went \"good, now I don't have to pay for her\" and stopped caring.", "_\"Everything was settled and paid for by my sister. I was furious.\"_..... This whole post is about OP and his feelings. He doesn't give AF about what Lili wants. Lili has said she wants a party, though a modest one, but OP wasn't even planning to give her that. And, he is trying to ruin the party that someone else is throwing for her....\n\nIf this is how OP always acts about money, it's pretty clear why Lili felt the need to be so independent. This kid has had to pay for her own needs and school fees. It's sad that the few times she her to ask her parents for support, they made her pay it back. \n\nNow, Lili's family is doing something nice for her that she doesn't have to pay for or pay back, and OP is trying to put a wrench in that.", "\"I have told her no\" and the wife just took it? She is so desperate for whatever money he can provide her, or did she just give up?", "This.  OP YTA", "Imagine bitching about how someone else uses their money. Like if you aren't the one giving them the money - who cares 😂", "Straight up. I do not, for a second, believe that lili will actually be disappointed if they throw a bigger party than she asked for. She's been made to feel that her accomplishments should be diminished rather than celebrated, and doesn't think her successes are worth being showcased in such a way", "YTA a very abusive one at that. It’s like you take the cake for awful parent of the year. Why do parents who abused their children never remember how hurtful their words and actions were? Would you have been OK with your parents saying these kinds of things to you? I know for sure it wouldn’t make you feel good. And I just feel like you don’t even realize how truly hurtful and damaging you were to your own child.\n\nYou said things to your child that could never be taken back. She will forever remember the way she’s been treated her entire life, and how much you robbed her of her childhood. You’ve done and said some awful, and despicable things. I feel so bad for your daughter, and she deserves so much better.", "I'm glad the way your making it up to your daughter for all the years you were a shit dad is allowing her to attend her birthday party that you didn't even pay for. Jesus christ your an asshole still.", "YTA\n\nedit or not you failed your daughter, your saying you want your daughter to feel special and make up for years and years of abuse? you think a party fixes all that trauma? it doesn’t. you remind me of my dad and i’m around your daughters age and my god. your lucky if she stays in contact with you ever again. the best thing you can do for her is not go to the party.", "Hey OP.\n\nI see you getting some horrible comments and I just wanted to remind you that we're all human and we all do shitty things. It's not an excuse, but people who have never been in this kind of situation -- where you can't even make it to the end of the month -- have no idea how taxing it is on your mental health. Some people get depressed, some surge, some get blatantly abusive and lash out at home. \n\nIt's an unfair situation for all involved.\n\nI was your daughter, I know how she feels.\n\nSo yeah, YTA because you were so caught up on that \"let's save every penny we can\" cycle you couldn't see beyond it. But talking to your daughter, seeing her side, and recognizing you f\\*cked up is the first and most important step.\n\nI hope you can start rebuilding your relationship with her and your family (please do apologize to your siblings) mend things and move forward.\n\nBest wishes!", "What does Lil want?? That should be what settles it.", "Even your update is all about you you you. Youre so hurt you feel so shit this and that. you seem incredibly selfish", "I'm guessing this is in the Philippines ... so the debut is on par with a quincanera or bat mitzvah where there is a major ceremonial and social aspect to the party (more than the typical US sweet sixteen). Denying her this party (that OP doesn't even need to pay for due to his siblings' generosity) is sending a massive signal to the community about how he views and values his daughter.", "Sometimes I think this sub is just Hallmark movie writers testing out ideas."]}