{"id": 15936, "submission_id": "132cl3u", "title": "AITA for \"complaining\" every time my wife washes dishes with the water running the almost the entire time?", "selftext": "The way my wife washes dishes bothers me so much.\n\nShe doesn't plug one side of the sink, fill it with soapy water, wash multiple dishes at once and then rinse dishes in bulk.\n\nInstead, she fills one side of the sink with dry, dirty dishes, turns on the water, let's it run constantly, periodically applies more soap to a brush or sponge, washes one dish at a time, rinses the dish, places it on the drying rack and then repeats this until completion.\n\nWhen I notice her washing dishes in this manner, I tell her to stop wasting water; she always rolls her eyes and tells me to go away.\n\nI pay for water monthly, it's not expensive, but when she does this, I see it as wasting money.\n\nI'm anxious to hear what everyone on Reddit has to say about this one. Am I the asshole?", "created_utc": 1682723021, "permalink": "/r/AmItheAsshole/comments/132cl3u/aita_for_complaining_every_time_my_wife_washes/", "score": 24, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My wife thinks I'm an asshole for telling her to wash dishes differently because the way she washes them is a waste of money.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: Have you tried saying, “oh, honey, you go do something relaxing, and I’ll wash the dishes!” and then doing it your way?", "YTA if it bothers you that much why don’t you do them yourself? She can do something else.", "YTA. If you do not like how your wife washes dishes - wash dishes yourself", "YTA.  \n\n\nYou need to CALM the hell down and stop trying to micromanage every last aspect of your wife's routine.  RELAX dude.    \n\n\nNot only are you ta, but you're going to give yourself a coronary before you reach 40.  You are so uptight you should get yourself a bucket of coal.  Stick a few pieces up your derriere once a week.  In a month or two you'll have enough diamonds to be the richest guy on the planet.  My goodness.", "INFO: Why aren't you doing the dishes?", "If you don't like how she washes dishes, then wash them yourself.", "YTA do your own dishes or shut up", "YTA. I’d never do dishes in a house where it was nitpicked. Do it yourself or stfu. The fact that you say you *pay for the water* makes me wonder how often you’re lording that over her while not helping around the house.", "YTA. If you don’t like it, do it yourself. If you don’t want to, get a countertop dishwasher. \n\n“Armchair directing” is just rude.", "YTA, unless you’re willing to do all the dishes yourself. You do it your way, let her do it hers. This is not worth quibbling over.\n\nEdit to add: if a time is on the fence, please keep in mind that OP is also [this guy.](https://www.reddit.com/r/AmItheAsshole/comments/z7xtan/aita_for_calling_every_morning/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1) He just looooves finding new ways to micromanage and control his wife.", "YTA.   You don't like how she does something ?  Do it yourself.\n\nOr buy a dishwasher", "This is actually the most sanitary way to wash dishes. \nSo YTA", "YTA if you're complaining about her washing the dishes. She could be leaving them for you.", "I mean… my wife doesn’t like how I load the dishwasher… so she will rearrange it when I’m not watching… but after I told her to stop she doesn’t tell me I do it wrong… every time… so, yes YTA. Let her wash them the way she’s going to or shut up and do it yourself!", "YTA. Do them yourself.", "YTA. If you don’t like the way she does the dishes, you can do them yourself. You say that YOU pay for water monthly, so I’m curious as to what the arrangement is here.", "yta do the dishes yourself if that's how you feel", "YTA…but mildly so, this is something you all need to talk about…not you coming in giving her unsolicited advice. \n\nMy husband and I have a firm rule. If one of us has a preference or a hangup about the way a chore should be done, then the one with the hangup is responsible for the chore.\n\nFor example, I sort my laundry into categories that feel important to me. So I do the laundry and he folds it. Simple fix and I get to be as weird as I want with my laundry sorting.", "YTA this is his how I do them as well ... And everyone else I know. Why wash them in dirty gunk water?", "If you mentioned it once to her, fine. But continuing to critique how she does dishes, YTA. If those are her chores, let her do them as she chooses. If it bothers you so much, trade chores with her. (This is me assuming you share household chores)", "YTA. Wash them yourself and stop complaining.", "YTA I wash dishes the same way and you already point out that your water bill is cheap , plus she’s doing it not you", "Just buy a dishwasher bro-", "I wash dishes the same way. I HATE floating food in the sink water. This eliminates the risk. I was gonna say no assholes here, but I was made aware of your other controlling post, so you’re still the asshole.", "If you don't like it, then you need to take over dishwashing duties. Simple. \n\nAlso, I wash dishes a lot like your wife (minus the constant water running) because of sensory issues. Your way is a nightmare. \n\nYTA for continuing to bother your wife.", "YTA. Do you want the result or the process? You don’t get both. \n\nPersonally, I’m a results girl. Are the dishes done when she’s done? Then shut up or take that task on and enjoy the process.", "I’m not going to lie to you, I wash dishes the way your wife washes dishes. I don’t disagree that it’s not necessarily the most efficient way, but I would also never insist my SO stop doing a chore a certain way unless it was causing damage, not actually getting the job done, or creating a financial burden.", "You see it as wasting money but you're still not prepared to do it  yourself? This is peak I pretend to care but I don't care enough to do it myself mentality. Get up of your ass and do it yourself. YTA", "Putting a stack of dirty dishes in a sink full of soapy water, and then using that same water to wash dish after dish, glasses, etc....after the first couple of plates, you do realise  you're washing dishes with dirty water, right?", "When someone does a chore and achieves the desired end result (in this instance: clean dishes) you don't get to complain about how they do it. Either leave the kitchen so you can't see/hear the water running or wash the dishes yourself. You don't get to dictate how the chore is done. YTA.", "YTA.\n\nI do the dishes the same way for a reason.\n\nIf I put them in a sink of hot soapy water the water becomes tepid greasy water with bits of soggy food in it. It's not hot clean water with fresh soap. I use fresh hot water with a dish rag with constantly refreshed soap.  Rinse. Drainer.\n\nBe quiet.", "YTA. Your way is not the only way. Or the right way. Let her do her thing.\n\nIf you’re so worried about conserving water, buy a dishwasher. Not only does a dishwasher use less water, it uses less energy heating water, and it gets dishes cleaner. Look it up, Mr. Know-it-All.", "Quick solution. Do them yourself any way that makes you happy or let her do her thing. YTA", "Yta. Ew the way you wash dishes is so gross. Your wife's way is more sanitary leave her alone.", "YTA\n\nIf you don't like the way she's washing dishes, wash them yourself. Relieve her of the duty... Tell her she doesn't have to wash dishes anymore. Problem solved.", "YTA. Get a dishwasher machine if you want to save money.", "YTA. Let her do it the way she wants. I do dishes the same way and it makes sure everything is clean. If you don't like it then offer to do it yourself.\n\nETA: since I saw someone link one of your olds posts, let me tell you that you need to stop trying to micromanage your wife.", "YTA. My word just do it yourself or shut up.", "INFO: does she have the tap on full? Depending on how fast she is doing it, and how fast the water is coming out, she could be using less water than you are.", "YTA for calling her constantly and now that she has energy, berating the way she works. you bring home money, she cares for the house. don’t like how she does it? do it yourself", "YTA. Why wash all the dishes in gross water together.... i use the water pressure then put it in the dishwasher. Or i use a brush and pre rinse. I hate gross dish water thats why i have a disposal. Wash tem yourselfnif you want them done your way.", "You could always do the dishes instead if it’s a big issue. I am sure she won’t complain how you do them.", "YTA. Her way is more hygienic. If you really wanted to save money on washing dishes, you'd buy a dishwasher. But this is about controlling your wife, not dishes or money.", "YTA. I wash dishes like your wife. I will admit it is the more wasteful way, however it does not even make a dent in my water bill. Wash them yourself using dirty soaking water if it bothers you so much.", "YTA. You should appreciate that she's willing to wash the dishes. If you don't like how she does them, do them yourself. I've been married for over 40 years, and this is exactly what I would tell my own husband if he nitpicked how I did a chore.", "YTA. This is a you problem, not a her problem. Let it go. Or YOU do the dishes.", "It's not expensive, the dishes are clean...if you don't like the way she does it, you can take that chore over. NAH but micromanagement ain't it", "It's wasteful, but the amount of money it's going to cost is very little.\n\nJust get a dishwasher, it's more sanitary and more efficient than either method of washing.", "YTA", "You got two choices here, my friend. \n\nyou can do the dishes yourself or you can let her do them. What you can’t do is NOT do the dishes AND micromanage her doing the dishes. YTA", "Yta. If you don't like it done the way she does, then YOU do them.", "YTA, if you wanna stick your hands in a sink full of nasty water then you can be the one to do the dishes.", "Honestly, this is a pick your battles situation. If you're not willing to do the dishes and she's happily doing them then there is no need to rock the boat.", "YTA. I’m quite sure filling up an entire kitchen sink *and* letting it run for rinsing uses more water than washing everything under a steady stream of water. At least it would in my house.", "YTA \n\nYou want to keep washing all the dishes in the same dirty water ?  That’s gross \n\nYou start washing the dishes then", "I'm not defending what she is doing, but could it be a cultural thing? In my country it's rare to have two sinks and we usually do the dishes as she does. That said, I think you could sit her down and talk about it. Or even remember things that she doesn't like and you don't do, and how you both can compromise. NTA", "Just so I’m sure I’m understanding you, you think that the superior way to wash dishes is to use a sink full of dirty sudsy water? Yeah, YTA.", "I wash the dishes the same way your wife does. Wash them yourself if you have an issue. That being said, I'm gonna go with NTA. Everyone does things their own way.", "NTA, because you're right and this is really weird and wasteful, but it might be easier for you to just take over dish duty than to repeat this argument every other day", "I am sooo conflicted in this one.  I am going with NTA.  I tend to do what ur wife does, but I know it is wrong and gluttonous.", "NTA, why would she want to waste water like that?  Maybe you do the dishes a couple times.  Idk why she would think having the water running constantly is ok.", "pretty sure if this was a woman saying this to a man everyone would say NTA, but noooo, he’s “micromanaging” his wife and “controlling” her every move. if you’re paying for the water, you do have a right to tell her not to waste it. NTA.", "NtA... I also hate when people wash dishes this way", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThe way my wife washes dishes bothers me so much.\n\nShe doesn't plug one side of the sink, fill it with soapy water, wash multiple dishes at once and then rinse dishes in bulk.\n\nInstead, she fills one side of the sink with dry, dirty dishes, turns on the water, let's it run constantly, periodically applies more soap to a brush or sponge, washes one dish at a time, rinses the dish, places it on the drying rack and then repeats this until completion.\n\nWhen I notice her washing dishes in this manner, I tell her to stop wasting water; she always rolls her eyes and tells me to go away.\n\nI pay for water monthly, it's not expensive, but when she does this, I see it as wasting money.\n\nI'm anxious to hear what everyone on Reddit has to say about this one. Am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "If you want to control the process, you own the process. Step up or shut up. \n\nYTA", "YTA you don’t need to micromanage how your wife does things and if you don’t like it, get off your butt and do the dishes yourself.", "YTA\nSince it has very little impact on cost, you don't have a leg to stand on.\nOf you don't like it, you can do the dishes.\n\nI never fill up the sink with water and wash dishes like that when I had no dish washer, but my roommate did. I cannot stand putting my hands in dirty water to grab dishes, it's just gross to me. Once my roommate cut their hand on a knife with their method. Everyone has their own method. We picked up a portable dishwasher that runs off the tap. \n\nLet her be since it literally does not impact you financially by your own admission. You wanting to control her actions without a good reason, is controlling behavior. Knock it off bud.", "YTA\n\nTell me how filling an entire sink with water and then using more running water to rinse is more water efficient? I don't see how one or the other uses more. They are the same. If you don't like the way she does it then you take on that chore 100%\n\nAlso fyi I personally think your way is absolutely disgusting. I do what your wife does.", "YTA. Not only should you do the dishes if you’re so bothered by how your wife does them, but how your wife does them seems far more sanitary than your method.", "You have two solutions here. Do the dishes yourself, or buy a dishwasher- which, by the way, is far more sanitary and less water-wasteful than hand-washing dishes.", "YTA \n\nI wash my dishes the same way dish water is disgusting. I’m not sticking my hand in the dishes bath water 🤮", "NTA. People need to realize water, even if cheap, does not appear magically. OPs method is better and I don't say wife should use it exactly but she could just like, cut the water when she is not using it? It annoys me so much when people waste water too.   \nAnd for all the people saying OP could wash the dishes themselves, I just assumed the fact that they have a way to wash them means they share the task? Why is everyone assuming the wife does it all the time?", "YTA\n\nNot buying the whole \"I pay for the water\" nonsense. I wash dishes this way and I don't exceed the minimum water charge. I'm with your wife, go away", "YTA. My husband is that way with many things I do. I work full time and pay the bills just like he does.  If I want to run water while doing dishes until it goes ice cold and my hands are shriveled prunes, it's my prerogative. Be thankful she's washing them FFS.", "No obviously not. He'd much rather micromanage her, as can be seen in his post history.", "Thank you for saying what we were all thinking.", "This is the only answer.", "And then he can afford a dishwasher! Problem solved!", "This comment made me choke on my glass of wine. So thank you 😂", "Oh, this is actually just the [tip of the iceberg.](https://www.reddit.com/r/AmItheAsshole/comments/z7xtan/aita_for_calling_every_morning/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1)\n\nSounds like she’s recovered from her post partum issues and chronic fatigue enough that he can’t find enough to criticize in her parenting.", "🤣😂💪🏽", "The income is mine and I handle all the bills. Because of this I tend to say \"I\" pay the bills, which is quite literally true, but we are a team and I don't lord over her.", "I'm very active in the household. No one is giving orders from a recliner, haha.", "I remember this post! It made me so angry. \n\nOP, YTA. wash the dishes yourself if you have that much of a problem with it. Let her do it how she likes to do it, she's doing the dishes after all. What are you doing? Sitting there and barking orders at her? Seems like you haven't given the poor woman a break.", "Thank you for linking! The context just makes it look even worse! Leave your poor wife alone! She’s got a lot to do all by herself", "This!", "The income is mine, I handle all the bills and I tend to stay \"I paid this or that\" but it is our money. We are a team.", "Do you think wasting water is okay?", "Right... I'm thinking like shit, have I been doing it wrong this entire time?!?!\n\nThough I do let the dishes soak in super hot water but mainly bc the dishes are caked with dried food from a day or so ago (thanks son), or I'll do them after work so they soak during those 8 hrs. I won't use the dirty dish water to keep my sponge wet/soapy though. That just seems germy.", "I can't afford a dishwasher. I'm trying so hard to get my family out of this trailer park.", "Yeaa same here.", "I have no problem doing dishes. I've actually told her to go away so I could do them because I didn't wanna argue about it, lol.", "The soap is still active when suds are present and visible. A person should obviously change the water when the suds start disappearing and the water becomes a darker color.", "But do you have the tap running the entire time? It's not so much about her not filling the sink with water, but more so about how she has water running when she isn't even using it.", "I can't afford a dishwasher. I'm trying so hard to get my family out of this trailer park.", "My first thought.", "Yes, the tap is on full.", "I can't afford a dishwasher. I'm trying so hard to get my family out of this trailer park.", "I don't hover over her the entire time. It's not micromanagement. I just wish she'd be more conscious of how many literal gallons she uses washing dishes.", "Doesn’t even have to be a cultural thing. When I moved to college, I rented a studio apartment and it only had the single sink setup. I had to get used to washing dishes the way OP’s wife does. I’ve had several apartments since then, and now own my own home. All places since college have had the double sink and a dishwasher, and unless it’s a holiday or dinner party where I will use the dishwasher, I still wash  dishes the way OP’s wife does simply because I became so accustomed to doing so when I had the single sink setup.", "Check his post history. He just has a kink about controlling his poor wife.", "How would you feel if your partner was barking orders at you everytime you did the dishes, that includes their dishes?", "Doubt it since it's a pretty common way to wash dishes for a lot of people.", "Nope would definitely be telling a woman she is an AH if she was doing it to husband.", "According to one of his old posts, he works 12 hours a day, six days a week, while his wife stays home and takes care of their child. What she does is not value-less. Him bringing home the paycheck doesn’t mean that he gets final say in everything that might cost any money at all because she “only” takes care of their child every day, all day, without his help and then cleans the house while he criticizes her.", "Yeah, you weren’t joking this dude uses Reddit as his way to justify micromanaging his wife. \n\nThe answer to all of his questions is yes, because if they aren’t struggling to put food on the table and nobody is getting hurt then who cares? And if they give that much of a shit then they should do it themselves instead of trying to force someone else to do things their way", "Yeah, that’s what I figured, but I was trying to give him the benefit of the doubt. Having now seen his previous posts, obviously he didn’t deserve that.\n\nOP, YTA. Either do the dishes yourself or stop complaining.", "Ah, I wish I could take credit for it as my own. It's from an old 80s movie.  A real classic.  Ferris Bueller's Day Off.  :)  \n\n\nI borrowed it and changed it up a bit, but they were the originals (as far as I know).", "Of course he is that guy.", "Ooooh. This guy. YTA. OP, you think your way is superior and won't allow for the idea that people do things differently. *No one cares about how your wife washes the dishes.* This is such a small thing, let it go! It's like you're intentionally looking for fault with her. She's nicer than I would be.", "Holy freaking crap.", "This woman needs a divorce lawyer.", "You’re lording it in this post my guy. Feel free to pay her a wage for full time childcare and housekeeping including those dishes.", "Wash your own dishes then", "OP, this is not the first AITA post you’ve made about your relationship where everyone clearly sees you as a bad dude. You need to look in the mirror and decide if you can change because your wife is going to realize how horribly you treat her one day and leave you. Wake up, introspect, and stop fucking picking on your wife.", "It's not from a literal armchair, it's the equivalent of backseat driving. Do it yourself or leave her alone", "Spying on your wife with whatever nanny cam system you have and micromanaging her day while you’re at work isn’t actually being “active in the household”.", "Especially when he made that long edit to be like ‘well she says she has chronic fatigue and insomnia but really she just looks at her phone too much’ 😬", "This is even more annoying. YTA", "If you’re a team, why are you trying to micromanage everything she does?", "You’re married. The income is YOURS. Both of you.", "Do you think expecting your wife to do a chore without offering to help her but then criticizing the way she does it is ok?", "it's not a waste of water if she's using it to wash the dishes. do you think criticizing your wife for doing chores is okay?", "Not the person you asked, but if you want me to honestly say I’m concerned about how much water I use while washing dishes, the answer is no, not at all.", "\nYTA!\nDo it yourself all the time then.\nStop criticizing", "So you think being an ass is ok?!", "compared to screwing up your marriage, yes", "Do you think, when there's a shortage, anyone is going to come along and say \"hey, you saved water, so here's an extra ration\" ?", "You start arguments with your wife over how she does she dishes?", "Is that how you said it to her? Because there's a massive difference between \"honey go relax, I'll do the dishes\" and \"go away, I'll do them because I don't want to argue\"", "That’s not how it works… The way you do the dishes is disgusting. YTA and I’m sorry for your wife.", "It costs $2-3 more per month. Do it yourself, buy one less pack of gum a month, or stop whining. YTA.", "I promise, she's aware, it just doesn't bother her", "Yeah I understand 100%, I feel the same way. While it may “only cost 2 or 3 $” it does NOT stop meaning that you’re wasting a valuable and scarce resource of this planet. \n\nHOWEVER, telling her over and over again is not the solution. Do it yourself! AND show her, daily, through other little actions that saving water is an important thing to do and is something important to you. example: while you’re waiting for the water in the shower to warm up, save the water that is being wasted it in a bucket, this way you can use it for the toilet.", "he has the right to tell her not to do it, doesn’t mean she has to listen", "that’s not what i meant, it’s just that he has a point, it is a waste of water", "I’m going to sit down and cry now that I just read the phrase old 80s movie. 😂", "I have not seen that movie in years and would not have recognized the line at all lol. Thanks for the info though!", "No. I asked her why she always runs the water like that when she washes dishes, the argument started and I just told her I'd do them.", "Ya and that makes him an AH", "And washing dishes by hand uses more water than using a dishwasher. So if his primary concern is saving water, he can buy a countertop dishwasher.\n\nTaking a bath uses more water than taking a 10 minute shower. Can the primary wage-earner in every home constantly criticize their spouse if they choose to take baths instead of showers? Or can adult humans be allowed to make decisions about the way they handle normal, necessary activities in ways that factor in more information than just “one uses more water”?", "If it helps, I was already a young mom when it came out. :D"]}