{"id": 15998, "submission_id": "1331ws8", "title": "AITA for giving gifts bags only to the girls who were invited to my daughter’s birthday party?", "selftext": "For my youngest daughter’s 10th birthday party she chose to do a pizza making class/party at a local bakery. Since there was a limit on the size of the party due to the amount of materials that needs to be prep and space available for the girls, I sent out an Evite type of invitation for people to rsvp and get a final count on the guests. I also sent out a reminder that even though the girls will be making their own pizza, the girls will also be getting a light snack and drinks when the pizzas are in the oven. Since it was a baking theme party I went ahead and bought 15 white aprons for kids and personalized them with ironed on cupcakes and other baking motif. I was also able to find other baking related items such as a small whisk for the goody bags. I got all the rsvps and made 15 goody bags for the girls. When we were there to help set up the party, one of my daughter’s friend brought her younger sister along for the party. I was irritated because the invite clearly stated limited space available and I didn’t allow people to bring a plus one on the reply option. I spoke to the owner of the bakery and was able to add one more person (cost of the party was based on the number of participants) but now I don’t have enough goody bags for everyone. I was debating whether I should rush home and miss part of my daughters party to make another goody bag or just not give one to the younger sister who tagged along. In the end my husband and friends said that I shouldn’t have to miss my daughters birthday party with her friends because someone decided to add their daughter to the party without asking us first. So I discreetly went and handed out the favors to the girls instead of telling them to grab one on their way out. The little girl obviously thought she would get one but didn’t say anything. And since it was a drop off party, the parents could just drop them off and come back 2 hours later… however we found out that the mom actually was outside the bakery the whole time and was aware of the situation. She made no attempt to even correct the situation when she realized that there was no additional seating or spoke to us about it. Instead she bought herself some pastries and went outside to chat with her friend. Personally I never met this mom but I was appalled at her behavior. In the end I didn’t want any of my daughters friend not getting a goody bag so I decided not to give that girl a goody bag. So AITA for not giving that little girl a goody bag even though she wasn’t invited in the first place?", "created_utc": 1682789976, "permalink": "/r/AmItheAsshole/comments/1331ws8/aita_for_giving_gifts_bags_only_to_the_girls_who/", "score": 763, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I decided only to give goody bags to the girls who were invited\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. The little girl might be disappointed but that’s her moms fault, not yours. I wouldn’t have allowed the child to come to the party since it was at your expense, and her parent should be the one explaining why. You got stuck in a shitty situation but you handled it fine.", "NTA. Neither is that poor child (I'm sure this isn't the first and won't be the last time her mother thrusts her into inappropriate situations). \n\nIf you *happened* to have an extra goody bag lying around (especially if it were like most goody bags and contained mass produced items from the dollar store) and were refusing to give it to the girl as a matter of principle, that would be an AH-ish thing to do, because that would have been intentionally punishing the girl for something that was her mother's fault. But you legitimately didn't have one available, and it would have required time and effort you didn't have in order to get another one. \n\nFrankly, you handled the entire situation with thoughtfulness and kindness. If the mother had noticed the lack of a goody bag and had the nerve to confront you about it, you could have simply said, \"I only had goody bags for the children who were expected guests.\" \n\nIf you are the confrontational type (I'm not), you could even add: \"I didn't expect to be babysitting an unexpected child... obviously, I won't charge you for the babysitting since it wound up working out okay, just pay me back for the activity. It cost $X and I can accept cash or Venmo.\"", "NTA an unannounced guest isnt your problem. \n\nIt was kind enough to ask the owner to squeeze in another child, and I assume pizza, rather than make the sisters share the pizza. \n\nYou could have given the two sisters the goody bag and told them they can share it.", "NTA but what is it with some parent thinking it's okay to bring a tag along to birthday parties? If they weren't invited they can stay home, since mom obviously didn't have important plans.", "First let me say SOOO not the AH!! I actually had to put my phone down for a few minutes I became so pissed after reading this! PISSED!! I have had this happen to me many times. From personal birthday parties to class room parties where the teachers actually sent emails stating NO siblings allowed. The audacity of parents! My sons 2nd grade Christmas party had not one but two moms EACH bring in 3 siblings. And neither mom sent in anything off the donation food list. When refused admittance to the class room the one mom started ranting well who cares Santa doesn’t exist. I have personally had two birthday parties at a Chuck E. Cheese that I was limited on seats. I was nice enough to order extra pizza for the parents who stayed around. But a dad who brought his two daughters along, since it was only fair as he said, took/confiscated an entire pizza, and walked off with his girls to another table. You are more than correct in giving out the goody bags to the girls that were invited. Since her mom felt entitled to insert the other daughter it’s on her if there’s an issue. You may not know this mom, but I would certainly keep it in the back of my mind should you ever run into her and bring it up? Unfortunately you can’t and are not allowed to fix stupidity with a 2 x 4!!! So long as your daughter had a great party, and was happy, that’s all that matters. But remember this for the next party!", "NTA but I would have told her mother a thing or two on my way out the door…", "NTA That girl will soon realize what a flake her mother is when things like this keep happening. This isn’t on you, and your daughter needs her you at her birthday party. You put incredible thought and work into this, and you should get to deserve it without the rudeness of this mom taking that from you.", "i don’t think you’re TA. RSVP exists for a reason and she should’ve RSVP’d for both kids instead of deciding to slide the other one in", "Obviously your not the a-hole", "NTA there was really not much you could have done in this situation, especially since you made it clear there were to be no plus ones. The mother is clearly TA, trying to sneak her other uninvited kid in for free babysitting.", "Of course nta.", "NTA - The mother was extremely rude.", "NTA\n\nThe accomodation was nice. Every single parent knows you need to ok the siblings at birthday parties, ESPECIALLY if it's a drop off, or limited invite.", "NTA\n\nThe fact you didn’t immediately call the girl’s parent and say, “the party is for invited guests only, come get your child” says you are absolutely NTA.\n\nThe child got to participate, which cost you extra $$.  Meanwhile, the mom got child free time to veg out.    \nSorry, but you didn’t have a gift bag for the extra, uninvited, child.  Happens.", "NTA, you were used as free childcare.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor my youngest daughter’s 10th birthday party she chose to do a pizza making class/party at a local bakery. Since there was a limit on the size of the party due to the amount of materials that needs to be prep and space available for the girls, I sent out an Evite type of invitation for people to rsvp and get a final count on the guests. I also sent out a reminder that even though the girls will be making their own pizza, the girls will also be getting a light snack and drinks when the pizzas are in the oven. Since it was a baking theme party I went ahead and bought 15 white aprons for kids and personalized them with ironed on cupcakes and other baking motif. I was also able to find other baking related items such as a small whisk for the goody bags. I got all the rsvps and made 15 goody bags for the girls. When we were there to help set up the party, one of my daughter’s friend brought her younger sister along for the party. I was irritated because the invite clearly stated limited space available and I didn’t allow people to bring a plus one on the reply option. I spoke to the owner of the bakery and was able to add one more person (cost of the party was based on the number of participants) but now I don’t have enough goody bags for everyone. I was debating whether I should rush home and miss part of my daughters party to make another goody bag or just not give one to the younger sister who tagged along. In the end my husband and friends said that I shouldn’t have to miss my daughters birthday party with her friends because someone decided to add their daughter to the party without asking us first. So I discreetly went and handed out the favors to the girls instead of telling them to grab one on their way out. The little girl obviously thought she would get one but didn’t say anything. And since it was a drop off party, the parents could just drop them off and come back 2 hours later… however we found out that the mom actually was outside the bakery the whole time and was aware of the situation. She made no attempt to even correct the situation when she realized that there was no additional seating or spoke to us about it. Instead she bought herself some pastries and went outside to chat with her friend. Personally I never met this mom but I was appalled at her behavior. In the end I didn’t want any of my daughters friend not getting a goody bag so I decided not to give that girl a goody bag. So AITA for not giving that little girl a goody bag even though she wasn’t invited in the first place?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- next time (if there is one) make sure to personally message this mom and let her know that ONLY the invited girl is allowed. The sad thing is this mother is probably going to do this enough that her daughter will stop getting invites to anything unless its a mass party event (and maybe even then). Plus the fact that she cannot get away from her sister for some time with just her friends is going to basically kill her social life when she gets older.", "NTA that is not your problem since she wasn’t even invited. Idk why parents think it’s okay to send a sibling along to someone else’s party", "NTA, you're not responsible for her parents tagging her along uninvited. You were kind enough to get her added to participate in the activity, that's more than enough. It's not as though you intentionally skipped a goody bag for her out of maliciousness, you prepared enough for the children meant to be attending.\n\nThe only thing I maybe would have done differently is giving the goody bag to both girls, letting them know they would have to share because you're sorry you didn't know little sister was attending, so unfortunately there weren't enough.", "NTA. When I read the title, I though you only gave the girls invited a goodie bag, and not the boys invited, and I was instantly thinking yes! YTA \nBut then I read the whole thing, and it sounds like you tried really hard to give the girls' a magical experience, and included the extra child to the best of your abilities at the last minute. I have NEVER shown up with extra people to an occasion I was invited to without speaking with clearing it with the host prior. That mom is the one that needs to take ownership of how her daughter felt, and hopefully she learned not to do that again, but I doubt it.", "[deleted]", "[removed]", "NTA \n\nThis is the fault of the other mom. She brought her daughter without invitation.", "NTA. She wasn't invited.", "Exactly. Drop off children party fee includes child watching fee, and OP had to pay extra for a younger child who was not invited.", "I disagree with telling the sisters to share the bag. The invited one was likely irritated that her sister is tagging along, and would have felt further irritated by being the only girl sharing with someone else. \n\nOP, you are NTA by a long shot.", "wow,  that dad is sure rude and entitled", "The parent should have just not dropped off the extra child, period.", "Nah, she'd still be the AH if she did that. If you're not invited, you can't just add yourself to the RSVP.", "OP didn't take anything out on a child. There were 15 bags for the 15 invited kids. OP had 3 choices:\n\n1) Take a bag from somebody who _was_ invited\n2) Don't give anybody a bag\n3) Don't give +1 a bag.\n\nObviously, #3 is the best here. It is +1's mom who is abusing OP for free childcare. She could've taken +1 to anywhere else instead of just shoving her through the door and making it OP's problem.\n\nOP has been generous enough to accomodate the activity and free childcare. _Too_ generous I dare say.", "how did op take it out on her child? sounds like you didn't even read the post", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Are you saying that in your country you pay the place extra and they help you take care of the children?", "I didn’t give him the cups I had in my hand for the parents. He asked my husband where were their drinks. Hubby told him he had to purchase them and for the girls. Called my hubby a cheapskate.", "yeah that’s definitely the much better option", "No. I’m in US. And I work in childcare field.\n\nPlaces offer children’s activity party have staff who supervise activities (in this case, bakery staff teaching how to make pizza is also watching children, that’s why parents can drop off children and leave). And they often charge per child fee which include space, material and teaching and watching children (making sure no one is touching hot oven, etc).\n\nIt’s different if event place is just renting out space without any staff attending. Then people need to watch children by themselves (doesn’t mean all parents).", "I don't think it's necessarily to actually take care of the children. I think it's to help cover their liability costs, in case one of the children gets hurt at some point on their property.\n\nThe exception to that being if it is an activity that the staff has to participate in. An extra child is extra work for the staff in that case.", "I understand what you saying and it’s not “baby sitting” because they are not responsible to change kids clothes or something. But making sure to keep kids from hot oven is “watching kids” in sense, that’s what I meant.\nIf it’s adult baking class, instructor doesn’t need to tell someone not to cut finger with knife or touch oven.\n\nSince I’m familiar with young children’s event place, many places around me offer drop off party for 5yo+ (if activity is for older kids like coding, age according to activity, again coding place near me takes 6yo+). 5yo is still age requires supervision.", "INFO\n\nDid you have a confrontation with the mother?", "NTA\n\nYou accommodated an uninvited guest as best you could.\n\nHer mother should be embarrassed.", "Not at all she wasn't invited she's lucky you let her stay she should have been sent back out to the car to her parents or that you provided her any food because you only planned on 15 The mother will continue to do this every single time and she's not the only one that does this", "NTA of course not.  This mother, who you have never even met, sent her youngest kid in to have a child free afternoon, without even bothering to ask you first. She’s lucky you were able to work it out with the place, so the kid could even participate.", "NTA but that little girls mom sure is! How terrible to leave her child alone to deal with that.", "NTA\n\nBut the mom is. She dumped her other child on you for free babysitting.", "NTA, absolutely.", "Geez what a bastard thing to do to her own daughter!! Imagine if the place couldn’t accommodate her, how awful she would have felt. I have a feeling not getting a goody bag is the least of that child’s problems with a mother like that. Read through think “god she must have had a really good reason to do that” but no just wanted some free babysitting while she chilled with a pastry. I hope I’m wrong poor kid.NTA you kid deserves to have her mom at her birthday.", "NTA by literally the length of the universe. There isn't any way you could be the asshole here. That being said... lol I know... I would suggest making a few extra if you do something like this again. It would make it so you don't have to worry about this sort of thing. Plus, a few extra might be annoying... or you could give it to somebody else who doesn't attend. A friend with a sister or something. Or don't because I guarantee that mom won't do this again after listening to her daughter cry.", "She thought you were a \"free babysitter\" so she could chat with her friends.", "NTA, but that other mother merits the label!", "NTA.  You were kind enough to allow her to participate, which I presume you paid for. The mom was incredibly rude.  I feel sorry for the kid.", "NTA.  You issued an invitation that made it very clear that space was limited to 15 people.  You planned on 15 people.  You prepared goody bags for those people who RSVP'd.  It's not your fault the little sister was a party crasher.  That's on her mother.  Her mother should have dropped off the older sister and then taken the younger daughter to some other fun activity.", "I feel horrible for the little sister. Her mom is an AH for putting her kids in that position. And, depending on the age of the little sister, she would only know that she is being left out but not why. Kids remember stuff like that. \n\nThat mom deserved a telling off.", "Or asked their mother to pay for the extra place.", "Yeah, this. When doing parties for the kids, we've always been clear on the rules about it. The mum chose to dump the extra kid on you, she gets to deal with the consequences. NTA", "RSVP would have given OP the opportunity to turn down the second child. That mom with two kids knew exactly what she was doing.", "Who even does that ? I have 3 myself and I have never nor would ever just send another of my kids along like that .. it’s bloody rude", "Seriously. My older kid was invited to a party at a public play place, and I brought my younger kid since we were driving there anyway—but I paid admission for my extra kid and played with them away from the party stuff. The parents offered pizza and cake to my extra kid, but we didn’t get a goody bag, and I explained why to my extra kid.", "A lot. At my kid's party at an arcade, one kid showed up with her friend we'd never met before and the parents just dropped them both off without any notice. I gave her a game card because I felt like excluding her would be cruel, but I'm still irked.", "That dad belongs in Reddit’s ‘Choosing Beggars’ forum. \n\nNTA to your or OOP", "NTA. That parent put you in an awkward position and you handled it as well as you could given the circumstances.", "NTA. Your due diligence was to serve each of the girls with an RSVP. You already went above and beyond by getting food for the girl who arrived without any warning. Not going above-er and beyond-er isn't q fault against you.", "NTA. The little girl might be disappointed, and that is too bad. But when the mom came in to get the girls, I would’ve said, “Sorry, I didn’t know she was coming so I didn’t have a bag for her.” That’s it. The mom will probably never take responsibility for putting her younger daughter in the situation, though.", "Definitely NTA. My younger son attended a birthday at an indoor trampoline park. I wasn’t going to take his older sister but then I ended up having to last minute.\n\nI paid for her to bounce and then ASKED if they gad extra gift bags. They did - but I prepped my daughter for the possibility of a “No”", "YTA. It's a child's birthday party, not yours. She is not an extension of you, there are things you cannot control and you have to get on with it. Always prepare a few extra bags and put some candy or knick knacks or something. Is this your first year parenting a child?", "[removed]", "NTA. It’s not your fault that mom messed up here", "NTA! Perhaps you could have given the goody bag for the invited child to both her and her sister, but you had no obligation to accommodate an uninvited guest. Kindness? Always. Bend over backward? Not so much.", "NTA obviously, why did you post this? No one accused you of being an asshole and you obviously acted reasonably.", "Always make 3or 4 extra, you would rather look classy and generous than petty and teaching exclusion. If you can afford to be extra, be awesome.", "One of the easiest NTA verdicts. You didn't invite the girl, you had no warning that she was coming, and she's apparently not a friend of your daughter.\n\nShe's lucky you let her stay and didn't send her back to her pastry-hoovering mother", "It seems as though so many parents do this, dumping younger siblings off at birthday parties the older sibling was invited to. Bloody rude and entitled crap.", "Nta the mom used you as a free babysitter for the younger one for some time with her friend. This is not your problem.", "NTA I always made a few extra goodies bags just in case but that is my type A personality lol", "NTA", "Lmfao. Rich people problems. NTA", "> But a dad who brought his two daughters along, since it was only fair as he said, took/confiscated an entire pizza, and walked off with his girls to another table. \n\nI hope you asked him in front of others to pay for the entire pie that he took and walked away with", "The invitation was to ONE child, not the family. The mother still would've been the AH if she'd RSVP'd for anyone other than the one who was invited", "People this entitled don’t get embarrassed because they believe they and theirs are literally entitled to anything they want. And they hold as a life goal “getting things for nothing”.", "Wait, you would actually tell the little kid she can't come in?", "Why on earth have you been downvoted???", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Why should she reward rudeness? She already paid out of her pocket for the uninvited kid, and now she should buy extra goodies for any other \"surprise guests\" that malfunctioning parents decide to stick her with?\n\nMaybe the way to stop this woman is to make her explain to the tagalong why she didn't get a goodie bag and apron", "NTA. \n\nI reckon the girl was pissed her sister was tagging along. \n\nSounds awful, but give them the bag, say they'll have to share. The fighting and bitching between the two will be karma for their mother.", "If the mother did what happened here, I would let the kid in.  Most parents know not to dump an extra child in a party not happening in a house...for that matter, this would not have been good to do if it were happening in OP's house.", "This happens all the time. For my son’s birthday, we had at least 4 kids who were invited show up with siblings without the parents asking if it was ok. It’s incredibly frustrating, especially because we ran out of goody bags too.", "Your husband should've replied \"Better a cheapskate than a thief!\"", "This sounds like something on r/EntitledPeople. Definitely NTA.", "NTA. It sucks for her, but it's her mother's fault she experienced that, not yours.", "Nta. You got 15 rsvp thuse you made 15 goody bags. Not your fault one patent made the decision to invite their other child to a party said child was not invited to.", "NTA. I think you should Venmo request bonus kids mom for the extra charge plus a hassle fee.", "NTA. \nI would have talked to the mom and mentioned that you didn’t have a goodie bag for her since she wasn’t in the guest list. Even if it’s been a few days, next time you see her apologize for not having her a bag. Maybe she’ll get the hint and won’t do it again to someone else. \nIt boggles me that she didn’t even care about the limit or leaving an extra kid", "NTA\n\nThe mom got 2hrs free babysitting yet it cost you extra.", "Ok, based on the title, I really thought that you didn't give goody bags to the boys invited. But NTA, you didn't invite the sister. The mom should have checked, and you didn't have enough. At least you found a way for her to participate.", "NTA. It was sweet of you to be as concerned as\nYou were about the little sister not getting a goody bag. I feel like as parents we know to text or rsvp if a sibling has to come. I always offer to pay when Dad has to bring an extra child to a party because I work weekends. It’s never an issue because we communicate our situation. Sorry you had feel so stressed!", "NTA- my daughter is 14, dishes are one of her chores. Luckily she doesn’t have any allergies, but if she did I would not make her touch anything she couldn’t. \n\nIf we wanted a certain food she couldn’t touch I would either A) try to eat it at a time she wasn’t here. (Staying over at a friends house for the weekend) B) swapping a “chore” with her. Like I’ll go ahead and get the dishes ready, could you sweep the floor while I do the dishes? \n\nYou’re supposed to support your children and help them how to navigate life. No matter the age!", "NTA. You made it very clear why you needed a headcount. It’s sad that that kid didn’t get anything, but the adult who dropped her off shouldn’t have given her those expectations.", "NTA\n\nYou were not informed beforehand that she was coming so she didn't get one.", "NTA.\n1. The Mom should have asked to bring the sister.\n2. The Mom should have paid for the sister.\n3. The Mom should have warned the sister she wouldn’t be getting a bag.", "NTA \n\nBeen there. Last year everyone came with younger siblings. One lovely kid decided to hand out the goody bags I had on a high shelf. Invited kids were left without one. I. Was. Furious. Come on parents.\n\nYanked out some bubble wand things and redistributed.", "No, I didn’t want to cause any distress to my daughter’s party. After talking to some other moms, it looks like it’s been done a few times before.", "Why’s oils she make extra when a specific amount of people are invited is she throwing money away ? Secondly sorry to break it to you but no accommodating someone that wasn’t invited nor expected is not teaching petty or exclusion it’s simple boundaries you need to learn in the real world. No you can’t just invite yourself to parties and play victim if you don’t get treated as a guest", "Who is paying for the party ? The child ? Why on earth would she prepare extra bags when there is a limited about if people invited. Maybe dint be rude and bring people that aren’t invited then complain about not having a gift bag. Do you tell people to pay for extra seatings and food at their wedding in case you’re an ah and invited people without permission ?", "Where the idea come from that you're possibly being an asshole, then?", "She's not. She is being prepared for anything.", "It’s really rude. I have three children and if one is invited to a party, we usually take the other two to the same place or a place close by BUT we pay for them, we tell the parents of the birthday child that we are there with our other children, and we make sure they stay out of the way.", "Apparently a lot of people do it.  I’ve read soooo many similar stories.", "Or better- saying they don’t have to share"]}