{"id": 16030, "submission_id": "133gt0e", "title": "AITA for wanting custody of my brother after my father's death?", "selftext": "\n\nI (23F) lost my mom in an accident when my younger brother Jaime was just five months old. Since our father was always working, I took care of Jaime whenever I wasn't studying for months, and my aunt helped out when I wasn't available. \n\nWhen Jaime was nine years old, our father brought his new girlfriend (now stepmother) to live with us just four months after our mother's death. I didn't get along with her because I suspected that she and our father had been having an affair while our mother was still alive. However, she became Jaime's primary caregiver and raised him like her own son. \n\nAfter a troubled first year we managed to keep our balance by ignoring each otherwe, we only fight when she wanted to legally adopt Jaime (She tried like 5 times), which my maternal grandparents and myself objected to. In the end, my father agreed to wait until Jaime was old enough to decide for himself.  \n\nI went to college in the same city as my maternal grandparents when I was 17, but I visited my brother every weekend that I could. Now, I live in the same city as my grandparents with my boyfriend, and we often play online games with Jaime. \n\nUnfortunately, our father passed away from a sudden illness caused by an unknown heart disease three weeks ago. When I spoke to my stepmother about bringing Jaime to live with me, she didn't react well and said she wouldn't let me take her son. However, I am now Jaime's legal guardian since our father has passed away, and I believe it's in his best interest to live with me in a bigger city with more opportunities and more contact with my maternal grandparents. \n\nMy stepmother has threatened to go to court to adopt my brother, but I plan to look for a lawyer as soon as possible. She also suggested that we let Jaime choose who he wants to live with, but I don't think it's fair to leave such a difficult decision up to a young child. \n\nMy paternal family and stepmother's family are calling me a monster and saying that I want to take a child away from his mother. They also say that I won't know how to discipline him. However, I love Jaime just as much as my stepmother does, and I believe it's in his best interest to live with me. My maternal family and fiancé support me, but I'm wondering if AITA?\n\nEDIT: The cities are 3 hours away, I proposed to take him home every other weekend and she can visit him whenever she wants. \n\nEDIT 2:From previous experiences where she tried to stop my brother from spending time with my maternal grandparents I know she would do the same to me.", "created_utc": 1682832793, "permalink": "/r/AmItheAsshole/comments/133gt0e/aita_for_wanting_custody_of_my_brother_after_my/", "score": 47, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Maybe I'm the asshole because I want to take my brother out of the city and house where he grew up to come live with me in another city against the wishes of our stepmother whom he considers his mother\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nStep parents usually never get custody of a child over a full blooded relative.\n\nBut talk to your brother about what he wants", "INFO\n\nI'm a bit confused on the timeline. The first paragraph says he was 5 months old when your mother passed, and then the second says he was 9 years old. How long has he been living with your stepmother, and how old is he now?", "I think even the courts will look for what's best for the child. What does he actually want?", "How old is your brother and what does he want?\n\nHow much money did your dad leave for your brother's care, and is it enough for you to care for him?", "Info: what is actually best for little bro? Does he have problems with step mom? Does he have friends there / enjoy his school? Why would he be better with you?\n\nSounds like (if we are doing what is best for him) rather than taking him away from the person who has raised him most of his life, you could go there for more support. \n\nSeems a bit more like you are doing it because he is rightful property instead of what is really the best thing for him? You can be there for him anyway without uprooting him", "Per your comments, she has been his stepmother since he was 9 months old (or at least in his life since then. For HIM, she is the ONLY Mother he knows. He just lost his Dad too, and now you want to take him from the ONLY mother he has ever known. You haven't lived at home for years. How can you think the best thing for him is to uproot EVERYTHING he knows after losing his Dad. Blood doesn't always make family.\n\nI imagine your Dad had a will. Has this been read yet? What makes you believe you are his legal guardian?\n\nAlso YTA. He would lose everything he knows.", "YTA. From your own words, stepmother has acted in a parental role for Jaime since he was 5 months old. She may not have adopted him legally, but he is his adopted mom regardless. From what you've written, I think you may be letting your hurt over your losing your mom and your anger at the possible affair your dad dad with stepmom overshadow what's best for your brother. Of course your mom can't be erased, but stepmom has been acting as his stepmother for his whole life basically. And now you want to force him to be uprooted after he just lost his dad, and come live with you without even asking Jaime what he wants? That's just cruel. You need to put what's best for your brother ahead of your own emotions regarding your stepmother.", "As far as he is concerned, that is his mother. He was a baby when she came into his life and that is the only mother he has ever known, correct? So his dad died and now you want to take his mother away? If she truly loves him like her own son, I think that would be a heartless thing to do to both of them. Is she not a good mother to him? Or do you just feel you can do better? I am afraid it may do more damage than good to rip him away from the only mother, he's ever known. I understand you were upset that she has tried to erase your mother from his and your lives, but he has no memories of your mother. Only of her. I think it would be emotionally traumatizing for him.", "I’m so sorry for all your losses, OP. This can’t have been an easy path to walk. \n\nNTA. \n\nThe problem is that you haven’t really shown where your step-mom is a bad parent. She’s been parenting Jaime since he was an infant. She’s the only mother he’s ever known. She’s super attached to him and I would hope so! \n\nI get that she’s not your mom and you feel like she was waiting in the wings to swoop in. But idk if that’s a good enough reason to take Jaime away from his mom. \n\nI agree with you that asking Jaime what he wants to do seems a bit much for a 9 year old boy to navigate. If he was 12-13 I’d say to ask his opinion. He is being pulled in two directions and probably doesn’t want anyone to be mad at him or to give the wrong answer. He’s had enough loss. \n\nSo, there can never seem to be a wrong answer if you decide to go the route of asking him. \n\nBoth you and step mom have to get together and agree that no matter what his opinion is you won’t punish him emotionally or hold his opinion against him. And he has to know that. \n\nYou’re both trying to do right by him. This is a hard situation, OP. No one is an asshole here. But please if you do decide to go for custody, bend over backwards to make sure he can see his mom very regularly and that she is a part of his life", "YTA for not talking to your brother about whether or not he wants to upend his life and move somewhere else.  \nYour brother has been at least partly raised by someone he considers his mom. He has a house, a room, and a life. He presumably has friends. He deserves some consideration.  \nIt sounds like you've been at odds with your stepmom from the very beginning, but it doesn't sound like she's really done anything but marry your widowed father and help raise his motherless child. Even if you don't have any feeling for a woman who just lost her husband and now may lose her son, certainly you could have some feeling for your brother about taking him away from his mom.", "YTA for wanting to drag a young child away from his friends, his home, and the only mother he's ever known. \n\nYOUR bad relationship with your stepmom is coloring your view here, and you're projecting that, and trying to put him in the middle of a legal fight while he's grieving, instead of considering his ACTUAL best interests. \n\nPlease stop. I feel for you, but please stop.", "NAH but you should consider that your stepmother is the only mother your brother has ever known. He should definitely have a say in whether he loses the person who has mothered him for 9 years. Just because you don’t have a good relationship with her doesn’t mean he feels that way. Tread carefully. You could be doing a tremendously cruel thing to your brother.", "NTA. I'm sorry for your losses. Your mom's family deserves to see your little brother, and I would totally worry that the stepmother would keep him away from them.", "Your timeline doesn't add up. What's the child want, you didn't mention anything other than yours...?", "YTA. I don’t like what your stepmother said to him, but regardless she’s the only mother he’s ever known. He just lost his father and now you want to take him away from his mother??? I doubt any child would choose that even if she hadn’t said that to him. \n\nSo long as you aren’t leaving out any details such as her being abusive, you would be the asshole, and risk making your brother hate you. \n\nYou can be part of his life and visit, and you should, but taking him away from his mother should be a decision he makes when he’s old enough.", "This woman has raised your brother like her own since he was a few months old. Your dad was hardly wealthy, so it's not like she's using your brother for some big financial gain.\n\nSo, if your mother passed away when Jamie was 5 months old and your dad moved his girlfriend in 4 months later, that means she's been raising Jaimie for over 8 years. \n\nSince then, you've seen Jamie on weekends, you've played online games...but you've never raised a child, full time - that's breakfast, lunch and dinner, that's laundry and cleaning and doctors appointments and taking him to school and back, doing homework, doing play dates and not being able to go out and have fun anywhere near as often as you're doing now. It involves money and sacrifice and energy. Do you work? Does your boyfriend work? What happens if you break up?\n\nAnd yes, I think you *can* and *should* ask your brother and have that discussion; he's young but he can tell you what he wants.\n\nAs for opinions flying left right and centre - of course your maternal grandparents will be against the woman who your dad possibly cheated on their daughter with...but again, this isn't about you or them. It's about a 9 year old boy who has grown up with *this* mother, even if she's not blood related, the feeling for him is the same since he wouldn't have any memory of your bio mother. So he lost his dad and now stands to lose his mom...I can imagine that will mess his up big time. \n\nDon't let your dislike for this woman or whatever assumptions you've made along the way cloud your judgement.", "YTA - you don’t live with Jaime, he just lost his father, how is uprooting him from his home and moving him to a place he doesn’t know going to be beneficial to him?\n\nYou playing games with him, online, and visiting every now and then is not equivalent to a parent who is there every day.", "I’m confused you said you lost your mom when your brother was 5 months old then when your brother is 9 yrs old the girlfriend comes into the picture 4 months after your mothers death ?? That doesn’t make sense", "So sorry you lost your father - what a sad situation. \n\nI think you need to put yourself in your brother’s shoes. It doesn’t sound like your stepmother is so awful it warrants removing your brother from the only home & mother he’s ever known at this point. Taking him away at this point sounds like it would compound the trauma of losing his father. \n\nCan you take a ‘wait and see’ approach. Make sure stepmom is looking out for him. Increase visits in person to keep an eye on things and IF there is evidence (other than not liking this woman) she’s not treating him properly or she tries to prevent you from seeing him - then take a more forceful approach. \n\nAlso - you need to dial in a little more compassion for stepmom. The fact she would be devastated if your brother moves away is a good thing. It means she loves him truly. Try to imagine losing your husband suddenly and then have the possibility of losing a child you raised. That is terrifying and totally devastating. \n\nBe careful about putting brother in the middle. This can be an impossible situation to be in and cause him even more emotional distress. It’s very common for children of divorce to experience trauma from this. \n\nYou need to really think about what’s absolutely best for your brother and put that ahead of your experience and emotions. He’s had a different journey than you and you need to understand where he’s at.", "So your mom died when jamie was 5 months and four months later when jamie was 9 your step mom moved in op can you explain\nEdit: acording to your comments after a year college and an unspecified amount of time he is still nine", "NTA.  Children should live with their guardian.  And if you're your brother's legal guardian,  then he should live with you. \n\nHowever, older children do have some legal rights. And if your brother decides that he wants to be adopted by his stepmother and to live with her,  you may have no say in the matter.", "His poor poor stepmother. She has lost her husband and now facing losing her 9 year old son who she raised since he was a young infant and who she had tried many many times to adopt only to have it blocked. YTA", "NTA\n\nYou were Jaime's main care giver for a long while and you've continued to be active and involved in his life. If you're able to provide and care for him, and if that's what he wants at this stage in his life, then you can't be an asshole. You're going to be providing what a kid wants and needs.\n\nThat said, you should proceed calmly and without rushing into things. It's going to be a hard time for him already. Change only makes things harder. Make sure he's handling the grieving process and ready to even talk about moving. When he's ready to talk about it, find out what he wants. There are some logistics you'll have to factor in: moving means leaving his friends and starting somewhere new. It may be best to let him finish out his current school year where he is and then get him moved in with you. Losing his friend group like that can make the trauma worse, it can be isolating. Unless he's unhappy with his stepmom, if he's not doing well in that house, then you may have to screw the complications and just move him.", "NTA - If you're the legal guardian, there really isn't any discussion. The stepmom could have adopted him before your father died. I have a hard time taking the stepmom seriously here.", "YTA barring INFO: if your step mom was legally married to your dad you have less legal say over your brother's rights than her, so that's where I'm getting confused... where exactly are you feeling in the right legally at this point", "Nta", "100% NTA get yourself a good lawyer and listen to your gut instinct, he’s your boy to raise!", "NTA he is your brother, speak to your maternal grandparents about getting a lawyer. She had no legal rights to him! The emotional abuse has already started, don’t let it get any further because it’s just going to hurt him even more. Good luck", "That child is YOUR family.  Stepmother is NOT!  Fight for your brother, and I would bet if asked he would NEVER choose sm over you, **EVER!**", "[removed]", "NTA.\n\nThat’s literally not his mother. Get a lawyer.", "[removed]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\n\nI (23F) lost my mom in an accident when my younger brother Jaime was just five months old. Since our father was always working, I took care of Jaime whenever I wasn't studying for months, and my aunt helped out when I wasn't available. \n\nWhen Jaime was nine years old, our father brought his new girlfriend (now stepmother) to live with us just four months after our mother's death. I didn't get along with her because I suspected that she and our father had been having an affair while our mother was still alive. However, she became Jaime's primary caregiver and raised him like her own son. \n\nAfter a troubled first year we managed to keep our balance by ignoring each otherwe, we only fight when she wanted to legally adopt Jaime (She tried like 5 times), which my maternal grandparents and myself objected to. In the end, my father agreed to wait until Jaime was old enough to decide for himself.  \n\nI went to college in the same city as my maternal grandparents when I was 17, but I visited my brother every weekend that I could. Now, I live in the same city as my grandparents with my boyfriend, and we often play online games with Jaime. \n\nUnfortunately, our father passed away from a sudden illness caused by an unknown heart disease three weeks ago. When I spoke to my stepmother about bringing Jaime to live with me, she didn't react well and said she wouldn't let me take her son. However, I am now Jaime's legal guardian since our father has passed away, and I believe it's in his best interest to live with me in a bigger city with more opportunities and more contact with my maternal grandparents. \n\nMy stepmother has threatened to go to court to adopt my brother, but I plan to look for a lawyer as soon as possible. She also suggested that we let Jaime choose who he wants to live with, but I don't think it's fair to leave such a difficult decision up to a young child. \n\nMy paternal family and stepmother's family are calling me a monster and saying that I want to take a child away from his mother. They also say that I won't know how to discipline him. However, I love Jaime just as much as my stepmother does, and I believe it's in his best interest to live with me. My maternal family and fiancé support me, but I'm wondering if AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Edit because I found the response to my question in other comments.\n\nI think this is a complicated situation and it might be better to get a guardian ad litem to make the final custody decision.", "YTA, not because him coming to live with you MIGHT not be the best plan, but because it’s pretty clear from the comments that you are making your decision selfishly based on your distaste for your stepmother - which seems caused more by your own grief for your mother and suspicion of your father than anything negative she ever did to your brother - and then telling yourself that decision is in his interest rather than yours. \n\nI honestly don’t know where brother should end up living, but your attitude needs to change so you can help find the correct answer rather than making him the rag doll in a sad game of tug of war.", "Honestly you don’t appear to be putting your brothers interests before your own. Stop worrying about the what ifs. Your stepmother clearly loves your brother. You have no indications she won’t properly care for him. Stop trying to destroy his life. The more you respond the more I feel you are completely selfish and manipulative.", "YTA. First of all, I’m really sorry for your loss. And my perspective might not be the right one and I’ll probably get downvoted to hell. But I’m going to say it because I would rather you think this through from every angle. Your fears are hypotheticals. “She could try to keep him away”. Well, she hasn’t. And if she does, there are ways to handle it. “She might get married again and he won’t like the stepfather.” That’s a pretty big if. And then if that becomes an issue you can move him then, if that is what is best for him. \n\nHe’s nine. He’s about to enter an extremely crucial developmental stage that is going to define his entire life once he grows up. And teenagers are so insanely difficult to raise. Now is not the time for you to be taking a stab at playing parent when there’s another option available. She has raised him for his whole life. He sees her as his mother, he will always see you as his older sister. He’s already going to grow up with a massive early childhood trauma from losing his dad, you could really screw him up for life by doing this.", "My problem with this is that my stepmom freaked my brother out by saying she couldn't live without him. Moved him a bit, I don't know how sincere he'll be after hearing something like that", "I wondered this, too.", "After I brought it up to my stepmother she ran to him and said she couldn't live without him, now he's scared to move. That's why I don't think he should have the final word, my stepmother was quicker and already started with the emotional nagging", "My father had a comfortable life but he had almost no money saved, I think he didn't expect to leave so soon, so it's basically the house, I don't know what will be done about it yet, but my maternal grandparents have a good financial condition, I live in a house they lent me I have a nice job but if need be I know they would help with anything.", "I think thisis the case too, SM is after some money or property dad had. And under the guise of taking brother she might able to claim his portion of inheritance.\nNTA, please look into it.", "9 Years", "I genuinely feel that the best thing for him is to live with me \nHe loves our maternal family, which in my opinion creates a healthier environment for children. \nHe does have friends at school, but he also has several dear cousins ​​in my city\nThere is no 100% happy choice, If I believed it existed I would give him the option with the highest probability, But what prevented my stepmother from alienating my brother against my maternal family was my father, and now that he is dead I need to guarantee the rights of my brother, my mother's family and my.\nI live only 3 hours away from my stepmother, I won't stop her from seeing him and I even suggested that I could take him every 15 days to see her.", "He didn't have a will,\nI am fully aware that she is a mother to him, but she is also a complicated person\nUnfortunately, no one will win with this situation, it will be painful whatever the decision. If by chance my stepmother gains custody of my brother I'm sure she would try to keep me away from him.\nIt's not like he can never visit the people of the current city again, from my city it's only a 3 hour drive there.", "What makes me think I can't take his opinion into account is that my stepmother ran up to him and said she couldn't live without him if he left as soon as I had the conversation with her.\nI don't know how far this can affect what he really wants", "As the cities are only 3 hours away I suggested leaving him every other week to our hometown, I don't intend to stop them from seeing each other. My fear is that I know if she can She will make our relationship difficult as she tried to do with my maternal grandparents. \nAnd my other fear is about the future, she is young, she will probably get married again, How can I sleep not knowing if the people in her future will be nice to my brother, I wouldn't want him to have the relationship I had with her with a future stepfather.", "This. AITA hates stepparents SO MUCH and often for no reason. Thank you for a rational response.", "My stepmother talked to my brother before me and said that she would not be able to live \nI consider it emotional blackmail \nSo his view of change has been corrupted", "I'm sorry, but although I don't have a good relationship with her, I believe I have reasons for that, she always tried to push my maternal grandparents out of my brother's life and replace her with her parents, this is reality and i can't be sure she won't try to push me away from him if i just leave him with her.\nI know she loves him and he loves her, I will never stop her from seeing him, I committed to taking him to her city, and she might as well drive 3 hours to see him.\nIt's a cruel change given the circumstances, but some things are impossible to avoid.", "I will never forbid her to see him, but I know she would stop me from seeing him if she had the chance, that's my fear.", "The stepmother has raised this kid since he was around 9 months old to now, 9 years old. She is the only mother he knows. Visitation could be written in some kind of agreement. Not taking a child that lost his father from the only mother he ever had just because.", "There is no indication that this is what would happen. On the other hand….", "He knows the place, I always bring him to visit my grandparents and spend time with me when he can\nI know the speed at which things have to happen doesn't help, but it's not like these things can wait forever, I'd wait until the end of the school year anyway.", "Sorry, she came to live with us when my brother was 9 months old, today he is 9 years old", "OP was not his primary caregiver ever. The stepmother has been the primary caregiver for 9 years. She is trying to take him from the only mother he has ever known.", "The stepmother tried to adopt 5 times. OP and her grandparents blocked the adoption.", "OP isn't the legal guardian", "This is highly inaccurate and nuanced based on locality.", "Thanks", "Why not? The stepmother has raised him since he was 9 months old. She is the only mother he has ever known. Why are you so sure the child would not choose his mother over his sister who has only played a small part in his life and has never parented him? Blood does not always equal family.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "WE GET IT! Please stop spamming.", "I totally get your fears on that\n\nBut It’s something that he is going to be asked by a custody judge if he’s over the age of 12, and they are also going to look at what is least disrupting of his life - will moving cause him more trauma then staying?\n\nDuring this time, you need to be doing everything you can to ensure custody - does he have a room at your house? Is the house in a good area? Are there schools nearby that are able to accept him? Are the schools reputable? Are you and your BF financially stable enough to afford another mouth to feed? Or will this break you and force you into more desperate circumstances.  Do you have health insurance that he can be added to? \n\nThese are all things that will be looked at\n\nIt’s not about you wanting to take him - it’s about if your actually able to provide for him", "He lost both his parents at a young age and she made a comment like that? Woah, that's crazy.", "Sorry for the confusion, when my mother died he was 5 months old, when my stepmother came to live with us he was 9 months old, currently he is 9 years old", "She just lost her husband, please have some empathy for her grief.", "Sounds more like emotional abuse to me.\n\nNTA", "You never know. She was there since he's an infant, but that can also be why she wants the money. Perhaps brother is 17 and whoever has custody executes the trust, or controls funds. And maybe she feels that 17 years (plus however long she was the mistress) warrants her this money.", "I was going to say 4 is already pretty decey, but he's 9? He's been raised by her for 8.5ish years? His whole life?\n\nHe already lost one parent, I don't think it's healthy to take him away from another one. From what you described she isn't incompetent or anything, you just don't consider her your own family because she married dad too soon after your mom died. Bro does not have the same relationship with her that you do, she *is* his mother.\n\nYWBTA", "Who does he want to live with?\n\nWill you have enough support (not just money) to care for him for 9+ years?", "You have blocked her way of beeing a legal parent, something that she and your father wanted to happen. She has now recently lost her husband, her whole world is crumbling and you are instantly threatening to take her son away. YTA so very very much. You are obviously not able to be a good parent to your brother since you have absolutely no regards for his emotional wellbeing, only yours. Omg I feel for her and him.", "Blended families are hard. Did she actually try to push your mom's parents away, or were they actively hostile towards her, and she reacted protectively? Why have a problem with a young child having an extra pair of grandparents in his village. 6 people to love and spoil a baby are better than four, no? Fact is, she's his family and so are you, of course. \n\nBut you're not acting like family here. You're acting vengeful, alienating and cruel. So you don't like her and don't trust her. Have you ever actually, in good faith, TRIED to get along? I highly doubt she's the devil incarnate you think she is. \n\nI think she's a human being, who did the best she could, who is grieving a terrible loss right now. And you want to take her child, too? No, it doesn't matter that he's not her bio son. She has raised him his entire life, been there for night feedings and boo boos and bedtime stories. \n\nIt WOULD be a cruel change, but it's NOT impossible to avoid. Just don't. The fact that you actively blocked a loving mother figure's efforts to adopt him, know this will hurt your brother, but you're still deadset on doing it, makes me think you care more about hurting her, than you do about helping him.\n\n More opportunities in the city? Great, let him come visit you. Let him get to know the place, and make that choice when he's old enough to choose for himself, and not reeling from grief.", "The cities are only 3 hours away from each other, I left it open for her and my paternal family to visit whenever they could and I proposed to take him to visit whenever I could", "I was of school age, I took care of my brother as best I could, but it was impossible for me to do more at that age.", "[removed]", "Also his legal guardian is whoever your father appointed to be legal guardian in his will - that may not have been you…be prepared for that too", "And I lost my father. Unfortunately, it is not possible to wait for the mourning to end to make important decisions.", "Sorry, I wrote in a clumsy way, my brother is 9 years old, My father had a comfortable life but he didn't save a lot of money and the only property he had was the one he lived in.\nI genuinely believe In her love for my brother, but still I think he will be better with me, besides she is young, she can marry if young and And I can't be sure the next people in her life will treat my brother well.", "I do not deny that she is the only mother he knows, but she is also a person who tried to erase our mother from his life as much as possible, even trying to keep him away from my maternal grandparents. I can't guarantee he won't push him away from me", "All my maternal family lives in the city where I live, support exists.\nMy brother always loved visiting there, but currently he is confused because my stepmother said she can't live without him.", "I understand it can be seen as blocking her as a legal parent. But adoption meant taking my mother's name off my brother's papers, I couldn't be expected to react well to that at 16 years old.\nI have always been the sister my brother needed, and I intend to continue to be, but now with a greater responsibility.\nI have absolute concern for my brother's emotional state, but I also know that the moment she can take me away from him, she will.", "She really tried to alienate my maternal family, always making excuses for him not to go with me when my grandparents picked us up. She wouldn't let him be a pageboy at my aunt's wedding, Photos of my mother that were kept at home and strangely disappeared, so it's not 100% my grudge\n\nAbout her adoption attempts, my brother wasn't hurt by it.", "I think thats the point. You have never been a parent to this child. He has a mother. You are not it.", "By local law I am the legal guardian since my stepmother never adopted him", "You literally claimed that the step parent has more legal right in this situation, and I called the bullshit out because this precedent is highly nuanced.", "I'm very sorry for your loss. You did come here to ask for feedback/judgement, and I do think you're being TA in this situation.", "Is that how YOU FEEL OR HIM", "You need to separate them and have a conversation with him. \n\nTell him SM is lying and that she will be able to live without him. That she is trying to influence his decision to get him to stay with her.\n\nThen NEUTRALLY ask him what he actually wants. Tell him not to worry about hurting anyone’s feelings, he is not responsible for them, who would he prefer to be with and tell him it is most likely he will need to tell a judge this. \n\nRespect his decision. \n\nIf he wants to stay with SM then ensure he has your contact info written down/ memorised. So he knows how to contact you in case SM tries to isolate him.", "Can you actually pay personally (not maternal grandparents) for his needs like living expenses?  Change your life to revolve around him?  Therapy if needed?", "This comment is further proof that your own (legitimate) grief has actually been driving your decisions from the start, not concern for your brother.", "So you prevented your brother from being adopted in the past because of your own feelings and again are using your own feelings to justify not giving him a choice. You are blaming step mom for freaking out but you fired the emotional bullet of telling her your plan without talking to your brother first and asking him what he would want. \n\nDo yourself a favor before you risk ruining your relationship with your brother as a potential future outcome. Stop. Start talking to your brother about what he wants instead of telling him what you want is best. \n\nIf he’s not in a emotional state to deal with this shit right now if you and step mom truly love him you calm down and give him time.", "Re reading my comment, I can see how it read unclearly. You actively blocked a loving parental figure's attempt to adopt him; AND you are now trying to rip him from his home, friends, school and mother figure, EVEN THOUGH you are aware that THIS DRASTIC CHANGE, WHILE HE IS GRIEVING HIS FATHER, will hurt him, but you're okay with that because it will hurt stepmom too, shows me that you care more about hurting her, than doing right by him.\n\nOh, but it's okay because you guys game together sometimes. And you don't want him to have a say in this decision, because you don't trust him to choose YOU. So you'd rather force it and drag him through the courts. \n\nIck.", "But does that mean I can't take care of him with love and respect? I understand it won't be easy but I have a support network \nAnd I understand she's a mother to him today, but he's still young and getting married again, how am I going to make sure it's someone who likes and treats him well?\nWhat if she marries someone who will be for him what she was for me?", "[removed]", "It's not a good idea to say she is lying. She may very well feel like that at this moment, but as OP said in a comment, it's unclear what will happen in her life as time goes by. Additionally, she is the only mother he has ever known. It's a really, really difficult situation, but calling her a liar seems like a reach and could push his brother away.", "Do not do this. If there is a custody fight, it will look terrible that OP told the minor that the only mother he's ever known is a liar. It will be called \"parental alienation\" and be used to argue that for the child's mental health it's best to cut him off from OP's influence. It could backfire on OP very badly\n\nOP, if you can get your brother into therapy, that would be good. He's just lost a parent and needs help coping with that. He also needs a neutral professional who can help him process the big choice he's going to be asked by a judge to make. See if you can get him onto both individual and family counseling so that he can work on that privately and so that you two also can work on building a stronger relationship. Don't try to destabilize his faith in his stepmother, focus on stabilizing his faith in you. He needs both of you in his corner, not yet another loss of a family member. What she said to him is harmful, but let him work that out in therapy. Don't set yourself up to be the one the court blames for the consequences of your stepmother's manipulations.", "Sorry but I won't give my location", "[removed]", "[removed]", "You're being ridiculously unnecessarily rude. Please consider the way you talk to people."]}