{"id": 16100, "submission_id": "1349r54", "title": "AITA for not giving my bf my son's SSI money?", "selftext": "I (30F) live with my boyfriend (30M), together we have 2 young children and I have an oldest son (8) from a previous relationship. \n\nMy oldest son has a medical condition that has him on daily life support and as a result he receives $900/mo on SSI. I do all med procedures & I homeschool him, raise the babies. I do all cooking/cleaning, I take care of dog, chickens, pig. \n\nHe told me he wants a 'traditional household,' solely dependent on his income. If my son didn't have this med condition, he wouldn't have this $ to lean on and we'd be just on his income. It started with borrowing sometimes, but now it's every month. He takes $3-700 from the only money I receive to pay bills.\n\nI've tried to get him to budget for YEARS but he refuses. I finally got him to do his taxes & catch up this year & he then turns around & says it wouldn't have gotten done if it wasn't for him (which is crazy bc it was my mom and I prodding him for so long). \n\n He has 4 trucks&an older BMW, all of them need work- he spends a lot of $ fixing them or simply buys new trucks. It's hurting us. Ex: he bought a truck recently & after 2 payments it blew up, he still owes about 1500, which is a lot for us at $500/mo. He doesn't work on my car. I have numerous dash lights on, no horn, insurance, registration. (I rarely leave the house, I'm very isolated). The only reason I have my car is bc I had it before we were together. He's also really bad about \"nickle&diming\" sodas, snacks, cigarettes, etc at the gas station.\n\nToday  rent rolls up & SSI comes in the same day as rent, he said he needs 300 to cover the difference. I'm already paying for groceries for a family of 5 this week & I paid my son's homeschool for the month. Once my $ is gone, I'll have none until next month, but he gets weekly payments.\n\n I told him I won't do it & he said \"good luck, I already have your card.\" He took & hid my card from me, I said to give me my card back but I ended up leaving to figure out how to temporarily shut down my card about 20 min later. In that moment he had taken his truck & gone to an atm & pulled 300 out by the time I opened my account. I decided not to close the card, go home & retrieve my card since he got what he needed. He handed it back freely. I went & taped it under furniture, as I did with an abusive ex long ago. It actually made me feel sick to my stomach to do that again after so long. I'm tired of giving him the only money I have when he insists I stay home w no income w the children & that he be the \"sole provider,\" yet be so irresponsible himself.\n\n I'm willing to look at this situation w wide open mind. I want to know if I'm supposed to hand over the SSI every month or not given the arrangement of 'us' & his financial illiteracy that hurts us in the first place. \nAita?", "created_utc": 1682906635, "permalink": "/r/AmItheAsshole/comments/1349r54/aita_for_not_giving_my_bf_my_sons_ssi_money/", "score": 573, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the AH bc I tried to not give him the money this month and the SSI is intended for bills. I genuinely just want an unbiased opinion from the community.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your boyfriend is financially abusive, exceptionally stupid, and a thief.\n\nLeave him now. \n\nNTA", "So, in the past, you were in an abusive relationship and had to hide your bank card by taping it under furniture.\nNow, you’re having to use the same trick. Doesn’t that tell you something?\nPlease, please, please. Get out. Pack up the kids and leave, and make sure to change your pin to your bank card. And go after your boyfriend for child support. Is this the example you want to show your children?\nNTA", "This IS an abusive relationship. You and your kids deserve better.", "You’re in an abusive relationship again. \n\nThis man is taking your son’s money, which is for his medical care. He took your card from you, essentially stole money, controls your ability to go anywhere (car needing work), wastes money and justifies taking your son’s to make up the shortfalls. \n\nI’m not one to suggest this lightly, but I do in this case suggest you leave him. Get help from friends, family, a shelter, someone. But get out and get away from this guy. \n\nWhat he is doing is reprehensible. You and your son deserve much better. \n\nNTA", "NTA. You need to leave this abusive relationship ASAP.  It will not get better", "You have to act the same way you did with someone who abused you. You may not be able to see it yet, but this guy is abusing you too. Just not in the same way. Please leave for everyone's sake.", "NTA. You know this is wrong. He's financially abusive, and committed fraud by stealing your money when you said no. Your children deserve better. When he's at work, pack up and leave immediately. File a report that he stole your money, get a restraining order, and get child support. Do not back down. You know your children deserve better.", "RUN!\nNTA\nLeave him now or he will soak you for all you're worth, your son will suffer!\nRUN from this guy!", "NTA. I’m sorry to say this But you need to realize that this man does not love you, He does not respect you, and he is taking advantage of you and your sons condition. \nYou are in an abusive relationship.", "He is abusing you. He wants you to be dependent on his money so he can control you. Now he's escalated to robbing you and your son; he's not even using the money on either of you because he'd rather blow it on himself. Shut down that account. Taping the card to furniture won't help. He's not financially illiterate; he's just greedy and selfish. He doesn't care about you or your kids. NTA but you'll be the AH to your family if you let him take that money again.", "Honestly read up to traditional household. NTA. To me that seems like code for i want all control and financial abuse. Keep your money.", "NTA. From one abusive relationship to another. You know the signs. You need to leave.", "OP, look over what you just wrote.\n\nYou're isolated.\n\nYou have no safe transportation, including for a child on life support.\n\nYou have no income outside of SSI payments that belong to your disabled son. That should only be spent on your son and his needs.\n\nYour SO has taken your bank card and is spending money on it on who knows what. You've now hidden it, but you know this is temporary at best.\n\nYou struggle to find money for basic essentials like food for yourself and your children.\n\nYou're in an abusive relationship, and you're going to need help to get out with no job, two young kids and an older disabled kid. [Please call, chat, or text with the National Domestic Violence Hotline.](https://www.thehotline.org/) Yes, you're not reporting physical abuse, but you are undergoing financial abuse and your SO has taken almost all your power in your relationship away from you. This is not sustainable, for you or your kids.\n\nIf you need some extra motivation: what happens to your son when his SSI payments go 100% into your SO's pocket? How will you pay for his care?\n\nNTA, but you will be if you stay.", "NTA!!! Is there any possible way you can get out of this relationship and out of this living arrangement? This guy is abusive, irresponsible, and stealing from your disabled child. Nothing about his behavior is ok.\n\nYou deserve better than this. If you can devise an exit strategy do it ASAP", "NTA\n\nHow supportive is your mom and/or are you able to kick your baby daddy out? OP, however you can get this guy out of your life, please do it. You and your children don’t deserve how he’s treating you. Also, the reason no one is suggesting therapy is because he’s stealing money for a sick child for the purpose of making you more dependent on him. There’s no going back from that.", "NTA  but please get yourself and kids away from him\n.. that's your child's money... not bf money...get a new card sent to your moms house leave it there or at a safe place dont keep valuables there ..\nPlease figure out away yo get away from him and fast", "NTA He's abusing you and your son by misusing money that should be for his care and needs. You should have called the police and ended the relationship.", "He’s your boyfriend, not your  husband. Deny access to your sons money and leave him. I can’t get through this without doubling back to read what I just read! I know you might have to get a job without him. But your sons SSI can afford y’all an in home nurse. Do that, get a job and plan your exit strategy. NTA for the question at hand. But Y T A for subjecting your little family to him. \n\nChange everything. He’s so insane.", "Don’t hand that money over, draw some lines or get away from this man.", "Nta \n\n1. Get a new debit card now. Hey may have your info saved or memorized. \n2. Hide your new card.\n3. Start working on a way out, even if you can only stash 20 or 30 dollars at a time. \n4. Reach out to domestic abuse help centers to get further along with being able to leave. \n5. Of course you should NOT give him money. He should be giving it to you.", "Sorry why are you staying? I'm genuinely curious how you are reconciling in your mind staying there. \n\nNta but YTA if you continue in this relationship", "I'm going to try to be gentle, but not really. Y. A. T. A. H\n\nWhat would you tell a dear friend? Or a little sister?  How about your daughter?  IF They came to you, with the exact same scenario?\n\nIt is abuse. It is isolation. Get out and stay single until your children can defend themselves physically and emotionally from anyone else that you may bring home.  Your oldest has extreme medical issues and you are keeping an asshat around to steal from him\n\nYTA", "NTA. Call the police when he takes your card and refuses to give it to you. That is theft!! You need to get out. He's financially abusing you and stealing your son's money. It's time to make him accountable. I know it seems extreme, but so is your situation. Please get away from him. What are you going to do when he takes all your money and you can't even get food?", "NTA but I think you'll be T A if you don't get away from this person as soon as you can. I know it can be difficult to get yourself out of these situations, especially with children, but this person has shown a callous disregard for money that should be going toward supporting the health and welfare of a critically ill child.\n\nHe stole your money and taunted you about it. He told you he wants you to be financially isolated and fully reliant on him. This is not someone you should stick around.", "This is financial abuse 101. how you are the TA i dunno. Hes clearly TA", "NTA. In your shoes, I would be trying to set aside and invest some of that money for son’s future needs.", "He is abusing you and your children.  You need to reconsider your relationship  \n\nNTA for this. YTA if you don't seek help or get out of this.", "NTA. This is financial abuse", "Make a plan to leave.  He is taking money for your son.  Protect your kids.", "NTA.\n\nThat money is for your oldest care and expenses. You dictate that as his parent. Not him.\n\nHe is abusive.\n\nAnd you know it because you had to redeploy abuse-defensive behaviors.", "Completely NTA, but you are in a dangerous situation. Please get you & your kids out of that situation. His abuse will only get worse.", "Am I reading this wrong? The SSI is fore the care of your son. Why is it being used to pay normally occurring bills. Why should either of you use it at Will?", "This isn't a Reddit AITA matter. It's a serious situation where this woman needs to get herself out of a relationship not only because she is the victim of abuse but to protect her vulnerable child. Please run!", "Leave", "NTA , leave your abusive relationship , I wish I had left mine earlier", "NTA for being financially abused, but if you stay, you will be. This man’s traditional family income leads to going broke. Very good provider.", "NTA You are taking the same precautions you did with your abusive ex because your current boyfriend is abusive and isolating you.", "Can you move in with your mother? Why does this asshole have your card and your PIN? Change the PIN!!!! Get off reddit and call SSI, child welfare, and DHS and see who can help you get the heck out of there.", "Sounds like you're being taken advantage of and abused again. It's a huge red flag that he wants a [misogynistic household](https://www.thehotline.org/identify-abuse/power-and-control/) (\"\"\"traditional\"\"\" vomit) and that he's **stealing** your son's money. [Talk to people for some clarity here](https://nomoredirectory.org/). Yes, a big part of their job is helping you determine if your relationship is healthy...or not.\n\nr/abusiverelationships", "I'm so sad for you.", "NTA\n\nPlease contact a women’s center or domestic violence shelter to make a plan to exit this relationship. He is financially abusing your family and isolating you", "Get a job and leave him.", "First time I’ve seen a post on this sub that involves an ACTUAL asshole. Your boyfriend is stealing money from a disabled child to pay for his truck? \n\nYou’re treating him too generously, because you’re a single mother with multiple children and a bleak financial/dating status. You may or may not be attractive, but it’s obvious you’re compromising in your dating standards.\n\nYou need to find a social worker.\n\nNTA", "Yta -for even letting him ever have any of the ssi money. As someone who has a disabled child. I don't get it at all.", "YTA … to yourself for staying in this situation. Sounds like you’ve already had one abusive situation and you’re letting yourself stay in another one. You need to leave ASAP.", "I’m going to have to say YTA but not why you think. That SSI money is not yours either and typically can only legally be used for one household bill a month unless something has changed. There are times when you even have to prove where it goes. \n\nYou’re also the asshole for staying with this abusive man. You’re hurting yourself and your children. You need to leave this situation, figure out your own finances, and forget about him.", "YTA for exposing your kids to this abusive AH.  Call the cops now and have him charged, immediately.  Then get the fuck out.", "Why did you have multiple kids with him when he has always been irresponsible?\n\nYou have to protect your children.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (30F) live with my boyfriend (30M), together we have 2 young children and I have an oldest son (8) from a previous relationship. \n\nMy oldest son has a medical condition that has him on daily life support and as a result he receives $900/mo on SSI. I do all med procedures & I homeschool him, raise the babies. I do all cooking/cleaning, I take care of dog, chickens, pig. \n\nHe told me he wants a 'traditional household,' solely dependent on his income. If my son didn't have this med condition, he wouldn't have this $ to lean on and we'd be just on his income. It started with borrowing sometimes, but now it's every month. He takes $3-700 from the only money I receive to pay bills.\n\nI've tried to get him to budget for YEARS but he refuses. I finally got him to do his taxes & catch up this year & he then turns around & says it wouldn't have gotten done if it wasn't for him (which is crazy bc it was my mom and I prodding him for so long). \n\n He has 4 trucks&an older BMW, all of them need work- he spends a lot of $ fixing them or simply buys new trucks. It's hurting us. Ex: he bought a truck recently & after 2 payments it blew up, he still owes about 1500, which is a lot for us at $500/mo. He doesn't work on my car. I have numerous dash lights on, no horn, insurance, registration. (I rarely leave the house, I'm very isolated). The only reason I have my car is bc I had it before we were together. He's also really bad about \"nickle&diming\" sodas, snacks, cigarettes, etc at the gas station.\n\nToday  rent rolls up & SSI comes in the same day as rent, he said he needs 300 to cover the difference. I'm already paying for groceries for a family of 5 this week & I paid my son's homeschool for the month. Once my $ is gone, I'll have none until next month, but he gets weekly payments.\n\n I told him I won't do it & he said \"good luck, I already have your card.\" He took & hid my card from me, I said to give me my card back but I ended up leaving to figure out how to temporarily shut down my card about 20 min later. In that moment he had taken his truck & gone to an atm & pulled 300 out by the time I opened my account. I decided not to close the card, go home & retrieve my card since he got what he needed. He handed it back freely. I went & taped it under furniture, as I did with an abusive ex long ago. It actually made me feel sick to my stomach to do that again after so long. I'm tired of giving him the only money I have when he insists I stay home w no income w the children & that he be the \"sole provider,\" yet be so irresponsible himself.\n\n I'm willing to look at this situation w wide open mind. I want to know if I'm supposed to hand over the SSI every month or not given the arrangement of 'us' & his financial illiteracy that hurts us in the first place. \nAita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "👀", "NTA- that feeling is reminding you that you’ve been here before and need to get out now.", "NTA you need to get out as quickly as possible, if you need help and don't know who to call crisis pregnancy centers usually have systems in place to help with getting to safe houses should you need it.", "NTA. This is financial abuse.", "You are failing your children by having this man in their lives", "Plan your exit. Be careful.", "Why the hell would you give your boyfriend your son's money? Why?\n\nYou're not the AH for not giving him money he's *not fucking entitled to*, but you really need to take a moment to ask yourself why you put up with this bullshit.", "Honey you are being financially abused. Emotionally as well. You've been isolated. Please look into what your options are. Because it's only going to get worse.", "You need to leave. He is financially abusive, and that money is supposed to be for your son and his care. Someone could report you for SSI fraud because of him using the money on his \"hobbies\" and then what would you do? You need to start making plans to leave and do so safely. From your description he's going to go nuclear when you (hopefully) do. NTA but you would be if you stayed in this situation.", "Fuck no. Get out of there now. That SSI money is meant for you to take care of your son, not for that fucknugget to spend on his truck.\n\nNTA. Get you and yours out of there now or else he is only going to use you further.", "NTA. Oh honey, dump him. You deserve so much better! Also, call your bank and replace your card and hide it somewhere safe and leave as fast as possible", "I don’t know if all the people commenting just have poor reading comprehension, but certainly OPs situation is not nearly so simple as “just leave this abusive asshole”.\n\nYou expect her to pack up her two young kids, her 8-year old and his LIFE SUPPORT equipment, hop in her car that barely runs and be free? It’s clearly nowhere near that simple nor is it likely to happen.\n\nOP, you’re definitely NTA, and I’m sorry you’re in such an awful situation. Hopefully you can convince your boyfriend to grow up, learn some responsibility with money, and treat you and all three kids the way they deserve.", "NTA. -  All of us here in Reddit Land are begging you to please, please get out asap! His behavior will continue to get worse, not better. So sorry.", "He has shown you that he is controlling, financially incompetent , a bully, and a thief.  What does he have to do to convince you that you should leave him?  You are foolish to stay with this AH.  kt", "INFO: Why are you with this jerk? What does he bring to the table?", "NTA. I cannot imagine how hard this is but I hope that you’re seriously considering leaving. It might take a while but make a plan and get you and your kids out. I’m so sorry that you have to run from a partner again.", "you are NTA but you need to get out, he stole money that the government gives you for your sons care not so your useless boyfriend can pay his bills because he can't manage his money, if you are smart you will report him for this theft, he not only stole from your son he stole from the government and that is a crime punishable by prison time.", "I have news for you, OP - you are in another relationship with an abusive man.  When he says he wants a “traditional household” - 🚩🚩🚩.  Please, please get out.", "If for some reason you want to stay with this man change the damn pin number on the card! In no way should he be using that money and in my opinion you shouldn't stay with him but who am I to judge.", "This is not an equal, loving relationship.  Do not let him steal from you but look for a way out in case he becomes physically abusive. NTA", "NTA, its time for you to leave. He is not a good man.", "THIS. OP, what you are describing is textbook financial abuse and isolation. He not only controls his money and your ability to seek employment, but now he is also taking any other cash you have including the money meant to provide for your son *who relies on intensive medical support to remain alive.* Babe, fucking run. I don't say that lightly. There is a damn good reason he can steal your son's cash by manipulating you, spend it on his hobby of buying project cars, and leave you with no safe, reliable transportation without stopping to think he might be a giant jackass. Your car is how you would get yourself and your kids to safety and help in an emergency, and he *actively deprioritizes that.* He gaslights you. He deflects. He takes credit for your input, and assigns blame where he owes accountability.\n\nRegardless of whether he loves you or you love him, love does not overcome abuse. Love does not take hostages. Love does not have indentured servants. It's one thing to have a traditional household, but you don't. He wants his money, and also yours, and for you to be the maid and mother of the home. Meanwhile, he isn't providing enough to cover the expenses, demands all of your money to cover his choices, and fails to keep up with the aspects of the household that would have fallen to *him* in a traditional household. Maybe your car should be in working order before he puffs his chest out about traditional roles. He's failing the fuck out of his, while you are busting ass to meet yours.\n\nThere are potential partners out there who want a traditional household setup and will meet their end of the bargain without abusing you and your kids. If you don't leave, at least have a safety plan in place with your mom so that you can respond if and when he escalates. That could look like code words that would let her know to call help, leaving a set of clothing and medical supplies at her house, or even setting up an account in her name that he cannot access at all to stash a little emergency cash in. Whatever you do, don't let him continue to isolate you and leave you with no escape route. The way things are going with your car, that's the path you're on, and it doesn't seem like he is unaware.\n\nGood luck, mama. You're worth so much more love and respect than he is giving you.", "A-friggin-men! He STOLE your disabled son's money... What decent human being does that?! You are in an abusive relationship.\n\nNTA.", "Report your card stolen to the Social Security administration immediately.", "She needs to leave him and then maybe be single for awhile.", "NTA\nIf you do something now. Check within 100 mile radius for a women's abuse shelter. They normally allow abused women and children to stay.  Medical treatment,  food are given. Job training and help are usually provided.  \n\nYou need to get out of there. Even if it's loading the kids with you onto a greyhound bus.", ">He told me he wants a 'traditional household'\n\nSo he can financially abuse you and your children and prevent you from leaving!", "Stop blaming the victim.", "Read this comment and take it seriously! 👆🏼", "I'm gonna be more firm than that and say she absolutely needs to be single for a while again. Once you've been abused, it's really easy to accidentally fall back into those patterns because they've been so normalized for you. It's really essential for healing that you just be with yourself for a while and avoid commitment that will take focus away from yourself.", "She is putting some man over her disabled kid. The children are the victims.", "She needs to leave this relationship and remain single (maybe for months or years) until she understands how to recognize an abusive relationship and why she is drawn to such abusers. I am not trying to victim blame, but she permitted her asshole boyfriend to literally steal from her children.", "Oh OP, my heart is breaking for you. He is not a good guy. It will only get worse...for you. My ex bought junk money pit cars and motorcycles, controlled all money, and eventually made me have sex with him to get a fucking allowance while I was chronically ill with two babies. He smoked, he drank, made $126k a year but was chronically in debt. He didn't do his taxes for over a decade. \nSounds like these apples fell from the same tree. He stole your son's money after you paid for the family's food. He has no respect for you. He joyfully hid your card before confronting you, knowing you'd say no. You don't get a say. \"Traditional\" is a bad word in your situation. It means your trapped and he gets off on the power and control over you. The isolation is dangerous, especially because you accept it. I did too. You would be better off severing ties with him. He couldn't be a good father to your son. He's teaching your children that you are worthless and responsible for everyone's needs but your own. I would tell him that you are contemplating divorce and unless he gets on board with a financial plan, he'll have to pay his way, pay child support, cook and clean up after himself. Don't be an asshole to yourself or your son. Kick that asshole to the curb and do not date again until you've gotten help understanding why you are caught in a cycle of abusive partners.", "NTA. Why are you with this guy? Think about your son. This is not only abusing you but your son, too.", "I'm so sorry to see that you're in another abusive relationship.\n\nNTA. PLEASE start figuring out an escape plan. This is not what you want your children to accept as normal.\n\nAnd one day, when (not if) you're safe and have the resources, I hope that you get counseling so that you never, ever find yourself in a similar situation again. Good luck!", "NTA. Why are you with this dude? Lose him already. You’re not supposed to hand over money to him. Pack a bag and get yourself and the kids out.", "You are clearly the representative payee for your son’s SSI. That money is to be used for his medical needs along with daily needs (food, shelter, school, etc). Any extra is supposed to be saved for him. That being said, if rent can’t be met then the beneficiary would be homeless so spending some on rent makes sense. However, this should be prorated so your bf is paying his share as well.", "NTA, Sorry OP but you need to either kick him out or leave. This relationship is NOT healthy.\n\nChange your PIN number, keep your card hidden and make your plans to be single. If you stay with him any longer you’ll be T AH to not only yourself but your kids", "YTA because you already know this is abuse and you're choosing to stay. GTFO", "I presume you are reading this on your phone? Close out of reddit and call the cops on this loser. Get rid of him yesterday.  He is abusing you and the child in your care... GET OUT NOW.\n\nNTA  for not wanting him to continue to STEAL FROM YPUR CHILD!!!!! YWBTA if you dont get him out of your life. WAKE UP!", "Your son’s SSI should soley be used for his care, not even for you to pay bills like groceries for the family…especially if he wants you to stay home and wants to be the only one making an income from outside. Your bf has no rights to your son’s government support money!\n\nNTA, but this does sound like an abusive situation where maybe you’re now finally seeing things as they have really been.", "Please please listen to these comments and start deciding the best way for you to get out of this situation", "You’re being abused. There’s no other way of looking at it. \n\nI feel most sad for your son though because you put him in a abusive situation again. That money that he is receiving was never meant to go to your boyfriend at all, it was for your son’s needs and necessary stuff. You letting your boyfriend “borrow” money that was never really yours to give away is awful.", "It’s illegal for him to take the money for his use he can get in trouble, and Ssi will force him to pay back it is your son’s money for his uses and expenses not for your husband to take it freely. It’s not up to him to touch that money is your decision to make because that is your child He is taken from a child and that’s not OK for his selfish needs. I wouldn’t stay with a man like that that steals a child’s card.", "Could you kick him out safely? Do you have guns at home? \n\nIt’s hard to tell OP to leave. How do you do that with a patient who needs life support? What about the medical devices? \n\nNta of course.", "Nta. He's taking your money on purpose to try to prevent you leaving him.", "NTA but you will be if you stay with him. The fact that he stole money meant to care for your disabled son and you did nothing but tape the card somewhere he will probably find it at some point baffles me. I would definitely have called the police. He stole from you and he financially abusive in other ways too.  You should look and see if your state will pay you to be your son's full time care giver. I know In a lot of states including mine medicare will pay one parent to be a full time care giver for a disabled child in addition to SSI since they are unable to work. Id look into it and if you qualify set up an account he doesn't know about and have the statements sent to your mother. Then save up into you can get far away from him and take care of your kids yourself.", "If you’re making the same moves in a relationship that you made in an abusive relationship, then you’re in an abusive relationship again. \n\nI’m so very sorry this is happening to you. Please get out as soon as you can.", "NTA. OP, what you're describing is financial abuse.", "Sweetie, take your kids and run. He’s abusing you and them. NTA", "Please find a way to leave, and please update us when you do", ">He told me he wants a 'traditional household,' solely dependent on his income. If my son didn't have this med condition,\n\nI stopped reading at this point. nta, this isn't a aita situation. You need to get out.", "You know what my dad did when his new wife demanded I share my SSI with her son? \n\nHe divorced her. Never gave her even a single penny, she tried to take it too, we were out of there in a month. NTA\n\nThis has already gone too far. He’s abusive and you need to leave. \n\nPlus isn’t it like… super illegal for anyone other than the legal guardian to be able to spend that money for anything other than things within the child’s best interest? \n \n screw that. Leave and get your money back if you can.", "NTA\n\nYou are being abused. He is financially and emotionally abusing you. He is isolating you. Do what you need to do to survive.", "You’re being abused. Please seek out some resources - either family or something local - and get out of these. \n\nNTA", "THIS! It is not victim-blaming to say what you did. This is the thing you hear in therapy and dv counseling and it's critical in your journey to healing to understand Your own role in choosing an abuser, and to have a child with them. It's something that should be talked about more. OP and others should read The Gift of Fear, by Gavin de Becker. I love how he uses truisms in his book, like \"men who won't take no for an answer find women who don't know how to say no.\" Brilliant. \n\nSince she has a child, I'd recommend staying single until a therapist tells her she is in a healthy place to have a relationship. I personally wouldn't consider even meeting a the child of someone I'm in a new relationship with right away. I have a one year rule for that. For DV, it's most critical, even lifesaving, to know what red flags are and how to weed out potentially bad partners. I wish these simple things were taught at school, at least in high school. How many lives we could save.", "NTA \n\nYou are allowed to keep yourself, your children, your property and your childrens' property safe **by any means necessary.** \n\nBut you surely don't want to live like this another moment, do you?  Call a domestic violence hotline, call a women's shelter, just GET OUT. **By any means necessary.**   \n\n**It is time to save your own life, and to show your children that abuse is not acceptable or tolerable.**", "INFO (my intention is not to blame you in any way, just genuinely wondering):\nHow long has he acted like this? You say he’s been irresponsible with money for YEARS. You also have two kids together so I gather you’ve been with him  for quite a while. Has he always been like this? Did it slowly get worse? Did something happen for him to start acting this way?\n\nEither way, I agree with all the other comments about you having to leave. I realize that it may not be as easy as it sounds, seeing you have three kids and one of them having medical needs. You are in contact with your mother. Can she help or support you in any way? Maybe by seeking help? Please get out OP. I have a feeling this situation will not get better. On the contrary. Do it for yourself, but moreover, please do it for your kids. Be safe!", "Oh, dear, NTA of course, and get rid of this useless piece of sh.t.", "YTA based off of the fact that you ARE giving him your sons money. You know what’s going on love. You recognize the abuse. You don’t need a bunch of strangers on the internet telling you what you already know. You’ve allowed him to isolate you and take from your children, based off of what? He doesn’t sound like a prize at all. Take a long hard look at your babies, put your big girl panties on, use the resources around you and get outta there.", "WOW dont hand over nothing that money is for your baby! and should only be used for your baby tbh its basically the kids money my mom would take my SSI money when i was younger for ADHD i didnt have lol I would throw the pills away or sell them anyways my mom would use my money for the rent which 650$ a month and my SSI check was 650$ a month so i never got mad or nothing because she used it for the greater good and didnt hand it over to a boyfriend or whatever so it worked out for us also she is in immigrant and cant work in the US so that SSI check saved our ass AND never had a father figure", "NTA. Your boyfriend is financially abusive. What the hell are you doing with this trash? He is abusing you! Why on earth are you subjecting your children to this man?", "NTA\n\nGirl, please run and also sue him for chuld support after the divorce. \n\nHe is isolating you on purpose and taking your money. He is not providing, he is abusing you. You pay rent and buy groceries, so what exactly is he providing?! \n\nThis money is for your disabled child, not for him .", "Holy fuck, friend, you needed to leave like, yesterday. This is literally blatant financial abuse and that sad excuse of a man seems to have some kind of boarding going on with those stupid trucks too. Cling to that card, pack your shit while he's out, take your babies and GO. You're worth so much more than this\n\nEdited to add NTA. But you will be if you let this continue", "Why did you allow this man to get you pregnant twice", "Sadly, you are in an abusive relationship again. Please make a plan to leave. NTA", "NTA. Your boyfriend is abusing you financially and taking advantage of you financially. Why are you with him? What is he bringing to your life? He is stealing from  you and your son.", "NTA.\n\nBut how do you go from one abusive relationship, realize it was abusive and then walk into another abusive relationship? \n\nMaybe you might go for a triple or nothing with the next relationship after this one.", "Sis! Now you know you have no business being with this animal, let alone reproducing with him. Respect yourself and get out now! \n\nGet therapy so you can get to the bottom of your lack of self love. You’re worthy and enough sis. Stop allowing these animals to abuse you. You deserve better than this! And deep down you know this.", "NTA, and please make preparations to leave him, this sounds like another abusive relationship and you and your son deserve better.", "Can't really vote as that is not what matters here.\n\nYou need to start seeking support and try and leave.", "Why are you with this loser? Your doing your kids a disservice by staying. They deserve better!", "Girl, you need to leave and you need to leave immediately. You're being abused by this man and he is extremely irresponsible and childish. You need to leave this man and get your kids away from, this isn't healthy at all. He actually stole from your child. Please leave this man right now", "OP please start taking the measures to get yourself and your children to safety and away from this person", "ESH. But only because you’re being an asshole to yourself. You’re in another abusive relationship.", "If he wanted to be \"sole provider\" then he wouldn't NEED your son's money to pay rent (especially since you generally know how much rent will cost every month). He is an abusive AH. You are NTA", "You can contact SSA and report him for fraud since he took your card without your approval. They can investigate him and you do need to figure out a way to leave him. You need to leave a paper trail of his abuse and this is good place to start by reporting him to SSA, because that way you can get help in getting away from him and even have full custody of your other children and establish child support from him as well. \n\n\nI’m on SSI as well, so I suggest you to contact SSA and ask lots of questions and what you should do to protect your son and yourself from being financially abused by your boyfriend. I can say in my experience SSA people are usually very helpful in providing you the answers you need.\n\n\nEdit: Oh forgot to say NTA.", "NTA. Your bf is not the sole provider for the family if you are giving him SSI checks which you also use to pay the bills and buy groceries. This AH is financially controlling and abusing you and is never going to stop. Please take your kiddos and get the heck out of there.", "NTA. This is abuse, plain and simple. Make a plan for you and your babies to get away from him safely and completely. Good luck, you and your kids deserve way better.", "Op how are you still with this waste of space??", "NTA - You are not safe though. You need to ask this person to get out of your life. You and your child/ren are very important.\n\nDomestic abuse includes financial control", "NTA. This is financial abuse.\n\nEven worse, that is your son’s money!", "ESH. You are your sons payee and what your bf is doing is against SSA’s policies and illegal. I’m analyst that investigates people like this. SSI is for your sons needs and his needs only, not your boyfriend’s. All 50 states and territories have an analyst and when someone comes in to audit you, you will have a lot of explaining to do and could end up with a referral to law enforcement, social services,etc for allowing your son to be exploited by your bf. I suggest you get on SSA’s website and read the payee guide ad to what you can and can t do with that money.", "NTA. Get out of that \"relationship\" before it causes you any more mental harm.", "NYA. He’s really abusive. Not just to you but your son. That money is used to meet your son’s needs not his. I would seek out legal advice. If you have a woman’s centre locally, they sometimes have council on staff who’d help. An agency for folks who’ve been abused might also be able to help you figure out a plan physically and financially", "NTA", "What an embarrassment that you've allowed your child to be in this situation", "NTA. He is financially abusing you. If you can go stay with your mom, you should. I don't know the extent of your son's condition but if he's coherent he may realize that your bf doesn't care about him which would be an awful feeling. Especially at only 8.", "I agree. Honey, leave him. You didn't leave the abuse behind, you just switched the abuser. \n\nThis is not okay. He wants you to depend on him, you are isolated, dependant, he steals from you and your son. \nThis is not okay.\n\nEither kick him out, or take the kids and leave.\n\nNTA.", "OP referred to a prior abusive ex unfortunately they are on the same situation again and needs to leave, he’s isolating her and abusing her financially amongst other things.  I’d nope right out of there.  I know its easier said than done but it needs to be done for everyone’s sanity and protection of those kids", "This is absolutely it.  \n\n\nReading OP's post makes me angry and makes me want to say so many things about her abuser, all of which would get me banned permanently from this sub reddit, so I will go with what this user (\\_mmiggs\\_) said and pray that you get your kids away from this thing.   \n\n\nPLEASE get out. Please.   \n\n\nONLY-TA if you stay. Get. Out. NOW.    \n\n\nNTA", "Absolutely. Op read why does he do that by Lundy Bancroft.\n\nIt is free here:\n\nhttps://ia800108.us.archive.org/30/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf#page86", "⬆️⬆️⬆️Coming in to say exactly this ⬆️⬆️⬆️", "Women are often going for people they believe they deserve. \n\nAbused people will often go back to abusive partners (subconsciously) for various reasons but mostly because that's all they've known. To break the cycle of abuse, it takes a lot of courage and options. Op doesn't have anywhere to go, doesn't have an income to provide for her family, has two little kids and a disabled one... It's easier said than done. She can't just leave. That's not how it works irl. She needs help. I hope she has the support from her family but it doesn't sound like it.", "This should be the top answer. Op needs help. She knows she's in an abusive relationship but cannot fathom how to get out of it.", "Take my gold, from someone on the other side of this nightmare.", "This man is taking your son’s money, which is for his medical care. He took your card from you, NAT", "And that bit about how she had to hide her card like she did with her previous abusive ex. Poor OP went from one abusive partner to another", "She needs therapy for abused women so that she can learn the patterns and understand that this is not normal. The scary thing is that abuse can look so different person to person and theres different types of abusers so it's super hard to recognise even if youve gone through it before.\n\nThis book is very good at explaining:\n\nWhy does he do that by Lundy Bancroft. It is free here:\n\nhttps://ia800108.us.archive.org/30/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf#page86", "She needs therapy to understand why she keeps letting abusers in. And I say this from the pov is someone who did this. I always ended up in abusive relationships, and friendships. I was often accused of being the abuser, because I was the common denominator in each one.\n\n And I was the common denominator, but not in the way they meant. \n\nWhat I learned in therapy is that because I was raised by an abusive narcissist, abuse was normalised for me. So I never saw the red flags, or sometimes those red flags appeared green. I'm still working out the kinks, but I am no longer surrounded by abusive people.", "This book is also great and is free here:\n\nWhy does he do that by Lundy Bancroft\n\nhttps://ia800108.us.archive.org/30/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf#page86", "Very common.", "Hello, fellow special needs mom with a medically fragile daughter who is on SSI. \nYWBTA if you don’t leave. I get it, it’s not easy. My daughter father was abusive and I had no access to money so it wasn’t easy when I said enough was enough and to be honest, when I finally left, I had no money, no family help and I stripped for a month so I could get enough money to start over. \nMy advice, is to leave, get a job, go to therapy (I met a mentally abusive man right after and had a child with him because of my own unhealed trauma that made me tolerate abuse) do some inner work. It’s not easy but now I’m back in school, going for my nursing license, working full time and I met an amazing man. \nIt was hard, I had a lot of break downs but let me tell you, I would never trade those hard years because of what I have now. It’s time to take your freedom back.", "NTA. You are being financially abused", "NTA but stop keeping yourself from working. Why are you letting him drag you down like this?", "NTA. Your bf is abusive (financially at the very least) and a thief, he has no right to that money. If there is any way you can safely do it, get your children and yourself away from him.", "This is abuse. I hope you can safely leave. NTA", "Do you hate your kids ? Because you sure aren’t protecting them.", "Girl leave that man before you end up on the street with your children. NTA", "You went from one abusive man to this one. NTA for hiding the card...but an AH for allowing this man to abuse you in front of your son and for letting him take his money for so long. Please protect your kid.", "Yeah so you left a abusive one to have babies with the next one. Why. That money is for your son and if the government finds out your boyfriend is withdrawing it or your giving money to him like that, then they cam file charges, CPS can get involved etc to advocate for your son", "You are in an abusive relationship once again. The fact that you had to resort to the same solution is proof to that. Run OP", "LEAVE HIM\nnta", "NTA. You need to plan your exit starting now.", "NTA. He is financially abusive. Is there someone who can help you to safely leave?", "NTA…why you with such a loser?", "OP=NTA\n\nBut  STOP allowing this.  He has you isolated--with a bad car.  He has you isolated--financially by taking your Son's SSI money and by telling you that you cannot work.\n\nHe's STEALING.  And you have just did something  you did with an abusive ex in the past.  GET THE FECK OUT OF THERE.\n\nMake a plan, get help, call someone.  GET OUT", "Please find a way to drain him for every penny he's worth. Alternatively report this as theft, and they can view via CCTV it was him that accessed this. Better if you have proof you told him to give it back.\n\nThen just run. NTA", "\"He owns trucks...\"well, there is your problem there. You decided to have children with a moron. This is all in you", "Hiw did you get to the point where you have 2 kids with this absolute gem of a human being?? I just never understand how men find these clueless women to be their bang maids.\n\nYou're a bang maid. A slave in your own life. Get the hell out of there, your boyfriend is an abusive loser and ruining your life with this immature behavior and bullshit attitude.\n\nFind help and RUN. ESH, because there's no way you didn't understand his lazy ways before you had TWO kids with this lump. But either way, you're being abused and controlled. RUN.", "Get out, get out now. This is NEVER going to get better without him doing a lot of therapy, which he does not sound like the type to go to therapy. Abuse only gets worse.", "NTA please get out of there ASAP! Sounds like you have a carbon copy of your abusive ex. He is isolating you!", "Leave. He is an abuser. It will only get worse.", "There is nothing more I can add, just leave this man!!!! Please!!! He has nothing to offer you!!", "This is called corrosive control it is abuse, I'm not making a judgement on this because it's so much more than who's an asshole.\n\nMy mum went through this type of abuse for years you need to run and fast.", "NTA for the money, but YTA to yourself and the kids for trying to build a life with this abusive, manipulative, stupid man", "NTA. Run", "NTA\n\n\"He told me he wants a 'traditional household,' solely dependent on his income\"\n\nThis is just plain abuse.  You and your son deserve far better.  Leave his parasite ass for your son's sake.", "This!\n\nDon’t accept him to be the “leader” of the house.\nHe’s using gender roles to abuse you.", "All of this. OP in NO way is this man providing. What a joke.", "> Doesn’t that tell you something?\n\nThere’s a common denominator?", "I need to add...Op's children worth love and respect and a better environment to grow up.", "Username checks out.", "She definitely needs to be single, but given how reliant she is on him, I doubt she’ll take that option. While he needs a bulk of the SSI to make ends meet, she’d need a whole lot more if she tries to go it alone.\n\nShe’s trapped herself with wanting to homeschool and the likes.", "This line made no sense to me. If he wanted a ‘traditional household’ he should be making all the essential payments and any money OP made should be hers to spend however she pleases.", "Thank you so much for this pdf I saved it and I’m gonna read the whole thing later. It’s very interesting.", "NTA, and sweetheart, you need to get rid of this abusive leech of a man. For all his \"traditional home\" rhetoric he isn't providing for you, but stealing from you. And more importantly, stealing from your critically disabled child. And when you won't let him steal from your child, he escalates to outright stealing your credit card. \n\n>I told him I won't do it & he said \"good luck, I already have your card.\" He took & hid my card from me, I said to give me my card back but I ended up leaving to figure out how to temporarily shut down my card about 20 min later. In that moment he had taken his truck & gone to an atm & pulled 300 out by the time I opened my account. I decided not to close the card, go home & retrieve my card since he got what he needed. He handed it back freely. I went & taped it under furniture, as I did with an abusive ex long ago. It actually made me feel sick to my stomach to do that again after so long.\n\nLet that sick feeling wake you up. You don't just have an abusive ex. You have an abusive boyfriend in the present.\n\nYou aren't an asshole yet, but if you let this continue to the point that it harms your child, you will be. Protect your children from this man. Dump him. Get your independence back.", "Run. This loser will bleed you financially, and is probably working up to physically abusing you. Protect you and your kid and run.", "LEAVE HIM!!! \nTHE MOMENT HE BLAMED YOUR 8 YEAR OLD FOR BEING THE REASON HE CANT BE THE BREAD WINNER YOU SHOULD HAVE LEFT HIM!\nSave yourself, save your children, kick him the f**k out of your home. If he keeps coming back, issue a restraining order. This is theft and abuse. \n\nYou are NTA. \nBut you NEED to leave him. This isn’t worth it and I am worried for you", "The SSI is to take care of your son. Your BF is financially abusing both of you. \n\nNTA", "NTA this is financial abuse. Your whole post is about what he wants, what he needs, what he wants to do, what do you want?", "Why are you letting this man steal from your child? It’s illegal. Why are you with this man at all?", "Wow NTA but how did you not see this loser coming?", "OP, read back what you wrote and tell me why any of this would make you an asshole. He is trying to abuse you financially and make it so you can never leave him.", "Did you really need us to tell you you're nta? Like this is so obviously just common sense", "OP.\nThink about your statements. \n\nYou are now resorting to familiar hiding tactics you learned while being with an abusive ex? \n\nThat is because this person is abusive, too. \n\nNTA remotely for not giving away the only money you have and that is YOUR SONs money, for his care. \n\nHowever, you do need to come up with a plan to leave this relationship.", "YTA for not breaking up with this asshole.", "Girl you TA if you don’t leave this man", "NTA, there is a lot of good advice in the comments here so I just want to say one thing to think about. Imagine this exact same situation but it is one of your kids and their partner treating them like this, would you be okay with that? Because if things stay like this that is the example they are going to grow up with and it will be what they think is normal for relationships in the future.", "Honey, not only are you NTA but you’re in an abusive relationship.", "I hate to tell you this, but you don't just have an abusive ex. You have an abusive and thieving current partner. \n\nYou need to start looking into getting out of this relationship. You are being financially abused.", "> an abusive ex long ago\n\nYou have an abusive non-ex. NTA but you will be to both yourself and your kids if you don't get out of this. He is ensuring you can't save any money to escape.", "He stole from your kid.. Report it to the police and the bank to get your money back and gtfo of that situation. He’s financially abusing you now what do you think is going to come next?", "Reading this made me feel sick.\n\nSeriously, get out.. \n\nIt's hard to put a judgement on this because you have already been giving your boyfriend the money from the SSI, and now he's acting like he's entitled to it.\n\nReach out to someone for help and get yourself and your kids out of this. Figure out how to manage co-parenting your 2 kids later. \n\nAlso, maybe see if you can report the stolen money or something. Hiding the card under the sofa isn't going to work for long.", "You're being abused again. He's literally stealing from your sick child. The writing is on the wall. You can either leave or continue being abused.", "NTA. Get rid of your boyfriend.", "> I told him I won't do it & he said \"good luck, I already have your car\n\nGirl/Sir, run for the hills as fast as you can.", "Nta. I feel for you with my whole heart. You need to get out. Call around to anyone who you trust as a first step. Try and open a new account if youre able to while out running errands.", "Please reread your post. You're hiding your card from him like you did \"with your abusive ex\". Why do you think that is?\n\nHe's abusing you. NTA", "If he wants a traditional household and be the sole provider why is he taking your son's money. What are you getting of living with this Leech?", "Nta he is abusing you.", "YTA because your didn't kick his ass out a long time ago.", "Bro, just LEAVE. NTA.", "NTA. I feel really sorry for you, OP. You must have had en extremely abusive life to even ask about this. Your bf is pure slime.", "So what happens when he can't find the card next time? Does he start throwing things/being violent? \nYou're clearly a good, loving mom. You and your kids deserve better. Your son is having crimes committed against him by your boyfriend. You are having crimes committed against you by your boyfriend. \nDo you have a safe place that you can go? I would include a police report for theft in my exit plan. \n\nBest wishes.", "I hate when people tell an OP to leave their spouse since we're only getting one side of a story.\n\nBut, holy hell, leave this AH. Quick. Do it for your son and you're certainly NTA.", "Report the money as stolen with your bank and get it back and leave him NTA", "NTA but honey, you have another abusive boyfriend. This man is financially and mentally abusing you.", "\"we should rely only on my income\" says the broke ass joke of a man. NTA", "Nta\n\nAlthough the argument can be made that it is used for his rent but if you have to provide food, childcare, and medical, this is stealing. \n\nTalk to social security to see if you can even do this legally.", "NTA. Not only shouldn’t you give him the SSI money, you should leave. He’s isolating you and financially abusing you. This very well could become much worse. Right now what he is doing is bad, get out before it gets worse. You’ll be less stressed and much happier if you leave.", "Lol what", "NTA You need to get out of there. You and your son are being abused. Please leave.", "You're allowing your boyfriend to steal from your child and that's not okay. You even mentioned in your post you're now hiding your card like you did before with your ex abusive boyfriend. I don't care if you got kids with him, change your pin on your card, report him for theft, or kick him to the curb. Honestly I rather you did all these things. You're a AH for allowing this to go on and for allowing him to steal from your sick child.\n\nETA: before anyone comes at me, she needs to see this. Yes she jumped from one abusive partner to another one, but she needs to think about her kids. It's not her fault she is with a ah, but she is responsible for allowing him to steal from a sick child and not put him in his place. Leave the guy and don't get into another relationship until you're kids are grown and on their own. That's your child's money who needs it. Not a grown man with five trucks and whatever he has.", "NTA. This is unacceptable, and I think you know that. The whole situation isn’t fair to you.\n\nI knew I had to leave my ex when I started hiding my car keys and bank card for the same reasons you said- he’d take my car and use my gas or just keep my keys from me, or he’d go in my wallet and take my card to withdraw money I did not have to spend and then make up some asinine reason I “owed” him. Re read your post, you had to HIDE your card with your SONS SSI money from your husband. That’s abuse.", "NTA but why are with this jerk to begin with? He is not your husband so you can kick him to the curb or leave him in the dust where he totally belongs. Sounds like you have low self esteem and have been in more than one abusive relationship. Please get help! He is already stealing from your disable son. Your bf sounds awful in every way.", "YTA for not protecting your kids. This man is STEALING your disabled child’s money. Please do some reflection and get yourself some help to leave this man.", "Honey.... I am so sorry he is doing this to you. This is what is called financial and economic abuse. \n\nNational Domestic Violence Hotline\n800-799-7233\nSMS: Text START to 88788", "I mean cmon…….. The signs can’t be more obvious", "There’s no doubt that he’s an AH but it’s crazy that the top advice to a woman with three small children, one of whom is special needs, is a cavalier “leave him now”. How is a woman with no job history or savings supposed to just “leave”. Is the homeless shelter so much better? Who watches the three children, again one of whom is special needs, while this woman works minimum wage? The guy doesn’t have any money so child support is going to be minimal. What you should do OP is save every penny you can and work slowly on saving up enough to leave safely after you’ve arranged child care. Start reaching out to family to see who will allow the four of you to couch surf. If your name is on the house there are much less public support options in place for you (my coworker found this out when she tried to leave her abusive spouse with her three children).", "Not all ‘traditional households’ qualify as ‘misogynist’. Or misandrist for that matter. Both of my sets of grandparents had beautiful considerate and loving relationships that lasted until death. My grandmothers were madly in love with their husbands until the end. Both were free to work if they so chose(my nan did during the war), and returned to taking care of the house and raising her children happily when my papa returned at the end. It’s disgusting to automatically assume a traditional household is inherently wrong(for either sex/gender). Not all traditional relationships are the way you view them. I have done it all.. college.. university.. professional career.. small business owner.. and I now have a toddler and am almost at my due date with our second. I went from fiercely independant to relying on my husband to provide. He is far from misogynist despite our now traditional household. Your post is definitely vomit worthy.", "Reminds me of that Blue October song, The Shape of Your Heart: \n\n\"We take the one we think we deserve -\nAnd slowly, try to make it all work\"\n\nWell put. I hope OP finds a way.", "Ah, great, you already posted it. I was about to do the same. \n\nAnyway, NTA, OP's hubby is a control freak & need to be yeeted into the sun (but in a slow, safe, planned manner, as he seems the type to turn violent)"]}