{"id": 16113, "submission_id": "134gsyu", "title": "AITA for being bothered by my pregnant wife's behaviour", "selftext": "My wife (29F) is 3 months pregnant and I (35M) have been married 4 years and dating 2 years prior. She hasn't been taking the pregnancy well, has nausea in the evening and she is crying and complaining that I am not doing enough. We both work in tough corporate jobs and I also run a small business on the side so generally very busy people.\n\nI am very happy to help and do chores like washing up, vacuuming, cleaning, groceries without her asking, however she has a way of requesting other things that really bothers me. She directly won't ask for something, she will just make a statement like 'the toilet smells' or 'the window is open' and expects me to follow through. If I don't catch on she will remember and complain to me that I am 'substandard' or 'not good enough' for not doing what she wants. She says I should know what she wants. \n\nYesterday I politely said she can learn a better way to ask for things as if she uses simple manners like please or thankyou it will make me want to help even more.  I also said that if she cannot, I will be less likely to want to help or being proactive with help. I said it doesn't cost much to say these things and it would benefit both of us. \n\nI tried to have a mature conversation with her to listen and understand her position more. She bursted into tears saying she's suffering, she won't change her behaviour and that's her real self. She says that because she is pregnant she wishes I should just be a 'robot' and do everything she says no matter how she says it because her job is to bear the child. She is sweet and polite to all her friends, family and work colleagues, literally all the time even during pregnancy (& periods) but as her husband I get her 'real self' which is negative, demanding, distant, and always impolite. I asked her why she cannot treat me like how she treats everyone else to which she replies in her culture husbands normally get treated this way (she is East Asian). She even said she should have married someone from East Asia and regrets marrying me because of my Western upbringing because I can't take her negativity.\n\nI understand she may have pregnancy hormones. If this was the case I would accept and bear with this as temporary but she has been like this before pregnancy. This negative version of her happens for 10 days before her period. I avoid interactions with her during this duration, as she's unpleasant to be around and id wait for the time when she becomes nice again, however now she is now like this 24/7 and is unavoidable. I have asked so many times in the past she should try learning to be more empathetic and nicer when she communicates, however she refuses and makes no effort at self improvement or even researching or googling the topic.\n\nShe is from an east Asian background and lived in a number of east Asian countries but is now settled with me in London, UK where I was born & bred.\n\nAITA for being bothered by her behaviour while she is pregnant?", "created_utc": 1682930298, "permalink": "/r/AmItheAsshole/comments/134gsyu/aita_for_being_bothered_by_my_pregnant_wifes/", "score": 105, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I said I won't be able to help as much while she js pregnant if she can't try to be more polite when making requests.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA; anyone who says \"well, in my culture, we're supposed to be toxic to our partner\" needs a major attitude adjustment.  That's never a good idea to embrace a need for toxicity.  \n\nShe can use her words to ask for things politely.  Good couples are able to communicate.", "NTA\n\nShe’s going through a lot right now but a simple please and thank you won’t kill her.", "NTA being pregnant (3 months and she is behaving like this already…) is not a free pass to be an asshole and emotionally abusive to those around you. She doesn’t act that way with her friends and colleagues because she is not comfortable enough and has to keep a façade. \n\nThat’s not her real self, this is. She told you, believe her. After pregnancy it will be post partum and then god knows what. Good luck", "NTA, but she sure is", "NTA. As someone who’s been pregnant twice, I could maybe cut her some slack if she snapped at you once or twice but all the time?! No. She’s verbally abusing you, and pregnancy is not an excuse to do that.", "Oh wow, she sounds pleasant. You sure you wanna stay in that kind of relationship? She is literally saying she regrets marrying you. That sucks dude. Hope it gets better.", "NTA\n\nIt sounds like she might get premenstrual dysphoric disorder (PMDD) if this was happening regularly before her period.  This is something that is easily treated with an SSRI.  Would your wife be open to speaking to her GP about what is happening?\n\nShe may have some anxiety that's getting worse and this is how she is reacting.. which the medication for PMDD will also treat.  SSRI's are safe during pregnancy - at least the benefits very much outweigh the risks and can lead to better outcomes for mother and baby as there is less stress hormones released by the mother which do affect the baby.\n\nBut her comments about men in her culture getting treated badly because it's normal and expected is not okay.  She doesn't get the right to abuse you like she is.\n\nYes pregnancy is hard, yes she feels like crap when you are nauseous.. and then later with all the further discomforts of pregnancy.  But she doesn't get to take it out on you.\n\nYou've got some difficult conversations to have with her and she's likely not going to take them very well.  She doesn't sound like she has a lot of insight and is very snappy at you.  \n\nWhat's her family think about what is happening?  What do you friends and family think about what is happening?  Would she consent to speaking to her GP about this or some couples therapy (or single therapy).\n\nShe may be wondering what she's gotten herself into (getting pregnant) and how your lives are going to change and this is anxiety driven.  But what she's doing is way out of normal but there is help available.", "Well,\nIf she also gets like this before her period then it's definitely a hormonal thing.\n\nBut it did not sound fair to you. Just because her mum, aunts, grandma etc. treated their husbands this way, does not mean she gets to abuse you.", "NTA obviously as this is a recurring thing before the pregnancy, but from the tone of the post it seems like you're just regretting marrying outside of your culture. You should both try to separate each other from your cultural norms and see yourselves as each other's spouses, rather than \"east Asian woman\" and \"British guy\"", "NTA. I'm currently 4 months pregnant, and I think your wife's behaviour is completely unreasonable. Yes, being pregnant is tough, but that doesn't give you the right to shit all over someone else. Being polite and asking for things kindly costs literally nothing, plus it makes it more likely you'll understand what she actually wants (and can therefore help out the right way).", "INFO:  Why did you get this woman pregnant?  You're well and truly fucked now ...", "She says she’s being her real self. Her real self isn’t nice.\n\nNTA", "NTA\n\nMy wife will make a vague statement about something that needs to be done  \n\nMy reply is, “Does that mean someone should do something about that?”\n\nJust keep asking that after she makes a statement.", "First trimester pregnant lady here - you’re definitely NTA.  \n\nI get it, the nausea is absolutely horrendous but it’s not an excuse to act like an ass 24/7 and push away the person who’s willing to help you through it. \n\nSympathy and gentleness for everyone involved goes a long way during this time.", "NTA. But why did you marry then have a child with someone who treats you like crap?", "Info: \"I am happy to help\" what does this mean? Chores is not \"helping\" unless you have already agreed on a fair split of chores and she is wanting you to do more than your share. So have you just not evenly divided up the chores and she is badly delegating, or have you divided them up and she is wanting you to do more than you need to?", "I’m leaning towards NTA, but I’m definitely side eyeing that you mention that you’re willing to “help” and do chores without asking, as if that’s something special. It’s not “helping” in your own home and doing chores without being asked is literally the bare minimum.", "Nta. Being pregnant is not a free pass to treat anyone like shit.", "> it will make me want to help even more\n\n> I will be less likely to want to help or being proactive with help\n\nINFO: Why is it helping if it’s your house too? You live there right? You’re not *helping* her, you’re doing what needs to be done in your house. You said you both have jobs so it’s not like chores are just her thing. You’re not helping her at all, you’re just doing what you need to do in your house, you don’t have the option to help less, it’s literally your job as occupant of the residence to do chores", "NTA.\n\nWhen they show you their true self, believe them. Also I'd advice to consider if you want to spend the rest of your life like this if she is unwilling to change her behavior or treat what is causing it.", "NTA. I highly recommend couples counseling", "Couple of questions:\n\n1) the “substandard” comment. Was that a one off or a regular thing? That’s a horrible thing to say but if it was a one-off and you got an apology then that’s different. If it’s a regular thing then that looks very much like asshole behaviour.\n\n2) when you say “I’m happy to *help*” (emphasis mine), do you mean do your actual share of the chores plus some of hers? Or do you mean that you consider doing your share helping? Because that’s not helping, that’s doing your share. Needing extra credit for doing your share isn’t cool. Not sure if it’s assholery though.\n\nOverall it sounds like you have a lot on your plate. I think maybe you’re both under a lot of stress and maybe you could think about what parts of your busy lives might need to be put on pause during the pregnancy? Perhaps a check-in with a couple’s counsellor might help you both? Ideally she would feel like she can be direct when she wants you to do something extra, and you can get the nice feeling of doing something for your pregnant wife instead of feeling like you’re not shaping up.", "ESH. She’s by far the bigger one, pregnancy/hormones is not an excuse to abuse you, but what’s with the “I’m happy to help”? You mean “I’m doing my part of the chores”? You’re not “helping”. It’s your household. \n\nSince she’s pregnant and you seem stuck for now, is couples therapy an option you could look into/afford?", "INFO: what’s your role generally in cleaning the house? Have you ever cleaned the toilets before now? if you’re offering to help, does that mean you think housework is inherently her job and you just “help” her? Why can’t you figure out that the toilets smell without her telling you?", "NTA but to yourself yes ta", "So…this is a situation many of us have survived, but boy was it a roller coaster. Just realize her hormones are fluctuating at insane levels. That said, you have to set some boundaries (your call on where). Normal “asshole” boundaries are not necessarily relevant at the moment (soft NTA).\n\nYou have barely entered this journey, and I’m sorry to say it will get worse before it turns into the pure exhaustion of taking care of a newborn.  Then you’ll both be so tired it’s unlikely to matter.", "NTA - everything that needed to be said has been. I think you should look into PMDD though, obviously it’s not what she’s experiencing now but could explain the sudden change in mood right before her period.", "Whoa. Sorry op but pregnancy doesn’t excuse shitty behaviour. Nta and take care. Hope you are able to get out of the toxic relationship.", "NTA you are so fucked. It’s gonna be so much worse when the baby comes if you can’t figure this out now. Good luck", "Nope she sucks and you’re allowing her to pass those genetics on? Soon you’ll have 2 irrational East Asians to yell at you and tell you how substandard you are.", "Why would you marry someone you have to avoid 1/3 of your life?  \n\nHow did you think kids would help?\n\nNTA, but things are just getting started.", "OMG she's only 3 months and she's that bad already. What's it going to be like when she's approaching the 9 month mark?\nI can't see that you're doing much wrong. Maybe try to cut her a bit more slack. How do the Asian guys handle these grumpy wives?", "You do not “HELP” in your own home. You are an equal partner. Act like it. She’s maybe asking in a way that is what was modelled to her growing up. And it’s different from how it was for you. I married someone from a different country so we do sometimes struggle with how to communicate these things. We found the book Fair Play helpful. Might be good for both of you to learn how to talk about these things.", "ESH. She has nausea and needs to vomit every day but you can’t tell the toilet smells and it would be helpful for her to not have to vomit in a disgusting toilet? You live in your home yet expect her to manage you? Do you only do what you’re told at work too, or are you actually capable of forethought but simply choose not to do that at home?\n\nPregnancy is horrible for some. She has realised you won’t be doing much around the house without her telling you to, so she’s trying to come up with solutions like simply making you a list but not wanting to argue about it everytime. So she’s mentally exhausted and trying to give herself a break. If every discussion about a chore takes longer than actually doing it, you’re not helping her. Doing housework in your own home isn’t supposed to be “helping”, if you’re not a teenager living with your parents, it’s basic decency and you should pick up whatever she can’t do. You’re actually not taking on any of her mental load, you’re just doing stuff to show her you’re doing stuff. You need to plan ahead, preferably together.\n\nIt sounds like she’s at the end of her wit, has tried to talk to you about this multiple times, and is at her breaking point. You’re being condescending towards her and she feels you’re not supporting her. Blame game is not going to help either of you, trying to tell her how she’s wrong will only distance her from you.\n\nShe also seems to have unhealthy ideas about partnership, so I would try to focus on that. Right now you as her partner need to step up and help her, but she has to stop being so negative when you actually show positive change. That being said, she doesn’t have to express gratitude for you doing basic chores.\n\nYou both need to do better.", "NTA. But why did you marry her and then decide to bring a child into this relationship? Like it seems you shouldn’t be shocked with a Pikachu face that this was going to happen…since that is what you already experienced. \n\nThis is your life now. Great decision making skills.", "If she was like this before pregnancy, maybe you put your dick in crazy", "A soft ESH, she shouldn't be mean to you, however you are not \"helping her with chores\" as adults you should be working together to run your home. It sounds like she is trying to ask for help without nagging by mentioning a smell etc, then just going nuclear on your ass when she is frustrated. No fun for anyone. Maybe just get a cleaner if you are both super busy, a couple of hours a week isn't expensive. Cheaper than a divorce 🤷‍♀️", "NTA maybe ik she acting like that cuz pregnancy and periods", "NTA you can't say \"the window is open\" to anybody and expect more than an \"ok\" as a response.", "NTA \n\nBeing pregnant doesn’t mean you can be rude as shit to your partner. Her “real self” that’s terrifying.", "YTA I’ll go against the grain here but, you’re not helping. You’re not doing her a favour. This is your house, it’s your bathroom. If it’s dirty it needs cleaning.\n\nWhat you’re doing here is putting the mental load into her. You’re saying she needs to notice when the bathroom is dirty, and then ask you nicely to clean it. \n\nThe thing is, you shouldn’t have to be told that the bathroom needs to be cleaned when it’s dirty. You shouldn’t have to be told it’s dirty to notice it’s dirty. \n\nIt’s your house. You’re not doing her  a favour by doing housework. You’re not helping her by cleaning something when  she notices it is dirty. \n\nMaybe make the effort to be one step ahead of her and clean your pebble dash before she has to remind you.", "YTA for writing this post in a way intentionally designed to incite racism towards Asians.\n\n>She says that because she is pregnant she wishes I should just be a 'robot' and do everything she says no matter how she says it because her job is to bear the child  \n>  \n>I asked her why she cannot treat me like how she treats everyone else to which she replies in her culture husbands normally get treated this way (she is East Asian). She even said she should have married someone from East Asia and regrets marrying me because of my Western upbringing because I can't take her negativity.\n\ncome on, this is not even a realistic way for a human being to talk.", "YTA for not staying on top of chores and getting snappy when reminded to. She shouldn't have to be telling you what needs doing, you need to step up. This has nothing to do with her \"pregnancy hormones\" but with your behaviour", "ESH - It doesn't look like either of you wants to compromise on your cultural norms, which is rather typical. This is why people from different cultures rarely get along seamlessly. It would have been better to address this while you were only dating and not married expecting a child. Now you have to figure it out whether you want to live the rest of your life according to different norms, which you obviously find distasteful, or not.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife (29F) is 3 months pregnant and I (35M) have been married 4 years and dating 2 years prior. She hasn't been taking the pregnancy well, has nausea in the evening and she is crying and complaining that I am not doing enough. We both work in tough corporate jobs and I also run a small business on the side so generally very busy people.\n\nI am very happy to help and do chores like washing up, vacuuming, cleaning, groceries without her asking, however she has a way of requesting other things that really bothers me. She directly won't ask for something, she will just make a statement like 'the toilet smells' or 'the window is open' and expects me to follow through. If I don't catch on she will remember and complain to me that I am 'substandard' or 'not good enough' for not doing what she wants. She says I should know what she wants. \n\nYesterday I politely said she can learn a better way to ask for things as if she uses simple manners like please or thankyou it will make me want to help even more.  I also said that if she cannot, I will be less likely to want to help or being proactive with help. I said it doesn't cost much to say these things and it would benefit both of us. \n\nI tried to have a mature conversation with her to listen and understand her position more. She bursted into tears saying she's suffering, she won't change her behaviour and that's her real self. She says that because she is pregnant she wishes I should just be a 'robot' and do everything she says no matter how she says it because her job is to bear the child. She is sweet and polite to all her friends, family and work colleagues, literally all the time even during pregnancy (& periods) but as her husband I get her 'real self' which is negative, demanding, distant, and always impolite. I asked her why she cannot treat me like how she treats everyone else to which she replies in her culture husbands normally get treated this way (she is East Asian). She even said she should have married someone from East Asia and regrets marrying me because of my Western upbringing because I can't take her negativity.\n\nI understand she may have pregnancy hormones. If this was the case I would accept and bear with this as temporary but she has been like this before pregnancy. This negative version of her happens for 10 days before her period. I avoid interactions with her during this duration, as she's unpleasant to be around and id wait for the time when she becomes nice again, however now she is now like this 24/7 and is unavoidable. I have asked so many times in the past she should try learning to be more empathetic and nicer when she communicates, however she refuses and makes no effort at self improvement or even researching or googling the topic.\n\nShe is from an east Asian background and lived in a number of east Asian countries but is now settled with me in London, UK where I was born & bred.\n\nAITA for being bothered by her behaviour while she is pregnant?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Umm...\n\nNTA, I guess, but what do you mean by \"help\"? If the toilet smells, it's dirty. Is the assumption that it's her job to clean it and you just \"help\" with housework?\n\nShe sounds miserable, homesick and hormonal and like she needs to have some medical involvement to see if something can be done to help, but I do wonder if there are issues that you're not aware of that she's normally too nice to bother you with, but when she's hormonal she stops being able to ignore them.", "NTA. Pregnancy is not an excuse to act like a dick. She literally told you she’d prefer it if you were a robot. This person doesn’t love you", "NTA. Calling a spouse \"substandard\" is abusive, and she can't use cultural differences as an excuse. Technically it was American culture to force women to be housewives; I won't claim that we've solved sexism, but it's widely understood that our historical treatment of women was wrong and we've taken steps to improve. \n\nTreating someone poorly, especially your partner, is inexcusable. You can forgive a shorter fuse due to pregnancy, but purposefully making your partner's life worse is only something an AH would do.", "NTA\n\n\nUsing her culture and background as an excuse to verbally abuse you isn't it. I too come from a very strong minded Cuban background where our Women are incredibly strong willed. But that doesn't give me the right to verbally abuse my partner because I'm pregnant and hormonal. I hope you two can resolve this BEFORE your baby is born. She has no right to bring you down OP.", "She cares enough about other people to moderate her behavior & how she speaks to them. She doesn't care enough about you to not act & speak in a hurtful manner even when she knows it is hurtful. She's hurting you on purpose and has told you that she expects to do so forever.\n\nYou are NTA.", "NTA she’s being a total diva", "NTA. there is a running trend on this sub where pregnant women believe everyone becomes their servant and the world becomes theres to play with. society doesn’t favour anyone, not even a pregnant woman. i hate to say it, but she’s not special. if you’re rude, you’re rude, and justifying it with your culture is a good way to make people look down on it.\n\nshe has no right to treat you like that. i suggest you get some space. sure she’s going through a lot, but the emotional manipulation i’m reading is absolutely egregious. she should honestly be ashamed of herself. she’s too grown to be acting like a spoiled child with her husband. i’m from london too, good luck!!", "NTA\n\nThis sounds a bit like [Ask Culture vs Guess Culture](https://www.theatlantic.com/national/archive/2010/05/askers-vs-guessers/340891/).\n\nHonestly, I feel like guess culture is passive aggressive. If you want/need something, ask. \n\nRegardless, it feels like your wife is over the top and it's something more than that difference.", "NTA. Let her know until her communication skills improve within her nuclear family (you and her and future baby) you won’t be doing whatever she wishes anymore, pregnancy isn’t an excuse to mistreat your partner", "NTA - this is spousal abuse. \n\nPregnancy is hard yes. You do cry a lot, you are hormonal and cranky. However saying she wished she’d married someone else so she could treat them life a slave is not ok. Negging you and bring cruel isn’t ok. \n\nEvaluate if you really want to be married to her, I doubt it’ll get better with the baby. She’ll just abuse you both.", "NTA, she doesn't show you the basic respect and manners she'd show a complete stranger.🚩🚩🚩\n\nYou've tried to have a mature conversation with no positive outcome.\n\nWHEN PEOPLE TELL YOU WHO THEY ARE, LISTEN!!!\n\nI don't want to jump to telling you to reconsider this relationship but I'd definitely be pondering whether I could deal with this for the rest of my life.", "NTA for having emotions. Your wife seems to have issues communicating her needs, and certainly seems to have issues treating you kindly - “substandard” is not a good basis for anything.", "i’m sorry, but as a woman from an east asian background that isn’t a valid excuse for treating your partner like shit. \nNTA but she is. reevaluate your relationship and communicate.", "NTA being pregnant is not an excuse to verbally abuse your partner, if she wants a butler she can pay for one.", "NTA. Look, pregnancy can mess with you something wild, so it’s reasonable to cut her a little slack if she snaps occasionally, but it sounds like she is constantly verbally abusive and you absolutely should not have to put up with it. \n\nIf her behavior is truly hormonal, then I’m not totally unsympathetic but she needs to take responsibility for getting treatment. This also suggests to me that she is at risk for severe postpartum anxiety and/or depression. She probably needs to talk to her OB about pregnancy/breastfeeding-safe SSRIs. (I say this with no judgment—I was mentally/emotionally fine during pregnancy but developed PPA, and Zoloft was extremely helpful for me. I’ve since weaned off it and am doing well.)\n\nGood luck, dude.", "Wondering if she will be saying I was the child bearer now you look after the child.", "Suggesting people rethink their marriage to their currently pregnant spouse is peak reddit trashy.", "PMDD is not easily treated with SSRIs. Treated yes. Easily no. They aren’t a magic fix and anyone who says different either doesn’t know what they’re talking about or is being purposefully disingenuous. It’s like saying psychosis is easily fixed with anti-psychotics. They can help but it is different for everyone.", "Also there isn’t enough evidence to conclude that SSRIs are safe during pregnancy. They can be taken if the benefits outweigh the risk but that depends on individual circumstances and is a discussion to be had between an individual and their medical provider. Please don’t spread misinformation.", "Thanks for a sensible response. She 100% should talk to a doctor about this, one she's comfortable with as it's apparent the culture barrier may have prevented her from being open about this previously, thinking its normal.", "🙄", "racist", "He said in the very beginning he's picking up the slack because she's pregnant and not feeling well. If she can't do chores like before he is \"helping\", they both work and he even has a side business.\n\nShe's being rude, negative, and nasty to him. There's no reason to ever be abusive to your partner. I'm not an expert but I've heard you get more sensitive to smells and other stimuli while pregnant. So what she smells, he might not, it might not be that he's ignoring things it's just that he doesn't notice like she does.\n\nYou don't make demands of someone you love the way she is doing nor do you talk down to them.", "uh shes only three months she can get off her lazy ass and clean the toilet if it smells. it’s called ✨adulting✨", "She's 3 months pregnant,  not handicapped jfc!", "She said she regrets marrying him because he’s western so isn’t willing to put up with being treated like shit (her words, not mine, according to OP). But it’s thisnurselovesblood who is trashy for suggesting this kind of attitude isn’t conducive to a healthy relationship? Pregnancy or not no one should be forced to remain in an abusive relationship and that comments is pretty suggestive to me of her mentality towards this guy", "Would you not be rethinking it if your spouse was like this?", "Is it more or less trashy than treating your spouse like crap?", "So what, you just be abused because she happens to be pregnant? Pregnancy isn’t some magical plot armor that should protect you from the consequences of your behavior", "What's trashy is this pregnant woman justifying her toxic behaviour towards her husband as a culture thing. She literally belittle him and constantly tells him he's not enough as OP says in his post. Is that acceptable? Or her being pregnant enough to treat her husband like shit all the time?", "Yes, this is a fixable thing. It’s a communication issue and an unlearning of toxic behaviour. This is not one of those times where we should reach to divorce IMO.", "Uh right someone saying they regret marrying their partner because they want to be able to abuse them without pushback is just normal pregnancy hormones", "She literally said she regrets marrying him because he's Western.  He'll be Western even when she's not pregnant.", "This is how I react to that comment lmao", "No I would have said the same regardless of race", "But didn't you know that once a woman becomes pregnant, she's severely disabled? /S.", "At the start of pregnancy, especially if you're sick, smells can be unbearable. She is an adult, but so is he. It would be much much easier for him to clean the toilet, and it's not really \"helping\" to clean the toilet in your own house.\n\nShe sounds like she's being rude and unpleasant, but he sounds a bit clueless tbh and probably pretty frustrating to live with.", "It’s also quite racist towards Asian people", "he says he cleans. i’m taking him at his word."]}