{"id": 16130, "submission_id": "134liz6", "title": "AITA for not putting in a good word for my cousins fiancé at my work?", "selftext": "I’ve known my cousin for over 15yrs, I’ve seen her grow from a little girl to a mature responsible adult, she met a man a few years ago who seems like a decent fella and she’s happy with him, which I am happy about, a while back they decided they’re getting engaged, all the plans for the wedding have been arranged, invites have been sent to distant relatives of mine that she’s met maybe 2-3 times at most, I’ve not received an invite to the wedding yet despite it being less than a month away, whilst at work the other day her fiancé messaged me saying “hey mate, any chance you can put a good word in for me at your work?” I’ve not replied to him because frankly I’m still offended that he would ask me that despite not inviting me to the wedding, bear in mind me and my cousin are pretty close and see each other multiple times a week socially, so it’s not like I’m a distant relative that shouldn’t have expected an invite, I’ve not asked them why I’ve not been invited because i don’t want to be an afterthought at this point, so AITA for not putting in a good word?", "created_utc": 1682945151, "permalink": "/r/AmItheAsshole/comments/134liz6/aita_for_not_putting_in_a_good_word_for_my/", "score": 295, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn’t help my cousins fiancé get a job at my work because he didn’t invite me to their wedding\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I'm setting aside the wedding snub to say NTA. Never jeopardize your professional career to vouch for someone with whom you've never worked. (If putting in a good word is something you'd normally do for an acquaintance, and you're not doing it because of the wedding snub, that's a little petty but understandable.)", "NTA, for not putting in a good word. You're never obligated to do that for anyone. Although I wonder if your invitation got lost in the mail. Because it's odd you didn't get an invite. Considering you are close and see each other weekly socially.", "NTA\n\nAlso, ask them why you haven’t been invited. It could come down to your invitation ended up getting lost in the post. Maybe her fiancé isn’t aware of the fact you haven’t been invited?", "INFO- You meet your cousin multiples times a week and yet you didn't receive an invite to her wedding? I think most people would assume it's been a mistake and simply ask her. Is there any reason to why you would think it's not a simple mistake from their side?", "NTA. Unless you actually know this guy and are prepared to actually vouch for him - a \"good word\" can sometimes backfire on you if they turn out to be a lousy employee. As for the wedding, you might just ask if you should be expecting an invitation. It could just be a simple mistake with the postal system.", "One thing may have nothing to do with the other.   But personally, after having been burned by two different people, I do not recommend anyone at my current employer.   I will offer to be a reference person, but I will not stick my neck out for anyone I know.   That just comes back to bite you.    So you can either ignore the request, tell him that you have no pull with HR or the department he is interviewing for or just say that you don’t mix business and personal anything.   Will it piss him (and potentially others) off?   Probably, but do you care?   \n\nOr you can just say sure, then don’t.", "NTA.\n\nPutting in a good word means you are vouching for him.  If he flies, that's great.  If he sinks, you look bad too.  Only do it if you feel like he would truly be an asset to the company.  Since you don't really know him or what his work ethic/skills are like, it is not un-reasonable to not do it.  Maybe ignore it and see if it goes away if it's just a casual off the cuff remark.\n\nAnother generic response to k\"keep the peace\" is to ask him to give you a copy of his resume, and pass it on.  If your company asks if you recommend him, can just say something like \"I'm just passing it along.  I have not worked with him before so I cannot say for sure.\"\n\nThe wedding invite is irrelevant, though I do detect a bit of saltiness there.", "INFO - Have you asked your cousin if you're invited? People make mistakes. My best man and his wife, who I introduced to each other, invited me to their wedding and reception but forgot to include me and my wife on the seating chart. Sounds like you're being passive aggressive and petty.", "NTA. Never ever give your word about someone's work performance if you've never worked with them. Their performance will reflect on you whether it's good or bad.", "NTA - Never put in a good word at work if you aren't 100% sure they'll do a good job. Learned that the hard way.", "NTA - I refuse to do that sort of thing if I haven’t worked with that person before. If you put in a good word, he gets hired and then hes not a good worker you look like an asshole at work", "Ok but there many situations where the weddingplaner etc made a mistake and didn't sent it out . So are you sure they didn't invite you ? did they gave  invitations to your other cousins , directly into their hand or was it sent ? so what are you planning to do ? wait until the the wedding is over and then never talk to her again ? if there is nothing wrong with your relation then ask her if there is an issue like the venue is to small for more guests or the budget etc and let's be real weddings are not that important nowadays look at the divorcerate so its not like a once in a lifetime event you maybe join her at her second wedding . let us know what her reason was . you have to know the reason anyway before you go NC with her. How old is she ? It sounds a lil odd that you only know her for 15 years", "NTA. Take the wedding out of the equation.  You know that he's a bad employee risk. If you're honest, you would have to not recommend them.  Recommending someone puts your professional reputation on the line. Don't risk it on someone you don't know well enough.", "NTA i have a policy to never put my name on the line at my job for anyone. You have the right to be upset about the non invite to the wedding but you must realize it’s up to them who they invite. It just shows you that you and cousin aren’t as close or friendly as you thought you were. To keep tensions down don’t respond let him get the job on his own merit , or not.", "YTA\n\nYou are laughably immature.\nA mature person would use their words. Talk to your cousin. If you are as close as you say you are, then most likely you are supposed to be invited, but your invite was lost. Instead, you try to harm your cousin's fiance at the workplace, which is, frankly, very unprofessional.", "YTA because you're not putting the word in out of spite and you haven't even spoke up. There's multiple reasons you may not have got the invite", "YTA for failing to communicate your feelings", "INFO do you have knowledge of the fiancé's skills and work habits?  If so would the fiancé be an asset to your employer?", "Yta if you are not recommending him out of spite. Beyond that no there’s no obligation especially as his actions can reflect upon you and so if he sucks then it could hurt you. \n\nDefinitely call your cousin about the wedding", "You did this out of spite?\n\nThere's no other way to see it, YTA.\n\nWeddings are very expensive.  There's simply no budget for average people to invite everyone they love. When people respond to the petulantly, they're unsufferable.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’ve known my cousin for over 15yrs, I’ve seen her grow from a little girl to a mature responsible adult, she met a man a few years ago who seems like a decent fella and she’s happy with him, which I am happy about, a while back they decided they’re getting engaged, all the plans for the wedding have been arranged, invites have been sent to distant relatives of mine that she’s met maybe 2-3 times at most, I’ve not received an invite to the wedding yet despite it being less than a month away, whilst at work the other day her fiancé messaged me saying “hey mate, any chance you can put a good word in for me at your work?” I’ve not replied to him because frankly I’m still offended that he would ask me that despite not inviting me to the wedding, bear in mind me and my cousin are pretty close and see each other multiple times a week socially, so it’s not like I’m a distant relative that shouldn’t have expected an invite, I’ve not asked them why I’ve not been invited because i don’t want to be an afterthought at this point, so AITA for not putting in a good word?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Never recommend someone for a position unless you can honestly vouch for their work ethic, skill set, and past performance.  If the recruit does not meet expectations it will reflect poorly on the person who gave the referral, i.e. you.\n\nThis should have nothing to do with your cousin's wedding.  It's understandable to feel hurt about being omitted from the invitees, but hard choices have to be made by anyone paying for a large formal gathering. Try not to take it personally or allow it to color your perceptions.\n\nNTA", "NTA for not putting in a good word with your employer. If he was to get a job from your recommendation it wouldn’t look great on you if he turns out to be a terrible employee. \n\nHowever, YTA if the only reason you are not willing to put in a good word is out of spite. From reading this I think most people can see that this is likely just a simple mix up. You need to just ask your cousin, in a non-confrontational way, about not receiving an invite. I think you’re overthinking the situation of being an “afterthought”, if you have a problem you should be up front and get some answers rather than taking actions out of spite", "Why would you put in a good word? They don’t seem to think much of you.NTA.", "Nah it is slightly down to the wedding snub I’m not going to lie, but also I’ve worked with him in the past and know he’s not the best of workers nor likely to stick the job out if I were to get him it, I’ve known him for about 2yrs and he’s had at least 5 jobs all in different sectors since then, so getting him a job was never going to make me look good anyway cos no doubt he would leave this job too", "I sorta do want to ask why I’ve not been invited just to ease my mind and see if I’ve done something to offend them, but the fact he’s asked me to help him get a job at my work sort of makes me think I’ve not done anything to offend them otherwise he wouldn’t want to work with me, there’s no chance of the wedding invite getting lost in the post as we live literally 5mins from each other and see each other regularly so they could have just handed me over the invite personally, it’s not like me and my little cousin have ever had a falling out or that either, I’ve literally seen her grow from a kid to an adult and would describe our relationship as like older brother and little sister more than cousins, if I was invited at this point I think I’d probably be more offended seeing as it’s less than 2 weeks until their wedding", "But they’ve invited people from my family they’ve literally only met less than a handful of times…surely you’d invite the family member you see often over the person you see once every few years?", "I mentioned the situation to my boss and he told me to tell him to come in for an interview on the day of his wedding, if he says “I can’t, that’s my wedding day” then reply to him “I didn’t know, I didn’t get an invite” haha I wouldn’t do that though", "This. I've recommended people before because they were good or were nice and then got burnt because they were not right for that role or that company. The thing is its never their fault or the person who hires then that's blamed or spoken about, it's you because you said they were good. Then they question your judgement if something else happens and that recommendation comes up again too.", "I saw that the invites were sent months back on Facebook and was told by my other cousins that they had been invited, ones that live in a different country, the reason I’ve known her for 15yrs is because before that I lived elsewhere and our families weren’t as close as we are now", "“I try to harm my cousins fiancé at the workplace” \n\nHe’s got a job already, it’s not like I’m financially fucking him by not getting him a job with me, probably should have mentioned he’s known for leaving jobs constantly and has had 5 jobs in the 2yrs I’ve known him", "It’s semi out of spite, I’ve also worked with him in the past and know he’s a pretty shit worker who doesn’t stick with jobs, my work isn’t the best of places and is no doubt worse than the place I worked with him before so I seriously seriously doubt he would stick at my job for long even if I was to get him a job there", "Never be a reference for somebody you have not personally worked with.", "Just tell him it’s because he’s flaky, then (or rather, “they’re looking to build the employee up over time and require a person who can be relied on in the long term, whereas I know you enjoy the stimulation which comes from consistently seeking out new experiences.  And where’s me invitation?”).", "So why make your refusal about the invite rather than the fact you don't think he's a good fit? One is practical and not personal, the other is petty because you can't be bothered to ask a simple question.\n\nYTA. Ask. For all you know it got lost in the mail or someone messed up and added your name to say your parents' invite.", "Yeah it definitely is very strange. I’d 100% ask why you weren’t invited as sitting and wondering about it forever (or trying to act like it never happened) will make you angry in the long run. \n\nI hope it’s just a simple miscommunication and it can be worked out, as it seems you and your cousin have a good relationship, and it would be a same for that to be ruined. \n\nGood luck!!", "Maybe your invite got lost in the mail or maybe because you see her often you cousin has your invite in the bottom of her purse and just forgot to give it to you. You wont know unless you ask.", "That's exactly my point. I think that's why there's been some sort of mistake and they've forgot to send an invitation to you or something. What makes you think it was deliberate?", "I went to two weddings last year that I wasn't formally invited to.\n\nIt was mentioned casually in social events or by text that the wedding was on x date and y location and that of course I'd be there but no invitation was sent.\n\nI went to both but it felt weird that there was no invite. It seemed like half the attendees received invites and half didn't.", "Oh my good giddy god, TALK. TO. YOUR. COUSIN.\n\nEveryone here is saying the same thing. You've seen her grow up, you should be close enough to be able to go \"so hey, am I invited?\" Hell, get one of your parents/siblings to ask on your behalf if you're too awkward to do it yourself.\n\nYou're letting this situation fester and cause resentment when you don't even know for sure what's going on.", "OP said they have worked together and this is spite", "I’ve literally never been to a wedding, so was really excited when someone I thought I was extremely close to and proud of was getting married and would be the first wedding i attended, alas it was not to be lol it might be the same situation with me that some people got invites and some didn’t but I’m not the type of person to turn up without an invite in case I get asked “why are you here when you wasn’t invited??” Plus they made a pretty big deal of them doing the invites by taking pictures of them and putting them online with a caption saying something like “invites done and being sent” so assume it’s all down to invites and not just turning up", "Above you note that they were indeed 'sending out' invites. Why do you think it is more likely that the cousin you are so close to decided not to invite you to their wedding vs the invite being lost? Planning a wedding can be a messy affair and some invites aren't delivered properly. The fact that you were too prideful to ask about your invite and instead let the problem fester into anger and resentment is the main problem here, not the fact that you don't want to recommend them to your job. You're acting like a child.", "NTA. You're all good.", "NTA. You have two issues here, so I think you should separate them.  First, the answer to the job help is no.  You need to stay out of that entirely.  He needs to do this on his own merit.  Second, I think you should call your cousin and ask her directly why you weren’t invited to the wedding.  Make sure it was intentional before you get offended.\n\nI wouldn’t respond to the fiancé at all.  When you’re toward the end of your conversation with your cousin (no matter which direction it goes), you can throw in a “BTW, your fiancé asked me to intervene in helping him get into my company.  I’m not comfortable doing that for anyone, not even family, so please let him know that’s a non-starter.”", "NTA but my friend thought he wasn’t invited to our mutual friends wedding and she asked why he hadn’t rsvpd. He got the invite a week after the wedding as she had forgotten to put a stamp on it so it could be something daft like that. I would ask them", "NTA For not endorsing your cousins fiance, but unless you ask your cousin directly if you were or were not invited y.t.a for being mad about it. \n\nYou won't ask, but you want to know, but you're mad about it. It's hard to empathize with you on this.🙄", "NTA I vouched for a close friend who *hated* his then-job, he was a shoe in for this new role via my reference. Then he fucked around on accepting,  made a few surprise accommodation requests, and ultimately passed on the job. I was floored. If you already don’t feel comfortable doing so, then hard pass", "NTA, if anything it spares any accusations of favoritism down the line.", "NTA", "\"Although I wonder if your invitation got lost in the mail. Because it's odd you didn't get an invite. Considering you are close and see each other weekly socially\"\n\nNot odd at all sadly. You can view a person/ group of people as a close friend/group of friends and they can suprise/ shit all over you. I've seen it many times and there's really no limits to how shitty people can be to others. Loyalty can be an elusive and funny thing.\n\nAs my mum used to say expecting loyalty from others because you are good to them or close to them can be like feeding a bear and expecting it not to eat you too. \n\nDon't believe me? google it and you'll see a million threads like this across the web. This sort of behaviour doesn't end in the playground.", "NTA. It’s really never a good idea to vouch for someone at work unless you truly can. Also - please check with your cousin that your invite didn’t go astray in the mail. For our wedding we invited all of the out of our family members to a dinner then night before the wedding via a separate invitation. The invite for one cousin went missing. NO ONE inquired - they all just assumed I snubbed her. But, my MIL, who paid for the event thought she was the hero of the day and dragged her to the event anyway so I had mo clue until years later when my MIL basically went down a list of my poor behavior.  I was so embarrassed that they thought I had purposely excluded one cousin. I even went back to my file with our distribution list and she was on it so can only guess it was a USPS mistake.", "There are also those who only invite relatives with deep pockets or a history of high end gifts/donations.\n\nThey tend to prioritize those over even close relatives.\n\nNTA", "Dude, even if you were invited to they're wedding, you have more than enough reason not to stick your neck out for him at work.  Their wedding is a day.  Your job is your livelihood.", "Do not put in a good word for a person like that", "You can do the bare minimum.\n\n\"Hey, HR? My cousin's fiance has filled out an application. I am not a reference and do not want to be involved in anything from this point on, but he asked me to 'put in a good word' so I'm letting you know he applied.\"", "You could go to the hiring manager and be honest. Just say your cousins fiancée asked you to put in a good word for him. You could say that if you owned a company, you would not hire him but are trying to keep peace in the family. Hard worker when he wants to work, mostly reliable, does not let his drinking problem interfere with his  duties etc and they will understand.", "If the wedding is less than 2 weeks away, they’ve tallied up all their rsvp’s and are finalizing numbers for food. I’m guessing the exclusion was intentional as by now they would’ve realized they never got an rsvp from you. Hopefully I’m wrong and am just projecting bc I was deliberated excluded by (what I thought was) very close family with their wedding plans. But it doesn’t hurt to ask.", "Some people want to mail invitations instead of giving them in person. It literally could be a simple mistake - maybe both were addressing envelopes and each thought the other had already done yours. Or maybe he was supposed to give you yours in person but put it in a bag and completely forgot about it, because things happen. \n\nThe thing is, if you’ve offended him seriously enough for him to not want you at his wedding, then you might as well know as soon as possible and both of you can quit the pleasant act. \n\nIf you haven’t offended him and there’s been an honest mistake, then you’ve been nursing hurt feelings all this time over nothing. And if you don’t ask, then you’re extending those hurt feelings and potentially making a whole Big Deal out of it all - because if he truly wants you there and thinks you’re coming and you don’t show, then HIS feelings will be hurt. \n\nBe an adult and communicate, and deal with whatever answer you get.", "Super weird", "Closed mouths don't get fed. Talk to your cousin.", "If you're afraid of asking your cousin directly, see if the RSVP is on a wedding website. You can usually search the names of the bride/groom in Google, and wedding site will pop up, enter your name in the RSVP section.", "I would.\n\nI like your boss.", "That boss is grand.", "thank you! OP just needs to open their mouth and ask! If cousin doesn’t want op at their wedding, that would be true two weeks before and forever after, so OP just ask if you’re as close as you say. forget the good word for the fiancé.", "NTA but I would reach out to your cousin and enquire if you were invited, as you would love to celebrate with them for the happy occasion. If they say no, then respect their decision, and simply do not respond to the groom about putting in a good word, plus... you cannot put in a good word, as you yourself do not know him.", "You're NTA for not putting in a good word for him if they've specifically excluded you from their wedding, but you're kind of a dumbass for not just texting your cousin and saying, \"Hey, I've heard the invites are out and I haven't got one... should I expect one?\"  \n\nThis seems like a cousin you are close to.  It's trashy to beg an invite to something, but in the case of a close-knit relationship AND close genetic kinship you are fine to ask the question.  Stuff happens, people get lost in the shuffle, invitations fall down an elevator shaft (yes, literally, happened to me, I had to beg the building maintenance people to go fetch them), the post office does lose some fraction of mail.", "NTA\n\nIf your parents are still alive, then ask either one of them to call your aunt or cousin and find out…I always use my mum as an excuse to get me out of awkward situations, such as this one.", "NTA for your question, you said it kinda came down to the snub but said he's not a good worker... it's really in your best interest to not put in a word I wouldn't have anyways, you don't have enough trust to stake your career on it. But YTA for not asking your cousin about your lack of invite. If it's really a snub you can find out what's going on and decide how your relationship will proceed.  It might be painful but it'll be best to hash it out now. However, there's a decent possibility that it was lost in the mail. Stuff like that happens. You need to figure out what's going on by communicating like an adult before you let your emotions make final judgements.", "NTA", "NTA.  I never gave a reference for a family member or friends.  The few references I gave over the years were for those that I had worked with in my field at a different company and never a subordinate.", "Even if it got lost in the mail I would think the cousin would follow up to ask about his RSVP seeing as it’s only a month out.", "Or maybe the cousin didn't even send out formal invitations. Some couples just send out mass emails. OP won't know until they inquire. If it was my close cousin, I see socially on a weekly basis, I'd bring it up. I'd want a reason for not being invited. Especially considering the groom called for a job referral. It would be nervy to ask for that, while not inviting OP to the upcoming wedding. Some people are nervy though.", "You should ask: what if it’s a “duh you don’t need an invite, of course you’re invited” situation? While\nOdd, I’ve seen similar miscommunications and feelings get hurt without anyone just discussing it.", "I've seen people exclude  close lifelong friends from all sorts of events. People never suprise me anymore. It's probably why as I get older I enjoy my own company more and feel much less needy. It's because I can't be bothered with all that anymore, you get to a point where it's no longer worth it.", "The bride and groom should wonder why the RSVP has not come back in yet.  I have helped with a number of family weddings.  At this point I have made calls to family members asking about their missing RSVP.  Never had one person say they never got the invitation.", "My good friend forgot to give me the invitation to her wedding, and I was driving the bridesmaids and arranging the flowers. She didn't notice on the rsvps because she just assumed I would be coming.", ">online with a caption saying something like “invites done and being sent”\n\nSo you *know* that the invites were being sent by mail and still refuse to even accommodate the notion that just *maybe* the delivery service f'ed up and yours just went missing. Why are you automatically assuming malicious intent when you apparently see them multiple times a week and are quite close?\n\nMaybe they might've intentionally snubbed you, but through your responses it's seeming more and more likely that they didn't.", "He is the best boss there and sadly he’s leaving at the end of the month, stuck with the shit bosses when he leaves haha", "What if the invite was lost and you skip the wedding, and your cousin is hurt that you didn't show?\n\nWhat if she's wondering why you haven't RSVPd but she won't ask because she \"doesn't want to feel like an afterthought\"?\n\nTalk to your cousin. Today if possible.", "NTA years ago  I put in a good word for my wife's cousin's husband.  He got hired and never showed up to work.  I'll never do that again", "NTA don’t put in a good word for people you know at your job. When it goes south it can look bad on you. I’ve seen so many people regret putting in a word for someone at their job.", "Yea I could never go if I didn't receive an invite lol.", "90 percent of answers point out your invite was probably lost. Also, they all suggest you ask the cousin directly. You've answered everything else but that one thing: why don't you just ask???\n\nIt's highly unlikely you weren't invited, so everyone here is curious - would it hurt to ask her, even in a roundabout way?"]}