{"id": 1614, "submission_id": "ynn2n4", "title": "AITA for not wanting to reconcile with my cousin who sold the 2k laptop I gave to her son for drug money?", "selftext": "A while ago I gave my younger cousin, a teen just trying to live in a messed up home, my gaming laptop. My only gaming laptop at the time. It was worth 2k. He loved it. Nearly cried. I set it up for him, bought some steam games for him, planned to hang with him online when I got a new laptop. \n\nAfter buying myself a cheaper laptop, I try and set up some gaming times like we had planned. He seemed oddly evasive and avoided any discussions about gaming or the laptop. Eventually said the battery died. I offered to buy him a new one. He avoided the topic again. \n\nI find out that his mom sold/stole his laptop for drugs and he was just trying to protect his mom. I sent him a small desktop to at least get him his own pc, so let's hope she doesn't steal that one too...\n\nAfter hearing about what happened, I was irate, naturally. It's been almost a year since then and now that Christmas is here, my family is trying to get me to treat the thief like everything is normal. She hasn't even apologized, mind. I've so far refused to have anything to do with her. \n\nSo, AITA for holding a grudge against family? Supposedly she's off drugs now. Supposedly.", "created_utc": 1667732476, "permalink": "/r/AmItheAsshole/comments/ynn2n4/aita_for_not_wanting_to_reconcile_with_my_cousin/", "score": 634, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I'm refusing to reconcile with my thief of a cousin despite requests from family, which will likely ruin Christmas plans at the very least. Does that make me the A?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You did something really good and she did something really bad. It also seems that there have been no consequences for her and I don't know why the rest of your family are trying to pretend that nothing ever happened.", "NTA. Isn’t part of recovery making amends to the people you have wronged? She isn’t doing that with a small apology to you. You can choose not to have a relationship with her or anyone else. The family is just making excuses for her past behavior by expecting people to forget how she treated them. That doesn’t help her recovery at all.", "NTA and I hope you cousin gets out of that home as soon as possible.", "NTA\n\n&#x200B;\n\nTell them you will reconcile after you got the 2000 back. Start a habit of adressing her as \"THIEF\" when you see her.", "NTA. It’s easier for the family if you don’t make them confront uncomfortable truths, but if it’s bothering you that much you should not be expected to “let it go” just so they feel comfortable. This was a huge breach of trust and it involved a child caught in the middle. Poor kid.", "NTA\n\nHas she ever even apologized?  If she is truly clean, she would apologize.", "NTA - her apology is the first step before you even consider this decision.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA while ago I gave my younger cousin, a teen just trying to live in a messed up home, my gaming laptop. My only gaming laptop at the time. It was worth 2k. He loved it. Nearly cried. I set it up for him, bought some steam games for him, planned to hang with him online when I got a new laptop. \n\nAfter buying myself a cheaper laptop, I try and set up some gaming times like we had planned. He seemed oddly evasive and avoided any discussions about gaming or the laptop. Eventually said the battery died. I offered to buy him a new one. He avoided the topic again. \n\nI find out that his mom sold/stole his laptop for drugs and he was just trying to protect his mom. I sent him a small desktop to at least get him his own pc, so let's hope she doesn't steal that one too...\n\nAfter hearing about what happened, I was irate, naturally. It's been almost a year since then and now that Christmas is here, my family is trying to get me to treat the thief like everything is normal. She hasn't even apologized, mind. I've so far refused to have anything to do with her. \n\nSo, AITA for holding a grudge against family? Supposedly she's off drugs now. Supposedly.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  At all.", "There is no indication anywhere in the post that the cousin is part of any recovery process", "NTA", "NTA.  Forgiveness is earned. That starts with acknowledging what you did wrong and making reparations. You were nice to give your cousin a desktop after the theft.", "I get cold. Learned it from an ex girlfriend. I still liked her but she stopped liking me. Didn't take me long to learn that relationship is dead. I would just not care if that person was there or not. I would not hide my feelings. Like when they come to my world, I automatically secure my belongings. They talk to me and I am unresponsive. They do things for me and I am unappreciative.", "You can pick your nose but you can't pick your family. I would be polite to keep the peace within your family for Christmas. **TW talk about drug abuse I**>! feel bad for your cousin who has probably spent his formative years lying about his junkie Mom who sells anything and everything that isn't nailed down to smoke or shoot up with.!<\n\nYou are NTA - I would however give your cousin cash or physical presents. Instead plan a day out somewhere.", "NTA.  She can ask for forgiveness **after** she has replaced what she stole.", "NTA - the family should be helping the cousin's son get put of the abusive home. They hurt him by pretending normal.", "NTA a junkie stole her kids laptop and they want you to make peace? Hell no. I’d call her out on it and explain to all your well-meaning relatives that they can pay you for the stolen laptop or she can have charges pressed", "NTA- but me being the petty one I am, I’d get them ALLLLL together. Bring her up, and say “so did you get a good score with the laptop you stole from your son?” In front of them all. That would be the apology I’d want.", "And an amend in this case would be to replace the actual gaming laptop", "NTA\n\nand don't forget that she may pretend to not be an addict and a thief but she always will be.", "NTA\n\nI say this as a recovered drug addict of 16 years. The rest of your family are the AH and are not helping in her recovery if they just want to swept this under the rug. Part of recovery is making amends. But you have to actually mean them. I did some messed up shit when I was an addict. I went to the people I wronged and apologized. I took the consequences that came with the messed up shit I did. Lost a few people I loved along the way. But I never blamed those people because it was my actions that caused the end of the relationships. \n\nI really feel for you nephew. I wish there was some way to get home out of the abuse he is suffering.", "Fuck her.   I grew up in a family like this where no matter how shit my brother was I was expected to accept his apology.   It's cancerous to your mental health.", "NTA\n\nBut why is everyone in the family overlooking that this woman stole her child’s things for DRUGS???\n\nLike, thieving is a symptom of a much bigger problem, and one that threatens the safety of your young cousin. (Who is possibly a minor.)", "NTA. The onus of reconciliation is not on you. It's on your cousin.", "NTA.  Sounds like your family is just enabling her.  It's totally your call if you want to forgive her or if you even want to be in the same room as her.\n\nThis would be your decision but if she's stealing his property to purchase drugs, I can't imagine what else she's doing to her son.  You might consider dropping a dime with child protective services.", "Agreed. \"Forgiveness is divine\" and such. Family is more important than stuff, yes, but she could at least admit her fault. I feel like just pretending it's gone just leaves her open to doing stuff again.", "Dotto.\n\nI said I'd pay for his plane tickets to any realtives/friends if he ever felt like getting away for a while. And his mom, like a five year old, \"has to come along\" to make sure he's okay, thus voiding the entire point.\n\nI'd even fly down to pick him up if it wasn't for her definitely insisting on coming along. She's like a child, and the family is so scared of making her cry or tempting her suicide issues... without worrying about her poor son trapped in this crap.", "Good point. She's still playing the victim card from what I hear too. I'd be happy with just an apology, but it's looking like that's not happening. I hope she at least apologized to her son.", "Couldn't agree more.", "Tempting, admittedly. She's by no means wealthy, so I'd just be happy with an apology and be done with it. But... you might be onto something, maybe give the ultimatum of 2k or a real \"I'm sorry\" and an admission that she's a thief.", "Hey, that's what I call my neighbors! It is fairly effective too.", "Never. Not even hinted at it. It's like she doesn't even consider herself wrong, as if the addiction was the only thing at fault.", "Agreed", "In this case, absolutely agreed. If she wants us to be chummy family again, she should at least treat family like family and apologize. \n\nI wish I could do more for him. His immediate family is pretty awful, one aunt practically held him hostage for like a month after he visited her, she refused to take him to the airport till her tiff with his mom was resolved. During the school year, mind. And his stupid mother and others refused to call the police. I threatened to, but got so much pushback I just did what I could to pressure parties to get them to make up.\n\nLooking back on it, I should have just called the police... that 'aunt' also 'took back' the puppy she'd given to him months later, breaking his heart, and is now trying to leverage the dog against his mother.\n\nPhew... didn't mean to vent. It's just so effed up for the poor kid.", "Tempting. But it's less about the money, though daaaang it hurts, and more about her just being a decent person and apologizing. But for some reason my family keeps taking her side and acts like I'm being the jerk. It's weird.\n\nAlso, pressing charges... it'd just ruin her son's life even more. His mother's an idiot, but she at least tries to love him now, from what I've heard.", "My sadistic gremlin side completely agrees with you. And if she doesn't fess up soon, maybe it's what I'll do. Of course, without her son present.", "I think she'd sooner OD than give 2k away, since that's a lot, a lotta lot of money for her. I don't plan on trying to get it back. I do 100% want an admission of what she did and an apology though. A 2k worth apology.", "Yeah, by leaving him there it's cruel. Unfortunately, his immediate family isn't good at all. And the kid is loyal to his mother; he's a good kid, being loyal and forgiving his mother despite all her crap. He's got a big heart. Arguably too big.", "Yeah I feel bad for him too. Gonna be sending him some extra gifts this year. Unfortunately he's half way across the country, so I'm a bit limited in what I can do right now. I wanted to save up and nab him a ps5, but those are about as rare as gold atm....", "I hear you, but if I get cold, that doesn't make me happier. I don't want to limit my happiness and myself because I want someone to apologize. Basically, if someone wrongs you, I don't believe they should have any power over you, at all.\n\nSucks about your girlfriend. Hope you find someone new. As far as relationships go, try actually being just you and finding happiness. The biggest \"FU\" for that kind of relationship is you moving on and showing them what they missed out on. Then whenever they talk to you or see you, they feel that burn, but by then you don't need to care, since you've left them in the rear view mirror.", "Forgiveness can only be given once repentance occurs. It can be available on condition if repentance but the transfer won’t happen until the conditions are met.", "> She's still playing the victim card from what I hear too\n\nIf I were you, I would embarrass your cousin with sarcastic comments whenever you meet. Make sure to ask the questions loudly enough for everyone to hear:\n\n* It must be exhausting thinking of new schemes to steal from your son, so how do you stay refreshed?\n\n* My friend is thinking about stealing from his children, so can he contact you for advice?\n\n* Do you steal your son’s valuables all at once (like harvesting strawberries) or in cycles (like harvesting wheat)?\n\n* Is stealing from your child a union job or do you freelance?", "It's concerning that your family is backing her. Have they made sure your cousin is being parented? Is he safe? Is he fed? Is their heat? Does he see a doctor when needed?  It seems if she is stealing from him for her drug habit, your cousin may not be safe nor taken care of.", "Then you are under zero obligation to her for any damn thing.", "I grew up in a family like this, all the birthday and Christmas money my mom took / stole from me and used for her cigarettes/drinks. The only way I got her to stop- was to ask her where the money went in front of everyone/the person who gave it to me. She even took $3k from my bank when she kicked me out- they’ll keep doing it, it’s a sickness!", "Thanks. This happened 30 years ago. She left me in her head. I could tell she didn't care. We broke up and I did that thing where I call and call one night not saying anything but trying to get her back. She had feelings for me before. After, she couldn't care. \n\n&#x200B;\n\nI stopped contacting her for a couple years. Then we tried hanging out in a friend group. She had a boyfriend. I still had nobody and secretly hung on. Pathetic. After a while, I got sick of heartbreak and moved on. Forgot about her. After a decade she wandered back in my life, just as I met my wife. I almost went back. Best decision of my life. Now when I see that girl, I hope she is happy and healthy. I learned to be careful, don't take for granted. What me and the wife share is special, until it ain't and you can't glue that glass back together\n\n&#x200B;\n\nWhen I am cold, it is more the absence of warmth. I agree. Hate controls you.", "Ouch. BRUTAL. That'd be a pretty hard KO. I'll have to consider it... btw, have you ever considered a career in verbal assassination? You'd do well there.", "When she was stuck on drugs, his grandpa made sure he was taken care of. Now she's trying to assume the role of caretaker, to what effect, I'm not totally sure. So he's got basic necessities down. I've been sending money when I can to help and confirm with his grandpa it's being used properly. So for that at least he's okay.", "Dang, sorry. That's a rough start in life. It is a sickness that destroys everyone around, not just one. Congrats on escaping all that crap as best you could. \n\nThis isn't 3k, but have a gold as a vote of respect. I hope you've found a far happier life now.", "Glad you found your happiness! And you're 100% correct. Hate controls you if you aren't careful. It too is an addiction is a sense. \n\nI don't hate my cousin, but I'm just not interested in \"playing\" family with her anymore. If someone doesn't want to respect you enough to say \"I'm sorry\", then you don't need to respect them.", "I wouldn't send money. Instead offer to go with and buy their groceries, or pay a bill directly. Less temptation and you know she isn't overstating costs and taking a little off the top.", "You as well! Thank you!", "NTA. You should not have to play peace keeper with a thief.", "NTA.  Addiction is a disease requiring real help, support, and forgiveness.  However personal responsibility is a big part of that process", "If you give the laptop to the kid get it in writing its a loaned item. If she steals it again tell her you will be calling the police and having her charged. NTA.\n\nAlso if this is a big issue and she starts back doing stuff like this you need to call CPS. This isnt ok. This isnt safe or healthy and he shouldn't be around that environment where nothing of his is safe and his mom is tweeking out with him a room away. \n\nNTA", "NTA", "NTA, and if she really wants to make amends, then she can bloody well replace the gaming laptop; otherwise, it sounds like she’s full of it.", "Are you willing and able to raise him?  If so, are you willing to go scorched earth to do that?", "You need to be careful with anything you do for him because he already tried to cover for his mom ones. Don’t send him any expensive gifts or even money. He enables his mothers behavior because it’s the way he grew up. Hopefully he gets to a point where he can stand on his own but right now you can’t even trust him.", "op said that she is now supposedly off drugs, which would be considered being in recovery.", "While this would be absolutely HILARIOUS, if you do it please make sure you talk to the son first. If he's protecting her still it might backfire on your relationship with him worse.", "Don’t do it.  Absolutely no point.", "Nta", "NTA.  What she did is appalling!  There should be consequences.", "NTA! If she’s clean and if she’s working the steps (AA) she has to make amends. She hasn’t. \n\nWhat she’s done to her child is criminal—literally, emotionally, and psychologically. \n\nUntil she works the steps, has a history of sobriety, and makes amends for her transgressions she gets no forgiveness. She’s a thief, an abusive mother, and a toxic human being. Addicts destroy everything around them (experience here) and they too often con those around them. \n\nYou owe her nothing!  But your support of her child is commendable and I’m sure it means the world to him. \n\nStay firm, she has earned nothing but contempt. Too often empathy and compassion turns out to be enabling. They know that and use it to their advantage. She shouldn’t even have custody of her child. \n\nI’m sure I sound harsh but experience is a bitch.\n\nEdit typos", "NTA \nAnd she shouldn’t expect you to, one thing I learned early on in recovery is I can apologize for my actions but they’re not obligated to forgive me", "Bingo.", "A recovery program does not require making amends. Support groups like AA and NA can have that requirement", ">If she is truly clean, she would apologize.\n\nPeople who don't do drugs can be assholes. These things are not really correlated with each other; the fact that she didn't apologize doesn't prove she's not off the drugs.", "Sober guy here, even if she tried to make amends you wouldn't owe her forgiveness.  That's up to you.  If she's not even sorry about it you most definitely don't have to let it go.  She's still in the disease most likely so all bets are off.  Not only should you not forget you should possibly distance yourself from her as well.\n\nTo be perfectly blunt, your family is enabling her and quite literally helping her disease.  If you wanted to distance yourself from more of them because you wanted no part of that you would be entirely justified and IMO right for doing so.  Obviously though, you do what you feel is right.  I am not trying to tell you what to do.\n\nAdditionally I would doubt she apologized to her son.  What the disease would make her conclude would probably be: \"It's not my fault things happen to me and I needed to use.  I did what I had to do.  He didn't need the laptop anyway.\".", "OP, every time a family member supports her by saying she's off drugs now, you should correct them by saying \"*Supposedly* off drugs\" (adding air quotes would be a bonus). That should piss her off and if you keep doing it, will plant doubt in the family's minds and make them keep a closer eye on her. Might also keep them from bringing up that sort of bs. Until she's actually involved in some sort of recovery program, she is essentially still using -- just maybe taking a break for a while.", "Well, that's not true - you can forgive someone even if they don't repent or even apologize. Forgiveness is about the feelings and attitudes of the wronged party, regardless of what the offender does.\n\nThat said, this person is not owed forgiveness in any case.", "I could understand why you might think this way, but it's kind of a terrible way to think.\n\nHe's not enabling his mom's behavior. He's a *teenager* \\- a literal child. He may have felt guilty that he \"let\" his mom steal the laptop, or simply ashamed and thus reticent to talk about it. People are making the *assumption* that he's trying to cover for his mom when that might not actually be the case. He didn't do anything untrustworthy here.\n\nBut even if he did...he's a kid! This kind of attitude will prevent children of substance abusers from getting help and keep them living in neglect without basic necessities. It's good to be careful with how money and expensive gifts are given, but cutting him off completely is going to not only deny him things he needs but also make him believe that he deserves to be punished because his mom is an addict.", "...I know it seems like it would work that way, but it doesn't necessarily. Being \"off drugs\" doesn't necessarily mean being in recovery, especially because there are many reasons she might be off the drugs that have nothing to do with *wanting* to be off (have to find a new source, ran out of money, have to take a drug test, etc.)\n\nAssuming she actually *is* off.", "\" So cousins mom, are you going to steal all these gifts that he got for drug money? Or was it just the expensive ones like electronics?", "If it gets worse \n\n“I have the receipt for that laptop you stole and sold, I will report it for theft if your behaviour doesn’t change”", "\" So cousins mom, are you going to steal all these gifts that he got for drug money? Or was it just the expensive ones like electronics", "He's a teenager. What would talking about it to him look like? \"Hey kid, are you OK if I harass and embarrass your mom in front of everybody repeatedly?\"\n\nJust don't do it at all. It's one of those things that's absolutely delicious to think about in passing, but it's only going to embarrass and hurt this kid. She deserves it, but he doesn't.", "NTA\n\nFamily does not mean that you excuse every bit of bullshit they ever do.", "Just don’t address it with them.  More important, ask your nephew if he wants your gifts to him to be kept at your house.\n\nWhy is it important to family that you give the thief presents?  Don’t they spend buckets of their money buying her stuff to pawn?", "She's lucky you didn't call the police!", "NTA. And F being quiet about it. I'm almost 100% sure my brother and his partner sold the switch and games I brought for my nephew for his birthday last year for drugs (or rent cause they were buying drugs) and I'm expected to pretend it didn't happen. You should be able to confront her and ask for an apology, if she denies it, makes excuses or says it wasn't her fault then you can declare to everyone that she hasn't changed and is more concerned with unearned family peace. They only way you're all going to be ok is if she actually takes responsibility for her actions, until then I wouldn't cave to what everyone else is saying.", "NTA if she's truly in recovery she'd be trying to make things right with you.", "You can hang out. Her new nickname is Thief.", "You would only do a “Ninth Step” if your recovery was part of a 12-Step program. Not all recovery, although unfortunately most, is based on the Twelve Steps.", "Actually forgiveness is good. You let go of the offense and don’t feed the anger monster. \n\nA relationship on the other hand, requires the mother to acknowledge what happened and try to make it right. Since the mother hasn’t even apologized OP doesn’t have to have a relationship. Otherwise it’s enabling. Which is what a lot of the family members are doing. \n\nThey are two different things.", "I'm not familiar with it,  what's bad about it? I seem to recall religious aspects but I may be mixing things up.", "another type is SMART recovery, less God focused", "The religious aspects is a big portion, as is the fact that's its not scientifically or evidence based. Iirc, it's as effective as just any random person trying to quit.", "Slight disagreement, there's acceptance and forgiveness.  The former is letting go of anger, the latter is something towards the offender.  If the offender has no remorse then I see no usefulness to the latter and in fact might be detrimental.  OP can accept this is who his relative is currently.  Forgiving her when she'd likely do it again tomorrow is not beneficial. \n\nLike if a woman is getting beaten up by her boyfriend, is it useful to forgive him between beatings?", "NTA", "NTA and being clean less than a year is nice, but start lowering your guard around the three to five year clean mark.", "NTA\n\nAnd I'd maintain my grudge against the thief until all (or at least the laptop, value at the time) stolen items were paid for.", ">Now she's trying to assume the role of caretaker, to what effect, I'm not totally sure.\n\nBecause she can exploit a child more effectively when everyone is concerned about how he'll fare in her care.", "Therapy, Alan Carr, [psilocybin](https://youtu.be/TIVIfQaqVG4), …", "The religious aspects are enormous. And ridiculous. It’s very odd that AA got alcoholism recognized as a disease instead of as a failure of Will, but it’s the only disease that is cured by a better relationship with God. (people will tell you that your higher power does not have to be God. They ignore things like that Kitty Dukakis, a Jewish woman was told that she would have to kneel in prayer, which of Jews do not do, in order to truly communicate with her higher power.)\n\nThe truth is that AA was only sort of meant to end alcoholism. And in fact, some of its earliest founders were never able to maintain sobriety. In fact, what limited real scientific studies have been done on 12 step programs show that for many people they increase the depth of bouts where you return to drinking. AA is actually an outgrowth of a fundamentalist evangelical Christian society called The Oxford Group.\n\nIt’s a slog, but [The Orange Papers](https://web.archive.org/web/20161024190705/https://www.orange-papers.org/) (Internet Archive) has a ton of information.  \n\nKen Ragge’s [More Revealed](https://web.archive.org/web/20150214232356/http://www.morerevealed.com/) is a one-stop shop of this history and problems with AA.", "You misunderstand forgiveness. Forgiveness is not enabling, and it’s OK to walk away from someone that abuses. It’s OK to confront the other person \n\nForgiveness is simply not demanding to hear “l’m sorry” and waking away. You don’t seek harm to the other. You don’t retaliate. You let go. \n\nForgiveness means you detach from the situation and don’t allow it to dictate to you how you behave. It is the ultimate freedom from the situation.  \n\nRelationship requires much more than that.", "unfortunately we can’t promote the use of psilocybin in a treatment center", "Admittedly I'm biased as an agnostic, non-Christian AA-er but in 2020 a Cochran Review was published on the effectiveness of AA and other 12 step programs and 12 step groups are an evidence based practice :)", "It seems like we're talking about the same thing then but attributing it to different semantics.  For me acceptance is what you're describing, forgiveness is something more.  Not hearing \"I am sorry\", but believing the person is sorry through their actions and feeling that I can accept the sentiment and believe they have improved past the person that did the injury.", "That depends where you are.", "No, not even that. The person can be totally convinced they did nothing wrong. And I can still detach from that and not let it control me. I can still not retaliate.", "the one that i work at", "I am not sure where you got retaliation from my description, that wasn't part of what I was describing.  I am not proposing some sort of revenge until they seek forgiveness. \n\nFor OP the acceptance would be, my cousin is an addict and a thief; I accept that is the case.  I am not going to entertain the thought that she is somehow not those things and I am not going to act in ways that make it easy for her to steal.\n\nThat's how you can be around a person (or know not to be around them) and not be taken in to toxicity they are generating.  You see what the situation is, when it plays out the way you understand and you have acted appropriately there's no offense to take.", "NTA, even if she's not doing a 12-step program, if she actually viewed you as family making amends to you would be important. Making amends to her son would be important. You should hold a grudge that your whole family is telling you, someone who was wrong, that you should just eat that and allow yourself to be mistreated by this person again.\n\nHonestly I think you should make a real blow up about this. She shouldn't be at the family Christmas because she's not active like family. She stole from her freaking kid, unless she's going to make things right, she shouldn't be at a family event.", "Good for her(being off drugs), but if she is, then she should be paying you back for what she stole.\n\nOP=NTA, She's lucky that you didn't file police report.", "The boy is family, why are they so keen on moving on in a way that is to his detriment and still puts him in a position of being victimized? If family is so important, why are they not moving to protect a vulnerable member of the family", "Right but where things like the 12-step program got the idea of amends from was looking at how people make right the wrongs they do. Even if she's not in a program, if she's a family member who actually wants to repair her relationships with family members that she has wronged, she would be making amends to the Sun and apologizing and making things right with other people she has injured.", "If she still presenting herself as a victim, she more than likely hasn't. He shouldn't have to take that, but you absolutely don't", "Indeed, like are you willing to really step in to help this kid? Cuz it doesn't sound like you can have peace with your family when they are prioritizing her wants over the safety of this kid. There is no peace when you let an aggressor into the space and let them do whatever they want", "Exactly, she needs to apologize, and give a replacement for what she stole", "Most 12-step programs preach abstinence (although it's not inherent). But, at least for ophiods  (I have no idea what his cousin is using), non-medicated treatment has a <5% success rate  (of still being clean) after 2 years. Whereas if you use stuff like buprenorphine or methadone it's around 85%.\n\nBut if you are using those, then most NA programs will treat you as if you are still at step 1 and will encourage you to stop taking the drugs that are largely preventing you from relapsing.\n\nThis is a very good article on this: https://projects.huffingtonpost.com/dying-to-be-free-heroin-treatment", "This exactly, like this feels like a point where you should be getting your family members involved and talking about how wrong it is that after abandoning her kid for others to take care of, she's trying to take back the rule of caretaker, and does that benefit the kid? No of course it doesn't, she's still not even stable, she's not even admitting that she did anything wrong.\n\nIt really sounds like you need to actually have a larger rowe with the rest of your family, cuz they're all just trying to bury this issue and move on, which is to the detriment of the young individual she has directly victimized with all of her actions. He needs to be protected cuz he's family and he's vulnerable! How are they okay with this and not pushing back that the kid deserves a stable environment?", "Oh lovely....I hope that aspect isn't present in Europe's AA. While thankfully I've no experience with the AA here I haven't heard such stories here.", "Thanks for the information,  always nice to learn more.  Quite odd how they ignore an actual treatment.", "I think it's definitely a thing to talk about him after it happens though. Like if she really has a blow on tries to drag him out of there, presenting to the kid that he could stay with you for the night would be nice."]}