{"id": 1615, "submission_id": "ynra7t", "title": "WIBTA if I refuse to cook the roast more than medium rare?", "selftext": "Thanksgiving is right around the corner and my wife and I (27F, 29M) are making plans to host our family. I'm doing the bulk of the cooking, including a rib roast. I'm excited, since it's one of my favorite dishes and I much prefer it to turkey. We've been fortunate this year to be able to afford a good one.\n\nI plan on cooking it to a medium rare temperature since that's what I and most people in general prefer. And, objectively, it's juicier and more tender that way. My wife is annoyed by this and says I should make it medium well or well done, since her and her parents \"don't like it bloody\" (that's not blood but whatever). I told her that they can eat the end slices, which tend to be more cooked than the bulk of the roast. And if that's still too \"bloody\", they can nuke their piece after it's cut.\n\nI think this makes perfect sense. Obviously if I were making steaks, each one could be made to the preferred doneness of each person. But this is one (expensive) piece of meat, and I don't want to ruin all of it when the solution is clear: you can always cook a piece more. You can't uncook it.\n\nWIBTA? My wife says I am and that this is my way of imposing my \"pretentious preferences\" onto everyone at Thanksgiving.", "created_utc": 1667744769, "permalink": "/r/AmItheAsshole/comments/ynra7t/wibta_if_i_refuse_to_cook_the_roast_more_than/", "score": 8543, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My wife feels like I'm pretentious when it comes to beef, and this has been an issue on several other occasions. Maybe I should just suck it up and deal with the overdone meat for her sake\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO:  If this is an expensive cut of meat that only you will enjoy the way you plan to prepare it, why in the world are you wasting it on a day in which your guests will have to stand in line microwaving their plates one by one?", "Just cut the raw roast in half, and take one out sooner. My friend, learn to compromise and meet your partner halfway. Little shit like this has a tendency to build up into other stuff. There is a way in everyday life to have your cake and eat it too. Also yes. Ywbta. Choose a better hill to die on man.", "NAH, but a different solution is to also buy a turkey breast and have that as a choice. That's what I've done in the past when I made a fancy beef entree for Thanksgiving. Minimal effort, no griping at me over the meat, and I don't have to be sad seeing my special dish nuked in the microwave.", "My husband will cook it outside to rare for himself then bring inside, cut in half and finish it to medium rare in the oven for me.", "A slice of MR beef turns into MW/WD pretty quick in a hot cast iron pan. That's how a steakhouse does it on prime rib night. \n\nCooking the whole roast to that doneness would be a terrible waste.\n\nNTA", "NTA - but random suggestion, can't you just cut the roast in half and put one half in X minutes earlier, so one half is done medium and the other well done? Don't know if that would have an effect on the quality/way it roasts?", "NTA. Cooking individual pieces further to suit the preferred doneness of individuals seems like a fair compromise.\n\nMaybe she was annoyed that you suggested microwaving as the cooking method?", "EDITED: YWBTA if you BOTH don’t even TRY to find a compromise here. I worked in food service for 17 years, at a private club where I had to deal with entitlement daily. Most folks love medium rare beef, but some don’t so making two and cooking one longer was no problem whatsoever. You can accommodate them, you just don’t want to.", "Don’t waste good money on a nice prime rib if everyone is going to whine about it not being cooked to their exact standards. \n\nGet the turkey, cook it for everyone. Get yourself an exceptional rib eye steak. Everyone is happy and your wallet won’t suffer.", "Is 2022 why are we still debating if people deserve to eat the meat like they like it or not?? Cook the part they gonna eat for longer, you're not gonna eat it, they would enjoy it, everyone would be happy, dear lord why y'all like this??", "YWBTA but it’s easy to do as others have said, split the roast, or, what we prefer is to sear slices for the people who want it well done.", "How many people are you expecting to eat the end pieces? I'll never forget the barbq when my friend refused to 'overcook' any of the steaks. I'm repulsed by chewy red meat and a few of us pan cooked our steaks in the kitchen which ruined the flavor. It sucked. You're preferences will just ruin their meal. YTA for thinking that ruining others experiences is justified by your preference.", "NTA.\n\nMy advice is to keep a portion separated  and cook that part to your in-laws’ preferences. \n\nI have to do this with every beef product and seafood item that is cooked in my house. My mom prefers her food to damn-near look like jerky and sound like she eating Pringles as she chews it, in my opinion.", "You sound like an AH. Your post is very me, me, me. You don't even care about your wife's opinion.", "ESH would you rather ruin a nice piece of meat by microwaving it? what a waste of money just to be right. it doesn't make perfect sense at all. \n\njust cut it in half and take one out sooner.", "Being dismissive and acting pretentious over your personal preference being the only acceptable way to cook something makes you a bit of an asshole. Cook the roast however you like but make proper accommodations for your guests so they can enjoy their meal too. Otherwise, don't host!", "If you are hosting a dinner party, the polite thing to do is to ensure that all guests are happy and full after the meal.  If half the folks won’t like the medium rare, find a compromise. I don’t think YA because if the way you want to cook the meat, but a compromise would be nice.", "Wow, the focus on the meat is completely ignoring the principle of being a host. You are responsible for your guests' enjoyment. Standing in a line to microwave a lovely piece of meat, thereby ruining it is not enjoyable. Find another way. Cook a turkey or ham also.  Get two rib roasts.  Roast the more well done one ahead of time to medium.  Warm it in jus to medium well. Roast yet other one to medium rare.  Why are manners a thing of the past? YTA", "Info: How many people will be eating the roast? Will there be a way to have them take a vote on how it should be cooked?", "Cut a quarter of it before cooking and make that one medium well or well done. The rest the way everyone else wants", "Honestly this is an easy solution to me, When the meat is done slice off enough pieces for the family who likes it more well done and pop it back into the oven for 5-10 mins while the rest of the roast sits. It just makes the most sense to cook the whole roast to the lighter preferred doneness then individually cook slices for those who prefer it more well done. Although I wouldn’t be microwaving it, I’d be throwing it back in the over or on a cast iron for a quick cook for them. Win win….", "I often will get 2 smaller cuts of meat. One med and one rare/med rare.", "To cook it any more than medium rare is disrespectful to the cow", "You know what most people won’t argue about? Spiral cut ham.  Fix a ham and save yourself some aggravation.", "My stepdaughter taught me this restaurant trick: cook roast to rarest temp desired (in my family, rare) and remove roast to rest on cutting board. Pour off most of fat, leave the little bits in pan. Add about two cups of beef broth, bring to boil while scraping the bits from pan. Reduce to simmer. Carve roast and place cut pieces in pan, simmer until desired doneness (usually about two minutes.) Meat will be done enough for those that like it that way but will be juicy and not dried out. Serve the leftover broth as au jus. Everyone happy! So much easier than cutting roast in half. Try it!", "YTA. Your job as a host, especially for Thanksgiving, is to provide plenty of food enjoyable for all your guests. Even people who put ketchup on rubber steak or hot sauce on everything. Get an extra roast. Slice off extra and cook it longer. This isn't difficult unless you just want an excuse for it not to work. \n\nThanksgiving is about welcoming *everyone*, regardless or perhaps especially because of their differences. Sometimes that means the sulky 11 year old gets microwave nuggets or your ancient relative needs utensils to eat finger food because they think it is rude to use their hands. \n\nDon't be a Thanksgiving Scrooge. Let your heart grow 3 times bigger. Be the guy that everyone feels great about, because they know they will have something to eat. The house that people breath a sigh of relief, because they don't have to bring a sandwich bag of snacks for their picky eater family member.", "Everyone seeing this as a dispute over meat cooking and not a dispute over graciously hosting Thanksgiving are missing the point.\n\nEnjoy your perfectly cooked meat this year, OP. You won't get the chance to host Thanksgiving again. \n\nYTA.", "YTA. You're the host. Your literal job is to cater to your guests. \n\nSolution: cut it in half and cook each half separately. Duh. And stop being a food snob.", "YWBTA.  There is a compromise to fit everyone.  Cook part of it longer.  Asking someone to microwave their Thanksgiving meal is rude.", "Kinda the AH: not the ah for choosing to prepare a generous meal - but disregarding your wife and her family’s preferences with a flippant response is kinda cold. \nYou could have just said - I will prepare some more done portions for people who prefer it that way (then nuke, or rest some cuts in the oven after slicing while plating, etc.) would have made her felt included in the plan. \n\nSounds like you wanted to be a bit of a dick to her in your response.", "YTA for suggesting they nuke a good quality rib roast. What did the roast ever do you to deserve being treated that way? Despicable.", "NTA, cook them a separate roast, or get a pan sear ready for them.", "NTA\n\nA pretentious preference is expecting someone to ruin a beautiful cut of meat for everyone because you like it done well. \n\nYou've got it spot on. Let her and her family pop it in the microwave.", "Do it medium rare, then fry up the slices for the guests who want it burned… will only take a few extra minutes, max.", "YTA, you assume people “in general” like what you like and are claiming objectiveness over things that are subjective. Cook the fucker to medium well.", "\"Objectively better\" is irrelevant - what matters is the tastes of the specific people who will be eating the meal. \"Most people in general\" are not eating your thanksgiving dinner.\n\nINFO - You don't say how many family members are coming - are they all philistines who like their beef well done, or is it just your wife and parents-in-law, and your side of the family prefer rare? This makes a difference - is everyone apart from you wanting well-done beef, or are the well-done camp a minority?\n\nMicrowaving slices of roast beef sounds horrible - I'll bet it doesn't produce the same end result as leaving the joint in the oven for longer.", "NTA. You are correct, sir. The ones that prefer to be cooked more can cook further it to their liking. No sense in running it for everyone.", "Yes, YWBTA, and your wife is right. Compromise here is easy, but you seem unwilling to do so. You’re the host, make it work for everyone.", "Jesus Jumping H. Christ! Do you guys always make mountains out of molehills? A well prepared roast is medium rare directly in the middle. There will be plenty of medium and medium on the outside pieces. You sound like a snob who really doesn’t understand cooking. You make a big issue to snobbishly show knowledge and then make issues where there aren’t any. It’s likely because you cook only to rare in the middle and the whole damn roast is undercooked. Listen dude, cooking for others is a joy and a privilege. And every good cook/chef gets THEIR joy by pleasing others. Don’t cook for others if you are a selfish cook!", "NTA and I will personally be offended if you ruin that piece of meat by overcooing it. Also offended by the microwave comment. A good compromise consists of a fry pan. You're fine, OP.", "NtA!  \n\nIt's just sad to overcook meat! Your solution is the only solution that would make everyone happy. Her solution only accommodates her and her parents. And once you overcook it this year, you will always be expected to overcook it.", "YTA", "My brother in christ just cut the damn thing in half or quarters, and cook the portions accordingly to the guests preference. You dont shave your preferences through anyones throats, in this case, you are LITERALLY doing that. YWBTA", "I’m gonna go with YTA. Having guests have to microwave their food is really rude and inconsiderate.", "Cook the meat how you want, but you’re not being a good host. Could you throw a turkey in a slow cooker? I get it, people think it’s an abomination to cook meat to well done. But if you don’t provide something for the others, then YTA.", "YTA. You cook for the guests; the guests don’t eat for the cook. \n\nCut the roast in two, cook one longer. Magic.", "I agree with your wife...you're being an obnoxious host.  Perhaps consider sectioning off your serving of meat when it meets your desires and allowing the remainder to cook to the 'taste' of your guests.  As they are 'guests' after all...their consideration should take precedent over your own.", "YTA. Classic big shot attitude. Pathetic.", "ESH cause there is a compromise to suit all.  I just attended a dinner last night and this exact meat was served.  I’m a rare meat gal but I’ll eat anything served to me out of politeness.  This dinner was a birthday celebration prepared by a family friend who is a chef.  So we were all asked how we liked our meat in advance.  The majority was medium rare.  That’s how the chef prepared it.  Then when he cut into the meat, he took the other portion and sizzled it into the pan.  Not sure what he did as I wasn’t watching him but according to my medium well done husband, it was fantastic and the flavor was still there.  The chef ended up setting out the meat buffet style and we all picked our favorite type.\n\nI honestly think this is the way to go.  If you are hosting and preparing, then you should also serve to your guests liking.  Don’t make them microwave or do it themselves.  Read up on how to sizzle it correctly or honestly I can ask our chef friend how he did it and message you but this was a perfect dinner.  I was surprised how he accommodated everyone - and it was a huge group - and it was so seamless.", "NTA. Y W B T A if you ruined a beautiful piece of meat. Can I come to your place?", "NTA don't tell the cook how to do his job (unless its for allergy purposes) Meat is the ONE THING Im spoiled about cause I refuse to eat overcooked steak. Its dry, tough and chewy. If they don't wanna deal with the \"blood\" I'm guessin theres plenty else for them to eat on the table. If they have a problem then they can bring their own shit to stuff their gob with", "YWNBTA you've given them reasonable options to have it cooked to their preference while still keeping everyone else happy too.", "NTA, if they want a beautiful cut of meat ruined they can do it to their personal portions.", "Nta.  Your solution is fine.  Since when is medium rare pretentious?  I think it's the most common way.", "YWNBTA but you will be if they won't eat it and you make a fuss", "YTA\n\nThe roast is sooooo expensive blablabla and the non-gourmets can microvawe it and then being offensive by writing when one suggests turkey:\n\nI don't care for turkey but I get why it's popular for these things: big cheap hunk of meat that there isn't any temperature preferences for.\n\nSome as your wife and part of her family don't care for medium rare too.", "Having cooked any number of rib roasts, what you’re proposing is 100% fine, and the best way to proceed. I have never made a roast where the ends were not done enough to suit suit someone who doesn’t want it “bloody,” and cooking slices more is another good option. There’s no reason for you to ruin the entire roast for a few slices!\n\nDefinitely NTA.", "NTA. As someone who doesn't like super red/bloody meat, if I'm not cooking it I don't tell the person cooking how to make it. \n\nMost of the time I'm with family so usually, I'll pick an end piece (like from prime rib on Christmas). If I can't do that I'll cook it longer in microwave (I know, I know! But it would have to be super red/rare for me to do that).\n\nIf you're gonna cook it like that then be prepared for some people to want to nuk it. It's not an insult to your cooking. I personally have a phobia of food borne illnesses so I stay away from super undercooked or raw meats. \n\nI wouldn't say you would be the asshole if you refused to cook it more. It would be nice if you did but I wouldnt be mad if you didnt because at the end of the day, youre the cook\n \nwhen the person who isn't cooking wants to make suggestions on the food they need to be respectful otherwise they can make food themselves. So they shouldn't throw a fit or make a big deal about it.", "I am a medium-rare to rare type and meat snob. My partner is the medium to well done type, and if it's anything more than light pink, they won't touch it. I make the roasts and either leave the rest in for longer, or slap as many slices as needed into the pan to bring it to their preferred done-ness. It also gives you the option to add a nice crust to their slices if they like that. You can also just make two (split) parts of a roasts, a smaller one that will be done well when your regular roast is the way you prefer it. (With entrecotes etc. I usually just use one thinner and a thicker slice so both will be done (but differently) at the same time.)\n\nMaking the whole roast overdone would be as bad as refusing to let some slices/parts in for longer for those who prefer it. To each their own, and a good host accomodates when it's as simple as putting the meat on for a bit longer. I mean, I have eaten too many overdone meats as well, but if I don't cook I'm grateful for what is served.\n\nIf you don't approve of their eating habits, maybe save that sweet cut for a gettogether with people who prefer their roast like you and find another compromise. On the other hand maybe they'll try some medium rare roast (along with their well done slices) and find the taste for it if it's offered.\n\nTell your wife you're going to make the roast so that everyone can enjoy it, and that she can rest assured no blood will be hosted on her parents' plates. Find a way to make it happen, it's such a small thing, otherwise YWBTA.", "NTA, they can cook it more if they want it more well done. You don’t have to ruin a roast because some people don’t know decent food.", "Are you TA for cooking a meal in a way that the people eating  it don't like? You really have to ask?", "YWBTA here, not for having a preference for medium rare roast, but for forcing that preference on everyone else when there's an easy way to make everyone happy. Take your fucking slice out of the oven early, dude.", "YWBTA cooking a roast to medium rare is already overcooking it. Get a second cheaper cut that you can burn.", "NTA just make sure people who prefer shoe leather have some other option so they don't have to eat something they don't like.", "YWNBTA. No one overcooks a wonderful roast!", "I think while it would be an AH move to overcook it all to satisfy a few, it’s also kinda AH-ish to tell them to microwave it. There have been a few suggestions that people have made that I like. Cook it to medium rare and heat up a pan to make their pieces to their liking. Get a turkey breast and serve both. People will be happier all around.", "YTA. If you have guests whose preferences you know then you accommodate them. They are guests you invited. If that means splitting the roast so part is medium-well or well and part is is not then so be it. The only inconvenience here is cutting it before cooking and watching the time. You don't invite people whose preferences you know and then ignore those preferences, it's rude", "NTA\n\nYou said it perfectly...you can always cook a piece of meat more for those who don't enjoy it medium rare, but you cannot 'uncook' it for those who do.\n\nYour wife and her family can either nuke it or throw their portions back in the oven if they want it cooked beyond medium-rare (which is generally accepted as the 'perfect' temperature for this piece of meat, among others.)\n\nPersonally, I'd be **aghast** if anyone wanted me to cook a beautiful Rib Roast to anything other than medium rare. The best of the flavor and a ton of tenderness are completely lost once you go beyond medium rare. A true Tragedy in the kitchen.", "YTA. \n\n1st please just stop with the \"ruin it\" \"cook it properly\" nonsense. That is pretentious. People are allowed to have different preferences for food.  You don't have to insult your wife or her family in order to eat food the way you like it.\n\nYou are choosing to be rude.  Cook part of the roast longer.  It's not rocket science.  Cut a third off and put it in the oven earlier.\n\nYou get to choose between being a gracious host ir a pretentious AH.  Being gracious will cost you 2 minutes with a knife.", "NTA \n\nA rib roast is an expensive cut of meat and saying that eating it a certain way is pretentious in itself is a pretentious thing to say. Those who eat red meat past medium ruin the texture and taste of the protein.\n\nThey can nuke it as you said. \n\nThose of you who are suggesting cutting the roast in half aren't the sharpest tools in the shed, all that does is double the amount of overcooked meat and halving the rare meat.", "I recommend also cooking a small turkey breast so people have an alternative. NAH, for now.", "NTA. You don’t cook a prime rib over medium rare 😋", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThanksgiving is right around the corner and my wife and I (27F, 29M) are making plans to host our family. I'm doing the bulk of the cooking, including a rib roast. I'm excited, since it's one of my favorite dishes and I much prefer it to turkey. We've been fortunate this year to be able to afford a good one.\n\nI plan on cooking it to a medium rare temperature since that's what I and most people in general prefer. And, objectively, it's juicier and more tender that way. My wife is annoyed by this and says I should make it medium well or well done, since her and her parents \"don't like it bloody\" (that's not blood but whatever). I told her that they can eat the end slices, which tend to be more cooked than the bulk of the roast. And if that's still too \"bloody\", they can nuke their piece after it's cut.\n\nI think this makes perfect sense. Obviously if I were making steaks, each one could be made to the preferred doneness of each person. But this is one (expensive) piece of meat, and I don't want to ruin all of it when the solution is clear: you can always cook a piece more. You can't uncook it.\n\nWIBTA? My wife says I am and that this is my way of imposing my \"pretentious preferences\" onto everyone at Thanksgiving.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Cook it how you like, then cut off a portion and cook it longer for wife and fam. This seems like a non-issue.", "or sear the in law’s pieces in a cast iron pan after it is done.", "Is your wife aware you can slice it and throw it in a pan? Because that’s literally how prime rib is made when someone wants it cooked more.", "I had this exact problem when hosting for Xmas (guests who like very well done meat, most preferring medium). I'd tried for years with turkey without success. Last year, I got a large piece of brisket for slow roasting. It was great for me since it was easier to do than turkey and I prefer beef anyway. Great for guests (I did check with them all first, too) as it needs to be done well for pull apart tenderness so none of the red meat vs no red meat debate (which is why I would never have opted for a more prime cut where you want it rare). It worked really well for us and we are doing it again this year. NAH but I can't see you hosting again if this is your hill to die on.", "NTA, it's not your fault she doesn't have good taste", "NTA - I'd tell them to eat chicken lmao. Stop trying to ruin beef. There is also the other option of cutting them in half and cooking one longer.", "NTA. Who eats well done rib roast🤢. Buy a Turkey breast and cook that for anyone that doesn’t want roast.", "NTA. Cook it to a medium so it’s less “bloody” and if that’s still to rate for them then they can throw it on the stove for a few minutes after they get their pieces and it will be as leathery I mean we’ll done as they desire.", "So you won't even cut the roast in half and put one half in earlier so it will be more cooked? If you're not even willing to compromise as a host to make sure everyone enjoys their meal then YTA. The microwave is not a compromise. Tbh this whole thing just feels like a 'this is how it should be cooked' power trip and its not gonna go down well.", "Can you split the roast? Or cook it med rare, then grab your portions, then put it back in for a little? It’s not just an arbitrary preference, some people are genuinely disgusted by eating meat that’s pink, and if you’re doing the cooking for everyone you should be accommodating of that. If you won’t, just make a turkey so everyone can eat.", "Cook half of it well done, cook the other half medium well. Or get another type of meat and cook that to their liking (like a turkey or another type of red meat). I personally get it when people say they don’t like it “bloody”, I know it’s not blood but it sure tastes and looks like blood regardless. This isn’t a hill for you to die on. \n\nYou’re the host. You offered to host. Unfortunately that means catering to your guests. If this is an issue for you, you shouldn’t have hosted and should not host in the future.\n\nYTA\n\nEDIT:\nYour solution is to microwave it? Really? You keep saying you “don’t want to ruin the meat” but you’re okay with microwaving it? Anyone who knows anything about cooking meat will tell you that’s a no-go. Double YTA", "There’s already alot of solutions here and online and from your comments it sounds like you’re willing to accommodate them.  NTA and enjoy that roast.  I made one last year and it was worth every penny.  My parents wanted well done, so I quickly pan fried their portions in minutes.  Yorkshire pudding is easy to make too if you have the time for it.  Good luck!", "NTA. They can cook it more if it's not well-done enough, but you cannot uncook it for your medium-rare serving.", "YWBTA. Personal preference is important when it comes to cooking meat. While I agree with your medium rare preference because it is juicier and more tender, I also have a wife who prefers well done. I always cut a portion off and cook it longer for her. If the roles were reversed I’m sure you would appreciate if she cooked some to your liking. Forcing your preference on your guests is an AH move.", "NTA I think it’s better to cook int to medium rare anyways because when it’s sitting in the pan waiting to be served it’s still cooking. I’m a medium well type of gal but if it’s way too undercooked honestly I’ll just microwave it and call it a day", "NTA\n\nmy husband loves his steaks well done. my kids prefer medium rare. i can eat it either way though I started to grow liking medium rare more. when i make a big piece of meat like a rib roast i cook it to medium rare and then cook my husbands slice a bit more on a pan to his liking.\n\nit literally takes a few mins.", "NTA omg please don't overcook that beautiful piece of meat!! Your solution makes perfect sense and is a win-win.", "NTA. I do this all the time because I prefer more well done but most of my family likes it pinker. \n\nIt's easy to cook some of the meat a little longer if it's too rare, but it's impossible to un-cook it.", "Make a jus and bring some pieces up to temp in the broth", "Why not you get a different cut for those who might prefer a different level of doneness. Learn to compromise I say.", "You'd be a criminal if you did cook the roast more than medium rare. NTA", "Nta, the people like they're done this they like it that way. The best way to do this is to cook the whole roast the first time to medium rare do not cut it in half two small pieces will look like crap. Then take two portions for the inlaws and put them in a higher oven for about 10 minutes and they will be to the degree they like and everyone will be happy and the roast me delicious. Another way is to make extra as you cut their slices off and stick it in the as you to bring up the temp this is what we do in restaurants even high end restaurants. And please do not nuke it, microwave beef comes out very tough", "As someone who takes my meat very seriously as well, I get the dedication to making sure it's cooked to your standards, and yes it is almost sacrilegious to overcook an expensive piece of meat to *gasp* med or above. But these aren't just any guests, they're family. They don't need to conform to what most people think is the best way to eat red meat. Just keep the peace and respectfully cook their slices to doneness of their liking or, as others are saying, split the roast. I lean toward cooking individual slices to their liking but if they want the presentation of cutting a roast that's not actively bleeding just give it to them.", "Speaking as a chef, you are right, they can have the end pieces as they will be more cooked. Nothing worse than a well done rib roast when cooked all the way through and a total waste of money.", "All my 22 years of living I have never seen people eat roast medium rare its always been medium well or well done but YWBTA", "NTA \n\nIf they want well done, they can cook their pieces longer. Not sure why anyone would ever want a well done roast. 🤢", "My butcher taught me a trick since they cater and know some tricks. For those that want it more done set their slices in a warm pan of au ju until the red isn't noticeable. Keeps it from drying out.", "YTA\nIf you invite guests, you cook stuff that they want to eat. If they want it well done, then cut off part of the roast and make that well done", "NTA. Cook it to your preference.", "NTA", "NTA. Cooks preference. Please don’t make the roast medium to well done it’s an expensive cut of beef. I am with you OP! Enjoy! :)", "NTA. You are doing the cooking so you decide how it gets cooked. If your wife's family has an issue with it the microwave will solve the problem. Don't ruin a delightful roast by overcooking it!", "YWNBTA\n\n&#x200B;\n\nBut make TWO smaller roasts, and let her destroy hers the way she likes.", "All I can think of is king of the hill....\nBobby: but dad what if someone wants theirs well son\nBack: then we tell him politely but firmly to leave.....\n\nEdit a word", "NTA. You are correct that you cannot uncool meat, but you can heat it up and bring it to the desired temperature for the individual person. Cooking a roast to Med-well or well-done is tragic and ruins the possibility of leftovers as heating up a piece would taste like shoe leather.", "It's blood and disgusting.", "NTA. People who ask you to cook the meat wrong do not need to be listened to. Let them eat sides.", "ESH. Your wife for suggesting it's acceptable to cook a rib roast to medium well or well done. You for suggesting that the family members microwave their food. If the end pieces aren't cooked enough for them then just offer to sear them off in a hot skillet. This is really the only reasonable solution. I know you're going to be dealing with a million other things in the kitchen so perhaps your wife could help you out with the searing and you two could actually work as a team instead of whatever it is you're doing now.", "NTA, you gave them a solution and they’re pitching a fit over it.", "Eating well done prime rib should be a crime punishable by only eating at McD's for the rest of your life. Let the people who don't enjoy beef eat turkey.", "NTA. As someone who makes a prime rib every Christmas I can assure you that making it to medium well or well done is a crime. Do not turn an expensive cut of meat into shoe leather. Cutting it in half isn’t going to be helpful unless you have a double oven because of different lengths of time needed to contain the heat to get to the level of done you need. Your suggestions about the ends are perfect. They are usually more done so those are the ones my grandparents prefer. If this is still a problem then just make a small turkey breast for your in laws.", "NTA. You bought it. You're cooking it. You can choose not to overcook it. \n\nGive the whiners a searzall and they can make theirs well-done tableside.", "NTA as a compromise I know you have done a suggestion but call those guests find out how they have their meat and portion it out as others separate before cooking so one part is cooked for longer", "NTA. What she wants forces those who prefer it less done to eat it the way she wants. You can do one of 2 things. After it rests, slice the number of end pieces needed and then finish them in a pan while you slice and plate the rest of the meal (or put food on the table if everyone is serving themselves),  or get 2 smaller roasts and cook one longer so they finish about the same time. I wouldn't suggest microwaving because it can make the meat tough.", "For your family members who do not want to eat a properly cooked prime rib roast, purchase a second small rump roast and you can cook it as long as they want you to and they can eat it as well instead.", "I don't think your TA but you do kinda suck and so does your wife.  There are better ways to handle it but both of you are stubborn and don't want to compromise. \n\nLike someone else said,  you should get a second roast while there's still time, to burn for them. That way everyone wins.", "NTA I hate pink/rare beef but my family all love it rare. When we have roasts I eat the end pieces and they get the pink middle. Sounds like a good compromise to me!", "NTA Those roasts are expensive, you can't really cut them in half unless they are huge and have the meat turn out properly. And yes med rare is the only way to cook it (or rare). The end cuts are aalways at least med to well done and plenty for everyone, especially with a turkey also. Why ruin such a cut meat? He's right if it is too rare for someone just throw that piece back in the oven or micro. Why should they get their way over his? He bought it, he's cooking it, let him do it the right way.", "NTA but if I were invited,  I'd just refuse to go.  I can't eat any meat not very well done.  Don't know why.  The flavor and texture is disguising when there's any pink.  So while you have every right (and probably the approval of chefs everywhere) to cook this your way, ask yourself if this is a hill you'd want to die on. Its a small party and you're making something you know your guests won't like.  Really doesn't look good on you.", "NTA.  If you cook the center to medium rare, then the outer portions will be medium to medium well.  Done this for years without complaint…", "Your wife and her family are gross. What’s next, ketchup? NTA.", "Could you cut part of it off and start cooking that one first.\n(Also I fine it weird how some AITA are a matter of who speaks first/person who's doing something nice the way they want and are excited about it vs person who planes and wants it their way.\nIf she wanted that food and it was her favorite and she had the idea to make it but you wanted to cook it Y.W.B.T.A but like this I think NTA are you guys having another meat she/her family likes.\n\nMaybe she or her family should make the meat they eat for Thanksgiving and make that too.\n(Or this one might be considered a bit rude. But make a second cheaper one the way they want. It doesn't sound like it was their idea to have the roast/really want it. Having a bit for them would be nice but she sounds selfish/self centerd.)\n\nIt's rude to go into something someone likes and dictate it", "I almost was going to rule different then I saw medium well or well done. Absolutely and definitely NTA. That's a huge difference between medium rare and medium well or well done. The can definitely slice a piece off and put it into the oven or skillet to cook the steak up.", "Just heat a skillet or griddle and cook theirs more. This is what we have always done. 50% prefer medium rare 25% medium and 25% well. We feed 25-30 people.\n\nNAH yet.\n\nWe typically just have the platter next to the griddle or stove and everyone does whatever. Unless it's a smaller get together where I'll cook to temp for everyone.", "NTA. Your solution is exactly what we do for the well done people in our family, and it works every year. But instead of microwaving them, put them under the broiler for a couple minutes. That will leech the color out and still leave a bit of juice in those pieces.", "NTA.  The only people who ATAs are people who cook a rib roast past mid-rare.", "NTA.\n\nThere is no chef, restaurant, home cook, or home ec teacher anywhere who would prepare the roast as your wife suggests.  \n\nYour intuition is correct to prepare the roast medium rare, then cut a few slices and cook them further separately.  \n\nThe only change I would suggest is to use the regular oven, not the microwave.", "NTA. Cooking a rib roast takes WORK. If they want to eat theirs as leather, that’s fine. To your point, they can always cook it more. Doesn’t mean you have to suffer the indignity of destroying a prime cut", "Have them cook their slice on the stove when they get their piece. That's what my family does and it works pretty decently", "They can put their slices in the microwave. I mean, I'm assuming someone that likes well done meat won't mind nuked meat.", "Contrary to what appears to be popular opinion, you are 100% NTA. Cooking an expensive piece of meat to ruin is a real waste of money. That said, your wife was way out of line to think it pretentious of you to cook the roast to the temperature preferred by most diners.\n\nThat said, yes, either split the roast before cooking or once it has rested, put the portion that some would prefer overdone under the broiler.\n\nSounds like you live in the Midwest where this attitude lives on.", "NTA. NAH if she didn't call you pretentious. But since she decided to insult you. She's TA", "Dry end pieces are not the same as ‘well done’.  Do you not know how to choose and roast a joint to a juicy, tender ‘well done’?", "Cut the roast and make two preferences. Your marriage is more important than this stupid crap.", "NTA.  I guess it was kind of dumb for you to tell your wife what the temperature of the roast was going to be beforehand.  Why ask for drama?  You are cooking and you prefer your beef MR.  End of discussion.", "NTA. My family faces this dilemma and everyone is happy with the solution of flash-frying individual slices to each person’s preferred degree of doneness. It doesn’t even take extra time since you can do that while the remainder of the roast is resting (assuming someone else can handle the mashed potatoes/gravy/whatever else might need doing during the usual resting time).", "NTA, you’re not pretentious. Your in laws are rubes. But also, take everyone’s advice and compromise.", "NTA. If someone prefers theirs over medium rare, you as them politely, but firmly, to leave.", "NTA. It’s a way of ensuring everyone has it cooked the way they like. BTW well done rib roast is yuck", "NTA for refusing to cook it medium rare, but YTA for not accepting a compromise. Take it out at medium rare, let it rest, See you there! It in half, and burn the rest for them. Simple.", "NTA.  I agree your solution is a good one.  You can pop their slices back in the oven for a few minutes to cook them more, but you can’t uncook the roast if it is too well done for most people’s preference.  My mom liked her steaks medium, but every roast she made was very well done-dry, tough and tasted terrible.  Medium/medium rare roast was a revelation.  Just do be sure you are cooking the roast to suite all of your guests, not just yourself.", "OP says they are hosting “our family” - I would take that mean his family as well as hers, not just hers. It’s only hers that have an issue with the meat not being well done. I’m guessing his family will enjoy it medium rare given he’s not mentioned them.", "We cater to vegans, vegetarian, fruitatarians, raw food people, allergies real or not, and everything else, so why is there so much hate on people who like their meat well done. It's their choice. \n\nThe stuff I have eaten would make an average person squimish and I have had people almost upchuck at the table because of what I like, and I have eaten steak tartare, but when you start heating meat, it better have no blood in it and be almost fully dead and cooked. I like my meat well done. Medium well meat is too cold for me and reminds me of en bloc resections still moving on my table 30 min after they get cut away from the human body. I can't do it", "Likely will only be 2-3 people. I've seen them do this at other dinners so I thought it would be ok", "Put one in later so they are ready at the same time....but excellent answer.", "This is what I was thinking too. If one side of the family will have more people then make that side of the roast a little bigger. Or get 2 roasts. I’ve never seen anyone get mad because they had too much food", "Thank you that's exactly what I was thinking. Also side note you can take advantage of the juices released from the first roast to make both better.", "Agreed. My husband always prefers his meat to be so well done it’s practically a hockey puck, so I just cook his burger/steak/whatever for longer. If it’s something we’re splitting (due to rising prices we just split nice steaks now and supplement our protein with lentils or extra veggies), I’ll let the meat rest for a min before cutting it and putting his piece back on the pan for additional cooking time. It’s such an odd point of contention. People are allowed to like what they like.", "You are correct except you don’t take one Out sooner, you put one In later. That way they are done at the same time and nobody gets cold food.", "100% this\n\nPeople are not wrong for having different preferences.", "This is what we do at my IL house as well.", "That's an idea, I think I'm leaning more towards having a pan ready to cook pieces more for those who want it. Ought to be better than the microwave", "Exactly what I was thinking", "Depending on the size of thr rib roast this may not be possible.", "What's the benefit of this over just cooking it all medium rare and doing a quick sear on some slices to make it well done? Seems like the medium rare one would get cold waiting for the well done one to finish, whereas blasting individual servings in a cast iron would finish in like a minute.", "This! Omg so much this.", "THIS RIGHT HERE. I was undecided because I figured it would depend on how many people would've preferred the roast less done vs. more done.  But this is the perfect compromise. THANK YOU for the great suggestion!", "Yeah the o lying thing this will result in is OP getting upset the IL didnt eat the roast", "NTA - OP sometimes you have to compromise and I feel your pain! Until my grandmother died, all family events hosted at her house, all meat had to be cooked to the shoe leather stage to prevent jaundice and worms. Her turkey was only cooked when the skeleton started to dissolve and roasts had to register 250 C!  As she aged, and unwillingly gave up her spatula, we compromised by always cutting a corner of beef off for her and incinerating  it. Sadly, we never did figure out a way with turkey.", "This is the way", "I’m glad this is the top comment- why can’t people just be good to each other?", "This. YTA for refusing to compromise.", "This is absolutely the solution. My uncle doesn’t like turkey. And while he will eat it without complaining as a guest, my mom always makes sure to have a small roast or ham for him at Thanksgiving and Christmas. Because we love him and he’s our guest.", "That might be the solution honestly. I don't care for turkey but I get why it's popular for these things: big cheap hunk of meat that there isn't any temperature preferences for", "That is a great idea as well.", "I love this idea. Better than committing the atrocity of an overcooked roast.", "Right - so the parents like theirs done a certain way and everyone who likes it appropriately cooked but not overdone is forced to eat it their way? It's not respectful to all the other party goers. \n\nYes, accommodate them and maybe cook a section longer than the rest. But NTA for not wanting to waste food and cook it properly\n\nDo they go to a buffet and ask them to microwave the prime rib too? Ffs", "Absolutely this, pan there’s a bit more after.", "The problem is that you're now doubling the amount of overdone outside meat and reducing the amount of nice  medium-rare inside meat.", "[removed]", "Problem is cooking it in the oven separately will take a lot longer than the microwave solution and delay the meal for the majority of guests. Also adds another thing on my plate when I'm already doing several other dishes", "I have a problem with texture. I just \\*cannot\\* eat rare meat. Not even medium rare. Medium, it will depend on if it's on the rare side of medium or the well side of medium. It's not 'ruining' the meat if you can't eat it the other way.", "Microwaving meat is offensive.  You're offensive.", "Her and her parents mainly. As far as I know they're the only ones who will have an issue", "Makes me think of the turkey in Christmas Vacation lol", "I could totally have dinner with your mom", "What would you consider proper accommodations for this, aside from what I've said about the microwave/end pieces?", "OP gave a perfectly good compromise - no problems using a microwave if something isn't as warm or done as a person prefers.  This way they all get their preferred way and that's why, in this case, it actually IS the only acceptable way to cook it since it allows for everyone to have it done to their preference. How is that not acommodating?", "I think everyone being able to get what they want is the most \"gracious\" solution here. They can have their piece more done, without applying their preferences for everyone", "I would cut the part that is going to be well done into smaller pieces so that it will take closer to the same amount of time to cook.", "I just can’t wrap my head around not being considerate of my guests. I wouldn’t serve my vegan or vegetarian friends things they couldn’t eat. Or my friends with weird food quirks. When I went to my bfs family Christmas last year they also made a roast and asked how I liked it cooked and I said medium, they all prefer rare, but cooked it longer for me and made sure it was done enough or they would have cut some slices off and pan seared them. I can’t imagine going to someone’s house and having to cook my food in the microwave in order to be able to eat it. It’s incredibly rude.", "NTA, they’re the chef. The guests do not need to attend the party. \n\nStop catering to the lowest common denominator.", "Not when the guests preferences are wrong!! \nTwo picky eaters shouldn’t ruin the experience for the rest of the party.\nCooking beef to medium rare does not make him a food snob lol.  Someone suggested buying a turkey breast as well.  I think that’s the best solution.", "\"Cook part of it longer\" is literally what he's proposing. Cook it to medium-rare in the middle, and then if the more-done outside pieces aren't done enough, cook them more. This is the only way.", "The microwave is cooking their part longer?", "Agree with this except do not microwave. Better to rest some cuts in the oven while plating. The suggestion to roast in two pieces is also good.", "Hey I agree but if they prefer it terrible it's their business. just don't make me ruin the whole thing", "Well done is garbage.", "But it's OK to ruin the whole piece by overcooking it in the oven?... to us who like it properly cooked, it's ruined.", "Medium rare beef is juicier, more tender and more flavorful than beef cooked past that. That is a fact, not an opinion.", "Calling people Philistines is a pejorative best left to pompous and potentially racist people.", "Going to be around 10 people. As far as I know her and her parents are the only ones who will have an issue.", "Microwaving on the lower or lowest wattage would not ruin anything.", "The frying pan might be a bit better, I'll look into that", "THe wife's family doesn't want the meat overcooked. They want it cooked to the doneness that they like. There is no one right color for the inside of a cooked roast.", "Telling your guests they enjoy meat wrong is kind of pretentious.", "Forcing your preferences on your guests is pretentious. And leaves a bad taste in their mind and heart", "interesting idea", "Incorrect.", "Not in beef a nice medium to medium well steak is so good", "They did it because they had no choice other than going hungry.", "Ok, so you are making a meal for 5 people? You want it medium rare. At least 2-3 want it well done and we don't know what your wife prefers.\n\nCook the damn meat to and take the center piece for yourself. Or pick nl something else. \n\nYou are cooking for your guests, not for Cooks Illustrated.", "INFO: Are you the only one attending this dinner that likes it MR? If not what’s the split between guest’s preferences?", "That’s very clever. As one who prefers her meat medium well, I’d worry there wouldn’t be enough end pieces if 3 of them like it cooked a bit extra.", "Since he emphasized they were luckily able to afford a good piece this year, I assume it would be an expense they can’t easily afford. So splitting really is the more feasible option it seems.", "You can divide the roast, or just foil one side for part of the cook to shield it. Use two temp probes, and when the uncovered side is about 15 degrees warmer than the covered side, remove the foil. When you hit 120 on the mid-rare portion, you should be at about 130 on the other. Kill the heat, prop the oven open and let it coast the rest of the way up. \n\nRestaurants will cook a standing rib roast to different temps and serve people based on what they like. Check YouTube for some techniques, and I’m sure you’ll find something you can use. It doesn’t have to be an all or nothing thing. \n\nAnd don’t forget, the food is for their enjoyment, not our pride.", "This is what I do as my inlaws prefer it dry as dust.", "Dude it’s not rocket science. You’re literally making your life harder for no reason. Split it in advance.", "Microwaving it would be blasphemy, there has to be another way. Pan all the way.", "Why? The only reason to do that, rather than simply cut the roast in half, would be that you feel the need to reinforce that your way is *right* and their way is *wrong.* This is an arbitrary and entirely subjective OPINION which you're treating as fact, and you're being a self-righteous jerk for no reason other than believing your subjective preferences are *objectively better.* \n\nCut the roast in half, apologize to your wife for being a smug idiot, and from here on out, stop acting like your *opinions* are objectively-correct facts - or I predict you're gonna find yourself uninvited from an increasing number of social events as people in your life (NOT just your in-laws) grow tired of dealing with this kind of arrogant nonsense.", "Hey OP \n\nI used to work in a 5 star prime rib and martini joint.\n\nChef would never cook the roast past MD rare because you can always cook a cut more, but you _can't uncook it._\n\nSo what they do in the restaurants is slice off a portion for the one who wants it weller, then cook that piece separately in the oven, or in a pan w butter for Chicago style. \n\nIdk. Hope its helpful", "You could also use the drippings and make au jus and have it simmer on the stove and put pieces in it for those who like their meat cooked wrong.", "Gonna make guests ask you to do more work for their preference?\n\nMy insides can't handle much red at all and I'd be much too shy to ask someone to fix my serving. \n\nThis seems like a 3rd best option to me personally.\n\nEdit, not saying to cook it more, just in terms of making people happy; 2 roasts, split roast, then this one", "So then your meal is going cold while you cook.", "Your one of those people who really looking for a good solution to your problem! NTA for actually considering what others are suggesting as a solution!", "Just cut the roast in half.", "I would recommend this. Shouldn’t take long to finish it off for the others. Please don’t cook the roast past med-rare! My in-laws are like this and i grew up eating rare to medium rare. Don’t force your preferences on family, but i understand your predicament. Just keep in mind if you split the roast it will take less time. Use a probe and pull out your roast at 130 F. Maybe the other roast at 140 F??", "This is what my Dad does. He takes the roast out at medium rare and then pan sears a number of slices - but splitting it would take up less space /time in the kitchen.\n\nBut either your wife is overly sensitive or you project a “my foodie preferences are better than your happiness” vibe.\n\nedit for punctuation.", "Yeah or serve them outside pieces of the rib.", "Or also, have the sauce ready very hot and the slices very thin.", "This was actually my first thought when ready the post. Throw some butter in a skillet heat it up to get a good sear and can get the roast to medium well to well done.", "That’s how it should be! Op is obviously not that kind and considerate to other people as your mom is.", "I love medium rare turkey /s", "Now you're dissing turkey. Get over yourself dude. Stop giving her family reasons to not want to be around you.", "This, or mark one side and offset the roast and keep that side centered, instead of evenly cooking it. You can definitely get 140F on one side and 160-170F on the other.", "But if you cut it in half and cook to medium rare, there would be 4 more well done end pieces.  That would be enough for wife and her parents with an extra slice if somebody wanted seconds.  Then the rest would be medium rare.  It seems like then everyone would get what they want with no waste.", "Yes, but that's the essence of compromise: everyone is a bit unhappy with the result but doesn't feel like the other party got preferential treatment.", "Split it something like 1/3 and 2/3 then so it comes out closer to 1/2 and 1/2 after cooking", "Good point.", "Microwaving beef makes it rubbery and disgusting. Look, I like my beef still mooing but the microwave is not a viable solution. Why can't you give their pieces a quick sear in a cast iron skillet? And yeah, it does add something else to your plate but that's kind of the job of the host, no? I'm the cook in my family, I have hosted many holidays, and I always make sure my guests have something to eat that they will like.", "Cut a portion for 3 people off.  Start it cooking earlier, then add the bigger portion, finish and rest them at the same time.  That ways it's all served together.\n\nIf the medium part are not full done, just fry them off while the main portion is resting.\n\nJob done, everyone eats together.", "I'm sorry I dont understand.\n\nIf you just put one half in earlier, why would that delay things?\n\nOverall YTA btw. Why host if you're such a snob about how other people want to eat?", "Cut the roast in half. Put one half in the pan, stick it in the oven. When it's part way done, pull it out of the oven, put the other half into the pan, then put it back in the oven. Take it out when the 2nd half is done to your liking, and the first half will be done to your wife's liking. Everyone is happy and eats at the same time and you've added all of 5 minutes to your prep time.", "You know these people and their preferences but decided to make something you k ew they wouldn’t like. That’s fine but don’t act like this is some huge burden when you created the situation for yourself. YTA for that.", "I encourage you to microwave your meat. Enjoy that rubber that you'd lile your guests to enjoy", "In that case put the meat at the very end, if they want it well done they will have to wait 🤷🏻‍♀️ I doubt you have 8448922 ovens to have all the food ready at the same time, so then it would be on them the decision on how they get their food, is noone helping you cook??", "Thank you for explaining this! I've rarely had anyone say anything useful to explain their preference for meat cooked past medium.\n\nYou really surprised me, especially because I would say that the reason I don't like meat that's past medium is also texture. I enjoy the texture of medium rare meat but not more thoroughly cooked meat.\n\nStill you brought me amusement and clarity and that's a rare gift! Thanks!", "I totally agree, it the texture.", "So you're choosing to disrespect ONLY your wife and her parents on Thanksgiving to fulfill your desire not to disrespect the meat. Good luck with that.", "I love the end pieces, make sure there is enough end pieces.", "Yeah, but if it's going to be a family meal, it should be nice for the whole family. Just like you wouldn't cook certain allergens when one in the party is allergic.\n\nI think people need to be grateful for what they get, but if you insist on not accommodating preferences in what is a rare gettogether, then maybe don't host that particular occasion.", "Yeah, that actually happened for a Thanksgiving dinner of ours. \n\nI was pissed off because I bought the daggone turkey and was supposed to cook it. I couldn’t because I was in an ER, being treated for fractured toes and foot. She grew inpatient and cooked it.", "😆😆😆", "A few people have suggested cutting the roast in half, and starting one half sooner so everyone's preferences are accommodated.", "Microwaving ruins pretty much everything except soup", "You're going to find that requiring your spouse's family to microwave their meat is going to result in them not coming to your house to eat in the future. But, if this is the hill you want to die on, go for it. You can eat your perfectly cooked meat on the hill alone next year.", "Is there room on the table for a broth bath ? \nWith tea light or burner under, they can slip their slices in to their preference. Or if you pre slice in the kitchen you could ask how many slices to pan sear a bit before tabling.", "And BTW, the message you're sending is that her family isn't important to you. Ultimately, you're planting a seed that will grow into a marriage issue. People have divorced over less disrespect. \n\nIf your spouse had written this post, and said you refuse to cook a meal to accommodate your family, the comments would be, marinara flags, toxic masculinity, and it's time to leave this relationship, etc. \n\nYou can disrespect the meat or your can disrespect your spouse and their family. Your choice.", "Making your guests microwave their meat is awful. There’s an easy solution here that hundreds of comments have suggested and it’s not clear why you’re so resistant to it other than plain obstinance.", "That's another good idea.", "It's not a party, buddy. It's a family Thanksgiving dinner. They are different things and the lowest common denominator would be a person who rejects the feelings of their spouse and spouse's family.", "His wife is hosting as well. Shouldn’t she be able to enjoy dinner as well? By splitting the roast he can make everyone happy so why not do it?", "Nuking in a microwave is not the way to do it though", "He is proposing that they cook it in the microwave. He could easily cook part longer in the oven or sear it in a pan.", "It would go a long way to simply bust out a cast iron skillet to bring everyone’s meat up to temp. A cast iron griddle would work perfectly as it accommodates several pieces at a time. \n\nThe short term practical side of this is that you can rest the meat properly and not have to stress over timing everything perfectly. Simply slice and sear when you’re ready to sit. \n\nThe long term practical side is that you have accommodated everyone’s preferences with *respect*. If they’re anted microwave dinners they could stay home and eat a swansons. Why you didn’t offer to do this in a pan or even make something *everyone* likes and instead offered to microwave something so you could have it your way is probably why your wife is mad. And I don’t blame her.\n\nYou could all go out to eat too. Then everyone gets what they want and you don’t damage your relationship with your in laws and wife OVER A PIECE OF MEAT.", "Microwaved meat is gross.  You’re asking them to spoil their meat completely to save you the trouble of cooking it in the oven a little longer.  Just cut the meat down the middle before you put it in the oven, take your medium rare section out sooner and let it rest until the other half is done to their taste.", "Yeah I like mine done the way that you do. No sense in ruining the whole roast. Since you're doing most of the meal, can't your wife sear the pieces for her and her parents in a cast iron skillet? The way you talk it sounds like you are having other guests who will enjoy it more rare. No sense in ruining the whole thing for three people. Assuming your wife is living with you, she is the hostess. I don't understand why she couldn't be involved, since it's only her and her parents who like overcooked meat.", "So 30% of the people there.", "Microwaving it long enough to cook the beef instead of just heating it up definitely is not as good. Why not at least throw the three servings into a pan? Sliced beef cooks extremely fast in a pan.", "Yeah I've done that for different preferences and it works quite well; it's quick too!", "https://www.amazon.com/Lodge-Reversible-Griddle-Combo-Double-Sided/dp/B002CMLTXG/ref=asc_df_B002CMLTXG/?tag=hyprod-20&linkCode=df0&hvadid=167141575819&hvpos=&hvnetw=g&hvrand=11720013294563606026&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9029600&hvtargid=pla-138243274155&psc=1\n\nBonus of this is you can get it up to temp on your BBQ so it’s not taking up oven space.\n\nIt also saves you from being forever know as that guy who couldn’t get off his high horse over a piece of meat.\n\nHonestly, if you’re this insufferable over one dinner I can’t imagine what other things you dig your heels in over.", "Yes the bloody well is. Jesus Christ it’s not a preference it’s science.", "Not forcing anything? If they like ruined meat it won't matter how it got that way", "Still disgusting.", "Your opinion. It's disgusting.", "10 people, so a majority prefer it medium rare", "He literally, in the comment you're replying to, said it will be 2-3 people....", "OP can get a cheap one for the folks who want it well done.", "Exactly.   If you cut it when it's medium rare, you'll dry it out since the juices will run out.", "OP plz don't do this. Splitting it is actually harder. They won't cook the same as they would if you simply cooked it whole. Maillard reaction and browning  will be different, & cook times will be drastically different and you run the risk of overcooking or undercooking everything, or it being properly cooked by temp, but without a long enough cook time you won't get the same connective tissue breakdown converting into collagen and it could end up chewy and tough. Just cut the end pieces off when you're done and sear them quickly in a pan for them. So many people here clearly don't cook or know what it costs for a prime rib roast. It's several hundred dollars and hours of work you risk tossing out the window because a couple people want to eat shoe leather.\nNTA", "Ikr just because I prefer my meat slightly more cooked it doesn't mean I like the steak made in the microwave.", "This is exactly what a chef did at a highly rated restaurant where I was a server for people who wanted well done Prime Rib. His method was to keep a pan of Au Jus simmering next to where he cut the prime rib. If anyone wanted well done, their piece got simmered for a few minutes in the au jus. It was standard operating procedure and I never received a complaint.", "Making a roast medium or well done would be inconsiderate to anyone with taste", "Saying you don't like something is not a diss. It is a fact that turkey breast is cheap in comparison and is only cooked to one temp level for all", "Get over what? \"I don't care for turkey\" is about as innocuous a \"diss\" as it could be, lol", "Or they could follow OP's suggestion and cook their pieces more if they want. Everyone who's mature is happy. OP is NTA.", "No, the compromise here is turkey. Clearly, this family cannot have nice things.", "Do you think people who want their beef well done care that it’s rubbery and disgusting? Haha", ":) Yeah, rare and medium rare meat kinda squeaks between my teeth. I can't eat sushi either, darnit. The only sushi or other uncooked meats I have been able to eat and enjoy have been a type of sushi that was ground up (Morimoto's restaurant) and I can eat carpaccio since it's very thin and there is no 'squeaky' or other obvious texture issues. \n\nAnd it's tough, I know, to get beef that is cooked enough but not overcooked for me. I use a method from Alton Brown for t-bones that works wonderfully!\n\nLet's not even talk about how long it took for me to cook pork correctly and be able to eat it, having grown up in the country at a time when trichinosis was still an issue. LOL", "The texture of anything that's not at least medium makes me want to vomit. I have texture issues with food in general, but with meat it's really bad. I prefer medium well but I can tolerate medium.", "Who else is going that maybe doesn't like it overcooked? If its 1-2 people yes it's assholish. If there's 10 others and they like it cooked normal, he's not an asshole for not catering to 2-3 grown adults with picky food preferences.", "But what about the others who prefer med rare? Personally, I wouldn’t eat medium or well done roast, I wouldn’t make a big deal about it but I just wouldn’t eat any (thereby wasting it) medium beef is just gross to me and many others. Either cut the roast and cook each to the desired temperature (doesn’t have to be in half) or have a plan for cooking the appropriate amount to the desired doneness that does not include the microwave. My mom likes hers medium the rest of us rare to medium rare so we put hers under the broiler for a minute or so and she likes it. If she didn’t, we definitely would figure out a way for everyone to get good food they enjoyed!", "You can’t uncook meat. You CAN cook it past medium rare to get it to what you want. You’re disturbingly dramatic about this lmao.", "On a roast, there's usually two...", "He’ll need at least 6 end pieces (wide and her parents) and that is not possible. \nOp is TA\n\nOp: YTA", "Couldn't he even just pop theirs back in the oven for a few more minutes after he cuts the medium parts out?", "So over the top, my grandparents have been happily microwaving beef and lamb for 1 min for 40 years. They get that their preference is not everyone else's and you can't uncook meat, but you can cook it more. NTA.", "Nope, since they've done it at my house and other places multiple times before.", "Reddit always goes to the extremes with things lmao. They’re going to stop attending family holidays because they were forced to use the microwave for a few minutes? These are grown adults, right? \n\nHow about the rudeness of expecting OP to mess with everyone else’s meal because 2-3 coming can’t stand waiting a few minutes. It’s not like OP could uncook the meal for the majority of people there who want it medium rare", "If someone thinks a marriage should end over a roast they have other problems, lol", "So because 3 people want well done the other 7-8 people want medium rare, it’s disrespectful for the 3 people not to cook for the minority? They can have their piece cooked a bit more and be happy, OP can’t un-cook the meat for the rest of the guests", "Whilst the spouse you claim is being rejected is contemporaneously rejecting the feelings of her spouse and his family. \n\nSo he is the chef. \n\nI’d hate to be at your thanksgiving supper if you cannot imagine it being a dinner party.", "That's fine. Use a pan. Put it under the broiler. People can leatherize their own meat in the manner of their choosing.", "Never said as good, said it won’t ruin. However roasting beyond MR does ruin it. Put it in a pan, sure. Cook two roast, sure. Cut some slices off and throw it under the broiler, sure. Multiple options here. Cooking it her way prevents him and his family from enjoying it according to their taste.", "It's obviously a preference, her family prefer it a different way to OP. You can scream about science all you like but that won't get them to change how they enjoy food, they'll just know you're opinionated and unwilling to cater for the guests you invite to your meals.", "You're being really insulting and super pretentious now. Do you want her parents to hate you?", "Making them recook their own meat is a slap in the face, it's the opposite of being a good host. Just make a turkey. You're a total ass about red meat.", "Yours taste like show leather", "Eh, ok. That's trickier if 2-3 out of 10 want it well done.\n\nNew suggestion. \n\nCook to 10 minutes below medium rare. \nCut off the end bits. And let them rest on the bottom of the pan. \nThrow back in oven and finish\n\nPeople that want well done get that extra crispy, crackling edges to their meat with some extra maillard reaction tastiness.\n\nMedium rare people get their medium rare meat. \n\nEveryone gets served at same time. No one is throwing meat in microwave.", "He'd asking the cooking preferences, not generally how many people will be in attendance.", "He literally, in the comment the poster is replying to, did not mention anything about what the split is between the guests re: preferred doneness.", "Medium well is not the same as well done", "Split it *before* cooking.", "It'll only run out if not left to rest properly.", "They're taking about your attitude.  Your whole post is my preferences and what I like.  You don't care about anyone else's tastes.", "Big cheap hunk of meat? Is a diss", "Microwave \"cooking\" is really not the same, nor a great compromise. It definitely alters both the taxture and taste of the meat.", "I love carpaccio! I'm in the US so it's really hard to find here.\n\nAs I said before, this conversation has been a revelation. And you saying that you like carpaccio is also amazing! Since it clearly tastes like raw/rare meat, yet you still enjoy it even though you're someone who likes meat that's cooked past medium.", "Obviously that's not enough", "No lol - the end pieces aren’t literally just one slice off the end, it’s the ENDS of the meat cut into multiple slices. I do the same damn thing at Christmas and get more than enough out of it.", "I was with you until this point, but I see your other comments so hopefully you’re not going this route. I completely agree that roast more done than medium rare is honestly sacrilege and truly when I am out with new friends and they order it well done I wonder if they will ever realize how terrible their food is HOWEVER microwaving is gross and not cool for your guests put it on a pan and cook it longer", "So this isn't even the first time this has come up. This is definitely ending in a divorce. Lol. Some people just don't learn from their mistakes.", "The roast wouldn't be the reason. But respecting your wife's opinion and family will be.\n\nIt's impossible for this to be the only topic you minimize your wife over.", "Guess what? You're not invited.", "Totally agree, but OP is saying he's going up cook the meat how he likes and they can go microwave theirs afterwards if they're not happy. That's the asshole part IMO", "Individually cooking pieces of meat makes them taste like garbage. All juice is gone. It's disrespectful", "So why at the same time dismiss the preference of him and his family. Grow up.", "I like mine medium well. Thin line of pink. The bloody looking juice is disgusting.", "Fucking butcher the roast...", "Given context clues, op is saying it's only 2-3 people who aren't ok with MR. Pretty obvious , \"it's likely only 2-3 people and I've seen them do this before which is why I thought it was OK.\" paraphrasing.", "\"It's likely only 2-3 people. I've seen them do this at other dinners which is why I thought it'd be ok.\"\n\nGiven the context, it's 2-3 people not ok with MR, he's seen them microwave food up at other family events, hence why he thinks it's ok.", "the wife asked for “medium well or well done”, so it doesn’t really matter when she’d prefer either over medium rare", "The post says “medium well or well done.”", "He said “medium well or well done”", "I care about the tastes of the majority of people who will be eating at thanksgiving.", "Ok, I'll reword it: Turkey is cheaper than other options and feeds a lot of people.", "It is literally big and cheap? He is describing turkey?\n\n*this* is a diss. Turkey is the fucking worst meat you can eat off any animal humans regularly consume. There is literally no way in which it is not just inferior chicken, but I respect people's right to be wrong about enjoying it.", "Yeah OP is clearly a snob, lol.", "LOL, I hope the turkey isn't too offended :)", "It is difficult to find. And yeah, I like the taste, the feel in my mouth makes it impossible for me to enjoy though when it's thicker.", "Genuinely, why does it matter to you what your friends order if you're not the one who has to eat it? That just seems pointlessly judgmental.", ">This is definitely ending in a divorce.\n\nBet.", "You're exactly right.  OP is awful.", "Why would you want to continue to be married to someone whose family sucks this fucking bad anyway lol that sounds like a win", "There are three choices here: 1) do it this way, 2) the well-done crowd eats the ends or 3) cook poultry and we can all agree when its done.", "No one who demands well done meat is in it for the juice.", "You care only about yourself. It's very clear in your post and comments.  Your poor wife and family. Enjoy your selfishness on a family holiday!", "[deleted]", "No one is demanding it well done just not squishy and bloody. Meat cooked to medium is very juicy and not gross and chewy.", "Repeating something doesn't make it true buddy", "No, they don’t. OP already stated that there are 10 people coming to dinner and only 2-3 of those people want it cooked longer", "But they don't want medium. They want medium well or well done. So that literally makes everyone unhappy, because the medium-rare preferers have to eat something more done than they want, and then medium well/well done crowd still has to cook it more. The definition of a unhappy medium.", "Fair enough, I didn't see that in the post, but still an AH for his attitude, he's been offered suggestions and compromises", "A roast was a bad choice if rude host won't cut into 2 or cook a bit longer for more end pieces. Not being bloody is medium.  That's what they asked for.", "It's not blood, it's myoglobin.", "ESH Why can't you soak their pieces in a bunch of au jus when you finish cooking it to brown it up?   It's literally what every Sat night steakhouse chef does for MW and Well Done prime rib.  \n\nYou don't overcook meat for a select few. You cook to optimal temperature and provide additional options.  Thrown in a turkey or ham, too, if they have a beef with the beef...", "YWBTA firstly, if you have guests / are cooking for other people, the polite thing to do is to make food the way *they* like it. To do it the way that suits yourself is extremely rude. \n\nSecondly, do you really want to sour the relationship with your in-laws over *this*?", "When I host dinners, I make sure everyone has something they like and has enough of it. My FIL doesn’t like cooked tomatoes, sweet potatoes, cooked onions, and cooked carrots. When I made sweet potato enchiladas for the family, I left a big chunk free of sweet potato and put more corn and black beans in that piece. When I make chili, I use tomato sauce instead of diced canned tomatoes. My cousin was on keto for a while, I made a small dish of  spaghetti squash ‘lasagna’ to go with the big lasagna that was for everyone else. My mom doesn’t like meat, I made a small dish of meat free lasagna. When you host people, you need to make food they’ll enjoy. That’s the whole point, having a great time with family and enjoying each other’s company without people having to worry about a plate of food they won’t enjoy. \n\n\nOn the flip side of this: I understand not wanting to cook the ever loving shit out of that roast. BUT, didn’t you know your wife doesn’t like it that rare? It really feels like you’re just making this roast for yourself and your parents. YTA for that.", "Cook it to medium rare, after it has set, cut their pieces and stick it in the oven to finish cooking to the preferred temp. Problem solved.", "YWBTA\n\nMy mom, my grandpa and his girlfriend don't eat \"bloody\" meat. It doesn't help when I tell them it's not bloody, but pink. They want it all the way through - but still tender because they can't chew well.\nSo I always do 2 roasts. (just split your roast in half)\n\nAnd if you're really good at cooking and buy good meat, even a well-done roast will be incredibly juicy and tender. If not, then it's up to you - then take a cooking class or get in touch and I'll give you tips.\n\nBut feasting with the family should be nice for the whole family. And when you invite your loved ones over, you want to spoil them - not re-educate them. Stop being so arrogant.", "Yes YWBTA if you don't compromise here, as a host it's your job to make sure all guests have something they can eat for a main dish. Cut off enough for your wife and the inlaws and cook it to their liking. It would literally only be a few minutes longer no?", "It’s one piece of meat but you have the power to make it into two. Let’s do that, and make everyone happy. You say it’s ruined if it’s well done, they think it’s ruined if it’s not well done. You can’t say you win", "YTA. Get 2 roasts or divide it in half. Guests should not have to cook for themselves. For me it's impossibke to eat medium rare, I want mine well done, it just tastes awful to me otherwise and that won't change. Don't force your preference on others! This is not a hill to die on and it will affect your relation with your spouse but also her family forever. Don't eff up, just buy 2 roasts and be happy and thankful for your family", "yta", "YTA. You’re not cooking for yourself you’re cooking for your guests. Find a way to cook yours the way you want without telling your guests to microwave their dinner. You sound awfully stuck up", "If anyone wants it more done, they can be be finished in a pan; no need to over cook the whole thing. Find a compromise otherwise ESH.", "Can’t you just cut it in half? :/", "YTA. Just cut it in half. A relationship is about compromises. Literally it won’t kill to cook it for a few more mins.", "Dude most roasts are not done to medium rare that's so strange to say", "I think cooking it the way you want then cutting off some ends and cooking it in the pan or keeping it in the oven is a fair compromise", "I thought this said toast and I was mad confused", "YTA for this statement. \"I plan on cooking it to a medium rare temperature since that's what I and most people in general prefer.\"\n\n\nAs your wife and her family has already proved, it is incorrect.  Many people cannot stand the thought of a any pink/red in their food.", "There is no snob like a rare meat snob. Your preference is not “the right way” to eat it. Prepare a portion more well done (in the oven, not the microwave).", "YTA holy shut dude it’s a roast not a million dollars. Cut it in half and start theirs sooner you’re being deliberately obtuse because “man must respect meat more than wife” 🙄", "YTA you’re literally missing the ONE job of being a host- making your guests more comfortable. Cut the darn thing in half or make a Turkey.", "ESH. \n\ninstead of nuking try searing those pieces post cut. Theyll be much juicier than nuking.", "YTA. I get you don’t want to waste meat on them by overcooking it’s but here’s the thing. They’re you’re in-laws and you know in advance they won’t like the meat. You don’t get to choose their preferences for them. You’d be a bad host by not compromising. Either cook their meat a little long or provide an alternative. Just because you don’t approve of their preference doesn’t give you a right to be a brat about it. I don’t eat veal or lamb. Everyone knows I don’t eat it. If I went to my sisters house for Thanksgiving and they served it I would be pretty upset. At least give them the option to bring their own food.\n\nETA: I’d like to challenge all the people voting N T A because that’s how you cook beef to think about this. Imagine the reverse. Imagine he only cooks it well done and is refusing to provide any less cooked meat to his guests. Ya’ll would be having a fit because well done beef is disgusting. This was never about cooking and always about him refusing to accommodate his wife’s family.", "YTA. People who insist on cooking for guests the way they personally prefer due to some food snob concept of “it’s just how it’s SUPPOSED to be done” are so tiresome. If you know they want medium well, then cook their food to medium well.", "YTA. You are making a meal that many of your guests will not like.", "YTA what's the point of having guests over if you're going to serve them something that you know they won't enjoy? You wouldn't serve a vegetarian/vegan meat, you'd accommodate them, but because they're meat eaters there are no accommodations, your way or no way.", "Lol I'm sure is the unique time you cook in the year just because is meat, and you don't take the other people's opinion into account because you feel so entitled by being the \"chef\", anyway medium meat is gross for a lot of people (including me) YTA. Imagine being pretentious about meat lol.", "YTA, you are being stubborn about your food tastes being \"right\" instead of trying to find a workable compromise. This cut of meat is so nice you are good with guests microwaving it?? Also you are hosting, you have to care about what your guests like even if it's not your preference. \n\nYou can take the roast out and cut half of it rare and put it back in and cook the other half more. Or cut it in half at the beginning and cook one to rare and one more well-done. \n\nDon't host if you are going to impose your taste over your guest (and your wife's!!!) comfort and preferences.", "YTA. Cook half the roast the way they like, and half the way you like. Or get two roasts. Or don't choose a rib roast as the main dish for a mixed group of people, some of whom hate rare meat and some of whom hate well done meat. But it's an AH move to make a main dish that you know half your guests don't like for Thanksgiving.", "Your wife is correct. YTA.", "Why even invite people to a meal if you're not prepared to serve food they will eat?\n\nYWBTA", "This is strange to me. If you're asked to cook but then they want you to cook it differently, that's odd to me. It's always been my understanding that those who gave differences in preference or diet- even many allergies (aside from extreme allergies) are not to expect having extra food made just for them. You bring alternatives or help out during meal prep and supplement alternatives. I personally enjoy making a specific dish (say gluten free) that everyone can share and work hard to make food that tastes like what everyone else is used to, but it's a lot of work and I wouldn't do it if expected. I'd just make something with wheat flour.\n\nYou bought the meat and are preparing it. I don't understand why people would complain over that when they can choose to have something else or offer to pay for another cut that you can cook to their preferences. It seems just a touch entitled to me. When I was vegetarian no one brought vegetarian alternatives to our family dinner. No one cared that I ate nothing but sides- because it was my preference and so they shouldn't *be expected* to go an extra length. They arent a/h for that, but they would have been extra considerate for doing otherwise.\n\nEither offer to cook another if they chip in to their preferences, or split the meat and take one out sooner than the other as another commenter expressed.\n\nNTA", "It’s a crime against beef to cook a prime rib past medium rare. NTA, and like you said the end bits will be fine for them. If they still complain, buy an extra round roast and cook it to death, I guarantee they won’t know the difference.", "Your wife is oh so wrong. Go out and buy a small crappy cut snd do that for them.  Better yet just make them meatloaf. Heathens.", "You're NTA - you are serving an expensive cut of beef.  For those who prefer MW or W/done 🤮 - you could use a restaurant trick:  buy Campbell's Au Jus (can).  It's actually very good & not salty, at all.  Simmer the Au Jus until VERY hot & ladle over the slices of beef a few time & they magically become MW!  Or, you could just drop the slices into the Au Jus for 15 to 30 seconds!  Voila, crisis averted.  Using a microwave will make the meat tough.  2nd Option: roast a chicken stuffed w/ herbs as another option to serve along with your roast!  Good luck.  PS:  girlfriend is being very EXTRA.  Be forewarned  🚩🚩🚩", "Right?? My dad used to work at a meat packing company. Got all kinds of free meat. But any time this couple I'm friends with came over for dinner, I'd tell them to bring their own steaks because I won't be wasting my meat on a well done meat puck. No one was mad", "I just wanna say, its better to put one in first instead of taking one out sooner, that way they are ready at the same time", "Or buy some extra steaks for the side and cook it to how they want it. Maybe they could buy two small roasts and cook them go different temperatures.", "Cutting this type of roast in half before cooking will ruin it.  Better to just buy another, smaller piece and cook to their liking.  Then everyone can take home leftovers for delicious sandwiches the next day.", "Why would he be the AH here? Sure there’s a compromise but aren’t the AH’s the ones imposing their preferences on their host? Aren’t guests supposed to be gracious?", "This is not the appropriate way to handle a roast. The center of each piece wouldnt be cooked properly.", "What we did last year was cook it to medium rare, then those who wanted it more well done cut off their piece and skillet cooked it. That way everyone was eating around the same time. You can always cook your meat more. You can never uncook it.", "Team ham, FTW.", "This. We do this in my family. My dad and brother like their prime rib medium rare, my mom and I like it more medium. My dad takes our slices and quickly sears them in a cast iron pan which gives a nice crust. Ta-da, everyone is happy.", "This should be higher up.\n\nOP, when your roast is lovely and medium rare, cut a few slices off the ends and toss those pieces into a frying pan for the philistines in your family who prefer to gnaw on shoe leather.", "The microwave suggestion is exactly what makes OP an asshole here. Whenever I’ve made prime rib I cook it to mid rare and slap slices on a skillet for people who like it more done. That’s what a restaurant would do. \n\nSuggesting they “nuke” their own not only makes OP an inhospitable chef but it screams “if you don’t like your food the way I do you deserve to have it microwaved and ruined. Only a terrible cook would let their beautiful roast be further cooked in a microwave rather than done properly on the stovetop. OP isn’t wrong in his opinion but he’s being a jackass about expressing it.", "yeah that’s what a restaurant would do. also pan searing a cut of roast is delicious. outback used to have a outback style one that seared a slice of prime rib like a steak. amazing", "In the post, he's the only one who DOES suggest a compromise. His wife doesn't.\n\nHis suggestion isn't a GOOD one (microwave), but if he and his wife didn't get their backs up and get stubborn about it, they probably could have brainstormed a better way to satisfy everyone.  At least here in the comments, there are multiple suggestions for how he can do it so that it isn't just microwaving, and will still result in a good piece of meat for those who want it done more.\n\nI don't necessarily fault him for lack of knowledge or imagination beforehand -- it turned into an argument, rather than problem-solving.  Maybe it turned into an argument because he WAS being pretentious about it.  But I'm not impressed by the wife \\*also\\* proposing to impose her preferences on the entire guest list, either, with no room for compromise.", "If he wanted the meat rare I would understand, but medium-rare is the standard for red meat and the ends will be more well done. Microwaving isn't the only option but he is doing the labor for an expensive piece of meat, unless they're going to actually eat half of it, it doesn't make sense to ruin more of it by overcooking. If they're going to eat half then yes he should split it and just cook half longer.", "OP said 10 people are coming and only 3 prefer med-well to well done meat. It makes no sense to overcook the meat when over half prefer it med-rare.", "Why is their preference more important than his preference? Will their preference not ruin his meal... that he paid for? It sounds like only two to three out of 10 people coming have that med/well preference, So why should they decide for everyone when there are actual compromises available? Their opinion isn't any more special than anyone else's.", "So he should ruin it for himself and any of the guests that are (rightly so) repulsed by the thought of a medium or well done roast?", "OP has 7-8 people who prefer it the way he does and 3 who don't. Our family is a total of 12 with 3 wanting their beef well done. I prepare a hot cast iron skillet and cook 3 pieces to the desired doneness and baste with butter so it isn't dry. This accommodates everyone so 9 people aren't eating something they don't like to suit the preferences of 3. Compromises are possible.\n\nEdited for typos.", "A well done roast is already ruined", "NTA\nIt's way easier to cook a few slices a little longer in a hot skillet than to magically uncook it back to med rare.", "His job is to cater to ALL of his guests.  Not cater to only 3 of them.\n\nIt's not being a food snob to say that he and others like it medium-rare, and that to give the wife and others what they want, theirs should be cooked more, individually. (Yeah, the microwave suggestion wasn't good, but clearly in this comment section, he has learned better.)\n\n(There is, of course, room for him to have been a food snob in the way he expressed it to his wife.  You only have to look at the comments here, too, to see plenty of that.  So maybe he deserves to be part of the asshole judgement -- ESH, for example.  He may have provoked her.  But she wasn't looking for any compromise either, it sounds like.)", "Their way is I will cook their piece more. Not the whole roast.", "Its only 3 people complaining about it so I don't think it's that. Depending on how many people show up, it's gonna be majority rules.", "[removed]", "He isnt saying they cant have their meat well done he just doesnt want to make the whole roast cooked beyond his preference when the very easy solution is to just sear the wifes familys pieces.\n\nMy parents also like well done but they also know that none of their kids do so they always take the end pieces or sear their slices.", "FYI that’s not blood", "If you want an honest answer it’s because:\n\n1. “Catering to the above people” is usually not actually done on the same level as the actual core meal. Most of the time, it’s “omnivore dish and here’s a salad if you don’t want that,” so it’s not much additional work.\n\n2. It’s substantially cheaper to accomodate the above people at a lower cost without “wasting” (in the eyes of people like OP) food. If the in laws were vegetarians he could probably make something for them for under $10, but cooking an entire roast well done would probably effectively “waste” like 40x that amount.", "How is it wasting if it was free in the first place? That's weird dude", "I agree, just cook some pieces extra, it’s not difficult. \n\nBut also. This reminds me of a friend of mine- I like my hamburgers well done. Just no pink, is what I’m after - it’s an aversion I have. He would always jokingly tell the waiter “make it a hockey puck! LOL!” And I’d get charcoal. Gross. Well done doesn’t mean burnt!", "That's what I was thinking. Have a pan already heated and ready to toss the pieces on. Just takes a minute. And adds a little caramelization to those pieces so they are better than a microwaved piece. \n\n\nOvercooking the whole roast would be ridiculous.", "I worked at a steakhouse and we cooked our prime rib to rare-medium rare because it would always continue to cook. If we didn't have medium well or well done, we would sear it. Always worked out great. The ends were always medium or higher.  I think you'd be fine to cook medium rare as the end pieces are always more cooked than that. \n\n\nTread lightly. Is this really worth the battle for people that dont appreciate prime rib? I'm going with NAH.", "That's what I do.  The family members that want it more cooked get their slices thrown into a cast iron for a sear on both sides, and everyone is happy", "That is the best idea.  Tell your wife you will pull the roast at your preference (after all, you are doing all the cooking and seemingly planning for this event) but will butter baste her and your parents cuts to their desired wellness just like restaurants do.   \n\nListen, I worked on the food business and know lots of top tier chefs.  It’s pretty much agreed that thanksgiving, especially at home with family is not a time to get experimental with the dishesk.  This is hardly that.  But it seems like the comment your wife made may signal some feelings about you being overbearing when it comes to food.  Talk to her about it.  Stuff like this can creep into other perceptions of you to her.   Good luck!", "i think this is the best option. this is what my family does. we cook it medium rare and then once sliced my dad with either fry or grill the slices extra for those that want!", "This is what my (now retired) chef husband does. He cooks a rib roast to mid rare then flashes any slices that someone wants more cooked to temp in a pan. It really only takes a few minutes once the rib roast is rested. We don't do the whole main-as-presentation on the table (we serve up buffet style and only put rolls, butter, salad if there is one, and s&p on the table), so he slices it before serving so people can choose their piece and have it brought to temp if necessary.", "Cook it in 1 piece, once your part is done, cut it out, then jeep the rest in the oven. Not rocket science", "I wouldn’t do it the suggested way above because it doesn’t allow for proper resting time. I would suggest cooling, slicing, and then finishing their slices in a skillet with some of the leftover juices.", "there's 7 of us and we started buying just a turkey breast (instead of the whole bird) a few years ago and it fills us up. I think that's a good option, but you could also just cut enough off for your wife & her parents and pop it in the oven a little longer. I prefer mine well done, but other family members prefer it Med so I do it like someone else said, & put a piece for me in an iron skillet to cook a little longer. That way everyone's happy and no one is having to microwave anything, and can all eat together still. Hope Thanksgiving goes well for y'all!", "I would hope they don’t eat prime rib from a buffet at all…", "he probably just didn’t think any the fact that he could put it on the stovetop. when someone suggested it, he said that that’s a good idea. sometimes we forget abt an option. that doesn’t make him an asshole.", "there are plenty of comments here suggesting to him that he pan-sear them to extra done-ness, instead of microwaving; and that's the idea he's now going with.  He changed his opinion on the method in the comments -- i.e. he listened to commenters.  \n\nThere's no real need to call him a jackass for not initially having the right idea on how to do it.  (He'd be a jackass if people were offering him solutions but he wouldn't listen to any of them.)\n\nI see the initial problem, as presented, as a ESH, honestly.  OP and his wife need to learn to communicate and have an adult conversation where they are both trying to solve a problem so that everybody wins.  You're married, you're supposed to be a team.  Act like it.\n\n(And I'm leaning towards N T A for OP, because at least he was \\*trying\\* to compromise, unlike his wife.  Even if his first suggestion wasn't a good one.  His wife wanted the whole thing well-done, and damn his - and other guests - preferences.  He wanted to do it so that those who like it MR would be satisfied, and there would be some way to additionally satisfy wife and her parents.   But I'm still going with ESH, because even the little bit we get in OP's write-up here suggests that the way he went about it contributed to making it an argument rather than a problem-solving session.  His wife calling his preferences \"pretentious\" probably has a basis in the way he talks about his preferences versus hers.)", "https://youtu.be/amKyA2PrSu4", "For real, everyone who likes their meat MR are always such snobby dicks about it", ">delay the meal for the majority of guests\n\nPut theirs in earlier...they both come out at the same time.", "You have more excuses than a teenager to why they didn’t clean their room. On Thanksgiving you precook what you can. And it would not be that difficult to cut a portion of the roast off to cook longer. Roast is very simple to cook.", "Personally, I'm with OP on medium rare.  However, if 1 person likes medium rare and everyone else wants medium well... then it is rude to ignore the majority.", "It's his attitude that is the most offensive/pretentious,  it's not impossible to cook it in 2 separate hunks so no one is repulsed by the family Thanksgiving dinner", "Nope, he cooks it to his preference cuts a chunk off each end and cooks it a bit longer without insulting anyone, or chop it in half from the start. Easy peasy.", "It would help if you explained here how many people will be showing up to your dinner? Are these three the majority of the people present or are they a minority? In either case, NTA. Just cook the thing medium-rare, then let it rest, cut off the pieces for the people wanting it more done and cook those to the desired doneness in a pan.", "Microwaving beef is gross. At the very least, pan sear several slices so that there is a decent selection of well done beef for those that prefer it. Having your guests need to get up and microwave the meal you served them is a bit tacky. Serve everyone together, it takes less than a minute to get a roast to WD in a pan.", "food snobs are so weird.", "i agree but the microwave is even worse. microwaves are for popcorn only imo.", "It is as long as you offer to cook their slices on the stovetop instead of having them microwave them. That smacks of you just wanting to ruin their meat.", "It’s not fact, cause it’s about preference and taste, which is as subjective as it gets. What you call juicy she calls bloody and for her it’s not good!", "Funny, last time I ate a very fine dining establishment,  the chef said that beef was best cooked to medium.  So I guess medium rare is just an opinion.", "I’ve tried beef at all temps. I hate anything less than medium well, so I learned to cook beef to at least medium well while maintaining its tenderness and moisture. \n\nI honestly just can’t stand it less than medium well. My MIL made a roast that was medium rare in the middle, and I couldn’t eat even the ends because it was just too rare for me.", "Taste is subjective. Some people like eating things that you don't like. \n\n&#x200B;\n\nThat is OK. \n\n&#x200B;\n\nYou are serving people who have expressed a well-known, perfectly acceptable preference that professional chefs accommodate. Several comments have given you ideas about cooking the meat well done while preserving juice and flavor levels. \n\n&#x200B;\n\nThey're not going to change, they're not objectively wrong, and is this the hill you want to die on? \"Yeah sure family helps in times of hardship and sickness but these nerds don't appreciate my refined way of cooking meat!\" \n\n&#x200B;\n\nYTA", "Taste is subjective. The taste of medium rare meat is absolutely disgusting to me. Your preference is not a fact; it's an opinion. Yes, objectively, the roast might be juicier and more tender if it's cooked less, but that does not mean that's what everyone prefers.", "Taste is very subjective. Might be juicier but for example I can't stand juicy pink beef. Like, if not overcooked, it's raw to me, otherwise I'll feel sick because I can't stand the texture", "Don't listen to these heretics. NTA", "He said there’s 10 people coming and 2-3 people complaining.", "Stolen comment from /u/TheVoidWantsCuddles\n\nBot alert", "Why is it “wasted” if it’s going to be eaten and enjoyed by a group of people?", "I see where you're coming from. I was broke & wasn't gonna waste my free steaks on cooking them a hockey puck piece of meat", "he said 10 people total. 2-3 want MW/WD. everyone else wants MR.", "You're not ruining half of a good roast but overcoming it for them, it's a good roast if cooked the way they like. So figure the headcount and burn the percentage to make enough for those who want it that way... What are you going to do if your wife gets pregnant and can't handle meat? Refuse to compromise? That'll go well.i love a rare roast too but just because they don't know any better doesn't mean you shouldn't at least try to accommodate them. Maybe at least cook the other half medium well instead of charred so they can appreciate how it's more moist than when a charcoal?", "This is the right answer!\n\nA prime rib or standing rib roast is expensive and not a piece of meat I would wish to ruin. Even a choice rib roast can be cooked right and be tender AF. Same a prime rib can be totally fucked up is cooked wrong. \n\nWe’ve had it happen twice where it’s all been over cooked and the first time it ruined the meat and made it tough. It was.. not good. The second time it was tender but not my most favorite.", "Yep, this is how it’s done. Also in kitchens if someone wants something medium well or even well done, you just do it cause it doesn’t matter what you think they’re the ones eating it. I don’t get these total meat snobs who insist people have to eat meat their way, they’re exhausting.", "Appreciation for you explaining how to do it without being snarky about those who like it well done\n\nI'm one of those folks. Due to a GI problem, eating undercooked meat makes me *violently ill*. And even though I know the red stuff isn't actual blood, it still makes me squeamish.  But that doesn't mean I want my meat to be burnt or be essentially expensive jerky. You can absolutely still make it taste good and be tender while not leaving parts undercooked.\n\nI hate how people in the comments are being so elitist over food they're not even gonna be eating. Like, other people like different tastes and textures, get over it?\n\nYour comment was both helpful and kind. Thank you.", "To be fair, I've only helped with a prime rib roast once because they are expensive as hell... but what you're saying doesn't quite make sense. The cooking time for them are usually hours long. So trying to get that temp difference over hours probably is not going to work. Additionally, when you prop the oven open you're letting all the heat out. So... its not cooking right", "The roast doesn’t cook the same if it’s halved.", "It’s just jus. Which means juice in French. Served *au* jus means that it is served “with” or “in” jus.", "You can always cook it more but you can never cook it less once it's done. This is an asinine suggestion when just cooking the meat more for the people who prefer it well done is the alternative. \n\nOtherwise the people who do not like well done beef, including the person doing the work, don't get to enjoy the main course. \n\nNTA", "Cutting the roast in half will change the cooking times completely, it’s far easier and better for leftovers if you just cook the pieces well done in a pan afterwards.", "You don’t cook much do you.", "By your logic he should cover all the servings in cheap ketchup, because someone out there thinks like you that anyone who does things well is doing them pretentiously.", "[removed]", "To be fair, yes. Exactly. If you're cooking for a crowd you are the last to eat and it will be cold and people will be half done by the time you sit down. It's how it goes. \n\nMy wife doesn't cook and I cook for all events, parties, and meals. I made homemade cinnamon rolls, omelets and homemade breakfast sausage for my wife and kids this morning. Nothing fancy just with the time change, I was up early anyways. My wife was half done with her breakfast by the time I sat down and so we're the kids. Last party I threw I smoked a brisket, had competition chicken thighs, smoked wings, bacon wrapped prawns 3 or 4 sides, plus 2 different homemade salsas, smoked queso, and a cherry pie. I'd been cooking and prepping since the morning before, stayed up overnight to watch my brisket, and again I ate last. Every chef friend I have does the same. You want your guests to eat well and for their plates to be perfect.", "The better answer is to cook the whole thing to medium rare and then slice some off and overcook it for them.", "Or, he cooks the thing medium rare, then pulls it out, lets it rest and slices off the pieces for those wanting their meat more cooked and fries them off in a pan. Now EVERYONE is happy.", "This is not how roasts work. If you cut pieces off it will get entirely different cook times. Much better to cook the whole thing to medium-rare, let it rest and then cut off the slices for the people wanting it more done and cook those to the desired doneness in a pan. Should only take a few minutes and won't fuck up the food for everyone else.", "Depending on how OP is cooking the roast this might not be possible. My go to recipe for standing rib roast this wouldn't work unless I had two ovens. Better solution is to cook to medium rare that the majority enjoys and then either pan fry (which op said they would do in the comments) or \"juice bath\" in a meat broth to bring it up to well done.", "Say you've never cooked a roast without saying you've never cooked a roast. Literally google a picture of it. Cutting it in half affects the cook time making it more likely for the roast not to cook right (because the ends burn before the middle gets nice and melt-in-your-mouth flavour) on top of which he is literally right. He's doing all this, and what is his wife doing? If searing individual pieces is no big deal then why can't she do it?", "Did you drop the turkey on your foot??", "If you have 10 people coming as OP has stated in comments and only 3 are wanting it well done whybis it ok to disrespect the other 7 people that are there. 6 if you don't want to count OP? That's the majority of the guests which is presumably also all family. The solution is cook the roast to medium rare and then cook their pieces to a higher level in either a \"juice bath\" or a pan. It's what professional kitchens do. Everyone is happy. You can upcook meat but you can't uncook it.", "He said there are 10 people so the majority wants it med-rare.", "He is catering to the 7 other guests.", "A well done roast is a ruined roast", "So the acceptable solution is to over cook it for everyone? It doesnt take into consideration those who like it under. You can always cook it more but can't take it away.\n\nIt's entitled that people, at their grown age, want their food catered regardless of everyone else. Either meet in the middle or cook it after.\n\nFood is expensive. Cook them to taste, sure, but also honor your ingredients.. $100 roast may have taken someone hours or even days to earn a wage to buy.", "Except it will not cook correctly. You do not split a standing rib roast.", "Feel like you and most of the people ragging on OP on this post don't understand the cut of meat involved.\n\nIt is expensive and it is NOT meant to be cooked to well done. Absolute waste of the meat. Cooking it to medium rare and letting the jerky fans cook it further is perfectly reasonable. As is choosing this cut to serve for a fancy hosted dinner.", "Yes, because having to throw it in the pan for a few seconds after it has been sliced off is definitely a reasonable reason to never come back for more holidays 🙄", "He said most guests attending prefer medium rare", "Just because something is not what you or even a lot of people like does not mean you have a better understanding or taste than the others. For YOU well done is ruined, for your wife medium rare or medium is ruined. So get off your high horse and reach a compromise.", "Majority rules on how it's cooked then", "Again, according to the logic of people like OP, because there is no reason to buy a premium cut of meat if you are going to cook it well done, as it effectively makes it very similar to far cheaper cuts. You will see similar stories here from time to time asking for example if there an asshole for buying some lower graded steaks for people who like it well done and saving the higher graded ones for people who prefer lower temps.", "I hate how people act like if you want meat well done, you might as well eat the cheap shit.\n\nIt doesn’t matter how much it’s cooked, you can still tell the difference between cheaper and better cuts.\n\nEdit: and the downvotes start - every time I comment about meat being well done, everyone is so ridiculous about people preferring their meat cooked differently and act like it’s the end of the world to cook it medium or well done and just ruins everything - well of course if you don’t like it that way, you think it tastes bad. People who do like it well done can still taste the difference and don’t need to be relegated to only eating cheap shitty pieces of meat as if it’s the same just because it’s cooked more. Just because you don’t like something cooked a certain way does not mean the other people are wasting it by cooking it how they like if they are eating it and enjoying, they literally aren’t wasting the good meat by cooking it more than you enjoy when they are eating and enjoying it themselves. It’s still being eaten, people don’t have to like things the same way you do. Get over yourselves and your weird meat superiority.", "As a person who prefers \"not red\"\n\n I love your pettiness and approve!", "He can buy a bag of charcoal for them.", "Yeah, if you want it well done, you can use basically any cut of beef.", "The restaurant I used to work at did exactly this.  If a customer wanted a more done version their cut was made and seared to desired level. They still were good and maintained flavor.", "This is what I do. Someone who wants well done can get a piece cut and seared on the pan after.", "This is the comment I was looking for! I worked in a restaurant for years that ran prime rib specials. You don't just halve one, you cook the whole thing to rare/medium rare, then cook each piece to a desired doneness if desired. I actually cooked a piece well done and it was still tender and juicy for my mom, because I didn't halve it, and just cut a piece off and seared it. Smdh, NTA at all as long as you don't microwave it.", "Thank you, I was flabbergasted at the people saying \"just cut it in half\". BRUH. A prime rib roast? Do NOT cut it in half, please. \n\nRoast it, rest it, then sear some end pieces after slicing. \n\nI like to cook and have a friend who doesn't like to eat meat with any red in it. So once when they were on sale I made ribeyes for everyone, about 8 people. Reverse seared them, finished them in a cast iron, butter based them with garlic and rosemary, they were perfect. Let them rest, sliced to serve and....put my friends portion back in the pan. It was painful but that's how she prefers it. She ate it so nothing was wasted, some people are comfortable with firmer, drier meat.", "Take my award. As an avid cooker myself, this would absolutely be the hill I die on.", "THANK YOU!", "Thanks, this helps! I'll do exactly this", "I agree with searing.  Just make sure you give yourself a little extra time.  Get a fry pan or two with some butter and sear those end pieces.  Your relatives will love it.\n\nThis is what we do for my husband when my family makes a rib roast, and sometimes I'm a little jealous of how his comes out.", "[deleted]", "This attitude is the problem. My husband has it. And he does not give a F if you don’t like it. “Stick it in the microwave or sear it.” Both taste nasty. So now we don’t buy prime rib. Because there are maybe 2pieces of fully cooked meat for 8 people. \n\nSorry OP WBTAH. Find a middle ground. Cook it longer, you will still have some rare in the middle. Get two roasts or make something different. Or don’t host. Telling half the people present you don’t give a crap about them is shitty.", "Only if you cut the meat right away. That's why you're supposed to let it rest for a while after cooking. That allows the juices to be redistributed and reabsorbed into the meat, leaving it nice and juicy.", "Yeah, but my dirty disgusting mind will make \"jus\" sound kinda like \"jizz\" if I don't put the \"au\".", "Why are people concerned about this? OP can choose the cooking time appropriately for either of the sizes. In fact won't it take less time, so people eat sooner?", "If one of his guests wants the meat covered in cheap ketchup, he should absolutely let them, without being a d-bag about \"ruining the meat\". Ws share meals with people because we care about them, and if we care about them we want them to enjoy the food as they want it. No one is saying that everyone should have well done roast, but the ones who prefer their meat done a little more should be able to have that, however OP has to do it to make it happen. \n\nIt would be pretentious to make a fuss about someone putting ketchup on their roast at a family holiday dinner. Let people enjoy what they enjoy. Make a fuss at a culinary class or on a foodie blog or whatever. Not to the face of people you claim to care about at a meal intended to celebrate being grateful for each other and being together. Not the place for pretention.", "There’s no hate. Not as long as those who like their food well done don’t subject those who don’t like it to have it their way. OP is totally right that you can always cook it more, but you can’t uncook it. Why are people so opposed on having their piece finished in the pan? Clearly OP doesn’t mind the extra work.", "I like my roast rare, but when I am hosting I cater to my guests. Even if that means buying another roast for them to have cooked to their preference. The art of being a good host has definitely went down the drain.", "Honestly I would just buy them a turkey breast and cook that. Why overcomplicate it? They don't like roast done the way he cooks it so they can have something else.", "And we have 7 people who prefer med-rare so by your math at least 14 pieces need to be med-rare.", "“No roast” is better than “microwaved roast”", "Oh, come off it. Meat snobs are some of the worst AHs, I swear. Cooking a roast to medium well is *fine* and OP’s wife said they’d be fine with that. It’s not *ideal* from a culinary perspective, sure, but the “best” way to cook anything is irrelevant if you don’t actually *like* it when it’s cooked that way. I’m sure everyone has *some* kind of food that they prefer when it’s cooked or seasoned in a way that would make a professional chef cringe. It’s such a stupid thing to be a pretentious asshole about.\n\nWhen it comes down to it, the best way to cook *anything* is the way the intended recipients will actually *consume* it. There are solutions to the differing tastes that don’t involve making dinner guests microwave meat to “cook” it to their preference.", "it’s honestly not that serious. i never said to overcook it for everyone lmao. i think he should cook it to medium rare and then cook the pieces for his wife and her parents in a pan. \n\ni just think it’s weird to pretend you’re better than others because of the way you like your meat cooked.", "It’s not the roast that will cause you problems. It’s the disregard you’re having for her parents that will eat away at her. She’s made a request and you’re dismissing her….for a family dinner.", "Cool. Then he only needs to put a few slices in a pan. \n\nThe only wasted meat is uneaten.", "Personally I find it really weird and pretentious. This sub is all for catering to diets till it comes to a hunk of beef. Time and time again people have mentioned sensory issues and stories where they can tell they’ve been served inferior cuts and they can tell.\nThis is pretty baffling.", "All the juice will run out if you cut it before it rests", "he said 10 people total. 2-3 want MW/WD. everyone else wants MR.", "he said 10 people total. 2-3 want MW/WD. everyone else wants MR.", "It's amazing the hill that some Redditors want to die on, right? And I agree, a cheap cut of meat tastes like a cheap cut of meat, no matter how cooked it is.", "Also, good meat is the only meat that can taste good more well done.", "Thank you for this! I know it’s considered bad form to cook meat well done but that’s the only way I can eat it. I get grossed out by rare meat. I can’t eat anything less than medium well & I prefer it well. Food snobs make fun of my preference all the time but that’s just what it is…a preference. My preference. Just because other people look down on it doesn’t make it wrong for me. \n\nEvery time we had steak when I was growing up my father (strictly a rare meat man) would look at my steak & comment on what a waste it was. I always came back with if it’s not done to my taste then I wouldn’t eat it & that was a waste. He never really argued with me after that until the next time we had steak. \n\nLuckily whenever we had a roast my mother, who was the worst cook in the world, always made it well done. Not intentionally. She was just a terrible cook!", "You can, however, take a lesser quality roast at lower cost and cook it for 12 hours in a slow cooker out in the oven in a dutch oven.  Put it in, throw in spices and a can of cheap beer, cover, and cook on low. About an hour before being done, throw pearl onions, baby carrots, whole mushrooms, and those little potatoes. It'll come out amazing.\n\nGood option when money is tight.", "There's a reason no one barbecues expensive cuts of beef. They aren't made for it. If you want well-done beef, you don't want steak.", "I agree completely with you. I'm one of the people that needs to have her meat cooked to at least medium well to like it. Anything below that just tastes like blood to me and I will chew myself to death.\nAnd I know that \"iT's NoT bLoOd\" but it still tastes like that to me.\nOthers in my family like their meat blood, so if we were to make a roast we would just split it up and cook one for longer.", "As a vegetarian I also complain about people's weird meat superiority and people get all mad about it lol", "99% of people honestly can’t tell anyways because the best they have ever purchased at most grocery stores is a “Choice Cut”. There is a reason stores label them “standing rib roasts” and not “Prime Rib Roasts”.  Flavor is also dependent upon the “aging process”.", "No, you might as well eat cuts that are meant to be well done. Like a pot roast, or short ribs. Not a very expensive rib cut.", "Or done well", "Dumb question am a vegetarian and my family is not big meat eaters what does “don’t like it bloody” mean? Sorry again for the dumb question.", "I like mine on the rarer side and I always tell them when they ask how I want it to give it to me as rare as you can.", "You sound like a killer host!", "Maybe it was the fact that you suggested they microwave it that bothered her the most. I can’t speak certainties for her just possibilities as I don’t know you or your wife in the slightest, but personally, being told to “nuke it” would rub me the wrong way. Maybe try to explain that with the way the roast cooks, it would be really difficult to cut it in half to cook and would reflect poorly in all cooks of the meat but cooking the roast to medium or whatever lesser cook was wanted and then pan frying the rest to preference would keep that flavor consistency and also get everyone their preferred cook. Hopefully that would be a good option to her. And I would personally apologize for the microwave suggestion even if you had meant the frying pan by the words “nuke it”. I don’t know much about cooking especially meat but I do know that the microwave makes any piece of meat kinda shitty compared to what it should be", "Thank goodness ✌️ NTA by far at this point", "Do not do this.\n\nChanging the cooking time is completely irrelevant, and suggesting that it's some sort of impossible burden to cook two smaller roasts that take different times is ridiculous.  1/3 of the guests prefer more well meat, so cut it down by 1/3.  Hell, the fact that the rarer piece is going to be bigger might mean that they finish at similar times anyway.   \n Cut the meat while raw and put the one that will be cooked longer into the oven first.\n\nUnless of course, you're also bitching about how the veggies and potatoes and whatever else you're serving have \"different cooking times,\" this is 100% a non-issue made up in an attempt to be smug and cruel about how there's only one \"right\" way to cook meat.  Things go into the oven at different times during a meal like Thanksgiving.  That's literally how it works.", "A good prime rib and I’m talking AAA, not even prime grade, from a reputable butcher is going to cost at least $25 a pound. Let’s assume there’s 10 people for the holiday between both families.  \n\nIt’s a holiday, you want to make sure everyone can eat well and you have to also account for the weight of the bones in the roast, so you’re probably going to aim for a pound per person. You’ll most likely have some left overs from this, but nothing crazy. \n\nEach bone of a prim rib roast weighs approximately 2.5 lbs. they need at least a 4 bone prime rib.  And that will cost like $250-$300. \n\nYou absolutely want to keep this whole while cooking. He could cut one or 2 bones off and finish them in a cast iron, but it will be uglier and extra work and mess with timing overall. \n\nThere isn’t a “perfect cooking size, but if you were familiar with a prime rib and the structure, you would know it tapers and that the ribs also need to be peeled off and trying to cut it in advance is very unideal. \n\nYou also get a nice cut like that for presentation and it gets ruined when you go slicing and dicing it prematurely.", "Bone in prime rib roast? Yes. A 3 rib roast is $170 just for the meat. A 6 rib roast is nearly $400...just for the meat. Not including anything  Like, literally Google my brother. OP is likely talking about a bone in prime rib roast. Anyone who knows how to cook would have realized that immediately. And yes it does make sense. There is no \"perfect cooking\" size, sure. I never said there was so not sure why the quotations. But 2 smaller roasts will cook significantly faster than 1 large one. More time in the oven means more browning. More browning is more flavor. It also means drastically different start times between the two, and then over  ooking a large piece of meat for what sounds like only 3 people thereby wasting it all later. A 3 rib roast is gonna take about 3ish hours  or including rest time. A 6 rib roast is roughly 7 hours. You also don't take a 3 rib roast and cut it in half. At that point you might as well just slice them into bond in rib eyes and sear them.", "…..what do you think butchers do?", "lol the fact that you don’t know how much a prime rib roast costs, then want to call out someone else for their lack of cooking knowledge (when they in fact had very good advice) is so laughable.  Please go back to your mom’s basement and quit trying to be an adult with real life advice on Reddit", "Stupid take. It would turn into a steak. Someone hasn’t had a good steak and it shows.", "How is searing it nasty? Have you ever had a rib eye steak before because that’s exactly what it is.", "This is how you end up with the problem with my family: every meat made HAS to be well done, not fully cooked well done, I mean it needs to be dry. Every meat sucks in that household I think searing people’s meat to their preferred doneness is a perfectly valid compromise, assuming that the well done pieces still turn out okay. This is the only thing I see where he will not have to sacrifice a good cut of meat for everyone who wants it less than well done", "technically still a juice", "Nothing wrong with a little jizz on your meat \n\nSorry", "Actually the OP said that if they wanted their piece more done they can \"Nuke it\". Meaning put it it in the microwave which absolutely implies that they mind the extra work of searing it in a pan.", "There are 10 people coming, only 2 - 3 want it done longer, so how is he only caring about his own opinion and tastes?", "He was going to just fry it in a pan, he switched idea in the comments", "You're right, it's a bit pretentious. Everyone deserves to eat and feel comfortable doing so. It's about spending time with loved ones and being happy. Thank you for reminding me what's truly important about cooking.\n\nFor me it's because I am passionate. It's because it takes practice, dedication and effort to learn how to properly cook- and by that I mean objectively following a recipe, or following the prescribed method of cooking for a certain ingredient. Like, there is a general consensus for the temperatures that a meat is safe to consume. I'm not saying you can never deviate - that's also one of the beauties of cookinng - to cook things to your preference and how you like it. Trying different techniques, etc. \n\nBut those ingredients cost a lot of money and time to acquire. If I buy a nice cut of sushi-grade fish, and someone comes over and asks me to fry it. That's fine - but I'm not using my sushi grade that cost me an additional $20-30 compared to a normal cut of fish. Or if we do, that kind of sucks for me because I used a lot of my special portion for your recipe that doesn't necessarily need it. I do think it's the onus of the chef to prepare adequately, and then the person can ask them to then take the extra step to cook it for them. And the chef should be happy to, but not to waste all the original cuts! Only the portion they eat should be adjusted or it's wasteful.", "you’re fxckin ridiculous😭", "The wife is not respecting HIS opinion/preferences, either. (Or those of other guests who want it done differently.)  That seems to be why this turned into a fight.  He's not minimizing his wife any more than she is minimizing him.\n\nAt least as described, IMO the wife is more in the wrong here, because her suggestions are to impose her (/her parents) preferences on the entire meal, while at least OP was trying to find a compromise.  His first suggested compromise (the microwave) was not the best suggestion, and probably did give the impression that he was dismissive of what his wife wanted.  But I'm not impressed by her insisting the entire thing be done only to please her and her parents.\n\nBut for them to be an actual team trying to solve a problem TOGETHER, both he and his wife needed to discuss this like adults, and both try to find a way to honor everyone's preferences.  Which, as this comment section shows, would be easily done, and probably better done, by planning to pan-sear servings for the wife and parents.  That would result in pieces done to their liking while given them the most flavor, and not depriving others of meat done to \\*their\\* different liking.  \n\n(I don't think the \"split the roast\" suggestions are as good, and some folks who worked in steak restaurants are chiming in to say the \"individual pan sear\" is the way to do it.)\n\nWife and her parents should not be offended by the idea of getting their pieces \"cooked to order\".  That's \\*more\\* effort being done to make guests happy, not an insult.", "You fail to mention why her opinion is more right then the husband's? Yes she and her parents likes a ruined roast but what about the other guests? I'd absolutely hate an overcooked roast.", "Yeah I think that's the best solution", "Says the pot to the kettle.", "It really doesn't. It's not a drain pipe.", "no. he said there will be 10 people, 2-3 like MW/WD. everyone else wants MR.", "An expensive cut of meat tastes like a cheap cut of meat when it's well done", "I smoke steaks. It’s called a reverse sear. \n\nAlso many places make bbq beef out of expensive cuts. Wagyu brisket comes to mind.", "Cooking something low and slow for several hours is hardly the same as giving it 10 more minutes in the over.", "I disagree that \"most\" people like their meat rare or rare-medium. I worked as a waitress for 10 years (fine dining establishment) and most people ordered their meat medium well to medium.", "There's that pretentiousness your wife was talking about", "OP, I wouldn’t suggest you cut the roast in half, but if they really want their meat cooked more, maybe instead of microwaving their slices, they could just be finished a bit longer in a pan on the stove.", "I do want well done beef, and love a good cut of steak, it’s weird that you think you can tell people what they want because of how they want it cooked.", "I’ll share this comment in r/shitamericanssay.\n\nYSK, Only Americans barbecue hamburgues, pork and other inexpensive meats like ribs.", "Yeah, same. I have had this disagreement in person once, with my husband’s friend. We were invited for dinner, he was grilling steaks, and when I asked for it well done, he got really upset. Like he wasn’t going to waste his good steaks like that, and I said “so, you’d rather I eat it cooked the way you want it and not enjoy it at all?” And he said yes, because he wasn’t going to ruin a good piece of meat by cooking it the way I’d enjoy it. Great, really logical thinking, because somehow it’s not a waste if I don’t like eating it, but it’s cooked how he wants it. I told him not to bother and just ate the sides.", "I completely agree with you here. It has like a metallic tang to it if it's not medium well in my opinion, and I don't like that. I find the red juice so off putting too! \nThat being said, I don't have steak often because I've only had it cooked perfectly once when out, nice and juicy but not pink, usually it's dry and horrible because they just don't seem to know how to cook steak properly unless it's pink! A joint of beef I just have the end pieces and my dad has the middle usually.", "I tend to prefer more flat-out medium meat, but that's because anything rarer than that tastes like metal to me.  I'm a supertaster and rare beef has this coppery-iron aftertaste that just ruins everything.  It makes the whole meal unpalatable.", "And both are over cooked for a rib roast.", "Not a dumb question! There are plenty of meat- and even red meat-eaters who don't know this.\n\nRed meat looks red because of the presence of myoglobin, which is a protein that transports oxygen in muscle tissue and contains iron. When iron is exposed to the air, it oxidizes and appears red. When red meat is cooked,  it starts to lose the red color and the ending shade will depend on the internal temperature of the meat, with lower temps (more rare) being redder and higher temps (more well done) being less red and more brown. Many people are uneducated on this fact and assume that the red color and red drippings from their red meat are blood, because blood is red and it's what they're familiar with. Blood would be drained from the animal in the butchering process, so any red liquid coming from the meat will be water mixed with myoglobin.", "Some people erroneously believe juice from a rare/medium rare steak is actually blood because it can have a pinkish red hue. It's actually just water and myoglobin which is a protein. Blood is drained from animals at the time of butcher.", "Rare steaks have a fluid that looks like blood, it isn’t, but not unreasonable to think so.", "“Tell me you don’t know how to cook a prime roast, without telling me you son’t know how to cook a prime roast”", "I don’t cook prime rib but I’m glad someone said this. People who want well done meat should just have chicken. Don’t ruin it.", "Don't people weigh it and google how long to roast it for in any case? Since the sizes are not standard, they'll have to google and approx the cooking time and take temp measurements. It's meat, not a cake, a bit of fine tuning is needed to be done on the go anyway. OP can weigh both pieces and decide on cooking time in the same way he'd weigh the sinhle piece and decide cooking time. No?", "[deleted]", "How is telling him to compromise or make something different a stupid take? It’s not his birthday. It’s a holiday which should be about everyone. \n\nLol you shouldn’t make assumptions.", "Roasting it then searing changes the taste and texture of the meat", "So don’t “sacrifice” a good cut of meat. Make something different for this meal and save the good cut of meat for another occasion and people who will enjoy it. \n\nSearing meat changes the flavor and microwaving it just ruins it. The only other option that I have seen that makes sense is cooking it in Au Jus. \n\nBut again why make this cut of meat for people who won’t appreciate it? One of my siblings and her family don’t like 90% of “good” food. And if you serve it to them they either won’t eat or will put ketchup on it. If someone put ketchup on a rib roast my dad would have lost it.", "Fuck.", "I honestly thought he was just being dramatic (as to him, browning the meat is equivalent to ruining it) - I’ve just reread that bit though and he should definitely brown the meat for his guests, not insist that “if you don’t like it go in the kitchen and fix it yourself” if that is what he’s implying there - that would indeed make him TA", "It doesn’t matter per say. Obviously I would still be friends with them. It’s just a thought, inside my head, like the million others that pass throughout the day. \n\nMy brain while walking down the street: “look at that cute dog” “that stroller looks like a hassle” “i like that jacket, maybe I need a new one?” “That jacket is too light, it’s cold out” “that child is making a mess with his ice cream” “i would never pay for those shoes” etc etc", "I think you're missing the point --> people are suggesting they cut the roast in half or get a smaller roast for the people who like it well done. That way there is roast for everyone's preferences, and you can cook them at the same time so, they'll be done around the same time. It's a compromise ? No one is saying the wife's opinion matters more, just that this dude is unwilling to compromise.", "If he’s spending a couple hundred dollars on a roast, it’s not worth ruining for two people.", "So....exactly what I just said?", "Ah but that is YOUR opinion. People have a right to like what they want to like. You can't force other people to share YOUR opinion.", "No, it doesn’t. Maybe the problem is that you don’t actually know how to cook well if cooking something a little more makes it taste cheap and shitty. *shrugs*", "Brisket is a cheap cut though? Even wagyu brisket isn't more than 7 or 8 bucks a lb. Much less if you buy in bulk. Wagyu ribeye on the other hand is upwards of 70 dollars a lb.\n\nIt's a 10x price differential. Are you sure you smoke when you don't know the prices?", "It’s also weird that people think a well done steak can’t be juicy and tender when they absolutely can be. It’s not all shoe leather", "Yeah, I don't get that. Just let me enjoy my meat how I like it. If I eat it and like it, it's not wasted.\nAnd if the meat is ruined in his attempt to cook it well done then he probably isn't as good a cook as he believes. I have cooked several well done steaks before and none of the them were dry and tough, all were nice and juicy.", "Not really. I did a two Bone rib roast recently and cooked to medium rare. Wished that I'd taken it to medium though, because the fat never really rendered. So there was all this delicious meat interspersed with pockets of chewy fat.", "You do know that prime rib roasts come in many different sizes? Obviously a large roast can be cut into 2 pieces and cooked to the diner's preference.", "It's extremely rude to make wild, unfounded assumptions about strangers, particularly when you're 100% wrong, but I suppose that's what Reddit is for.", "Take your chicken and shove it. Well done meat tastes great…", "Only sorta. Sure it's not a cake but butchers do cut them into sort of standard cuts of 3 to 4 and 6 to 7. Even a 4 rib cut in half is basically 2 thick cut Ribeyes. At that point you don't roast it you literally just grill it to your preference. Again, they'll also both cook drastically shorter than a full roast and make executing proper plate timing harder. It's better to just cook the whole thing, slice off the ends, cook them a little more to well done while you slice the rest of the roast for everyone else. Easy peezy, everyone gets their food at the same time.", "You have no clue what a standing rib roast costs and you're going to lecture people on what a butcher does? Reddit man.", "he literally came here to find out if he was in the wrong or not. if he thought he 100% wasn’t then there would be no reason to post this. you’re very wrong. and he’s caring about 70-80% of the groups wants. he’s already said many times that he’s going to cook it to MR then sear other pieces on a pan to MW/WD", "That quite literally ruins the roast. The people who want it well done, well wife can sear their pieces in the pan. It's an expensive piece of meat and you can't fix it if it's been overcooked, but you can individually cook pieces up to desired wellness.", "How is he unwilling to compromise? He is literally saying they can cook it more if they want. What more does he need to do? Ruin his own piece to prove he loves his wife? Op is NTA.", "One of those people is his life partner, not a stranger that leaves after the meal. Pissing off your partner is not a good thing. Prepping two pieces is better dealing with the aftermath of an unhappy partner. And considering that the others are her family he might not want to be a dick about something trivial.", "No, it’s exactly what you just said!", "Yup, just like some people prefer coors lite over any other beer. Well done steak eaters are the same as beer drinkers who prefer coors lite", "Actually it does. I unfortunately ate many a hockey puck disguised as a tenderloin because my step father liked his meat well done. Tenderloin well done is definitely not the same nor even close to being as good as medium rare or even medium. Ask chef Ramsey.", "Yes the quality of meat always shines through if you know how to cook", "Amen to this.", "So by your logic, overcooking doesn't exist? Interesting.", "It's weird that people ignore science and rely on anecdote when talking about steak because they're insecure about liking well done steak. \n\nEven when cooking sous vide, you can see with your eyes that a well done steak loses 3 or 4 times more juice than a medium steak. https://www.seriouseats.com/thmb/XGsdkEyfEEEH4P2_duPR_0LKG7A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2015__04__20140427-sous-vide-steak-guide-food-lab-18-d7fbfa2abde64618b829ca3890a3758f.jpg", "Because they've only experienced shitty or ignorant cooks that refuse to treat the meat properly based on what the recipient wants.", "I have a theory people like this purposely cook the juice out of well done steaks to “prove a point” like “I told you it wouldn’t be good” ..ie pushing all the juice out (also I typically eat mine medium rare-medium so I’m not just saying this bc I’m a well done lover)", "Yeah it's amazing how when I go to a really great steakhouse and get my steak medium well it always comes out the taste and texture of burnt shoe leather....  except, no, it doesn't, it's juicy and amazing and flavorful because I'm at a really great steakhouse and not in Chad's backyard.", "Medium rare can always be cooked for there to well done. Well done cannot be uncooked for the majority of us that don't want to eat shoe leather.", "That does make a a lot of sense, TIL thanks! Yeah, then fully agree on just using a pan to cook to preference in the end!", "And being pretentious over meat preferences is like shopping at Target and acting like it's Coco Chanel", "Beer sucks", "As someone with sensory processing issues, and dated a chef. It drove me insane that he wouldn't respect my FEW preferences. Like I can't handle the texture of somethings. He'd constantly make things that were easy to adapt - like throw in a chicken breast with the chicken thighs - and refuse to. Or I remember vividly I got really sick and had been puking for days. FINALLY felt hungry and was craving shitty mushroom soup rice and the chicken breasts cooked in it. Like mild gloppy casserole style. I specifically said \"please, just make it the basic bland way. It's all I can handle. Do it like your mom does.\" He says sure, shoos me off to bed. I wake up to it full of veggies, herbs. He decided he wanted it to and wanted to \"chef it up\". I remember crying and just feeling so heartbroken that doing something nice for me to enjoy something was too much. It made me feel so small. The worst part was he EASILY could have made me a small single portion  and the rest for him in a different dish. It was 2nd to last nail in the coffin for me. The serious disregard sucks. YWBTA", "Hey there OP. I prefer my meat quite rare, \"Just show it the fire\" is usually my instruction. I do not, however, force others to eat meat i prepare in this fashion. That's stupid. You don't get to tell others what tastes good. Your wife is absolutely correct that you're pushing your pretentious preferences onto others.\n\nCook the roast as per usual, and have a cast iron prepared to finish the portions of the roast in butter and rosemary for those who prefer it. Our duty as hosts is to make the meal enjoyable for everyone, not to force our preferences down peoples throats. \n\nYTA.", "You are overlooking simple solutions that don’t involve your guests ruining their food in the microwave, and you prefer to die on your pretentious meat doneness hill than accommodate guests (your partner and in-laws at that). YTA.", "A good host strives for the guests happiness as well as their own. My son cooks prime rib for Christmas then grills the pieces for those who prefer it more done. It works great. Perhaps you could do that? If not then I suggest a small roast and a roast chicken?you in laws are more important than your,pretensions regarding cooking the perfect meal. YTA.", "YTA i'd not eat it medium rare. Just because you want to act like a snob about it doesnt mean people will eat. You will end up with her family not eating meat or getting up to cook it further. Your meal will be disrupted and you'd be a crap host.", "YTA given that this is a Holiday meal you should make it to every one's liking or think up accommodations to it.  If it was your own invitation then make it however you want but Thanksgiving is for everyone.  According to post it sounds like it's just you wife and parents so you're kind of out numbered despite being the host.", "YTA. Just cook it medium, my guy. Are you afraid that makes you look like less of a man? Because fighting over this is already doing that.", "Seriously? It's a roast in the center is medium rare then the outsides are medium/medium well. You guys are arguing over this? YTA for simply not  saying yes honey then proceeding to cook the roast how you were going to anyway. Which is medium rare to medium/well.", "YWBTA. OP, always accept how people want to eat their food without comment. If you can't bear it, serve something else. It truly kills me how some people get all up in arms, and feel that a piece of meat deserves \"respect\" and make it their life's mission to defend that steak from misuse. Get over yourself. A beautiful meal should bring people together", "YWBTA. C'mon, guy. This is not worth a damn argument. Just cut the damn roast in half like someone else suggested.", "Either find a way to cook the meat so that everyone is happy or make something else. I would starve before I ate medium rare meat and it’s incredibly rude to do that to family including your wife on thanksgiving.", "Alas, I have to give you a reluctant YTA. You have to accommodate your guests. It's the polite thing to do. If they won't eat your roast, you have two choices: cook it the way they will or choose another main.", "Put it in a crockpot. It gets cooked through and basically falls apart. I have a great recipe for my go to roasts if you wanted it\n\nAlso YTA for not thinking of a better solution, sorry 😅", "Am I the only person questioning why you'd spend that much money on a piece of meat? It all comes out the other end just the same.. its one meal, why are you making such a big deal of it. \n\nThat aside, YTA just split it or cook theirs extra.", "YTA your attitude sucks", "braising is best... \n\ncook yours separately if youre going to make everyone microwave their main thanksgiving entree. YTA", "YTA\n\nSo you’re doing your own preference for the main. \n\nDo 2 roasts.", "I don’t think most people like their roast medium rare.", "YTA. If you are a person who can't handle bloody meat then you cannot eat it unless it is cooked a bit more. If you microwave meat, you ruin it (as I am sure you already know). As host, you should prepare your cooking to the preference of your Guests. \n\nYour wife is right. You are imposing your preferences (Medium to Medium well would be appropriate), and IF you seriously believe that microwaving beef is an acceptable compromise, you are either being pretentious, or you are deliberately making your food inedible for most of your guests. Or both.", "YTA", "Man just cook half or whatever portion for them well done. Not everyone likes what you like. Don't create drama where there shouldn't be one. \n\nThese people are not springing suprises on you. You at least know in advance what they like just reach a compromise and be a good host.\n\nYTA", ">you can always cook a piece more.\n\nExactly. So do it. Just leave some pieces longer.", "YTA because med rare temp for roast beef is typically 135F and this doesn’t allow for killing known pathogens. You may be willing to risk your health, but asking others to do so is AH-ish. At minimum, roast beef should be cooked to 145F, which may put it in the medium category. You’re an AH for suggesting they nuke it instead of cutting off pieces to cook on a skillet or for longer in the oven. This isn’t about preferences—it’s about health. Endangering anyone’s health is always AHish.", "YTA\n\nYou’re host, it’s your job to accommodate your guests. Not ask them to fit your preferences etc.\nor manage themselves. In that case have a potluck or let them stay home.\n\nImo Cook half your way and half more medium well done or whatever. Compromise. I’m sure some guests like your way too. Both are fine. (While I go for well well well done personally. A good chef can make it tender still ;)", "YTA for purposely making food you know your guests won’t eat.", "YTA. Hosting is compromise. Buy a ham or Turkey and have it for those who like their meat “done”. I get it… I’m a Midwest girl who likes a beautifully cooked medium well piece of beef. It hurts to see a steak well done. But you are hosting. So have another option that way everyone is happy. Or…go the cast iron skillet route. Cook it medium rare and then take a cut slice and toss it in the cast iron. For gods sake don’t microwave it! 😆", "YTA - There are options to to cook half, also do have in mind that tapeworm dies at 145f, and rare is only like 130f", "YTA. Learn to compromise and do a portion that is more cooked.", "YTA Some people have GI issues and can't eat rare meat; having a reasonable (not microwave) way for your guests to have their meal done to the level they need is the polite thing to do as host.", "YTA.", "People with compromised immune systems, pregnant women, children and elderly folks should avoid red and undercooked meat. Respect the dietary needs of your guests is what being an adult is all about. Happy Thanksgiving 😊", "Pan sear their well done pieces. Don’t split the roast, that’s an expensive cut of meat. I don’t know how you prepare yours but I coat mine in a garlic and herb butter. Grill over low heat with a pan below to catch the juices for a gravy. You do have to add beef broth so if you have any saved from previous roasts- even better- otherwise it’s too buttery, still delicious though. I pull the roast at medium rare and let rest. Perfect medium rib roast after resting. Then split off a few pieces and sear them in a pan, I prefer cast iron but work with what ya got. This is the probably the best way to accommodate everyone here.", "Can you compromise? Maybe ask the whole party if they want pink or no pink, cook the whole thing to your desired level, then cut off 1/4th or 1/2 or however much proportion want no pink, and cook that end a bit longer?", "YWBTA \n\nDude I prefer medium rare , my friend like well done you know what we do ? Cut the meat in half ? . I never understood the whole “cook meat war” .", "YWBTA- Don’t host if you do not want to play the role of host. Cut it in half, purchase two  less expensive ones or finish some of the meat in a skillet. Don’t be inflexible and unaccommodating.", "Yes YWBTA. Either buy another one or cut the one you have in half. There are hills to die on, but this is definitely not one of them", "Why can't you just cook it to medium rare, take it out, slice off enough for whoever wants it more done, and cook that portion longer? Or divide it beforehand? Or have some alternative meat for them to have instead?\n\nThere are so many other options than to just refuse.", "It's time for you to start thinking about other people instead of just what YOU want and like.\n\nYour wife has been very clear that her family won't eat it if it's medium rare.  Why is your solution \"just nuke it\" instead of adjusting how you'll cook it to medium instead of medium rare?\n\nWhile yes, you can't uncook something, you're being rigid and uncompromising.  Not a good look for a family holiday.  Not a good look, period.\n\nThis isn't about just you.  That your wife is calling you pretentious should tell you something about how you come across on this topic.  Start paying attention.\n\nYWBTA", "A lot of people don't like bloody or rarer steaks. Can you cook two smaller ones instead of one larger rib roast? Nuking a steak toughens the muscle and therefore the steak. Reheating steak makes it less tender. There is a way to immediately gratify that option, though and you'd have to slice the meat very thin and place it in pan drippings and put it back in the oven immediately - as though the cooking process was uninterrupted. \n\nIf its a big deal to the host then I would not seek a well done piece of meat. I'd just stay at home rather than feel like I'm a bad guest. A private home is not a restaurant. I get that part.\n\n But, insisting there is only one way to eat a steak - and that's \"rare,\" is what is causing your problem.\n\n Reheating steak makes it dry and rubbery. YWBTA if you expect your guests to eat it reheated.", "I just cut my mom a slice n flash fry it and shes happy🤷‍♀️", "what you stated as a solution is done in countless homes across the fruited plains NTA!!", "INFO: are you purposely trying to never host your in laws again? seems like a weird hill to die on. they won't be able to eat or chat with everyone else bc they'll be in your kitchen cooking their food.\n\nI feel like as a host you're supposed to provide reasonable alternatives for all of your guests who don't like your personal choices.", "If you're preparing a meal for guests, you should at least try to make what your guests would prefer. Possibly you would have been better off just getting a turkey and saving the prime rib for another time with people who would love it prepared the way you do.", "I'd be less inclined to eat it if it was medium rare and considering that most of your guests seem like they would rather have it more cooked than that... but I like someone's idea of cutting the roast in half and solving the problem that way. \n\nYTA, because sometimes you really need to compromise.", "YWBTA. Get the fuck over the food snobbery bullshit", "This is what happens when you have absolutely 0 critical thinking skills.", "YWBTA. Some people cant stomach meat that's not cooked through, so you'd prefer half the table not eating and throwing away that expensive cut of meat? Meet them halfway and either sear theirs more in a pan or like someone else suggested - cut it in half and leave one in the oven longer.", "You will be the AH. That's just ridiculous and childish behaviour. Learn to compromise.", "Yes. YTA", "My English BIL makes rib roast, green beans and Yorkshire Pudding with gravy for Christmas every year. By himself. It pleases him. But not me, because it's hard to create a spectrum of doneness in a large (and really expensive) piece of meat. And it is generally too rare even at the ends. I hate that flabby,  rare, gross (hey, if you all get your opinions I get mine) texture. Warm pink in the center is fine, and sometimes I can get some, but mostly I STFU and eat everything else. More for them, no? Plus Yorkshire pudding is awesome.", "Why can’t you compromise? Ask if they’re okay with medium, or, like another redditor said, cut it in half and cook one half longer than the other. If you can’t compromise, you’re going to fuck up your relationship with your wife and her family, because of… ribs?", "I agree with your wife. There are many alternatives to insisting on doing it your way. Also if i were invited i would probably casually stop by then go somewhere else to eat, politely decline your offer all together. I wouldn’t eat something like a medium rare roast.", "ehhhh ESH here, asking to cook the whole thing well done is shitty but offering to microwave portions at the end is also crappy and dismissive of her family's taste.\n\nI'd say cook it to your liking and while it's resting just cut off some 1/2 inch slices and put them in a skillet. As you said you can't uncook the roast. I'd be disappointed if prime rib was on the menu and every single slice was well done and it sounds like the majority of people at this gathering prefer a med-rare slice over well done. \n\nKeep the skillet warm in the oven case anyone wants seconds", "Instead of making your guests nuke their roast, why not offer to sear it? Ywbta", "YTA Mr. Host.", "YTA for not trying to come up with a real solution. Microwave it?? How disgusting. Cook their piece longer or in the oven/on a pan after you take the whole roast off.", "Info: Are you living in a country where beef tapeworms are common?", "I'm thinking I just need to give a downvote to anyone that gives a suggestion using the words \"microwave\" or \"nuke\". \n\n\nI have been making Alton Brown's [Dry-Aged Standing Rib Roast with Sage Jus](https://www.foodnetwork.com/recipes/alton-brown/dry-aged-standing-rib-roast-with-sage-jus-recipe-1939502) for the holidays for almost 20 years now. I like it Medium, my wife likes it Well, and my mother likes it Rare. \n\n\nI have always prepared it to Rare, then sliced it and finished each slice to each preference under the broiler, the same way a restaurant would do it.  It's not like you go to the Steak House and they have four different roasts cooked to different levels of done-ness back in the kitchen, they have one and just reheat each slice to the diner's liking under the salamander.", "YTA. You're a bad host since you're cooking to your preferences instead of your guests (and your wife's--you're seriously selfish). It doesn't matter what \"most people in general prefer\"--it matters what the people who are coming to your dinner prefer. You're wife is 100% right here.", "YTA- I suggest cutting it in half and making one med well for those that prefer it cooked that way. If your already cooking it they shouldn’t have to then take and cook it more because the person cooking won’t cook it past a certain point. Because that makes you AH if your not willing to split it and cook one part a little longer when you are already cooking it.", "absolutely not its thanks giving theres most likely gonna be more food they can eat other stuff as my dad used to say \"u dont have to eat everything just eat what you want if you can work it off and you can take it. \" so they can bring well done or better cooked meat if they want no you WIBTA", "Op, cut the roast in half and quit being a weirdo about it. This is not the hill to die on.", "YWBTA. You should cool it all to MR then cook however much they want a bit more. Or alternatively your wife can finish cooking it if you're already doing most of the cooking.", "NAH - Obtain two pieces and cook them to taste of yours and your wife's separately.", "YTA. You’re not the only one who will be eating the roast. If you’re so set on having it your way then either buy a second roast or cut up the roast you have. It’s called compromise and being a good host.", "YTA. Doesn't matter how delicious you think it is if half the guests won't eat it. Figure out a compromise or don't host.", "YWBTA\n\nJust put some aside and cook it more for them. It does not hurt you to do this and everyone is happy.", "Not everyone prefers beef medium rare and the assumption is pretentious. The top comment has your solution.", "You have some options to make several people happy. You could cook the roast to your desired temperature, then cut the two end pieces off and continue to roast those pieces. You could cut the roast in half. Or, if you haven’t already purchased the roast, you could buy two different sizes. YWBTA if you don’t try to find a better solution than just microwaving the end pieces.", "YWBTA. Medium rare is not how most people prefer to have their meat served…it’s not even how your wife likes it! You just want to have it the way you like it…an AH attitude if I’ve ever heard one.", "Ywbta. I cook a rib roast every year. 3 of the guests we invite into our home for the Christmas holiday prefer no pink in their portions. So what I do is prepare the meal to my liking only and make sure to serve people food cooked in a manner they don't like and also condescend  to them about their preferences. \nJk I have my butcher cut a piece separate that i can cook longer because I am a good host. \nDon't invite people if you can't be gracious", "YTA - as a host you have an obligation to provide hospitality to guests who have their own obligations. \n\nYou’ve decided to serve something that you know several of your guests will not like the way you prepared it.  There is an easy way to make it prepared to your guests liking ( cutting part off and cooking it longer) not doing something to easily meet your guests preferences makes you a poor hosts.  \n\nYou are choosing to take a food centric holiday and creating a fight and giving guests a poor experience.  Further all of these guests are from your wife’s family being a poor host to a whole group of people is even poorer hosts behavior.  YTA because you are actively trying to be a bad host.", "YWNBTA. Please don’t ruin an expensive and great roast. You’re absolutely right that the end pieces will be more done. Your wife is being an AH by calling you pretentious.", "Yta.  I eat my steaks rare and get where you're coming from, but it's not just some random person at dinner,  it's your wife and it's Thanksgiving.  She, and her parents, should also be able to enjoy her food.   I mean you're not talking about some side dish that they can just not put on their plate, you're talking about the main entree. \n\nYou don't want to cook it more because you don't want your meat to get tough but you're suggesting that she and her parents microwave theirs which is almost guaranteed to make it tough and rubbery. \n\nYou have 2 options to keep everyone happy. Cook it to medium rare and either pan cook it the rest of the way for them or use hot au jus to cook it up.", "YTA\n\nI get your logic here: \n\n> the solution is clear: you can always cook a piece more. You can't uncook it.\n\nBut this is your actual problem:\n\n>And if that's still too \"bloody\", they can nuke their piece after it's cut.\n\nThat's rude and it's bad form for hosting on a holiday. This is not an informal gathering, but Thanksgiving and if you're hosting it then you've signed up to make the meal. As many others have pointed out, you can compromise by splitting the roast, cutting of a few slices for those who prefer it well done, and just finishing those separately. You should apologize for your attitude, for the disrespectful tenor of your message, and then promise that you will make sure her parents (and others who prefer) a well done slice will get that and you will take care to cook it, but you also want to make sure to have enough roast for those who prefer medium rare so you accept that you've volunteered to take this extra task of splitting the roast on.", "INFO How many people are complaining out of how many people?\n\n2-3 out of 10: yeah, majority rules\n\n2-3 out of 6: you should put in the effort to make sure everyone has something they are OK with", "Use the broiler!! Heretics microwave meat...", "YES", "YWBTA. Dying on a meaningless hill likel this makes you seem rigid and controlling. I don't know what you're gaining by making everyone eat the same exact way you do.", "YTA, extra YTA for your replies", "Just cut it once it is done and cook part more. YTA.", "Yta. Make a small one for them or cook it to at least medium.", "YTA. Cut the meat into two parts. One part goes on the heat a little before the other part. Will it change the presentation at the table? Yes. Figure out how to make each platter delightfully attractive. \n\nYou are the cook. The cook’s job is to prepare food that guests enjoy. You are planning to fail at this. Ask yourself why.\n\nThis is not the way to treat your wife or guests.", "As someone who only eats \"medium well\" due to SEVERAL rounds of food poisoning from supposedly \"excellent\" restaurants (plus one place that served me what was essentially raw hamburger) I will say at least ESH if not YTA. Just cut the darn thing in half and take the one out earlier (or put it in a little sooner).  Do you REALLY want to get into a fight with your SO over how well they want their food cooked? If you REALLY do not want to cook it more give them options other than \"Well just nuke the damned thing\".", "YWBTA because you seem like you are set on considering no other option than microwaving. There are many things you can do to compromise. You can get another (cheaper) protein and cook it well done, you can cut the roast and cook one piece longer, you can sear the pieces to MW after cooking (not nuke them smh)…", "YWBTA.\n\nWhat an asinine hill to die on. Before the holidays no less.", "YTA\n\nYou're so set on making it good for you, but don't care if it's ruined for anyone else by making them microwave it?\n\nJust split off a portion before cooking for people who like it medium well to well done. I mean, that's what my family is doing this year for me to accommodate my new dietary needs, cutting off a portion to season and cook accordingly. Some people might like it more cooked, some people might NEED it more cooked, and I don't think it's your business to ask, \"Hey, does eating undercooked beef give you diarrhea?\"", "This is the winner right here!", "Excellent advice!", "To be fair \"medium rare\" is very much the most common temp. As a server I probably took thousands of steak orders and this was far and away the most common temp. The second is medium. The remaining 5% are mostly rare, then a sliver of \"well done.\"\n\nThat said it's not hard to cook a few pieces to well done after carving.", "I don’t disagree with your comment but the thought of microwaving meat made me puke.", "This is how a good spouse thinks.", "He literally offered to cut their pieces and cook those longer but make the majority cooked properly for the rest of the group— how is that any different?", "this is also my suggestion....cook the roast to your preferred doneness , allow it to rest a bit then take off a hunk to cook longer either back in the oven or in a cast iron pan stove top...there is more cooking for the host involved but THAT should show the others that you have taken their preferences into consideration too.", "He said they are lucky to afford the roast this year so I doubt they can afford 2.", "guessing he doesn't like his in-laws at all or wants to make sure they never come back.", "Don’t cut it in half OP!!! You will easily ruin the entire roast. Use a cast iron skillet after the meat has rested to cook the MW/WD pieces the rest of the way.", "Bad suggestion, making half roasts is a lot harder then full roasts, specially the well done ones. You can do it, but takes a lot more skill, anyway the well dones always taste better taken from the oven at medium rare and pan seared.", "This is the way.", "By the sounds of it (and correct me if OP has posted it elsewhere) there’s more people who will enjoy it cooked to the traditional standard so by this logic there would be even less people to host next year, assuming everyone is as immeasurably petty and a poor guest as you predict them to be. \nKnow the mark of a true asshole? Unwillingness to compromise. OP has been on the losing end for years, is genuinely excited about sharing this with his family (otherwise he would’ve saved it), is working towards a compromise where everyone gets what they want, and is making a reflective post to find out if they are in the wrong. OPs wife’s single solution is to just do it her way. In what world is he the asshole for not catering ENTIRELY to three people.", "Wtf? 'Get the chance to host' I'm Australian so we don't do thanksgiving dinners but is it a once in a lifetime opportunity or something?\n\nTo be quite frank, as a guest I wouldn't be expecting a say in the hosts cooking let alone be peeved at them enough to never go to their house for a dinner again.\n\nThis isn't an argument about meat. OP has offered his wife several good compromises and she's continued to disregard them then started on him aswell. My in laws like their food well done, they cook it well done at their place knowing I don't like it. That doesn't bother me, their house their rules.\n\nEveryone could have been happy here but his wife had to short sighted and annoying.\n\nNTA.", "Why are you assuming more people would want the well done than perfectly cooked?", "throwing someones piece in a butter basted pan to sear it to their liking is an accommodation and what OP said theyll probably do.", "Have you ever tried using a sous vide for turkey breast? They are a little expensive (we got one as a present) and while we don't love it for everything man it does an AMAZING job cooking lean cuts of meat.  We started buying turkeys the day after Thanksgiving for like 49¢ a pound butchering them down, vacuum sealing (sometimes shoving some herbs and oil inside before closing) and then freeze them. You can put the frozen piece right into the sous vide and I will never eat turkey breast any other way. *Chef kiss*", "You *can* actually make good turkey, even though its overwhelmingly represented by awful dry specimens. Last year we brined the whole bird overnight, dried it off, and brushed the whole thing with garlic rosemary butter under the skin and basted it attentively while cooking. It was incredible. The breast meat was so juicy and flavorful. We had these carrots on there that cooked in the pan drippings too. It was so worth the effort.", "Actually, make one rare roast.\n\nAnd make another in a form that is really, really good well-done, such as braised in a delicious sauce. (This can be done wonderfully with a less expensive cut of meat, that will tenderize with the cooking.)\n\nMake extra of the braising sauce, and it can be gravy for the rare roast.", "We throw whoever likes theirs done more on the preheated gas grill.", "My mom is just like the parents in this story and doesn't like her meat \"bloody\" so she literally will just microwave her meat since the rest of my family prefers it rarer than hers, and it only takes a minute to nuke. She likes it so I didn't see an issue with the microwaving suggestion from OP.", "My unpopular cooking opinion is that Steak Guys are the worst. We get it, you have a sous vide. \n\nIf you can only make a piece of meat taste good at medium-rare, you aren't the cook you think you are.\n\nAnd I like medium-rare.", "I think you’re fine. Maybe just cook their pieces on a pan instead of putting them in a microwave. It’s not that big of a deal and if only a small amount of people like their meat well done then it’s fine \n\nIf everyone wanted it well done, then there’s an issue. You cater to the majority not the minority", "I they may actually LIKE roast just cooked to their level.", "I’m more of a blue turkey guy myself", "Ah like yourself then? Because unless you have very specific temps for every cut of meat that you consume then you are also eating your meat wrong. The amount of people that don't know ribeye is supposed to be medium in order to render the fat enough is staggering for example", "2 roasts is your solution? Talk about high maintenance, this is a multi-hundred dollar piece of meat! Searing individual servings is definitely the best way to do this.", "Why? Prime rib is a great fancy buffet food! It’s made in bulk and there’s usually a chef slicing off pieces for people.", "Usually if they have prime rib at a buffet it’s from a carving station, not sitting out in a tray. I don’t go to buffets often, but when I have, and they’ve had prime rib, it’s been pretty decent. They’ll even ask how you want it cooked and find you a slice accordingly.", "More people on this sub need to take Hanlon's Razor to heart. I get where OP was coming from and didn't even consider a stovetop solution. NAH if he goes with that.\n\nEdit:\n\n>\"Do not attribute to Malice that which can be equally explained by Ignorance.\"\n\nAn important distinction here is that does not encompass *willful* ignorance, that's just another form of malice.", "I saw a similar thing on another post yesterday - the OP was being really respectful of the fact that he needed to make changes and was accepting feedback from the comments. And someone yelled at him to grow up in one of the top comments. Like, can we not be AHs ourselves in responding to the people who are actually trying?", "But there are 10 people and only 3 want it well done.", "Discussion aside - I don’t get all these comments about microwaving meats.\n\nDon’t people grill it in a cast iron pan?", "I've seen a few comments by OP and hundreds of comments saying OP already accepted the roast+pan solution, so where is the resistance?", "Tartare that shit.", "THIS is the answer! Cutting an expensive roast in half, and cooking half correctly, and cooking half incorrectly, is NOT the answer. ALWAYS cook as the food itself dictates. Get them a lovely chuck pot roast, and braise it in the Crock-Pot for 6 hours. It will be delicious. Cook a standing rib roast AS IT SHOULD be cooked. These are not interchangeable.", "That's awful. My husband likes his meat well done, always. And I like it bloody, so guess what? You cook it like the other person likes it. He can cut the roast in half and do them separately in the oven. It's not that difficult.", "If you can't cook a piece of meat well done and have it still be good, you're not a good cook.", "My Dil always says wave a match over it. Which is basically what my son, a physician, usually does. When she has been pregnant he has insisted on medium rare.", "Thanks! Plus lots of folks don't know the roast actually keeps cooking when it's held at MD rare temp in an alto-sham (warming oven-- its why your plates are hot when you get them at steak restaurants)\n\nA roast that comes out medium rare and is kept at that temperature would end up around a medium within a couple hours if it waited at temp that long.", "As a home chef I was worried how far I’d have to scroll before someone who knows wtf they are talking about piped in. Thank you for being the voice of reason. This is how it should be done. NTA", "Reasonable response.... too many folks in here spouting out on how to cook with no idea of the science behind it.", "I guess it's often because people react before there are updates.  And I can understand that a lot of people read the post and were put off by the attitude they perceived from it.  But, to me, he DID sound at least a bit like he was open to compromise / suggestion.", "No. The “cooked less” always wins. Because you can always cook part of it more, but you cannot UN-cook it.", "Why can't he make a small portion well done?  Just leave it on longer.  I like mine well done. My husband does not. He cooks mine longer.  Really not that hard to do.", "Every chef knows that the only right way to eat turkey is frozen and raw. Anything else ruins the flavor. That's what Ramsey says!\n\nIn fact, in trendy warehouse pop-up bars in Brooklyn they will throw you out on the street if you even suggest eating it without the feathers on.", "I went to a restaurant once and asked for my steak medium well. The waiter tried to convince me to get it rare because the chef would be offended by my choice and he didn’t know if he would make it.\nI told him that I was offended already that they were trying to force their choice on me as I would be the one eating it, but that if they had a problem with that I could just go somewhere else.", "It's pure pretentiousness.  \n\n\nI used to eat my steak medium or medium well. Now I eat it rare or medium rare. My tastes have changed, both were good.  \n\n\nBut the elitism of steak eating (it doesn't count unless it's pink), coffee drinking (how dare you put cream or sugar in), etc. has always confounded me. How are your tastebuds affected by what someone else ingests? Get over yourselves.", "Exactly it grosses me out to have my meat pink at all but I can still Tell cheap from expensive ywbta", "I like medium rare steaks and most things, but I also understand that there's a huge difference between a quality cut of well done versus a cheap cut of well done. If you're investing in a good meat, when it's well done it should still be soft and tender. It should also still be juicy. It might be cooked more than I would like, but the inside should still reflect the quality of the cut. \n\nThe outside might be more crispy and it might shrink due to cooking it as much as it is, but it doesn't destroy the quality of the meat. If you're eating sand when you cook a cut of meat well done, you're doing it wrong or it's shit quality.", "> Get over yourselves and your weird meat superiority.\n\nTHANK YOU\n\nAs someone who likes their meat medium-well and well-done, I'm so damn tired of this bizarre ass need so many people have to prove how much better they are just because they don't eat their meat that way\n\nSeriously, grow the fuck up", "Not as many downvotes as I would have expected.  Let me try.  People who claim cooking meat well done \"ruins it\" don't actually know how to cook meat.  Nothing to be ashamed of there (unless you are a professional chef at a steakhouse).  But it is time to admit that you can't actually cook very well and you are getting around it by not cooking the meat.", ">It doesn’t matter how much it’s cooked, you can still tell the difference between cheaper and better cuts.\n\nCheap vs expensive meat do in fact, not taste different. In my meat class in high school we ran a taste test of prime vs choice. The different between grading is the marbling in beef. Pork it looks at marbling and coloring.\n\nWhat is the main different between grades? Marbling. What is marbling? Its the fat in the meat. Fat contains more moisture than the lean. With this in mind...\n\nLets take a few roast some choice some prime, and they are ALL seasoned the same. The different how they are cooked. The well done will cooked out more juices  than their prime counter parts. \n\nThe reason why a well-cooked cheaper cut isn't as good as a more costly cut, does in fact depend on how it is cook. Because of how DRY it is going because you are cooking all the moisture out. \n\nIf you cook it in such away both have good amount of moister, there isn't going to be a different taste.", "So here is what I have noticed. It seems if you want well done you get charred or dried out. Which is not well done. You can get brown in the center without drying out the meat.\n\nBut, weirdly enough, i hate chared or burned but I occasionally want dried out. My dad was able to do dry without burning and while i don't always want tthat, on occasion I feel nostalgic and do.\n\nHowever,  I am totally able to have brown in center without burning or drying meat. So why everyone thinks you have to turn meat to burned to get well done is beyond me. Maybe some specific cuts, and certain sized roasts you can't. But moist, tender and brown is possible.", "Meat snobs are wild. Probably not the case here but some people need meat and poultry cooked well done for medical reasons. Just let people eat things how they like to or need to, sans judgment.", "Can I be your friend?", "Yes, I feel like this is too low. It needs to be higher up! Cook to taste in a pan please!", "A decent quality rib roast is $20 per pound, including the bone weight! A reasonable size roast is about 10lbs, so that's $200 right there. And they're already at perfect cooking size, because a 6-8 rib roast will get you a range of doneness. The middle pieces will be on the rarer side of medium rare, the outer pieces will be medium to possibly medium well, depending on cooking style and size.", "Research is an amazing thing.", "That's what I meant.  Wrote the comment sitting at the food stand thingy at Costco so didn't write exactly what I thought.", "Yet the wife doesn’t have to respect the opinion of the husband (the latter who’s doing most of the work cooking I might add, which is a hella lot of effort for Thanksgiving), or the rest of the guests and OP’s family? Your biasedness is showing. \n\nOP is NTA, wife can ask for her preferences but she has no right to demand it when it’s not her putting in the effort.", "Is this case the cooked less is also the majority, so either way cooked less wins. :)", "You can’t really cut it before cooking without compromising how good the meat will be (a bigger cut is in the oven for longer so cooks better than a small cut, basically).\n\nBut yeah he could cook it all medium rare then cut the ends off which will be the most well-done and cook them a little more. Just is a bit more tricky and the well done people might end up not eating at quite the same time, which is a bit rubbish.", "Meh, don't like it don't eat it. This ain't burger king.", "Im a med rare girl, but when I fuck up and overcook a filet, it's still edible. Overcook a sirloin and it's basically jerky.", "Flank steak and skirt steak (inexpensive cuts) can taste good on the more cooked side. Filet DOES get worse when you overcook it.", "Yeah, I really don't like anything other than medium-well. I don't like the taste or texture of it. I used to always get beef well done, but then I realized medium-well is a nicer compromise since a lot of places don't do well done properly. Medium to rare, though? I can't eat it. Makes me feel ill. The snobbery and entitlement of some people on this thread is blowing my mind. How do some folks not understand that the taste of food is \\*subjective\\* and not a fact of life? Telling people they are \"objectively wrong\" for liking food to feel and taste a certain way. What a ridiculous battle to wage lol.", "I've accidentally cooked ribeyes well done before when I was learning times and ways to cook it. It was still very tender and juicy everyone in the house still enjoyed them. When I had ny strips and accidentally cooked them well done they were very tough and dry. I could eat Ribeyes well done or not because of the fat keeping it tender still", "Then why would you expect anyone to nuke their meat if it is under done to them? If you pay a lot for the roast, then you should want everyone to enjoy it. Nuking it would ruin the roast. Do better", "Sure! Last year I made beef wellingtons 😁", "Yeah, I think it's really rude to make guests aware that you're disdainful of their eating preferences and \"just nuking\" something makes that pretty clear (and I could hear the disdain in the post, so I assume his wife could hear it in person). I don't like meat and especially will not cook it (disgusting process in my opinion) so I have no idea which way is \"better,\" but it seems like it shouldn't be that hard to cook some of the meat longer than the other meat.", "It hilarious that the raw meat carnivores are more judgey about how people eat their food than devout vegetarian Hindus.", "Don't roasts usually need to sit for a bit anyway? While it's resting can cook their pieces a bit more.", "I would grind up that raw sirloin and make a steakburger.", "I greatly prefer more beef medium rare but I'm also a shitty cook so I frequently overcook. Overcooked expensive cuts are vastly superior to even properly cooked cheap cuts, it's not even close.", "Agreed. When I was pregnant, I had to eat steak well done, so I stopped eating it. It just wasn't worth it.", "An expensive cut, cooked expertly and rested will taste great at any level.  Well done does not mean tasteless, chewy, tough or dry. \n\nWell done can be tender and juicy!! \n\nOvercooked is when it's like shoe leather.  \n\nMy preferences change depending on the source, cut, method of cooking,  if it's marinated, size and so on.  \n\nIf meat is cooked until *just* well done,  it's still succulent.  \n\nIf meat is cooked until well done,  then left on longer \"because it doesn't matter, they want it well done\" or \"well done means leaving it on for triple the time,  right?\" then of course it's garbage.", "This is when you get petty. Have him cook it. Take a bite and spit it out. Lick all over the steak so no one else can eating it. And since you don't like medium rare, it goes to waste. See how he feels lol.", "Wagyu brisket is not a cut. Brisket is the cut, wagyu is basically the grade (yes IK it’s a breed). \n\nWagyu anything is more expensive but it doesn’t mean a cut a meat is suddenly a different cut of meat. A brisket is a brisket. You’re not going to cook it like a steak because it’s Wagyu it would be chewy as all hell. \n\nYou treat A5 Wagyu New York strip like a prime NYS. You treat brisket like brisket. \n\nQuality of cut != type of cut.", "In my experience expensive steak places cook their meat less well-done than regular casual dining restaurants. So it makes sense that people order medium in a nice restaurant where medium is often still pink all the way through. Rare is usually red and cool in the center, medium rare is red but warm in the center. Most casual restaurants you’re lucky to get pink all the way through for rare. That being said the OP is saying he wants to cook the center of the roast to medium rare and the ends will still have some well done meat. Which seems reasonable. You can through an under done piece of meat into a pan to cook it more. You can’t uncook something that is over cooked.", "In fairness, plenty of people will also order higher levels of doneness out of health concerns, regardless of taste preference.", "all the people out here not realizing you can cook a piece of meat \"well done\" without drying it out its a matter of technique.  sear all sides in a pan and cook it slower at a reduced heat.", "Yes but it has to rest before you cut it. If you cut it before you rest it then as the moisture will come out, so would severely impact the quality.", "Exactly. The level that a person likes their steak cooked to is an opinion, not an absolute.  \n\nI can say the best color is turquoise blue, but you may prefer aqua, charcoal, or red-orange. We can all have our opinions, and none of them are wrong.", "I’ve never associated well done with succulent. Ever.", "This is ridiculous. Knowing which meats can be cooked to well done and which can’t is part of being a good cook. If you want meat that is well done, it’s better to get a cheaper cut because they have a lot of flavor and can be cooked low and slow without over cooking. Like a chuck roast. Think of a flavorful pot roast that is moist and fall apart tender. You cook that same roast to medium rare in an oven and it is going to taste tough and chewy. But you can absolutely ruin certain cuts of meat by over cooking them. Filet mignon and rib roast are both that sort of roast. A big part of being a good cook is knowing the difference between the two.", "Look, I am a well done-er myself... though I'm now fine with medium-well, and can tolerate medium if it's a lower fat cut. My husband's family are all rare to medium rare people. So I fully get how annoying it is to have rare-ers insult your meat taste like it's a character flaw.\n\nThat said, they are not really wrong on the facts. Cooking more does cook out more fat... and fat does chemically hold juiciness and flavor. Most flavoring molecules are fat soluble.\n\nI avoid under-medium meat for a texture aversion. But I cannot deny the fact that in so doing I am in fact physically excluding some of the flavor that would be there if I cooked it less. Let's just have the humility to admit although it is not our preference (for whatever reason), lesser cooked meat objectively retains more juices and flavor molecules.\n\nIn other words... they are not wrong, though they can be jerks about it.", "Except it’s literal science. \n\nCooking meat dries it out and fat escapes. The longer you cook the more this happens. Muscle fibers also tense up, that’s why you rest meat to allow them to relax. \n\nHow is meat graded? By intramuscular fat content. The fat keeps the meat tasting moist even though most of the water is gone. I’m not going to factor in aging meat on the hook as 99% of people can’t control that. \n\nCooking something to well done is basically dropping it a grade because you’re losing that much fat content. \n\nPrime becomes choice, choice becomes select, etc. \n\nIt’s why if you cook the same cut of beef to medium rare and we’ll done; one will be juicier and more tender than the other regardless of grade. \n\nYes you can tell the difference between well done prime vs well done select grade meats. You’re still lowering the quality it is graded and priced at by cooking it well done.", "I guess Michelin star chefs have no idea what they are talking about...", "Well done meat literally has less flavor than medium rare there is no debate. The longer you cook it the less flavor it has. No argument to be made.", "Actually cooking a steak to well hardens the muscle fibers and burns off all the juice, which is what really flavors the steak. It does have less and even different flavor. If that's the flavor you prefer, more power to you, I'm not gonna judge what flavors you like and don't. That being said, it absolutely does taste (objectively) \"cheap\" because it changes the flavor and pulls the majority of flavors out.\n\nWell done steaks also require an internal temperature that releases more heterocyclic amines which cause cancer. All red meat causes cancer, but cooking it to well puts you at a higher risk of getting those cancers.", "Find me a chef that cooks red meat well done. I challenge you.", "I dont know if I'm a good cook, but I've learned to just keep adding the juice on top of the steak and my husband likes how it tastes at the end (he likes it well done). That's what matters", "[https://www.snakeriverfarms.com/gold-grade-wagyu-brisket.html](https://www.snakeriverfarms.com/gold-grade-wagyu-brisket.html)\n\nThis is not cheap and definitely not 7 or 8 bucks a pound!", "Where are you that wagyu brisket is that cheap? Brisket in the northeast is far from cheap in my experience. Even Costco is $5-$10 per pound for prime.", "I think it's even funnier because OP likes turkey. You know, meat you have to cook to well done or you risk salmonella. Is all turkey or chicken dry because it's well done? Not if you do it right! Yes, beef and poultry are different and need different tactics. But if you know that you can cook a bird and it still tastes good, why does that general concept not apply to beef?", "Next time, try to cook it to medium rare over a longer period of time, it's hot enough to render the fat but it needs more time", "Ah! I didnt realise that was why it needed to rest but makes sense! Yay to learning!", "Exactly! It's an opinion and not law. Otherwise there would only be one way that restaurants would cook steaks and there would only be turquoise and no aqua or teal or mint.", "I've always been a medium rare girl and my husband is a blue rare gentleman. When I got pregnant for the first time I couldn't handle my meat anything but like super well done. Used to break my husband's heart to have to cook it like that but took a couple of years until I was able to finally get back to my flavor of medium rare.\n\nIt's like my pregnancy just changed my ability to handle meat it was very strange. So I went from medium rare to well done and then down to medium well medium and now I'm back to medium rare", "Your basically proving their point. If they like meat well done the best testing well done meat will still be the highest grade.\n\nMy husband eats his meat well done, hates medium  rare but he can tell the difference between a good cut and cheap one. \n\nI eat mine medium rare and his doesn’t taste as good to me as mine does, just as mine doesn’t taste as good to him.", "What you're saying is that if you want it well done you should actually get the pricier meat.", "The method you use to cook the meat — covered, uncovered, basted or marinaded, low-and-slow vs high-and-fast — also affect how much it dries out, etc.  If you treat \"well-done\" as just \"exactly the same method, but for longer\", then *of course* it's not going to taste as good.  Because **you're a shitty cook**, who didn't adjust properly for the intended final result.\n\n&#x200B;\n\n\"Well-done\" meat cooked properly can still be moist and tender.  \"Rare\" meat cooked poorly can still be dry and tough.  Stop trying to blame someone else's preference for your own inability to cook meat to that standard.", "Sure, a prime well done is going to tase better than a select well done, but they are going to be a lot closer to each other than the same two pieces cooked medium rare.", "If you're cooking a nice cut to well done then you don't know how to cook", "Or any chef, for that matter.", "Chef Ramsey expects his chefs to know how to prepare well-done meat properly.", "I’ve had well done steak and tenderloin in many fancy restaurants is and they were not hockey puck. Cooking skill is the reason.", "I'm pretty sure he would cook it how the customer wanted", "Whenever someone equates well done to a hockey puck it just confirms they have never had something well done. It's not the same as meat sacrificed to the gods.", "I never liked eating steak because my parents insisted to cook it till it was extra well done and basically rubber. Didn't matter the cut of the steak.", "The temperature you cook a steak is directly proportional to the loss of moisture in the steak. This is demonstrably true. Of someone likes well-done, then that’s fine by me, but well-done is objectively dryer than medium or mid-rare.", "Snake river is trash that supplies meat to Safeway. It's over priced. \n\nFind whoever supplies your local high end wagyu-serving restaurants.", "Costco is 4.99 for prime. You can get wagyu for less than 10 if you can find a local wagyu farm or packer. \n\nIf you can look for a local restaurant that sells wagyu and find their supplier, you're golden. That's how I got my supply of bulk wagyu", "Though the 'it's not blood' is something that has always somewhat peeved me.\n\nThe thing that makes blood red is haemoglobin, a protein that uses iron to bind and transport oxygen.\n\nThe red in rare meat is caused by myoglobin, a protein that uses iron to bind and transport oxygen.\n\nSure, there's a lot of other stuff in blood, but it's not mad for people to be grossed out by rare meat.", "To everyone arguing with you: And it isn't just \"blood\", the beautiful marbling you're paying a premium for all finishes rendering by medium. Going past that literally cooks the flavor[yes, the fat] right out of the meat into the pan. Rest it all you like it isn't going to turn flesh into a sponge. \n\nThere is 0 reason aside from conspicuous consumption to select something so expensive and cook the upcharge and taste out of it. None. And if you do it on someone else's dime you are the ah and you better expect the disrespect you're bringing to be returned to sender.\n\nTo OP I suggest you split the roast in half, ruin one to keep the peace, and never do beef again for that side of the family. Not unless they are buying. Make it a hard rule and you won't have a yearly resentment quota to manage within your marriage.", "OP says he prefers beef roast to turkey - in the comments he actually says he doesn’t care for turkey", "Its 100% about the cooking temperature. If you cook your turkey to 150-165F (ideally let it rest at around 155 or so) it will be nice and moist. If you cook it past 165 it will dry out no matter how much brining and basting you do.", "It was actually a long reverse sear at like 225. Forget how long, but it was long", "Yta. How would you feel if you got served rare chicken?  disgusted and upset? It the same for people who don't like raw meat. Just cut it in half and cook the otherhalf longer. Microwave meat is rubber and gross.", "YTA. You’re enforcing your personal views on a meal for everyone.", "As others have said, split it and cook one medium rare and one medium well.\n\nI eat my beef blue rare mostly. I get it. However, not everyone does. And that's OK (their loss!). So, make some medium rare to rare and make some medium well to well done. Everyone will enjoy.", "NTA! Heat up a pan of au jus and you can put their sliced in it to overbook them like they want. Well done on a $100+ roast? No way, man!", "I love that you offered a solution that would work really well! I hope OP sees this.", "Why would the guests me microwaving their meal? Totally lost, is this a thing that Americans do on thanksgiving?", "Finally someone who has actually cooked meat before comments. \n\nThis is one of those “you can’t put the toothpaste back in the tube” moments. \n\nYou can overcook meat. But once it’s done, you can’t undo it. \n\nOP can cook it properly, and then cut a chunk off and put that back in the pan/broiler if his in laws like meat to be dry and miserable. \n\nEveryone is happy. \n\nDestroying the whole roast like the wife wants is not only wrong from a culinary perspective, but also stupid. \n\nAs long as you know in advance, holding a portion separate is easy. But you don’t hold the entire family hostage because aunt Patti feels weird about butter in the mashed potatoes. \n\nOPs wife is clearly uninformed about where the kitchen is in the house, let alone knowledgeable about how to boil water. \n\nI don’t think she gets a say in what is served.", "How does pan searing ruin the flavor of a steak? That’s how you cook a steak. Who bakes steak?", "As all the professional chefs in this thread have said, halving a rib roast is not a good idea. Least of all because the bones are use to stand the roast so the low heat can cook it evenly and allow the fat cap to melt in. I’m guessing a bunch of the commenters have cooked a sirloin roast at best. Cut the pieces for well done off and stove top finish them with some of the drippings.", "this is really the worst idea of all of them. cuts down on the amount of meat available for the majority of the guests when the end pieces are gonna suit the purposes of those liking a more well-done steak just fine.", "Guests demanding a quality cut of meat cooked to a ruined temps are TA", "He's totally NTA, anyone who wants a medium well or well done steak can stick to their dinosaur chicken nuggets because they're acting like a child with food.", "7 people want it medium rare\n\n3 people want it well done\n\nHe is graciously hosting the majority and stating that he will provide the option to cook the meat that he is paying for and preparing and serving in his home to their preferred doneness\n\nYou, commenter lad, are the asshole", "I hope so, too. Paying it forward!", "You can't take egg back out of a dish that was supposed to be vegan.\n\nYou can't remove peanuts from the dish that was supposed to be for someone allergic to peanuts (what the fuck does \"allergies real or not\" mean btw?).\n\nYou cannot make food raw that isn't raw.\n\nSimilarly, you cannot remove heat from meat once it has been applied.\n\nYour examples are all limiting. Every single one of them have requirements that reduce the total pool of what they can eat.\n\nThe three people in the OP on the other hand have a request that would *further process* what is being served. Their needs are *beyond* what is being served. Their needs are **additive**, not limiting. They must add heat literally, the same way people add hot sauce to their food.\n\nIndividuals can add meat and egg to the vegan fried rice from a separate bowl. Can even add peanut sauce to their own bowl, depending on the severity of the allergy. Could, I guess, eat of the dishes meant for the frutatarians raw food people, if they pleased.\n\nThey could not obtain med rare meat from a dish that has been served med well or well done. They could however cook individual portions further.\n\nI hope this difference in accommodation policy is more clear.\n\n*********\n\nSeparately, cooking beef well done, as far as i understand it, is a relic of fear-driven behavior from the great depression era. It is necessary to cook chicken well-done because of, idk, parasites and shit? Same goes for pork. But not beef.\n\nIt was explained to me in a really swell reddit comment, or firefox pocket article or something, that many people would cook their beef to well-done for fear of wasting it due to not being able to afford to replace it if it got messed up during cooking. \"Just nuke it to make sure\" type of decision.\n\nI'm probably butchering (ha) this explanation, but the bottom line was that it was a combo of not knowing better (that it doesn't get you sick if you if you eat it med rare), and being poor as fuck because it was the great depression, and consequently favoring the for-sure way (well-done).\n\nSince you and everyone else like just about everything you eat because that's how your mama made it, and she makes it that way because that's how her mama made it, *et cetera*, that's why some people like meat well-done today and some people don't, and why it's so violently divisive.\n\nYou could interpret that as \"people who like med rare meat had rich ancestors and people who like well done meat had poor ancestors\" and a fella does wonder if there's a correlation there, but i'm 99.2% sure that would be an incorrect conclusion to draw.\n\nIt's more like that some people just preferred their steaks different to how their parents did—like, I'm sure you're about to write, how your mom prefers hers rare and i'm therefore a valueless moron with nothing to add to the discussion.\n\nThe point here is that cooking beef well-done, unlike with chicken and pork, is not necessary from a food safety standpoint. With chicken and pork we don't have options (unless you eat chicken sashimi like a moron), and with beef we do. Guess I said a lot to say nothing, what else is new.", "Turkey breast is *more* dependant on temp than any steak.", "This is the way — you can just cook their slices a little more. And honestly their medium well slices will taste so much better.", "Amen", "Microwaving for extra doneness is just a lazy solution. I don’t think there would be any issue if you suggest pan frying her parents pieces up to their preferred doneness", "Try sous vide on your turkey breast this season! It may change your life!", "And if the guests like dark meat better because they like flavor, you can just get some legs and roast them.", "My mom's ex boyfriend, an actual graduate from the Culinary Institute of America, served turkey that was running pink one Thanksgiving. I was horrified and refused to eat it, or let my children eat it. I was pregnant with an 18 month old and a seven year old. Nope.", "Agree! Whenever I make a rib roast and have guests who prefer more done, I slice off a piece and “finish” it in a skillet with au jus.", "It’s not nonsense. It’s not pretentious. It’s not “meat superiority” as someone else said. Cooking meat well is OVERCOOKING it. That is not a subjective opinion, it is a fact. You’re allowed to prefer your meat this way, but it’s still *overcooked*. Get over it. https://www.tastingtable.com/901798/why-overcooking-steak-is-a-bigger-mistake-than-you-think/", "Yep.  And I would add: learn to cook the cheaper meat before you trade your house for some meat at the butcher.", "Well that’s dramatic as fuck. If they would actually cut ties with OP because they “had to” microwave their food(so challenging, such a big ask!) to their preferred disgusting consistency- well they’re not worth having around anyway. How precious do you have to be to hold that against a host? \nGood riddance.", "What makes you think he even wants to host every year?", "Wow your baby was in there for an extra 9 months! That’s crazy ;)", "Can you tell us more? What was his defense?", "Finally advise from someone who knows how to cook!", "Thank you. Faith in humanity restored.", "For gods sake, don’t let them microwave it. At the very least you should cut off the end pieces for them and chuck them back in the oven while you let the roast rest and then get cut so their pieces are more well done the way they like without having to essentially have them finish off cooking their own meal. I don’t understand how you don’t see that this isn’t a nice hosting thing you’re doing, making them finish off cooking their own meal just because you disagree with their preferences.", "no, she was having twins duh!", "Because you're demonstrably wrong. High quality steaks are more tender; tenderness is directly related to cost. There are instruments to measure tenderness (basically measures the resistive force to push a spike through the meat). The more a steak is cooked the less tender it is.", "steak always gets Reddit to be /r/iamveryculinary even if its just a preference, they act like its the end of the world", "I'd give you all the upvotes if possible. I hate when people act as if food is \"ruined\"....  \nAlso to add to your point of people still being able to tell the taste for what OP said about \"nuking\" the food after it's done. That taste is also different than if it's just cooked in one go... Once you finished cooking it and start serving, if you get it back in to cook it more it becomes dry, it's also not nice to serve food and have others eating before everyone else just because they have a different preference to how they eat their meat... or is OP gonna make everyone else wait and let their meat get cold while the rest are doing theirs some more?   \n\n\nSuch a dumb hill to die on... And the only \"ruined\" thing I see is not the meat but his relationship...", "Always so weird how people get demanding and insulting about how *others* prefer their meat cooked, isn’t it? Couldn’t be more literally a matter of *personal taste*. Zero objectivity to it.", "Wow, reading through all the shitty replies you got has changed me. \n\nI’m a medium well lady. I’ve eaten it rarer (because of the rare meat purists). It tasted like fatty protein jello, like eating straight butter but with that heme-iron taste. It was one of the grossest flavors I’ve ever eaten. IMO steaks can be “ruined” by undercooking them.\n\nThe amount of people that are like bUt It’S sCiEnCe that meat only tastes extra good because of the fat content. They are shocking to me.\n\nYou’re so right that people should eat food they personally think tastes good. I don’t know why that isn’t everyone’s opinion.", "how dare you enjoy your meat differently than me? your decision literally has zero effect on me and does not negatively impact anyone in any way but it offends me because i don't like it", "I agree. I prefer well done, or as I like to say \"I want to make sure it's dead and not gonna crawl off my plate.\" I have learned to be okay with medium well, but why be criticized for your choice? Like you said, those of us who like, have no issues with it.\n\nReminds me of an episode of Guy's Grocery Games that I watched a while back. Chef cooked some kind of steak, and it was pretty red, like juicy red. The judge told him he overcooked it. I mean, any less cooked than what it was, it might as well have been raw. That's the kind of thing that has you going \"wait, what?\"", "Yeah if you do this definitely NTA at all. I can understand why someone might be a little miffed at nuking it instead since that's different than well-done. That's a dry piece of meat-flavored leather.\n\nAnd I'm sure with the sear, it'll be extra caramelized and delicious for your in-laws. This way everyone gets to enjoy your cooking and I know for me that's the best part whenever I cook a big meal!", ">Why can't he make a small portion well done? \n\nI think that's what OP's offering by saying they can have the more-cooked end pieces.", "There's also the fact that it will only be enjoyed by some of the group.  Kind of like the wife and her family, I do not enjoy roasts not done to my preferences, i just prefer the rare side of things.  If they were vegetarians, it's simple enough to have a second main dish, but in this case, cooking the roast well done means something more akin to \"now the whole meal must be vegetarian.\"  Better to figure out how to get a portion of the roast to well done than the whole thing.", "I cannot eat meat that is that undercooked. It literally makes me feel ill. I'm sure some people would argue that's because I haven't gone to \"good\" or \"high quality\" restaurants, and they're probably right, but I just don't have fancy restaurants where I live. It's rare (no pun intended) for me to go to a super expensive or high end restaurant, and even then less cooked steaks just never taste very good to me.\n\nThere was only one time I had steak that wasn't cooked all the way through that was still delicious and that was when my uncle cooked it for me and my cousin. He obviously knew what he was doing and I didn't have to pay a lot of money to get a nice steak!", "Once had to send a steak back because it was that pinkish-purple in the middle when I eat it medium-well. The waitress said she take it back and warned me that the cook might get shitty about it. Steak came back crispy and black. Waitress comped the entire table.", "I find it funny when pretentious assholes act like their way is the only way to enjoy things, and they end up criticising super tasters. Put coffee in front of me and I’ll tell you whether it has notes of cherry or toasted grains or an earthy flavor, but that also means me and my freakish number of tastebuds are gonna need some milk in that dark roast made for people who need their beans halfway to charcoal in order to taste something. It’s like being angry at people who really like cilantro or hate the stuff - it’s genetic! You can’t be a snob extra hard at someone and get them to like something that tastes like soap, and if someone likes herbs you don’t like, who cares? They eat their stuff, you eat yours, everyone can be happy.", "I’m with you. Tastes like blood and I cannot handle the texture of medium or less done steaks. I prefer the texture of my steak to be farther away from the original state it was cut off the cow.", "Thank you!  I, too, know that it's not blood, but that doesn't change the fact that it tastes utterly foul to me.", "I’ve had plenty people at the place I work at order well done steak", "People who can’t cook well done always have a problem with people who eat it. If you can’t make something well done without turning it to charcoal you’re doing it wrong and just say that lmao. Good well done steak will still be tender. & yes. People do barbecue expensive beef lmao wtf", "Damn meat is expensive in the US, can get 5kg(11lbs) of angus prime rib in Ireland for about €80-130, even the dry aged prime rib is less than €200.", "He also already suggested letting them eat the ends.", ">the well done people might end up not eating at quite the same time, which is a bit rubbish.\n\nSo now we're back to the 3 people ruling over the other 7. The would literally wait like 15 minutes. Just put some foil over the medium rare and sit your ass down. This shouldn't even be a post in the sub. It's so obviously easy to fix the situation.", "If the meat has been properly rested before serving then it won’t be bloody, it would be pink in color but no blood. Sounds like people who’ve served you medium rare have not rested the meat", "that’s literally what he’s suggested and people are calling him the AH anyway", "It’s only relatively recently that brisket has become ‘expensive’. The reason it is slow cooked is because it is by nature a much tougher cut of meat. Brisket prices have been increasing because of the demand for bbq or other forms of prep. It used to be cheaper.  Most cuts of cheap beef are now relatively expensive. Short ribs, flank steaks, hanger steaks, etc used to all be much cheaper. Now they are in much higher demand the price has gone up.\n\nThat said, it’s still cheaper than your traditional expensive cuts like filets and ribeyes. \n\nRegarding wagyu, you are still typically going to have to treat and prepare the different cuts of meat as you would an angus or other breed of cow. The muscle function doesn’t change because it’s wagyu. Brisket doesn’t become a ribeye. Flanks don’t become tenderloin.", "I worked at a family steakhouse for 3 years. I agree with you 100%.  I personally did not like the way the blood oozes out on rare or medium rare. I did try medium rare filet mignon. I agree that it tastes delicious.  However, if just looking at it makes me want to throw up, then I can't enjoy it. As a teenager, I  ordered my steak medium well. It was perfectly delicious.  But after I had tried the medium rare, I was able to start eating my steak cooked medium.   \n\nI understand that everyone has their own preferences.  But just because you prefer to eat your steak rare or medium rare does not mean that the steak is ruined if it is cooked longer.   Your opinion is your opinion.", "I noticed that too. Personally, I have no issue with well done, I just prefer medium. But even if I hated it, I would just say it’s not my thing and move on. Not be super patronizing about it", "I should've read further down in the comments. My only thought was, \"wait no, not in the microwave! Alton Brown would...\"  \n\n\n  \nI don't think he's an AH to be uncomfortable cooking a standing rib roast beyond med-rare, and it seems like he's solved the problem by offering to cook individual slices in a pan.", "Chuck eye steaks/Delmonico are amazing and are often called a poor man's ribeye.  For those on a budget they are an excellent replacement for ribeye. They are super tender when cooked medium rare.  I completely agree about certain cuts of meat getting ruined when they're overcooked.\n\nSource:  used to be a meat cutter and am still steak enthusiast.", "its how you cook it, you cant always use the same technique for certain doneness, some can be pan fried, others baked or oven roasted, you have to know what your doing.", "Just asking a question cause I don't know.What about aging steaks where it's left to dry out,the more days,the better/higher priced the steak,how does that equate?", "Hockey puck = overdone, not well-done.  \n\nWhen well-done is done well, it should be *just* over the threshold of a grey center, and will be juicy but with less of the iron flavor you get from something less done.  \n\nMy preference is med-rare to rare.  I'm not arguing that well done is *best*, but that it *can* be delicious to those who dislike the flavor/texture of raw meat.  There's loads of people who find anything with pink absolutely disgusting", "What is their problem with making everyone have to have over cooked meat? They can always have it grilled/fried /microwaved until dead and dry and tough.  \n\nCook it right and then over cook their outer pieces.  Or tell them you cooked 2 different halves and fry them if needed.\n\nNTA", "Nta, don't let that animal die in vain by over cooking it.", "NTA. Are the parents buying the food? Are the parents cooking said food on a busy holiday? Is anyone except OP and his wife hosting? No. If this was a reversed scenario with the parents cooking and OP asking for a whole roast to be cooked to his liking, everyone would be calling OP the asshole here. \n\nI don't know how most people grew up, but growing up my parents always told me that if someone else is doing all the work and cooking, then you don't get to complain. \n\nCooking sliced pieces in a pan after the roast comes out sounds like a good compromise to me!", "Why would anyone want to eat a well done Rib Roast? There are words for that sort of evil. NTA.", "NTA Cook their basic asses a turkey and save the rib roast for people who can appreciate it.", "NTA. I’m sick of the “it’s bloody/mooing” argument. Eat some chicken then if you want well done food.", "Yeah I kinda don’t get how people don’t understand there’s proper ways to prepare types of food, even if it goes against your personal preference. This is literally why I’ll never ask for or order such nice cuts of meat, because I also want it cooked way more than it really should be lol. I just know I don’t appreciate it like others do, so not worth it to me personally", "You’re all so dumb lol", "“We cater to vegans, vegetarian, fruitatarians, raw food people, allergies real or not, and everything else.”\n\nWe do? My vegan self always has to make special food for me and my cousin who is allergic to dairy at any event lol. Those people often get made fun of and poked and prodded if their allergies/intolerances are real as well :/", "Would they be OK if you just seared some slices for them in a pan?  I do that for my mom because I like medium rare and she likes medium well.  I just sear hers with a little beef fat I've trimmed off and saved.  Then I put a pat or two of butter to help keep it from drying out too much.  It only takes a couple minutes.  Either that or you could go the turkey route or maybe a small ham that you can roast at the same time as the beef roast.  Whatever they prefer I guess.", "Butterball makes 3 point turkeys that you just cook and slice. You sound like a pleasant host. 🙄 People have different preferences for meat and some people can cook a mean Thanksgiving turkey. You really don’t need to be a jerk about it.", "He’s awfully high and mighty about his cooking skills for someone who didn’t even think about searing it in a cast iron after it cooks in the oven. My husband didn’t bother to learn how to cook until we started dating, and cast iron is the only way we do steaks now. It’s not hard to cook a few slices just a bit longer in the pan for those who like it more well done.", "Exactly!! They probably don’t even season their food. Lmao. Cut an expense meat in half because three people want it well done. How about no. The husbands compromise is the best.", "This won’t work. If he cuts the ends off the meat ass soon as it comes out of the oven, it will bleed from both ends, and dry out the meat that’s supposed to be resting. The meat that gets put back in the oven, also won’t get time to rest if everyone wants to eat at the same time. So everyone will still be eating sub par meat. The only compromise here, where everyone gets to eat nice beef, is to buy a second, cheaper cut, but cook it long and low in a crock pot, or on the stove. Long and low well done, can be even more tender and juicy than a prime cut.", "I prefer medium well. I know logically that other temperatures are safe to eat but... I can't. I just can't. Even looking at it makes me so queasy.", "People get SO weirdly rude about people preferring a different way of eating something. Everyone should be allowed to enjoy their meat cooked as well or not well as they like individually.", "I find it's more a poor cook who complains about cooking beef well done. It's perfectly possible to cook steak so it's not pink in the middle, but still nice and juicy. You just need to tend to it a lot more. Poor cooks think well done means cremated and dry, or they're just snobs about the colour of the inside of a steak.", "Yeah you can’t just a prime rib in half, as then you need to track the temperature of two meats and it’s way more likely to be over cooked. You can keep cooking a meat to it’s well done or medium but you can’t uncook it and it is a science in terms of losing the fat content when you cook it longer. For an expensive cut of meat it should be treated accordingly or why bother, esp if most people want medium rare from the post.\n\nThe people who want medium or well done can have their piece seared. I don’t eat well-done steaks but a well seasoned seared thin slice of beef is acceptable. Or make a pot roast for the well done crew. Ideally the wife gets her own smaller roast and makes a well done for herself and parents (3 individuals) one but don’t cut the existing one.\n\nMajority rules which is medium rare. Well done can be easily remedied with Pan searing and still taste good. Ta-daaaaa!!", "What a great answer. \n\nNTA", "Correct. They can throw it in the microwave if they want it more done, which given their taste is probably an acceptable method.", ">Why can't he make a small portion well done?  Just leave it on longer.  I like mine well done. My husband does not. He cooks mine longer.  Really not that hard to do.\n\nBecause then OP doesn't get the joy of being a food snob who looks down on other people's preferences.", "I guess...Rare beef makes me vomit.  That's my stomach's opinion.", "Cooking meat medium well or well done makes it shitty compared to what it should be.", "Honestly, it's better for me if you like different stuff than me. Oh darn, you don't like raisins/mushrooms/whatever? More for me then.", "Spoken like someone who has never cooked anything in their life.", "Except you are the one who \"doesn't know how to cook well\" if you're overcooking a good piece if meat to well done. There isn't a decent chef in the world who would willingly cook beef to anything over medium rare, much less to well done. While it's true a good piece of meat will be a little less horrible cooked well done than a cheaper cut, either way you're not \"cooking well\" when cooking to well!", "For a big piece of meat like a roast, there’s minimal legitimate health concerns from the meat being even rare. Risks of food poisoning and such from meat cooked in that range is primarily from ground meat (ie burgers).", "Its not blood that oozes from a medium rare steak.  You are completely entitled to feel grossed out by it, but it isn't blood.  \n\n\nhttps://pushetacreeksteaks.com/blogs/beef-facts/that-red-juice-in-your-meat-isn-t-blood", "I’ve had medium - well done where it’s still succulent.\n\nI’ve also had well done that tasted like charred shoes.\n\nIt will depend on the cut of the meat and the person cooking.\n\nIt also depends how much the person taking your order has listened because when you order ‘rare’ and get ‘charred shoe leather’ that’s another problem", "As someone who hates fatty meats and cooks meat well done, I can tell you that it comes down to the cooking. I select the leanest high grade meat I can afford and cook it slowly. Even my husband happily eats it if I accidentally overcook his, because it's lovely and tender and doesn't taste like I'm eating a piece of iron bar.", "Your argument is only true if every person likes meat for the same reasons. I don't like it this way at all. I prefer dryer meat with less fat. Taste is so much more than just the molecules touching your nose. It is about texture. The feeling you get when you chew the meat. With a less tender piece of meat I can feel the muscle fibers splitt between my teeth. There is some resistance in chewing which I really like. In contrast I really hate the soft slimey texture you get from undercooked meat. It just feels bad and gives me a real aversion for the food. The fat content gives other sensory experiences as well. If the piece of meat is well down it will have a good crust from the fat that melted off. You don't get this from cheaper cuts. And the animals might have fed differently. This results in a different taste of the meat as there are more complex molecules. You can taste this even i the meat is well done. I had excelent cuts from cattle that is at a giant grass land all year without any extra food. I did eat it well done and it taste so much different from store bought meat. The chemical compounds in the meat differ. And through aging for 4 weeks the compunds in the meat reacted even more and formed a special flavor I never had before. It was almost like eating wild hunted deer. With cheaper meat I would never had have this experience.", "or he just didnt know how to cook.", "There is debate. I've cooked well done steak that tastes great. Soo...", "If that's the case, you should maybe listen to Chad when he tells you he isn't going to be able to make your well done steak very juicy.\n\nIf I invite people over it's to make something I'm good at. If they want something else I have no problem reminding they aren't playing to my strengths.", "Why on earth would you try to sous vide, a technique based around ultra low temperature cooking, a piece of meat to well done? No shit it's going to lose everything in it. The proper method for a well done cut of meat is to sear the thing on all sides at screaming hot (700°+ F) temperatures until fully sealed, then moved to a mid heat (350-450°F) to push the heat in and get to the requisite doneness, then rest as you would any other steak. Low and slow was developed to make marginal cuts edible, and good cuts edible by those with no teeth.", "I got into an \"argument\" the other day with some co workers about this. I have worked in restaurants, specifically steak houses for over 15 years ( I no longer do). I had to break it down like a bunch of children and walk them through it. \"So you say that a well done steak is still juicy? What is juice, a liquid, correct? What happens when you apply heat to a liquid? That's right, evaporation! Good job everyone!\" None of them have ever had any experience with cooking and admitted that they fuck up boxed Mac and cheese yet still had the audacity to tell me that I have no idea what I'm saying. 🤷🏿‍♂️", "But turkey is well known for being a meat that's difficult to get right and often turns out very dry.  If you want turkey to end up juicy, you'll have to baste it at minimum, if not actually soak the bird in brine for days and/or coat it in butter.  Steak isn't typically brined and cannot be basted in it's own juices during cooking on a grill, so it will turn out dry if you cook it well done.", "NTA. Offer to cut each of them a slice and bake it or throw it on the grill. It really wouldn’t be that great microwaved, but baking it longer or grilling a few slices to meet their preferences would be a good compromise.", "Yes, this is the way. You cook the rest in an au jus because it keeps the meat moist  while continuing to cook.", "No, you're not supposed to cut the rib roast. It's NTA.", "As someone who has cooked a rib roast before, this is freaking terrible advice and the halves won't cook evenly.\n\nYou cook to the lowest point and cut. The end pieces will be more well done and may be fine. OP is correct about that,but you cut, then pan fry the individual pieces.\n\nAs someone who hates well done and finds it to kill the flavor, I would absolutely refuse to cook something that intensive in a manner I wouldn't enjoy, especially if other solutions exist. But OP is right that you can cook more, but cannot uncook", "That would also change the way it cooks.  The obvious answer is to buy a smaller roast for those who don't like it rare or cut their pieces when it's done and put the wife and in-laws meat back in the oven until its cooked to their preference.   I prefer my meat medium rare so I completely understand his frustration.   I would also be frustrated if they wanted to basically make my favorite cut of meat inedible for me because of their preference that can be easily resolved.   I'm going with ESH because the solution is quite simple.", "Why ruin half the roast when the perfect solution is just cut a slice and cook it more?", "ugh PLEASE do not follow this advice. I can't believe this is top.  \nYes do compromise but do it by searing individual slices for them after the rest of the roast is done to medium. don't fuck up your expensive roast by trying to split it pre-roasting.", "Nope. Cook the whole thing MR and they can cook their pieces extra themselves.  No point ruining half a roast for people who won't eat the entire half", "Don't do it like that, it won't cook the medium rare part right. Cook the whole thing medium rare, cut it in half, put the other half back in and cook to whatever.", "NEVER!,  and these types of coal eating individuals should be removed from the universe.  preferably in a way that their molecules cant pollute our wonderful Medium Rare Meat eating universe!  :D\n\nAnd short of that, then yeas take it out before it gets overcooked, cut most of the good stuff off, let it rest, while you crank the last bit and overcook it to oblivion for the coal eaters. :)", "NO!  That’s not how roasts work. When you split you ruin the juicy more tender side. You can get another smaller roast that you ruin and overcook and let adults eat the medium rare properly cooked one.", "OP if you see this. Do NOT cut that roast in half. You might as well throw it straight in the trash if you do that. Cut it to the minimum accepted temperature (in this instance medium rare) and then once the roast is done and it sets, cut the desired portions for your wife and her parents. Finally you or her sear those portions to medium well which is what she wants. \n\nIf you cut the roast in half, all of the juice will fall out and dry out the meat. The closest you could come to a true compromise is cooking it medium rather than medium well or medium rare, but frankly that would piss me off with it being so expensive. Good luck. Ignore the people who've never cooked a roast", "I cut a steak after its cooked and pan fry for whoever likes it more done", "Wouldn't that just ruin it? The juices would run right out. I'd say buy a second cheaper one to cook to well done.", "As someone who doesn't cook/eat much beef, isn't there a big problem with cutting into a slab of beef while it's piping hot out of the oven? I guess you could rest it before cutting it in half but that seems like an awful extension of time for something that takes forever anyway.", "So this while it sounds like a good idea isn’t.\nI can’t explain why, but my friend growing up dad was a butcher and he would tell people not to do this. \nHe would say cook it whole and then throw their slices in a frying pan. Sooo yeah.", "Bruh you don't cut a prime rib down the middle and cook 2 halves separately without destroying it. Geezus. There's a lot of us current and former restaurant peeps here begging OP and anyone else not to do this. Please anyone reading this top comment or my awarded comment further down please don't listen to or follow this advice. It will ruin an expensive piece of meat for no good reason. There are better solutions than cutting the baby in half.", "You can’t just cut a prime rib in half and\nget it to cook the same. The size of the roast matters when cooking it perfectly. You’re a fool to think it’s so simple.", "You don’t cut a standing rob roast in half.", "That's not a good solution for a roast though, because cutting it in half wrecks both roasts.\n\nThere will be more well and over done pieces than medium rare.  And the well done roast will really dry on the ends.\n\nYou don't spend good money on a great roast to destroy it in the oven.  Additionally, not everyone has the oven space to do roasts at a time.   A better compromise is for the wife to either go buy another separate roast or cook something completely different. You can't do leftovers with a well-done roast. :(", "OP this makes sense, also you could cook the entire thing as you want, and then cut the appropriate amount off for the guests who want it well done and toss that back in the oven, if you have a concern that cutting it first will affect the overall cooking process.", "Unless it’s a huge roast, this is terrible advice. It’s much more difficult to get that perfect medium rare when it’s a small roast. The ratio of center pieces to end pieces is all fucked up.", "I'd go medium rare on the whole thing, then carve it up and give the heathens slices a little flash in the pan with a bit off garlic butter and some herbs", "I mean, she’s trying to force other people to eat food they don’t like. That’s just baseline AH behavior. Taking one part of the rib roast out before the other is the only way for both sides to have it the way they want. You can always cook rare beef longer. You can’t uncook well done.\n\nI’m guessing OP’s wife comes from a background where she considers well done to be the neutral, baseline option, and that anyone who departs from it is asking for their food to be done a special way, which is why she calls it “pretentious.” I personally find it kind of painful to chew and swallow dry, well done meat. My parents used to cook everything that way and would even take away my water if I protested, thinking I was trying to fill up on liquids to get out of eating my food. I was just trying to get those shards of meat out of my teeth. \n\nNTA btw.", "And his wife ISN’T the AH for expecting him to eat burnt meat. Okay /s. He definitely would not be the AH at all. His in-laws are for expecting him to burn his food to accommodate their crappy tastebuds.", "My friend if you think that's a viable solution for cooking this roast you shouldn't be giving cooking advice.\n\nFor a number of very obvious and basic reasons, cutting the roast in half would massively impact how it cooks. Please don't give snide advice about things you are completely ignorant about.", "First world problem", "I tend to cook for an army for the holidays so that there are left overs for a few days. But my family gets pissed when I do this telling me there is no logical reason to make food so you have leftovers", ">  I’ve never seen anyone get mad because they had too much food\n\nFrom what I know of Thanksgiving, isn't leftovers like kind of a quasi-tradition?", "You were the one who wanted to force them to eat MR. So maybe try the \"gracious\" solution.", "Most certainly is.", "Why would you ever in the good wide world microwave a good piece of meat?? If you really want it more “well” done, take a frying pan, add some butter and maybe a pinch of salt/pepper and do it right. JFC.", "For me, that was part of the YTA vote. Really felt like he's judging them for how they like their meat and punishing them.  If he backed out of his pretension (wife nailed it) for a second, he would have realized there are plenty of options.", "You don't speak for me. I can cook a good well done steak. Deal with it 😎"]}