{"id": 16218, "submission_id": "135obri", "title": "AITA for telling a school nurse I don't need a second opinion from an American doctor for a diagnosis made in Spain", "selftext": "I (17F) moved from Spain to the US with my parents a year ago. I have a very rare and severe neurological condition, which is itself a subtype of a more common and less debilitating condition. When I say rare, I mean a 0.0001% occurrence rate. \n\nI was diagnosed in Spain a year ago, before we moved. I spent two weeks in the hospital, they ran all the tests possible, even experimental ones. I  eventually saw a specialist who's extremely well-known in his field. He made the diagnosis and gave me a prescription. I went from 2 episodes a day to less than 1 a month.\n\nNow for the issue: a week ago, a new head nurse was hired at my high school. As an at-risk students, she asked to meet me. When I started describing my situation, she interrupted me, saying \"I know \\[name of the more common condition\\], cut it short\". Since it's on a whole other level in terms of gravity and rarity, I still went ahead and described it. She interrupted me again and said: \"this diagnosis is very unusual, are you *sure* about it? I know a very good doctor, you're sure don't want to have a second opinion from an *American* doctor? .\" She stressed *American.*  \n\nI told her that all the tests were ran a year ago, the diagnosis fits perfectly and the medication is working. I finally said that Spanish doctors are just as competent as American ones. I was calm, but it showed that I thought she considered Spain as a third world country. She rolled her eyes and said that I didn't need to get defensive.\n\nI told my parents when I went home. My dad (American) got on her side. I said he was free to spend dozens of thousands of dollars (what the whole process would have cost in the US) for the same diagnosis and to get me under opioids. He said I was overreacting and that I didn't need to be an AH about it, but my mum, who's Spanish, understands my reaction given how mentally taxing all this is. I haven't heard back from the nurse, but I'm wondering if I overreacted.", "created_utc": 1683039895, "permalink": "/r/AmItheAsshole/comments/135obri/aita_for_telling_a_school_nurse_i_dont_need_a/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I answered in a firm way to a nurse when she suggested that I should get a second opinion from an American doctor. \nI may be the asshole in that I rejected her advice in a firm way, because I thought she was implying that Spanish doctors were not competent enough, but she said she was just trying to be helpful. I haven't heard back from her, but she was visibly annoyed, just like I was. My father is on her side, but I also got defensive with him. My mom is on my side, but my dad's reaction has made me wonder if I reacted properly.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "A specialist in the field diagnosed your condition and prescribed medication which effectively treats it.  Your school nurse believes she knows better than a specialist.  I think it's clear she is not as qualified as she assumes herself to be, and her suggesting you got defensive was projection.\n\nIt's always important to maintain a firm and direct approach when discussing a medical issue with a new practitioner.  Given how often misdiagnoses can lead to severe complications, she should know better.\n\nNTA", "NTA. If I was taking medication that worked for me, I'd feel very wary if someone started pushing a second opinion.", "INFO: Why are you waiting to hear back from the nurse?", "I'm leaning towards NTA, but would like more INFO.\n\nWill the school nurse be involved in regular or emergency care at school due to your condition? I'm assuming that you also have a specialist here in the US if you've already been here a whole year. Does the school nurse have their contact info? From your recollection, it does sound like the school nurse is being dismissive of foreign doctors, but wanted to see if she has any valid claim for concerns.", "I've also met people with this misinformed opinion of medical professionals in other countries. The arrogance and ignorance shown by your school nurse would get under my skin too.  NTA\n\nP.s. 'Ola' from Spain! I'm currently on holiday in Aragon.", "NTA - Spanish doctors are just as competent as American doctors. However, pulling your medical files and tests and getting a second opinion or fresh eyes on the information isn't a bad idea. You wouldn't have to retake the tests, just have a second doctor review them. It couldn't hurt.\n\nINFO: I would have assumed you already had an American doctor that specializes in this because of the need for medication. How are you getting your medicine refills and prescriptions?", "NTA\n\nYou are - at a minimum - receiving effective treatment to reduce the symptoms of your condition, and have received a diagnosis from an acknowledged expert. I can definitely understand why you would not want to jeopardize your current success.\n\nYou are also a teenager who's having to self-advocate in the U.S. healthcare system, so I'd be hesitant to brand you as any kind of asshole even if you were not right (you are right).", "NTA.\n\nWhile the US has some of the most advanced medical experts and technology in the world, you don't have to do anything.  \n\nThis is less about the nurse thinking Spain is not as advanced and more that you are a self-described at-risk individual and her bedside manner is shit, and as a medical professional she is not listening to you, the patient.", " NTA. The nurse is a racist.", "Congratulations on getting a diagnosis and treatment that works for you.  Having said that, I do think you are pretty defensive about American vs. Spanish doctors.  I wasn't there so I can't really comment on whether the emphasis on American was actually there or if you were just being defensive.  I am having trouble giving a real rating.  I guess I have to go with INFO in that I think the interpretation really is dependent on the body language, speech tones, etc. and I do notice some defensiveness in your description.", "~~YTA.~~ If your condition is as rare as you say it is, I would definitely want a 2nd opinion from someone local who would likely be treating or advising me.\n\nNTA if you already have a 2nd opinion.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (17F) moved from Spain to the US with my parents a year ago. I have a very rare and severe neurological condition, which is itself a subtype of a more common and less debilitating condition. When I say rare, I mean a 0.0001% occurrence rate. \n\nI was diagnosed in Spain a year ago, before we moved. I spent two weeks in the hospital, they ran all the tests possible, even experimental ones. I  eventually saw a specialist who's extremely well-known in his field. He made the diagnosis and gave me a prescription. I went from 2 episodes a day to less than 1 a month.\n\nNow for the issue: a week ago, a new head nurse was hired at my high school. As an at-risk students, she asked to meet me. When I started describing my situation, she interrupted me, saying \"I know \\[name of the more common condition\\], cut it short\". Since it's on a whole other level in terms of gravity and rarity, I still went ahead and described it. She interrupted me again and said: \"this diagnosis is very unusual, are you *sure* about it? I know a very good doctor, you're sure don't want to have a second opinion from an *American* doctor? .\" She stressed *American.*  \n\nI told her that all the tests were ran a year ago, the diagnosis fits perfectly and the medication is working. I finally said that Spanish doctors are just as competent as American ones. I was calm, but it showed that I thought she considered Spain as a third world country. She rolled her eyes and said that I didn't need to get defensive.\n\nI told my parents when I went home. My dad (American) got on her side. I said he was free to spend dozens of thousands of dollars (what the whole process would have cost in the US) for the same diagnosis and to get me under opioids. He said I was overreacting and that I didn't need to be an AH about it, but my mum, who's Spanish, understands my reaction given how mentally taxing all this is. I haven't heard back from the nurse, but I'm wondering if I overreacted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info: are the meds you’re currently on opiates or were you saying that to your dad because you don’t trust the American healthcare system (which if so, fair enough) \n\nNTA, the medical system can cause a lot of trauma and needlessly undergoing more testing when you have a diagnosis from a specialist and are currently being treated by a separate neurologist that agrees with that diagnosis and the treatment is working sounds like a waste of time and money\n\nIf you are on opiates or another potentially addictive substance for the treatment I could understand why the would want another opinion/to look for more treatment options as a lot of addictions start with prescriptions and in that case may change it to NAH", "NTA. Fellow Spaniard here with about 10 years in the US. First, it really sucks that you have such a condition. I hope the research gets better and better and they manage to get you to be attack-free forever.\nOn to the issue at hand. Your nurse sounds xenophobic, and that’s sadly not that uncommon. I do hope it doesn’t happen ever again to you. Spanish doctors are great; their education is incredibly solid and rigorous.\n\nBut as I said, you might experience some people looking down on things if they were done in Spain. I have had folks not take my BA seriously, for example. It happens. Just make sure this interaction doesn’t have negative repercussions for you and stay safe.", "I'm not, but if she feels like the diagnosis isn't right, then she might undermine the gravity of my case. This includes scraping off the instructions given to the school in case an episode happens (for instance, we've told them not to call an ambulance since there's nothing they could do, etc). It'd be a whole mess", "You’re right, I should’ve said this:\n(1) No regular care would be needed. “Emergency care” would be basically waiting for an episode to go away. I can stay in the classroom when it happens, there’s nothing to do, I’m safe when I have an episode, I just need to be in a safe position and for no-one to freak out. In other words, it’s not like a seizure or epileptic episode. \n(2) Many people have asked this and yes I’m seeing an American neurologist for when my prescription has to be renewed and that kind of thing (that’s actually one of the first things we did when we arrived). He agrees with the diagnosis, he saw all the test results and didn’t challenge it. All this should be on my file, especially since they have a copy of my prescriptions (the most recent one being from this doctor)", "Of course, I have a neurologist. I have to go see him every six month to renew my prescription and potentially adapt the dosage. He never questioned the diagnosis and even agreed with it when I brought him all the test results and everything. He was also very surprised (he had only seen a few cases before), but said that it did exist and that the medical background in my family would explain why I was at risk", "Xenophobic, not racist. Spaniards are white. The nurse thinks the foreign doctor is incompetent.", "People from Spain, the country in Europe, are largely white themselves.", "No, she is not.  She's ignorant and an elitist.  Not a racist.", "Absolutely, and that's why I'm here. To describe the whole thing: I told her the name of the condition, she frowned, and then I told her about where the diagnosis was made her face changed completely. She raised her eyebrows and got quite condescending when questioning the diagnosis. I'm usually very calm when explaining it, but it irked me. Thanks for asking!", "I'm seeing a neurologist in Boston, since I need to have my prescription renewed every six months. He saw all the test results, all the scans, and said he agreed with the diagnosis, even if he had only seen a few cases in the past. But he was just as surprised as her, he just handled it differently. He said he couldn't think of any other tests they could run to challenge the diagnosis at the moment, and that the main thing was that the medication was working", "No no, and that’s why I’m happy with it. It’s strong and has some side effects, but clearly it’s nowhere near opiates. I’ll probably be on it for all my life, but it’s really manageable", "They're likely to be more worried about your family suing the school if they DON'T call an ambulance tbh. School districts care more about covering their asses than making sure students get the right care. Welcome to America!", "Then you do in fact have an American doctor validating, you haven't directly asked him to reinvestigate your case with fresh eyes, but if he disagreed he would have said so by now.", "Then the concerns of an \"American\" doctor are invalid because you already have a local doctor that is familiar with your case. Just explain to the nurse that you already have a doctor and he agreed with the diagnosis.\n\nEdit: Sorry, I forgot to add that your neurologist IS your second opinion.", "You might be right. But I’ve dealt with that particular inflection of *American* before. I’ve only ever heard it from whites.", "You were NTA and that nurse was extremely condescending and just a tad xenophobic. Tell your Dad the diagnosis was good enough while you were in Spain, what's the problem with it now that you're in the US? \n\nIn the meantime, I'd consider making a statement to someone at your school, just to record the incident. Much as I hate to speculate, a school nurse who doubts your condition and diagnosis as legit is more likely to dismiss your symptoms and any issues you may have at the school in the future :/", "Based on the fact that you know more about this than she does and your response to my post, I don't think you are the AH here.", "This IS your second opinion, NTA btw", "OK. It sounds like you DO have a 2nd opinion in the states. I'm gonna change it to NTA. Nurse is likely racist or xenophobic.", ">I'm seeing a neurologist in Boston\n\nBoston?\n\nIf you're seeing a specialist in Boston, it's probably at one of the big teaching hospitals, right? Chances are very high that your doctor is on staff at one of the three major medical schools in the city. And if not, they can easily consult someone who is just by shouting down the hall. So your school nurse can STFU, you do have a \"proper\" diagnosis from an American doctor.", "It’d hypocritical of me to criticise American doctors, when I’m asking of the nurse not to do this with Spanish doctors. My issue was just with her reaction regarding the origin of my diagnosis, and how she tried to invalidate it. I also think she should know that I’m certainly seeing a neurologist here, since a GP is not specialised enough to know if my treatment should be increased or decreased. But you’re right, I’ll make sure to tell her next time I see her, maybe it’ll make some of her “concerns” go away", "The nurse herself might not be white, but that's neither here nor there.  \n\nIt's more along the lines of \"your doctor went to a state university? Shouldn't you get an opinion from a doctor that went to Harvard?\"", "Yeah except that Spanish doctors have just as good a reputation as American ones if not better. Given that the op got a noted specialist involved in Spain it''s more along the lines of your doctor went to Harvard, shouldn't you get the opinion of one that went to a state school.", "We’ll get off topic in a hurry here, as I can see this winding people up. Regardless of all the above, *the nurse is the asshole*."]}