{"id": 16246, "submission_id": "135w464", "title": "AITA for refusing to sleep on the couch in AirBnB?", "selftext": "Me (20F) and my two friends (19F) were planning on taking a trip to Lake Michigan at the end of May. We were searching for an AirBnB on the lake to stay in. We found a really nice one for pretty cheap, but on the downside it only had 2 twin sized beds and a couch. A pretty small, uncomfortable looking couch at that. \n\nI made a joke along the lines of, “alright, you two can duel amongst yourselves who gets to sleep in the twin and who gets the couch.” Immediately they exchange annoyed glances between each other. “Why do you automatically get one of the twin beds? Now that you’ve said that, I think you should be the one to sleep on the couch.”\n\nThis kinda pissed me off because I thought it would be pretty self explanatory: I was a gymnast for 10+ years, had a bad fall and broke my back. Unfortunately, given that it was my lower back, it never healed completely and I still have a lot of issues and pain. I literally just had a surgery in Feb, which I’m still recovering from and going to PT for. Not to mention that neither of them drives, so I’m the one making the 5+ hour drive to Lake Michigan. Long drives are killer on my back, so it’s pretty shit to then expect me to sleep on an uncomfortable couch.\n\nI voiced all of this to them and I got the response, “tbh, I don’t care about your back. Kinda seems like a non problem to me. I’m tired of hearing about it. Just because you have a bad back doesn’t mean you automatically get the bed. Toughen up, you’re not going to get special treatment for it.” To which I could only respond, “I wish you had some concept of the pain that I endure every single day, because if you did, you wouldn’t be fighting me on this.” To which she just sarcastically replied, “If I had your back issues, I wouldn’t be such a whiny little bitch about it.” At that point I called off the trip and left her house. Tbh, at that point I called off the entire friendship. Haven’t talked to either of them in like a week now.\n\nLike back issues aside, if I’m making the 10hr total drive in my car. With my gas money. It seems obvious that I should get 1st pick when it comes to sleeping arrangements. Like right? Idk.", "created_utc": 1683052086, "permalink": "/r/AmItheAsshole/comments/135w464/aita_for_refusing_to_sleep_on_the_couch_in_airbnb/", "score": 98, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I refuse to sleep on a couch in an AirBnB, because I have back issues (2) this might make me the asshole bc if I don’t sleep on the couch then one of my friends has to\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and they aren't your friends.", "NTA- had a similar arrangement with my friends, driver gets first pick.  And I say this as the person that wasn't the driver and has had to sleep on pull out couches before OR sofa cushions on the floor.  \n\nAnd no they aren't friends if they can't fathom how painful a bad back is.", "NTA. If you’re the one driving (and they’re not pitching in for gas money?!) and using your car, and with health problems… it sounds like they can’t take this trip without you, so they either need to respect your physical limitations or figure out alternate transportation or accommodations. \n\nThese do not sound like friends worth keeping.", "Nta. Those are NOT your friends.", "NTA, hopefully, you no longer have these two bad friends.", "NTA BECAUSE you're doing the drive in your car with your money. If your friends were, you know, nice they would offer to cover gas as a thank-you for driving, and THEN you could discuss who would get what for sleeping. Then the person who got the couch should pay slightly less for lodging than the two people who get the beds.", "NTA at all.\n\nIt sounds like you're not their friend, you're their chauffeur.", "NTA - for a second I was going to say ESH because your comment could be taken as presumptuous and rude but after you said you were driving the whole way, paying for all the gas, had a bad injury that you attend PT for AND they still didn't care? yea drop them, you're better off OP", "NTA \n\nYeah sounds like your friendship was heading towards the rocks, anyways. Time to abandon ship.", "NTA but it's how you phrased it initially", "NTA. The true side of your “friends” has come out.   They have no empathy and no effs to give about using you as a chauffeur. \n\nAgree with dumping this friendship since they don’t seem to give an eff about anyone other than themselves.  On a future note - don’t even look at any airbnbs that don’t have proper beds for each person going on a trip.", "NTA\n\nGo with other friends though, why lose out cause these AHs…?", "NTA but I'm leaning toward ESH because if you can't afford a place with three beds then you can't afford to go.", "ESH- your friends are bad and in the wrong here but I also don't think you should have just assumed you get the bed. You sounds entitled and from the way they reacted I wonder how often the back card is pulled by you and they're tired of it.\n\nI really don't understand why this was even an issue and 2 of you couldn't just share one of the beds? Like my friends and I go away every summer and we share beds", "YTA - I'm going against the grain here.  IMHO it has to do with  approach and assumption.  You assumed you got it, and judging by the only thing I can, your words,  you were pretty entitled in your story.  A better approach should have been the \"I'll drive if I can have\"    100% not saying you don't have back issues or minimizing the severity of them, but the assumption was what makes YTA.", "ESH\n\n\n\nYou really are no angel either. All of you aren't excatly the musketeers here. This is a group aktivity. Everyone or no one. \n\n\nYou assuming and not clearifying that you need a bed in this way was brilliant of you wanted a fight. \n\n\nI'm pretty sure one of the girls would might have even offered to take a travelmatress or sleep on the couch. \n\n\nOtherwise just book a airbnb that actually is for three people. \n\n\nOr just don't go. \n\n\n\n\nIs this really worth souring the relationship over? You all were escalatingly rude and condecending to each other.", "ESH\n\nnobody should be going \"ha, you sleep on the couch\"\n\nget a 3 bedroom, end of story", "YTA. If you want a guaranteed bed, then find better accommodations. (I’m a father of a gymnast who won regional championships). \n\nYou are not special.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe (20F) and my two friends (19F) were planning on taking a trip to Lake Michigan at the end of May. We were searching for an AirBnB on the lake to stay in. We found a really nice one for pretty cheap, but on the downside it only had 2 twin sized beds and a couch. A pretty small, uncomfortable looking couch at that. \n\nI made a joke along the lines of, “alright, you two can duel amongst yourselves who gets to sleep in the twin and who gets the couch.” Immediately they exchange annoyed glances between each other. “Why do you automatically get one of the twin beds? Now that you’ve said that, I think you should be the one to sleep on the couch.”\n\nThis kinda pissed me off because I thought it would be pretty self explanatory: I was a gymnast for 10+ years, had a bad fall and broke my back. Unfortunately, given that it was my lower back, it never healed completely and I still have a lot of issues and pain. I literally just had a surgery in Feb, which I’m still recovering from and going to PT for. Not to mention that neither of them drives, so I’m the one making the 5+ hour drive to Lake Michigan. Long drives are killer on my back, so it’s pretty shit to then expect me to sleep on an uncomfortable couch.\n\nI voiced all of this to them and I got the response, “tbh, I don’t care about your back. Kinda seems like a non problem to me. I’m tired of hearing about it. Just because you have a bad back doesn’t mean you automatically get the bed. Toughen up, you’re not going to get special treatment for it.” To which I could only respond, “I wish you had some concept of the pain that I endure every single day, because if you did, you wouldn’t be fighting me on this.” To which she just sarcastically replied, “If I had your back issues, I wouldn’t be such a whiny little bitch about it.” At that point I called off the trip and left her house. Tbh, at that point I called off the entire friendship. Haven’t talked to either of them in like a week now.\n\nLike back issues aside, if I’m making the 10hr total drive in my car. With my gas money. It seems obvious that I should get 1st pick when it comes to sleeping arrangements. Like right? Idk.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - if you are doing the driving and paying for the gas, then you deserve the bed. But think would have led with that. People don't get chronic pain from injuries until they get one. Think if you think I'm driving 5 hours to sleep on a couch, then you'd better be joking, better. Especially as everyone should want a well-rested driver.", "You did totally the right thing. Your friends are jerks. Good job calling it off trip and friendship", "You are definitely NTA and had very valid reasons for requiring a bed.  The reaction of the others show they are not your friends.", "NTA. This couch just helped you get rid of foul friends. Save a little bit more and go by yourself, or enjoy the trip with someone who actually has empathy.", "NTA, all of the explanations about why the couch sucks for you are irrelevant; the couch sucks. Draw lots or straws or cards or something to see who gets the couch.", "NTA\n\nI'm glad you called off the trip.  They are jerks, and definitely the AH's.", "NTA. A friend wouldn't call you a whiny little bitch.\n\nThat said, your initial reaction of \"because my back\" came across as entitled when I was reading your post.\n\nYour \"back issues aside\" comment about using your car to get everyone there, you doing the driving, and you paying for gas is what you should have led with. Your \"friend\" maybe could have countered by offering to do the driving so that you could better care for your back during the drive, or you paying a smaller share of the AirBnB cost. Or both.", "NTA and find different friends to go with. They’re not your friends at all. If they were they’d care whether you were comfortable", " NTA. Agreed. Your driving. So even if your all paying equally for the rental. You really aren’t. It you gas, your car, your mileage.", "NTA \n\nGlad you cut them loose!", "NTA", "NTA. Good for you for noping out of that \"friendship\" and not putting yourself through that trip", "NTA. I think having a bad back doesn’t automatically mean you get the bed (though a considerate friend wouldn’t balk at the suggestion), but I DO think that since you’re the driver that entitles you to a bed. Maybe my own rules of etiquette but I think if you’re driving 5 hours while they get to move around or sleep or whatever then you should automatically get one of the beds for that discomfort alone.", "YTA. People don't like being told that they are expected to compromise by default. \n\nIf they're your friends, they probably would have appreciated a, \"Is it cool if I have one of the beds; I think the couch would mess up my back.\"", "NTA they are brats", "Personally I think they should have just found an AirB&B that had three beds.  Clearly none of them wanted to sleep on the couch, so instead of playing hot potato and immediately calling 'not it!' Find somewhere where everyone would be comfortable.", "This right here. It got my back up (no pun intended) just reading it.", "True lol", "It’s not really a card lol, it’s a legitimate thing that has become a big part of my life that I cannot control. Literally was wheelchair bound bc of it for quite a while. Had to take time off of school and do extensive PT just to walk correctly again. So yeah, maybe it’s something I talk about a lot, but as I said it’s become a big part of my life as suddenly not being able to walk would be and again I can’t really control it lol", "Also, as for us just sharing the beds, they’re twin sized and not all of us are tiny lol", "I wish there was a “kind of an asshole” verdict. It’s not crazy to expect a bed, especially after driving everyone there but to approach it with that sense of entitlement? I don’t know man, people don’t like that kind of behavior. It’ll put a sour taste in their mouth and that’s exactly what happened. OP should’ve said “I would really appreciate one of the beds since I’m driving all of us, paying for gas, and I have a bad back as you both know. Thanks guys.” They probably would’ve been more than happy to give it to OP if they were nicer about it.", "She broke her back.", "Exactly! It’s crazy to think of getting a place that doesn’t have enough beds. It’s also crazy that the driver would pay for all the gas. For me that would be an immediate NOPE. They can drive separately if they aren’t at absolute minimum paying for their share of gas.", "That was what I was planning on thinking. But then the details of their disdain for her medical condition made me think that all the beds in the world couldn't save this friendship.", "exactly!  before i even got to ur comment, i thought why not get one w/ enuff beds?? 🤷🏾‍♀️", "I'm sorry that happened to you and I hope you're doing better! I'm still wondering why sharing a bed wasn't considered as a option? Obviously now after what they said to you the trip is no longer happening but this seems like it would have been a very quick and logical solution", "I don’t know why you’re getting down voted here. Two young adults in a twin bed is not ideal. I did that often in college when I was dating. Man it sucked 🤣"]}