{"id": 16286, "submission_id": "136jle5", "title": "AITA for telling my girlfriend that she would be a bad mom because of the way she treats our dogs?", "selftext": "EDIT: Sorry if this is the wrong way to do it but just some info to add as people are assuming I don’t do anything and expect her to do everything which is my fault as I didn’t include as much information as I could have, my apologies. I did not realize how much information I had left out. We live in an apartment. I work nights and take the dogs for a 2 hour hike before my shift, so I sleep in a bit longer if I can. I am a horrible sleeper so I am usually up before her anyways. So because I am awake before her I am taking them out the majority of the time, but when I can sleep in they are not taken out until I am woken by the whining and I get up and ask if they’ve been out yet and she says she was just about to do it. \n\nEDIT: I completely understand what you guys are saying about commenting on her future parenting. I shouldn’t have done that thank you for helping me understand that. \n\nI (25m) and girlfriend (24f) of 4 years have 2 dogs together. We got them while being together, neither have been from a previous relationship. My gf wakes up earlier than I do and works from home, so it makes the most sense, in my opinion, that she would take the dogs outside first thing in the morning as I do if I am up before her. But every single time without fail, she makes them wait for hours until they are crying and jumping at the door. Or sometimes just doesn’t do it at all seemingly because she is waiting for me to do it. With the excuses “they didn’t ask to go out yet. They’ve just been playing with each other all morning. My boss needed me to do something right away.” \n\nI’ve talked to her about this so many times, that the dogs are the first priority in the morning and that nothing else should really even be done until they go outside and do their business. She always responds with a huff and a puff and “I know, I understand.” I’ve now started to tell her that what I’m seeing from her towards the dogs makes me think she will do that with our future children. What if the baby needs a diaper change? Is she going to wait until shes had her coffee and breakfast before changing a dirty diaper from the night before? Or just leave it for as long as possible until I end up doing it? \n\nI’ve seen her with kids and she is fantastic, she would make a great teacher but just this one thing is making me question how she would care for our own kids. Whenever I tell her I’m worried that she is going to neglect our children in a way she gets upset and says she never would. But that is not what I am seeing from our 2 dogs that we consider to already be our children. AITA for telling her that and thinking this way?", "created_utc": 1683118096, "permalink": "/r/AmItheAsshole/comments/136jle5/aita_for_telling_my_girlfriend_that_she_would_be/", "score": 197, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I am the asshole because I am telling my girlfriend she would be a bad mother by the way she treats our dogs and that I could be over reacting but I also think my concerns are valid and am hoping to get insight on if my concerns are valid or if they are unreasonable and are making me the asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Sounds like she doesn’t want the dogs tbh. Who doesn’t automatically send their dog out for a wee when they get up in the morning?!", "INFO: Are these dogs that she agreed to get? Or are they your dogs?", "NTA. She really is being irresponsible with the dogs. You don't wait until they're anxious and upset before letting them out. Let them out and let them play and do their business outside. Then start your work.\n\nI'd wonder the same thing about future kids - I wouldn't assume it, but I'd have some concerns. The point is, she is pawning a responsibility onto you that is something she should address as the person who needs to be up earlier in the morning. I don't understand why this seems such a burden to her, but your dogs certainly are burdened until some nice human decides to open the door! It's not fair to the dogs, and it's not fair to you that you are the one worrying about the dogs' well being when your hours are later.", "YTA, but not for your comment, although it was harsh and a discussion could have been held that was kinder. \n\nYou are the AH for staying with someone who shows neglect towards animals. Her behavior is cruel. The dogs should be let out first thing each morning. Hell, I let mine out all the time when I WFH, including just before bed and at 5 a.m. when they wake me up. Why would you stay with someone who shows so little regard for another being?", "... why not just make a sheduele with set times? I honestly don't get that. Dogs need to go outside everyday. Not just to pee bur walks...", "NTA. I live in a flat and so I don’t take my dogs down as soon as I get up but it’s never more than 30 minutes after I get up that we go. We also go for a splash and dash night walk on a weekday and on a weekend we take a 45 minute night walk so they’re okay if I sleep in for an hour more. \nYour girlfriend is quite cruel to the dogs", "The delivery may have been bad, but NTA overall ( though I may have delivered it differently ). If you had discussed getting the dogs together then she knew the responsibility of taking care of a dog. This sounds like it has clearly been an ongoing problem and she doesn’t seem to care, either about your feeling towards it or the dogs well being. \nWhile yes working from home IS work, having to let 2 dogs out to pee before work is not crazy, and you are not asking for too much. If you take them out when you wake up earlier than her, it should go both ways.", "I mean did you just bring it up unprompted or did you have a discussion about having kids in the future anyways?", "Honestly, NTA.\n\nThere's a reason some people adopt dogs to testbed their parenting skills, because the amount of dedication is similar given how dogs are essentially lifelong toddlers. Even with training there's always cases of, \"I trusted them not to and they did it, it was so out of character for them.\" Their needs will always need to be met by their owners vs. a human child that typically matures out of this.\n\nIn effect your girlfriend is demonstrating that she's really only potentially good as a parent past the point of growing independence which is only a few steps removed from a parent that is emotionally distant until their child is, \"a full grown adult I can relate to\\~\"", "NTA\n\nIt's straight-up cruel to treat dogs like that, let them out for fuck's sake.", "ESH: Skip the whole motherhood thing. You have dogs now that are being mistreated. It's amazing they don't pee in the house. To have them whining and jumping at the door and she ignores them is inexcusable. It shows a lack of empathy. That you've talked about it multiple times and nothing changes says a lot. She does not care for these dogs.\n\nSo do you? She's not going to take them out. It's obvious. You need to get up, take them out then go back to bed or something that works for you.\n\nThe dogs are suffering because while you two argue.", "Did she want the dogs at all or was she pressured into it?", "ESH - you for how you’ve approached this, dogs and children are very different things.  Just because she’s grossly neglecting the needs of your shared pets doesn’t mean she’ll be a bad mother, but I wouldn’t have children with her. If she doesn’t have the compassion to let a pet relieve itself after being asleep all night I wouldn’t want to raise children with her.", "I suspect you are right and she'll be an inattentive mother for the reasons you state. So I can't blame you for saying it.  \n\nHowever...\n\n\n\n\nShe *is* being an asshole for neglecting the dogs.\n\nBut you are also an asshole, because you expect her to do an unfair share of dog care: working from home IS working. She is at work, but physically at home. \n\n\nSo ESH", "Your GF is acting negligently.  I've never owned a pet but I know dogs need to be taken for a bathroom trip first thing in the morning, because I also need to pee when I wake up.  It's basic physiology.  All mammals have the same basic waste removal system.  If she continues to wait until the dogs are desperate to get out, it won't be long before they stop asking and just go right there in the home.\n\nYou're not wrong to be concerned about this pattern, but as much as pet owners love their kept animals, they're not children.  Your GF might be more responsible with her own offspring.  Or she might be the kind of mother that forgets her child at the grocery store.  There's unfortunately no way to know until it's too late.  So you'll need to decide for yourself if this is a deal breaker.  You've had 4 years to figure it out, but you're still young and have a lot of life left to live. \n\nIn any case, it seems rather mean to tell someone they'd be a poor parent.  Ok to wonder, but not aloud, and not to the person with whom you may choose to breed.\n\nESH", "YTA. If it so important for the dogs to go out in the morning, then wake up and take them out.", "YTA- you took it too far.. There is ways to talk about issues like this, and you took it overboard.", "ESH. You're both doing petty power plays. At the end of the day they're your dogs.", "Is a doggy door a viable option? My house has one (with a lid for when we want the dog to stay inside) and it has made caring for our dog so much easier.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (25m) and girlfriend (24f) of 4 years have 2 dogs together. We got them while being together, neither have been from a previous relationship. My gf wakes up earlier than I do and works from home, so it makes the most sense, in my opinion, that she would take the dogs outside first thing in the morning as I do if I am up before her. But every single time without fail, she makes them wait for hours until they are crying and jumping at the door. Or sometimes just doesn’t do it at all seemingly because she is waiting for me to do it. With the excuses “they didn’t ask to go out yet. They’ve just been playing with each other all morning. My boss needed me to do something right away.” \n\nI’ve talked to her about this so many times, that the dogs are the first priority in the morning and that nothing else should really even be done until they go outside and do their business. She always responds with a huff and a puff and “I know, I understand.” I’ve now started to tell her that what I’m seeing from her towards the dogs makes me think she will do that with our future children. What if the baby needs a diaper change? Is she going to wait until shes had her coffee and breakfast before changing a dirty diaper from the night before? Or just leave it for as long as possible until I end up doing it? \n\nI’ve seen her with kids and she is fantastic, she would make a great teacher but just this one thing is making me question how she would care for our own kids. Whenever I tell her I’m worried that she is going to neglect our children in a way she gets upset and says she never would. But that is not what I am seeing from our 2 dogs that we consider to already be our children. AITA for telling her that and thinking this way?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "That's barely her making some bs up. She actually seems to be doing work. Also, why can't you take em in?", "Info: why is she up before you?", "INFO.... does she want these dogs?", "INFO: did she want the dogs in the first place? Or did you talk her into it?", "ESH", "YTA dogs aren’t people. Most people do recognize them as a different species and recognize a baby as their own species, and maybe even recognize it is their own baby, and will care for them properly. Once you have a baby, if you do, you’ll hopefully see a human baby takes priority over a dog.", "[deleted]", "Dogs aren't humans.", "That’s really bad for your dogs health. Dogs get kidney/bladder stones too, and for them to have to hold it like that isn’t fair. And I’d bet big money she gets mad at them when they have an accident because she took too long in a morning.   Now, saying she’ll be a bad mom because she’s lazy with your dogs… that’s kinda harsh. But NTA", "ESH....I completely agree with you, OP, about the dogs needing to go out first thing in the morning, regardless of them playing with each other. Your GF is letting you know quite clearly that she doesn't want to do that part of the responsibility of taking care of animals. So, you need to decide if you want to do that or rehome the dogs. \n\nYTA for saying that how she \"ignores\" the dogs needing to go out in the morning is an indication of how she will be with her kids. Most babies will SCREAM when they are uncomfortable and I'm certain that your GF wouldn't be able to ignore a baby making that kind of noise.", "NTA.   I can’t imagine not taking the dogs out first-thing for a wee.  Do that in our home and you’ll be busy mopping.  I’m shocked at her behavior.  She clearly doesn’t prioritize their comfort.   I would be finding the EJECT button.  (Not sarcasm)", "I'm confused, and maybe and idiot. But don't you people walk your dogs? Just letting them out, is that enough? I don't actually have a dog, but my in-laws do. They walk their dog every morning, first thing. If they have to do something, the dog is let out quickly in the garden for a pee, but will get a walk within the hour. And other people I know do the same, I thought that was normal? No? \n\nAnyway, NTA. But you probably could have said it differently.", "NTA there is a guy in here that has to remind his wife to get the toddler up out of the crib when he has been in there for over 14 hours. Like goes to sleep at 8pm and then he’s checking the cams at 10 am and the toddler hasn’t been out or changed yet 😳\n\nDo not let these lazy af redditors who are prob ignoring their kids rn tell you otherwise.", "ESH. The way she treats your dogs is an indicator of her character and I would be reconsidering the relationship.", "Yes, pets and offspring are similar.\nOf course.", "NTA. It was harsh, and probably better left unsaid, but your concern is valid. It’s hard to see animals treated that way! I had a family member who out of the blue decided to stop taking their dog out. They lived in an apartment and they just got annoyed going up and down. The family member was older but had no physical limitations. They were perfectly able to make it out to lunch with friends or go to church regularly! They started putting pee pads around the apartment and the poor little dog would hold it until he was yelping before he would finally go on the pee pad. When I realized what was going on my husband or I would stop over mid day to take the poor little guy out. It broke my heart!", "Tbh I'm impressed that the dogs haven't made their unhappiness *very* clear by peeing all over the house. If they don't get to go outside when they ask, the gf is undoing their house training.", "These were my thoughts. Even before I go to the bathroom myself, I open the door for the dogs to go out. This is crazy she's \"forgetting\" about it.", "Yeah, I don't think OP is an asshole or worried over nothing, but this feels less like a situation where GF doesn't have any nurturing instincts and more like one where she just doesn't want these dogs.", "My dog straight up refuses if he’s comfortable on the couch. He’s a lazy ass. I feel like such a bad dog owner sometimes. But I’m reality, I would have to drag him off the couch. I swear I have a 16yo boy, not a 1yo dog 😂", "She agreed. We both discussed and researched and adopted together.", "This all day long. No matter what time we go to sleep, it's guaranteed that our little dog will wake us up by 7 to go out. My husband wakes up on the weekend whenever I need it to take him out, I get maybe an extra half hour but it really helps. I can't imagine waking up hours later to find he didn't let either dog out. It would tell me he's not capable of giving a rat's ass about another living creature. Which OP seems to think is an acceptable trait in a partner.", "Not unprompted. We talk about having kids often because we will need to do IVF or a surrogate", "She is working. Work from home is STILL WORK. He can't expect her to take care of them ALL THE TIME. and she DOES. HE ADMITS IT. he is only responsible for them when he is home while she is expected to do it 24/7 op is just too lazy to get up early to take them out so she can work", "She doesn't grossly ignore them. She does more than her fair share because she works from home. She is responsible for them when op is not home op can be responsible for them when he is the same with kids. Just because she works from doesn't mean that he can push off all his responsibility to her.", "Letting the dogs outside is not a big ask. All she has to do is open the door. I don’t care if she is the WFH CEO of Google, she can open a door in the morning and then open it again ten minutes later to let the dogs back in.", ">But you are also an asshole, because you expect her to do an unfair share of dog care: working from home IS working. \n\nWhen I work remotely, my work day is significantly shorter than when I go into the office. I absolutely have more time to take the dog out and owe it to my dog to take advantage of that fact. One of the perks of working from home is spending more time with my pets. It's a terrible mindset to view time spent with your dog (or children) as a chore. Walking the dog is a relaxing pleasant experience. To have a dog is to have a walking partner. This isn't like scrubbing the grout.", "I do. I do majority of the time because she won’t. It is a shared responsibility they are both our dogs.", "I don’t know he tried to talk with her, but she never changed her behavior. Maybe she needed to hear it. She really is negligent with the dogs.", "If she has time to pee after waking up, she can let the dogs out as well. Or get up 5 minutes early. No job in the world is so demanding, that you can’t open a door.", "This doesn't excuse it, but I'm guessing this is an apartment situation, where you have to leash the dogs and walk them outside to go potty", ">We both discussed and researched and adopted together.\n\nThen definitely NTA.  It is super super common for couples to get a \"fur-baby\" first and yes, it's a trial run for future human babies. You see how the other handles unexpected demands on time, accidents, poop (OMG pet poop is NOTHING compared to babies tho), extra expenses, responsibilities......\n\nSo no OP you are not crazy for observing how this addition to your family is working out. And not crazy for worrying about how children might work out.\n\nYes your partner might be an amazing teacher but that does not automatically mean that she will parent in a way you agree with. Better to discover this now, than later.\n\nOn a more personal note: I know 2 different couples who got a fur-baby, had major differences in how they integrated the puppy(s) into their households.... and split up after. It happens.\n\nGood luck OP. Hope you two can make this work.\n\n&#x200B;\n\nEdited for repetitive wording (due to lack of coffee).", "NTA. \n\nAlthough if you know she won't let out the dogs you really should be getting up yourself to let them out.\n\nI'm like you, I absolutely judge people on how they treat their pets and assume that it does apply to how they'll treat their family.", "Adding on to these comments.\n\nWhat will happen to the dogs when the girlfriend does get pregnant?  Will she neglect them even more?  Or will she try to get rid of them?  OP needs to seriously consider his future with this person as well as his dogs care.", "Ouch. I feel like this is an important element to your comment. Overall it doesn’t really change the final verdict but to tell a woman who wants children and has fertility issues bluntly that you don’t know if she’ll be a good mother is pretty brutal.", "I’m not sure why he doesn’t wake up early to talks care of his dogs?", "Idk how you interpret “the first person up in the morning should let the dogs out” as “pushing off all his responsibility to her.”", "Forcing any animal to wait to relieve itself because it may or may not be someone else’s scheduled chore is cruel.", "That is also true", "> It's a terrible mindset to view time spent with your dog (or children) as a chore. \n\nYes, yet another reason the GF is an ass.", "This person's comment would only make sense if she voiced to you that she doesn't want to take them out. Since she makes up excuses instead, it is obvious that this is completely beside the point, as the problem is not actually taking them out but your gf letting you understand she would and proceeding to not do so.\n\nYou are NTA , who lets the dogs cry before taking them out, so strange to me", "Then let her let them out in the evening when it works for her instead of her getting up even earlier than she has to so that you can sleep in.", "in the comments op admits wife does more with the dogs than he does. She just has to work first thing in the morning where he is just sleeping in. A job at home is still a job. She's doing most of the work. He can get up with them in the morning since she deals with them ALL DAY ALONE", "When is he responding for them? She has them all day every day? Does he o ly have to let them out once while she does everything else? Work from home is still work and it's unfair to expect her to do his responsibility when he is home and perfectly capable.", "Because she's doing 90% of the work on dogs he is 50% responsible for. My husband works at 7 am meaning out the door by 6. I'm not going to make him get up and extra half hour early to take care of the dogs when ill be up in a few hours.", "She's at work when she gets up. If he is concerned then he should get up with the dogs because he should be doing more for them in the first place", "You let the dogs out once a day? What do you even mean", "I’m astonished at how many people think opening the back door in the morning is such a big expectation. Letting the dogs out consists of turning a knob and pulling a door. A 5 second task at most. Letting them back in is the same. It’s not unreasonable to be annoyed that OP has to get up early to do this himself", ">Because she's doing 90% of the work on dogs he is 50% responsible for. \n\nI love when people just start making shit up on AITA.", "Dogs go out several times a day. She can take the evening shift if she needs to get her sleep and get started first thing in the morning.", "Depending on where they live she might have to also watch them outside. Like I live in the countryside w a small dog so I always have to watch her", "You're assuming they HAVE a back door with an awesome yard for dogs to pee in, when it may be a case of living in an apartment that requires one to get dressed and take the dogs out for a walk of some length.", "The dude said himself that she's responsible for them all day because she works from home.", "Yes, which is why if she has a problem with taking them out in the morning, she needs to say it and not make up excuses like she currently is. The fact that she lies about it makes her an AH", "He said it makes sense she puts the dogs out.\n\nShe ignores them for hours. So no, she's not doing 90% of the work.", "YTA and you know it. Dogs aren’t children and you’re completely abdicating all of YOUR responsibility here. What she should be wondering is why she would ever have a child with you, when you’re useless to help her.", "YTA\n\nThat’s just an AH to say no matter how you soon it. Being good with pets is not an indicator of how anyone is with children. You need to apologize ASAP. If it were your gf posting about this I would advise her to find a new bf.", "NTA. You would be if you kept subjecting those helpless dogs to her though. Dogs are significantly easier than babies, and frankly I very easily can draw the conclusion that she would be a terrible parent. I’d leave someone like this for having so little care for something that is dependent on her.", "Your edit has me worried. You realised you should not have said anything about her future parenting!? Did you realise someone who treats a dog like that shouldn't be a parent at all??", "Nta. My old roommate was like this, but with feeding the cats and changing their box. This is a pretty big red flag, tbh.", "NTA\n\nAlso anyone can be good with someone else's kids because those kids can be given back to someone else. \n\nI would be asking myself about the kids as well. Also I would be questioning a long term relationship with someone who isn't a pet person. She doesn't truly seem to be as she isn't doing the basics like taking them out in the mornings. It is cruel to the dogs.", "NTA. There’s a reason why a lack of empathy towards animals is viewed as psychopathy. Domesticated pets are otherwise helpless with us. They can’t communicate to us in a way we can clearly understand. Not unlike an infant. \n\nYour gf is being negligent as hell and honestly, she probably doesn’t care for the responsibility of pet ownership. How does she typically bond/interact with the dogs? Dogs can hold their urine in for about 6-8 hrs on average so the fact that they’re begging to go out because they need to go that badly is just so cruel and they’re being put at risk for a UTI. That won’t be a cheap visit to the vet.", "Yeah NTA. Dogs are way easier than kids.", "NTA - I see your edits.  I think you really do need to think long and hard about having a child with her.  You seem to be making excuses for behavior that is completely break-up worthy.  Not just cruel to the dogs, but comfortable letting you do way more than your fair share.  It says alot.", "NTA. I understand people saying you shouldn't have commented on her future parenting abilities, but, I don't know, I think it's fair. She's being cruel to the dogs and failing to meet very basic caretaking responsibilities. If I were in your shoes, I'd also be worried. You two have been together for several years, your relationship is clearly serious, and if you're thinking of having kids together, you should be having these conversations. Better to do it now than when you have a newborn baby to take care of! These kinds of conversations are sensitive and should be approached delicately, but I don't think you were at all out-of-line for bringing up your concerns.", "Yta because you have no idea what it is like to carry and worry and grow a child and then birth that said child. And the fact that you compared her leaving animals that have not whimpered to be let out with the 2ay she would be a mother to a baby she has borne and birthed is absolutely ridiculous.", "ESH\n\nGirlfriend isn't doing what needs to be done, but you're not supporting her either. Animals and kids don't care about anyone's schedule and it's easy to get burned out. Neither of you could handle a child. \n\nCome together and figure out a routine that works and support each other. Rotate shifts with morning/evening care. Burn out is real with childcare and you guys are nowhere ready.", "Ehhhhhh, weird thing to say to someone, but she had to hear it. If she can’t keep her cool with dogs then how do you expect her to act with children who won’t do as they  are asked and are objectively more frustrating to handle? NTA", "Dude. She dislikes dogs and has no interest in them. I am willing to bet money she got the dogs with you because of you. Treating dogs badly doesn’t reflect the parenting, it reflects the obvious scream “get rid of these animals”. If you love the dogs so much, take them and go. If not, just rehome them sincr she made it very clear that she doesn’t like the dogs like you do. YTA towards the digs and yourself, plus the comment about the kids is unfounded; you just ignored sll the signs that she gave you about the dogs.", "NTA except for a little bit for staying with someone who neglects your dogs. Definitely don't have kids with this woman until you work through this issue.", "Truth! Our boy passed away but I still open the door to let the cats out first thing. Before people come for me, we let the cats out into a screened porch, they’re not out there free roaming. \n\nI also used to also get up at 3-4 am if he whined to go out. As he got older he went to sleep earlier so sometimes he would need to make super early so he woke me up.", "I’m an animal person but it’s completely reasonable that someone who’s never owned a dog before might find out only after adopting a dog that they hate taking care of dogs. Still a living being that she and OP made a commitment to take care.", "How is what OP said harsh if what the GF is doing is cruel?", "Honestly, she probably doesn’t care for the responsibility of pet ownership. How does she typically bond/interact with the dogs? Dogs can hold their urine in for about 6-8 hrs on average so the fact that they’re begging to go out because they need to go that badly is just so cruel", "NTA. I think you really do need to think long and hard about having a child with her.", "I'd loathe having a dog. I like my toddler. I have a 2 y/o, 13 y/o, and a 17y/o - I've adored them at all ages.   I also have other much-loved creatures - dogs aren't really a litmus test for the ability to parent or care for another living thing. There some dog owners I absolutely would not trust with a human being and plenty of people who dislike dogs (or pets in general) and are good parents.", "It sounds like her demeanor towards animals/dogs are different than children. I personally don’t enjoy being around dogs and try not to put myself around them. However when it comes to kids, I find my demeanor is much more warm and accepting. It seems like that’s the case with OP’s girlfriend.", "Like parenthood, the fur babies should be a shared responsibility. If she is up first then she should be taking them out. Or equally split. He takes the even days, she the odd. Or whatever. \n\nThey agreed to get the dogs together so it is up to both of them to care for the dogs.", "My mom's got a tiny lil morky and that thing will spitefully piss on anything my mom owns if she's even the slightest bit displeased about anything. And with friends/family who tells me dogs don't do that, I bring them round to show them firsthand how spiteful the lil beast is lmao", "NTA\n\nIt's straight-up cruel to treat dogs like that, let them out for fuck's sake.", "not everyone has a fenced in yard, bud", "me too...wake up, let the dog out while does his biz - the kitties and I head down to the bidet for our morning routine then I feed them all while I make my coffee/tea - every day, it's clockwork and effective.", "My oldest will straight up hold it for 16 hours if he can just stay in bed and be cozy. He's so lazy. I love him.", "Yeah, I don't get the Y - T - A judgement. If OP  is the asshole for tolerating the girlfriend's behavior, surely that's an ESH at the bare minimum?", "Did anyone say that WFH isn’t work? My man works from home 2x a week and at the office the other 3 days. He takes the dog out every morning because he’s up before I am. It’s part of his AM routine regardless of where he’s working for the day. Also, OP stated he works night shifts and as a result, he takes the dogs out the majority of the time during the day, including a lengthy walk right before his shift. \n\nIt’s not at all asking for too much for his gf to take them out first thing in the morning if he’s sleeping in due to working night shifts. Her common excuses are that the dogs were playing or didn’t need to go out yet. Anyone who owns dogs knows that when they’re up first thing in the morning, they’ll need to go potty. OP’s gf also acknowledges that the dogs are meant to go out first thing in the morning when he reminds her of this priority. If she was too busy with work, she’d probably vocalize that, but it’s reading like she’s just being lazy and putting the task off because she knows if she doesn’t do it, OP will.", "Couldn’t agree more with this statement. I also loathe dogs and their dog behavior. However, I absolutely love being a mom to my now toddler. Even when she being naughty I’d much rather deal with that over a dog, all day everyday. \n\nI know several people who have dogs and love them, but they have mean attitudes towards children and they are proof that kindness towards pets doesn’t translate as kindness towards babies/children. \n\nNot everyone is built the same and dogs aren’t the same as people. The potential to be a good owner towards an animal is never 100% truth to being a good parent to your kids.", "Then I sincerely hope you wouldn’t agree to adopt two of them with your partner and then choose to neglect them in the morning while your partner who works nights is just trying to get some sleep. \n\nLoving or disliking an animal does not say a whole lot about how a person may parent. But neglecting a living being you chose to take care of? Red flag. \n\nI hate snakes. Absolutely terrified of them. If for some reason I made the dumbass decision to agree to watch one for somebody or worse adopt one with them, that thing will still be fed, given water, and the enclosure will be cleaned.", "Is she doing the care for the dogs or is she unable to because as you say she’s at work the moment her eyes open each morning. 🙄", "Walking a dog is  relaxing if you LIKE walking dogs. No amount of money would persuade to go out in the morning under the rain collecting dog poop.", "Lol some times it’s worth holding it if you’re comfortable with no responsibility 🤣🤣 This is what it means to live.", "He says he works nights and dies the big long walk in the evening. Her doing a quick pee run seems fair", "They are their dogs. They researched and adopted together.", "Hmmm. I don’t really agree. Struggling with infertility doesn’t mean you’ll be the perfect parent, and we all deserve to be able to voice our concerns about our partner’s parenting - not being free to do that is really dangerous. He wasn’t nasty about it, the facts are pointing towards her behaviour being the same, and it’s not okay. I don’t think it’s brutal to say that just because she’s got fertility issues. She knows what she’s doing. It’s not news.", "Brutal but truthful and (imo) deserved. It’s not even about liking the dogs, I’m an animal person but it’s completely reasonable that someone who’s never owned a dog before might find out only after adopting a dog that they hate taking care of dogs. Still a living being that she and OP made a commitment to take care. I would be concerned for her empathy and ability to take care of others even if it was only a damn fish.", "Truth hurts sometimes 🤷‍♀️", "I work from home and have for a decade. I’m not immediately at work the moment I get up. I get up, responsibly walk both of my dogs so they don’t have their bladders ready to explode, fix breakfast and then clock in. \n\nWFH is not an excuse to ignore the basic needs of a living creature.", "she may be \"responsible\" for them during the day while she's home, but i'd be **REALLY** curious to know how often she actually lets them out/walks them while OP is gone.\nit might be time to consider hiring a carer for the pups if you don't trust the partner 🤷🏼‍♀️\nOP, NTA."]}