{"id": 16350, "submission_id": "137cz6l", "title": "AITA for telling my former step mother to go fuck herself?", "selftext": "Last week I was back in my home town helping a friend take his truck to the dealership. While it was in the shop we went and got lunch at a pretty popular spot and we got sat next to my former step mother and former step brother. \n\nMy ex step bro and I don't talk but he's close with my younger sibling because for about 8 years they lived together. I was older and really never had a connection with him. \n\nI caught my dad cheating on my mother with my now ex step mom when I was 12. A year later he left us for her, moved a block away into her house, and shit sucked for a while. Life was a big slap in the face for a while, and I worked through HS and college to support my mom and brother because my dad didn't think it was his problem and my former step mother encouraged that. \n\nLater my ex step mom cheated on my dad and left him. All good in my opinion, that relationship needed to end. \n\nAnyway, she interrupted our meal and asked me how I was and I looked her in the eye and asked her what the fuck she thought she was doing. She said \"Just saying hi.\" \n\nI looked at her, and then at my former step bro. I said \"hey (step bro's name), always a pleasure to see you my friend\" (he's a civilian), shook his hand and ignored them. She tapped my arm and said \"what am I, invisible?\" and I lost it, tbh.  I looked at her and said: \"You can go fuck yourself. Don't speak to me. I don't want to talk to you, who the fuck do you think you are right now? Why on earth would you ever think I'd want to talk to you now that I don't legally have to?\" She said she was just being polite, and I asked her if she was still fucking married guys. My friend asked for the check, we left. He was cool about it, he remembers what my home life was like. But:\n\nMy brother thinks I was too harsh, my dad thinks I created drama from nothing. My wife thinks it was embarrassing even though she wasn't there. \n\nPersonally I still think she can go fuck herself.\n\nedit - my friend also thought it was extreme even though he was understanding", "created_utc": 1683184368, "permalink": "/r/AmItheAsshole/comments/137cz6l/aita_for_telling_my_former_step_mother_to_go_fuck/", "score": 841, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think i could have just been polite instead of confrontational.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Hahaha NTA. Tell it like it is.", "NTA you said what you felt. Maybe it was harsher and more explosive than it needed to be but your description of her leads me to believe that no one's ever called her out for her shit, and you might as well be the person to do it.", "I'm already not big on spouses who cheat. They're scummy. I REALLY hate people who know someone is married and fucks them anyway. That is beyond gross to me. She knows what she did and wanted to act like it was just another day in the neighborhood? I'm sorry and maybe people will think I'm an asshole but anyone who does shit like that deserves to be told off for it. She should have been the one who was embarrassed and hiding her face in front of you. NTA.", "NTA. Yes, you lost your sh#t. So what?! You said things that were bottled up for years. I hope you feel better and that this was a release for you.", "Ooof. You clearly had some things to get off your chest and I’m kind of glad you got a chance to but that doesn’t sound like it’s appropriate for a public cafe in front of her son (who you put in a really awkward position). I think it’s your Dad you really want to yell at, because as much as it’s easier to blame a stranger you don’t like for him not paying child support and not being interested, she had no financial power over him and couldn’t have stopped him sending money to his kids. He made a free choice as an adult. If he didn’t leave your mum for her it would have been someone else, if he cared about you like he should’ve he would have financially supported you and no one could have stopped him. I say this as someone who has been in a similar situation, obviously you’re not TA and you clearly have some things to say to your Dad (and I think you should but probably avoid meeting in a cafe!)", "NTA valid", "So, are you in contact with your dad then? He's the one who tore up your family. Don't get me wrong. I think that she's trash, too.", "I'm a bit conflicted.\nWere you unnecessary blunt ? yes.\nBut she approached you not the other way around.\nYour first response was to give her the cold shoulder and that's fine too in my book.\nShe does live in reality and knows your history with her.\nShe should have accepted the cold shoulder and leave it at that.\nShe didn't and by that she gave you the open to tell her what you did.\nLife gave you that little present and you took it.\nYou didn't have to but I can't fault you by setting that boundary bluntly and enjoy it.\nPetty? Yes\nF bomb not necessary but it's a feel good f bomb after she imploded your younger self life and now you have no obligations towards her.\n\nNTA\nShe kinda asked for it.", "NTA\n\nyou made it very obvious you didn’t want to talk to her but she kept pushing it. Yes you unloaded on her in fairly spectacular fashion but she kept at you until she got a reaction so I’d file it under FAFO myself.", "nta, mainly because this woman encouraged your father to not support your mother", "Yeah, it was extreme. Bet it felt good, though.\n\nNTA. But what did she expect? Delusional. Nice move with the step-brother though.", "Nope it was fair game mate NTA", "NTA. Why would she ever think approaching you was appropriate? Narcissist?", "NTA\n\nLet's some up. She fucks a married guy, gets him to walk away from his family and encourages him to not pay child support, completely ending your youth since now you had to help support a family. \n\nThe fact that all you did was yell at her shows restraint. In your place, many others, would've handed this woman a beatdown.", "YTA. All so unnecessary.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLast week I was back in my home town helping a friend take his truck to the dealership. While it was in the shop we went and got lunch at a pretty popular spot and we got sat next to my former step mother and former step brother. \n\nMy ex step bro and I don't talk but he's close with my younger sibling because for about 8 years they lived together. I was older and really never had a connection with him. \n\nI caught my dad cheating on my mother with my now ex step mom when I was 12. A year later he left us for her, moved a block away into her house, and shit sucked for a while. Life was a big slap in the face for a while, and I worked through HS and college to support my mom. \n\nLater my ex step mom cheated on my dad and left him. All good in my opinion, that relationship needed to end. \n\nAnyway, she interrupted our meal and asked me how I was and I looked her in the eye and asked her what the fuck she thought she was doing. She said \"Just saying hi.\" \n\nI looked at her, and then at my former step bro. I said \"hey (step bro's name), always a pleasure to see you my friend\" and then looked at her and said \"You can go fuck yourself though. Don't speak to me. I don't want to talk to you, who the fuck do you think you are right now?\" \n\nMy brother thinks I was too harsh, my dad thinks I created drama from nothing. \n\nPersonally I still think she can go fuck herself.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. She can, indeed, go fuck herself in this situation. You owe her nothing, not even being civil.", "Eh, why spare her humiliation? Civility is for innocents, not the culprits.\n\nNTA", "She came looking for trouble. She could have just left without speaking to you. NTA", "I caught my mom cheating on my dad when I was 14. What I would give to say something like this to my mom's ex-boyfriend.\n\n&#x200B;\n\nNTA.", "NTA, you owe her nothing. Now that you are an adult, you can tell her whatever you want. I actually think you showed restraint.", "YTA, I mean it was your dad who cheated, seems like you want to blame someone else for his weak character. He broke your family apart, no one else.", "Acting civilly towards others is always better that creating chaos. Cold shoulders are fine, just ignoring her would be great, but you chose to come in with full on verbal violence. I truly understand your feelings toward her, but this level of response was unnecessary. YTA.", "NTA\n\nAnd before people start judging otherwise, seldomly have others been in situation like this. OP has had a bad childhood and some traumas stay there, forever. Former step mother was a b...h but now wants to reach out, \"just saying hi\", like nothing ever happened. Although his father got what he deserved I don't understand why he thinks OP created drama for nothing. \n\nAll in all, OP no need to trouble your mind regarding this, and if people have a problem with it, just tell to go f..k themselves.", "NTA - But dear god do you bear resentment against those people.", "NTA, question why does it seem like you dont hold any resentment for your dad over what he did? After breaking your family and then ruining your childhood I would have gone no contact permanently.", "NTA", "NTA ---- It sounds to me like you finally got the chance to tell ex step-mother what you thought about her and you took it, good for you sometimes you really need to get something off your chest you make yourself feel just that little bit better.", "NTA, you called it for what it was and set firm boundaries for any possible future encounters.", "NTA", "I'm feeling a little bit ESH. The woman has no business talking to you AT ALL! But, your over-the-top response was more than what the situation called for. Keeping a calm, civil tone could have given you more leverage with your words. \n\nEx.\nHer: what am I? Invisible?\nYou: Hardly. I'd say, \"unwelcome\".\n\nOR. Ex. \nHer: How are you?\nYou: Fine. Let me introduce you to my friend. Friend, this is the cheater that my dad left my mom for on to have her cheat on him. Cheater, this is my friend.\n\nAll in all, I don't blame you for your feelings. Expressing them probably felt amazing. So what if you were an AH? I think you were entitled to be so if just for a moment.", "OK after reading your comments, I changed my mind. YTA.\n\nYou should have   just walked the fuck out, instead of sitting down next to them. You WANTED this fight.\n\nyes she's awful but you created this situation by going sitting down there.", "In wich universe yta? Dude, it's insane think to \"talk\" to someone if you destroyed his Life. \nThe only think you can do it's pretend to not see him/her.", "NTA. People like this deserve it", "NTA. Truth hurts.", "NTA. Good on you.", "NTA.  She had it coming, and so does your father.", "Gosh I love petty \n\nNTA", "Na fuck em, you clearly had something built up for a couple of minutes she will never talk you  again", "NTA, she can go f herself", "NTA. I had a terrible stepmother and had a shitty home life because of her. I dream of the day I can say something like this to her. Bitch.", "That's how I feel but after talking to my wife I really think I should have just been polite and left instead of explosive.", "I really don’t understand this sub. \n\nGleefully jumping on the opportunity to create drama rather than remaining still and avoiding drama when it’s unnecessary is what people call out as AH behavior 99% of the time, but when it’s OP who was so “disgracefully wronged” somehow everyone cackles and says LOL NTA. \n\nThis sub isn’t “am I correct in what I said” it’s “am I the asshole.”\n\nI would think passing up the opportunity to move on and coolly brush past this woman rather than gleefully create small town drama is by definition asshole behavior.", "This I always call those reactions the pressure cooker effect.", "I just feel for the kids and ex wife. It seems like his dad and step mom deserve each other", "don't you know itsnever the man's fault they cheat. it's the cheating harlett that seduced him fault.", "This woman had the audacity to think she had the right to talk to Op after everything....", "Takes two to cheat like it takes two to rumba.", "Fair enough.", "I was sat next to them by a server/host, I didn't choose the seat, I didn't know they were there. Once it happened I was content to just ignore them. I didn't start the conversation.", "we didn't choose where we got sat", "I didn't start the convo", "some people just need those explosives tho. \\*thumbs up\\*\n\n&#x200B;\n\nyour wife should understand why and how that reaction is not embarrassing.", "Nah. Fuck that. Home wreckers need to know that they will be held accountable.  The gall on this cow thinking it's all water under the bridge. \n\nSo NTA, it's not even funny.", "You were polite. You were civil with ex step bro and simply ignored her, she could have taken that L and left well enough alone. Everything after that is on her.", "> my wife\n\n you are old enough to be married?\n\nI thought you must be like 16 or something, You sure acted like a sulky teenager.\n\nYour wife is correct.  You should never have sat down there in the first place", "It's easier to be civil and forgiving when s\\*\\*\\* didn't happen to you. Let them have their opinions, you said what you needed to say. NTA", "They're no longer together, I think", "But the dad is responsible first and foremost for his family. It doesn’t matter who he cheated with, all that matters is he cheated.", "You. Could. Have. Walked. Out.\n\nSorry but it really seems like you were hoping for the chance to shout at her.  I get that you have a lot of anger towards her (I would like terrible things to happen to my own step mother) but really — walk away, it's better for you not to get involved. It just upsets you.", "So?  \n\nLike I said:  why didn't you  just walk   out and eat elsewhere?\n\nYou helped to create this situation by sitting next to them: that was provocative, it was ridiculous to assume they'd not talk to you", "He acted like a 16 year old who was force to put his life aside and get a job to help support his family, after this woman encourage his dad to not pay child support. He acted like a 16 year old who had to grow up before his time. He acted like a 16 who had to console his mother and brother after his dad left. He acted like the 16 who no longer had a dad. \n\nSo yeah. Maybe that 16 year old had somethings to get off his chest. \n\nAnd why should the OP change seats. This woman approached him, and wouldn't leave him alone until he acknowledged her.", "can't argue with the judgment.", "Sometimes, you just want to have lunch and not a perfect setting.\n\nEx-step-mom should have left after rhe first \"what do you want\" but she pushed it.\n\nWhat's the saying? Oh yeah FAFO, she pressed when it was clearly unwanted. Age is irrelevant, because we weren't there for the home life that was wrecked.\n\nNTA OP, though I may suggest next time trying to stay further away. Though, I understand it's not always possible in some circumstances.", "You should argue with it.  That person is a pushover.  Keep telling it how it is my man", "Yeah, you should have asked the waitress for a different table or something.", "Yeah, and so did the stepmother, twice in fact.", "I respect the judgment but I’m not upset about it. It was a long time coming and I’m glad I said what I needed to.", "Because I was 100% content to sit there and ignore her and live my life", "Like she just wouldn't of walked over there. NTA.", "We are going in circles. She could have been anyone. The dad was the one who cheated on his wife. He is solely to blame for the disruption of his family, he was the one making these choices. I mean he could have cheated with escorts if he wanted to. The decision to be a cheater and then leave his family in a bad spot was his and only his.", "Yeah, must feel good!", "That was   never going to work.\n\nIs she a terrible and annoying person? yes. But you went and sat next to her, so of course she spoke to you. Annoying people do annoying things. The best thing is to avoid them.\n\nYou set yourself up for conflict. You poked the bear.  \n\nI'm saying NTA because she needed to hear it and she had no business trying to pretend there was no problem beteeen you, but you were still foolish to think that she wouldn't have done just that.\n\nSeriously: the best way to treat these people is to AVOID them.\n\nI can't help feeling you sat there because you WANTED a fight.", "Sometimes you’re an asshole. I accept that. Thanks for responding.\n\nEdit - no sarcasm", ":-)\n\nFrom one occasional asshole to another, I agree!", "Sometimes I wish there was a Justified AH option.", "You have a good night friend.", "NTA. And you even asked her about her hobby.", "NTA.\n\nIt always surprises me when people think a situation is about the environment only. Your dad's a cheat. She's a cheat. \n\nYOU are the child who found out. YOU are the one who picked up the pieces and supported your family. YOU are perfectly valid in your feelings, YOUR feelings matter here. It's YOUR trauma.\n\nIt wasn't even slightly harsh or embarrassing after what you had to go through. I'm sorry you went through that, I'm sorry people expected you to be the bigger person or noble or some shit. YOU deserve to say it how it is, to feel heard once at least.\n\nI think you should say similar to your Dad to be honest... not sure how you salvaged that with Dad but hope you are happy and forget all this nonsense. Tomorrow's chip paper.", "NTA the only problem is that you didn't go far enough. The gall of a woman to encourage a man tonight take care of his own kids and then she then she says hi to you like nothing happened.", "NTA.\n\nHomewreckers can all go fuck themselves.", "YTA - sorry but this sub is ridiculous, feel free to downvote away.  She just was asking how you were.  There is no need for a public display of immaturity because someone who you used to know asks you how you are doing.  \n\nThis isn't a \"is what I said accurate\" forum.  It's am i being an AH. Are we supposed to judge her to be TA solely because she asked someone she knew (and used to be related to) how they were doing in a neutral setting, when she happened to bump into them?  \n\nYou certainly, without a doubt, were TA.  People are giving you NTA based solely on \"she's a homewrecker, she deserves it!\"\n\nYour dad is equally IF NOT MORE to blame for EVERYTHING that went wrong with your childhood, regardless if she \"encouraged it\". He is your dad and you were his responsibility, not hers.   And i doubt you do this everytime you interact with him.  What she did was harmless.  Grow up, or get help.", "Probably gonna get downvotes but yeh ESH it was an extreme over reaction and you don’t seem to have the same anger towards your father who has just as big of a role in this than her. I just don’t get why you decided to talk to your step brother when you’re not close and you just berated her for interrupting your meal.  You could of just left it at the “i was just saying hi” as you made it clear then you do not want to interact. Your feelings about her are valid but your reaction to that situation was overboard. Your friend even though he understood thinks it was extreme, your step brother also thinks it was extreme so yeah I’m gonna say you were overreacting. Your dad seems to have gotten away with all of it though.", "Nah. She said hello. You went from 0 to 60 quicker than a twin turbo corvette. You both have your reasons. Conversely, I understand your feelings towards her. Next time, find a new seat or maybe better, a new restaurant.", "Why did your mom let you be responsible for the family? That shouldn’t have been on you. Alimony, child support are a thing. Your dad doesn’t just get to decide to walk away .. and your step mother had no say over this either. \n\nHonestly, NTA for what you did, I’m just disappointed reading about yet ANOTHER parentified child.", "YTA I get you don’t like her, fine, I wouldn’t either, but I really don’t see why you needed to go that far. I think people are right, you’re acting like a teenager and making shit awkward for people around you. I feel sorry for your friend and ex-stepbrother here most.\n\nYour feelings are perfectly valid, but not everything needs to be said. \n\n\nEx-stepmother is an AH in general, but in this particular situation I don’t think so, so I’m not voting ESH, even though, bigger picture, she’s the bigger AH", "NTA.\n\nYour dad fucked another woman while married to your mom and he has the gall to tell you *you* created drama?", "Yes, someone made an attempt a small talk and you immediately responded like an asshole. Because you're the asshole. You literally could have done the bare fucking minimum effort at socializing.", "YTA because you were hostile and rude, and you know it. Also, you did create an uncomfortable scene for the friend. Do you really think people want to be witness to unnecessary drama?", "I’m gonna guess you needed to say something for a long time. Maybe not the best time and place but I’m gonna bet that helped you a little. I do like that you were polite to your step bro. Nta", "NTA don't fucking cheat and don't be the -insert heavily offensive word- that sleeps with married men or women.", "She didn't take the hint to back off so you had to be more explicit. I don't care what your dad thinks and neither should you. Your brother wasn't the one that had to work to support him and your mom. \n\n>My wife thinks it was embarrassing even though she wasn't there.\n\nOkay? I don't understand this behavior. \n\nNTA.", "ESH. Your former step mom is obviously an AH. After your first rejection she should've just sat there and keep her mouth shut. \n\nBut you were also kinda an AH in this instance because your friend's enjoyment of their meal was affected by your actions. If you were eating alone then by all means blast her.", "Idc if you’re the asshole that shit was funny", "Your wife should be more concerned with your thoughts and feelings and like, how this made you feel and why you had that reaction. Not how gauche it was.", "YTA but it's another case of \"justified asshole\" as opposed to this being a negative judgement. The behaviour was totally warranted in spite of causing a public disturbance.", "NTA. It was a pent up feeling & thought that needed to be said that was not only long overdue, but I'm pretty sure it lifted whatever burden you might've been feeling. Or just felt good to say it. In my mind I'm thinking \"the audacity!\" (of ex step mom) lol", "NTA - you were able to finally tell someone who was the cause of major shit in your life what you thought of her. good for you! you got your chance and you took it.", "NTA", "Oooh NTA! I had an evil stepmother situation that led to my permanent estrangement from my father after having to move out at 16 because of their crap. You have lived my dream of telling that awful woman off! I'd love to do the same, although I'd likely end up having to run off with nausea at first sight, as that's what happened the last time I was within 5 feet of my father.", "NTA at all!\n\nTBF, a small part of me wishes I get the chance to say this to my homewrecker step father. Good on you OP.", "NTA so I’ll ask, how was the meal ?", "NTA- She deserved it", "NTA. Maybe the F bombs were a bit excessive.", "Sounds extreme. But people should sometimes expect extreme reactions. I say NTA, but a little extreme.", "NTA. She knows what she did.  You had every right to tell her that.  And who cares what your dad thinks. He's an ass too.   But karma got  him.   Nobody knows what you actually went through but you.  Trust me.  I've been there.", "NTA - but not because you were right. Could have blown her off any number of low key ways so she would still know exactly where she stands with you.\n\nI say “NTA” because if you are carrying so much anger around that even years later you can’t keep from exploding on her in public, you probably need some help with it. Maybe consider seeing a counselor or therapist to get deal with some unresolved stuff.", "100% NTA - good for you! I love ignoring people in public to their faces lol nothing pisses them off more.", "In the moment you overreacted. But this was years in the making. nta", "OP I give you props for speaking your mind. She will get over it.", "If anything you should raise your voice while asking her about her still fucking married guys... Also tell her that despite SHE having no morals or sense of right and wrong, YOU chose to surround yourself with people who have morals. And she definately can go fuck herself.\n\nNTA", "I hate all the N T A comments. YTA obviously, but it was still funny and probably deserved. That doesn’t make you less of an asshole tho as so many people in this sub have forgotten. You can still be in the right and the asshole.", "YTA for your reaction.\n\nYou created indeed unnecessary drama. I understand that you've been angry with her and yes, her \"Am I invisible\" was a bit over the top, but you could've been handling it more mature than *that*.", "Justified YTA", "YTA - you were in a public place and created a disturbance for the other diners. Why didn’t you ask to be seated somewhere else or leave when you saw her?", "YTA", "If it felt good, it was worth it. Bottled up feelings don't do any good. I hope it helped you. NTA", "YTA. While you may have been right, you were absolutely an AH", "YTA - In a somewhat good way, you let her know that her past behaviour has a current impact, and you flushed her reputation down the toilet at the same time.\n\nWas this an AHole move? Yep\nCould this drama have been avoided? Yep\nDo we the readers give two shits? Nope.\n\nOWell done.", "YTA, but justifiably so. Sometimes being TA is the way.", "ESH. You owe her nothing in terms of respect, but allow yourself the respect of having survived and achieved despite the setbacks that others put in front of you. You endured, you escaped, you won. You are no longer that 12 year old who has to react against her or anyone from that time. You’re an accomplished man who doesn’t have time for people who tried to bring you down.", "YTA, but she definitely deserved it.", "What does 'he's a civilian' mean?", "I think the biggest issue here is you have a lot of traumatic memories and emotions built up. I don’t think you are TA but I do think that working through those memories with a therapist might be beneficial.", "Yeah she kinda deserves a little more better maybe u should have talk to ur friends and ignored her more", "First, NTA - you politely ignored her and she pushed it. But, you obviously still have a relationship with your Dad who cheated on your mother, left the family and didn't support you? I would think your Dad bears bigger responsibility and deserves your anger more than your ex-stepmother. Maybe you have worked it out with him.", "NTA what did she expect would happen? Lol.", "NTA it was something you needed to do since you couldn't do it when you were younger.", "Some people live in their own world! They lack moral sense! She’s obviously delusional thinking what she did was normal. Karma eventually catches up with them!", "NTA \n\nShe is nothing to you. You tried to ignore her, and she wouldn't take the hint.", "NTA. Well done. Now it's time to move on, bro.", "Nta", "NTA   She just wouldn't leave it alone.   SMH", "This woman teardown an entire family and she's being polite to the one person whose life was screwed over for no apparent reason eason except that she was fucking horny or what ever I gotta say you did too little if I was in your shoes I would have lashed out completely different and worse. And I will give you plus points for not lashing out on her son he did nothing wrong and you didn't bring him into it. Next time make her piss her pants that little Wussy", "You my good friend are a MAJOR NTA! Good for you to say what was on your mind. If more people said things to call people out for bad behavior then maybe a few less AHoles would be walking around today less clueless as to how their actions and words harm people. Give them a taste of their own medicine. Good for you!\nThe only thing I have a criticism about is that you never shared what XSM said after your last comment. Anything or was she embarrassed into silence?", "Well… I’m going for mostly NTA but borderline AH… I stress borderline, given the history, but you really could have been a bit more diplomatic. There’s obviously a ton of unresolved resentment there. I’d be pissed at my Dad too tbh, he was the one that actually did the cheating on mom with this lady to begin with…", "NTA- you were just being honest", "NTA but also are you doing any kind of counseling? You totally have every right to still be angry about this situation but if you’re not talking to someone professional about it I think you should. All love man.", "NTA you gave her exactly the amount of respect she deserved.", "NTA\n\nHer actions impacted you alot. It was hard as a teenager to find out about the affair, and then -- after your family broke up -- to have her move into your home. \n\nYou have alot of anger built up from the above. Her attempt to politely socialize with you are like a slap in the face given what she did, causing the anger to boil over. \n\nYour reaction may have been harsh, but understandable in the circumstances. She should have known better than to attempt small talk with you given the role she played in upending your life.", "Imagine faking nice to someone you don’t like and will likely not have to run into again. Idk what ur family and friends are thinking, this woman doesn’t mean shit to you, so why should you act like it", "NTA\n\nEverything you said was true. She is just mad that she can't destroy people's lives without consequences.", "NTA, truth hurts, good for you!", "You needed to get that out for your own mental health. It has obviously been bothering you. I feel like this was a little bit of closure for you. Don’t second guess yourself. You owe her nothing including respect. Move on. Ignore those that think you were harsh. They weren’t in your shoes.", "NTA, F IT", "I wouldn't piss on my stepmonster if she was on fire in the street. You are NTA.", "She and your father chose to break up 2 marriages, ruin the lives of not only your parents but the lives of the children involved. They both can fuck off. \n\nNTA", "NTA you tried to avoid speaking to her.  She pushed the interaction and has to be unbelievably clueless not to realize there would be resentment/animosity because of the affair.  She should have left it alone, especially after you brushed her off the first time.   Some people need bluntness ..  you were blunt.", "NTA. Extreme? Maybe but, honestly, fuck homewreckers and their shitty ways. She deserved it.", "Society says to be nice to everyone, even if it means not being true to ourselves. Worse advise ever but is strongly encouraged. I have a hard time with this. I know I couldn't have done what you did because I've been in situations similar to this. But in my head, I said exactly what you said, but just not quite the same satisfaction.", "NTA", "ESH.\n\nThis is one of those, \"You weren’t wrong, but you were an asshole,\" situations.\n\nTelling your ex-step-brother that it was nice to see him while ignoring your ex-step-mother was fine. Escalating wasn't, even though she was the one who was pushing. It put your friend in a bad spot and also made you look like the jerk.\n\nIn the future, just say, \"I don't have anything to say to you,\" and then if the other person keeps pushing for conversation, ignore them. You can even be petty and loudly tell whoever you're with that you'll need to request a different table because this person is harassing you (petty only because of volume, extra petty if you call them a stranger).\n\nDon't get me wrong, though, I understand why you responded the way you did. If you were alone, I probably wouldn't even call you an asshole, though it would still be more escalation than necessary.", "NTA. She can go fuck herself, she ruined your family and now she thinks it’s fine to act like nothing happened? She can take her ‘polite’ approach and shove it up her ass.", "Fafo.\nAnd she found out.", "NTA - haha. I guess the truth hurts", "NTA. I think politeness went out the window when she decided to get it on with your dad.", "NTA, because the biggest asshole in this situation is your dad.", "NTA. You have no obligation to be her friend or even civil to her.", "NTA. If she wanted civility she should have treated you with that as a Child. She wanted forgiveness without apology.", "NTA, it was an authentic and valid reaction. She approached you, she gets what she gets. I think for women (I'm a woman) it's so outside the acceptable norm to tell anyone to fuck themselves. But... she deserved it. I can see your wife's POV and yours.\n\nMy one caution is that you did this to the mom of someone that you don't have hard feelings for, in front of them. So this poor guy is going to have to pick up the pieces. It might have been the kinder thing (to him) to just say \"Lady, I have nothing nice and polite to say to you. I am glad to see your son, but your relationship with my dad ruined my childhood, and you know it. Next time just walk on by. This conversation is over.\" Or something that gets the same point across without allowing her to feel victimized by your anger.", "You sound unhinged. In what world is this behavior okay? YTA.", "YTA, in no way did you conduct yourself in a dignified way (that's not to say your anger isn't justified, but that doesn't mean you aren't behaving like an AH)\n\nBasically all you've proven though is that she still holds power over you to make you act like an AH.  She isn't worth behaving so lowly.", "NTA- oh man, if I ever get a chance to speak to the person who encouraged my parent to abandon me I probably would not have been able to verbally summarize my emotions as well as you did.\n\n100 NTA You got to speak out in a way that you couldn't as a child. I'm sure that was therapeutic in its own way.", "NTA\n\nYou reap what you sow. Your dad can shit his pants too. They're both losers.", "NTA It was something you clearly needed to say to her and it's her problem that she decided to be fake in a public place.   \n\n\nPeople who cheat destroy families and it's just too bad if someone lets them know that.", "Lol NTA whatsoever. Cheaters always getting upset when confronted by the wreckage that they leave behind. And they're always surprised when people don't just let it go.", "NTA\n\n&#x200B;\n\nWas it intense? Yes\n\nDoes it sound like you got some much-needed closure and made a shitty person rightfully feel shitty? Also yes.", "NTA. Sounds like you bottled up years of anger to be \"polite\" during the S\\*\\* show of their relationship. You tried to keep it together and be polite, but she kept pushing and you had to release the kraken. Was it maybe a little over the top, sure. Was it a long time coming, yep. Was it cathartic, I would think so.", "NTA", "NTA", "I don't think you should create a scene when there are other innocent people there, like your \"step brother\" and your friend you were having lunch with, who will just be embarrassed by the whole thing. I can see your reason, I just think you shouldn't have done it even though you had a reason. So soft YTA for voting purposes, although I understand why you did it.", "NTA and from a woman who would be your mom in this story... if one of my daughters did this to their ex-stepmom, I'd throw them a f\\*cking party to celebrate.  I know my kids have years of pent up anger that arises sporadically (they have a therapist), and when the top blows - it blows. I'd be fine with a public FU to her should it occur. My only rule was not at their grandfather's funeral (we all recently attended).  I personally feel like while your reaction may have been extreme, it was likely not unwarranted.", "She made you lose your cool. You could have told her to fuck off without making yourself look like the crazy one. You’re definitely not the AH though.", "Why was your mom, a grown adult, relying on her child financially for years?", "NTA.  Sorry about your dad.  Not sorry for him.", "NTA. But— nah. Forget it. NTA.", "NTA because she could've kept her mouth shut and then nothing would've ever been said.  She made that choice.", "EHS. She has no right to talk to you like nothing had happened before, which makes her TA. However, it wasn't the place nor the time to pull something like that off. It's extremely childish", "nahh theres no need to be nice to people who fuck part of your life up. There would be no freedom of speech if we had to always be nice", "NTA maybe not the best to do it in a public place, and create a scene there, but that being said she fucking deserved to be told to go fuck herself", "You made a scene in public for no reason. You were aggressive and cussing at her from the start. It’s been years. Totally uncalled for. YTA.", "Obviously you are the asshole.", "NTA, and you're my hero. She could have read the room when you first snubbed her, but she had to push it. She got what she deserved, and you should not feel bad.", "I wish I had the guts to say that to my step-mother or my mother's abusive ex-boyfriend. NTA for sure.", "That's interesting, to me I have no time for either party but the one who's married is worse IMO. They're the one who's breaking a commitment they made. The affair partner is a huge asshole, no question, but they didn't actually promise anyone anything.", "It's weird that you would hate an unmarried \"other woman\" more than you would hate the married man who cheats. That's so backwards. The unmarried partner didn't take any vows. The married partner is responsible for their own vows.", "Ngl his way is better", "She got what she had coming to her after what she did.", "She’s not a “someone” though, she’s his ex stepmother and the relationship didn’t end well. You would think she’d take a hint and not try to egg on the situation.", "Our culture of “decency” has allowed AH to go unchecked for too long. People exist with a sense of entitlement because they’re constantly getting away with the behavior they accuse others of. While your outburst may have been a little embarrassing or uncomfortable, it is important to check people. Your dad’s ex-wife now has some reflecting to do. The next time she sees the child of a home she wrecked, maybe she’ll think twice about approaching them.", "Sounds like you politely avoided interacting with her until she decided to start something and then tactfully grey-rocked her until she pushed it further. NTA", "NTA, sometimes that explosion is the natural consequence to some FUBAR level behavior…. Kinda reminds me of the time I blew up on my aunt when she kept pestering me to go visit her son, who molested me for basically my entire childhood, which she knew about…. Some people are just too much to be polite with. You did good, for yourself, and I hope you feel better about it now. 💜", "In case there was ever any doubt in her mind how you felt about the entire situation, you have now cleared that up for her.\nNTA", "My dad has always told me 'it's not your fault some people can't take a hint. If they require a 2x4 to the ego, go for it' \n\nThis woman should have taken the hint. She didn't. NTA.", "It was extreme depending also on your age. But I do think sometimes we are willing to take the natural consequences, then we are free to make an embarrassing scene.\n\nI do think YTA cause your stepbro and friend didn’t need that energy. I’d have kept it more polite…‘didn’t you hurt enough people? I’d like to have my lunch in peace, and yes that means acting like you’re invisible. Please don’t speak to me ever again. Thanks’\n\nAlso to not lower yourself to that level, you did nothing wrong until then in a way…but I fully acknowledge you still barely did anything wrong compared to her…smdh, some people are just cheaters through and through.", "It's definitely not something you should make a habit, certainly. But I think this was a long time coming.", "Eh, it happens. It’s understandable that you find the woman who broke your family and then hurt your dad abhorrent. The minimum she could have done was apologize for imposing hardships on you and try to be happy with your dad. Instead, she (as you put it) “fucks married men.” It’s not a surprise that you would be less civil to her than you would to other people. And frankly… she needs to stop looking for attention.", "Not at all, that woman is someone who ruined your childhood by distancing your father from your family and put your life thru difficulties of not having a normal father-son bond with him, just to give him a taste of his own medicine afterwards. You have every right to be mad about it.", "Nta but she could have been polite to you by NOT talking to you. I get why you said all those things but she also could have taken your hint and gone away when you were polite to her son and ignored her. Your nta for telling her off.", "You know what, she helped break your home then wasted it. I wish I would’ve spoken my mind to my former step so NTA. Consequences.", "Surprising that you still talk to your dad at all.  NTA", "No .. she can’t take a hint .. poked you and put it in another level.. NTA and Pat yourself for doing a very very good job! \nI m sure your mom is proud of you", "She also had that opportunity and wouldn’t leave him alone.", "When an AH keeps pestering you, doesn't take a hint and needs to be reminded of their AH behavior in the past, then it's not an \"opportunity to move on\" , it's an opportunity to stand up for yourself, and to remind small town drama to stay in its lane.", "But is it not ok to AH an AH back should the opportunity to do so present itself especially when initial AH attempts to engage OP, who at that stage was definitely not an AH in further AHness? Sometimes you gotta out AH the AH.", "100% agree with this.  I mean honestly what *is* the point of creating that drama? To what end?\n\nMy ex's family *hates* me, for no good reason, simply because my ex and I got divorced. My ex and I forged an amazing co-parenting friendship after the divorce which lasted over a decade. \n\nWhen he passed away, his family used the funeral, where I took our daughter, 14 at the time, to pay her respects to her dad; to bash me in their \"funeral speeches\".\n\nIt was bizarre and uncalled for, however I took the high road, and continued to do so in the following years - because any other reaction wasn't going to change anything- it would have just created more drama.\n\nDrama for the sake of drama is something better left for kids. I have no interest in it", "Sorta. He was civil at the start until she didn't get the hint and decided to push him. He would have been the asshole if he entered the restaurant, saw her, then unloaded. NTA when she 100% forced him to have a discussion.", "When the drama involves a well deserved verbal pay back it is kathartic in addition to be food for thinking for the culprit.", "Right, that was 100% asshole behavior. OP YTA", "This lady wasn't being nice or civil. This was a power move. She was trying to make OP do something she know they wouldn't be comfortable with. You don't just destroy a kids family and turn their dad against them and go say hi to them in public. She knew what she was doing. She just wanted to harass her victim.", "I feel like it depends. My aunt's husband cheated on her with one of their casual friends. She found it after that the friend had openly spoken with other people about actively pursuing him, repeatedly buying him drinks when she met him in order to get him drunk to be easier to convince and overall just being aggressive in her pursuit of him. \n\nThat doesn't excuse my ex-uncle for being a cheater and what he did was still terrible (he even left my aunt on the day after their wedding day, after they had thrown a big party for their entire family and friends to celebrate their love, despite having been cheating over her for years and known he was going to leave for months), but whenever I think about the woman he cheated with, I'm stunned to my core over how awful, amoral and disgusting a person she must be.", "...said nobody in this story at all. Who is this comment even aimed at?", "Is OP holding their dad accountable the same way?", "You made it clear that you didn't want to talk to her, but she kept pushing it. I submitted to FAFO myself", "This! Why should OP have to politely and quietly end their night and leave because an AH with no shame for the behavior that completely altered his childhood has no problem interrupting his evening and inserting themselves in it? Now that she knows the damage she causes maybe she’ll think twice next time.", "From the story, she didn’t get shitty and performative.", ">Sometimes you gotta out AH the AH.\n\nWhich therefore also makes you an asshole.  There's not, like, a limit to how many people can be assholes in the world or in these stories.", "People react differently in certain situations.\n\nYou're not in any place to invalidate OP's feelings just because you chose to take the high road and he didn't.\n\nI think you missed the point of who created the drama. The whole telenovela started with his dad and ESM years ago. He had resentment over that hence the blow up. Sure, he could've been polite.. but then again, he was minding his own business until ESM approached him. \n\nYou treated people like shit? Guess what... they'll treat you the same way when the time comes.", ">NTA when she 100% forced him to have a discussion.\n\nAbsolutely, he would have been an AH to himself if he had danced to her tune.", "I think it's meant to be sarcastic", "Why. Should. He. Walk. Out.? He had every right to eat there. I swear, I'm getting sick and tired of people insisting that abused people bend over backwards to accommodate the abusers for the sake of \"politeness\" and \"taking the high road*. Some people need to be told the truth.", "I was going to say, he is NTA but Dad sure is in the running. And who cares if Dad thinks it's unnecessary drama. He sure created a lot of it in the past.", "Who knows?  And that's not relevant to his question.", "They should", "I think that is a very nice way to look at it.   The 16-year-old inside OP needed to get out and finally have his say.", "Coming up to an ex-stepchild and intruding on their day in public after you encouraged their dad not to pay child support (which in the US would basically mean he had to work under the table unless OP's mom refused to go to court) and basically DEMAND quietly, with false politeness to be acknowledged is pretty shitty and performative in my book.\n\nIt reminds me of an old HULK comic book from the nineties where Bruce was stuck in his mind and trying to get his child self to react in front of his mothers grave, so child Bruce hulked out and roared then transformed back and said \"you wanted a reaction, there's a nuclear Gamma reaction.\"", "Yeah it's clearly sarcastic, but in response to something nobody said.\n\nIt would work if the comment they replied to said something which directed all the blame at the ex-stepmum like \"I hope you still speak to your dad even though your ex-stepmum split your family up\" as though his dad had no part in it.", "it's not about his right or politeness or the high road or bending over\n\nit's about avoiding avoidable stress\n\nnothing good comes of these encounters", "This is the way. And pretty damned mature of you. She initiated the contact and conflict and you appropriately told her to fuck off. I don’t understand the YTA votes as if you don’t have the right to be pissed off at someone who ruined your life.\n\nWell, that said, it’s still 💯% on your dad for cheating, so the anger feels a bit misdirected, but still valid. If not her, there were likely others.", "Yeah, my response.to that would have been \"NOW you're worried about drama!?!?!?\"", "Based on your extremely one-sided logic, anyone could have hooked up with the dad, no one ever did it, just the ex stepmother. The decision to cheat together with a married man and then leave his family in a bad spot was her and only her. Like how that sounds? I don't think so. \n\nBoth of them are cheating AHs. Don't put all the blame on one to justify for the other.", "She made a conscious decision to be with a married man too. It takes two to cheat. She was not an innocent victim.", ">You set yourself up for conflict. You poked the bear. \n\nShe started the conversation, she literally \"poked the bear\" on the arm. What a dumb attempt at twisting the entire situation just to blame OP.", "How was that only her decision? Did she force him at gunpoint? If not, it was his decision to leave his family. This is not her family and who knows what he told her.", "Maybe the dad told her the typical „it’s over between me and my wife anyway“. OP doesn’t know that. He knows for sure, his dad screwed up and his dad is the one who holds responsibility for him.", "OP could have walked away.   Deciding to sit down next to his abuser was 'poking the bear'", "It's funny you think that excuses cheaters. Also:\n\n>Life was a big slap in the face for a while, and I worked through HS and college to support my mom and brother because my dad didn't think it was his problem and **my former step mother encouraged that.**\n\nShe was very well aware. They both responsible.", "OP could also have enjoyed his meal without interruptions. But she decided to start drama. He doesn't have to walking away from everything just to not upset a cheater."]}