{"id": 16486, "submission_id": "1391t2g", "title": "AITA for calling my daughter selfish for not helping her brother out?", "selftext": "\nThrow away for privacy. \n\nI (43M) have two kids. My daughter (21F) and my son (24M). My son has been going the a tough time. He and his girlfriend recently broke up, but they have a one year old son together. My son gets his baby on the weekends, but because of his work schedule he needs someone to help watch the baby in the evenings. My son has been staying with my wife (his stepmom) and l since he and his ex broke up, so my wife usually watches the baby during the evenings on the weekend. However, this weekend she is going out of town, so my son has to find someone to babysit the baby. I would watch my grandson, but I have to work too. \n\nI suggested that my son asks his sister to watch the baby. My daughter hasn’t had much to do with me or my son since I married my wife a few years ago. My daughter and my wife don’t particularly get along, but my wife won’t be in town so I don’t see a problem. My son called his sister, and asked if she was working this weekend. My daughter said no, and she was just planning on spending time with her girlfriend and cleaning her house this weekend. My son then asks if it’s possible if she can watch the baby for a few hours this weekend. My daughter came up with an excuse to why she couldn’t do it. My son told her that he was willing to pay her to watch the baby, but she still said that she couldn’t. He explained his situation, but my daughter seems to have no empathy. After they ended their call, I called my daughter. \n\nI asked my daughter why she can’t help out this one time. My daughter still insisted that it’s impossible for her to watch the baby for a few hours, so I told her that she’s being selfish by not helping her brother knowing his situation. My daughter has a habit of crying to get out of things, so that’s what she did. My daughter cried and told me that I expect her to drop everything for her brother all the time. I tried to tell her that this wasn’t about her brother, this is about her nephew. No matter how she feels about her brother her nephew is innocent. My daughter then hung up abruptly. I don’t like to leave things unresolved, so I called her back a few times. Her girlfriend then inserted herself in our conversation, and told me to stop calling my daughter or she would block me. I then got a call from my ex-wife calling me an asshole, and telling me that I need to apologize to my daughter. \n\nI don’t think I was being unfair to my daughter. My son is having a hard time, and needs some extra help. AITA or is my daughter being selfish?", "created_utc": 1683321706, "permalink": "/r/AmItheAsshole/comments/1391t2g/aita_for_calling_my_daughter_selfish_for_not/", "score": 38, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I called my daughter selfish for not babysitting during the weekend for a couple hours so my son can work. \n\n2. I could be an asshole because I called my daughter selfish when she said she wasn’t able to watch the baby. I could have been more understanding.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA.\n\nShe said no. She does not owe anyone an explanation beyond that.", "YTA\n\nYour daughter has her own plans. Your son can hire a babysitter.\n\n>No matter how she feels about her brother her nephew is innocent.\n\nYeah the baby is innocent, but the baby also is NOT her responsibility.", "YTA. The fact that you couldn’t accept your daughter saying no to helping your son definitely makes me think that you do favor your son and just expect your daughter to drop everything to help him and that is extremely unfair of you. It doesn’t matter why your daughter said she couldn’t do it she told both your son and you no multiple times so let it go and apologize to your daughter for how your treating her.", "If he can pay your daughter, why don't pay a babysitter ti solve the problem everytime?", "YTA “daughter hasn’t had much to do with me or my son” and you expect a favor from her? This reaction is likely why she doesn’t have much to do with y’all. Harassing her about it was fkn disgusting. She told you no. That’s all she’s required to tell you. Why she can’t isn’t of any value - she can’t. What’s with men of your age not understanding “no”.", "YTA. Leave her alone. She said no to your son but you just had to get involved.\n\n>My daughter hasn’t had much to do with me or my son since I married my wife a few years ago.\n\nHowever, she's useful if you want something.\n\n>My daughter came up with an excuse to why she couldn’t do it.\n\nShe shouldn't have to do this - she'd already said no.\n\n>I don’t like to leave things unresolved, so I called her back a few times.\n\nHarassment as well.\n\n>Her girlfriend then inserted herself in our conversation\n\nYou inserted yourself into their lives on behalf of your son. What did you expect?\n\nYTA. YTA. YTA.", "YTA.\n\nYour daughter is under no obligation to solve your son's problems. Have you always treated her like she's your son's sidekick? Because a pattern of that could explain her reaction here.\n\nYour son can do what many parents have to do: figure it out. Switch shifts. Find another family member. Trade a weekday for a weekend day with the kid's mom. Hire a babysitter. Take the day off. Why are you even involved here? Your son is an adult who can handle his own responsibilities. Your only move here, if you want to help, is to take the day off so you can babysit.\n\nYour daughter is not being selfish. She has her own life. She doesn't owe you or anyone an explanation as to why she can't watch the kid. She can't watch the kid. Deal with it like an adult.\n\n>My daughter has a habit of crying to get out of things, so that’s what she did.\n\nWELL ACTUALLY girls are socialized to express anger and frustration by crying. Sometimes we can't help it. Especially in situations where we have trauma from asshole parents who have a history of treating us like crap. Perhaps she is crying because she is legitimately upset/angry/scared. Perhaps you need to think on that.", "YTA - \n\nWeekend jobs aren't the only jobs has you suggested to your son that he find a job where he can watch his own kid?   he only gets the kid on the weekends but has to work so he can't spend time.   \n\nYou were really messed up to tell your daughter that what she had planned for the weekend was as important, nor should you have called your daughter selfish, because she wasn't being selfish. \n\nAnd your daughter wasn't crying to \"get out of anything\" she was crying because her dad was abusing her. \n\nThe girlfriend HAD to insert her self to protect your daughter FROM YOU berating her.   \n\nHe asked she said no, he calls off work.  That's it.  \n\nI swear, are you making this up?", "YTA, and you pushing and pushing says that you have never respected her boundaries which resulted in her low contact with you and brother.  I'm betting you always put brother over her too.  Don't be shocked if she completely cuts contact.  \n\nWould it be nice for her to watch the baby?  Sure, but she said no.  Y'all need to sort something else out. His kid isn't her problem at the end of the day.  Why can't your son's ex or mom take the baby?", "Yta. It's clear that your daughter is low contact with both you and your son, yet you have chosen to ignore this in order to impose your son and his kid on her. She doesn't want to look after your grandkid, she doesn't actually need any reason. It sucks for your son, but it's her right.\n\n\nIt sodns liek there's a history of you expecting to help out your son. How often have you or your son helped her?\n\nYour daughter is low contact with you as much as your wife, respect that and leave her alone. Bombarding her phone just because your son hasn't got his way isn't going to encourage a positive relationship, but will only harm it further.", "YTA, one no is a complete sentence, but you decided to go the harassment route to try and get what you want, also not your daughter's kid, not her problem it's your son's problem and his problem to find the solution, he can't handle being a parent, well maybe he should have kept it in his pants.", "YTA. She said no, she’s a grown ass adult she doesn’t owe you an explanation, and your son doesn’t need to feel entitled to other people caring for his child just because they’re family. Nobody owes your son anything for having a child. That was his decision, respect your daughters boundaries.", "YTA. I can't help but notice that you never tell us what excuse your daughter gave. Just that she came up with one. All we get to know is that it's an \"excuse\" and therefore invalid. \n\nWell, since we don't get the full picture what we do know is that your son asked several times, you asked several times, and that neither of you would take 'no' for an answer, which is classic 'asshole' behavior. In fact, you were so insistent that other people felt compelled to intervene on your daughter's behalf. \n\nIf she's not allowed to say 'no' then you're not asking, are you? You're demanding. And that doesn't make her selfish, it makes you the asshole.", "YTA. \"No\" is a complete sentence. \nThe fact that you continued to push when she said no repeatedly makes YTA. To be honest, that's probably why she cries. It's so damn frustrating to have people continue pushing an issue when you've clearly refused, multiple times. \nYour son knows when he has his son. I would assume he also knew when your wife was going to be out of town. He, the child's father, should have dealt with this scheduling conflict days ago. You have no right to demand that your daughter drop everything and watch a child that isn't hers at the last minute. You also have no right to declare her plans unimportant or continue to badger her about it.", "YTA.\n\nShe has no obligation to help him. You have no reason to insist that she does. You (and your son) are the problem here. \n\nSince he's \"willing to pay\", he should be willing to pay market rate for a proper babysitter. Find a proper babysitter who actually wants to be there. Not one that \"has to be.\"\n\nIf your son is having a hard time, maybe he needs to reassess his weekends with his son or adjust the schedule so he can be there with his son on his custodial days instead of having his son hang out with random people though.", "YTA. Do you even like your daughter?", "YTA. No is a complete sentence. You don’t have to babysit for anyone at any time. Especially who you only deem family when it’s convenient for you.", "YTA. Sounds like you have a history of treating your daughter as a second-class citizen. Tell your son he's a father now, and it is HIS responsibility to figure out accommodations for his child. It's not his sister's responsibility, and it certainly doesn't make her selfish to not be able to drop everything to babysit your sons kid. Try looking at yourself and how you've treated your daughter and take your own advice and develop some empathy.", "YTA. He asked, she said no. End of discussion.", "YTA-Stop harassing your daughter. She’s not the one acting like a selfish asshole here.", "YTA, stop volunteering other people’s time. Even if her plans are to lie on her sofa and make bubble noises, she said No. she said No to her brother and then you called and harassed her, driving her to tears (again from the sound of it). Then when she hung up to get herself together you REPEATEDLY called texted and harassed her until her partner stepped in to stop you. \n\nI take it your son is your golden child and your daughter was your bonus? Leave her alone. You are heading in the direction of her going No Contact - since she is already obviously Low Contact with all of you.\n\nYTA as it bears repeating. Leave the poor woman alone and stop trying to force her into situations she is unhappy in.", "YTA\n\nShe is not a mother. Your daughter has no obligation to anyone. She is crying, because you do not respect her saying no. She’s an adult. You better back off, or she’ll go no contact.", "YTA … and I think there’s a lot of backstory here you’ve left out.", ">My daughter came up with an excuse to why she couldn’t do it.\n\nNo she didn't.  She has plans.  Doesn't matter if you think they're \"valid\" plans or not.  YTA.\n\nNot to mention you're borderline estranged from your daughter and sticking your nose in.  To be honest, considering the staggering cluelessness of your post, I'm not surprised.  You're being completely unreasonable, does that explain the estrangement?  Is it a pattern?\n\nKudos to your daughter's girlfriend for standing up to a bully ie: you.\n\nI'm the same age as you, I shouldn't have to explain to a 43 year old man all the fuck ups in what you've done here.", "YTA - Your son needs to grow up and learn to be a parent and figure out childcare. It is absolutely sexist and ridiculous that you would even think of imposing his drama on your daughter. Would you ask your son to help her if the roles were reversed? Probably not. YTA.", "YTA. There is far more to this story than you are letting on.  On the face of it, no, your daughter doesn’t owe her brother or you any favors. A favor, like babysitting,  is something you choose to do or not do, and you got her answer.  Then you called her to push, coerce , and insult your daughter into doing what you wanted her to do.  That makes you the AH.  However, in a family when someone asks for a favor, and a few hours isn’t a lot if she didn’t have plans, they usually try to help.  So why isn’t your daughter willing to do that? I suspect the answer has more to do with how you blended the families, treated your daughter relative to your son, or your opinion on her sexual orientation than it does with any weekend plans she may have.", "YTA, on many levels. First its not her kid, she has zero responsibilities for her nephew. Its not her job to help her older brother get his life together. To often we look at women and just assume that they are caregivers, this idea of \"you don't have kids so you have free time to watch my kids\" is getting old. Second she doesn't owe anyone an explanation, she said no, end of conversation. Third, you tried to guilt trip her into doing something she didn't want to do. Maybe she had a hard week at work, maybe her and her gf just wanted to chill and veg at home all weekend, maybe they have plans and thats why they are cleaning and just didn't want to tell you, maybe sat is their cleaning day and it would mess their whole schedule up, regardless of the reason they said no so move on. Fourth when she told you how she felt about you constantly putting your sons family over hers you told her that her feelings are invalid and don't matter while calling her a crybaby. Shit if I was their mom I would be livid as hell also. My mom does this crap all the time to my own child and I've had many an angry call about consent with her, my kid said no that means no, it doesn't mean hound her and make her feel like shit for not wanting to do x. She's a human and she's allowed to be \"selfish\". If you keep this up your daughter may do the exact same thing I did and move 20 hours away from you.", "YTA. Just because your daughter is family, doesn't mean she is obligated to change her plans to help your son.\n\nYour son needs to find a better plan as it seems that he always needs to have someone watch his kid during the time he has him. I get that he's having a hard time, but he's a parent and needs to make plans for his time with his child\n\nYou say that you called your daughter back a few times as you don't like to leave things unresolved, but there was nothing unresolved. It was resolved the minute she said no. You were being unfair to your daughter the minute you called her to harass her after she had already told you son now.", "INFO:\n\n>My daughter hasn’t had much to do with me or my son since I married my wife a few years ago. My daughter and my wife don’t particularly get along\n\nand\n\n>My daughter cried and told me that I expect her to drop everything for her brother all the time.\n\nElaborate.", "YTA what’s stopping YOU from babysitting your grandson?", "YTA\n\nYour boy can call off work. Or you can. Your daughter has no obligation to either of you, or your irresponsible son’s spawn.", "YTAAAAA.  not only did you not need to step in (your son asked, she said no, that's where it should have ended), you called her names.  not only are you an adult, you're her parent.  completely and totally uncalled for.  you've probably successfully driven an even bigger wedge between the two of you.  \n\nthe rest of the story is completely irrelevant to this situation.  for all we know, she cries because she's fucking frustrated at the way she's been treated.  that's what it sounds like.  and then you called her back a few times?  that is stalker behavior.", "YTA. No is a complete sentence.", "Child care is difficult and being family doesn’t make her brothers child her responsibility. \n\nBut it’s not your problem and not your job to fix it. How, exactly, did you help anyone by berating and repeatedly harassing your daughter?? \n\n**why don’t you babysit the child if this is so important that you’ll alienate your daughter over it?**\n\nYTA", "YTA. Your grandson being iNnOcEnT doesn’t entitle his father to free labor from others. Read that over and over until it sinks in.", "YTA it was perfectly acceptable to ask... once. If the answer is no, move on. Your daughter has zero obligation to her nephew, and rather than selfish I think the comment that she has little to do with you or her brother indicates that not all the facts are presented", "YTA this post proves your daughter right. You expect her to make her brother and her nephew a priority and she doesn't have to. She doesn't know that to anyone. Your post shows exactly why you don't have a great relationship with your daughter. She sets a boundary and you call it \"crying about it\" .", "YTA - why don’t YOU look after the baby for a couple of hours, if it’s needed? \n\nYour daughter has no responsibility to drop anything and come to your aid.", "If you're so concerned and family comes 1st, why the hell don't you just call off work and watch the kid your damn self?", "YTA", "YTA. It’s disturbing that you think your response and behavior are in the right. No wonder your daughter doesn’t have much to do with you. You’re demanding and disrespectful.", "YTA- I can get a sense why she doesn't have much to do with you.", "YTA  and you don't even seem to care for your daughter", "YTA. If your son needs someone to watch his child on a regular basis, he could do one of two things: 1) pay a babysitter; 2) contact his ex and change the custody schedule to better match his work schedule. \n\n  \nHe is not entitled to have family members give up their time to watch his child and your daughter is not obligated to take responsibility for his child. You shouldn’t have insinuated yourself in the issue. He is an adult and he’ll figure it out.", "YTA. I expect your daughter to go nc with you any day now. She is not your employee. She is not your slave. She is not your nanny. She doesn’t have to babysit. She doesn’t have to make excuses. No is a full sentence. Learn that no means no. And stop showing the world that your son is your favourite. Your daughter sees that.", "YTA. Your son asked, she said no, and that should've been the end of it, but you just had to call and harass her. It's pretty obvious from the way you talk about her that you don't respect her at all. She wasn't crying to get out of some obligation, she was crying because you were treating her like shit, and it sounds like this is typical behavior for you. On a side note, it sounds like your son needs to look for a new job with a more traditional schedule. He only sees his child on weekends as it is; he should be doing whatever it takes to be there for him.", "YTA. \"No\" is a complete sentence. Respect it and don't guilt people. Your attitude is why your daughter will probably stop talking to you.", "YTA. It’s not her kid and she doesn’t owe you or her brother (who you blatantly favor) any explanation or justification.", "> My daughter came up with an excuse to why she couldn’t do it.\n\nthis is adorable. she didn't even have to give a reason, she doesn't owe you anything! if this is such an issue why don't you watch the baby? doesn't like you have anything to do on the weekend seeing how your wife is out of town and all.\n\nyour ex-wife is right, and i'm glad your daughter has a gf with shiny shiny spine to help her deal with you and your son's nonsense.", "YTA.  And you've just given her more reasons to not have much to do with you or your son now.   She's going to be even more distant now.", "Info: What happened between your son and your daughter?", "YTA\n\nTotally fine if your son to ask, but she declined. She had plans with her girlfriend and didn’t want to change them. I also get the sense that you probably DO make be drop everything for your son given your attitude here, and now that she’s an adult she’s sick of it. Saying she is somehow hurting her nephew is manipulative and shitty.", "Yta.  He only gets his kid on weekends.  He needs to change his schedule to spend time with his son.  From what you wrote it seems like she had to sacrifice a lot for her brother.  Also no means no.", "YTA. Your daughter said no, no means no. \n\nYour son is a big boy and it’s time for him to start big boy problem solving. \n\nPerhaps shifting schedules, finding a new job, or hiring a reliable babysitter for HIS child. Rallying the family to demand his sister watch HIS child, is not the answer.", "YTA. Yet another man who can’t stand it when a woman says NO.", "YTA. She doesn't need to explain. She doesn't need a reason other than no. It wasn't your business to call and try to guilt trip her into it. I imagine she has a lot more reasons for low contact with you than just her stepmother just based off of the way you talk about her. Again, YTA", "YTA - what part of NO are you incapable of understanding? She does not owe her brother, nephew, or you for that matter anything.  That child is your SON'S (notice it says son NOT daughter) responsibility.  You owe your daughter an apology,  and once you've done that leave her alone until you understand and can abide by HER boundaries.", "YTA and it’s fairly obvious that your son is the golden child in the family. I’d back off and apologize to your daughter if you don’t want to completely boggle what relationship you have with her.", "Galactic rim sized YTA.", "YTA \n\nWhy don't you call in sick and help him out and babysit? \n\nWhy doesn't your wife cancel her plans and help out? \n\n\nYour daughter isn't the one who chose to have a baby", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nThrow away for privacy. \n\nI (43M) have two kids. My daughter (21F) and my son (24M). My son has been going the a tough time. He and his girlfriend recently broke up, but they have a one year old son together. My son gets his baby on the weekends, but because of his work schedule he needs someone to help watch the baby in the evenings. My son has been staying with my wife (his stepmom) and l since he and his ex broke up, so my wife usually watches the baby during the evenings on the weekend. However, this weekend she is going out of town, so my son has to find someone to babysit the baby. I would watch my grandson, but I have to work too. \n\nI suggested that my son asks his sister to watch the baby. My daughter hasn’t had much to do with me or my son since I married my wife a few years ago. My daughter and my wife don’t particularly get along, but my wife won’t be in town so I don’t see a problem. My son called his sister, and asked if she was working this weekend. My daughter said no, and she was just planning on spending time with her girlfriend and cleaning her house this weekend. My son then asks if it’s possible if she can watch the baby for a few hours this weekend. My daughter came up with an excuse to why she couldn’t do it. My son told her that he was willing to pay her to watch the baby, but she still said that she couldn’t. He explained his situation, but my daughter seems to have no empathy. After they ended their call, I called my daughter. \n\nI asked my daughter why she can’t help out this one time. My daughter still insisted that it’s impossible for her to watch the baby for a few hours, so I told her that she’s being selfish by not helping her brother knowing his situation. My daughter has a habit of crying to get out of things, so that’s what she did. My daughter cried and told me that I expect her to drop everything for her brother all the time. I tried to tell her that this wasn’t about her brother, this is about her nephew. No matter how she feels about her brother her nephew is innocent. My daughter then hung up abruptly. I don’t like to leave things unresolved, so I called her back a few times. Her girlfriend then inserted herself in our conversation, and told me to stop calling my daughter or she would block me. I then got a call from my ex-wife calling me an asshole, and telling me that I need to apologize to my daughter. \n\nI don’t think I was being unfair to my daughter. My son is having a hard time, and needs some extra help. AITA or is my daughter being selfish?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", ">I asked my daughter why she can’t help out **this one time.**  \n>  \n>My daughter cried and told me that **I expect her to drop everything for her brother all the time.** \n\nWhich is it?\n\n>I don’t like to leave things unresolved, so I called her back a few times. Her girlfriend then inserted herself in our conversation, and told me to stop calling my daughter or she would block me. \n\nSo you refused to take no for an answer and continued to harass her? She hung up on you once, I don't get why you wouldn't just leave it a few hours at least. \n\nYTA", "YTA. Dude you can’t just pawn a baby off on the nearest woman in sight. He can get a sitter", "INFO : You’re not going out of town - why can’t *you* watch the baby?", "YTA. Stop expecting free childcare from family members with vaginas. Call off work or pay for a babysitter.", "ESH\n\nOOH, Not her baby, not her mess, not her responsibility.\n\nSure, I think it's a bit a callous.  But, people who choose not to have children are literally choosing to avoid having this huge burden in their lives.  So, it's not even that she's lying or crying or whatever else; it's plain as day that she's selfish and has a ton of her own issues.  But, that's all irrelevant; this is your son's problem, not hers.\n\nOTOH, she may regret it one day, especially if she needs help.  And that would be a chance to teach her a life lesson.  \"Need help to fix your car?  Need help to buy a house?  Need a place to stay?  Sorry, baby, not our problem.\"  And crying to get out of things at 21 (just going to have to take you at your word)?  That's incredibly immature.\n\nThis family is in a mess, it seems.  I think it's a bit much to expect a lot of cohesion and mutual support.  Ex-wife is an asshole; what's she doing harassing you?  Daughter is an asshole for not helping, and certainly immature for having her partner handle the situation.  Your son, IDK about asshole, but got himself knee-deep into a broken family with a 1yo.  The baby-momma is where?\n\nESH", "  \n\n\nI think your are both in this instance.\n\nFirstly, I wondered how many single parents actually replied to this. A lot of people don't understand how hard it is to leave your baby with a complete stranger at night, little bit better at day care when there's other kids and adults. It is also hard to find trust worthy people to look after kids. The world is a bad place. I think it's ok to ask your daughter to help. Other people in this thread talking about getting child care, they really don't have an idea.\n\nSecondly, I think you have to be more dipolmatic with how you communicate, else your daughter won't ever help you again. You will need to apologise, even if you think you didn't do anything wrong.", "[removed]", "YTA no is a full word and she has every right not to help. Secondly it’s a bit crappy that your son only gets his child on weekends when he will be absent for half or more of that. Most dad would change shifts or get a job that worked round their children’s visitation instead of relying on others and missing the little time he has.", "YTA and then some...you seem to have no boundaries, she said no and it means no.  you dont need to try and guilt her with name calling and guilt trips.  she had plans and said no.  and then u dont need to hit your redial to keep at her.  you should apologize once they unblock you.", "YTA. she said no. do you need help understanding the concept of no? do you typically badger people for telling your son no? why do you think your daughter is obligated to help out her brother? \n\nthis is a very simple issue. you are the asshole. i bet if we got her side of the story, she would have dozens of instances just like this to tell about.", "YTA.  As others have said, No means no.  Did you take the time to ask your daughter what was going on in her life? I didn't see that mentioned anywhere in your post about how selfish she is because she can't watch somebody else's kid, and then you pulled the family card. It's not about your brother, it's about your nephew. You suck because you won't watch your nephew.  You cry to get out of things all the time.\n\nWell you, dad, are here crying on Reddit.\nYTA", "YTA. Your son is the one with the child and he needs to be the one that takes responsiblity. If his work schedule does not work well with his custody arrangement, he needs to try to change his work schedule or look for another job, and find a trusted babysitter in the meantime. You seem to hold your daughter more accountable than your son.", "It sounds like your son needs to sort his work hours out if they coincide with his parenting time. \n\nYour daughter didn't have the baby and she is in no way responsible for helping your son out. That's his responsibility to figure out. \n\nYou're selfish for trying to guilt her into it at the same time you and your wife aren't shifting your evening around to babysit that day. If you think it should only be family - you make the sacrifice. Don't go asking others to do it for you\n\nYTA", "YTA.  She's not a built in babysitter.  Your son's kid isn't her problem.", "No, your daughter doesn’t owe any of you anything. She doesn’t want to watch a baby and you shouldn’t be trying to guilt trip her.\n\nHer crying sure sounds like frustration and anger to me. I bet she’s been guilted into a lot of things in her life by you. YTA", "INFO: You said she “came up with an excuse” and “said it was impossible for her to watch the baby.” What was the reason she gave?", "YTA", "YTA", "Wow- you totally bully your own daughter… you disregard her emotions, saying she only cries to get out of things-has nothing to do with the fact that you’re calling her repeatedly and having a go at her, you continue to harass her.\nShe said no-it’s not her fault your son chose to have a kid in a bad relationship and now works weekends instead of taking care of his own kid.\nBe a better parent OP YTA", "Tell us about the missing missing reasons. It is clear that her reaction isn’t just to this call, but to a longer term pattern.", "YTA", "YTA. Your daughter is not duty bound to babysit when she doesn't want to. It sounds to me like your son either needs to rearrange his work schedule so he can actually PARENT his own kid, or modify the custody agreement so that he has the kid when he isn't working.", "YTA. Your daughter doesn't have to have excuses no is a valid answer. Your daughters GF was being a good GF by telling you to stop. You made your own daughter cry how are you not TA.", "You inserted yourself in a situation that was between your son and daughter. They had a conversation, she said no. Should’ve been the end of it. Why did you think it was a good idea to call her?", "No is no. YTA. Why is it so hard to understand the word ‘NO’? \n\nI don’t think your daughter has a habit of crying to get out of things. Do you know how frustrating it is to explain someone like you a simple word like ‘NO’? I would cry to.", "Do you I even have a functioning relationship with your daughter or does your son have a decent relationship with his sister \n\nShe gave you an answer no \nI’m not understanding why you tried to bully her to look after your grandson. \nWhen it reads like you haven’t fought to have a relationship with her", "NTA. She does not need to help her brother. He is not entitled to her help. He made the kid. It is his responsibility to secure child care.", "YTA, and why are you even involved? Your son is an adult. He can find childcare for himself.", "OP's future post: \"AITA for not understanding why my daughter went NC?\"", "I see why she doesn't have much to do with you. YTA, if you can't see that....", "YTA - she said no. Not her problem.", "YTA, you daughter is right, you are expecting her to drop everything for her brother.\n\nDon't plan on her ever contacting you in the future, she now knows where she stands with you.", "YTA 1) your son is a grown ass man and if you are old enough to create a kid, you are old enough to look after it. 2) your daughter is an adult and she does not have to justify how she spends her own time to anyone including you. Suck it up buttercup and look after the kid yourself", "YTA and a bully. There’s clearly an ocean of reasons as to why she doesn’t want to babysit for her brother. She owes him nothing.", "So, the daughter doesn't have much to do with her stepmother, which leads to her not having much to do with you or her brother. If that's the case, she doesn't know her nephew very well. Why would you leave a child with someone he doesn't know well? \n\nShe said no, so get over it. YTA.", "YTA if your son can pay your daughter to babysit then he can hire a nanny. She is under no obligation to watch a child that is not hers. Also he saying that you always expect her to drop everything for her brother tells me this isn't the first time you tried to force her to do thing/give things up for him in the past. No wonder she's low contact. I'm sure it's not all about your wife.", "YTA - I'm sure that there are tons of \"missing\" reasons here. The way you talk about your son and daughter tell me there is favortism there. The way you let your wife disprespect and demean your daughter tells me you have failed her as a parent. The fact that your daughter says you expect her to drop everything for brother all the time also tells me that you favor your son.  \n\n\nQuite frankly the fact that your son is making this everyone else's problem also makes him an AH. if he has to work on those days, he can get custody changed to on other days. It's a new baby, they're not in school yet. Doesn't matter if the days are weekends or not.", "YTA, why do I get the feeling that the only time you or your son ever talk to your daughter is when you want something from her? This is probably why she has nothing to do with either of you.", "YTA just because she wasn’t working doesn’t mean she can watch her nephew. She said she had plans and said no that’s it. Your son is the parent and it is his responsibility to figure it out. He can always hire a babysitter or call off work or explain to the ex what is happening. You repeatedly calling her after she said no makes you a bigger AH no wonder she feels the way she does I’m glad her gf had her back", "YTA\n\n“My son is unable to meet his parental obligations for custody therefore my daughter should have to do it.”\n\nReally?", "[removed]", "YTA. She doesn’t need a reason. No is enough.\n\nBut what if she’s also just not good with kids? Why shove a kid on someone who’s not interested in babysitting? Sounds like a disaster.", "YTA\n\nI’m sorry, but she didn’t decide to have the baby. Even if she sat at home all weekend she still is not required to take care of a child. Also the way she cried tells me this is common behavior from you and/ or your son. Instead of seeing it as manipulative maybe ask yourself why she feels she has to resort to tears before you will leave her alone?", "YTA. First off, if I only had my kid for 2 days a week you can be damn sure I’d make it so I do not work on those days to spend time with my child. Second off, your daughter said no. It doesn’t matter why. Calling her repeatedly is harassing her. She does not owe you or your son her time or labor. I can see why she is LC.", ">My daughter has a habit of crying to get out of things, so that’s what she did.\n\nExcept she has nothing to get out of. She wasn't doing it. She said no. The end. She doesn't have to get out of it", "I have a feeling you, your wife and your son have regularly pushed and disrespected your daughters boundaries. Your daughter has been in much contact but the time you’re in contact with her it’s to get her to do childcare effectively. YTA", "YTA. This was none of your business it was between the son and daughter. She is not responsible for his child or his baby sitting problems. She said no so that should have been the end of it.  But you and your son both hounded her.  You are a BIG AH", "YTA that’s a lot of words just to say that your son is the golden child", "I hate parents like this. My mom expects me to do the same thing for my brother drop everything for him and she says when I'm gone blah blah blah and I'm like when your gone he's gonna be struggling and no life skills because his sister's were forced to do everything for him. And if we don't we're called evil and selfish.", "YTA\n\nYour grandson is your son's responsibility, if his sister said no then it's a no. Her nephew is not her responsibility, regardless of how innocent he is. She had absolutely nothing to do with making him or birthing him.\n\nYou had 0 right to butt in and try to guilt trip her to make her change her answer, and badger her until you brought her to tears. \n\nYour son can hire a babysitter for one night, you need to butt out of these situations and respect your daughters boundaries.", "YTA. She doesn’t owe you, her brother or your wife shit. She said no, she doesn’t need a reason, no is a complete sentence. Someone else’s child care is not her responsibility or problem.", "right? no is a complete sentence!", "This! Why can’t people ever take no for an answer? OP is the AH here not the daughter\n\nETA: Yes, YTA, OP", "Yeah, and it also doesn't matter if the kid is innocent or not, when he's being used as a reason for her brother and father to harass her.", "Makes me think he thinks his  wife and son are  is innocent and his daughter is the one with all the problems.\n\nBut the fact is you can play the family card when it’s convenient for you and want something.", "My son and his ex don’t leave the baby alone with strangers for safety reasons. I also offered this advice.", "That's probably why she cried. It's fucking frustrating to have anyone, especially a parent, continue to push an issue when you've already said no. \nI wonder why she doesn't have much to do with her dad or brother...../s", "PREACH SISTER PREACH!", "My son doesn’t work a weekend job. He works weekdays. He has less hours on the weekends to spend time with his son, but he works in the evenings. My wife usually watches the baby for a few hours while he works. \n\nI’m not abusing my daughter by a phone call. You people throw around abuse allegations like it’s nothing.", "Sounds like she's already low contact with them, so that's the next step.", "Why can't the actual mother pick up the child for a few hours, that's what I want to know.", "My daughter and my wife don’t get along, and my daughter thinks I make her drop everything for her brother. Which isn’t true. I can count on one hand how many times I’ve asked my daughter to do anything in general. You’d have to ask her.", "'cause all the women in this family are expected to pitch in.\n\nStepmom, sister, and even the OP made a snarky remark about material grandma not doing her duty.\n\nMeanwhile OP's son can't manage to watch his own kid two days a week without help.", "Oooop", "A lot of folks also don’t understand how hard it is to have a baby just dumped on you on short notice when you aren’t used to or prepared to care for one. \n\nIt’s not some trivial exercise. It’s one thing if they kids are grade school age, but babies are a lot to deal with.", "I'm a parent. I understand.\n\nHowever, I would be **horrified** if I found out that one family member had berated another to the point of tears to get them to watch my kid. My kid is my responsibility, and I will find care for him, and I will do it respectfully because I understand what it means when someone says no.\n\nIf it's so important to son or OP that baby is watched by a family member, then either of them is welcome to take the day off work.\n\nBut neither of them see the daughter's time as being as valuable as their time, and that makes them the AH.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "We need to start putting these on t-shirts ...", "Maybe I read too much into things (entirely possible) but I wonder if the reason OP's daughter has little to do with them has to do with homophobia.", "Why do you think the daughter is the one with all the problems?", "If your daughter doesn't have much to do with your son then is probably is a stranger to the baby!", "Their choice, their problem.", "And none of you know a single person that would be willing to watch the kid for a few hours and be paid for it? Really?", "Sounds like a them problem.", "The way he dismissed and invalidated her emotions in this post… it’s probably a history of that", "If you called repeatedly after it was clear to you that your daughter didn’t want to speak with you to “resolve” it, that’s harassing your daughter and pretty unkind, even if you wouldn’t use the word abusive. \n\nAlso, it was resolved. You just didn’t like that her answer was “no”, right?", "Multiple people are pointing out how abusive you are to your daughter, but they're all wrong and you're right. Right?", "You tried to emotionally manipulate her because IT WAS about her brother and NOT her nephew.  Nothing bad would happen to your grand child if his father took the day off and stayed with his own kid.   She doesn't have to sit on the phone with you insulting her just because that's what you wanted to do. \n\nBe honest with yourself.  You were going to badger that girl into what you wanted until someone else put a stop to it.   \n\nThis wasn't even your fight.  He ask, she said no.  That's the end of it.   Are you not her father too? \n\nNobody here is throwing that word around lightly when you described your actions, we just called it what it was.", "Your son doesn't work weekends. He works weekdays.\n\nYet, he needs a babysitter on the weekends because he \"has less hours on the weekends\". \n\nPlease make this make sense. He either works on the weekends or he doesn't. If he's not actually working then he doesn't NEED a babysitter, he simply wants one so he can do other things.", "If he’s working on the weekend he has a weekend job", "Let’s examine your post to see if we can figure this out, shall we? \n\nYour daughter hasn’t had much to do with your family since you married your wife. In other words, your daughter has gone low contact because of your wife. What did your wife do to your daughter to make her decide this was the better option? \n\nYour daughter doesn’t get along with your wife. Why? Again, what did your wife do? Did you listen to your daughter’s concerns at all or did you automatically take your wife’s side without any consideration of your daughter’s feelings? \n\nYour daughter said no, which is a full sentence. You then tried to guilt her into it because “family.” Tell me, when was the last time you acted like a dad to your daughter? When did you listen and offer her support? \n\nAre you sure she has a habit of crying to get out of things? Or did you just make her cry a lot? \n\nShe said you expect her to drop everything for her brother all the time. Again, when is the last time any of you were there for her? Or is she just expected to give and expect nothing in return? \n\nYou mention this isn’t about her brother and whatever her feelings are about him shouldn’t matter. What did he do to her? Why do her feelings not matter? \n\nYou said her GF inserted herself into the conversation to get you to stop calling. It sounds like she’s used to stepping in to defend your daughter from you. What, exactly, have you been doing? Is it normal for you to call her incessantly just so you can berate her? \n\nYou are, without a doubt, TA here. I would suggest you get some therapy so you can make amends with your daughter before “low contact” becomes “no contact” and you don’t ever see her again. That’s assuming you care, though. Considering this post was meant to paint you in the best light and your contempt for your daughter came through loud and clear anyway, I’m guessing you don’t.", "Sounds like your daughter needs to block you from contact.", "“You people”? Explain.", ">He has less hours on the weekends to spend time with his son, but he works in the evenings.\n\nQuit trying to pretend that this doesn't mean that he has a \"weekend job\". He is working, on the weekend, that means he **has a weekend job**. Doesn't matter that it's the same job he's doing the rest of the week just at part time hours. He needs to either rearrange his hours so they're all during the week, or find a person he trusts to be a backup (besides his sister who doesn't want to).", "Sir, I will remind you that emotional abuse is still abuse. Name calling - aka calling her lazy because she won’t watch her nephew - is a form of emotional abuse. You may not see it that way, but trust me if this continues you are risking loosing your daughter permanently.", "OP describes abuse.\n\nOP: wHY R u ACcusSing ME of Abuse?\n\nAH. Leave your daughter alone. Your son's problems are his.", "Because she'd probably want the kid's dad to do the same on the (presumably) weekdays when he is off and she is working, and then when would he have a day off?", "In other words  you've been alienating your daughter for a long time and only phone her up when you need her drop everything and do something useful for the family members you actually care about. Got it.\n\nIt also strange how the daughter thinks \"I make her drop everything for her brother\" which you claim \"isn’t true\" but it is coincidentally exactly what you're here to complain about today. This makes me think that you are not a reliable reporter of your current circumstance and that you also you lack insight into your own behavior. Leave your daughter alone. You've hurt her enough. Just stop.", ">my daughter thinks I make her drop everything for her brother.\n\nOh, gee. Why would she think that?\n\nIs it because THAT IS WHAT YOU ARE DOING RIGHT NOW?\n\nWhy don't YOU take the day off and watch the kid, if this is so important to you?", "Why doesn’t your sons mom watch the baby?", ">my daughter thinks I make her drop everything for her brother. Which isn’t true. I can count on one hand how many times I’ve asked my daughter to do anything in general.\n\nI'm getting real missing missing reasons vibe here...", "You realize this post is about you expecting her to drop everything for her brother, yes?", "we really should! also just make it posters and any kind of decorations.", "It's possible. I smell a lot of missing context about *why* the daughter doesn't like OP's wife.", "I can’t say I didn’t think the same thing.", "I don’t I meant op thinks the daughter is a fault for everything. I’ll go fix that!\n\nThank you I fixed my response!", "I’m sure my son does know someone else, and he’ll figure that out. This really isn’t the issue at hand. The issue is that my daughter isn’t willing to help out her family when they need it.", "To the point someone threatens to block you! It’s abuse!", "I was saying that he doesn’t work a weekend job. Meaning he doesn’t only work on the weekends. He works weekdays and weekends.", "\"You people\" is usually a booty-hurt statement made by someone who is starting to understand they are part of the very small group of persons that agree with them, and a minority in a group that does not.", "Let’s just say, she can’t be bothered with being a good grandma.", "I smell a lot of missing context around \"let's demand that a family member with a uterus solve this for us while the other uterus is on a trip\". Why isn't OP rearranging his schedule to cover for his wife? It's their household, after all.", "How often have any of you dropped everything to help her?", ">My daughter cried and told me that I expect her to drop everything for her brother all the time\n\nsounds like it's not about her not being willing, it sounds like you expect her to help and won't allow her to say no.", "The issue is that she said no and you refused to accept that.", "Since the golden child i mean your son is having such a hard time and you think family is suppose to drop everything and run to the rescue why can’t your wife cancel her plans? Are you telling your wife she is selfish? Or why can’t you miss work?\n\nThe point is the fact your daughter doesn’t want to offer free babysitting isn’t any of your business. You put yourself in the middle of something that isn’t your business. Then you resorted to name calling and being a bully when you didn’t get your way!", "Why don't you drop everything and go help her clean her house this weekend? Where's your empathy?", "How often do you or your son drop everything to help her?", "I have to ask OP. As many others who have come before you and asked a question, why do you not accept that YTA and realise that if your daughter wanted, she would have. No means no and it’s that simple. I don’t understand arguing when you have asked a specific question and received responses that outline the exact reason.", "She isn’t obligated too! No means no. If your daughter wants to spend her weekend with her gf and not babysitting that’s perfectly fine.", "Respectfully, why is that a problem? You already know they don’t get along, why do they not get along?", "Yes, it sounds like this is the sad reality. Your daughter is keeping her distance.", ">The issue is that my daughter isn’t willing to help out her family when they need it.\n\nNope, this is an issue you've created in your own head in order to phone your daughter up and make demands. The reality is that you're daughter doesn't owe her brother babysitting. That's not her child. No is a complete answer and she doesn't even owe you an explanation for why she isn't available. She's allowed to spend her free time however she likes.\n\nThe real issue is that you've told your son not to leave his child with anyone who isn't family. That was a fairly foolish thing to tell him, considering not everyone in the family has agreed to provide childcare. \n\nThen in another comment you say your son has friends and will work it out...WTAH is that???!!!!??? If he has friends who are willing why you trying to guilt trip your daughter into doing it? \n\nAlso, what in the world does any of this have to do with you? You're the one inserting yourself into a situation that doesn't concern you. It almost sounds like you are looking for an opportunity be antagonistic towards your daughter and this sounded good in your own mind. \n\nEven your wife who doesn't get along with your daughter is telling you to leave her alone. That's very telling. YTA", "And you need to accept that she won't do this.", "It isn't her problem.  Why don't you watch the kid?", "No, the issue is that it is not your daughter’s child.   It is not your daughter’s responsibility.  It is your son’s child.  It is your son’s responsibility.  He can hire a babysitter or he can go back to court to renegotiate visitation.  Your daughter has every right to say No and to have her No respected.   Which you are not doing.  Which makes you the AH.  And I detect more than a trace of sexism in your evaluation that your daughter’s time is not as important as yours.  She has plans.  She is not available.  Get that through your head.\n\nYTA", "No wonder she barely talks to any of you. Bet you put your wife first over her too ah.", "Doesn’t answer why you think your daughter should clean up your son’s mess. And if she cries all the time around you maybe look at your behaviour\n\nEdit: Also. Why does she not get along with her brother? And what makes her obliged to drop her weekend plans apart from the time honoured tradition of a parent favouring one child over another by bawling “FFAAAAMMIIILLLYY”", "Why can't the child's actual mother pick up extra hours of childcare as needed? Is she no longer in the picture?", "Why can't your son get a job that gives him weekends off so he can actually adhere to his parenting plan like a responsible parent?", "That \"all the time\" is telling. I bet \"not getting along with my wife\" is not the only reason the daughter is low contact, or at least is missing a *lot* of context.", "Since when does answering questions mean I don’t accept people’s opinions?", "The baby’s mother is in the picture, but if she picked up the baby for a few hours in the evening I doubt she would give him back. She would use this as a reason to give my son less time with his baby. This isn’t usually an issue because my wife watches the baby during the evening on the weekends.", "It’s just telling that the daughter sees herself as the long suffering victim here. It doesn’t mean she’s actually the victim.", "The constant excuses in your responses is the non acceptance of people’s opinions", "Because you couldn’t accept your daughter’s no", "You keep saying \"Well, SHE won't help!\" Why does she have to help?", "The people primarily responsible for providing care for the baby are the parents. They need to work out their issues instead of dragging everyone else into their custody issues.\n\nI honestly can't believe no one is even asking the child's own mother but you feel totally comfortable phoning up your daughter and badgering her into providing childcare. \n\nThis is looking more and more like an issues of preference taking precedence over the need for childcare.", "Question: why don't YOU watch the baby? On your own? You have two whole kids, I figure you know how to change a diaper, yes?", ">My daughter has a habit of crying to get out of things\n\nit's also telling that a father says this about one of his kids that he supposedly loves and respects.", "It's also telling that the father didn't dispute that he asks her all the time."]}