{"id": 16484, "submission_id": "1391pug", "title": "WIBTA if I reported my son's substitute teacher", "selftext": "My son is in second grade and he had a sub today. At one point they were supposed to take a bathroom break, they are in trailers so they all have to go at the same time. One boy would not stop talking and the sub said they couldn't go until he did. She told the kids to all make their meanest faces at the boy. That, of course, set him off and he ended up turning over a desk. The teacher then did not let the kids go to the bathroom. She made them wait about 2 hours for their next scheduled break. I am tempted to email the school as this seems unacceptable by the teacher. Her having the kids make faces at the other kid almost feels like bullying. I'm also not happy about her not allowing a bathroom break. My son said several kids worried they were going to go in their pants.", "created_utc": 1683321501, "permalink": "/r/AmItheAsshole/comments/1391pug/wibta_if_i_reported_my_sons_substitute_teacher/", "score": 612, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) the action would be emailing the school to let them know what happened and that I think it was wrong of the sub. 2) it might make me an asshole if it keeps the sub from being able to work at that school again\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">Her having the kids make faces at the other kid almost feels like bullying.\n\nBecause it was. NTA, but you will be if you don't report them.", "NTA\n\nGroup punishment is for lazy assholes who don't care, and you should never punish someone by withholding a bathroom break. This isn't even group punishment. There was no reason for the sub to do that.", "In education for many years; admin needs to know about this NOW.", "NTA, the sub should not have denied young kids a bathroom break.  She doesn't need to be subbing in schools at all with that attitude", "YWNBTA. I'm not teaching expert but that sounds horrible", "NTA, you would be if you DONT stand up for those kids. It’s not the other student’s responsibility to manage that child - it’s the subs. And those poor kids didn’t learn shit that 2hrs they were focused on keep themselves dry. What a cruel person.", "NTA\n\nDefinitely report this.", "NTA\n\nThat is ridiculous. Call the school.", "When my kid was in 3rd grade, a recess monitor did this kind of thing—whole class had to wait to go on for lunch until everyone stopped talking. Needless to say, the clock ran out on lunch. My kid took it upon herself to write a sternly-worded letter to the principal objecting to this collective punishment. And to his great credit, the principal came to the class in person to apologize for what happened and to let them know that the recess monitors had been told not to do that again. \n\nSo yeah, I would talk to the principal.", "NTA This sounds like abuse. She was a bully to this little boy. Then she deprived these little kids of a basic need. Something they really needed. She needs to be reported ASAP.", "YWNBTA Report the heck out of that.", "NTA   Call now", "NTA.  Personally I would try to verify with other parents first before sending the email, but only because a friend of mine nearly lost her teaching position over a student making up stories. Not saying that’s the case here, I’m just paranoid like that", "NTA. But I would not accuse - I would ask. Because kids also misinterpret things all the time. To them, they are relaying the absolute truth. But sometimes it’s not actually how it happened. \n\nFor example, my students tell me all the time that teachers have yelled at them. They genuinely believe it but the teacher hasn’t raised their voice to a yell. They’ve just been firm or a bit louder than usual. But to a kid with a trauma background and limited emotional vocabulary, the only word they might know to convey that their teacher spoke firmly or sternly and loudly to them is “yelled”.\n\nOr they’ve said, “the teacher told me she hates me” when what the teacher actually said is, “you’re not welcome in this classroom if you are going to swear at other students or me”. To a kid with rejection sensitivity either because they are neurodivergent or because they have trauma “I hate you” is what they hear. \n\nSo the “make mean faces” might not actually be the case. \n\nAlso, I hope the experience of having a terrible sub commits you to improving the pay and working conditions of teachers. Because while they remain so low, schools have no one else other than teachers like these to put in front of kids.\n\nETA: the bathroom thing is inexcusable and absolutely something to complain about.", "NTA\n\nPlease report this.  All of it.", "WIBTA . If you don't report, her.", "NTA. The school definitely needs to know about the sub’s unacceptable behavior and that children were denied a bathroom break. It sounds like the sub has limited experience with children.", "NTA but that sub can suck it.  \n\n\"Here class, everyone make angry faces at this other kid, and then I'm gonna punish you all for him talking too much\"", "NTA\n\nI would be pissed if my kid came home reporting that. The kids are what, 7 years old? Encouraging bullying and using access to the bathroom as a punishment is not ok", "NTA and you need to contact all the parents so they know as well. That is bullying and inhumane to not let them use the bathroom. Wtf!?!? So they just let anyone teach kids huh? Smfh", "NTA, but really the only issue I have with her actions is the amount of time. Supply teachers especially need to project authority", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son is in second grade and he had a sub today. At one point they were supposed to take a bathroom break, they are in trailers so they all have to go at the same time. One boy would not stop talking and the sub said they couldn't go until he did. She told the kids to all make their meanest faces at the boy. That, of course, set him off and he ended up turning over a desk. The teacher then did not let the kids go to the bathroom. She made them wait about 2 hours for their next scheduled break. I am tempted to email the school as this seems unacceptable by the teacher. Her having the kids make faces at the other kid almost feels like bullying. I'm also not happy about her not allowing a bathroom break. My son said several kids worried they were going to go in their pants.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YWNBTA\n\n> *\"She told the kids to all make their meanest faces at the boy.\"*\n\nGang-bullying a kid is insane.  Making access to the FUCKING BATHROOM for some children contingent on the behavior or some OTHER CHILD is also fucking insane.\n\nReport this sub.", "NTA, definitely ask questions and express concern. Even if your son just misinterpreted it is important to communicate with the school. \n\nHowever, please also look into counseling or some kind of support for your son. Flipping over a desk is not an acceptable or safe response for himself or the other students in the classroom. Unfortunately, I spent a year substitute teaching in elementary school. The amount of students who threw furniture and hurt or almost hurt other students was shocking to me. The students who reacted so extremely were dysregulated and had a really hard time in school.", "NTA", "NTA- that teacher is abusive.", "I typed up an email and scheduled it to send Monday morning. Just wanted to see if people thought I was over reacting before sending it. Figured I could cancel it if the judgment is I WBTA.", "Yes, even POWs are guaranteed bathrooms under the Geneva convention…", "This is a good intermediary step. Second the recommendation.", "Having once been married to a teacher I know they deserve so much more than they get.", "Send ASAP - that sub could be in front of another class on Monday.", "Why wait till Monday?", "Good, don't cancel it, regardless of the decision here. I'm fairly confident it'll come out in your favor, but either way, you have to do what you believe is right when it comes to your children.", "Because the staff is already out for the day, they leave at 4. Also wanted to make sure I was not over reacting. On some new meds and they are giving me some issues with anger right now.", "Never a bad idea to sit on something like that until you've cooled off. NTA, good dad!", "Ok, that's understandable. You're definitely not overreacting.", "NTA but I would talk to the parents you know about of other students in the class. See if they heard something similar. And if you all have the same stories, encourage them to reach out too. I’m generally not one for sending an army but given the severity of the situation, I’d want the administration to pull that sub immediately.", "NTA. \n\nPlease report this teacher. Her conduct is horrifying. She encouraged kids to bully one child. When things didn’t go well, she made them wait. That isn’t good for anyone. This person shouldn’t be teaching anyone about anything.", "Bathroom breaks should not be postponed because of anyone. AT ALL. No matter their age, children should be allowed to go when they need to. \n\nMaking faces at another student is a form of bullying. \n\nThis substitute teacher is TA and should NOT be around children at all. \n\nYou need to do your part & tell the school ASAP (and I hate saying ASAP). \n\nNTA fir reporting an inadequate teacher.  You’ll be TA if you continue to wait.", "That is outrageous! The mean face thing is awful but making a bunch of 7 year olds wait 2 extra hours for their regular bathroom break is unconscionable. Definitely NTA, send that letter now.", "YWNBTA. You are NOT overreacting. That sub has no business being around children. You don’t punish the whole class because one kid is non-compliant, and you don’t encourage children to harass another child.", "I had an English teacher in high school who LOVED group punishment and he could never understand why we couldn’t just “govern” ourselves and each other. Also once yelled at a kid for twenty minutes for leaning their head on their hands during a class discussion, and he regularly threatened to throw shit at us, and that isn’t even a fraction of the stories I have about him.", "I mean, group bullying as classroom management is also a pretty serious issue.", "Yes very much true. As a mom sometimes my kids think I’m yelling or being mean when I’m speaking firmly, setting a rule they don’t like, explaining that they did something wrong. I try hard to be self aware and yes sometimes I yell but sometimes I’m not raising my voice at all, I’m just saying something firmly that they don’t want to hear.", "Also thinking all of this. Sometimes kids aren't intentionally lying even though they're really wrong about how events went down.", "Sorry let me be clearer. It was not my son that flipped the desk. It was a classmate.", "Bullying does not project authority,it creates fear,anger and negativity.", "Send it now. My mom's school email is linked to her phone. They don't need to respond over the weekend and you can tell them that, but this is so serious I wouldn't wait.", "Ah, my bad, read it too quickly. \n\nThen yes, definitely. Please include that info in your email so they can get help for the other child", "The overstep was forcing these kids at that age to hold it for 2 hours. The act of delaying it alone would not be bullying. Command presence is vital for teachers, but especially for supply/substitutes.", "Admin keeps up with their email over the weekend.  I would send asap for time stamp purposes as well.", "This is not a problem with new meds, this is a problem with a substitute teacher.\n\nNTA", "However, a teacher might get ill over the weekend, and then the sub could show up on Monday in that class. Don't wait.", "NTA   Long-time principal here. Send the email!", "report that asshole they have n9 business teaching", "NTA. Absolutely email the principal and report the sub. What they did was child abuse.", "Nta", "NTA. That sub is a sick twisted person.", "NTA. I don't even get why you are asking something that should be done right at the moment you found out.", "Yeah especially for young kids. She's lucky no one peed their pants. Come on they are in second grade they have tiny bladders.", "The Geneva convention is also against group punishment isn't it?", "Having the class gang up on that kid wasn’t overstepping? It wasn’t bullying AND teaching those children that attacking in groups against one was OK? That sub should be fired.", "Principals usually check email over the weekend, and this is serious enough that I would send it now and not wait. That sub should not be in front of children.", "props to you for not only asking for perspective, but for realizing you may be in a place where you need other opinions. not many people do that.", "Send it I have worked in a school district for many years now most of us check our emails during the weekend.", " Bullying and not letting kids go to the bathroom is cruel. \n\nOP should definitely send that email. NTA", "NTA\nIf I did that as a substitute, I'd be out of a job at the district. ABSOLUTELY unacceptable.", "NTA. Wow they will literally let anyone be a substitute. Yikes. Hopefully you can prevent another such incident. Hope that boy who was bullied is alright.", "NTA, some subs are awful, and the school probably doesn’t want her to return either.", "NTA!\n\nI have been a sub, and I am also a mom. I would report her too. That is bullying , and you never punish the whole group because one kid is doing something. Not only is it developmentally inappropriate, but it's punitive and horrible. This is not okay. I'm glad your kiddo told you!", "Report her now, that's ridiculous", "NTA - Def report them.", "Report the sub. She’s a terrible teacher.", "Send that email now.", "It is, yes.", "u/DadToOne\nWhat happens if his teacher or another teacher is absent Monday & that *same* sub shows up Monday in class?? They dont need to be given another chance to bully any more children. Not letting them go to the bathroom borders on abuse. This person does *NOT* need to be in charge of children\n\nMost administrators have their emails linked to their phones. Even if you wanted to include in your message that you werent expecting a reply over the weekend & they could respond Monday, at least this way theyre aware of the situation & they wont unknowingly schedule this person for another class Monday morning.... \n\nId maybe give it until tomorrow (Saturday) as it's never a bad idea to sit on something so it doesnt just come out as anger but I definitely wouldnt let it wait to be sent until Monday", "NTA. That sub should not be allowed to work with kids.", "Seems like shes a sub for a reason. \nNTA. \nThere is always going to be that 1% of kids that dont listen. She cant punish the other 99% for it.", "Send the email anyways. Before bedtime my son was telling me about a teacher bullying him. I got all the details and the promptly email the principal. She responded 15ish minutes later at close to 10pm. They read their emails, they’re always on the clock. This seems important enough to warrant a fast response or at least acknowledgement that it will be dealt with first thing Monday morning.", "Not at any of the schools I worked at. Why should they? They’re not being paid to work weekends. It can wait till Monday.", "If you are a salaried administrator you are always on the clock. Teachers work outside of school hours all the time. The administrator may not want that substitute in a classroom while the timed email finally gets sent and they have time to notice it. Monday mornings tend to be busy, I'd rather get an email like that over the weekend than on Monday morning.", "Yes. I used to be a teacher and I am married to a teacher. I understand that teachers work outside of school hours, but I still think emailing outside of official working hours is a little rude, but I do understand it’s sometimes a necessity. But you were talking about admin staff, not teachers. School admins earn on average £22k here, according to a quick google. They’re definitely not expected to work outside of their given hours.", "What kind of administrator only makes 22k? The principals in my area make 100k and up and would rather receive this email now than on Monday morning. However, if the administrator doesn't feel like reading emails over the weekend is part of their job, they don't have to read it right away. It will still be in their inbox on Monday. \n\nAlso, you understand that these people tend to be busy during \"normal working hours\" and may not have the luxury of checking their emails in real time? You send it Monday morning there's a good chance they don't have a chance to read it until most of the school day is over and now a bully of a sub has been in the classroom an extra day because you didn't want to come off as rude. Get over it, send the email ASAP.", "Ohhhh ok I’m with you now. We were on different pages - this a language difference thing. You mean senior staff when you say “administration” but here in the UK, “school admin” means the non-teaching staff like receptionists, admin assistants etc, who do day to day admin but aren’t senior members of staff. That’s why I bristled at what you said because my thinking was “well why should someone making barely over minimum wage be expected to work over the weekend”. \n\nYeah, I agree that senior staff including headteachers would be looking at emails over the weekend.", "NTA! Taking away the access to basic needs as punishment is in no way ok (food, sleep and bathroom). It is questionable when you are the parent, but it is a massive red flag if you are a educator. \n\nThey not only encouraged bullying by having them make mean faces, but also by punishing the entire group for the actions of an individual. \nThis person should not teach anywhere in any form whatsoever. \n\nReport them asap!", "NTA. It is not her job to punish a kid and class for an obvious reaction to what she told them to do to him. Some kids are loud - she needs to get over it.", "NTA.", "NTA.. non of this is ok", "What in the trailer park garbage is this? I want to live a trailer   life and I will rescue all the children from meth parents because I want free labor. Just kidding. I'll pay em", "NTA\n\nPut it that way. If she is a substitute, she will interact with hundreds of kids every month. \nIf this is her routine behavior, how many kids is she going to traumatize?\n\nAdults in positions of power need to be held to higher standards", "I'm a former teacher and you should send it now", "'Almost feels like bullying'? It IS bullying.\n\nAnd torture for those poor little possums not to have a toilet break!\n\nI would definitely complain. Loudly. NTA", "In Germany withholding bathroom access is considered harassment and can get teachers in serious trouble.\nNTA, write that letter", "I would be just as upset that a bunch of 8-year olds couldn't go to the bathroom for two more hours. That's not good for young bladders. \n\nThat sub taught those students that day that\n1. bullying is okay\n2. ganging up on a person to get what you want is the thing to do\n3. you should neglect your bodily needs\n\nSub sounds like a winner. \nSend the email this weekend so not to be booked for Monday.\nNTA", "NTA. Please report that teacher!!! What they did is some weird shit teachers would’ve gotten away with 30 years ago when I was in second grade (ask me how I know! Ugh), but not now. It’s cruel, and making them wait could’ve led to UTIs or embarrassing accidents.", "This is bullying and abuse. REPORT HER to protect the kids.\n\n&#x200B;\n\nNTA", "It’s also a gigantic risk for every single little girl in the class. Female urethral lines are shorter than boys’—we need to go more frequently, or we have a majorly heightened risk for contracting a UTI. \n\nI once didn’t go once during a five hour road trip. Held it the whole time. A week and a half later, it was in my bladder, both kidneys and *my blood*. I almost died. I was in the ICU for four days, in the hospital for ten, and home with a PICC line on further antibiotics for another seven. \n\nUTI’s are the main cause of septic shock, which is lethal if not treated within 24 hours—and also what I had. Doctors told me they had three hours left to administer treatment by the time I got there, and I was still left with permanent kidney damage (waiting on a transplant), permanent brain damage (from the febrile seizures—my fever got to 42.6° [108f] before doctors recognised what was going on) and I had a feeding tube for two months because of how much weight I lost, and how sick I was. \n\nThey sent me home like that, a PICC line, feeding tube, and strong advice to *never ever hold my pee like that again* because get this; we *need* to wash out the bacteria climbing up our urethra, or it invades the bladder. This teacher’s a moron. It’s her job to know that, as the adult in the room charged with looking after them and knowing things they’re too young to understand yet. \n\nAny one of these kids could’ve held their urine in for the morning with the same assumption every other kid makes; “I’ll just go when I need to, obviously I’ll be able to!”. Only, they weren’t. \n\nI feel terrible for the poor little boy who was the subject of a grown woman’s bullying, but even that doesn’t compare if one of these kids develops a UTI as a result of her actions.", "1000% this is bullying. I am in my 40’s now, and can still vividly remember my ballet teacher when I was 4 or 5 years old getting all the kids in the class to blow raspberries, stick their tongues out at me, and pull faces at me while I sat on the floor, all because I was unable to get a move right. I never went back. Definitely report this, she is an awful teacher", "Your kid is going places...", "So true about students not fully understanding a stern or firm voice. I taught preschool and had several children who would over exaggerate. Once had a parent tell me “My child said you got very angry at him and yelled at him yesterday” and I was sooooo confused because I never got angry at the children. Then I remember that kid was standing on a table (with wheels!!) trying to jump off the day before. So I had to explain to mom that yes he did hear a stern voice and yes he did get in “trouble”, but I never yelled or was angry mostly panicked because I didn’t want him to get injured, especially not on his head.", "Let's not encourage unhealthy work/life balances any further! There is no good reason not to wait for the next working day."]}