{"id": 16512, "submission_id": "139hhcw", "title": "AITA for refusing to swap Mother's Day weekend with my ex?", "selftext": "Ex and I have a 7 year old daughter together, Indie. Our divorce was pretty friendly considering we mad such a bad couple and when he met his wife Gwen I really liked her and the two of us got along so well. She said Indie was such a sweet kid and how excited she was to be part of her life. I loved it for Indie and Indie really liked Gwen. But right around the time Gwen and my ex bought a house together things went downhill. Gwen has three children ages 12, 10 and 8 and they dislike Indie. There seems to be some jealousy there because Gwen was nice to Indie. Indie has talked about the kids saying mean stuff (like she doesn't belong, that she's dumb, that nobody likes her or wants her around). Indie told her dad and Gwen and they assured her it would get better and they would handle it. But nothing has changed and whenever Indie is with the whole family she ends up being told by the kids that they don't want her there, they have fits over having to include her in activities and Gwen and my ex have started telling her that she just needs to \"wait a bit\" and she can have a turn with one of them after. But they always forget about it by the time Gwen's kids are finished. She said when it's just her and Gwen it's even worse because Gwen's kids hate when she speaks to her and that just makes them more angry with her. She told me she doesn't like spending time with the family anymore.\n\nAnd to make things even worse, Gwen has complained to me about Indie \"pulling away\" and \"seeming less interested\" and I brought up what Indie was saying and she said if she seemed more interested she would include her but she just doesn't seem to want to be around anymore. My ex was like what do you want me to do, Gwen's kids don't like me either.\n\nSo when my ex asked if we could swap Mother's Day weekend this year, so Indie could be with them, because they are doing a Mother's Day weekend trip and Indie should be there, I said no. He was like come on, you can even get extra time and I said no. He asked why and I said I wanted my daughter for Mother's Day and it was final. He told me Indie shouldn't miss out on the trip. I told him she's missing out on nothing other than a weekend of being excluded and treated like an outcast and feeling like she has to be careful of having Gwen's attention because her stepsiblings will hate her for it. He told me it doesn't mean she wouldn't enjoy it.\n\nEx said I was being unfair and unreasonable. \n\nAITA?\n\nAdding before I post: I did not ask Indie if she wants to go because she has expressed repeatedly how she hates doing trips with them and how she wishes she could stay with me when they go places. So that is enough for me to say she would not want to be there... She also doesn't like Gwen as much since she feels like she gets forgotten. She also feels that way about her dad too.", "created_utc": 1683363727, "permalink": "/r/AmItheAsshole/comments/139hhcw/aita_for_refusing_to_swap_mothers_day_weekend/", "score": 55, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to swap Mother's Day weekend with my ex because I do not want our daughter to be miserable that weekend, even if it means she misses out on a trip they have planned. My ex really wants her to be there and I maybe could have communicated better with him throughout this which is why I could be an asshole. I refused and engaged somewhat but did I engage enough and really advocate for my daughter enough? Maybe not.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You are her mother, not Gwen, and it seems like making her go would be punishing you and her unnecessarily when it's your day. Your ex needs to do something about this situation. He is alienating your daughter from his family by not stepping up, yet seems to be laying the responsibility on a 7 year old to fix the situation. The 12 year old and 10 year old and definitely old enough to both know and be told what they are doing is not on and to have some form of punishment as a result of their actions.\n\nYour job is to make sure Indie is happy, and it certainly sounds like she isn't enjoying her time there. He's an AH for insisting she goes on a trip that will just make her feel miserable.", "NTA.  Leaving out all the stepsibling unpleasantness,  it's your weekend.", "NTA.\n\nFor your ex to ask you to not be with your child on Mother’s Day of all days is incredibly entitled and selfish of him. I would bet that if you asked to have Father’s Day with her to go on a family trip then he would feel the same way that you do about the situation. \n\nAt the end of the day, you’re putting your daughter’s feelings first and keeping her from a situation where she has expressed that she has been uncomfortable in the past. Have your holiday with your daughter and give her all the attention she deserves without the stipulations that she gets over there.", "NTA but I think you should be honest with your ex about why you won’t swap. He might need a wake up call to realise that his lack of action over his new wife’s kids is what’s ruining his relationship with indie, not the fact that you won’t swap.\nIt also sounds like indie would benefit from some one on one time with just her dad, instead of dad + ‘new family’", "NTA your job is to protect your kid from being bullied. It’s time to stamp this out. Either your ex starts dealing with things or you prepare for another court battle", "NTA. But you should still ask Indie. It would make things so much easier for you to tell your ex she’s not going. It would also just be a confirmation you’re doing what she wants.", "NTA\n\nThe 'joys' of a forcefully combined family. You are absolutely right in protecting Indie from all that when her father (and Gwen) seems disinclined to do so.\nForcing the children together is not going to make Gwen's children stop ganging up on Indie.", "A 7yr old can't fix the problems with Gwen and her kids playing Cinderella.  They want indie there because abusing her is their way to reinforce their identity as a family. Gwen's kids clearly have some serious insecurity issues about their mother's love. Indie will always be the outsider bc her presence helps them direct their nastiness at a common enemy. Don't subject your daughter to that. It will damage her self esteem beyond repair. Stand up for her. If you don't, no one will and nothing will change. Reduce time indie spends with them. She is too young to deal with the older kids abuse. Kids need to be taught manners. The idea that it will magically stop is pure evil and laziness. I think Gwen likes the children fighting over her and making her kids the \"in group\". Kids are just responding to clues from mom. She's playing princess and wants everyone to make sure indies position is known as a second class person.  Gwen's house will always be a place where indie learns she doesn't fit in. Don't subject your baby to that.", "Nta.\n\nIf you have a custody agreement in place, it needs to be re-evaluated.", "NTA at all. He's TA for even asking", "NTA. She expressed her discomfort repeatedly about these trips. Personally, I'd still speak to her about it, so there's no room for misunderstandings or accusations.", "No, you are not!", "NTA. You are her mom, not Gwen. And your ex and Gwen need to get into family therapy with her kids ASAP. The kids need to be told when they are treating Indie wrong and there must be requirements for basic decency and kindness which I'm not seeing here. This is such a bad situation, I can't believe they aren't in counseling yet.", "Absolutely, NTA! This is Mother's Day, not Stepmother and unfriendly Stepsiblings Day. Why your husband would not think this weekend belongs to you is hard to understand. \n\nWhat really gets me was this attitude:  \"*What do you want me to do, Gwen's kids don't like me either.\"* Whoa. He is married to a woman whose children don't like him; that must be a terrific household. He should be expected to be doing everything he can to improve his relationship with his stepchildren. Gwen should be doing everything she can as well. Professional help is probably necessary. Did they even think about this situation before they married and moved in together? \n\nMeanwhile, your daughter should not be subjected to this toxicity. You should tell your ex and Gwen that Indie's time with them will be severely limited until they can provide an atmosphere for her that is loving and welcoming, which is not going to happen until Gwen's children stop disliking their new stepfather. Stand your ground! Good luck.", "Nta. Wtf is wrong with your ex?", "Even without any of the issues with Indie's step-family, it's a hard NTA.\n\nParents always trump anything for their day.", "NTA", "NTA", "INFO: Have you considered going for full custody with very regular visitation with her Dad? That way Indy won't have to endure being bullied 50% of the time and can spend 1-1 time with her Dad. Or if he insists on bringing his wife & her kids to their activities, Indy at least gets to go home to you, a home she feels safe in.", "ESH.\n\nThese situations are difficult to deal with. It's not easy to just get children to get along and accept each other as family. I understand seeing your child in distress is hard but you seem to expect your ex's wife to simply fix it. You can stop the children from being mean but you can't force them to accept. You never mentioned how long it's been so I will assume less than a year, given how you mention the ages. These things will take time and persistence. \n\nAt the end of the day it is your daughter and your day. However, you could have asked her instead of assuming and you don't seem to consider that a joint trip may help them bond while missing out may only solidify that your daughter is not a part of this new family. But, they could have chosen to do the trip on another day than Mother's Day and on a day that they have her.\n\nSeeing how your ex isn't here to defend himself I have to take what you say with a grain of salt. I get the suspicion that you are putting your own feelings into this rather than actually doing what is best for your daughter. That you want the weekend to be yours is all well but I'm not buying that protecting your daughter is the main reason.", "YTA reading your post it seems to me that you get all of this information out of a 7yo. Have you seen these things happen yourself? I would speak with your ex and tell him what you told us, I assume you both wants whats best for her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEx and I have a 7 year old daughter together, Indie. Our divorce was pretty friendly considering we mad such a bad couple and when he met his wife Gwen I really liked her and the two of us got along so well. She said Indie was such a sweet kid and how excited she was to be part of her life. I loved it for Indie and Indie really liked Gwen. But right around the time Gwen and my ex bought a house together things went downhill. Gwen has three children ages 12, 10 and 8 and they dislike Indie. There seems to be some jealousy there because Gwen was nice to Indie. Indie has talked about the kids saying mean stuff (like she doesn't belong, that she's dumb, that nobody likes her or wants her around). Indie told her dad and Gwen and they assured her it would get better and they would handle it. But nothing has changed and whenever Indie is with the whole family she ends up being told by the kids that they don't want her there, they have fits over having to include her in activities and Gwen and my ex have started telling her that she just needs to \"wait a bit\" and she can have a turn with one of them after. But they always forget about it by the time Gwen's kids are finished. She said when it's just her and Gwen it's even worse because Gwen's kids hate when she speaks to her and that just makes them more angry with her. She told me she doesn't like spending time with the family anymore.\n\nAnd to make things even worse, Gwen has complained to me about Indie \"pulling away\" and \"seeming less interested\" and I brought up what Indie was saying and she said if she seemed more interested she would include her but she just doesn't seem to want to be around anymore. My ex was like what do you want me to do, Gwen's kids don't like me either.\n\nSo when my ex asked if we could swap Mother's Day weekend this year, so Indie could be with them, because they are doing a Mother's Day weekend trip and Indie should be there, I said no. He was like come on, you can even get extra time and I said no. He asked why and I said I wanted my daughter for Mother's Day and it was final. He told me Indie shouldn't miss out on the trip. I told him she's missing out on nothing other than a weekend of being excluded and treated like an outcast and feeling like she has to be careful of having Gwen's attention because her stepsiblings will hate her for it. He told me it doesn't mean she wouldn't enjoy it.\n\nEx said I was being unfair and unreasonable. \n\nAITA?\n\nAdding before I post: I did not ask Indie if she wants to go because she has expressed repeatedly how she hates doing trips with them and how she wishes she could stay with me when they go places. So that is enough for me to say she would not want to be there... She also doesn't like Gwen as much since she feels like she gets forgotten. She also feels that way about her dad too.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. \nYou: “she doesn’t want to go as she is excluded, the kids are mean to her, she is on eggshells and she gets stressed.”\n\nEx: “She likes it!”\n\nWhat is wrong with him?", "NTA. You're her mother. It's your day, regardless of Indie's relationship with Gwen.", "He should do something but he has made it very clear to me that he doesn't feel like he can and that's the end of it.", "Im guessing that Gwen will never let that happen. The dynamic is that indie is visiting Gwen's house. Putting indie in her place is how Gwen and her kids solve their own insecurity issues. They are way too insecure to allow indie to have a decent time while there with her dad. So, no way will they allow dad to have one on one time. Idk how they would sabotage it besides making such a fuss that it taints the whole thing.", "I think she did, she said all Indie would be missing out on us a trip where she’s excluded ect.", "Hear, hear!", "I can't reduce the time Indie spends there. All I can do is advocate with my ex as much as possible and help indie. My ex and I share custody. He is entitled to his custody time. But nothing more than that.", "This is not enough for it to be re-evaluated. I sought advice on that already.", "Ex is throwing his hands in the air and saying he can't do anything. Gwen seems to just want to blame Indie for \"pulling away\" when in reality, she's protecting herself.", "He doesn’t want to go against his new wifey out of fear of being denied nookie probably. Because I can’t imagine why a man would stay with a woman like that. And he’s a massive failure of a father to let his daughter suffer like this.", "It has been going on for pretty much the two years of the marriage. And they have gone on many trips (normally just for a day) together and the same thing always happens. My daughter hates them. She's always miserable when they have all spent time together and feels bad.", "But, the ex sounds like a doofus to me. He says \"what do you want me to do, Gwen's kids don't like me either.\" Lordy. It sounds like this ex threw his daughter into a screwed-up situation, which should have been dealt with before he married and moved  into this new family.", "I have already spoken to my ex. He acknowledged they happen but said he can't do anything about it.", "It says in the freaking post that OP has talked to ex AND Gwen about this. Jfc", "Your ex is failing as a father. I hope he realizes it before Indie grows up to resent him.", "And that's the end to it? He's a father...and a stepfather, and it's his responsibility to work on improving this situation. He has absolutely no right to just throw up his arms and declare \"I can't no nuthin'.\" He should never have married into this family if he wasn't going to except the job of being a parent. I am so sorry you are stuck with this guy.", "Then ultimately his relationship with his daughter will suffer because of it. That won't be your fault.", "Can you get the custody agreement changed? Indie should not have to suffer at her father’s house just to not rock the boat. \n\nShe probably can’t feel safe at her dad’s because she has to worry about getting picked on for every little thing. It’s really not good for her to be there. It’s three against one and they’re all older and your husband and his wife are doing nothing! Is Indie the kind of kid who suffers silently? I bet the step sibs are loud and obnoxious when they don’t get their way. \n\nYou need to stand up for your daughter and get her out of there until your husband can ensure her safety and well-being. She shouldn’t have to suffer there, they should support her and help her thrive.", "I would be encouraging Indie to make a secret phone list of all the things they're saying to get a judge to limit her need to go over there. She should be old enough to choose at this point", "Keep recording evidence in case this gets worse", "That sucks.\n\nWould he consider another arrangement that would ensure that he spent one on one time with your daughter instead?", "Is it feasible to have her go to therapy and hopefully her therapist will be able to help you with reducing her time spent there if it turns out to be necessary?", "Document, document, document. \nGet his unwillingness to try in writing so you can bring it to court. They will either give you custody or mandate counseling. What kind of father let's people treat his child like this. I am remarried as well and we never would have made it to the altar if our family had been behaving like this. The kids come first. Such BS."]}