{"id": 16529, "submission_id": "139sn3l", "title": "AITA for kicking my study partner out after she took her shirt off?", "selftext": "I(20m) am in my first year of college. The other day, my class got assigned a partner project, so I asked my partner if we could do some work on it at my apartment. My reasoning is that I have a skin condition that causes painful rashes on my body, and they flare up on my chest really often. When they're like that, it makes wearing shirts very painful, and I can take them off at home.\n\nI told her my reasoning and explained my condition to her before asking if she would be comfortable with that. I was perfectly willing to put up with a shirt if she wanted me to. She said that would be okay and gave me the go-ahead. Yesterday was our first work session at my house. \n\nShe got there, I was already shirtless. It's pretty obvious to see the big, red spots all over my chest to know I'm not faking. I went and got out some snacks, and when I came back, she'd taken off her shirt. And, I mean, shirt and everything. Hoodie, t-shirt, bra. She was sitting there with her tits to the wind. \n\nI was immediately stunned. I asked her what the hell, and she said if I could, she could. I told her I wasn't comfortable, and I could put my shirt on if she wanted me to, but to please at least wear her bra. She refused, so I kicked her out. \n\nNow, a couple of my friends say I'm an asshole, and I should've just let her get away with it. Personally, I didn't feel comfortable in the situation. \n\nAITA?", "created_utc": 1683386186, "permalink": "/r/AmItheAsshole/comments/139sn3l/aita_for_kicking_my_study_partner_out_after_she/", "score": 64, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be an asshole, since I had my shirt off too, which might make me a bit of a hypocrite.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Don’t treat her like that", "I think YTA. How is that not a double standard?", "Fake news.", "Someone doesn’t know how to flirt. They’re just nipples. If one set is out it’s fine for all to be out. Free the nips. YTA prude. Rub some salve on that shit and don’t bring it up if you have body issues with yours or anyone else’s body. Maybe she is a nudist. girls like comfort too. You are directly responsible for the situation because you were more concerned about you needing special treatment than studying.", "This sounds very made up, but if not NTA", "NTA, she was being rediculous. You have a medical condition that you explained ahead of time. She sprung this on you. Who knows what motive she had. Weird.", "This is, simply put, a matter of consent. She consented to being around you with your shirt off, you did not consent to being around her with her shirt off. More over yours was at your residence and due to a medical reason while hers was simply a desire to be topless. NTA.", "Nta hell no you needed to do it because you have a skin condition she did it for no reason", "This story reminds me of that other thing that never happened", "She was trying to bang", "NTA", "NTA - you have a condition that makes it uncomfortable to wear a shirt. You asked for her consent and we’re willing to inconvenience yourself in case she did not give it. \n\nShe assumed the same for her. She did [not] ask for consent. \n\nConsent goes both ways. She was not respectful of that in your home. This is pretty simple.", "NTA but seems like you missed a golden opportunity my guy", "INFO: Was she trying to be combative, or did she just want an excuse to show you her chest because she thought you'd like that?  This is just weird.  Sounds like you didn't want to see her chest, though, so bad move by her.  You're NTA here.", "Wut the actual fuck.\n\n1. Are you gay?\n2. Is she fucked in the head?", "YTA for posting fake news or kicking out a girl who was topless, either things make you an asshole", "NTA. You okay’ed it with her first; she had the opportunity to say no if she was uncomfortable. And she didn’t have a reason to take her shirt off, so there’s really no point in doing so. \n\nIf she changed her mind after seeing you shirtless, she could have asked you to put your shirt back on. She didn’t have to strip in your home.", "NTA\n\nYou were for fairness and she was for equality. I wouldn't mind at all if she has no shirt on, but it's fair if you don't want that. Just because shes fine with you having no shirt, doesnt mean you need to be too", "YAT. She may feel more comfortable that way for a number of reasons. including because for some women wearing a bra is extremely uncomfortable and thank God more and more women are tired of it (i dont use).\nIf you can go shirtless, so can she. simple. stop sexualizing her body unnecessarily. breasts are not sex organs!\nPS. before you tell me she never asked you to put your shirt on. did you offer? put yours and I put mine?", "Absolutely NTA!\n\nYou had a medical reason, you asked ahead of time, you did everything right. If she had an issue with it, she should have said so right up front.  I suppose the alternative would have been to just allow her to remain topless, but who wants to bet that she then would have somehow twisted the situation into some sort of harassment/assault scenario?", "So you don't like titties?", "Liar I don't believe this story", "Someone doesn’t know how to flirt. They’re just nipples. If one set is out it’s fine for all to be out. Free the nips. YTA prude. Rub some salve on that shit and don’t bring it up if you have body issues with yours or anyone else’s body. Maybe she is a nudist. girls like comfort too. You are directly responsible for the situation because you were more concerned about you needing special treatment than studying.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(20m) am in my first year of college. The other day, my class got assigned a partner project, so I asked my partner if we could do some work on it at my apartment. My reasoning is that I have a skin condition that causes painful rashes on my body, and they flare up on my chest really often. When they're like that, it makes wearing shirts very painful, and I can take them off at home.\n\nI told her my reasoning and explained my condition to her before asking if she would be comfortable with that. I was perfectly willing to put up with a shirt if she wanted me to. She said that would be okay and gave me the go-ahead. Yesterday was our first work session at my house. \n\nShe got there, I was already shirtless. It's pretty obvious to see the big, red spots all over my chest to know I'm not faking. I went and got out some snacks, and when I came back, she'd taken off her shirt. And, I mean, shirt and everything. Hoodie, t-shirt, bra. She was sitting there with her tits to the wind. \n\nI was immediately stunned. I asked her what the hell, and she said if I could, she could. I told her I wasn't comfortable, and I could put my shirt on if she wanted me to, but to please at least wear her bra. She refused, so I kicked her out. \n\nNow, a couple of my friends say I'm an asshole, and I should've just let her get away with it. Personally, I didn't feel comfortable in the situation. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Its a weird gotcha to do that.\n\nYou told her in advance why, you said you'd accommodate her if need be, and to just ask. \n\nShe took off everything (bra included), honestly just to make you uncomfortable. You once again asked \"can you put at least a bra on? I'll put on a shirt if you want me to\"\n\nYou did nothing wrong, if she was uncomfortable she should've said something.", "Years from now. You will remember all the missed opportunities that girls were giving you, but you were too self conscious to realize it at the time.", "This story is either fake or this girl wanted to knock boots.\n\nEither way OP is dumb lmao", "It sounds like you don’t know her well. I’d find this very strange too. She knew you did it for medical reasons. I’m not sure why she did it but it would throw me a lot. NTA as you offered to put a shirt back on. Idk if she was trying to make a weird point or what.", ">And, I mean, shirt and everything. Hoodie, t-shirt, bra. She was sitting there with her tits to the wind.\n\nINFO: Just to be crystal clear, were you wearing a bra?", "YTA If she had to look at you, you could suck it up and look at *her*. \n\nWhat? Did you think she was gonna jump you?", "NTA \n\nSo she think it's appropriate behavior to run around half naked for no good reason in YOUR home? And if you'd by accident have so much as brushed against her boobs she would have been the first to cry sexual assault. You were right to kick her out.", "Did you get all embawwassed seeing her topwess? After 10 minutes you literally wouldn't notice.  YTA", "she's a weirdo NTA don't let anyone tell you how they can conduct themselves in your own home.", "NAEH\n\nNobody Actually Exists Hete", "YTA.", "I'll take \"Things that didn't happen\" for $800, Alex...", "NTA you told her about your condition asked for consent received consent and moved forward... she did not ask for consent she got naked and insisted if it was okay for you it was okay for her and argued a bit once you expressed your uncomfortableness... Now I will say I think maybe she had misread some stuff here and thought you were hitting on her in a way... either that or she is kinda a creepy woman who doesnt care about consent which is sucky... Not the asshole", "NTA you did it for a medical reason not just because, and even got her permission ahead of time. She did not ask permission", "I’ve been sitting here trying to think about why on earth she would take off her shirt and bra too, and I honestly am stumped.\n\nNTA. You should def get a different study partner.", "This might be reading the situation wrong, but I'm thinking she thought you were hitting on her and she was cool with it. \n\n\"Oh, hey girl, come over to my place to study and I won't be wearing a shirt\" someone willing to go to that place is probably thinking they are about to have sex.", "NAH \n\nLOL\n\nShe might have thought about something more than just showing her... Maybe she likes you :D.\n\nI wouldn't get my top clothes off just because a MALE classmate took his shirt - even if there wasn't a visible rash that made him uncomfortable.\n\nAnd i hate wearing bras. I wear them only if it's a see through. \n\nBut for my partener, at home or at the beach, of course (topless is ordinary in my area).", "NTA. You asked her first If she was okay with you being shirtless to assuage a medical issue. She was okay with it. At that point if she wanted to be topless or planned to be she could have countered by advising you she would be to. Instead she just stripped in your home...while you were out of the room so it's like she did it for dramatic effect. Them she doubled down and refused to cover back up IN YOUR HOME despite your discomfort and request. She's a triple A h for not respecting time.place and circumstances.", "NTA. You obtained consent beforehand. She did not. Asking her to leave was appropriate in the moment.", "NTA.  You ASKED her if SHE would be comfortable in your state of undress and offered, if not, to accommodate her boundaries.  She shucked her top WITHOUT consideration of your comfort and refused to accommodate your boundaries.  That lack of consideration on one side makes her TA.", "I'd say NTA because you asked her beforehand if she would be uncomfortable with you being shirtless, and you'd be willing to keep your shirt on if she was, whereas she didn't give you the same courtesy. \n\nShe didn't ask if her being shirtless would make you uncomfortable, she just went ahead and did it anyway, ETA and then she refused to compromise (if you were willing to keep a shirt on to make her comfortable, then she could've at least done the same with the bra)", "YTA-Huh? Are you afraid of tits?", "NTA. I hope she didn’t try to make a point about equality with this because she just managed to make herself look like an idiot with no sense for boundaries. You are fine OP. I hope you manage to finish the project even if your partner is a weirdo.", "She is the boss of her body. YTA.", "Don't treat her with respect? Don't expect the same treatment in return from her? \n\nYou need a different take on this.", "Because he asked if he could prior and offered to wear one the the detriment of himself.", "Because he said he’d put his own shirt back on AND he asked her if it would be a problem well ahead of time?  If she wanted to use it to strike a blow for women’s rights, then she should have just said so ahead of time.  NTA.", "How about because he obtained consent and she didn't?", "Being topless is generally a gender neutral law. It's a philosophical point about nipples being sexual or not.", "You'd be surprised at the amount of unbelievable shit that happens.", "I'm going to add this story that didn't happen to my book \"*Things That Never Happened*\" that I'm not writing.", "There it is.", "This is. Not a good line of logic. Eerily similar to when a guy gets assaulted or r*ped and ppl say \"oh you were so lucky!\"\n\nHe was uncomfortable. Didn't want it. No \"golden opportunity\" about it because he didn't want it, he wanted to work.", "she'd report him for sexual assault/harassment", "Yes, he outlined in the post that PRIOR to them meeting, he said he'd put on a top if she felt uncomfortable, and when she came in again, he once again said if she could put on a top and that he'd also do so if she was uncomfortable.", "This is insane. I’m all for women choosing not to wear a bra, but that’s not the same thing as undressing entirely in front of someone who has verbally expressed that they are not okay with it. This is not OP sexualizing his partner unnecessarily, this is her *violating* his boundaries. He asked for consent numerous times and offered numerous times to put a shirt on, she did not and completely disregarded his feeling of discomfort. How are the two things even comparable? He has a CONDITION, not a preference.", "Except she didn’t ask if it was ok. She just went ahead and did it which is never an ok thing to do.", "He obtained consent to have his shirt off, both before and in the moment. \n\nShe did not. \n\nUnderstanding this is not difficult. If you think it's about equality, then equality starts with consent.", "Yes.", "He said right in his post that he ASKED ahead of time, AND he then said he’d put his shirt back on.  I’m sure he wouldn’t have cared if she removed her bra and left her shirt on.\n\nAs a woman I take offense at women like this giving us all a bad reputation.  I assume she was trying to make some big point about equality but all she did was violate his consent and act like an idiot.", "EXACTLY THIS!!\n\nKeeping it off when the other person expressed discomfort definitely feels like harassment.", "😂😂😂", "OP stated they were a male", "INFO:\n\nDoes she think getting consent is a rule that does not apply to her?", "If there was an AITA prize for worst take you would certainly have won.", "He asked if he could though, and said he'd put one on if needed.\n\nWhy couldn't she at least have a bra on since he asked? He felt uncomfortable so he asked\n\nShe didn't being up if she was uncomfortable and she didn't ask. Not equivalent at all", "I was willing to put on a shirt if she asked. She didn't *have* to look at me, I asked her if she would be okay with it first and she said yes.", "Ummmmm I think she was hitting on him … not sure that qualifies as a good reason in this case …. No consent was asked before breaking out the big guns. \n\nNTA in any case", "Why are you mocking someone for being uncomfortable and setting a boundary and then stopped interacting due to her continuing to violate it?\n\nBtw no double standards here as he offered numerous times to put a shirt on if she was uncomfortable and told her in advance.", "I'd be uncomfortable if I'd discussed an issue and obtained consent to be shirtless and others removed their shirts without discussion or consent - particularly so if I'd offered to remain with a shirt on. \n\nThe study partner tried to prove the wrong point about equality. So have you.", "Friendly reminder that consent is a thing and you should always get it prior to exposing yourself.", "fr no woman is that crazy", "Completely.", "Breasts are not sex organs, both sex's have them, the only difference is with men they are residual with women functional. There is a push among some to change the narrative around breasts. \n\nIt's an equality thing, if men can walk around with their chests exposed, women should be able to as well. \n\nBut this was not the time and place to make that statement. Even nudists don't strip down without consent of the homeowner. Time and place are a thing as is consent, even when sex is not involved. \n\nHe asked her if she would be uncomfortable with him being shirtless, she did not show the same courtesy.", "\"Oh, hey girl, come over to my place to study and I won't be wearing a shirt\" + \"because I have ugly red, itchy, painful blotches all over my torso.\"\n\nFTFY. Anyone who hears this and thinks they are about to have sex needs therapy.", "I disagree. He said it was for a medical condition and that he'd put one on if she wants, and then when she came back, he said he was uncomfortable and for her to at least put a bra on, she refused because \"if you can, I can do\"\n\nFeels like trying to entrap him and accuse him of misogyny imo\n\nEdit: he also offered to put a shirt on again when she came in with nothing on top wise.", "I'd say disregarding his boundaries is an asshole move", "Comfort? America and its protestant ideologies. If dude takes his shirt off there's no reason she can't be comfortable too. It's his place, so he governa what happens there, but it doesn't mean he's not an AH for telling someone he's uncomfortable for them doing something he's literally doing.", "Because it's not sexual harassment if it's a hot girl doing it /s", "She in my home and hasn't asked if she can remove her clothing? She can be the boss of her body somewhere else. OP asked for consent: study partner did not.", "Doesn’t give you the right to strip in other people’s homes without their consent. Would you say the same thing if you saw someone naked in a grocery store?", "Exactly this.\n\nI feel like she may have even been intentionally trapping him. \"If you get to be shirtless so can i\" when usually he wouldn't had he not had a medical condition.", "I wasn't talking about the nips though. Her taking her shirt off made op uncomfortable and he was willing to compromise by both of them putting their shirts back on. she refused and he was uncomfortable so he made her leave. its his apartment and if he doesn't want someone there then its his right to have them leave.", "I mean, that doesn’t mean they can’t wear a bra 🤷‍♀️", "Like, have these people just… never interacted with society? How delusional does one have to be to think OP is the AH here? Lmfao", "It's also very misogynistic to go with only a guy can be there not wearing a shirt, because a women not wearing a shirt is different.", "I think that she thought he wants her. And she didn't thought that the rash thing can stop \"their relationship\" to begin.\n\nIt was a dumb move on her part but i don't think there was malice involved.\n\nImagine a guy wants to study with you at his house and he tells you in advance he will be shirtless.\n\nThat's all she heard. \"What rash?\"", "I agree but I also like this ladies initial reaction haha her follow up makes her TA though.", "It’s the difference between someone not wearing a shirt because of a medical condition and someone not wearing a shirt because they just don’t want to for shits and giggles.", "It is different tho", "This is not about her being a woman, it’s about OP being uncomfortable with nudity in his own home and her *refusing* to dress up. If a guy had taken off his pants and boxers I’m sure the reaction would have been the same."]}