{"id": 16540, "submission_id": "139rtwr", "title": "AITA for asking my BIL to stay with me when my husband was traveling?", "selftext": "My husband (m27) and I (f25) got married a year ago, were living together. My family doesn't live here, they live about two hours away. \n\nHe recently got a promotion at his job. Our house is a little bit further away from the city, we live in a farm type house (although it's not a very big portion of land, but we have neighbors that have bigger properties, point is our neighbors live kinda away). With his new position he'll need to travel sometimes, his first trip was last year, he had to travel for two days. I honestly did not had a good time, because I was alone and away from neighbors, I did not felt safe. \n\nI spoke to him and we agreed that next time I'll ask a friend to come stay with me. Well he needed to travel last week too, this time it was three days. I told him I was gonna ask a friend (Jennifer), he left early in the morning. \nI thought about it and then I started overthinking, I don't think I'll feel safe if it's just Jennifer and I, we're still two women alone. So I called my BIl Ashton (m24) if he could come stay with me instead, he agreed so I called Jennifer to tell her my plans had changed. \n\nHe came home around 6 that day, we had dinner together, chat and watched a movie together. We mainly did those stuff during the time he stayed here. My husband and I spoke on thw phone but I didn't told him I had called his brother instead of Jennifer. Ash and I are close, I am with all of his family, so I didn't think he would mind. \n\nMy husband came home last Thursday around 8PM. When he saw that Ashton was here he was a bit taken aback. As it was late I told BIL to stay one more night if he wanted to and he did. I could tell my husband was upset, I asked him what happened and he told me nothing. The next day, after he got home from work, he was still upset so I asked him again what's going on. He said that we had agreed that I was gonna call a friend, he didn't agree with having BIL over. I gave him my reasons as to why I called him instead. He still said that I shouldn't have called him because I know that their relationship is not the best. We argued and now he's even more upset with me for not even apologizing, he asked if I am gonna call Ash everytime he goes out and I told him yes, I'll do that because I don't want to stay alone. AITA?", "created_utc": 1683384314, "permalink": "/r/AmItheAsshole/comments/139rtwr/aita_for_asking_my_bil_to_stay_with_me_when_my/", "score": 61, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my husband's brother to stay with me when my husband was away. I might be the asshole because I'm causing insecurities on him, and his relationship with his brother is already not good\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You lied, at minimum, a lie of omission, when you spoke to your husband on the phone. \n\nYou are going to continue to do something that upsets him, when other options are available, yes, YTA.\n\nWhy is it so important that your BIL is the one that stays with you?", "You’re closer to BIL than your husband is? That’s already a sensitive situation. So yes, YTA especially for not telling him in advance. \n\nAlso, is your area unsafe? I can see why you wouldn’t want to be alone, but why is Jennifer no enough? I’m with your husband that it’s a bit suss", "YTA I don't understand why you didn't tell your husband the change of plans during one of the times you talked to him while he was gone. I don't understand why you didn't apologize for not letting him know you changed your mind. I don't understand why you don't get why he's upset about the whole thing. I don't understand why you would continue to do something that upsets him now that you know it does.\n\nAnd because I know it's coming, no, I don't think it's controlling of him. No, I don't think it's wrong of him to be upset. No, I don't think this is a hill she should die on. There are other options to make them both happy.", "YTA big time. You should have discussed asking his brother to come over because they are not in good terms. You should have at the very least mention the fact that he is there when you spoke on the phone. It looks like you are hiding something and you can't be trusted.", "YTA for inviting someone to stay in your home knowing the other homeowner/renter isn't okay with that person being there. You invited BIL behind your husband's back, and you said you'd keep doing it? You're being sneaky and you know it.\n\nIf you can't handle being home alone for a few days, you may benefit from therapy and/or installing security cameras outside.", "YTA - you failed to tell him when he phoned, which looks sketchy as hell to be honest. You also said they don’t have the best relationship, so why would you invite him knowing this. You lied about it, which makes it look sus.", "YTA. You know it makes him uncomfortable and yet you blatantly tell him you'll do it repeatedly in the future and fill him with worry or whatever he was feeling, and more than likely fill him with resentment in no time. Just picture him having your friend jennifer over while you're gone for a few days and just not telling you.", "INFO - Would you feel comfortable if your husband told you a guy friend was coming to stay with him while you're out of town, only for you to find out later that it was your sister or another woman, and your husband decided it wasn't an important detail to share?\n\nIs Ashton married or in a relationship?  If so, how did his partner feel about him staying with you?\n\nHave you and Ashton had any sort of romantic history?\n\nWhy didn't you tell your husband that Ashton was there when you spoke with him on the phone?\n\nWhat activities were you and Ashton doing while he was with you?  Where did he sleep?\n\nETA... Do you find Ashton physically attractive?\n\nHas Ashton ever hinted at or told you that he finds you attractive?\n\nIs this emotional connection you share with Ashton anything your husband should be worried about?\n\nDoes this connection you share with Ashton have anything to do with you wanting him to stay there every time your husband is out of town from this point on?", "YTA. You knew they didn’t have a good relationship and you still called? And on top of that you didn’t tell him that his brother was there when you had the chance which is strange. If you don’t feel safe there are other measures you can take without having to call his brother. Hope you guys can figure this out. Marriage is sacred and not something to play with so lightly.. hope you can consider that.", "YTA by omitting the truth", "YTA\n\nI think this has less to do with gender and more about...why the heck is *anyone* in your (pl) house without your SO knowing? Not that you had to ask permission for Jennifer or Ash, but this is just fricking weird. \n\nYou never even told him, which means you knew he wouldn't want Ash there since he doesn't like Ash. \n\nBut if I come home from a 3-day work trip and find out someone, anyone, my mom, your mom, our friend...has been staying at our house the whole time? I would be so confused. \n\nBecause if it's not wrong, why wouldn't you tell me???", "I N F O: what’s the issue with their relationship? Is your husband upset that his brother was in the house, or that a man was with you?\n\nUpdate: YTA, because you specifically invited someone over who you know your husband has problems with, rather than anyone else in the world. \n\nIt’s also clearly a significant long-term problem if the home you own is somewhere you feel unsafe, even with dogs and if a friend were with you, but that aspect of things doesn’t make you an AH, just that it’s a really major thing that you really need to find a solution to (not living in a situation that inherently makes you feel vulnerable, or dealing with that sense of vulnerability).", "YTA inviting a someone of the oposite gender over while your spouse is away is already weird, but to invite a person you know your spouse wouldn't want over is just stomach churning, and to continue to do so after he's said he isn't ok with it makes you 100% TA.", "Yta. And you know you are. That's why you didn't tell your husband about the change of plans when he called. You let him continue to think your friend Jennifer was the one over. You also know they have a strained relationship.and known you are purposely putting more strain on it. You are callously ignoring the way you KNOW your hubby feels. His insecurities and his discomfort and you are being stubborn and disrespectful about it. Also this is his house too. He has every right to not want his brother there and you should be more concerned with your hubby's feelings. If you are that scared *scoff* invest in a security system get a dog take self defense classes  or go to Jennifer's home instead.", "YTA. May I ask why your husband doesn’t get along with his brother? I think this is a really big sore spot you knew about. It is not going to end well.", "YTA. You should have asked your husband how he'd feel about it first. And you *definitely* should have mentioned it on the phone. Not a good look.\n\nImagine your husband did this except it was your younger sister, or cousin who was staying overnight, alone with him, for days. And he fails to mention it while you're gone.", "YTAYou're going to have to step outside of the \"I want a man here to feel safe\" thing for a second.  \n\n\nYour husband, has a problem with his brother, You told him that someone else was coming over, you decided not to tell him at all that your plans changed, and he comes home to find a man, his brother, there with you, and to top it all off, he's staying another night the first day your husband is back. I don't know about you, but that's awkward on like 900 levels.  \n\n\nLike to me, this isn't so much about being possessive as it is your husband wanting to be his own man, and know he can trust you, he kinda can't, since Jen was to come over, and you didn't tell him you changed your mind, and when you invite his brother he doesn't like over who he sees as that \"golden boy\", you're telling him all the shit he has going on in his own head DOES NOT matter, you could argue he doesn't care about you since you apparently just NEED a man over to feel safe, and he would rather not have that, but just be ready for this fight for the rest of your life if you're gonna be with your husband and this is the way you want to go about it.", "The fact that you didn’t even bother to tell him giving him a heads up especially when they don’t have a good relationship makes you the AH YTA", "So you don’t think inviting a non blood related person of the opposite sex overnight even warrants a mention to your husband…YTA \n\nSounds like you are punishing him on purpose for traveling.", "INFO: How long have you wanted to get with the brother? \n\nYTA you’re being sneaky and using your husbands work as an excuse to have your BIL in your home. You’re a grown ass married woman who can’t stay alone in her own home for 3 days?? BS", "YTA\n\nIf you thought you had done nothing wrong you would not have lied.", "Info: How bad is your husband’s relationship with his brother?", "YTA.", "YTA.", "Would not fly in my house. How would you like it if he  had a woman live with him those days he was gone?", "YTA, you changed plans and didn’t tell your husband. It’s a simple text. Like almost zero effort. So little effort that the only reason anyone can guess for not telling your husband is because you knew he wouldn’t like it.", "INFO: why isn't their relationship \"the best?\" \n\nIs Ash regularly invited to your home?", "YTA\n\nIf you don’t feel safe in your home alone you need to make a plan with your husband that you both can agree to. Get a roommate, build a saferoom, go stay with family, get a dog sitter, board the dogs, etc etc etc.\n\nAnd before you give excuses why all that won’t work, think about using that same excuse to explain why you’re getting a divorce. If you’re not mature enough to understand that your husband is your partner who deserves your respect and honesty, that’s what you’re going to get.", "Ok..so the reverse situation. Your husband is out of town for the job. He meets a old friend, your sister or any woman there. She tells him she doesn't have a place to stay and if he would let her stay with him. He agrees and never tells you. His reasoning is because you never asked. How would you react then?? \nIs he suppose to ask in every call that whom are you staying with? If he does that he would be called insecure and controlling. \nThis information was something you would have mentioned yourself. There was a change of plan and he needs to know that. Why couldn't you just have said to him that you will feel more safe with a man so have called his brother. He didn't ask or he wouldn't care is not a valid reason. You can't decide what he would care for and what not. It seems like you knowingly planned it in a way that you won't have to tell him. Honest intentions doesn't need dishonest discussions.", "YTA. You need to grow up. You don't need a man to protect you. You need to protect yourself. Ok, let's say someone breaks in while BIL is there and they neutralize him. What are are you going to do? Cower in a corner? FFS you're an adult, act like one. \n\nDo you have a thing for your BIL and are using your husband's travel as a smokescreen? Or do you just not GAF about his feelings or boundaries? Either way, your helpless heroine act is pathetic. Honestly, he'd be better off with hiring a nanny for you because you seem incapable of adulting.", "Yta the fact that you didn’t tell him when you asked bil to stay would be suspicious to me. It sounds like you are trying to hide something. \n\nThree days isn’t a long time to be alone. I think it would be helpful for you to consider how to feel safe in your home without your bil. Also, maybe this isn’t the right home for you and you need to discuss that with your husband.", "Obviously YTA. Not only did you not inform your husband of WHO would be spending multiple nights sleeping over in your SHARED home, but you invited someone who you know has a strained relationship with your husband.\n\nAnd your comments of, \"he didn't ask so..🤷‍♀️\" is immature. Of course he didn't ask, you told him your friend would be there so that's what he assumed.\n\nYou seriously broke trust with this one. At the end of the day, your irrational fears of safety have nothing to do with your lack of communication. Good luck on the survival of your marriage.", "YTA. You’re being pretty disingenuous to act like you don’t know why your husband would be upset to come home and discover you’ve had a man staying over for several days and hid it from him. You intentionally didn’t mention that your BIL was there and that is extremely suspicious. From your husband’s point of view, you absolutely are acting like someone who’s having an affair. And the fact that you know he feels like his brother has been chosen over him and favored throughout his life and you’re planning to essentially do the same thing? That’s just the cherry on top of the shitty behavior sundae you’re making. \n\nAlso, as a woman who lives alone, my barking dogs and visible alarm system are a way better deterrent if someone comes up to my house than a dude being in the house with me would be. \n\nIf your marriage is important to you, you’d better apologize and come up with a better plan to handle this anxiety because this situation is not something the vast majority of people would be comfortable with and your husband has every right to be suspicious.", "YTA.  You didn't tell your husband that your BIL was staying over?  You know their relationship is not the best?  If you didn't think he would mind, then there should have been no reason to not tell him.  And now you're telling him every time he goes on a trip, this is going to repeat?  Wow...um...well, I hope you know a good divorce lawyer.", "Yta. I see a divorce coming. Noticed that you don't deny the comments on here implying that you want or already have a inappropriate relationship with your bil. I feel bad for your husband, and hopes he finds someone that treats him better.", "INFO - Are you sleeping with your BIL?", "YTA", "YTA. I get being scared to be alone but your husband thought that it would be your friend staying there. And no he doesn't have to ask to speak to your friend. He *trusted* you.  If I were him I would have a hard time trusting you again. You owe him a big apology. \n\nYou sound like you have problems with your husband's job and not just the staying alone. If you are going to keep involving someone who your husband has not the best relationship with (almost sounds like retaltion for traveling) then discuss *calmly* after apologizing and explain that you don't like him traveling so much and try to work things out like adults.", "YTA - the moment you didn’t tell him, you created A Situation for everyone involved regardless of whether you were craving drama or did it unintentionally.", "Not ok. Not ok at all.  This is so on the border of leading to an affair.  Omg, just stop it already.", "So you are going to keep asking him? Why don't you just get a divorce now? It will save some time.", "Your husband thinks you're fucking your BIL behind his back.\n\nYTA", "Excuses excuses, YTA. Have some respect for your spouse.", "Maybe should have had Jennifer **and** Ash stay with you.  The only male I would have been OK with staying with my wife would be her brother or her dad.  ~~I say this because I trusted my wife 110%  I let her go fishing with her boss and the other girls in the office.  Then I found out the other girls were not going on every trip.  I told her she could not go with just him because other people would get the wrong idea and talk.  I later found out I was the one who should have gotten the wrong idea.~~   ~~I would have been right.  She was cheating on me for several years while I trusted her 110%.  After 25 years of marriage it knocked me over.  It has been 18 years and I am still trying to stop loving her.~~", "NTA for calling the BIL, YTA for not telling your husband, he had to know.", "What is wrong with the two brothers relationship?", "It's not a bad thing that you asked BIL to come stay, but you should have been more transparent about it. I don't think that alone makes you an ah though. Nta", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband (m27) and I (f25) got married a year ago, were living together. My family doesn't live here, they live about two hours away. \n\nHe recently got a promotion at his job. Our house is a little bit further away from the city, we live in a farm type house (although it's not a very big portion of land, but we have neighbors that have bigger properties, point is our neighbors live kinda away). With his new position he'll need to travel sometimes, his first trip was last year, he had to travel for two days. I honestly did not had a good time, because I was alone and away from neighbors, I did not felt safe. \n\nI spoke to him and we agreed that next time I'll ask a friend to come stay with me. Well he needed to travel last week too, this time it was three days. I told him I was gonna ask a friend (Jennifer), he left early in the morning. \nI thought about it and then I started overthinking, I don't think I'll feel safe if it's just Jennifer and I, we're still two women alone. So I called my BIl Ashton (m24) if he could come stay with me instead, he agreed so I called Jennifer to tell her my plans had changed. \n\nHe came home around 6 that day, we had dinner together, chat and watched a movie together. We mainly did those stuff during the time he stayed here. My husband and I spoke on thw phone but I didn't told him I had called his brother instead of Jennifer. Ash and I are close, I am with all of his family, so I didn't think he would mind. \n\nMy husband came home last Thursday around 8PM. When he saw that Ashton was here he was a bit taken aback. As it was late I told BIL to stay one more night if he wanted to and he did. I could tell my husband was upset, I asked him what happened and he told me nothing. The next day, after he got home from work, he was still upset so I asked him again what's going on. He said that we had agreed that I was gonna call a friend, he didn't agree with having BIL over. I gave him my reasons as to why I called him instead. He still said that I shouldn't have called him because I know that their relationship is not the best. We argued and now he's even more upset with me for not even apologizing, he asked if I am gonna call Ash everytime he goes out and I told him yes, I'll do that because I don't want to stay alone. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "there was a similar post, wife went to wine tasting and later instead of going camping,  went to a group of people in a house- people the husband knew nothing about. \n\nEven then yall redditors supported the wife. That the husband was wrong for asking the wife's whereabouts. And now you people are blaming the wife being in a house with someone the husband knows! Good logic lol. \n\nI don't know why people come here to ask for advice or justify themselves.  Most of the answers are inconsistent.", "I mean…I’m not sure you are an AH, but it’s weird you didn’t tell your husband.", "INFO: Why do you feel so unsafe in your own home? Unless you live in some kind of warzone this feels a bit dramatic. Have you ever lived on your own before or did you go straight from your parent's home into a home with your husband?", "I don't say ah just for having hjm but you really should have run it by your husband.\n\nIf what he says is true and he doesn't have a good relationship with him and you were aware of that. The fact that you say you will continue to do it despite it bothering him  makes YTA to me.\n\nYou are getting between brothers that already have a strained relationship and the optics are bad, you are doing it in response to your husband leaving for a reasonable amount of time, and it appears spiteful.\n\nHe should help you figure out a way to be and feel secure but it shouldn't be at the unnecessary expense of personal boundaries", "I would invite both Jennifer and BIL. Alone with BIL who your husband has a no great relationship will strain your marriage.", "YTA.  I don’t get along with or trust my oldest brother.   If my wife did that i would seriously reconsider the relationship.     Do it again and you might end up single", "You didn’t tell your husband that you had BIL staying over for a reason and it’s not bc you didn’t think he’d mind. In fact, you didn’t tell him bc you knew he’d be upset about it and didn’t want to deal with it. YTA", "YTA, you two probably made your own movie", "You’re an idiot. You won’t be married too much longer.", "She feels safer with a man staying over?", "I agree that OP is AH here, and it's weird that she wanted BIL there, but you don't know the creepy alone feeling of a farm house until you live in one, and you're usually a little ways a way from help getting there so a lot can happen in that time.", "The area is not that unsafe, but it's still further away enough to not make me feel safe alone. I think it's better if there's a man here too, if it was only two women than someone could think it's easier to hurt us", "He didn't ask me at all about who was with me, he didn't even asked for Jennifer who was supposed to come stay with me so I thought he didn't care", "BIl is single, no we have never dated. My husband didn't asked at all about who I was staying with, we spoke very little, I thought he didn't care. \n\nWe talked and watched tv together, he was sleeping in the guest room.", "My husband says his brother is the golden child, that's the issue between them.\nHe feels angry because it's my BIL, not sure if he would've reacted the same if it was another man.", "OP’s behaviour is manipulative as hell. Husband needs to get out of that marriage while he still can.", "Agreed with this comment.\n\nThe post is akin to the prelude to a modernised version of Lady Chatterley's lover.\n\nFurther more OP is going to have BIL (family golden boy) over every time  husband departs on trip.  Now that's pretty suss.\n\nYTA", "They talk to each other from time to time, but my husband says his brother was always the golden child and has some resentment over that", "Why does that matter, you should have enough respect for your partner to honor their wishes about who, they would and wouldn’t like in their home.\n\nThe reasons don’t matter, OP should have some respect for her husband.", "He comes over sometimes, but it's not a regular basis thing.\n\nMy husband says his brother was always the golden child so he has some resentment over that", "Damn... sorry for what you ~~went~~ are going through.", "I am scared that my ex boyfriend will try to hurt me again, I lived alone before, I lived with this ex too and after we broke off (and I was living alone again) he broke into my house and hurt me, my brother moved in with me and he stopped bothering me. Then I met my husband. Our house is away from the city so I don't feel safe.", "Yes, exactly", "Thanks for the perspective. I guess I haven’t experienced that myself", "Creepy alone feeling? I call it peaceful bliss.", "You need to get help, and by that, I mean therapy. Stop playing the damsel in distress. Get a top notch security system installed with security cameras, alarms, and an automatic distress call if the alarm goes off. Stop asking men to stay with you while your husband is away.", "Unless you live in a super high crime area, I don’t think you can go through life like that - being scared to ever be without a man for protection", "You’re 25, you should be able to cope with staying alone for a few nights.  I’m actually embarrassed for you", "You're an adult who can't be alone for a couple of nights? You aren't mature enough time to go back to living with mommy and daddy. That's just pathetic. Or an excuse to fuck your BIL.", "That's called lying by omission.", "You already had told him Jennifer would come so he trusted you she was there. Why would he ask who was with you? Why would he ask for Jennifer if he is calling you, his wife? Why are you thinking for him he doesn't care? It sounds like you resent him for going away and not communicating with your SO enough.", "That’s bullshit. You keep playing this naive damsel in distress act, but I’m 100% certain it’s lies and manipulation. YTA.", "He shouldn't have to ask, especially considering the state of his relationship with his brother.", "Bullshit. He didn't ask because it was clearly established Jennifer was coming over. He trusted you and you betrayed that trust. There is no justification for your actions.\n\nIf I went out of town and it was talked about and agreed that my wife would have Jennifer over, and I came back to find 1)no Jennifer 2)another man 3)a man my wife KNEW I don't get along with, I would be seriously questioning my marriage.", "YTA. It sounds like you deliberately didn’t tell him because you knew what his reaction would be, or you’re being passive aggressive about the new traveling situation. It’s ok to want to feel safe and comfortable, but your husband needs to have the opportunity to feel those things as well.", "BULLSH** you AH, Even if you're not cheating sexually(which I'd put money on you are) you can still be cheating and you're dancing on that line while saying, \"Ohhh huh, I'm doing something wrong?\" Grow up you brat", "I don't think you believe your own words.", "You're the asshole. Big time. Just accept that you lied and that you hid this from your husband. You could have said you changed your mind about who was coming over... I mean you did call Jennifer right? So to me you knew it was an issue and chose to do it anyways. YTA.", "Because you already told him you would be having a girlfriend over so why would he ask about a situation you already told him about. You’re just trying to find excuses", "You told him Jennifer was there, why would he ask for her?  He didn't ask because he had no reason to think Jennifer was not there...until now.  Congratulations for destroying the trust that your husband has for you.", "I added a few questions in my last comment, also\n\nWhen you talked and watched TV, did you sit on the couch or on the floor together?  If so, did you sit next to each other, like leaning on, arm around, head on lap, that sort of thing?\n\nDid it occur to you that it might be important for you to tell your husband, not needing for him to have to ask first?", "Yeah I'm guessing you also slept in the \"guest room\"", "He thought you had Jennifer over. Instead he comes home to find his single BIL, alone with you. Why should your husband trust that you weren't having sex the whole time when you've just proven you can't be trusted in general?", "Maybe not as bad, but fundamentally yes. It was mutually agreed that you would have Jennifer over. You were the AH the second you called anyone but her and did not inform your husband about the change. It being BIL only made it worse. You know how your husband feels, so what do you do? You invite him over behind your husbands back. BIL got all of their families attention, now he is getting yours. The worst part of it all is that you refuse to see what you are doing to your husband.", "So not only does your husband feel like his family value his brother more than him, he now finds out that you his own wife value his brother over him…", "and now your husband feels like you're putting his brother over his feelings.", "Yta. You've made your husband's brother the golden child in your marriage. This is some serious overstepping.", "Which you are adding to.   Do you want to stay married?", "That was why I was asking. \n\n\"Not the best.\" With siblings could mean anything from just not great friends to LC/NC\n\nIt's her home as well. \n\nSo, to me, if they are low or no contact, then OP is an AH completely. \n\nIf it's a normal sibling relationship but they are not \"best friends\" just family. Than to me is more everyone sucks. \nAnd they need to work on how they communicate with each other.", "Oh boy, \n\nAre you trying to blow up your marriage? Do you have any idea how damaging the \"Golden Child/Scape Goat dynamic is to kids? The pain it can cause, the actions that get excused/blamed?\n\nWhat do you hope to accomplish? Punishing your husband for having to travel for work?\n\nOr do you just thrive on drama? \n\nDo you care about your husband's feelings at all? \n\nDid your BIL ever chase a previous love interest of your husband's? \n\nAs a woman, I'm also extremely confused as to why the BIL made you feel safer. Does his penis shoot bullets? \nRealistically, how does he make you any safer than having a girl friend around?", "So... your husband doesn't want him over, right?", "Thanks,  \n\nI got an amazing son out of the deal and I would go through it all again just to have him.  So as they say, \"At least I got that going for me\".", "OK this makes a bit more sense now.\n\nI suspect you need to talk to someone about your justifiable anxiety, and then I suggest that you investigate getting yourself a dog. It is possible to get a trained personal protection dog, or a regular dog which you could train for this purpose. Facing down a well trained dog is not for the faint hearted.\n\nI'm sorry that your ex was so bad and I hope you can regain the confidence to live your life.", "You need to get a security system with cameras so the next time your husband travels you don’t inconvenience someone to come and hold your hand while your husband isn’t there. \n\nYTA", "I agree OP is overreacting, but you're being very dismissive of her anxiety. It really sounds like you're accusing her of pretending to be scared for attention. \n\nMy SO will be out of town for a weekend soon, and even with 3 dogs and nearby neighbors, I still get anxious being alone at night. You wouldn't tell someone with depression to just be happy right? So don't tell someone with anxiety to just not be scared.", "I am in therapy already", "She IS putting his brother over his feelings.", "His penis does not shoot bullets, at least I am not aware of that. I feel safer when a man is home too because I know that if my ex wants to hurt me again he won't try anything if another man is home, he'll leave. And I feel close to BIL because he's nice, so I feel ok having him around for a couple days.", "We have cameras and a alarm, but if someone breaks in I'll take some time for the police to arrive", "But do you use it as an excuse to invite a man over?", "That’s good. What does your therapist say about this irrational fear of yours? Do you recognize that you can’t keep asking people to stay with you when your husband travels? \n\nCan you go visit someone? Hotel?", "Yeah, that's a BS excuse, my dear. And it's interesting you don't answer any questions about BIL history. \n\nFrom your Op\n\n>I honestly did not had a good time, because I was alone and away from neighbors, I did not felt safe. \n\n>I thought about it and then I started overthinking, I don't think I'll feel safe if it's just Jennifer and I, we're still two women alone. So I called my BIl Ashton (m24) if he could come stay with me instead, he agreed so I called Jennifer to tell her my plans had changed. \n\nYou mentioned isolation and loneliness. Not an abusive stalker ex that now magically appears to try and justify your need for a man. \n\nEspecially since you canceled your friend coming. The three of you could have gotten together for a week with much less issue. Or your BIL could have joined for a few days. \n\nIf being married isn't stopping your ex, then another man around won't either. And if you were truly worried about that, then having your friend come too would be a better deterant. Or were you hoping that your BIL got hurt? \n\nAnd why wouldn't you communicate your fears to your husband? Surely he knows how dangerous your ex is? \n\nYou never mentioned your BIL being there the entire time he was gone, got caught and are now trying to justify your actions. \n\nAgain, do you care about your husband or marriage? Or are you punishing him?", "And you don't give a single care about how your closeness is affecting your husband? Keep ruining your marriage.", "Oh I’m sure you know all too well what his penis shoots 🤣 have fun breaking up your marriage by sleeping with your husbands brother 🤮", "Also, good job ignoring every single question she asked except for the one about BILs penis.", "Then go stay at a hotel while he’s gone! Gees! \n\nWhat exactly do you think a “big strong male” is going to do to magically protect you? Do you think they’re going to wrestle to the death or something? \n\nLearn to protect yourself. Are you in the US? If so, do you have a firearm and are proficient with it? \n\nYour damsel in distress act is gross, IMO. Either move closer to authorities being able to respond quicker and/or learn to protect yourself. Please stop asking men to stay with you alone overnight and possibly put their lives in danger for you.", "You need to practise self defense. Your attitude is getting you in trouble. I'm not pro gun, but I love grams who say their family women's motto is \"lock and load\". You might also consider therapy for your anxiety.\n\nInviting your BIL wile your husband is away is putting your marriage in jeopardy. Or as we say in Dutch \"tie the bacon on the cat\". YTA for that.", "My therapist told me if I don't feel safe in a place or with someone I need to ask help from someone I trust, usually my husband is there so I am not that scared, but when he is gone I am scared that my ex or someone else might hurt me again so I asked for help\n\nWe have two dogs, we can't leave them alone", "An abusive man who specifically targets women and children will often avoid attacking if another man is present, because they are cowards. They’re scared of getting hurt so they are unwilling to attack. If they see something like a truck, big boots, or hear a deep voice, they will piss themselves running away.\n\nThis makes a male presence actually more effective than most security systems, depending on the aggressor in question. Even if the male does no defending or just calls the police, the danger is decreased.\n\nShe’s stated she has an abusive ex who has hurt her before, your vitriol is unnecessary", "I am scared that my ex will try to hurt me when I am alone since he did already and I know that if another man is home then he will not try to do anything, but if I am alone or if I am with a girl friend then he might try it. The police will take too much time to come if the alarm goes off", "I am already in therapy, a gun wouldn't help because I'll freeze if anything happens, I can't physically defend myself", "Do you have pet friendly hotel in an area where there is quick response time for authorities? \n\nWhat does your therapist define as “help” from someone you trust? IMO, asking anyone to drop what they’re doing to come and stay with you for a few days goes beyond “help” and morphs into dependence. \n\nDid you and your husband have an in-depth discussion regarding your very real fears when he would be required to travel?\n\nI’m sure I’m coming across as harsh, but how you’re managing your fears (regarding when your husband travels) is unsustainable. Your fears are real and justified. However, others can’t be asked to “bend” to your fears. You and your husband need to figure out a solution, and that can’t (ultimately) be expecting friends and family to come and protect you.", "Please edit your post and include this very important detail. \n\nHowever, I don’t think it’s fair to ask anyone (man or woman) to act as your personal bodyguard. You’re assuming that your ex will know that a male is staying with you so won’t try anything. \n\nDo you have a restraining order against your ex? \n\nIf your husband is going to be traveling more often, you and he must figure out a solution so you are calmer and more secure. Asking others to come over and stay with you is not a solution, ultimately. \n\nWhat about a highly trained guard dog? Have you talked to your local authorities about your very real fear? Have you asked them to tell you about their response time and how to balance that with your fear?\n\nYou shouldn’t have asked your BIL to stay with you without speaking to your husband and getting his approval for his brother to stay alone with you. \n\nI truly hope you and your husband can figure out a long term solution so it doesn’t impact your marriage.", "What are you going to do if BIL isn’t available? Better yet, what are you going to do when your husband leaves you?", "Then learn some self defense. (Preferably Crav Maga because there you learn to really protect yourself.)", "I have a restraining order but he did not care about it in the past. I think that he might know where I live and possibly he knows I am staying alone sometimes, so I think it's better to ask for help as my therapist told me to do. .\nWe have two dogs. If the alarm goes off the police will come as soon as they can, but it's at least a 30 minutes drive to our home.", "So your solution is to ask someone else to be alone in the house with you in case your ex attacks? What on earth do you expect your BIL to do? \n\nAgain, your therapist needs to define what is meant by “help.” Putting someone’s life in possible jeopardy to try and protect you is not “help” IMO. It’s irresponsibility. \n\nWhy did you move someplace where the authorities can take up to 30 minutes to respond? Why did your husband take the promotion knowing it would require travel and also knowing your fears and anxiety regarding your ex?"]}