{"id": 16560, "submission_id": "13a1ejh", "title": "AITA for demanding full custody of my child?", "selftext": "I (35M) have a 6-year-old son Ben, with my ex-wife, Emma (33F). We were married for 8 years, but our relationship took a turn for the worse, and we separated two years ago. I've always tried to maintain a civil relationship with Emma, but she has made it increasingly difficult. Now I'm considering fighting for full custody of Ben, and I need some perspective on whether or not I am the asshole here.\n\nEmma has always been unpredictable and, at times, downright crazy. During our marriage, she had wild mood swings and would often become verbally abusive. One particularly outrageous incident occurred when she accused me of cheating (which I never did) and proceeded to throw all of my clothes out of the window into the front yard. She then called my boss and coworkers, accusing me of various lies and trying to jeopardize my job. Thankfully, my boss and coworkers were understanding, and my job remained secure.\n\nDespite all this, I never wanted to keep Ben from his mother. We agreed on joint custody, and Ben would spend one week with me and the next with Emma. However, Emma has been increasingly manipulative, using Ben as a pawn to get back at me for imagined slights. She has consistently made false accusations against me to our friends, family, and even Ben's school, claiming that I'm an unfit father and that Ben is in danger with me.\n\nThe breaking point came last month when Emma called CPS and accused me of abusing Ben. This was a complete lie, and I have never laid a finger on my son. CPS conducted a thorough investigation, interviewing both me and Ben. They found no evidence of abuse and closed the case. This false accusation deeply affected me, and I worry about the emotional toll it might take on Ben in the long run.\n\nI'm now considering fighting for full custody of Ben, as I believe his mother's manipulative and unstable behavior is causing him harm. I have documented evidence of Emma's erratic behavior, including text messages and emails, and I believe that I can provide a more stable and loving environment for Ben. However, I worry that I might be the asshole for trying to remove his mother from his life, even if it's only temporarily until she gets the help she needs.\n\nSo, AITA for demanding full custody of my child after my manipulative and unstable ex-wife involved CPS and falsely accused me of abuse?", "created_utc": 1683405511, "permalink": "/r/AmItheAsshole/comments/13a1ejh/aita_for_demanding_full_custody_of_my_child/", "score": 143, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because seeking full custody could be seen as an attempt to alienate Ben from his mother, despite her erratic behavior. It's possible that I could be perceived as overreacting to the situation and not considering the potential emotional impact on Ben of losing regular contact with his mother.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Consult with a lawyer ASAP re: potential outcomes and cost.", " NTA\n\nThe false CPS report makes her dangerous to your son and you.", "NTA. You can get full custody and still have visitation rights for your ex. Don’t take the mother away completely but still have control.", "NTA, but get legal advice (which this isn't).", "NTA.  Please fight for full custody.", "NTA, but you really need to get a good family lawyer who specializes in this kind of thing. Has your ex-wife ever visited a professional or been diagnosed with any kind of disorder? It sure sounds like she needs to if she hasn’t. Maybe bare minimum the court can mandate that she get help as a condition of visitation. A lawyer should be able to advise.", "NTA.  But you definitely WILL be if Don't get that kid away from that, what sounds like, a deranged nightmare. Get a lawyer and get full custody. Possibly even a restraining order and/or a cease and desist order, her harassing you like she is, is a definite problem that needs dealing with.", "Yeah, how about talking to a lawyer instead of posting online about it?  This is way above Reddit's paygrade.", "NTA. she’s completely unhinged", "Totally NTA. \n\nHowever, depending upon the state and county in which you and your ex reside, or where the divorce was processed, can really impact your ability to get full custody. Many County domestic court systems are designed to drive the parties to spend on attorneys and force them to negotiate. All it takes is one of the parties to be the party of \"no\", and it will cost you $10k to $15k per court process to get a few additional hours/days because of her shenanigans.\n\nI took my ex-wife back to court three times over the course of 8 years to the tune of $45k, eventually getting 70% custody. She had similar manipulative behaviors. The kids are now all adults and do not talk to their bio-mother. However I never got full custody no matter how crazy she got.\n\nEdit:\nAnd each court action can take 1-2 years to complete.", "NTA but you would be one if you didn’t do it. Your son might be in danger with her.", "I mean, situations like this don't come down to anyone being an AH if they are doing what they truly feel is in the best interest of the child. Clearly you both have different ideas of what that is, and that's where the court comes into play. \n\nI highly doubt you will be able to fully remove your son's mother from his life, but their relationship and how bonded they are may be a consideration. \n\nNTA for fighting for your child's best interests", "Hell, I would sue her for defamation. (Maybe not really, it’s a lot of work, but you *could*). What if your boss or CPS had *believed* her lies, you could have lost your job, lost custody, maybe even been arrested?\n\nGet a lawyer and throw the book at her. Get custody. Maybe she can have *supervised* visitation. Every minute she has the child she is poisoning him and warping him. Enough is enough. NTA", "NTA.", "NTA. He needs his homes and parents to be stable and she can’t provide that right now. She’s lucky to not be facing criminal charges. Hopefully the family court can impose some requirements and actual pathways for her to get help.", "INFO: Have you consulted with a reputable attorney about how likely you are to win?  Because if you do this and you lose, you will only make the antagonism in this situation worse.  And the real loser in the end is Ben.", "Nta 💜", "NTA. If she was verbally abusive and manipulative to you, I would assume she is the same with her son. You wouldn't want your son to grow up with an abusive parent, and he won't want that either.", "NTA she sounds dangerous", "Your son needs stability and feeling safe. Her behavior isn't singular, which means that she is probably done it towards your son or eventually it will happen. \n\nTaking full custody doesn't eliminate interacting with the other parent. \n\nNTA", "NTA\n\nShe’s going to turn your son against you", "NTA, your sons well-being has to come first.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (35M) have a 6-year-old son Ben, with my ex-wife, Emma (33F). We were married for 8 years, but our relationship took a turn for the worse, and we separated two years ago. I've always tried to maintain a civil relationship with Emma, but she has made it increasingly difficult. Now I'm considering fighting for full custody of Ben, and I need some perspective on whether or not I am the asshole here.\n\nEmma has always been unpredictable and, at times, downright crazy. During our marriage, she had wild mood swings and would often become verbally abusive. One particularly outrageous incident occurred when she accused me of cheating (which I never did) and proceeded to throw all of my clothes out of the window into the front yard. She then called my boss and coworkers, accusing me of various lies and trying to jeopardize my job. Thankfully, my boss and coworkers were understanding, and my job remained secure.\n\nDespite all this, I never wanted to keep Ben from his mother. We agreed on joint custody, and Ben would spend one week with me and the next with Emma. However, Emma has been increasingly manipulative, using Ben as a pawn to get back at me for imagined slights. She has consistently made false accusations against me to our friends, family, and even Ben's school, claiming that I'm an unfit father and that Ben is in danger with me.\n\nThe breaking point came last month when Emma called CPS and accused me of abusing Ben. This was a complete lie, and I have never laid a finger on my son. CPS conducted a thorough investigation, interviewing both me and Ben. They found no evidence of abuse and closed the case. This false accusation deeply affected me, and I worry about the emotional toll it might take on Ben in the long run.\n\nI'm now considering fighting for full custody of Ben, as I believe his mother's manipulative and unstable behavior is causing him harm. I have documented evidence of Emma's erratic behavior, including text messages and emails, and I believe that I can provide a more stable and loving environment for Ben. However, I worry that I might be the asshole for trying to remove his mother from his life, even if it's only temporarily until she gets the help she needs.\n\nSo, AITA for demanding full custody of my child after my manipulative and unstable ex-wife involved CPS and falsely accused me of abuse?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Because even though you know she is abusive and mentally unstable you still let her have unsupervised time with him, and now even though it got worse, you still don’t want to protect your son from his mother. That is not what a good father does. Protect.your.child", "Lmao!", "nta but dude get a lawyer and ask them not an online forum", "NTA. Sucks OP. If you go ahead with this make sure you go for the throat. She's lied once already, and if you give her an inch she might do something even crazier.", "NTA. She's going to do everything she can to poison your child against you now. And it doesn't look like she'll pay any attention to the damage she does him in the process. Also her behavior will need a new target soon and you don't want him to be there for it.", "NTA. But you should be talking to a lawyer, not Reddit.", "Get an aces study done\nNta", "NTA. She really is scarring him for life. Take him away. \nMaybe she is bipolar or something, ask for a psycological evaluation on her side.", "NTA as it’s for your son’s safety not being malicious. You should really speak to a lawyer", "Do you get solo time with kid\nFile for full  then  get a ro and have a supervised custody for her and a psych exam\nAnd file for emergency custody", "NTA. You will never the AH for seeking revenge from a woman who falsely accused you of child abuse, never bend the knee towards society that thinks/says that you should move on from this.", "NTA please get with an attorney asap. You need to protect your son.  Being in touch with an abusive parent is worse than not seeing them at all.", "Nta", "NTA\n\nYesterday is already late, get a lawyer and go ahead", "NTA. Consult a lawyer and make sure you document everything. \n\nAnd change your mindset—you're not removing his mother from his life, you're protecting him from hjer harmful behaviour. \n\nBy the sounds of it she might need some professional help, which she might be prompted to get at the idea of losing her son. \n\nThat said, it probably won't be an easy fight and she will likely get really nasty. ?So make sure you're protected and again document everything.", "NTA", "NTA. She went over a line accusing you of abuse.  Protect your son, she has gone off the deep end.", "NTA, get that child out of there as soon as possible.  The anger and hate she has for you will soon be turned on your son.", "NTA That's what would be best for Ben.", "NTA. Protecting your child will never make you TA, but you will need a whole lot more than texts and emails, such as a psych evaluation", "NTA But your ex wife is not mentally well and she should seek treatment for herself and your child", "NTA. I wish CPS would've investigated her too. This is the safety of YOUR CHILD, and even a biological parent can be harmful to a child's well-being.", "I had someone do this to me and it turned out they were abusing the child and reporting me the innocent ex so they couldnt get pursued by cps for the same allegation due to the no retaliation against reporters law to protect people who report claims .... its a big red flag and you should get a court order that the child should go through mandatory counseling and have a guardian ad litem appointed so if she doesnt take him to appointments with therapy when the kids with her itll get reported to the guardian ad litem...", "NTA.  She called cps on you.  She was trying to lie and get you out of his life.  One day her lies may succeed.   Do it before that happens.", "I think you are morally obligated to seek full custody for the best outcome for your child. Her feelings are really secondary if you believe her behaviors jeopardize his well being.", "NTA I would get signed statements from your boss about what she did as well.", "Yes - get evidence and get legal advice. And never forget that as Ben gets older, her verbal and emotional abuse are going to turn on him. You cannot leave him at the mercy of that woman.", "Anyone who weaponizes CPS is not worth considering. It’s already such an overburdened system and false accusations take time and resources away from children who actually need intervention.\n\nRe: your ex, she is clearly escalating. Only communicate with her through coparenting apps and get security cameras, because seriously, who knows what she’ll cook up next. As others have said, get a lawyer, but also get your son into therapy. Having a parent with a mental illness can be deeply traumatizing. Having divorced parents who don’t coparent amicably can also be traumatizing. If she’s talking trash about you to your son, there’s your third hit, it’s detrimental to the kid’s self esteem. Further, mental health conditions can be hereditary, so he’s at risk for developing PTSD or other issues. You may also benefit from talking to someone, as this cannot be easy. \n\nBig NTA. Take care, OP.\n\nEdit: vulnerability to mental health conditions *is* hereditary", "Op you can request CPS notes and reports. Do it… you’ll be surprised what social workers notes in the contact notes", "This. She may be undiagnosed and could really benefit from treatment sooner than later. Some SMI (serious mental illness) gets worse with age. As the adult child of a (recently, finally diagnosed) bipolar parent, we are sadly learning this a bit late in life. Having had help earlier could have spared us a lot of pain.", "Well, according to OP. You are only hearing his side of the story. People tend to tell a story that puts them in a good light. \n\nTherapists and Judges are the ones to decide who is at fault and who should have custody. He is not wrong to try though.", "He legally cannot keep her child away from her. He'd be arrested if he did. He needs to follow proper procedure as hard as that may be, if he wants to succeed and protect his child in the long run.", "This is where my brain is. Why wait until now, if this behavior existed all along. I mean, totally do it now, it's never too late, but why didn't he seek primary or full custody when they split?", "I know that. I am saying he should have gone through this procedure earlier", "Considering i got downvoted most people here would probably do the same thing and then be surprised", "Because in a court, unless you have concrete proof of abuse towards the child along with police reports, the court is not going to give dad more than 50/50 custody.  It's a long drawn out hard expensive uphill battle to prove abuse like this, and there's been a lot of time dad's will be trying to get custody bc of this type of abuse and the judge will think dad is just being unreasonable and it will backfire.   This is not an easy thing to do.  That's part of the reason I assume to why your commentary was downvoted."]}