{"id": 16614, "submission_id": "13at3be", "title": "AITA for blocking my in laws?", "selftext": "My husband and I have 3 kids and one on the way. I ran in to severe complications and I'm on full bed rest/need surgical procedures done to save myself/baby. I've had 3 treatments and they were so expensive (partially covered by insurance) that we needed to reach out for help. I only have one treatment left before baby is here (scheduled C-section at 36 weeks) and we don't even have a portion of the cost to cover it (1200). Again, we reached out to his and my family for help and wouldn't have done so if we had any other option. Not a single person helped. I've had my help page up for 3 weeks and had 3 donations- from my friends. \n\nMy SILs dog however was just taken to the emergency vet with hind leg issues. The dog needs a procedure done (for $2900) to get her leg fixed and then will need PT afterwards, and she has stated in her help page that she will need help covering PT cost as well but has no estimate on cost as of currently. Within 8 hours they raised $2150 and when you go through the donations, it's ALL family (husband's). From the same people who said to us \"Sorry hunny, we wish we could help\". So basically, a dogs hind leg is more important to these people than a surgery needed to save a baby. And I guess it was even more of a hit because of the fact that my husband and I are ALWAYS the people that they run to for help whenever they need anything (moving, rides, groceries, event planning, etc). \n\nI didn't even speak to my husband about it first because I was so hurt but I went on and blocked all of them on social media, on my phone and from my eldest daughters phone. This was last week. I have since told my husband that they were all dead to me. He just held me and said he understands. Well, my MIL just got a hold of my husband and asked why she couldn't contact me and said she wanted to ask me how I was. He told her why and stated that I wanted nothing to do with them and that he was on my side. She flipped and told everyone and people have been blowing up my husband saying that they can't believe I am \"selfish enough to make comparisons\" and that they dogs surgery was an emergency and where I'm so close to the due date, they feel my surgery is unnecessary and I shouldn't expect people to help when it's not a definite that something will go wrong, like it was with the dog. AITA?\n\nETA: details on surgery and procedures: at 23 weeks they found tearing near the placenta and I have had to have several shots in my stomach to prevent me from going in to early labor (I've started going in to early labor 4 times since). The tear in the placenta has been causing multiple traveling blood clots and the procedures I've had to get done are to remove the blood clots so they don't travel to my heart. I've been put on several meds to try and prevent clotting but it's not that effective because I'm drug resistant due to other medical issues that I've had since birth. The dogs surgery is correct a mobility issue, as she is losing mobility in her back leg. They called it something specific, though I can't remember the name. I want to say \"drop foot\" but I could be wrong. It's not life threatening. It's a \"quality of life\" procedure.", "created_utc": 1683472654, "permalink": "/r/AmItheAsshole/comments/13at3be/aita_for_blocking_my_in_laws/", "score": 21, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like an AH because me expecting anything isn't something I should do anyways and originally it hurt but didn't piss me off that no one had helped. What bothered me was that they so willingly offered up that much money for a dog but couldn't be bothered when it came to their flesh and blood.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA at all. Just. Wow. I'm at a loss for words, foe once.", "NTA, they seems to be toxic, you have all the right to block them", "Nta but also for the part not covered by insurance.. go have your husband start fighting that. Many times hospitals will give discounts for \"cash\" ...or for non- covered items if you go negotiate.\n\nGood luck on your delivery.  Cross post in r/justnomil as well for different support!", "NTA. I'm so sorry. The one silver lining is hubby is wired right in the head. He has your back and as a team you'll be alright.  His mom is next level. Let her stew in this. I'm sure at some point she will reapproach you and perhaps see your side. Your feelings are valid. \n\nI've seen situations where the spouse sides with the parent and that is always a damn disaster", "NTA - for blocking people you want nothing to do with and for calling out your family-in-law.\n\nYTA - for covering people’s groceries, event planning, and moving, getting broke by doing so and expecting to be bailed out later on when you have your own emergencies. Save every penny for your nuclear family.", "Sounds like they helped you a lot before with money. While yes your issue is more serious, they probably want to be fair more or less. Not give all their money to one child and leave the other with nothing. \n\nAnd what did she mean about its not a definitive you will need it? Are they saying they’ll help if you actually get the bill but not in advance? Which i think would be reasonable if that is the case.\n\nAll in all i think there are too many infos missing here.\n\nQuestion, was this baby planned? Did you have serious complications beforehand? Would you have problems with money if everything went smoothly?", "100% NTA and you have every right to feel how you do and to have nothing to do with them!", "ESH Just fyi that you can get your tubes removed and not just tied along with your C-section if you don’t want or can’t afford to have more kids. The recovery is just the same instead of having to ingest hormonal birth control.", ">\"selfish enough to make comparisons\" and that they dogs surgery was an emergency and where I'm so close to the due date, they feel my surgery is unnecessary\n\nSo for starters you MIL for some reason thinks that a dog's 'emergency' surgery was necessary but yours is not even thought it risks her DIL and future grandchild life in risk not to mention potentially can lead to her son being a widower and 3 grandchildren motherless. She is definitely not a smart cookie.\n\nAt this point they will be very lucky to even be able to see their grandchildren anymore.\n\nNTA\n\nYeah and also stop helping people who don't deserve. Priorities are your family.", "NTA at all!\n\nI'm of the opinion that dogs are family, but that really has nothing to do with this. \n\nThey had the money *before* the incident with the dog. They literally had more than twice what you were asking that they could spend on desperate family members in serious medical conditions and told you to fuck yourself.\n\nKeep them blocked and I wish you all the best with your pregnancy.", "NTA... its their money and they can decide how to spend their money.  Then fast forward 18 years and the family is lamenting why they have no relationship with their grandkid/cousin/niece/nephew, years after the dog died of natural causes.  Choices have consequences.", "NTA- one of the most appalling things I've read here. \nDon't let them flip the situation. They're horrible people. \nGood luck with everything!", "NTA. That would make anyone feel a certain kind of way. For those you help to not help you out, only to find our later they were more than capable of doing so and simply made the choice not to. \n\n\n>they can't believe I am \"selfish enough to make comparisons\" and that they dogs surgery was an emergency and where I'm so close to the due date, they feel my surgery is unnecessary\n\n>I ran in to severe complications and I'm on full bed rest/need surgical procedures done to save myself/baby.\n\nThat sounds pretty comparison worthy to me. Also, where did they get a degree, and the right to tell you better than your doctors what surgery is or isn't unnecessary? \n\nThey say you find out who your real friends are when you are struggling, or are in need. Seems like you just saw with your own two eyes what happens when you have a struggle around these people. Can't say I blame you for blocking them.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I have 3 kids and one on the way. I ran in to severe complications and I'm on full bed rest/need surgical procedures done to save myself/baby. I've had 3 treatments and they were so expensive (partially covered by insurance) that we needed to reach out for help. I only have one treatment left before baby is here (scheduled C-section at 36 weeks) and we don't even have a portion of the cost to cover it (1200). Again, we reached out to his and my family for help and wouldn't have done so if we had any other option. Not a single person helped. I've had my help page up for 3 weeks and had 3 donations- from my friends. \n\nMy SILs dog however was just taken to the emergency vet with hind leg issues. The dog needs a procedure done (for $2900) to get her leg fixed and then will need PT afterwards, and she has stated in her help page that she will need help covering PT cost as well but has no estimate on cost as of currently. Within 8 hours they raised $2150 and when you go through the donations, it's ALL family (husband's). From the same people who said to us \"Sorry hunny, we wish we could help\". So basically, a dogs hind leg is more important to these people than a surgery needed to save a baby. And I guess it was even more of a hit because of the fact that my husband and I are ALWAYS the people that they run to for help whenever they need anything (moving, rides, groceries, event planning, etc). \n\nI didn't even speak to my husband about it first because I was so hurt but I went on and blocked all of them on social media, on my phone and from my eldest daughters phone. This was last week. I have since told my husband that they were all dead to me. He just held me and said he understands. Well, my MIL just got a hold of my husband and asked why she couldn't contact me and said she wanted to ask me how I was. He told her why and stated that I wanted nothing to do with them and that he was on my side. She flipped and told everyone and people have been blowing up my husband saying that they can't believe I am \"selfish enough to make comparisons\" and that they dogs surgery was an emergency and where I'm so close to the due date, they feel my surgery is unnecessary and I shouldn't expect people to help when it's not a definite that something will go wrong, like it was with the dog. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "While I usually wouldn’t ask the nature of the treatments you need, i feel it may be necessary information here bcuz the in-laws seem to feel this is an elective surgery vs. a life saving surgery.", "NAH. You have every right to be upset. You are going through a very hard time. You have every right to be friends on social media with whomever you choose.\n\nThey have the right to make decisions on how they use their money. Belittling their choice to give money to help an injured dog isn't  going to win anyone over. But your frustration is understandable. As is theirs at your reaction. \n\nMake your choices, and let others make theirs. Good luck and best wishes.", "Lesson definitely learned, unfortunately. We were pretty well off before all of the procedures and it was not expected. I guess I just always had this \"if family needs you, you help\" mentality and I learned the hard way that not everyone holds the same view. You live and learn I guess.", "They haven't helped at all prior to this. It's been us helping them with everything they need. They think it's not definitive that I will need it because a blood clot hasn't traveled to my heart yet and \"might not\", so they aren't sure my procedure is necessary. Without taking in to consideration that it hasn't traveled to my heart because of the procedures I've already had done. The baby was planned and I didn't have complications prior to, no. Money has never been an issue for us UNTIL this incident because the procedures have bled us dry of all our backup funds.", "Horrible people seems an exaggeration. Only hard data we have is they donated to help a dog and not OP. The rest is distilled recount from a very stressed and upset woman. I doubt they are downplaying her complications as much as she says.", "Basically, my uterus is starting to tear near the placenta and it's causing blood clots. Since this started happening at 23 weeks, I've gone in to early labor 4 times. I've been having to get shots in my stomach, take meds and go in for multiple different procedures to prevent the early labor and remove traveling blood clots.\n\nAs for the dog, she's losing mobility in her back leg but I can't remember exactly what they called it.", "Medical debt can get out of hand very quickly, even with good insurance.", "How on earth can they call that unnecessary?", "They said that where I've already had 3 procedures done and thus far nothing detrimental has happened that they don't feel a fourth is necessary prior to me having the baby, where I'm so close to having her. I don't know. I really don't."]}