{"id": 16621, "submission_id": "13anoul", "title": "AITA for leaving my weed out for my nephew to discover?", "selftext": "I smoke weed almost every day. I am married but have no kids of my own yet, so I'm not usually in the frame of mind of having kids in the house. As such, I don't normally feel the need to keep my weed hidden or out of reach. Or any other things that might not be safe for children.\n\nMy half sister and my nephew (10 years old) live out of state, but recently came back for a visit due to a death in the family. They haven't met my wife in person or seen my apartment, so they stopped by. When we found out they were coming, we did a sweep of the house to put anything we wouldn't want my nephew being exposed to. \nExcept the bedroom, because we didn't expect anyone to go in there. Even then, the only thing out in the open was a weed grinder with some grinded up weed in it. It's designed to look like a dragon ball. It's an orange sphere with the stars on it.\n\nI have a gaming PC that I keep in the bedroom. Somehow the topic got to video games with my nephew and I absent mindedly let him in there to play some games for a bit.\n\nI let him play a game for a bit and we were having a good time. Eventually we traded seats so I could pull up a different game for him, and he started looking around my room, immediately noticing the dragon ball grinder. As soon as he mentioned it, I tried to play it off and tell him it was a collectable so he shouldn't mess with it. It was too late, he was all over it and quickly realized it opened up to reveal my grinded up weed. \n\nHe asked me if it was weed, so I told him it was, and decided he was mature enough to understand. I explained that as an adult, I'm able to partake in stuff like that responsibly and in moderation, but that it's unhealthy for someone his age, etc. I compared it to alcohol. I thought we had a good talk as he understood my point and dropped it. We played more games until they had to go. \n\nWell, as soon as they left, he told my half sister all about it, who promptly called me and told me how much a piece of shit druggie I was for exposing her child to my filthy habits. I tried to explain my mistake and she just wasn't having it. However, importantly, she was more angry that I \"tried to teach him about drugs\" by not lying about what it was. She then told some of our other family, who were less upset but still took her side in the sense that I should be way more responsible than that, and one person brought up that it wasn't my place to explain weed to him.\n\nI can kinda see their point, but he already knew what it was, and I didn't think lying to him would help my case.\nI might be the asshole because I should've thought about my grinder being out before I allowed him into the room, and because she is his parent and it's up to her to tackle these issues with him in her own way.", "created_utc": 1683466016, "permalink": "/r/AmItheAsshole/comments/13anoul/aita_for_leaving_my_weed_out_for_my_nephew_to/", "score": 211, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I irresponsibly left weed paraphernalia out where my nephew could access it, and because I explained what it was and why I use it to him when he found it. I was definitely wrong on the first count, and I can see the point on the second count.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "you are right, weed *isn’t* much different than alcohol Imagine if the kid had found your liquor cabinet. Oh, the horror.  (s)\n\nYou had a nice conversation with the kid about how your marijuana use was not age appropriate for your nephew. He seemed to understand. He shared your conversation with his mother, (good that he talks to her about things), who then flew off the rails. \n\nNTA and your sister needs to get a grip, her boy *will* be exposed to things, whether she likes it or not. But, seeing as how there was a death in the family and she was in town for a funeral, you can cut her a little slack. I’m sure this is not a fun time for her. NTA", "NTA You handled it like an Adult and you did the right thing, the half sister is an asshole", "NTA - it’s weed, you didn’t leave a bag of black tar heroin out or teach him how to make meth.", "NTA- You gave him an age appropriate response and explanation. His mother is sheltering him by getting this irate that someone had a conversation with him about what weed is.. it’s weed for god sake it’s not like you left out your stash of heroine", "NTA. Your half sister overreacted. The comment calling you am AH sounds like an uneducated and unhinged person. Marijuana is nothing like penicillin… penicillin is actually really dangerous. Marijuana isn’t nearly as dangerous and it isn’t like the kid could have ate the grinded weed and had any reaction at all. If you had gummies or chocolate out and he was unattended then sure, that’d be terrible…. But grinded up weed is not dangerous without a flame or a way to decarb it, and the kid wasn’t unsupervised.", "NTA\n\nAs a child, a lot was hidden for me information-wise or just straight up off limits to even talk about. Short version: it went super wrong and I definitely have trust issues.\n\nYou did your nephew a favour by telling him the truth. It's not like you actually drugged him or something...", "Nta. You told him to leave it alone and he didn't listen. It's not like you left a bong on the kitchen counter.", "NTA your sister is too uptight. Hiding stuff from kids only makes them know you are lying and they then mistrust you and it builds walls. Her kid now knows not to talk to his mom about drugs because she can't have a calm discussion about it. \nTell her the truth, he knew exactly what it was so you didn't introduce anything to him, he already had been exposed and learned from someone else, you didn't lie to him, and you aren't lying to her either.", "NAH. I think your sister could have easily guessed that something like this might happen, unless she has no clue about what your life is like. I think your explanation to your nephew was good and makes sense--the legal and social position of weed is shifting, so it is more like alcohol. People drink in front of kids all the time, and if you'd had a six pack in your fridge for your nephew to discover, no one could have reasonably been shocked or upset.   \n\n\nAt the same time, since the way people think about weed is going through a change, I think it's not surprising that some people are ahead of the curve and fully accepting of it, and others are kind of behind the times, like your sister. She shouldn't have yelled at you, but if she had a fear of drugs ingrained in her as a young person and feels that it is her maternal duty to protect her child from what she believes is evil, it makes sense. I hope you two can work this out.", "NTA. It was in your room, you don't have kids so your room wasn't staged to be kid friendly, and you had a mature conversation about it. \n\nIt sounds like your sister just really hates weed.", "NTA. Your sis is over reacting and you did the best you could. My partner and I have a kid who doesn’t live with us but visits and we tell her not to snoop, we have all our pieces in our bedroom and everything else is in a drawer. If anything your sis is the ass for not listening to you explain", "NTA. You didn’t leave it like out, it was in your private bedroom, which a kid normally wouldn’t be in. I would see her point if you just like left it on the coffee table but that’s not what happened. And IMO, informing a kid on the dangers of something rather than just saying “weed bad don’t do it” is a lot more successful in the long run, cause kids/teens are always curious creatures", "NTA, it doesn’t sound like you left anything out maliciously.", "NTA\n\nYou handled it responsibly.", "I'm going to say NTA overall, it sounds like you gave him a good talk.\n\nHowever, I will note that you slipped with the idea of how you were going to entertain your nephew. The majority of kids, especially boys, play videogames these days. I personally would consider anywhere a games console as a possible place a child might end up being entertained in.\n\nYour half-sister is probably upset that you touched on a divisive topic with her son without her permission or presence. Parents, especially ones in the US it seems, can really get up their own craw about what their kids learn and when.", "Info: do you live in a place were weed is legal? And does you sister/nephew live in a place were it is legal? Is full recreational legal or just medical? Or are you like my place of residence were it's recreational mascarading itself as medical?", "Nta, kids aren't stupid. Obviously not a perfectly ideal situation, but you did the best you could have in that moment. Try asking your sister of she genuinely would have preferred for you to lie, or act scared and nervous and cagey making him potentially more interested?\n\nWtf are you supposed to say at that point, \"N-no they're ground up sensu beans!\"", "NTA.\n\n As a very pro-weed person, it's about time we stop with the weed bashing. Hiding it from kids makes no sense when we openly show alcohol infront of them. If they have the capacity to understand alcohol is for adults only and its okay for them to use in moderation then weed absolutely should be given the same grace. \n\nGood on you for being frank and transparent with your nephew. If you take the mystery away now, it will be alot less novel to them later down the line.", "NTA. Tired of the archaic views on Marijuana. People should educate themselves, especially now because almost everyone walks around with a computer in their pockets.", "NTA\n\nI am a big stoner (also a paranoid one 😂) so I’ve been stealth about my habit for years. I normally keep my stash very secure and hard for the average visitor to access \nI think it was just an unfortunate accident, everyone has a different opinion about weed and it’s important to remember that some people take “devils lettuce” very literally and do not condone it. \nYour sister was just mama bear for a moment and I’m hopeful she will be fine. I am more on your side though as you handled it well and turned it into a teaching moment \nBravo 🎈", "Nta. It happens and obviously he already knew what weed was so it ended up a conversation that needs to be had. Being too sheltered doesn't lead to a healthy stable person. Calling you a druggie was so over the top, sounds like she needs some weed herself.", "NTA - you made sure to sweep it and put it in the bedroom. then when he found it you explained to him what it was instead of saying it was anything else. i think your half/sister is overreacting a bit because she wants to protect her child.", "NTA. It wasn’t intentional, you explained it maturely and and it’s not like you let him smoke it", "Nta. Teaching children is what you're supposed to do. I don't trust a single adult who says to lie. They shouldn't have kids.", "NTA. It’s messed up that people wanted you to lie to a kid. It’s not like you left a bong full of dirty water in reach of a toddler and it’s probably better for the kid to learn about weed from the cool uncle than the cool older kids at school.", "NTA. I bet they drink alcohol in front of him, which is far worse.", "This isn't your fault and you handled it appropriately.  However,  you are now the person that has introduced weed to your nephew and you made it look really fun. I can see why your sister was pissed.\n\nNAH", "NTA", "NAH for the fact that he found it but it wasn’t your place to have a discussion about drug use with a 10 year old", "I don't think you're an asshole but I don't think it's your place to discuss drug use with your nephew. That's up to his parents. I think you handled it well, though.", "NTA for the interaction. But you may have an addiction issue OP\n\n>I smoke weed almost every day", "NTA. but smoking weed almost everyday may be a sign of an addiction OP. \n\nYou might be TA for having the drug talk with him without his parents. That may have been overstepping and violating some of their boundaries.", "NTA since you didn't encourage him to take it but you are an addict, talk to some expert.", "YTA for leaving any out.", "If it was edibles I would say YTA but because it was flower and you had an adult convo I would say NTA", "YTA very lightly. When he found the dragon ball, you should have taken it away. It is NOT your decision if he is mature or not. Is is SOLELY his guardian/parent's decision. It's definitely not positive that you showed a 10 year old weed.", "YTA\nUnintentional marijuana ingestions have skyrocketed since pit has been made legal.  I understand it was a mistake, but it is a drug (just like penicillin) and shouldn't be within reach of children. Especially in a colorful Dragonball theme.\n\nI get the conversation and the mistake, but you don't seem to realize that this kind of mistake can be deadly.", "YTA for taking it on yourself to \"educate\" a child you seem to barely know about a sensitive topic", "Yeah, you the asshole for even doing weed in the first place, stop it. No drugs.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI smoke weed almost every day. I am married but have no kids of my own yet, so I'm not usually in the frame of mind of having kids in the house. As such, I don't normally feel the need to keep my weed hidden or out of reach. Or any other things that might not be safe for children.\n\nMy half sister and my nephew (10 years old) live out of state, but recently came back for a visit due to a death in the family. They haven't met my wife in person or seen my apartment, so they stopped by. When we found out they were coming, we did a sweep of the house to put anything we wouldn't want my nephew being exposed to. \nExcept the bedroom, because we didn't expect anyone to go in there. Even then, the only thing out in the open was a weed grinder with some grinded up weed in it. It's designed to look like a dragon ball. It's an orange sphere with the stars on it.\n\nI have a gaming PC that I keep in the bedroom. Somehow the topic got to video games with my nephew and I absent mindedly let him in there to play some games for a bit.\n\nI let him play a game for a bit and we were having a good time. Eventually we traded seats so I could pull up a different game for him, and he started looking around my room, immediately noticing the dragon ball grinder. As soon as he mentioned it, I tried to play it off and tell him it was a collectable so he shouldn't mess with it. It was too late, he was all over it and quickly realized it opened up to reveal my grinded up weed. \n\nHe asked me if it was weed, so I told him it was, and decided he was mature enough to understand. I explained that as an adult, I'm able to partake in stuff like that responsibly and in moderation, but that it's unhealthy for someone his age, etc. I compared it to alcohol. I thought we had a good talk as he understood my point and dropped it. We played more games until they had to go. \n\nWell, as soon as they left, he told my half sister all about it, who promptly called me and told me how much a piece of shit druggie I was for exposing her child to my filthy habits. I tried to explain my mistake and she just wasn't having it. However, importantly, she was more angry that I \"tried to teach him about drugs\" by not lying about what it was. She then told some of our other family, who were less upset but still took her side in the sense that I should be way more responsible than that, and one person brought up that it wasn't my place to explain weed to him.\n\nI can kinda see their point, but he already knew what it was, and I didn't think lying to him would help my case.\nI might be the asshole because I should've thought about my grinder being out before I allowed him into the room, and because she is his parent and it's up to her to tackle these issues with him in her own way.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. In fact, I think the way you handled it was the best way possible — honest, cautious, and responsible.", "NTA, you handled it very good", "NTA, you actually did a good job by giving an honest talk.", "NTA X1000, you handled it appropriately, you explained how for someone there age it is not good for them, and how cause your old you could actually use it. You literally explained everything in a appropriate manor. Familys extremely over-reacting", "NTA but you should have put it away and probably spared him the “teaching” moment and left that to your sister.", "NTA,  the only thing I can think of that you could have done differently is to inform his mother of what occured and the conversation you had with him, just in case he had follow on questions for her she wouldn't be caught off guard", "NTA\n\nI used to help my father roll cigarettes when I was like three or four. Looking at weed isn’t going to kill him.", "Not the Asshole.\n\nAlright, knee-jerk reaction of \"Children shouldn't be exposed to drugs\" I had aside. (It's how I was raised we weren't even allowed to watch The Simpsons that's how nuts my dad is.) You handled it like an adult, and your nephew asked a question. You educated him expertly.\n\nYour half-sister is an asshole though, name calling is never the mature way to handle being upset. \n\nAs to the other people, if you didn't educate him he would have found out from someone else anyway. What better way to learn than from someone he trusts that won't lead him astray by letting him try some or worse. Does your half-sister not realize that Google exists or something? He had enough information about weed already to know what he was looking at at a glance, and the questions to ask, he knows what weed is.", "Alcohol is wayy worse than weed does your half sister shelter him from that aswell? Or maybe when he gets older his friends give him an eccy and he will be more inclined to take it since he doesn't know the dangers.", "NTA. You handled it reasonably. I don't understand what your sister is mad about.", "NTA your sister was way out of line. he's a 10 year old kid, he is old enough to have a basic understanding that some things are meant for adults only, does she plan to throw a fit like this when he inevitably goes through sex ed when he is in middle/high school?", "Where I live it's medically legal, recreationally decriminalized. They happen to live in a state where it is fully legal and that's probably how he was able to correctly identify it in the first place.", "then how did the nephew know what it was if this was his \"introduction\"?", "When you frame it like that, I definitely see why I might've been the asshole. However, I'm not really sure what the proper response to that situation would be. It's not really something there's a script for so I just had to wing it.", "Thanks for the concern. I don't think I'm addicted because I don't suffer any drawbacks on the occasions that I don't smoke at all. The extent of my smoking also varies from situation to situation. I'm not walking around blazed all the time, only when I don't have anything to do.\nOn most days, I smoke a little to relax at the end of my day. I'd compare it to how my father's generation would have a beer or two after dinner several nights a week. \n\nHowever I also have several risk factors for addiction so it is something I need to be vigilant for.", "Smoking weed every day is not the same thing as drinking or doing other drugs every day. OP is fine unless it’s effecting his ability to work, socialize or otherwise function in society", "Marijuana doesn’t contain any compounds that interact with the reward system. \n\nHowever, addiction is the case if weed affects you negatively or has strong adverse effects and you continue to smoke, then there’s a problem, but that isn’t always the case as with alcohol or ketamine.\nI", "If someone takes insulin daily, are they having issues with addiction? What about blood pressure medication? You do realize a lot of people use marijuana as medication in order to not have to take heavier pharmaceuticals, right? I take my medication daily, zero addiction issues.", "Why?  It’s his house and he doesn’t have kids.", "So I'm not going to defend my mistake, it was a pretty serious mistake that could've been much worse than it was. However, this was raw bud. It only becomes psychoactive after being exposed to heat. He obviously isn't going to accidently smoke it, so the worst that would've happened if he tried to eat it would be a bad taste in his mouth.\n\nThat being said I do 100% agree that I should have considered the probability that he'd want to play video games or something and be in that room. If I'm going to have a child in my house for any reason, even just to visit for a couple of hours, I need to be thinking about these things.", "The overwhelming majority of unintentional marijuana ingestion cases are edibles. Not to mention, the child wasn't unsupervised, and an exposure to marijuana poses no risk of death.", ">YTA Unintentional marijuana ingestions have skyrocketed since pit has been made legal.\n\nHonest question: What do you think would habe happened if he 'acidentally ingested' the marijuana?", "Two things. I wasn't trying to educate him, I explained what it was because I was caught red handed, and I didn't want him thinking it was okay for him to do it because I do it. I admit I was winging it and could've handled it better, but short of avoiding the situation entirely, I don't know what I should have said.\nThat's the whole problem here, I admit I fucked up big time, this was literally a nightmare come true, I just don't know to handle these situations. \n\nI also don't \"barely know\" him. He's close family and we've been around each other several times a week at least until the last three years when they moved. Every time I'm on the phone with my sister, he's asking if he can talk to me.\nOne issue with the character limit is that I had to cut out a lot of background information that might have made things more clear.", "Wrong.", "wank wank", "lol smoking weed makes someone an asshole? okay buddy", "Especially since your nephew was able to identify it, your sister really needs to have mature discussions about drugs with your son.", "Then I'm going with YTA\n\nYour nephew is old enough to know that your state isn't a rec state only a med state. And since you compared it to alcohol and other things you said it's obviously you use it as rec not med. So there is a skirting of the law that is not ok, especially around children. And since your sisters state is a rec state that should have been more her place not your place. \n\nAlso something to think about. No matter what legislation the states might pass, weed is still illegal on the fed level and right now their letting it slide but until the legislation changes at any given point the FBI could round everybody up and charge them with federal crimes. They probably won't but they could, they have that power. and again because of that it's also your sisters place to teach him.\n\nListen do what you want but make sure you know all the risk factors, and when it comes to kids it's not a cowardly response to say go ask your mom/dad about that. \n\nWhich even if you hadn't said what you said it did push her to have a conversation about weed that she perhaps wasn't ready to have yet. Since he knew what it was by site it was obviously time she had that conversation but still, not your place to have that conversation.", "5th grade DARE program", "Probably something like “yes that’s what it is, your mom can talk to you more about that”.", "I work full time at a job I've held for the last five years, my spouse has no complaints regarding my use, and aside from this one shitty situation, I've yet to have it negatively impact my relationship with my family.\n\nThat being said there are definitely some people that cannot regulate themselves at all and let it spin out of control, so I understand how smoking every day would be a red flag.", "Sorry, rereading mine I was a bit harsher than I should have been.  It's just become a real problem with so many kids being exposed.  I'm all for legalization, we just have to keep in mind legal != safe, and it is truly a drug.", "Right, and wrong.  Yes the majority are from edibles.  However there have been at least one death, seizures, multiple ICU admissions and intubations from marijuana overdoses.  Marijuana is a drug.  While marijuana overdoses tend to be much more benign, it's foolish to ignore a 12 fold increase in pediatric overdoses.  The problem is clear, people aren't treating these like drugs at home.\n\n&#x200B;\n\nWould you say Y-T-A if he left out a bowl of pills?  I would, and I don't consider marijuana different.  It seems many people do, and as such we are intubating children and trying to keep them from dying.", "That is a good point. When I compared it to alcohol, I had intended to convey that while there are reasons people use it, it's also something that requires a level of development and maturity that only an older person would have to use responsibly. However I can see how that would also give the impression that it's no big deal and not at all a grey area.\n\nI also agree that I'm really not the right person to have that discussion with. It was just a \"well I'm caught, what now\" reaction. I hoped that if I were just honest about it, it wouldn't lead to any further issues.\n\nI probably should've just said \"yes it's weed, if you have any questions, talk to your mom\" and took the inevitable screaming.", ">However,  you are now the person that has introduced cannabis to your nephew\n\n 5th grade dare program has introduced cannabis to the nephew. ftfy.", "I still have the t-shirt 21 years later. That program did way more harm than good I think.", "Oh OK.  Thanks for fixing that for me.  I had no idea learning the dangers of drugs was the exact same perspective as having a cool uncle who smoked dragon ball weed while playing on his gaming PC.", "Bro it's not like he was like, hell yeah it's weed you want a bowl! He told him the truth, and was very even about it basically saying it's off limits to him in the realm of alcohol. He essentially told him something similar to what dare would have said.\n\nI don't get why people think it's appropriate or good to lie to children, they're not stupid.", "No one mentioned the word \"perspective\" only \"introduction\".", "Honestly explained it better that DARE since DARE actually caused more kids to get into drugs by making it seem like a cool thing that the adults don’t want you to do, and shouldn’t ever try. Hopefully if the nephew has more questions he can be the safe person for the kid to go to, instead of someone who might not have his health in mind.", "I literally said it wasn't OP's fault and that they handled the situation correctly."]}