{"id": 1664, "submission_id": "yoa0sz", "title": "AITA for ignoring my sister's text telling me she has cancer?", "selftext": "My (37m) relationship with my sister, Tori (36f) is complicated. We were raised in hell, but got through it together. Tori got pregnant at 15 with my niece, Kayla (now 21), but left me to care for Kayla until she was about 2 and a half. Once Tori turned 18, she joined the military and left with my Kayla. Tori met Mike when Kayla was like 5, and they got married quickly and have been together since. Tori and Mike have two kids (5m, 3f). \n\nAbout 3 years ago, Kayla came out and told my wife how Mike had essentially been grooming her since she was around 9 years old. Eventually, Kayla and Mike apparently were having sex for a few years as well, after my sister had the younger baby and wasn't wanting to have sex with him.  \n\nOnce Kayla (17 at the time) started to come forward with this information, she ran away. Tori made it very clear she would not allow Kayla back in her home and recorded videos of her burning Kayla's things and sent them to us to send to her. After a lot of drama and bullshit, things settled into my wife and I sending money to Kayla wherever we could to help her survive and cutting off my sister, who told us we were monsters enabling her runaway slut daughter.\n\nCut to now.\n\nTori texted us on Halloween (large time difference, but it was during trick or treating hours for us) that she has been diagnosed with stage 4 cancer, had surgery last month, and would be continuing to go through chemo. \"minimum I have is a year left\", she said, whatever that means.\n\nThrough sources, I've confirmed this is true and she has stage 4 colon cancer. Kayla texted her, \"Hey, I love you. I heard and I want to be there for you. Can we please talk?\" and Tori essentially told her to fuck off. That was my last straw, honestly. I'm not interested in rekindling a relationship or letting her know I'm here for her, bc I'm not. Not after the way she has treated Kayla, knowing what's gone on. I'm here for Kayla. \n\nMy wife thinks I should send at least an acknowledgement text, \"I appreciate the information. I'll get screened. Let us know if you need anything else and we'll see if we can help.\"  But I don't want to open the door to more attempts to reach out. Every time we talk to her, there's drama and I don't want to deal with it. I'm perfectly fine if our only contact for the rest of our lives is sharing health information to make sure each other looks out for it.\n\nSo, AITA for ignoring the my sister's text telling me she has cancer?", "created_utc": 1667787528, "permalink": "/r/AmItheAsshole/comments/yoa0sz/aita_for_ignoring_my_sisters_text_telling_me_she/", "score": 61, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole because I am ignoring what seems to be my sister's last ditch effort to speak to me before she passes away from cancer\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If even in the face of death your sister can’t make amends with her daughter, she is fundamentally a bad person and a despicable mother.", "Your post isn't going to stay up, as it involves minors/sex.  But to be clear - you are absolutely NTA.", "NTA someone dying doesn't instantly make them a good person and she clearly isn't looking to make amends, given how she spoke to your niece who reached out with the best of intentions. The best she can hope for is ambivalent acknowledgement of her news, and I wouldn't even give her that. Good on you for sticking by your niece at all costs", "NTA. Cancer or not, the way Tori acted towards her own daughter was disgusting. You are under no obligation to reply back. Right now the best thing is to be there for your niece. \n\nWhile I’m heartbroken for what Kayla has been through. I’m glad she has an amazing uncle she can trust and turn to.\n\nTori will end up dying alone and bitter but. That’s how she chose to make her bed.", "“That sucks… Good luck.” Block. \n\nNTA", "NTA\n\nYou’re right. Crack that door open and she’ll stick her foot in the gap and keep it open.\n\nKeep it firmly shut.", "NTA what she's doing, how she treated her daughter not redeemable.  I'm sorry it all went down like this.  I have a sister with stage 4 cancer and we've gotten longer than we expected but know longer isn't forever.  I can't imagine what's to come.  However in your case you are doing right by your family cutting her off and doing right by your niece.", "NTA -\n\nYou don't have to \"let her in\" or have phone conversations with her if you don't want it. \n\nBut I would suggest acknowledging her information as your wife suggested, but you don't have to offer continued help or support. \n\nI don't know if you or your sister believes in God or a higher power, but I'd also take this opportunity to remind her that her daughter has reached out to her, wanting to help her even though her Mom is wrongfully blaming her for what her step father did to her and since she is dying she doesn't want to die with regrets about how she treated her daughter. \n\nBy the same token you don't want to have regrets that you didn't acknowledge that she wrote you and told you what is going on. \n\nI do have a question - did NO ONE contact CPS and have the step father investigated?! What is going to happen to the small daughter he has now when her Mom dies.  I am afraid for her as well.", "NTA. You probably should get screened though.", "NTA. Please make sure those other children aren’t getting groomed by that man when your sister dies.", "NTA but did your sister meet her husband when both were in the military? Are they still in it? If so, report him to the military police.", "NTA.  Your sister allowed her husband to rape her daughter when she didn’t want to put out anymore.  That’s a monster.  I wouldn’t expend an ounce of effort to give a monster a moment of peace - even when they’re confronting their own imminent death.  I’d celebrate the death of anyone who knowingly allowed the rape of a child - much less one who held said child rape against the child.  \n\nSome people are literally monsters in human skin.  Unfortunately sometimes those monsters are family.  That doesn’t earn them a pass.", "NTA. And I love your response.", "NTA\n\nYou stand in solidarity with Tori who was a victim of abuse at the hands of her mother’s SO. It breaks my heart that even after everything her mother put her through, Kayla still reached out upon hearing the news of cancer and was still shot down. At the end of the day it sounds like she’s only ever wanted her mothers love and support and I hope you continue to stand by her to fill her with the love she won’t be receiving from Tori. 100% NTA", "NTA - But why didn't you text back \"Good\"?", "NTA, and tell her a year is too much time for her sorry ass.", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (37m) relationship with my sister, Tori (36f) is complicated. We were raised in hell, but got through it together. Tori got pregnant at 15 with my niece, Kayla (now 21), but left me to care for Kayla until she was about 2 and a half. Once Tori turned 18, she joined the military and left with my Kayla. Tori met Mike when Kayla was like 5, and they got married quickly and have been together since. Tori and Mike have two kids (5m, 3f). \n\nAbout 3 years ago, Kayla came out and told my wife how Mike had essentially been grooming her since she was around 9 years old. Eventually, Kayla and Mike apparently were having sex for a few years as well, after my sister had the younger baby and wasn't wanting to have sex with him.  \n\nOnce Kayla (17 at the time) started to come forward with this information, she ran away. Tori made it very clear she would not allow Kayla back in her home and recorded videos of her burning Kayla's things and sent them to us to send to her. After a lot of drama and bullshit, things settled into my wife and I sending money to Kayla wherever we could to help her survive and cutting off my sister, who told us we were monsters enabling her runaway slut daughter.\n\nCut to now.\n\nTori texted us on Halloween (large time difference, but it was during trick or treating hours for us) that she has been diagnosed with stage 4 cancer, had surgery last month, and would be continuing to go through chemo. \"minimum I have is a year left\", she said, whatever that means.\n\nThrough sources, I've confirmed this is true and she has stage 4 colon cancer. Kayla texted her, \"Hey, I love you. I heard and I want to be there for you. Can we please talk?\" and Tori essentially told her to fuck off. That was my last straw, honestly. I'm not interested in rekindling a relationship or letting her know I'm here for her, bc I'm not. Not after the way she has treated Kayla, knowing what's gone on. I'm here for Kayla. \n\nMy wife thinks I should send at least an acknowledgement text, \"I appreciate the information. I'll get screened. Let us know if you need anything else and we'll see if we can help.\"  But I don't want to open the door to more attempts to reach out. Every time we talk to her, there's drama and I don't want to deal with it. I'm perfectly fine if our only contact for the rest of our lives is sharing health information to make sure each other looks out for it.\n\nSo, AITA for ignoring the my sister's text telling me she has cancer?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA. She’s already dead to you.", "NTA\n\n\nEven on her deathbed she is still awful.  She doesn't deserve compassion or kindness.  She deserves karma and she is getting it.", "NTA. You're under no obligation to open communication with Tori, but if contact with you is important to her, perhaps leverage that into her being civil to Kayla, because Kayla might benefit from such contact (assuming, of course, Mike isn't a part of that).", "NTA - So basically people tend to have a vulnerable spot for the sick and dying and I totally get it and empathize with your wife but what you really have to ask yourself even if you were to reach out… “To what end?” \nLike realistically and seriously ask yourself and have your wife do the same: “What would you hope and expect the consequence of “reaching out” to be?”\n\nObviously it would be great if everyone could come together and get closure so there would be no regrets once that opportunity is no longer there. But you have to ask yourself is that even a plausible scenario. I have no idea what is going on in your head or your heart but if the answers to those questions would make you think that it would only bring more drama and heartache, then I say skip it. You can not reconcile by yourself and you can only accept what you are willing to accept. In your position I personally would have to keep my distance. I couldn’t fathom not possibly ending up in jail even being in the vicinity of Mike. And the fact that your sister blames her daughter is triggering ME and this is just a random post as far as I am concerned. So yeah I try to give relatively unbiased advice or at least advocate for people to step back and take an objective view of their situations, and yeah I totally still think you should probably do that, I’m finding it hard to see how reaching out could make anything better. I will say this… Consider how you are going to feel when she is gone and the opportunity is no longer available. Personally it wouldn’t bother me in the least (well anymore than the current situation would be bothering me to begin with), but I am not you. So I advise you to do some introspection before you make a decision one way or the other. Best of luck with whatever you decide. In any case you are definitely NTA.", "NTA. What a horrible human being.", "Her husband rap*d her daughter and she thinks her daughter is s*ut. She does deserve your love either", "NTA. I'd say, \"Sorry to hear that, but thanks for letting me know so I can arrange screening. Take care.\" Then be prepared for her to ask for ... something. Why else would she reach out to the enabling monsters she thinks you are after all this time?", "NTA one bit. Hell I wish I could help Kayla after the nightmare she went through! Your sister can live the remainder of her life with the people she has tricked into thinking she is a good person. She's made it this long without you, seems like she can obviously make it the rest of the time.", "NTA", "Congrats on being an amazing uncle. Every girl wishes for an uncle like you. When she asks you to walk her down the aisle: own it, love it, and above all, say yes. Tradition aside, you DESERVE to be honored.", "PLEASE, THIS.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**"]}