{"id": 1665, "submission_id": "yo9n90", "title": "AITA for telling my roommate that I would start charging her to live in my basement?", "selftext": "About a year ago my friend Sophia(27F)  lost her house because she was out of work, she couldn't afford rent in the area so I (23F) let them stay with my fiancé (25M) and I till she gets back up on her feet. She recently got a job at Starbucks and is saving up for a home. This is fine except she and her daughter (8) eat everything in my fridge and leave little to none for my fiancé or me. Today when I went to put ranch on my salad nothing came out but a fart, the bottle was empty. The other day it was the butter dish, before that the milk, and so on. This has been going on for months and I've finally had enough of it.\n\nI had talk with my fiancé about this and he said that this has been bothering him as well, we agreed that $500 a month was a fair amount since they live down in our basement with a small bathroom. When Sophia got home we talked to her and told her that we would start charging her $500 a month to cover her and her daughter's expenses. She freaked out and complained that this was an insane amount to live in the basement, I told her that I thought it was fair since the basement is furnished and equipped with a king bed and entertainment station, this $500 would also go towards things liked food, utilities, bills, and other such expenses. We told her we thought this was a fair amount because it's in Boston and it covers everything.\n\nSo reddit am I the asshole? Is $500 a month really too much to expect her to pay?\n\nEdit: Yes, we have talked to her about it but she just shrugs us off saying something along the lines \"Sorry, I forgot.\" or \"I just didn't think about.\"\n\nAnd we thought $500 was fair because it would at least cover some of their living expenses while still allowing her save up. I hate to do it to her but my fiancé and I aren't wealthy ourselves and we really can't afford to cover the cost of her and her daughter's living expenses but I don't really want to see them on the streets. I've already cut into my wedding  and vacation savings to cover their costs.  ", "created_utc": 1667786488, "permalink": "/r/AmItheAsshole/comments/yo9n90/aita_for_telling_my_roommate_that_i_would_start/", "score": 1669, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I asked my friend to pay rent to cover her and her daughter's expenses (2) I'm charging a single mother $500 a month to live in my basement\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, but throw her out if she doesn't agree. She can go out there and pay \"real\" rent like everyone else.", "You gave her a place to stay when she needed it. That's more than others did for her (and her daughter). You are a great friend. \n\nSophia has a job now and should stop freeloading. \n\nIf she doesn't want to pay, you should tell her to look for other living arrangements. \n\n$500/month will barely cover food for two people (assuming they are not eating out).\n\nNTA", "$500 a month to cover the living expenses of two people? That’s a great deal, rent alone is 900 and up in most places.", "NTA\n\nThat’s a very generous rate for room and board. Tell her if she doesn’t like it. She can find a boarding house that’ll offer a better deal.", "NTA ~~INFO~~\n\nIs your basement a **legal space to rent as a bedroom**?\n\nExits up to fire code and all?", "NTA girl 500 in Boston? I paid like 750 fifteen years ago for one shoebox bedroom in a shitty three bedroom with barely working heat…your friend can deal with 500", "NTA - $400-500 seems reasonable for utilizing the space in your home + utilities and obviously groceries too. If she is concerned about that she’s going to have an even harder time finding a place on her own!", "I love in rural middle of nowhere and $500 MIGHT get you a room here. But it wouldn't be furnished and certainly wouldn't come with meal service. Simply say \" I cannot afford to support you at this point.\" Don't discuss finances, don't negotiate. If she tries to discuss, simply blank wall her-repeat your phrase. You might say that it should start at $500 and move up towards market rate if she doesn't move out (as you withdraw your assistance). Oh, NTA. She's a grown woman with a job, you're not obligated to feed and house her.", "NTA that is cheap as fuck for just a room, let along them eating all your grub.", "NTA that's what I paid my mom when I lived with her in college and I didn't get a whole furnished basement. It's not unreasonable at all, just be careful bc once you get into a landlord arrangement, it can get tricky. E.g. Having the basement up to renting code, etc.", "NTA. \n\nBut talk to an attorney who specializes in property law and have him or her draw up a lease agreement. \n\nYou’re already a landlord (doesn’t matter that she isn’t paying to live there - most people don’t realize a visitor/guest can become a legal tenant in as little as two weeks just by virtue of continuously occupying a space; the length of time it takes to convert to a resident depending on your jurisdiction but it is a lot shorter everywhere than people realize).  \n\nOnce someone is legally a tenant, both sides have rights and obligations regarding the other. \n\nAbsent a lease agreement,and regardless of whether she is paying you, she already has rights regarding a potential eviction and can sue you for damages if you do it incorrectly. \n\nReserve the right to raise the rate after a certain amount of time or under certain circumstances. \n\nBoth of you need to sign it and have it notarized.", "She’s delusional NTA", "NTA. I would guess that $500 might not even cover her monthly share of the utilities and food, much less rent. I feel this is a very generous offer, especially considering she's been on your dime for over a year. I would, however, check into landlord/tenant law in your area and get a rental agreement drawn up at the very least.", "NTA and yikes, do you have any idea how much it is going to cost to heat your house this fall and winter?  It is not going to be pretty. \n\nI'm shocked you're not charging her more, frankly.  $500 for room and board in Boston is an outrageously good deal.  That will basically pay for their food for a month.", "She's lived free for a year and now you expect her to pay for food for her own kid? How dare you not let her leech off you forever? NTA. If she can't see that, it's time for her to go.", "NTA. If she doesn’t want to pay, she’s free to move out.", "NTA but you need to work on throwing them out. She’s a freeloader", "NTA.  \nShe lived there rent free for months and was eating your food and using your utilities.  Even out in the boonies of North Carolina where I live, $500 rent for a roommate would be a deal.", "NTA. I think it's time she finds her own place, you've been nice way too long and she's taking advantage.", "NTA\n\n500 per month is a bargain....just on food alone it is amazing, add in rent and all the other things.\n\nGet a lease drawn up with 500 per month as the rent. Tell her she is more than welcome to go elsewhere is she doesn't like it \n\nI would use your first 500 payment to buy a small and seperate fridge to store things that are not for sharing. She really should be buying her own food.", "The nerve of some people! If she doesn't like the dirt cheap $500 a month which is beyond fair, let her find another place to live. You have been above and beyond generous. Five hundred dollars won't even cover food and utilities for 2 people in your area. You're actually not charging her enough.\n\nSide note: She doesn't sound like your friend, more like an acquaintance who is taking advantage of your good nature.\n\nETA: you've already supported her AND her daughter for an entire YEAR. You've spent thousands of dollars and she's pissed her free ride is over?! She's a freeloader. \n\nNTA", "She's just mad because her free ride is over, and she's only thinking of her needs. Not much of a friend, she is. NTA", "NTA\n\nI'm not 100% sure on this, but that seems cheap by Boston standards.", "NTA, this is an excellent deal, especially after you were gracious enough to allow her to live for free for a YEAR. I paid $690 for a basement apartment in Atlanta and that definitely didn't cover my food (although I did have my own kitchenette space). That's crazy to me. Now, to be fair, if you just demanded $500, that's kind of rough, but that's not the impression I'm getting from the post. A month's notice seems more than sufficient to me. \n\nI strongly agree with the other comments that you need to implement a lease, or be prepared and informed about the eviction process if this goes south, make sure you have documentation to protect yourself.", "NTA\n\n\nI would have had her depart when the ranch bottle shart", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAbout a year ago my friend Sophia(27F)  lost her house because she was out of work, she couldn't afford rent in the area so I (23F) let them stay with my fiancé (25M) and I till she gets back up on her feet. She recently got a job at Starbucks and is saving up for a home. This is fine except she and her daughter (8) eat everything in my fridge and leave little to none for my fiancé or me. Today when I went to put ranch on my salad nothing came out but a fart, the bottle was empty. The other day it was the butter dish, before that the milk, and so on. This has been going on for months and I've finally had enough of it. \n\nI had talk with my fiancé about this and he said that this has been bothering him as well, we agreed that $500 a month was a fair amount since they live down in our basement with a small bathroom. When Sophia got home we talked to her and told her that we would start charging her $500 a month to cover her and her daughter's expenses. She freaked out and complained that this was an insane amount to live in the basement, I told her that I thought it was fair since the basement is furnished and equipped with a king bed and entertainment station, this $500 would also go towards things liked food, utilities, bills, and other such expenses. We told her we thought this was a fair amount because it's in Boston and it covers everything. \n\nSo reddit am I the asshole? Is $500 a month really too much to expect her to pay?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA…but I wouldn’t give her a chance to establish renter’s rights.  She’ll torture you with ever single one.  I’d say 30 day notice before this turns into a nightmare.  (Yes, it can get much, much worse.)", "I will say this reminds me of how my mother told me that since my grandmother was living with us and said she planned to contribute 200 dollars a month that i needed to contribute 400 a month\n\nTo which i told her- im not exagerating here- thats how much theyd have me contribute Each Week already. With the amount of food and various things she was having me buy (99% of grocceries and just food in general are Me, and have been since 2019)\n\nSomehow she has since forgotten this conversation has ever happened but she doesnt ask me about 400 dollars anymore. How much i spend on everyone hasnt changed other than increasing", "NTA-- Perfectly reasonable.\n\nYour original offer was to give her time to get back on her feet, not free housing till she can buy a house, however long that would take. Sophia should be counting her blessings she had a friend nice enough to provide free housing for a year.", "NTA and your offer is more than fair,.  If she doesn't think the basement is worth it she can find somewhere else to live.  As long as you let her live with you for free and eat your food, shes never moving out.....lol.  \n\nIt's time for her to find other accommodations.", "NTA, yeah she can take it (and pay rent) or leave it.", "NTA\n\nShe was just hoping to continue to use you, and contribute nothing until she left in a few years.", "NTA.", "NTA\n\nYou were generous allowing her to stay for free when she was out of work and you are generous for asking for $500 rent (in Boston!).  Not to mention this includes groceries and utilities.\n\nI think it is very unlikely an adult in their late 20s truly thinks that your offer is unreasonable and is therefore taking advantage of your kindness.  That would be a dealbreaker for me.", "Not to be snobby or elitist….but she is working at Starbucks and saving up for a home? Is this her second job? How much do baristas make in Boston?", "NTA. If she doesn't like it she can look for another place to live. I doubt she will pay $500 a month.", "NTA, it's your house if she wants to keep living there then she should have to help contribute. However you should maybe charge her less? I mean the cheaper the rent, the quicker she can save and move out, I don't think she is making bank at Starbucks so I would probably charge about $250 if the main issue is just to cover groceries.", "Yup and Boston isn’t cheap. $500 is a steal especially since it includes rent, utilities, and food for 2 people. NTA.", "This!", "In Boston, it’s much higher.", "For $900 a month in Boston, you’ll get a closet with no windows in an apartment with 3 other people.", "Yes, it's a legal space to rent and it's up to fire code. The previous owners rented it out so it's a pretty good setup to live in with a family.", "Why go downt to 400. 500 is still too little", "And the room is fully FURNISHED too! My goodness OP is NTA", "ya i live in boston, that's definitely cheap", "I don't know about Boston specifically, but there's a good chance she already has tenant's rights if she's lived there for a year. Getting her to sign a lease might be better, legally (but again I am not a lawyer, idk lol).", "Less? I think OP should charge this lady more. $500 will barely cover living expenses let alone rent in my parts and I live in the middle of nowhere in Florida.", "Alright, fucking a.", "Just in the case there’s pushback from them still I just feel like that range is fair.", "Again as I said if Op wants her to move out sooner I would say charge less. The more you charge the longer she has to save, it's a simple concept.", "If there is pushback, they can live somewhere else where they pay 500 for rent, utilities and food\n.", "Or she can kick her out and let Sofia pay real rent. I live in rural florida and $500 a month will barely get you a crappy trailer let alone cover the groceries and living expenses of two people.", "[removed]", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You're in Boston? $500 is amazing. NTA.", "If she starts arguing again, up the rent $75 every time!  Of course, remember that she’s using you and bf so you could actually kick her out and no one would think any less of you!!  If she says no rent, tell her to hit the road and go NC!  Feel sorry for kid and hope she doesn’t grow up to be a mooch like her mom!!", "NTA and she’s not mad because the rents unreasonable she’s mad because her free ride is over and now that she’s working you have every right to ask her to pull her weight and if she disagrees she can go find an apartment on her own and pay 3X that not including living expenses her choice but either way her shitty attitude about having to be an adult again is not your problem it’s hers\n\nETA $500 isn’t enough tbh so not only is that very reasonable but an incredibly nice offer (and this is by texas standards I'm assuming the cost of living in your area is at least double that) of you and your husband not even including the months-year long amount of time completely covering 100% of her and her daughters expenses", "Get that eviction notice ready, they are taking advantage of you.", "NTA, you've been a doormat and have let someone live in your house and much off of you. You need to shine up your spine and tell her she either pays you rent or she gets out of your house.", "NTA, but your approach was tough. I would sit down & talk out expenses.", "Boston has a higher cost of living. I live in a major city down south and $500 bucks would be a great rate for renting a room with en suite bathroom. Definitely NTA. She doesn't like this deal then she can move out. Be sure to check tenant laws to CYA.", "Nta", "NTA. But I’d tell her she’s overstaying her welcome and you’d like to rent out the basement for x amount instead. Pay the 500 or get out.", "Holy cow that's CHEAP for Boston. NTA. You could charge probably 2x that, without the food and utilities, and still be at fair market rate.", "NTA but this is your fault for not charging her 1000 and for letting her mooch off you thus fostering this entitlement ..homeless single mom...not your problem.  It is the permissive do gooders in this world that allow AH people to exist in the first place as they never get a sense of reality", "That's \"don't reply to the Craigslist ad because it's either a scammer or a skeeve\" cheap.", "🤣😂 working at Starbucks and saving up for a house in Boston are not compatible things.", "I was thinking the same, in the DMV a small basement apartment is about $1200 or more", "Okay, that's what I thought.", "NTA if shes smart, she'll agree otherwise she'll have to pay a lot more to live in a lot less", "Nta", "I swear to Jesus Christ that if I see one comment about OP being the Ah for using money from her \"renters\" to buy food that they eat OMFG.", "NTA, $500/mo in Boston is an absolute steal for a furnished room and utilities included. \n\nI highly highly recommend consulting an attorney because Massachusetts law tends to favor tenants, you’ll want to be sure how the law will view your friend (either as a guest or a tenant) and make sure whatever steps you take to begin charging rent are compliant with state laws. And if she is considered a tenant, what the steps are for evicting her if she refuses to pay rent and leave your home.", "She doesn’t even pay for her own food?? Of course NTA. It’s one thing letting her live in otherwise unused space rent free, but for her to expect you to also cover her and her daughter’s food and utilities is absolutely taking the piss.", "NTA but get it in writing", "seeing as renting a room in my neighborhood is like 1,200..... I'd JUMP on OP's offer if we didnt own our home... \n\nHas Sofpha not been to a grocery store lately???", "Yah I'm guessing fair market rate is more like 1k, with food, utilities and furniture the going rate would be 1500, so OP is charging her a third the cost.", "No, she has just been shopping in OP's fridge. Obviously.", "Shiet kick sophia out...... I'll pay you the 500 a month! lol I'll then rent out my 3bdrm house for 3,500 a month and make bank! :)", "If it was rented out before, I assume it has at least a kitchenette?  If so, I'd charge rent AND tell her she need to run her own kitchen from now on, and stop eating your food.", "NTA \n\nServe eviction papers to Sophia.\n\nShe lived with you for a year for free and also emptied out food you bought - all this without any gratitude.\n\nThe problem isn’t going to improve even after you charge her a rent.\n\nGet rid of her so that you are rid of all sorts of headaches too", "If she objects - show her how to use the door - once more.\n\nI\\`m sure you will have hundreds of people who would think 500 or even 750 / month would be more than reasonable (with all you explained is included)\n\nNTA", "NTA she wouldn't find a deal anywhere for that.", "500 a month is SIGNIFICANTLY less than I'm paying for a single bedroom in a house shared with 5 people, food not included. NTA.", "NTA no one gets to live for free.  They had you as a lifeline and don't want it to be taken away.  With the housing market you could get triple that.", "Stop being a Doormat. NTA. Kick her out", "NTA.\nI would pay willingly in that sittuation, I would never expected even a family member to upkeep my adult butt+ a kid.\n\nMy sister just moved in with me and my husband with the knowledge that she will be staying what is my husband's office/our guestroom.\n(She only needs it for 2-4 days a week due to her studies, and did not feel like paying nearly a thousand euros for a single room apartment she did not stay than those 2-4 days a week.)\nAnd even she pays \"rent\" because she knows the extra person for 2-4 days a week will rank up the bills.\n\nLike in my sister's case, you asking for 500 is not as much as they would have to pay while living in their own apartment.\nIt's not a ridiculous ask.", "NTA but you need to talk to an attorney and legally evict her.  Consider a fridge lock until they're out", "Put a lock on the frig.  Then your food will not go missing.  Tell your friend, look either you buy your own food or pay the $500.  $500 in Boston is not unreasonable either.  Her choice or move out.", "NTA", "NTA", "At $500 a month you are sponsoring her savings for her new house. She now has a job, I would be letting her find her own place to rent while she saves for her house.\nNTA", "He’s not making enough money to pay you $500 monthly and you can rationalize the amount easily enough by comparing rates, but you offered your home out of kindness.  Perhaps a compromised rent fee can be discussed.", "Like this.\n500 is nothing considering you pay the food and ultilities for 2 people too!!\nNTA", "Let's not forget they have a small bathroom too. It's a mini basement apartment almost, minus a kitchen", "this is another case of acts of kindness (you) going unappreciated (her) smh. stand your ground. either she pays to help out the extra expenses you guys have from her living there or she moves out. tell her you arent a money tree growing bills off your arms.", "NTA\n\nSo can I talk to you the way a mom would talk to her daughter?\n\nThe problem with furnishing someone with a \"free\" place to stay is that it is not \"free\" for you and your fiancé.  The other problem is that when it's \"free\", the \"guest\" often refuses to pay even when they can afford to do so, and just as often refuses to leave if asked nicely.  Honestly, your generosity is astonishing.  You're a good friend, but perhaps you're TOO good of a friend.  You now have a perfectly rentable space that is filled with someone who absolutely refuses to see the value in what she is taking up, and there is no contract, either verbal or in writing, to let her know when her gravy train ends.  For her, this is a free ride with no legal end to it.  The value of what she gets is 100% coming out of the pocket of your fiancé and you.  As I said...TOO generous.  Your fiancé and you were raised to be good humans, but good humans often get used.\n\nYou're also learning why Sophia did not have anyone else to help her little family:  she probably took shameless advantage of similar situations with other families.  Does her daughter not have a father who is paying child support?    Shouldn't there be income from that person, or from public assistance?  Heck, she even qualifies for free medical care.  Money is there if she needs it to get out on her own.  But I suspect it is much more convenient for her to let your fiancé and you pay for everything.  And she is going to continue to do so until you finally get sick of it and kick her out.  Yes, it's coming.  You probably suspected it the moment your friend balked at paying $500 for the privilege of using your basement space, because she inadvertently revealed that she expects you to continue footing her bills for as long as SHE decides you should do so.  I wonder, what will happen if you tell her that your fiancé and you can no longer afford to support her, and if she cannot pay rent, she needs to find another place to go posthaste?  My guess is that she will suddenly cease to become a friend, and more of a malevolent presence in the home you pay for.\n\nMy daughter has a similarly soft heart for friends.  At times over the past 5 years, she has \"helped\" up to five people by letting them stay with her husband and her.  The result?  Those \"friends\" would not pay for rent or food, would not clean up their own messes, would not reimburse for gas or wear/tear on her car, and several of them stole everything of value that they could find when she finally kicked them to the curb.  They acted like spoiled teenagers who expected my daughter and her wife to pay for and do everything for them.  One person stole her engagement ring, and that ring is gone for good.  Another person stole jewelry that she had inherited, and several gaming systems and games that her husband had.  Again, gone for good, and probably pawned for a tenth of its cash value.  She would not have ever suspected her \"friends\" would use her and steal from her, but yeah, it happened repeatedly.  A person who is happy to live rent-free on your dime and \"steal\" that space usually has no qualms about stealing other things if they want those things.\n\nToday, my daughter and her husband have a rule:  if someone needs a place to stay, it's not going to be their place.  The last time someone asked, my daughter said, \"Yeah, that's a sad story, but we can't afford to support ourselves and you, too.  You're going to need to find some other place to crash.\"  She learned the hard way that house guests take a shockingly short time to become freeloaders who consistently feign outrage when they realize they have to pay for their own expenses.\n\nYou are neither Sophia's parent nor her keeper.  I would highly recommend first having a difficult conversation with Sophia:  telling her what public assistance is available to her, and giving her links to those agencies that can financially help her as she transitions to living on her own.  I also highly recommend consulting with an attorney, then serving her with an eviction notice.  In the meantime, put locks on doors of rooms you do not want Sophia to access, and make sure that if you have things of value, they stay in those locked rooms.  The thefts usually start when the guests realize they are no longer welcome, and when they can no longer use you with your permission.  Cheapen the quality of the foods you have at your home to reduce comfort, and perhaps invest in a mini fridge to keep in your bedroom so that if there are things you buy solely for your consumption, they will still be there when you come home.  And finally, take your cell phone and take videos of your home and its contents, including the serial number of big-ticket items, and including the contents of the basement.  When you finally get your \"friend\" out of there, chances are good that she is going to take a few things with her.  You'll need that video, along with the serial numbers, for the police report.\n\nI sincerely hope that things don't come to that point.  However, Sophia's refusal to pay rent does not bode well for your future with her, or for your friendship.", "Charge her rent,and she has to buy her own food,period . bottom line you have been more then generous.you are feeling taken advantage of.shes working now.If there's a refrigerator downstairs,then she doesn't need to eat you out of yours.", "NTA $500 is too low when you even include the food they are barfing down.\n\nHere in Germany you'll not get a flat for that low amount. At least not in the big cities. And that doesn't include power, water and heating. A student will pay that for a room alone and food still isn't covered. And this is only for one person!\n\nYour \"friend\" should pay $500 as rent and extra for food! Or you should lock your fridge and put a fridge for her down in the basement which she can fill by herself.", "I would also be wary even if she starts paying the $500/month because she’s going to feel entitled to more food and other amenities in your home", "NTA\n\nDon’t get tied up in tenant/landlord laws, just kick her out. $500/month is nothing.", "NTA she is basically stealing from you and got mad when you tried to stop it. 500 for rent anywhere is a great deal", "NTA.  Sounds like she's eating close to $500/mo in groceries.  \n\nI'd offer an alternative- she gets her own mini fridge and agrees to never touch the food in your fridge unless explicitly invited.", "NTA, should have done this months ago, she's abusing your generosity", "Bruhh the audacity of some people. $500 a month is literally so good what. NTA. Definitely enforce your boundaries and if she cannot respect your decision, then kick her out.", "$500 for rent, food, and utilities? Sign me up!!!! Your friend is a mooch. NTA. I have a feeling this attitude of hers got her in this mess in the first place.", "NTA and why does she complain? She got a rent and eat free year and still does not realize how lucky she is? Weird 'friend' you have! Edit: oh and please give us an update on what you did", "NTA and give her an ultimatum and a lease. Please check and make sure that you can legally evict her ASAP.", "NTA. She can leave if she doesn’t want to pay it. It’s unreasonable for her to not contribute when you are even providing food", "NTA - if she doesn’t like the flat fee, then tell her that she is to pay for all groceries and that there better be food left in the house for you and your fiancé to eat.  That you are tired of going to get something to eat or use on a dish only to find out that it’s all gone or just a smidge left.\nTry paying for the groceries and the additional utilities and that is probably more than the 500 that your asking for .\n\nYour mistake was in not wording it as charge for food and utilities but as rent for the basement area.\n\nYou need to have another discussion with her about the grocery situation and hopefully you can have proof of the added expenses that you have been covering for her for the past year.\n\nOtherwise, it just might be time for her and her daughter to leave.", "Tell her you will price match per square foot for an equivalent space with equivalent amenities - if she can provide the listing. This will also include the \"hidden costs\" deposits, taxes, etc. And she Will need to buy her own groceries.  I bet that will open her eyes to how little you are requesting in this economy.", "NTA\n\nI'd get a lock her kid can't get into to lock your food up in as well if kicking her out doesn't work (not sure if she's now considered a tenant or not by your state). Depending on the law you might have to serve her eviction papers to kick her out.", "NTA. her reaction tells me not only is she happy to take advantage of you, but she feels she's entitled to it. charge $500, write up a lease (make sure there are terms that protect you both), and make some house rules.\n\nif she doesn't like it, she can go pay $1200 rent (or whatever I don't live in Boston) for the equivalent space.", "YTA, but not for wanting rent. Mainly for springing it on her out of seemingly nowhere. \n\nIMO, this seems more like a \"Because we're just telling you this now, we're not going to start this month. But in the first of next month, we'd like a check/cash/money ap of choice\" situation.\n\nAnd then you get it in writing.", "Info: did you talk to her about finishing all the food and leaving nothing for others? It looks like you left it for so long the irritation kinda exploded. You basically did a 180 where it might be hard for the roommate to see this coming. Also charging her this much might prohibit her from saving and leaving (what the goal is ultimately).\nI think I would begin a conversation with her about what she can contribute now she has a job. And about her not being a jerk with your food.", "NTA. You know you are going to have to kick her out, right?", "This sounds reasonable to me", "Where I live, rent has gone up an insane amount recently, so much so that a previously $500/month unfurnished bachelor apartment w/o utilities is now $1400-1600/month. $500/month for two people in 1/2 or 1/3 of your house is incredible... __especially__ when it includes furnishings, utilities __and__ groceries!", "i've paid $2400 for a basement in boston with far less space and amenities. i also had to pay for my own food, utilities, furniture, etc.\n\n**STRONG** NTA", "I’m not sure how easy it is to throw someone out in Boston. It’s extremely difficult in NY especially a child. NTA", "NTA but I'd just end the arrangement altogether. It's been a year, she hasn't paid anything and feels comfortable enough to eat all your groceries.  No good deed goes unpunished as the saying goes.", "You realize she's never going to leave, right?   Saving up for a home at minimum wage, even if you're fully subsidizing her rent, isn't going to happen.  NTA", "INFO: does their basement room have windows? If not, I believe charging them rent is illegal in Mass.\n\nhttps://masslandlords.net/do-landlords-have-to-provide-window-coverings-in-massachusetts-2/", "Including food? For two people, 500 a month barely covers it these days.", "I've talked to her before about it. I asked her to save some or tell me when it's empty when it's empty but she just shrugs if off. And I'm charging her because my fiancé and I really can't afford to pay all her and her daughter's living anymore, however I still don't want so we agreed make her contribute a small amount.", "ThaT is insanely little to charge, right.", "I don’t live in Boston and COL is much lower in my area, but if I could pay $500 a month in rent, I would probably not still be living with my parents at 25. NTA.", "Does it have windows?\n\nBecause if I am reading this correctly, it is required for rented rooms to have windows in Mass.  https://masslandlords.net/do-landlords-have-to-provide-window-coverings-in-massachusetts-2/\n\nJust because your predecessors rented it doesn’t mean it is actually legal. \n\nIf it has windows, then great, no problem.", "Not shopping, just taking from OP's fridge ;)", "The friend will eat more when she starts paying the $500 per month.", "Lol \"starts paying\". I greatly enjoy this optimism.", "They should just put a mini fridge and a hot plate in the basement and tell Sophia that's she's responsible for her and her daughter's food from now on. $500 should only covers rent & utilities ( which is still insanely cheap). Of course get all of this onto a formal rental agreement so there won't be any shenanigans going on.", "$500??? My first basement apartment was around $1300, wow NTA", "NTA\n\nyou are definitely in the right, she and her daughter are using your space, heating and air, internet, water, electricity, and food. they should have to pay for it. you don’t even have to let them live in your house, you’re doing it out of the kindness of your heart, the least they can do in pitch in around the house", "How about $500 a month rent and they buy their own food?", "$500/month for two people is the bargain of the millennium.  \nIf she can't see that, she's got a screw loose.  \nGetting rid of the mooches will actually save you money, what are you waiting for?  \nNTA", "NTA - also will take her decades to save up for a house in Boston!", "NTA\n\n$500 in Boston for WAY more than a room. She doesn't appreciate what she has. I fear at some point you are going to have to say pay up or leave. \n\nSit her down with receipts and show what you are spending, especially on food for them that they are contributing to.", "NTA- When I saw you lived in Boston, my eyes got so wide my husband asked what was wrong. You are doing her a MAJOR turn and she is being ungrateful. Her child eats everything and she doesn't even OFFER to chip in for food? No ma'am no ham no turkey! She can give y'all $500 a month or go live in the real world. How very entitled of her!", "NTA\n\nTalk to a lawyer so you do the eviction process properly.\n\nThey aren't planning on moving out.   They will stay until they have to leave.   \n\nThey are teaching their young child that it's okay to leech off friends.  It also sounds like their family has had more than enough of them and won't let them move back in.", "NTA \n\nthrow her out already, she is abusing your kindness and it's not a real friend", "NTA and I suggest you draw up some kind of lease / tenant agreement now. I don’t know how MA works but in some states, just her having lived there for more than 30 days gives her rights so she can’t just be booted. You need to make this a formal arrangement.", "I’m originally from the Midwest and at $740 I pay the lowest rent of anyone I know because I’ve lived in my apartment for 13 years and moved in when my neighborhood was still pretty sketchy. I just took a travel assignment and am now living temporarily in East Boston for the next several months, paying nearly triple that for a short term lease. I’ve been checking out the rent in the Boston metro and I’m seeing very few places under $1500/mo and most of those are the smallest studios. Even the shared housing, usually a bedroom in a house with like, 5 other people over in Cambridge, is more than I pay for my whole 750 sq ft back home. I am shocked that your friend is complaining about $500, especially when it includes board.\n\nReally though, there is nowhere in this country right now that your friend would find a deal even close to what you’re offering.\n\nNTA", "NTA - I think everyone who rents would gladly pay $500 a month for rent, food, and utilities! You are offering her a steal, she’d be insane not to agree", "NTA- You are being extraordinarily giving.  tbh the $500 probably doesn’t even cover the food that they are eating.  I live in the Midwest where groceries are much cheaper than the NE and the price of food has gone up astronomically since the beginning of the summer.  Perhaps if 4 people are eating the groceries should be split 4 ways? \n\nAlso something else you need to consider is heating this winter.  The basement will have to be heated at a higher temperature because now people are living in it.  I can’t even imagine what the cost of heating will be this winter especially where you live.  Again maybe this should be split 4 ways.  \n\nShe has lived with you a year.  That is a long time for no rent or payments.  I love my friends but there is loving and there is allowing yourself to be taken advantage of by someone.  While Sophia has been stock piling money to “move out,” you and fiancé have been paying both their ways.  \n\nPlease sit with your fiancé and take a look of how much you living expenses increased.  Then look at how much Sophia has paid in to you guys.  It is not a sustainable relationship because COL has increased dramatically over the last year.  She should be more than willing to pay something if not you may want to think about parting ways.  Personally I would show her the increases and what the winter heat bills will look like and come up with a realistic figure if she plans on staying if not she needs to move.  I can’t imagine the financial stress of paying for 2 more people in this economy, one of which is sounding pretty entitled.  You guys have been more than generous but now Sophia is acting way to entitled and to be frank greedy.", "NTA 500 including utilities and food is nothing, show her the average price in the area, point out you cannot afford to look after another 2 people long term and she I'd now working, she either needs to start paying her way or get her own place", "$500/month is ridiculously cheap for a room in most parts of Boston.  Source: live in Boston.", "OMG. $500 a month? I live in Australia - but I’m prepared to move and take up residence while restocking your fridge. NTA", "NTA you want to charge $500. For a furnished basement. With a bathroom. In BOSTON?!?!?! Market rent for that would definitely be closer to $2k.\n\nI'd add on the contingency of paying for any food they eat.", "Put it to her another way, either it's $500 or they move out and pay full rent elsewhere, you don't have enough money yo support them with food and utilities as well as a roof, they have pushed your expenses up beyond what you where expecting and an 8 year old child has a good level of understanding what is sharing and a heck of alot more, or is she just blaming the child so you don't go off at her for doing it, come to that why if grey live in the basement is the child unsupervised in yhe kitchen?", "NTA at all. $500 is more than fair for what you’re offering and it’s not right to sacrifice your savings for them.", "Fellow Bostonian here, $500 is nothing for the area. NTA!!", "NTA. Not at alllll.\n\nI am curious if she ever buys her own food. Was she able to get SNAP/food stamps before? A year is a long time to live rent free, especially have all or most expenses covered. \n\n$500 is totally reasonable considering it's rent and expenses. That's still a steal considering how long she paid nothing!!\n\nIf I ever had to stay with someone like that, I'd do whatever I can to buy and use only my own food and replace anything I used. The fact that she has done it frequently makes me think she is taking advantage and likely just doesn't see the problem, so charging her is likely the only way things will change or it will be somewhat fair. \n\nYou are a generous friend for letting her stay.", "NTA", "NTA. That's a great deal for anywhere in New England. Just draw up a contract or find a generic landlords rental agreement and change the things you need to. Seriously, it will save you so much trouble in the end", "If nothing else, it's motivation for her to leave.  She's eating your food and doesn't care.  \"she just shrugs us off \"  \n Stick to your guns.  Shrug her off.  It's been a year.  NTA.", "Nta", "NTA", "NTA\n\nBoston is a hideously expensive. I would happily pay you $800 a month to live in your basement. Any openings?", "Nta. Throw her out the house if she doesn't agree .", "NTA.  That's a totally fair request.", "NTA but I'm sure more than half of us on Reddit would be so excited with that deal. It's better than the one my mom gave me for living in their extra condo.", "Nta", "NTA\n\nAnd it's totally fair.  \n\nShe's eating your food with the lame excuse of 'I forgot'.  I don't see how you can forget eating something you didn't buy.  I bet she'll remember in a real hurry if you put a lock on the fridge.", "[removed]", "I live in a third word country and pay 600usd for a mini apartment in a middle class area. Lol. NTA at all. Can I live in your basement? I can pay 600usd + my own groceries :D", "Exactly, I would have made Sofia get a job and pay rent from the start.", "This, set a date and the next time you allow someone to move in set a date etc. NTA", "Also $500 for rent in boston of all places is a bargain.", "Exactly! It’s sad how you really can’t do anything nice for people these days without them taking advantage.", "Unless they are living in 1 house as roommates together in which case op can throw her out for any reason almost anytime (there’s difference if landlord lives in the same house/unit or not). But obviously op needs to check local laws.", "I’ve already seen 2 people call OP the AH for… *checks notes* expecting a grown woman to be responsible and contribute for some of her and her daughter’s expenses.", "It has windows and it's fully up to code. The prior owners rented it out so everything is covered, we just never rented it out.", "Sofia is making atleast minimum wage, if she can’t afford $500 a month then she should get another job. The OP offered this lady her home to get back on her feet, the OP has been beyond generous because that’s more than most people would have done. It’s time for Sofie to grow up, move out, and stop freeloading.", "Are fucking kidding? Why didn’t Sofia think about contributing SOME money to at least pay for groceries. But you’re right, how dare OP expect a grown woman to cover some of her and her daughter’s living expenses, the audacity 🙄", "My half of the rent is $700, plus it's buy my own groceries 🙄.  $500 for rent, utilities *and* groceries is a damn bargain.", "Probably not. Sofia doesn’t sound all that responsible to me.", "Right, and it also makes a difference that the area of the house the friend is living in is one that the house’s former owners used to rent out. \n\nThis is why speaking to an attorney is crucial.", "Yeah, I'm not in a high col area either but 500 a month EVERYTHINg included is an amazing deal and anyone who would complain about that is crazy", "Yes, it has a kitchen but the area doesn't have any appliances and it's currently being used as her daughter's living area.", "Yes, it has windows and everything need to rent. It's fully up to code, we just never rented the area out before because we were using it as a gym.", "Same!  I'm in a low COL area and I would have salivated at a nice place for 500.00 a month.", "Sounds like she and child are already finishing off what's in the fridge without replacing. Probably not hard for the OP not to overfill the fridge.", "you said Boston?! as a Bostonian, that is an absolute fucking steal. hell, if she doesn't want it ill take it. average rent in Boston for a studio apartment with one bedroom is almost $3,000. $500 for an entire basement, + utilities?? holy fuck. unless the basement is like 10 square feet, NTA at all you're practically doing charity work out here.", "NTA. A basic Google search shows that rooms for rent in Boston are starting double that... and they don't include anything. Your \"friend\" needs to get her head out of her bum and join the real world. What a leech!", "NTA. My daughter and her flatmate recently moved in with us due to skyrocketing rent and utilities in the UK\n \nThey pay £100 per month each and buy their own food. It’s a nominal amount but means it doesn’t bug us when they are using the utilities", "NTA, and you’ve been a very generous friend to her.  But if she’s eating your food and not paying anything, she doesn’t have motivation to contribute.  That’s a very low rent price for most mid-major to major cities, and utilities and groceries aren’t inexpensive.", "NTA. You are incredibly generous - you let her live there for free and even paid for their food! And now you ask very little from her.\n\nSadly, she no longer views what you are doing and the kindness and a huge favor it is: instead she grew entitled to your space and your food and - yes - your money. She's not thankful, she is a choosing beggar and I'm really sorry, but she's hardly a real friend at this point. Some people, when treated with kindness, react with positive emotions and others see this as a weakness and grow entitled and start to view you as a \"sucker\" that can be used. That's Sophia right now. To her, you are no longer a friend doing her a solid, you are a sucked that she's playing.\n\nI had a friend like that once and it's sad but you can't really know it's gonna happen until it does. I pretty much observed in real time as he re-categorized me in his mind from \"friend who is helping\" to \"a sucker! I can get MORE out of her\".", "NTA. She's entitled and rude. You need to evict her. She's not going to change.", "NTA: If she doesn't like it, she can find somewhere else to live. But she's not going to find a single room for $500 in Boston, much less an entire furnished basement plus food and utilities for $500/month. You're being quite generous.", ">I've already cut into my wedding and vacation savings to cover their costs.\n\nWhat happens when those are used too? She already feels entitled to take whatever food she wants and doesn't even bother letting you know it's all gone. Now with paying rent - assuming she actually does - will she feel like she can waste food, leave the lights on all day, etc. and you will need to pay more to keep her there?\n\nI hope she thinks about it and understands your position and realizes how much she is benefitting at your expense. I worry she will be angry and choose to view it as she is simply using a space that you don't even need and now you are trying to use her struggle to take her money. \n\nBe careful. Find out what your rights are and try to protect them. What are your legal responsibilities and rights if you decide they need to leave?", "NTA, but follow through with plans outlining stricter rules on what can be eaten/used etc if she doesn’t pay. If she can’t pay a cheap rent such as $500/mth, let her go pay for her own apartment rent, which I’m sure will be much much much higher. I say this coming from a low cost of living area and there not being any even 1 bedroom apartments for anything less than $550-$610/month", "$500 a month in Boston is dirt cheap. NTA.", "NTA  Living rent free for a year?  She wants to live rent free until she can save up for a \"home?\"  You'll be attending he daughter's wedding before that happens with her working at Starbucks.  \n\nYou are being reasonable.  You need to provide her this requirement in writing.  Set a specific date and have her sign it.  If not, give her a date to go.", "NTA... Can I come live in your basement? I'll pay $600 a month and pay for my own food! 🤣", "NTA. If you want to be incredibly soft tell her she needs to get her own fridge and cooking supplies/pantry items. She can continue to use the stove, etc. But she also needs to pay half of the utilities. That will come out to less than $500/month.", "$500 including food, bills, rent, and it’s furnished with her own private bathroom? Once you kick her out can I move in?", "Umm. I’ll come and live in your basement for $500/mo and I’ll even buy my own food. That’s a dang STEAL she should be kissing the ground you walk on.", "NTA-She is living in dreamland and she is \"using\" you. A real friend wouldn't do this. I'd get the eviction process ready.", "NTA. \n\nI dunno if charging rent is a good idea. She’s already a mooch, my guess is Mass has some pretty intense renters right laws.", "NTA\n\nShe is a roommate. As you said. If you're in effect buying food for her and her daughter, as well as toiletries and other sundries, there's literally no reason not to charge them rent.\n\nIf she's complaining about $500 a month, kick her out and let her find accommodations in the area. I have no clue what the market value would be, but I imagine it's probably more than that. And she'll have to pay utilities as well as her own food bill.", "NTA just give her the 30 day notice.", "NTA.  I suggest you and fiance invest in a minifridge, not for you but for Sophia to use for her groceries.  That way she can't 'forget' about what food is her and what food is not.  And $500 is a very reasonable price for 2 people taking up an entire floor in your home.", "NTA. I would say $500 for two people is probably not enough to cover what they are actually costing you to stay there if you are allowing them to eat your food. My FIL lives with us, has his own \"studio apartment\" minus a full kitchen with an attached bathroom and pays us $600/month. He has dietary restrictions so usually provides his own food, though we do sometimes make dinners that he can and does share with us, and we pay for everything else - electricity, internet, cell phone, we do his laundry, oil, etc... and honestly, the $600 is probably not enough, but he's family and on a fixed income. He also tries to contribute - we are going away for vacation in a couple weeks and he will be taking care of our animals, he tends to our garden and does our lawn mowing in the nicer weather. All that to say, he's not just a mooch who is living with us and eating us out of house and home. I would stick firm to the $500, and tell Sophia if she doesn't like it, she can go find somewhere else to live for a better rate (which I guarantee she won't be able to - I live in the middle of nowhere in NH and even around here, you can't find a studio/one bedroom for less than $1100+/month).", "NTA. She cant expect to live in your home and be fed for free. Those things cost money. If she doesnt agree to/pay the rent then tell her she needs to move out. Its unfair so expect you to financially support herself and her child.", "$500 for a furnished basement apartment in Boston that’s big enough to fit two people and includes utilities and food?!? That’s a DEAL. \n\nNTA", "NTA. She absolutely needs to start contributing towards the household, if only because at the moment she seems completely inconsiderate of everybody else. I don't know what COL is like in Boston but accommodation for two for $500 a month including all bills and food sounds like a pretty sweet deal to me. \n\nBut it sounds like it might be a good idea to put a time limit on things now, and give them something like six months to move out.", "NTA. What’s worse than living in a basement is living out on the street.", "NTA I would charge my adult children that.", "$500 in Boston?? You guys are so generous NTA", "NTA and I would have her leave ASAP if she’s there too long she can try to claim tenant rights and you’ll have to formally evict her, she’s clearly a user and will take all the advantage of you she can", "This. OP, I think you need to decide if you want them out or want the money more. If you just want them out, tell her you heard her loud and clear, that $500 is too much for her, but that you can't afford to support her any longer. Give her 30-60 days to find another place. $500 is A STEAL right now, in almost any place. I can think of three people off the top of my head that would move in with you right now. This woman is being entitled and ungrateful. I wouldn't have even offered $500. $500 is NOTHING. It probably doesn't even cover the cost of their food monthly, OR the increase in the utilities. NTA.", "You are removed from reality if you think someone would just pay for all of the living expenses for 2 people until she saves enough for a house. She can see if she can find another to place to live that covers all the expenses for her and her daughter for 500 a month.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I was thinking \"where do they live that $500 is too much\" and then OP dropped \"Boston\" in there and I laughed out loud.\n\nOP, you've been and are still being an amazing friend but at this point, she's unapologetically using you. It's probably best if you just outright make her leave tbh. NTA", "In BUFFALO, NY and 500 for rent and utilities, even without food and furniture, would be a steal. NTA.", "$500 including food in Boston... with my daughter? \n\nSign me up! I'll take next August. \n\nThat is an amazing deal. Op needs to give her an official month to month lease to sign and either pay or vacate. Or ask her to leave now... since she has a job finally.\n\nWhen you use something up... just add it to the list. It's so annoying to be out of something like ketchup after returning from the grocery store. I'm lazy and totally use the Alexa add to list by voice when I use something up. I can shout it out in the moment while cooking and bingo... it's on my grocery list. 🤪", "[removed]", "I live in a town in rural WI and that is AMAZING rent.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "right. for like $200 bucks, they could set up a mini kitchen of a microwave, hot plate, mini fridge and a countertop and basically be this is your kitchen.\n\nSo this is where you store your food and we'll store our stuff upstairs.\n\nAnd yeah, still charge rent. Cuz it feels like her friend feels like OP is obligated to provide her whatever she needs. And OP isn't- OP is being nice but isn't obligated to.", "Sprinkle some salt on that leech and she should pop right off your back!\n\nNTA", "NTA\n\n$500 is a deal here in my Midwest college town, much less BOSTON! Friend needs a reality check and this is it.", "NTA - It's not enough that you're giving them a place to live?  You're also paying for her and her kid's food???  \n\nShe's incredibly entitled, ungrateful, inconsiderate and rude.  I'd be giving her 30 days to find another gullible host.   $500 is ridiculously low considering she and her kid probably eats that much.", "NTA. I’d kill for that rent level and accommodation in Boston are you kidding me? Tell Sophia to lookup the same accommodations on any renter website", "$500 for a basement unit **and** board is a struggling single parents dream. NTA", "NTA and she sounds like a real charmer!!  You are being a kind and loving friend; $500 is extremely reasonable for any part of the country now a days especially when this also covers food, shelter and utilities.  Questions for you though: 1. Where is the child support for the child?  2. If no child support, why no state aid? 3. Food Stamps or financially assistance, even emergency $$$ can be given by the state 4. Working at starbucks is not going to afford her rent", "NTA. Renting a room in Boston is easily $1,000/ month. You're essentially asking her to pay for her own food so you aren't completely supporting her. I understand she's going through hard times, but you aren't responsible for supporting her.", "NTA! $500.00 is a bargain. Sophia is being a parasite.", "NTA. I think that is a great price. She was lucky to have free rent for so long. She can help out with expenses.", "NTA. While offering her the place to stay was a nice thing, she is now mooching off you in regards to food and such. It sounds like she is not contributing anything back towards the groceries. Assuming she is working full time(ish) and bringing home biweekly checks with 70 or more hours on them, she can afford the 500 and still save for getting on her own.\n\nStarbucks in my area pays around 14-16/hour starting pay, plus tip-share. This is not great, but can still allow that level of responsibility. If the Boston area pays higher, then even more so.", "NTA she should be offering you money rather than you having to ask her for some.", "NTA\n\nWhoah......500 a month for rent, ulitities and food in Bahstahn?!?  That's real dirt cheap!  Sign me up and I'll be there in 2.5 hours, LOL.   My suggestion to you is tell her go and look for a place less than 500 dollars and get back to you to tell you how much are the rent in one or two bedroom apartment.  She'll sing a different tune. And also, tell her to go grocery shopping and see how much they cost for a week or a month whatever.  Again she'll sing a different tune.", "NTA.  If she can forget and not think about it, maybe $500 a month will help her memory of taking advantage of someone helping her and her daughter out and keeping them from being homeless.", "NTA.  Hey, I'd jump at the chance to pay $500 for that situation.  You may need to look into getting your friend out of the basement if she won't even pay this nominal amount.  Also - is the agreement that she can stay until she saves up for a house?  Because that's like 500 years of Starbucks employment, right?", "NTA. She shouldn’t be using your groceries or eating your food at all. I get that you were trying to help her out and she had no income, but she should have been paying something towards food and utilities (or going to a food bank or other assistance program if she wasn’t able to pay). You and your fiancé are already doing a massive favour by giving the 2 of them a place to stay, you shouldn’t be covering all of their expenses. \n\nIs it a basement suite, or part of your living space? If it’s separate they shouldn’t be coming in to your kitchen at all. If the kitchen is shared then you should start labeling food or assign a shelf/part of the fridge and cupboards to her (or put a mini-fridge in the basement). Make sure that you tell BOTH of them that they are only allowed to eat their own food, and make her pay you back when they “forget.” It’s fine to share the occasional meal (if you’re okay with that) but there’s no reason that you should have 2 extra mouths to feed, especially if she’s working again. There are usually benefits available to single parents with low income, so she should be applying for whatever help she can get. If she can’t afford to buy her own groceries AND pay you a little bit of rent, she is never going to be able to afford to actually move out. She needs to start budgeting and planning in a realistic way, and this could be a good first step to getting her out on her own.", "NTA. I'm shocked to see you're dipping into your own savings to support this \"friend.\" It's time to look into the residency laws in Boston to find out how much notice you need to give her to move out. Then present to her in writing that she either starts paying $500/month on X date, or she moves by Y date.", "NTA. She's living rent free, utility free, and not paying a dime for food, while she and her daughter eat everything at sight. It is reasonable to charge them for rent, but you wouldn't be able to use the  basement since it would be \"her\" property, or at least she would be paying for it. \n\n\nAnd as other peers have said, If she doesn't agree with this, then give her a deadline to leave and find herself a place to live (which she will obviously need to pay more for rent and will end up agreeing with you and your fiancé)", "Likely NTA.  \nWhat is the average rental prices on a 2 bedroom apartment in your area? Only reason I ask that is to gauge where the 500 sits in comparison to that(plus utilities/etc).  \n\n\nIn general though the point they are basically treating the lodging as a bed and breakfast is showing they're trying to mooch as much as they can.", "I didn’t know houses in Boston have basements now. More likely you’re in a gateway city and $500 *is* a lot for a basement apartment, however with the food costs factored in I am gonna go with NTA.", "I will. My step aunt  is a real estate attorney, I'm meeting with her today to work the situation out.", "Oh I’m sure. I pay $1,780 a month for a 1 bedroom 1 bathroom in Orlando and that’s just rent.", "Thing I hated most about a basement roommate was using our kitchen. Absolutely I'd be throwing in a hot plate and cheap used fridge or something to keep them out of our kitchen. They can also buy their own toaster or toaster oven and whatever else...\n\nBut definitely charge the rent regardless. I'd never let anyone stay rent free in my house. If she thinks it's too expensive, then it's time for her to go and find a more reasonable place to RENT. and she won't.  Definitely NTA\n\nEdit. I'd gladly do the mini kitchen also the keep them in the basement and not using your house at all. No one using your TV, using your bathroom or kitchen, using any of your space. Absolutely detest the thought of having another person wandering around my house.... I'd love to have a house with a separate entrance to really put up space, but giving them the basement and expecting them to live and stay down there most of the time is fair in my books.", "cuz yeah, that's my problem.\n\nshe's been living with you expense free for a year and she's all \"how dare you charge me rent.\" all i've been doing is costing all sorts of extra money in food and utilities for you to house me and my child, while we've obviously been the easiest guests to have have ever.", ">  She freaked out and complained that this was an insane amount to live in the basement   \n    \nNTA, look up other basement rentals in your area, find the market rate.  Let Sophia know you will be charging market rate + utilities, and that you will clear a space for them to put food in the fridge and a cupboard.  That food is no longer shared, for them or their daughter, and a year is more than generous for free rent and food.", "NTA but definitely look into the tenant laws in your area, as you might be looking at legal action to remove this \"friend\".", "She has lived for free with you for so long that she feels entitled to your stuff. I doubt she will pay, and it will be a problem every month to try to get a little money from her. NTA, but you need to make some tough decisions on how long you can support them/", "NTA, she should be relieved to have a nice place to live in Boston for only $500, especially since she and her daughter are rudely eating all of your food without replacing it.", "YWBTA if you don't follow thru with this 100% to yourself and your fiance. This is abuse plan and simple.", "YTA. For moving her in your home in the first place.", "Ungrateful.\n\nCan I move in OP?\n\nI'm a wicked cook!\n\nNTA", "NTA - she can pay or get out and learn what it actually means to pay rent.", "I'd be very careful of putting anything in writing. Even texts. Legally speaking you could really screw yourself over. This basement doesn't sound like it could be inspected, approved and legally rented. You could end up owing her money if she had it inspected and filed against you in court. Remember, no good deed goes unpunished. The hotplate idea is a really bad one. What happens if there is a fire. Tell her you need your basement back and give her 60 days to leave.", "NTA - $500 is a STEAL for two people.", "NTA, seems fair, especially after a year of no rent.  They are always welcome to move somewhere else.", "NTA, $500 to live in Boston? Can I live in your basement??", "Omg I’ve heard of parking spots that cost that a month in Boston!! That’s a ridiculous deal she should feel lucky for!! Time she finds a job, a man, or another friend she can use!", "NTA.  When you are living rent free you should be more considerate of things.  If she was buying groceries or contributing to the electric bill, I would be more lenient, but as far as I can see she's paying nothing.  $500 a month is a steal for a studio apartment like set up where you are not paying for food or electricity/gas.", "500 dollar studio apartment? Sophia sounds like a gift-horse-mouth-looker type", "NTA\n\nDid she not work for the past year?  In a year, she ought to have been able to save up enough to pay for her and her daughter's food, as well as first, last, and a security deposit.\n\nHow is she going to save up for a house on income from Starbucks?  With you subsidizing her entire life.\n\nWhy are you allowing yourselves to be used?\n\nI'd start the eviction process.", "> $500/month will barely cover food for two people\n\nwhat the fuck are you talking about?", "But then she wouldn't have the endless supply of food paid for by someone else's bank account!", "> throw her out if she doesn't agree\n\nNot disagreeing but OP is now a landlord and will have to legally evict her so 'throwing her out' is maybe not the best phrasing here", "And they’ve been living rent free for a year. This lady is delusional lol", "$500 in Boston is incredible. My partner and I are looking around and haven’t been able to find anything in the Boston area for less than $1800. Thankfully his parents have decided to find a new house and are letting us have their house for $1000 a month.", "NTA\nHer reactions to you bringing up eating all your food and the rent basically tells you that she's become entitled to what you've been giving her and is out of touch with reality.\n$500 is still a gift. \n\nBut based on her reaction, I'd be like \"Hey, you've stayed with us for no cost for a year. You have eaten our food with no contribution. We thought $500 would be a doable number but on second thought, I'm retracting that offer. I don't want to fight about $500 every month. I'm going to need you to move out in 30 days. I'll send that to you in writing shortly.\"", "NTA. You are incredibly generous. 500$ is nothing for housing and food costs for an adult and child. Your friend is abusing and disrespecting your incredible generosity and kindness. She is ungrateful, entitled and delusional.", "NTA. You are being completely reasonable and no, she's not \"forgetting\" to chip in while her and her kid eat all your food. She is taking advantage of your kindness.", "NTA. $500 is a beyond generous amount of rent to charge someone who is living in a fully furnished suite and eating all your groceries. $500 wouldn’t even cover half of my groceries for a month in my family (me, husband and toddler). Sophia is lucky to have a friend like you and has zero position to be complaining about this.", "NTA", "NTA. If this is a problem she should find somewhere else to live. Get an eviction order in process.", "NTA she either pays rent or leaves period", "Let her know that she can pay the $500 or get out.", "NTA. The fact that she’s been eating your food is wild. If I were her I’d be buying my own food and necessities and doing as much housework to help out - literally the least she could do."]}