{"id": 16664, "submission_id": "13b6gh6", "title": "AITA for saying my sister should have waited until after our brother's wedding next month to get married herself?", "selftext": "Am I the asshole here, or is my sister?\n\nOne of my brothers is getting married next month. He's had a longer than average engagement of over 2 years because the pandemic created so much backlog in the wedding industry here and some deposits were already paid. One of my sisters actually met her now wife through my brother and his fiancée. My sister's wife is a distant cousin of my brother's fiancée and is a bridesmaid.\n\nI accidentally found that my sister and her then girlfriend/now wife got married this week. They have been together for 2 years so them getting married isn't unusual. But they did not tell anyone. It was a last minute same day decision. They only people who knew before I found out were the people at the registry office. There is one photo and few selfies. They didn't buy rings until 2 days after the wedding. My sister says they didn't want a big thing and they didn't want to upstage our brother and his fiancée. They are planning on telling everyone after my brother gets back from the honeymoon. Him and his fiancée are leaving right after the wedding to go to Hawaii over in America and my sister said they would announce after our brother gets back. My sister also said they don't want a party or gifts or anything else wedding related. It will just be an announcement.\n\nI still think they could have waited until after our brother's wedding. It was only a month. I feel like it will still be upstaging my brother and his fiancée even though my sister wouldn't be telling anyone until after the honeymoon. I don't see why they couldn't have waited for a month. My sister thinks I'm the asshole for saying that and I think she's the asshole for not waiting a month.\n\nI would never tell their secret. No one will be mad that they got married without anyone there or that they don't want any wedding stuff. They have been together for 2 years so no concern about it being too quick. No one dislikes her wife. It will ruffle feathers because they did it a month before my brother. My brother and his fiancée will be especially unhappy and I don't blame them. The only problem is that they didn't wait a month until after my brother's wedding.", "created_utc": 1683501601, "permalink": "/r/AmItheAsshole/comments/13b6gh6/aita_for_saying_my_sister_should_have_waited/", "score": 70, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think my sister should have waited until after our brother's wedding next month to get married herself. She thinks I'm the asshole because they don't plan to announce it until my brother returns from his honeymoon and don't want any wedding gifts or parties. She says I'm being overly critical because her and her wife didn't tell anyone yet.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "So let me get this straight. \n1. Them getting married is not a surprise.\n2. They are being respectful by not making brother's event about them\n3. They don't want to even announce it a full month before his wedding for fear of it overshadowing his day.\n\nSo....you care why? Be happy for people and don't be an AH. \n\n\nYTA", "YTA\n\nYou are just looking to create drama where there is none to be had.", "YTA. How on earth can it upstage someone else’s wedding when literally nobody knows about it? You’re being ridiculous. They decided to privately get married and took care not to overshadow the other wedding that was already planned. Butt out and simply congratulate them.", "YTA. They did it alone, quietly, barely took pictures, insist on not saying anything until after the honeymoon, and acknowledged that they don’t want to upstage the other couple.\n\nI don’t understand how you see anything wrong here. What is this really about lol.", "YTA.  I think your sister and now SIL went out of their way to make sure that their wedding didn't in any way take the focus off of your brother's upcoming wedding.  As you said, you accidentally found out.  When they do announce it after your brother returns from his honeymoon, DON'T say anything about thinking they should have waited.  There will only be drama if YOU create it  Butt out.", "YTA. They've gone out of their way not to inconvenience anyone & not to upstage anyone. That's their obligation, as loving and considerate family to your brother, and they're fulfilling it. \n\nIf they want to get privately married, that's their own business. And as a loving and considerate family member, you should support their desire to pursue their own happiness at their own pace in a way that doesn't actually harm anyone.", "I don’t see a problem here. Why does it bother you they got married before and not after? It makes no difference to anyone besides them since no one else will even know until after the honeymoon.\n\nYou seem to think your brother will be upset, but will he? Does he react dramatically to things like that?\n\nYTA if you try to make your sister feel like she did the wrong thing.", "YTA.\n\nThey had the kind of wedding they wanted. They chose the best time for them. \n\nWhy does it matter that it was before someone else’s wedding?", "YTA.  The only feathers ruffled here are yours.", "YTA \n\nIt doesn’t impact your brother in any way and they’ve been completely respectful", "Why should they wait? They did a legal transaction to secure their partnership,  and asked for ZERO fanfare in the doing. \n\nYTA.  Keep your comments to yourself,  celebrate your siblings ' happiness and go on your way.", "YTA. it's not your decision when they decide to get married. they kept it a secret, - are keeping it a secret. you accidentally found out. they are planning on telling everyone after your brothers back from his honeymoon. so how on earth is that upstaging. you're being very unreasonable", "YTA and obviously have no real problems if this is what you concerned about. Weirdo behavior", "Yta, people don’t have to get married on anyone else’s timeline.  Your brothers wedding doesn’t take precedence over people living their lives.  They did it quietly and aren’t making a big deal about it so as to not take away from brothers wedding anyway.  You weren’t suppose to find out this soon anyway, so what’s your issue here?", "YTA. Sounds like they did everything they could to make sure they don’t upstage your brother while still having the wedding they wanted. Then they trusted you with that secret and you judged them.", "YTA.\nThey're not announcing it so they don't intrude or take away from the brother and his bride. They simply wanted to get married privately with no fuss and did so. More power to them.\n\nYou don't have the position or the right to get pissed off on behalf of other people. Suck it up. ♦️", "YTA - How on earth does their marriage affect your brother's marriage at all? People can be happy for both. We chose our wedding date and shortly after one of my husband's family members decided to get married the day before us. Miracle of all miracles, we still enjoyed our wedding, and his family was still happy for us. I do not understand this type of thinking at all. I think it is appropriate to not announce it at his wedding, but it would even be fine to let everyone know beforehand.", "Yta so pretty much no one knows, they aren't announcing it until after, and you found out by *accident*.\n\nSTOP CREATING DRAMA.", "YTA \n\nUnless they announce it *prior to* or *at* brother’s wedding, it is **not** them upstaging anyone. \n\nIt sounds like you’re projecting. Don’t be an AH, just leave them alone and let them enjoy being married. They aren’t hurting anyone. \n\nIf your family love them, then when they do announce it, everyone will be happy for them. Well, everyone *except you* because in your mind they’re doing it out of spite to upstage brother/SIL.", "YTA There is absolutely zero reason for them to have waited, especially if they’re not even telling anyone until after your brother’s wedding.", "YTA\n\nThere is no issue here other than you creating drama out of a non-issue.", "I N F O: how is them deciding to get married and then waiting for a period of time after your brother’s wedding to announce it going to affect anyone at all?\n\nThey wanted to get married. They did it with no fuss, no ceremony. They don’t want to upstage your brother so they’re waiting a respectable amount of time to announce it to everyone else. Seriously, how is this a problem? Why will your brother and his fiancée be unhappy?\n\nYTA", "YTA-They aren’t upstaging anyone. They had a quiet, discreet wedding and are only telling everyone well after the fact. There was no reason to wait a month.", "YTA\n\nAre you one of those drama loving people that can’t seem to handle drama free life? They haven’t done anything wrong and are being completely mature and respectful of your brother’s big day. Stop trying to find drama where there is none.", "YTA. I never understand why it's expected to postpone your happiness, arrangements etc. for other people's arrangements so that you don't outshine them. They wanted to get married and they did, congratulations to them. It's not like they planned this big wedding or reveal with the intention of outshining your brother's day. In fact everything points to the opposite of it. It's a nice gesture of them to want to keep it a secret because of your brother's upcoming marriage (they are planning on waiting until after the honeymoon which is extra considerate) but even if they didn't they wouldn't be assholes to me.", "NAH but if you plan to blow their cover and put them on blast telling everyone they got married then you would be YTA. \n\nLet them have their secret chill no frills marriage, they are intentionally NOT trying to steal any of the spotlight from your brother and were not interested in having the same type of wedding/celebration as he clearly wants to have w/all the planning pomp and circumstance. This doesn’t feel like it’s that deep at all", "Why would it have been any different if they did it two weeks after the wedding? \nHonestly NAH. You’re all entitled to your opinions. Quite honestly I fail to see why this should cause any drama.", "NAH. You are probably projecting too much. I still don't get how you can be married so fast (Europe requires tons of paperworks) but it is up to them.\n\n\nAnd your brother and his soon to be wife may not even care that much.", "It is a weird thing to do tbf. Odd situation. Think you were justified in saying they should have waited.   \n\n\nWho else from your family knows and how did you find out?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAm I the asshole here, or is my sister?\n\nOne of my brothers is getting married next month. He's had a longer than average engagement of over 2 years because the pandemic created so much backlog in the wedding industry here and some deposits were already paid. One of my sisters actually met her now wife through my brother and his fiancée. My sister's wife is a distant cousin of my brother's fiancée and is a bridesmaid.\n\nI accidentally found that my sister and her then girlfriend/now wife got married this week. They have been together for 2 years so them getting married isn't unusual. But they did not tell anyone. It was a last minute same day decision. They only people who knew before I found out were the people at the registry office. There is one photo and few selfies. They didn't buy rings until 2 days after the wedding. My sister says they didn't want a big thing and they didn't want to upstage our brother and his fiancée. They are planning on telling everyone after my brother gets back from the honeymoon. Him and his fiancée are leaving right after the wedding to go to Hawaii over in America and my sister said they would announce after our brother gets back. My sister also said they don't want a party or gifts or anything else wedding related. It will just be an announcement.\n\nI still think they could have waited until after our brother's wedding. It was only a month. I feel like it will still be upstaging my brother and his fiancée even though my sister wouldn't be telling anyone until after the honeymoon. I don't see why they couldn't have waited for a month. My sister thinks I'm the asshole for saying that and I think she's the asshole for not waiting a month.\n\nI would never tell their secret. No one will be mad that they got married without anyone there or that they don't want any wedding stuff. They have been together for 2 years so no concern about it being too quick. No one dislikes her wife. It will ruffle feathers because they did it a month before my brother. My brother and his fiancée will be especially unhappy and I don't blame them. The only problem is that they didn't wait a month until after my brother's wedding.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA People getting married get ONE day.", "Anybody finding fault with how they handled it is someone looking to find fault. YTA.  There is nothing IN YOUR FACE about what they did. Wouldn’t be surprised if you let it leak ahead of your brother’s wedding.", "Right it was your brother's wedding month so obviously....\n\nThis is sarcasm. YTA.", "YTA. What they did has no impact on you at all.", "YTA. Who cares if they got married first? They even went out of their way to not upstage your brothers wedding and take the attention away from him and his fiancé. That’s more the generous honestly.", "YTA Why can't you just be happy that two of your siblings have found love. Literally no one is getting hurt here you're upset about nothing.", "I'm not sure how this will \"upstage\" your brother's wedding if no one knows about it until afterward. This is a lot of fuss over nothing. YTA for making it a big deal when it's not.", "YTA. And such a busybody.  Why do you feel the need to insert yourself and your opinion into something that is none of your business?", "Just because you have an opinion doesn't mean you should share it.  Your sister got married when she did so, your brother had his special day.  If you can't say something nice keep your mouth shut. What did you gain by sharing your opinion? All you did was make your sister feel bad to make yourself feel superior. Shame on you", "You are overthinking this.\nDo not worry about things that don’t concern you AND have not yet happened.", "YTA.", "Are you trying to create some sort of family argument or rift?     Your brother and fiancee do not own all the whole months around their wedding.  Other people can do whatever they like during that time,  and these 2 did.  Quietly, respectfully and privately.", "You’re unbeatable. YTA. Nothing even happened lol stop", "YTA, there is no reason that they should have waited on someone else's wedding.", "YTA\n\nThey are just weddings. Wedding don’t need months to celebrate. Family members can get married back to back it does not matter. Just more things to celebrate. \n\nJust wait until they get all have children around the same time. Ahhh the horror.", "YWBTA. They literally said they would wait to announce until after your brother gets back. So what’s got your panties in a bunch??? Let them be happy and be happy for them!", "YTA. \n\nYour brother is getting his day, uninterrupted, no one is distracting from hit. They're even waiting until after he's back from the honeymoon, so totally outside of the \"wedding window\" to announce.\n\nIf they had waited a month, the result would still be the same. \n\nAlso you're projecting/assuming a lot about how other people are going to react. If everyone goes through the wedding having no idea, totally happy, how will this information, in retrospect, alter anything for anyone?", "YTA.  How is it upstaging your brother and his fiancee even though your sister wouldn't be telling anyone?  Why do you even care?  Your very 'reason' for caring is empty unless someone tells your brother, and your sister isn't.  So unless you're planning on doing it, there's no problem....right?", "YTA,as far as I’m concerned the night your wedding ends everything is fair game. People wanna make engagement announcements? Sure. Baby announcements? Go right ahead. Come out as LGBTQ? Heck yeah! Once your wedding is over the world continues turning and lives move on. Your sister went above and beyond to make sure they didn’t “upstage” your brother. Why is a “month” such a good amount of time to wait? It’s very arbitrary and everyone has different opinions on that. I get family can sometimes get salty about a surprise marriage, I understand that but if they are upset because of them not waiting long enough to announce I think that’s pretty shallow. Just be happy your siblings both found people they love.", "OP should get married in an even more secret way to upstage his sister's secret wedding... then we will really know who is TA.", ">1. Them getting married is not a surprise\n\nIt was a big surprise. They weren't even engaged. I said it wasn't UNUSUAL because they have been together for 2 years. It's not like they have only known each other a couple of months. But it was a big surprise to me. I nearly fell off my chair. When they announce it everyone will be shocked.", "This is what I came to say. I literally cannot understand what the problem is.", ">I would never tell their secret.\n\nI would never blow their cover. I think they should have waited but telling their secret would definitely be an asshole move.", "We are Canadian, not European. In my province you can get married the same day you get licence.", "How is it weird? Genuinely how is it weird lol.", ">They only people who knew before I found out were the people at the registry office.\n\nNo one else knows besides me.\n\nI found out because I went over to their apartment to help the 2 of them make the centerpieces for my brother's reception. They were wearing their rings and I noticed and asked them. This wasn't the first time I've seen them since Wednesday when they got married but they don't wear their rings outside their apartment. It was a surprise.", "What difference would waiting have done?", "Has it occurred to you that you might be a tad more dramatic than the average person in your reactions to things?", "Cool, then people can fall out of their chairs when they announce it after your bro's wedding. They are being beyond respectful with how they're handling it, probably because they are aware of the shock.", "People might be a bit surprised, but it won't be a big shocking thing unless you make it one yourself.\n\nJust think, you hold the power to control how their news will be received. If you lead with a \"Congratulations! That's lovely news!\" more people will be inclined to do the same, making it a positive thing for everyone.\n\nThink about it.", "So what?", "I’m curious why they should have waited? You haven’t given a good reason. Your only reason is because you think they should have waited. And that’s ridiculous.", "It's weird because brother is getting married, sister is already married and OP needs some of that sweet, sweet spotlight action.", "Seriously. She didn’t almost fall off her chair.", "I’m cracking up at the idea of multiple falling off of chairs like iguanas out of trees in cold weather.   \n\n\nPeople really need to get a grip.", "Thanks for this comment lmao, I had to explain this whole post and comment thread to my roommate because she wanted to know what I was cackling about", "YTA - People get married all the time.  They haven’t done anything to upstage your brother’s wedding which is still over a month away.   In any case it’s done.  What’s the point of looking for drama now?", "YTA stop pissing in their cornflakes", "Something about mountains and molehills. Get over yourself. YTA", "YTA\n\nWhen someone gets married, the correct response is almost always going to be “congratulations”.  You can keep your other opinions to yourself.", "YTA. It's their wedding, their money, their ceremony, their choice. Just be happy for them.", "First, YTA. Second, how would you even know it would upset your brother? It sounds more like you're stirring up drama in their business instead of respecting how they want to do their own thing. What does it matter they got married in a courthouse and didn't have photos? Not everyone wants to spend money on wedding stuff and stress. They love one another and did things their way. Not your call to get on them just because it doesn't fancy the way you expected it to be.", "First of all, peoples lives don't grind to a halt because someone they know is getting married. Weddings happen every damn day, all over the world, nobody's life should be revolving around someone else's wedding. That's the most narcissistic bullshit, I swear. Secondly, PARTNERSHIP is important,  COMMITMENT is important,  MARRIAGE is important,  but WEDDINGS. ARE .NOT .THAT . FUCKING .IMPORTANT . And thirdly, why the fuck are you getting offended on somebody else's behalf? If your brother is old enough to get married, he's old enough to fight his own battles.  IF  he has a problem with her getting married first, then that's their issue to work out, and actually not your business at all. Butt out. YTA", "YTA. Their secret wedding can't upstage your brother's wedding unless you spill the beans.  That's why it's a secret.\n\nYou're making a big deal over nothing. Stay out of it.", "INFO: Because others have asked and it doen’t seem you have answered yet:\n\nIf nobody knows about it, you’re not planning on blowing their cover, and they don’t plan to tell anyone until after your brother returns from his honeymoon specifically in order to not steal his thunder, then WHAT is the actual issue here?\n\nHow can you upstage someone else when they know nothing about it in the first place? That makes no logical sense.\n\nWould you still feel the same if you hadn’t found out by accident, but learned it at the same time as everyone else?\n\nHow this is an upstage is baffling..", "NTA\n\nI’m looking at the comments and I get it. Objectively, they did nothing wrong. But let me tell you something, I’m the youngest of 5 and if one of my siblings did that to another, I’d think the same thing. \n\nYes, they technically did nothing wrong but they know that what they did was problematic. Which is why they’re waiting to tell them. \n\nThe brother and his fiancé will be unhappy. OP knows how their brother is, I’m guessing that sister probably knows this too! \nShe does and when confronted will say \"but we didn’t say anything so we wouldn’t upstage you! We were trying to be thoughtful!\" All doe-eyed and shit!\n\nCome on guys, anyone that has siblings knows this! Lol!\n\nIt’s \"How to piss off your sibling 101\"\n\nBut if you bring it up to Brother and future SIL, THEN you’ll be YTA!", "YTA I was full ready to go the other way but they did this in the absolutely nicest way possible.", "YTA. People's lives aren't on hold until your precious brother gets married. They're already doing the most to keep it low-key. How the heck does announcing the marriage AFTER THE HONEYMOON upstage your brother and his wife? Something tells me you and your brother are MAJOR drama queens and are known to throw tantrums when the spotlight isn't constantly on you.", "YTA I disagree with you completely. I think your sister has been very respectful in their handling of their marriage and you are not being respectful towards her. In fact you are a bummer.", "The decision to get married is deeply personal.   I think it is very considerate of them to keep it private so as not to take away from your brother’s wedding.  Lots of people get upset about elopements, though, for many different reasons.  I hope your brother surprises you and turns out not to be upset.", "It's just an elopement. They didn't even tell anyone. It's NOT that big a deal. Tell them congratulations and move on.", "YTA there’s legit no problem here, aside from you creating issues where there isn’t any. Good god please get a new hobby if this is what grinds your gears currently.", "Chill omg. Yta", "Nobody expects anyone to wait in line to live their lives. That’s your opinion, telling it to your sister/newlyweds like the whole marriage is a going to ruffle feathers when they explicitly don’t want a wedding is totally inaccurate and so hurtful. They confided that they eloped, you turned it into an AH moment by judging the situation through your opinion.", "Saying it louder for the people in the back. \n\n***YTA***\n\n***Grow up and learn to mind your own business, OP. They did nothing wrong and are being very considerate. Please apologize to your sister and your new SIL before you ruin your relationship with them both for good.**", "So.... what's the issue? Your sister didn't want a big ceremony, didn't tell anyone, isn't going to announce it until after your brother gets back... they didn't even buy rings yet. Why are you making such a big deal out of someone else's happiness? Jealousy doesn't look good on you. Grow up and stop playing favorites.\n\nYTA", "YTA. They did everything they could to not create drama or upstage; if anyone is going to make it a big thing it’s you", "Are you the last unmarried sibling?", "Yeah YTA. They obviously don’t want the huge wedding or a big todo, so they did it quietly. She told you cause you’re her sister. Asshole move to make her feel shitty about it.", "It’s a wedding day. They get a day. What goes on in the months after the wedding day that they still need to have all attention on them? And how long is the appropriate time for others to not live their life because of two people’s special day that already happened? YTA.", "So ur worried they will upstage ur brothers wedding because.. crapping on someone’s massive life event is pretty awful… right? Except they aren’t. They have been quiet and respectful and are letting them have their moment. Who cares when it happened, it happened and it’s amazing for them. Let them enjoy their happiness without raining on their parade!", "I like how OP is just assuming that everyone will be mad about the sister getting married.  Honestly there’s nothing wrong with it; the two couples may even celebrate together.  The sister is in no way upstaging the brother’s marriage; especially since she has said they don’t want anyone to make a big deal about it.  Just be happy for them and maybe they’ll do the same for you whenever you find someone.  YTA.", "And OP found out by accident. YTA", "I keep waiting for the problem, but it never came.  OP, get your head out of your rear.", "But she FELL out of her CHAIR!", "I don’t understand what the problem is. Can anyone tell me without just restating that they went first?  How is this upstaging if they are not anywhere near the stage or even in the theatre?  Please spell it out in small words. I am dense and just missing it.", "Did you consider that they may have a personal reason for getting married quickly and quietly at the time they did?   Many people will skip the long engagement because they know they want to be together and need insurance now or want to buy a home or have medical issues or any other reason (and sometimes no reason at all).   It seems like they are happy and not trying to steal anyone’s thunder—they actually seem extremely considerate.   Leave them alone about it.", "Assuming you're in the states, do you have ANY IDEA how terrifying it is to be queer here right now in so many states, maybe they got married when they did because who knows what's going to happen to us all as this country turns more and more hate and violence towards us.\n\nOr, they just decided to get married since they did not want a ceremony. Either way, they won't announce until we'll after your brothers wedding, so why do you care?", "So...?\n\nYTA", "So what?   They are free to marry, they are being very considerate about not saying anything to overshadow your brother’s big day.  What is the problem?", "What?? Are you for real? Lol yes ,yta.", "It shocks you that a couple of 2 years want to get married? I think most people would find that pretty logical.", "🤣🤣🤣", "Please explain why this is upstaging.", "Sounds more like she preferred it to happen differently to what she believes it should be done. Forget all the people actually getting married and their choices... must be done X way.", "I’m suspecting some prejudice issues.", "A lot of queer people are quickly getting married right now due to all the shit going on in the US.", "That is an amazing way of thinking about this! I love it.", "This needs to be higher. I have several LGBTQ friends who are terrified about the future legality of their marriages because of the political direction things are going. Sister and her wife did and are doing nothing wrong.", "- People really need to get a grip.\n\nPreferably on their chairs so they stop falling off them!", "I would pay money to see this happen", "Grip the chair to avoid the fall. All puns intended.", "I have to do this with my husband all the time. But explaining it is never as funny as reading it, so he just ends up thinking I'm weird and Reddit us weird."]}