{"id": 16671, "submission_id": "13bbqrj", "title": "AITA for not warning my hookup about the snake room?", "selftext": "Ok apologies for the clickbaity title but that's literally what it is. \n\nI bought a house a year ago and living alone in a 3 bedroom house, I had plenty of room to spare. \n\nI have a pet snake, a ball python, she's full grown at 4.5 feet long. She's very lazy and chill, and mostly just lays around under the heat lamps in her tank. \n\nBut when I bought the house, I decided to let her have the run of a room, since I had extra space. I sealed up the windows, door, vents, light fixtures, pretty much any crack she could try to squeeze through, and leave the top off her tank so she can roam around. I got some big pieces of driftwood and screwed them together to make basically a big cat tree for snakes, she loves climbing it and hanging out by the window. \n\n Though a lot of the time she still lays in the tank since she likes the heat lamp. I've also got a few aquariums and terrariums in there with my octupus and lizards (all very well covered to keep the snake out lol) \n\nI've also got a sign on the door that says \"no step on snek\" (this one lol https://m.media-amazon.com/images/I/518gmSwLrvL.jpg) \n\nSo with that context - I had a guy over my house for a hookup, we'd met at a bar, judge if you want lol but that was the situation. \n\nAnd for some reason he went upstairs to use the bathroom (I told him where it was) and after peeing went and opened the snake room door? I only noticed when I was downstairs getting us some waters, and he yelled from upstairs and slammed the door. \n\nHe was yelling that there was a snake in my house and I called back that I knew, that was my snake, she's chill. He came downstairs screaming at me that I should of warned him, that I was a crazy (b word) for having a snake just out in a room that he thought was my bedroom.\n\nI asked him why he was going thru my rooms anyway, I just said he could use my bathroom. He said he was looking for my bedroom because he assumed I'd meet him up there? But he was basically berating me for having a snake and not telling him. \n\nI said there was literally a sign saying the snake was there on the door, and he basically called me crazy again and walked out, saying I should have told him before he came over\n\nI felt like I didn't need to since it's not like I would have brought him in there anyway and didn't think he'd just be going around looking in all the rooms? Like that's kinda weird...\n\nAITA for not warning a guy about the snake room?", "created_utc": 1683514557, "permalink": "/r/AmItheAsshole/comments/13bbqrj/aita_for_not_warning_my_hookup_about_the_snake/", "score": 157, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I had a guy over my house without warning him i have a free roaming pet snake in one of my spare bedrooms. \n\nI might be the asshole for not warning him before he came over and letting him get scared by the snake\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, what is he even doing opening closed doors in your house?  He got what he deserved imho.\n\nETA- I’m very happy he didn’t freak out and hurt your snake.  You might want to let people know just for her safety.", "NTA.  You don't go snooping in rooms at someone's house if you haven't been invited in to that room or told to go in.  I don't think everyone is going to see that sign and assume a snake is in the room, but everyone should know not to snoop.", "It’s impolite to go snooping through rooms you’re not permitted to enter. NTA.\n\nPS. Please show us the the heat-lamp-loving little guy!!", "NTA\n\nHe wanted to show you his snake, not see yours 😂😂😂", "NTA\n\nHe shouldn't have been exploring your house & certainly shouldn't be blaming you for not giving a random hookup detailed information about what's in your home....behind a closed door...in a room that would have been very obviously NOT a bedroom within 1.5 seconds of opening the door.", "Haha this is hilarious, guy got what he deserved", "This is amazing and definitely not the asshole. As a snake owner I love that you gave your snake the run of a room. My little corn snake could definitely not have that.", "NTA.  There was a sign.  Also Snek Tax Plse?", "NTA. He made assumptions (fuck around) and found out. On a positive note, this made me laugh so hard.", "Hahahaha, I gotta say, this story is so weird it made me laugh. NTA.", "😂😂😂😂😂😂😂 Oh my Goddess this made my entire day!!!! I love snakes and they usually like me (will immediately crawl up my arm and have a snooze). Hilarious!!! \nCompletely NTA", "NTA, don't snoop, dont have to worry about the snake.", "Lmaooo I was so ready to call you TA until I got to the part where he was trying to find your bedroom because he made a gigantic assumption. I love that you have a guard snake to weed out the crazies.\n\nNTA.", "Nta, and I want snake pics lmao", "NTA, asshole got what he deserved", "wouldn’t have been an issue if he knew how to read and/or wasn’t snoopin around NTA", "NTA. Hookups who get invited back home don't have the right to snoop around. I'm sure he was curious about the sign and didn't expect it to be literal (aside: sign is awesome), but a responsible person could have asked you about it instead of poking around where they weren't invited.\n\nNo one has any obligation to inform temporary guests in their home -- hookups or otherwise -- of potential sources of drama safely kept behind closed doors where they are not given access.", "Jfc NTA.  I dated a guy who had a massive python who had his own room.  He was the sweetest boy and would join us to watch TV and everything.  If this guy is so scared of a tame snake, he’s not worth the hookup.  Also ewww that he was just going through your house. Also, where is our snek tax?!", "NTA he's the AH for entering your bedroom without permission. If he'd had permission and you didn't warn him, then you would be the AH. And I get being freaked out because it's unexpected, but he overreacted.", "NTA at all. Sign and a closed door should have been enough; and on top of it, he shouldn't be snooping.", "What a great and amusing way to keep people from snooping.  Well done!’", "NTA, he was nosy.  But I wonder if his freakout was his imagination running wild.  Like he thought the hookup was a scam and the real reason you invited him over was to feed him to the snake.", "NTA  \nYou don't need to tell him shit. He went snooping and paid the price for it. I guess this is a good thing. You got to see that he's a giant snooping ah before things possibly because serious (dating wise).", "NTA snoopers get what they get", "\"(Trouser) Snake Room\" and hookups in same sentence - makes sense lol", "NTA at all.", "NTA. He shouldn't have gone where he didn't have permission to go. Hope he remembers this lesson", "NTA I mean, you put a damn sign on the door!! \n\nHowever, he is the AH for going through rooms without invitation.", "NTA, Hookup got what he deserved. Probably scared poor snek and sneks roommates. \n\nYou are a great snek parent, pls give snek tax tho.", "NAH. When people have an adrenaline response they exhibit irrational behavior. He was scared and embarrassed. Yes, in that situation I would have flipped out too. But you didn’t do anything wrong, it was just an unfortunate misunderstandjng", "It may be worth putting a slide bolt on the door so that someone snooping doesn’t go in “accidentally”. \nThe dude should have waited for you to show him to your room instead of randomly opening doors (especially one that had a warning sign on it.) \n\nWhat’s weird is how extreme his reaction was.. perhaps snakes were a particular fear of his? \n\nIt’d be strange to go around telling someone you’re bringing home “by the way I have a snake”… but perhaps next time you bring someone home, don’t leave them to wander, and if they ask about the room explain that you keep\nIt locked to keep your exotic pets safe.", "NTA. Guy was a snoop and he got what he deserved.Also if I went to someone's house and they had an entire room dedicated to their pet snake, I would be overjoyed. Snakes are awesome and giving them an entire room is incredible snake ownership. Good on you.\n\n&#x200B;\n\nAlso, snake tax please!", "[deleted]", "NTA at all, and I squee’d when you wrote that your snake has a whole run of a room and climbing structures and so much enrichment, that lil noodle won the lottery with an owner like you! \n\nYour sign is also adorable, I need to make a sign for my room as well because I have two pets people would consider creepy (rat and a ball python, I’m rehoming the rat for my nibbling but she’s been a long-term foster).", "NTA your snake room sounds awesome", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOk apologies for the clickbaity title but that's literally what it is. \n\nI bought a house a year ago and living alone in a 3 bedroom house, I had plenty of room to spare. \n\nI have a pet snake, a ball python, she's full grown at 4.5 feet long. She's very lazy and chill, and mostly just lays around under the heat lamps in her tank. \n\nBut when I bought the house, I decided to let her have the run of a room, since I had extra space. I sealed up the windows, door, vents, light fixtures, pretty much any crack she could try to squeeze through, and leave the top off her tank so she can roam around. I got some big pieces of driftwood and screwed them together to make basically a big cat tree for snakes, she loves climbing it and hanging out by the window. \n\n Though a lot of the time she still lays in the tank since she likes the heat lamp. I've also got a few aquariums and terrariums in there with my octupus and lizards (all very well covered to keep the snake out lol) \n\nI've also got a sign on the door that says \"no step on snek\" (this one lol https://m.media-amazon.com/images/I/518gmSwLrvL.jpg) \n\nSo with that context - I had a guy over my house for a hookup, we'd met at a bar, judge if you want lol but that was the situation. \n\nAnd for some reason he went upstairs to use the bathroom (I told him where it was) and after peeing went and opened the snake room door? I only noticed when I was downstairs getting us some waters, and he yelled from upstairs and slammed the door. \n\nHe was yelling that there was a snake in my house and I called back that I knew, that was my snake, she's chill. He came downstairs screaming at me that I should of warned him, that I was a crazy (b word) for having a snake just out in a room that he thought was my bedroom.\n\nI asked him why he was going thru my rooms anyway, I just said he could use my bathroom. He said he was looking for my bedroom because he assumed I'd meet him up there? But he was basically berating me for having a snake and not telling him. \n\nI said there was literally a sign saying the snake was there on the door, and he basically called me crazy again and walked out, saying I should have told him before he came over\n\nI felt like I didn't need to since it's not like I would have brought him in there anyway and didn't think he'd just be going around looking in all the rooms? Like that's kinda weird...\n\nAITA for not warning a guy about the snake room?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA \n\nThis is hilarious.  I'm sorry about how harsh words directed at you, but the guy got what he deserved.  Don't snoop around people's houses, you don't know what you're going to find.", "You dodged a bullet", "NTA", "NTA. He had no business snooping around your house. Also, he is a total wuss for freaking out at a ball python.", "In college, I had a roommate with a snake. Tiny 14 inch snake. Mostly just annoying because she took up six plugs for that snake on my side of the room. I also thought I would be Miss Tough Lady and watch her feed a live mouse to the snake and nope I did not do that. I wanted to rescue it. Oh well. (I didn't. I know it was food.) \n\nNo dude would not come in our room. My dad refused to come in our room with the snake. All the girls wanted to come coo at the snake. I don't know. \n\nI think the dude was being nosy and he shouldn't be but realistically people are nosy* but yeah you should probably warn people not to open doors just so someone doesn't let the snake lose or harm the snake. I don't think people would see that sign and think a snake is just openly chilling. Sorry OP. I don't think you're an Asshole or anything. NTA. That is funny as heck.\n\n*I don't know if you have watched Arrested Development but there is a scene where Jason Bateman's character takes a paper bag out of the fridge and it says 'dead dove: don't eat' and he opens it and it's a dead dove and he goes, 'I don't know what I was expecting.' I feel like people might view the sign like that.", "NTA. Having a snake is such a good deterrent for snoops. You taught him a lesson. He was snooping and was caught out. I am laughing at this. Good riddance.", "NTA\n\nNoodle tax!", "NTA\n\n&#x200B;\n\nHe was an AH for snooping.", "Nta. Your snake may have saved you from getting robbed.", "NTA. One bit.\n\nHe asked to use the restroom and went into your snake's room. That's what happens when you get nosy.\n\nHis actions and reactions are a huge red flag. Better to find out now.\n\nGreat one.  I really would like to see a cat tree for a snake. And I love the fact that your snake has its own bedroom.", "He is a creep!", "NTA, btw the sign isn’t enough of a warning. But still he shouldn’t be snooping around and assuming you’ll meet him in the bedroom. Idk what all you told him, but it’s possible that was your roommates room. Or you had private stuff in there, he’s a stranger who is in your house to fuck and then get out. He shouldn’t assume shit, and wait for you to take him to the bedroom, have fun and leave.", "Ummm, I’m a lady who would be delighted if a hookup had a super cool snek to visit. Since I can read, if I saw that sign on the door I would have delightedly run back downstairs and asked if I could meet them.", "NTA \n\nSnek room is for sneks, not for Chads.", "NTA. It’s your house and he was being hella nosy. His excuse is bs, how would you know to meet him in the bedroom if you thought he was just going to the bathroom? Also it’s a hookup, not a date, why would it matter what pets your have if they were properly secured? I think you should only have to tell potential relationships about pets, not hookups. Especially since people don’t really have snake allergies (right?).\n\nYou and your snake dodged a bullet.", "Its a fair assumption that many people would look in a room or two on the way to/from the bathroom. Just to see if there is anything...weird, that would make you run for the nearest exit. We came from monkeys, and monkeyts are curious, go figure. But you took at least reasonable care to make sure anyone would know there was a snek in he room (love the sign btw!) and if you are gonna snoop, its on you if you find something you don't like. \n\nNTA", "I agree with this. For her sake, maybe add some extra signs, and add something to the door handle to *really* let people know not to freak out if they so dare to invade your snake's privacy.", "> opening closed doors in your house\n\nMaybe he was pull a George Costanza by looking for a discreet room to leave his hat so he could have an excuse for a second date?\n\nhttps://m.youtube.com/watch?v=nM_NQxuBrfk\n\nhttps://m.youtube.com/watch?v=RDjt9DRPhCI", "He doesn't have much of a snake from the sounds of it. Imagine needing tweezers and a mirror.", "Agreed. NTA regardless, but snek tax really feels appropriate here.", "He's the asshole for snooping in the 1st place", "The adrenaline response was one thing. Calling OP “crazy” and a “bitch” make him an AH.", "I think its very reasonable to casually let people know you have a snake in your house as they come over. Really any known living things are worth a mention just out of courtesy. I say NTA, and he shouldn’t have been wandering but I do think its common courtesy for a little heads up.", "Honestly with how much space she's taking up, she's my tenant who's a year late on rent", "for why?", "I don't mean this in a negative way but I'm genuinely curious why you feel it's very important to know what she was doing while he was using the bathroom?", "Getting water for us", "I ❤️  you for this lol Cantstandya!", "Hmmm.\n\nI have a boa.  I’m gonna have to amend his lease and increase rent as he grows!  Maybe he can pay me in mice to feed the others...  Then again, the corn snake spends more time on my couch than half my old roommates and they all use half my freezer for food.  Rent for everybody!", "[deleted]", "[deleted]", "[deleted]", "Yeah, well, you know, that’s just like, your opinion, man.", "this makes no sense omg. just because they were planning to hook up doesn’t mean he can just start roaming around her house or go back to her bedroom without being invited or saying that he’ll meet her in the bedroom. even if that was the assumption—the snake is in its own room, there was no expectation that they would ever interact", "Honestly as someone who does know how that process works... It's weird and rude to barge right into someone's bedroom. Kinda presumptuous? Usually people chat and flirt a little and build up to it instead of assuming you're going to sleep together right away lol.", "nah dude. you just don’t go into peoples houses opening doors, regardless of the context. he asked where the bathroom was, got his answer and went poking his nose where it doesn’t belong.", "Living room", "[deleted]", "Yeah I think now I'm getting what you are putting down. I think there was a disconnect in the terminology used in the post. I get that it is presumptuous on a date to skip right to that part but, when the terms \"hook up\" is used, I usually assume it is skipping right to that part. My mistake lol", "NTA then.", "Your opinion of snake ownership is irrelevant, though. But okay.", "nta but i would like to see your snake please", "Agreed, snek tax", "NTA that's what he gets for snooping. Also seek tax please.", "NTA **but** for your snake's sake, you ought to make certain someone new to your life knows about it before you let them come to your place.", "NTA for the snake but I'm leaning towards Y T A for having an octopus as a pet. There are a few studies out there that give a lot of reasons for questioning the ethics of keeping octopuses in captivity. Some will even self mutilate if they're not in a sufficient tank space. I used to love eating tako sushi but after watching My Octopus Teacher it just feels wrong because they're such intelligent sentient creatures. I don't think I'd have the heart to keep one in a tank at home.", "NTA and this is hilarious 😂 the level of entitlement for him to be mad at you whe he was the one sneaking around your home without permission. Pure gold. I would love to have seen his face when he opened the door he had no business opening. I do mildly agree with the people who said it might be best to give people a heads up incase they freak out and hurt the snake, but nt no means are you even close to being the AH, I would like to be your friend.", "I think it’s really cool and says a lot about you that you made a room like that for your snake.  \nMr Nosy shouldn’t have opened other doors. \nNTA", "NTA, but… ok so it’s very clear this dude is an asshole! Both for snooping and his attitude afterwards. But also please consider letting people who come over to your place know about the snake before they come over. \n\nI have a huge phobia of snakes and would be extremely uncomfortable being in the same house as one.", "NTA\n\nDon't you just love when the trash takes itself out of your life.", "NTA, and this is the coolest thing I've ever heard. A snake room. That's so rad.", "NTA.  What kind of person says such defamatory things about a slithery reptile.  I have a soft spot for turtles and tortoises myself.", "NTA.\n\nAltho if I was your hookup, you wouldn't be getting sex that night simply because the snake is cooler and more fun, I'd much rather chill and learn about the snake.\n\nI love snakes, they're beautiful creatures", "NTA. Others are asking for a snek tax, but I really wanna see your tentacled friend!", "NTA, but how old are you, like seriously \"No Step on Snek\" that is your warning.\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "When you find out her snek is bigger than yours.", "This cracked me up, and is such a lovely bit of empathy/speculation. \"He was an asshole for snooping, but he might have been truly afraid you were going to feed him to the snake, so is he really an asshole for running away? 🤔\"", ">but I'm leaning towards Y T A for having an octopus as a pet\n\n\nWhat octopus?", "🤣🤣🤣🤣🤣🤣☠️☠️☠️☠️", "5th paragraph in.\n\n\"Though a lot of the time she still lays in the tank since she likes the heat lamp. I've also got a few aquariums and terrariums in there with my *octopus* and lizards (all very well covered to keep the snake out lol)\""]}