{"id": 16683, "submission_id": "13bh6zb", "title": "AITA for posting a photo of a minor to a private neighborhood group of 150 HOA members?", "selftext": "I just moved into a new construction home and neighborhood. As a neighborhood we have been having a lot of trouble with people choosing to not pick up their dogs poop. Today I was playing outside with my young daughter and she found a bright green bag and picked it up. It wasn’t till I got closer that I realized that she was squeezing a poop bag. I was mad and annoyed that one of my neighbors would be that disrespectful to bag up their dog poop and leave it out. I went to my security camera to see who created the problem. I was able to get a shot of the person and the dog. Upon seeing the person I realized it matched the same description from another neighbor that posted that morning about the same incident happening in front of their house. I chose to post the photo of the kid to our private HOA group since the previous post with only a description did not gain any traction. \nLater that evening I was greeted by my direct neighbor who I have been great with. He informed me that he was friends. With the kids parents and he thought I was out of line posting a photo of a minor. He asked me how I’d feel if someone posted that same photo of one of my children when they were bigger. I told him I’d walk my child to that house have them knock on the door and apologize. My neighbor was adamant that I crossed a line by posting a photo of a minor. While I may not understand the neighbors frustration I did offer to take the photo down and ask that he talk to the family as I have no clue who or where the kid lives in the neighborhood. \n\nAITA for posting the photo of the kid leaving dog shit in my yard? \n\nOther points of consideration I’m the type of guy who would normally have a face to face conversation, But I don’t know where the kid lives or who his parents were. This happened at least twice this weekend as another neighbor posted a similar incident. I chose a screen grab that was not clear enough to make out the kid’s face rather showed their outfit and and another distinctive item. \n\nIf you do think I am the asshole what suggestion do you have that I could have dealt with this and got this to stop happening?", "created_utc": 1683530213, "permalink": "/r/AmItheAsshole/comments/13bh6zb/aita_for_posting_a_photo_of_a_minor_to_a_private/", "score": 319, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My neighbor felt I was the asshole for posting a photo of a minor. He felt that I was “bullying” since the photo was of a minor.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your neighbor sounds off. It's not like you were posting nude photos. The kid deserves to be named and shamed for not cleaning up after the dog when they walk it.", "NTA. id do the same thing lmao. kid deserves to be put on blast. that’s a super rude and disrespectful thing to do.", "NTA. They should be upset their child is leaving bags of dog poop in people's yards instead of making the pic of a minor seem creepy. Like it's a normal ass picture and security footage so why is it considered weird? That guy who confronted you isn't all that friendly with you and honestly, I think you should leave the photo up and catch everyone who leaves dog shit on your lawn in the same way.", "NTA... You posted a photo of someone in the act of a crime, it doesn't matter what age he/she is.", "NTA\n\nIf it were a one off incident I probably would've just said in the HOA group that your security camera has caught an image of who the kid was so if any parents want to see the pic to see if it's their kid then you're happy to share.\n\nHowever, this is a repeated issue that's been raised before and the parents have clearly done nothing to educate their kidd so posting a pic caught by your security camera (not you whipping out your phone and recording them) is reasonable.", "Keep up the post and edit it telling them to come and own up to it themselves without making their friend go on their behalf like cowards", "NTA.  the pic wasn't to spy on a kid it was to reveal the identity of a culprit.  not your fault the culprit was a minor.  maybe the parents will be shamed into raising the kid better now..", "NTA. just because it’s a child, doesn’t mean they shouldn’t be held responsible for their actions", "NTA. You don't know the parents.  You don't know the kid. They were lazy enough to leave poop behind, but some of these folks expect you to start a door to door campaign to find them. \n\nYou did the right thing. Post the pic, and when you find the kid, take it down. This post does not seem like it was intended to humiliate the kid. It was made to find out who it was so a conversation could be had. It seems to have worked. \n\nSave the picture. If you collect three or four of them and the parents don't correct the behavior, take the pics to the police.", "NTA....\nThey are out in a public setting and have no right of privacy. You can publish any photo taken in a pbllic setting.", "Disregarding whether you're *legally* in the right or not; you're now the New Neighbour that escalates to passive-aggressive public shaming at the very first issue *you* had, instead of just speaking to the parents in question. \n\nI'd be more concerned with making sure you don't keep that reputation than whether or nor posting a kid's photo is illegal, because regardless of your side of the story people are sure going to think YTA with that first impression.", "NTA, your neighbor is being silly.  There's nothing wrong with posting that photo.", "NTA - I put myself in the kid's parents shoes. I wouldn't care that much for a picture of my kid on a WhatsApp group, because the kid's behavior is unacceptable. I would like to know it to have a serious talk with my kid. Sure I'd rather if the person could find me without using the picture. But my main concern would be my kid and how to correct such a selfish attitude.", "Nta someone is disrespectful of your property and has no right to be using it that way.  The parents are embarrassed that their kids got caught is what it boils down to.  They feel entitled to do a they please.", "YTA\n\nYou’re a new neighbor who, at the very first offense, posted a photo of a child you do not know to FB to complain instead of just making a post asking parents to talk to their kids about not leaving dog bags. It would have been so easy to not post that picture and yet you did.\n\nMy parents live in a new build HOA development and I lived there with them for a time before moving out a few years ago. I’m still in the community FB group and can tell you with 100% certainty that people in your neighborhood think you’re TA. \n\nThere have been so many times where kids have done stuff in my parents neighborhood that got posted to the FB group and everyone just comments on the post and shares their own story/agrees. It’s fine, kids do stupid stuff sometimes and it’s no big deal but everyone still talks about the guy who posted pictures from his ring camera when he complained about something. I don’t even remember what he was complaining about, and neither do my parents. But everyone knows him as the guy who was so bent out of shape over something so small that he went in and posted pictures of other peoples kids. \n\nNo one cares when the complaints are just a written post, but everyone thinks the guy who posts pictures of other people’s kids is an asshole. And now you’re that guy, congrats.", "yta - even if the kid did something wrong you don't need to humiliate it in front of 150 others. Will you take responsibility if the kid get bullied over this by others?\n\nAnd as you clearly proof in your post, if you just had shared it with a few friends you would already have found out who it was.", "YTA  \nThere was no need to post a photo of a minor online. Further, you literally would have found out who he was just by asking the neighbor you are \"great with\" where the kid lived. Then you could have spoken to the parents and found out if it was the kid being intentionally annoying or just being unintentionally obtuse.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI just moved into a new construction home and neighborhood. As a neighborhood we have been having a lot of trouble with people choosing to not pick up their dogs poop. Today I was playing outside with my young daughter and she found a bright green bag and picked it up. It wasn’t till I got closer that I realized that she was squeezing a poop bag. I was mad and annoyed that one of my neighbors would be that disrespectful to bag up their dog poop and leave it out. I went to my security camera to see who created the problem. I was able to get a shot of the person and the dog. Upon seeing the person I realized it matched the same description from another neighbor that posted that morning about the same incident happening in front of their house. I chose to post the photo of the kid to our private HOA group since the previous post with only a description did not gain any traction. \nLater that evening I was greeted by my direct neighbor who I have been great with. He informed me that he was friends. With the kids parents and he thought I was out of line posting a photo of a minor. He asked me how I’d feel if someone posted that same photo of one of my children when they were bigger. I told him I’d walk my child to that house have them knock on the door and apologize. My neighbor was adamant that I crossed a line by posting a photo of a minor. While I may not understand the neighbors frustration I did offer to take the photo down and ask that he talk to the family as I have no clue who or where the kid lives in the neighborhood. \n\nAITA for posting the photo of the kid leaving dog shit in my yard? \n\nOther points of consideration I’m the type of guy who would normally have a face to face conversation, But I don’t know where the kid lives or who his parents were. This happened at least twice this weekend as another neighbor posted a similar incident. I chose a screen grab that was not clear enough to make out the kid’s face rather showed their outfit and and another distinctive item. \n\nIf you do think I am the asshole what suggestion do you have that I could have dealt with this and got this to stop happening?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA he’s mad about you posting the picture but not about the kids disrespectful behaviour. They need to go sit in a corner and use some critical thinking to asses the situation.", "NTA OP.  When someone repeatedly does something like that, I think it’s okay to call them out on it.", "the child bagged the dog poop and yet still left it in the lady's yard. They deserve to be humiliated if they can't be a decent human being.", "I agree surly there were other ways to settle this? Naming and shaming a kid who has probably not been taught properly or learnt from parents. 150 sounds like a small group so it would be easy to find out who the parents are and settle it with them directly", "Yeah if they are old enough to dog walk, they are old enough to dispose of poop bags properly.", "It's wild that your neighbor is less upset about an irresponsible kid leaving poop bags around the 'hood than that irresponsible kid being outed.  You did nothing wrong and you've broken no laws as far as I can find online - it's a private group; it's not like you posted this on Twitter where anyone can see it.  \n\nYour neighbor acted on his own misgivings, not on behalf of the parents nor the kid.  His projection is not your issue to resolve.  Personally, I would've left the photo up until the kid came around to apologize.\n\nNTA", "YTA The severity of the infraction doesn’t weigh against the invasion of privacy. You could have waited for a reply to a description of what happened or asked around. In my country this would be prohibited but I suppose it isn’t illegal in the US.", "Yta a bit.\n\nCould've posted a completely blurred photo, this is what I would've done, with a note that next time it won't be blurred.", "The correct answer to his complaint is \"Okay, instead of posting it in our private HOA group, I'll take it down and send all the footage to the local police department.\"\n\nNTA", "I'm a little bit confused, you say there is trouble with people not picking up their dogs poop. I've never seen someone go to the trouble of bagging their dogs poop before leaving it. So do you have a problem with unbagged or bagged poop?", "NTA.  Publicly blast people who don’t pick up dog poop", "NTA", "NTA… it’s not your neighbor’s kid, why does he care so much?", "Did you read the post?  They didn't know who the kid was that's why they were posting to find out.", "And being the new neighbor, there's ZERO guarantee they know who the child belongs to, or where to find their parents off top.\n\nIf you somehow think posting a blurry screen grab from a surveillance camera is somehow on par with posting creep shots from a long lens camera, you've got some issues of your own to sort out.", "Yeah, and no one pays attention to those long ass, ranting essays about *stop leaving your dog shit on my lawn,* but you post little Becky live and in person leaving dog shit on your lawn, suddenly her parents have to own up to the embarrassment of their child's face associated with the petty crime.", ">just making a post asking parents to talk to their kids about not leaving dog bags. It would have been so easy to not post that picture and yet you did.\n\nYou can't be that naive to think the kid's parents aren't of the mindset that their child is perfect and didn't do anything wrong...since that isn't their child anyway!", "150 other ADULTS; HOA groups aren't made up of tweens and kids. If adults are bullying kids over shirking their responsibilities, that speaks more to adults being assholes and less to OP being tired of the kid using their lawn as a dumpster for dog poop bags.", "INFO: what is the age of the kid in question?", "I didn't realize it was a minor, I only realized that they were trespassing and littering. I'll refer that to the authorities as well, because that means that there are also negligent parents. NTA.", "NTA. You do something in a public place; you can be photographed. Moral: don't shit where you live.", "NTA. You may have posted a picture of a minor, that's not a big deal. You did post a picture of an alleged criminal.", "NTA. What does being a minor have to do with anything? I'm sure the kid has a large online presence and has no problem posting publicly. You were posting to a closed homeowners group. They were just mad and embarrassed that it was their kid.", "NTA. You didn't post a picture of a child. You posted a picture of a perpetrator. There's a difference.", "NTA \n\nI have no idea why people think the photo is wrong, if somebody is leaving dog shit in your yard they should be shamed, their parents should be shamed, and now everyone else knows who to watch out for and keep an eye on when they see them walking their dog.", "NTA", "NTA - Your neighbor is probably concerned about the picture because it's either his kid or a relative.", "Personally, I would have taken the photo directly to the HOA and allow this kids parents to be fined appropriately.\n\nIf that failed, usually the police will ticket a person for letting their dogs poop in public and not picking it up.\n\nNTA", "NTA. Doesn’t matter who’s pissed off don’t apologize. Your kid was playing with dog poop.", "NTA.  But wow, first world problems, eh.", "INFO: Are you sure it's not your neighbor's kid?", "NTA.  There can be no reasonable expectation of privacy when someone is out in public, even when that someone is a minor.", "What is the point of pick up poop and leaving the bag? I see this all the time and I don’t get it.", "#THIS", " I would've left the photo up until the kid came around to apologize.", "In my country this would matter very much.\nEven if they were robbing a store it would be illegal to post their picture.\nYoung offenders identifies are protected.", "Invasion of what privacy?  How can you expect privacy when you're out in public, or on someone else's property?  And no, it isn't illegal to take pictures *on your own property* in the US, or to post those pictures online.", ">No one cares when the complaints are just a written post\n\nAnd you really don't see the problem here?", "As the OP indicated, the only people that would have been able to readily identify the kid are people that already know the kid well enough to identify a specific outfit and some identifiable object.", "You are blatantly assuming the OP should have reasonably expected the neighbour to have known exactly who the kid is. There is no indication the OP should have expected his neighbour to know who the offender is.", "It happens around me too and I DON'T UNDERSTAND IT!!! I have to assume people don't want to carry the bags on the rest of their walks but I find it so much more annoying/disrespectful than just leaving the poo on the ground.", "Yes, I know my neighbors kid it was a kid that I have not seen before. I walk my neighborhood once per day so he doesn’t live close to me or I would have ran into him.", "In the US, there isn't any right to privacy when someone is out in public, even the person is a minor.  People may take photos from their own property, or public property, and they may put those pictures online.", "I just think that especially as a new neighbor, OP should have just done a written post first. If the problem persisted after that then maybe I could see escalating but to me immediately jumping to posting a picture of the kid is a bit much", "It’s honestly sad that you think every parent would react that way. Sure, some parents might. But a lot of parents wouldn’t. Kids do stupid things sometimes like leaving dog bags on the sidewalk because they don’t want to walk around with it. That in no way means that their parents automatically believe their child is perfect and didn’t do anything wrong?", "I meant that the parents wouldn’t care that a written social media post described their kid but would care that a photo of their kid was posted to social media without their consent", "The written posts of his other neighbors who had the same issue didn't do a thing.  Most people would shrug off a post and say hey that's probably not our kid. There are dozens in this area with dogs and any one of them could've done it so no real way to say if that's our kids or not, so might as well ignore it. Most kids who do that shit who are asked also deny it so don't try to maybe they'll just confess this. Kids lie to get out of trouble all the time this won't the exception. How else do you go about dealing with a habitual problem like this?", "It is openly acknowledged that this is a rampant repeated issue throughout the neighbourhood. Clearly simple written posts are not achieving anything.", "NTA. Your purpose was in exposing a crime. Tip, sometimes it helps to blur the face so nobody can go nuts over this.", "NTA. Anyone who does not clean up their dog's poop is a lazy AH who deserves to be publicly shamed. Sincerely, a responsible dog owner.", "NTA.\nNo expectation of privacy in a public place like a street.\n\nPerfectly reasonable to post picture with “Does anyone recognise this person? They could have given a child toxoplasmosis”.", "YTA don't pick pictures of minors on the internet epsecillay not the rabid circle jerk fests that HOA forums are.  Solution for the problem? Throw the bag in the trash and move on with your day.", "NTA.  Kid won’t be photographed doing crimes if he stops doing crimes.", "NTA\n\nThere's a difference between posting a picture with a minor against the parents' wishes and posting a picture of a minor who is committing a crime so they can be identified and stopped.", "NTA and for reference, if you live streamed a video feed from your house, and the kid walked in front of it, would that be an offense?  Of course not. there's no expectation of privacy outside.  The parent is just mad they got outed and pulling the \"it's not what you said, it's how you said it\" card when it's precisely the opposite.  If Neighbor was truly bothered  by it , they could easily ask \"Hey, my screw up here, we apologize, but i'm uncomfortable having pictures out there on the internet especially on a lightning rod issue, would you mind taking it down\" and that would be that.  Post this thread in the same place you posted the picture.", "NTA.\n\nYour neighbor's whataboutism is out of line.\n\nThe minor in question appears to have committed a crime by bagging up their dog's poop and leaving the bagged poop on or near your property. The abandoned bag of dog poop is a public health hazard and potentially a criminal nuisance.\n\nIn the US, people have no reasonable expectation of privacy when outdoors on public property or someone else's private property, regardless of whether they are adults or minors.\n\nYour neighbor's insistence that posting the minor's picture was wrong of you is entirely misplaced. That's doubly true since he knows who the offender is but wouldn't tell you.", "NTA. You don't get to claim privacy after doing an illegal.", "NTA\n\nif the kid is old enough to walk a dog and fling the shit on someone's lawn, they're old enough to face the consequences for being a dipshit", "NTA. Report it to the HOA.", "Personally I find it odd that he goes through all the bother of bagging the poop but then still leaves it behind. I would think a little brown pile is less noticeable than a bright green baggie.\n\nThe picture was taken in a public place and shared in a private group simply to establish identity. Now that it has served its purpose, it can be taken down but should be saved if the activity is not corrected. NTA\n\nThe neighbor, however, doesn't like the picture. He knows the family and could talk to the parents. If he chooses not to, that's on him. I might be petty enough to give him any additional poop bags \"just so he can give it back to his friends and let them know it's still a problem\". Perhaps the rest of the neighborhood would like to deliver any poop they find to him too, so he can correct the problem without pictures.", "I won't post a judgement, but will tell you that in the neighborhood FB pages where I live they generally have a rule against showing minor's faces. They allow pictures from behind or at a distance where you can see what they're wearing, which are generally enough that the parents/close friends will recognise them.\n\nThe reason for these rules is because there have been unfortunate incidents of people unrelated to the initial problem confronting and harassing the kids. Plus the fact that once posted it's pretty much impossible to remove something from the internet and no one should have something stupid they did as a kid following them around forever.", "NTA - naming and shaming is great, you will not see this kid drop green poop bag on your yard anymore so good job, mission accomplished.", "Honestly the folks who are upset about the picture aren’t upset about a photo of a child, they are upset that they have been caught, and are attempting to regain the the moral high ground under the guise of the ethics of showing a picture of a child. \n\nIt is a long established legal principle that (with very few specific exceptions) photographs taken in public with no reasonable expectation of privacy are fair game. Period. \n\nNTA\n\nThat shit won’t fly, unless someone throws it (bag optional)", "there are sometimes issues of the papratzzi posting pics of celebritiy children for profit on their sites but unless the kid with the dog is a kardashian you're ok. you provided \\*evidence\\* of bad behavior to the HOA- the authority charged with resolving the matter. note the kid hasn't changed has he?", "Yeah, and this is 100% the appropriate outlet for it. Its not like op went to Twitter or even a public fb group. He's not going to get harassed or doxxed. Nobody is going to see this that wouldn't already see it if they went on a walk at the right time.", "This is a good idea. Maybe put a post on the HOA group to say since you have received backlash from posting the picture of the minor any further incidents will involve police directly to circumvent the problem.", "Don’t forget to add this step to the final solution clean dog shit from my toddlers hands", "I don't know, this is going to sound kind of unhinged I'm a little leery of the increasing prevalence of private homeowners having security cameras permanently pointed at public spaces (I'm aware that this was on OP's property, but so many like Ring and Nest cameras are pointed at the sidewalk or even at their neighbors across the street).\n\nThis is a story where no individual step feels wrong or out of line, but the whole of it makes me a little uncomfortable with the slow, steady erosion of privacy/anonymity. While there might be little material difference between a network of always-on, perfect recall security cameras catching the kid versus OP just staking out his yard and catching the kid, it feels different, and it offers more opportunities for abuse (from people less well-intended than OP).\n\nI don't think OP is TA here, but I do think there's some justification for having a reaction of discomfort without necessarily thinking the kid shouldn't have been caught.", "You can take pictures of anything within sight of public space. Don't like it? Stay inside 🤷‍♂️", "so just to be clear, *I do not agree with this method*, but some people do a loop, and will leave the dog poo on the side somewhere, and will grab it on the way back around so they don't have to carry it with them the whole time. This post illustrates why I think this method is rude. Literally anything can happen and other people can come along and step on it or as in this case, kids can grab it. It's not fair to leave your problem to inconvenience someone else while you take your time meandering around. I had a friend who used to do this and it annoyed me greatly.", "At least unbagged poo will just wash away at some point.  An abandoned bag has to be picked up and disposed of.  It's like the worst of both worlds, truly don't understand it.", "The kids walks openly around the neighborhood in plain sight of everyone. How is a photo going to do anything to impinge his privacy that walking around openly doesn't already do?", "NTA.\n\nAnd \\^\\^\\^ is right.  There is a common courtesy rule people follow regarding photographing kids, but it's unwritten and I'd do the same thing in this circumstance.", "If you don't get how the public being constantly recorded with no control of who sees the footage or what happens to it is an erosion of privacy and anonymity, I don't really know how to explain it to you.", "But we are commenting on this one example ."]}