{"id": 16738, "submission_id": "13c34vm", "title": "AITA for wanting to prioritize myself on my first mother's day?", "selftext": "This coming Sunday will be my first mother's day as a mom, after 3 years of infertility and multiple miscarriages. I think my history may be clouding my judgement here and making me selfish but, at the same time, I'm having a hard time seeing how I'm wrong. I'm hoping you guys can give me some clarity.\n\nAll I want to do for mother's day is spend the day with my husband and baby and go for a nice lunch at my favorite restaurant. This has apparently pissed everyone off. My mother wants us to drive 1.5 hours to spend mother's day with her. I really don't want to spend 3 hours in a car with a five month old in one day. My MIL wants us to have lunch with her before she goes and has dinner with her mother. My husband says we have to see his mother on mother's day and, while he's annoyed that she is only available to see us for lunch, says we will have to plan the day around her availability. She does not want to go to the restaurant that I want to go to, and we can't go to that restaurant for dinner because of the baby's bedtime.\n\nMaybe I'm being selfish but I feel like this is my first mother's day and we should do what I want and everyone else can suck it up. My husband thinks I need to compromise and that we can have a perfectly nice lunch that celebrates both me and his mom somewhere that we both like. My mom is upset that no version of our mother's day plans involve her. \n\nI finally broke down and told everyone that I will be going to my favorite restaurant with the baby and that they can all go do whatever they want. Everyone is calling me selfish and overdramatic. AITA?", "created_utc": 1683576397, "permalink": "/r/AmItheAsshole/comments/13c34vm/aita_for_wanting_to_prioritize_myself_on_my_first/", "score": 47, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I am prioritizing what I want to do on mother's day at the expense of others.\n2. My plans exclude my mom and MIL and put my husband in a difficult position of having to choose between his mom and me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Good for you! NTA and you’re not selfish. I’m honestly shocked that your mother and your MIL aren’t more understanding. Also, congrats on becoming a mom! Enjoy your first Mother’s Day, dont let them bring you down! You deserve it!", "So, my feeling is that mother's day should be prioritized for the person actually doing the mothering. Same with Father's Day.\n\nEveryone can come to you this year or they can celebrate it on another day. If they don't like it, they can pound sand. Your request was VERY reasonable. Nothing you requested is selfish at all.\n\nYour husband is behaving horribly - he should ONLY be supporting you right now. It is not your job to put yourself out for the convenience of eveyrone around you.\n\nI'd suggest that his mother and your mother come over on Saturday to see the baby but tell everyone you will not be traveling anywhere this coming weekend. Then, spend mother's day itself how you want to celebrate it. That is a VERY reasonable compromise.\n\nWe got push back for a long time on our boundaries but if you do not set and hold boundaries right now then they will always try to manipulate you. It is not selfish to enforce your boundaries. \n\nNTA", "NTA! You should be able to celebrate your first Mother’s Day how you want to. If MIL and your mother really want to spend the day together so bad they should be coming to *you*, not the other way around. You are the one with the 5 month old.", "NTA! Everyone should be celebrating your first Mother’s Day as a mom, especially given your journey to get there. Take the entire day to do whatever YOU want to do, and tell everyone else to buzz off. They had their turn so You deserve to be celebrated without having to worry about anyone else this year!", "Oh is everyone calling you that?  Well everyone can have a great big cup of STFU and you can tell them we all said so!  HA!   \n\nNTA - you are a mother too, I sometimes wish that there were a grandparents day, so that when a woman becomes a mother she can be relieved of her duties and be the focus of the attention same for the dad's on father's day.   \n\nStand your ground and if possible - post this on a meet up mommies group or something seeking like minded women to start a new tradition.    \n\nPlease update us after MD so we know how your day was.   And blessings to your new motherhood.", "There sounds like there's a lot of pressure on you as a new mum. I can't believe both mothers are demanding you go out of the way to spend the day with them.  Enjoy your favourite restaurant with your baby, hopefully hubby see's sense and joins you.\n\nNTA", "NTA \n\nYou are a mother. It's your first mother's day after suffering years of infertility.  You should do what you please. Send them a card or something  if you desire at most and do what you want. You and the newborn are now priority.", "I can't believe the tug-of-war I'm reading, OP you are NTA.\n\nThe very first year I was a mother (and yes I had a terrible pregnancy and high risk delivery, but nowhere near the struggles you had to endure), my mother called and asked me what \\*I\\* wanted to do to celebrate Mother's Day. When I asked her for her opinion, she cheerfully said, \"I'm the grandma, now YOU are the mother\". I loved her for that.\n\nYOU ARE THE MOTHER THIS DAY.  Grandmas can wait. Congratulations OP!!!\n\n&#x200B;\n\nEdited for clarity.", "BS to mom and MIL.  Spend your first mother's day with husband and kid.  Husband should have YOUR back, not MIL's.  NTA\n\nAnd what will happen when OP is ready to have Thanksgiving at their own home.  Christmas at their own home.  At what point is it OK to do either?", "NTA. Moms who are still actively raising kids should get first priority in mothers day plans.", "NTA. It's mother's day, not grandmother's day. Fuck 'em.", "NTA - why can't you celebrate your and MIL on Saturday?", "NTA--I struggled for 2.5 years with infertility and lost two babies in that time.  Had multiple procedures to eventually have my now 10 year old daughter.  She happened on second round of IUI/5th attempt.\n\nWhether you went through all that or not, you get to spend Mother's Day how you want.  I don't see why you can't just spend a special day with each mom on any other day.  What's the big deal?  Many people do the weekend before or weekend after for going out to brunch/dinner to avoid the massive restaurant wait times on that day.\n\nI can say that I know when my 10 year old daughter grows up, she may stop spending actual Mother's Day with me and want to spend it with her child/children and husband and I'm totally fine with that!  It won't mean she loves me any less.  I think you should do what you want, especially with your baby so young, on this Mother's Day.  It wouldn't be fun dragging her around all day anyways.", "NTA, but I'd hand the baby to your husband, call up some friends and go to the restaurant with them.", "NTA, you are the mother now, she is a grandmother and should be happy about it.", "NTA \n\nWhy can't they compromise and do what you want to do, since you are the one with an Infant?", "NTA. Send them some flowers and a card, and maybe FaceTime them each briefly when the baby is awake. Make your own tradition—you deserve it.", "NTA.\n\nAs a new Mom you should get priority. How would your husband feel if instead of doing what he wants on Fathers Day you plan an entire day around his FIL?", "NTA I’m sure you’ve done Mothers Day for your mother and MIL many times, now it’s your turn to spend Mothers Day the way you want to. If he wants to see his mom, then he can plan it for another day. It’s your first one and it should be how you want it.", "I was very much into my first Mother’s Day - it felt very special, and the first one was important.  When my daughter had her first baby, I told her that she gets priority as the latest generation mother - and same with Father’s Day. I didn’t want her stressing about making my day special and ignoring her important place.", "NTA \n\nIs kiddos first mothers day. Since they live with us, I made plans.\n\nShe gets a clay print of his hands and feet we did as well as stone/glass etching of the three of them. Her favorite homemade meal and me and hubby making ourselves scarce.\n\nI will call my mom and wish her a great Mother's Day. \n\nTo me, they are all overstepping. It was one thing when you were not a mother, but now that you are, they should be stepping back and letting you make those memories. \n\nIt's like people say for holidays they want to start the core family memories.\n\nHubby is out of line as well. He can call his mom or even visit her early in the morning and then focus on you the rest of the day. If he can not step back and put you first, will it always be this way? For every holiday or will you get to be an adult and decide how you want to spend your life? Will you never come first. Just like he could say, we will celebrate my mom and you, but ignore you, have a mom too. \n\nI say go alone and enjoy your mother's day. Screw the rest and tell them either they had great patents/ils who backed off and respected them or horrible ones and should strive to let you now have your family how you want. Not dependent on their WANTS. Your hubby needs to decide whose side he is on. It's great he wants yo celebrate his mom, but in doing so, disregards your feelings and in putting you first.", "Well, welcome to Motherhood, where you don’t ever get what you want.  Seriously, I understand. It seems as if everything is jam-packed into one day when all you want is a simple day to do what pleases you and makes you feel special and celebrated.\n\nI seldom really enjoyed Mother’s Day and my birthday- holidays were exhausting. Celebrations meant that I had to plan something. And manage all the kids and their excitement, shoe-horn lunch in between other events, deal with cranky babies who’d missed their naps, and arrange gifts/family phone calls/visits etc for the other moms in our lives. And get it all done and the kids in bed at a decent hour. \n\nTo offer some perspective from down the road a bit, we recently became “empty nesters,” and it’s a totally different experience. One of my kids didn’t call last Mother’s Day.  I know why- they figured I was busy with everybody *else* calling, just like I used to think with  my mom. Guess what? I wasn’t. There was no chaos, no schedule, no rush… nothing. Those calls mean a lot when your kids aren’t home, when it’s just you and your guy looking at each other. Last birthday, almost all of my kids were home for my birthday, and wow, I felt SO special. It was a simple eat dinner-open presents event, and it made me so happy!\n\nSometimes being a mom seems like a feast or famine type thing… when you’re in the middle of it, it’s all consuming and there’s no time to breathe. But when they’re all gone, there’s nothing but time. \n\nEnjoy your day, OP, no matter what comes your way. I truly hope that whatever you do, that it is a special day.", "Your past history is definitely influencing your decision, but I think given said history it's perfectly reasonable to want your first mother's day alone.\n\nINFO do they know the reasons why? If so them wanting to see their kids is understandable but inconsiderate, they can skip *one* mother's day. But if they don't know why you want it alone this may look selfish and seem to be coming out of nowhere for them.", "Meh. It’s Mother’s Day. Your husband needs to go and wish his mom a happy day. You can choose what to do with your mom. Also….you choose what you want to do on your first Mother’s Day. Do not start a routine of doing what your parents and in-laws want on holidays - because thanksgiving and Christmas is right around the corner and there will be demands and hurt feelings on those days as well! NTA.", "Slight YTA:  But only to the way you're treating your husband.  It's mother's day so he would like to do something for HIS mother.  He should be allowed to and also be able to spend time with you as well.  \n\nNot really fair to make him choose just because your willing to not celebrate with your mother.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis coming Sunday will be my first mother's day as a mom, after 3 years of infertility and multiple miscarriages. I think my history may be clouding my judgement here and making me selfish but, at the same time, I'm having a hard time seeing how I'm wrong. I'm hoping you guys can give me some clarity.\n\nAll I want to do for mother's day is spend the day with my husband and baby and go for a nice lunch at my favorite restaurant. This has apparently pissed everyone off. My mother wants us to drive 1.5 hours to spend mother's day with her. I really don't want to spend 3 hours in a car with a five month old in one day. My MIL wants us to have lunch with her before she goes and has dinner with her mother. My husband says we have to see his mother on mother's day and, while he's annoyed that she is only available to see us for lunch, says we will have to plan the day around her availability. She does not want to go to the restaurant that I want to go to, and we can't go to that restaurant for dinner because of the baby's bedtime.\n\nMaybe I'm being selfish but I feel like this is my first mother's day and we should do what I want and everyone else can suck it up. My husband thinks I need to compromise and that we can have a perfectly nice lunch that celebrates both me and his mom somewhere that we both like. My mom is upset that no version of our mother's day plans involve her. \n\nI finally broke down and told everyone that I will be going to my favorite restaurant with the baby and that they can all go do whatever they want. Everyone is calling me selfish and overdramatic. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Absolutely positively NTA. This is your very first Mother’s Day and you should celebrate it how you want! Your mom & MIL have had 20+ years each being celebrated! Now it’s your turn, especially after struggling with infertility, to have the day you want. They are both being selfish here; nether of them is putting themselves in your shoes.", "NTA mama! You take care of you. It's supposed to be a day for appreciating mother's and you should be #1 mama on your own list.\n\nMost adults I know have missed more than one holiday with family. This should be no different.", "NTA at all. You’re good, mama. Have the Mother’s Day you want.", "NTA. Thrilled for you getting to celebrate your first mother's day. Screw everyone calling you selfish. Congratulations 💗", "As the provider of grandchildren, I announce to my mother in law and my mother what I want. \n\nThis year I want to go to my mil's house and sit on her deck and eat bbq.\n\nMy mil wants to have a fancy desert for the bbq purchased for her. My mother wants my husband to bring an aterondac chair even though it barely fits in the car and would be a separate trip (of 8 whole blocks).\n\nMy Mil's boyfriend, my mom's boyfriend, and my husband are going to be in charge of set up, bbqing, and clean up.\n\nWe are all extremely demanding ladies.", "NTA, you first and the others after. My mom was already choked I mentioned having a gift for her this year because she says “now that you’re expecting the day becomes about you and you being honoured, don’t worry about me because I’ve had my years”. \nI disagreed a bit because she’s still my Mom even as I become one for the first time, but at the end of the day, she’s recognizing that traditions change as life does. \n\nYour husband is an AHc, he needs to redirect any attention on Mother’s Day to meeting your needs first, and if it’s possible to accommodate anything more with his own Mom, that can follow or occur the day before or after. If your wishes were to have everyone together, easy, invite them to restaurant of your choice but DO NOT go out of your way to accommodate them at your own expense (it’s a sloppy slope from there) \n\nAt the end of the day, it’s about you and your family first. If your mom and MIL won’t respect that, they’re going to miss out on a whole lot more than a day they’ve been recognized on for decades already. Tough shit, granny’s- there’s a new Ma in town", "You're not being selfish. Your mother and MIL had their years with their families, and you should start yours with your family.\n\nNTA", "NTA. It’s your first Mother’s Day. A day that according to what you wrote you maybe thought wouldn’t come. You should celebrate however you want it. And husband should be more supportive.", "My MIL tried this after my son was born.   I told her you've had 40 Mother's Days and this is my first.  I'll be doing what I want.   Luckily,  husband backed me up and we had a lovely day at the zoo.", "NTA", "NTA: Please enjoy your first mother's day. Love and hugs and happiness.", "NTA", "NTA at all and your husband should agree to make the day all about you! First mother's day is a big deal especially if you've had fertility challenges.\n\nIf you can't get anyone to see reason then stick to your guns, take your baby to the restaurant and tell your husband that you hope he'll do the right thing and join you there. Honestly, FFS, sorry you're having to deal with this BS!", "You don't hate to fo shit on Mother's Day except for what YOU want to do! NTA", "NTA…funny how everyone sees you being selfish, but yet, when they have set ideas on what must be done for Mother’s Day, they are not selfish?  I would compromise.  Saturday you see your mother in law and video chat with your mom.  Sunday is your day.", "NTA enjoy yourself", "Yta. Your husband loves his mother. Wants to see her. He isn’t forcing anything bad on you. You can go to the restaurant for dinner just an earlier dinner.", "NTA. I would do the same!", "Can we normalize passing mothers day and fathers day down to the primary caregivers like a family heirloom or something.   \n\nWhen your \"children\" launch and have families of their own, you can go back to just have the one day (your birthday) be about you and the Mother's and Father's days be about your adult children now? \n\nI'd be willing to vote for a grandparents day if we could knock off all the narcissistic / martyrdom type demands.", ">I'd suggest that his mother and your mother come over on Saturday to see the baby but tell everyone you will not be traveling anywhere this coming weekend.\n\nThis could be a win-win. My husband is going to be out of the house all day Saturday so I'm parenting solo. If my mom and MIL come over, we can celebrate them and I can also get some help.", "Lets be honest, someone who is in parenting 30 years should imo be a tad more honored than someone who is 3 months in.   Her days of sacrifice are just starting ...", "Thats her mom. Gross attitude.", "My husband is not available on Saturday.", "They are aware of our history.", "To clarify, I have no problem with him seeing his mother on mother's day. What I have an issue with is prioritizing her wants over mine to the extent that I don't get to do the one thing I want to do.", "Disagree. He made a baby with his WIFE who should now be a priority on mother's day...you know, the mother of the baby THEY made?\n\nNTA, all day long. Do what you want for YOU. Hubby can see his precious mommy on Saturday.", "So they have that one day. He mentions his mom but not hers. He wants to spend time, and that's fine, but when it takes away what  she wants yo do. When he puts hus mom before her, there is a problem plain and simple. To not be able to go where she wants. Have it taken away because hus mom wants to go elsewhere where op has few options due to their dietary needs. Why is it OK to disrespect hus wife and first-time mom in making it special. In wanting it to be the 3 of them. No, his mom can only go at a specific time, which means he puts her first in the when and where, and op just has to suck it up. It's not like other times work for op due to breastfeeding and nap times.\n\nTo me, you are saying hey its ok to disregard the fact you are forcing her to change how she wants to spend her holiday because he can't visit mom earlier.\"  The mothers are in the wrong because they should be leading the charge on making the first as special as they can. Instead, it's nope. it's all about me. You just have to suck it up.", "Respectfully I would like to disagree with you.   Now that he's a married father, he should be prioritizing those responsibilities.   Honoring his wife on her day and teaching his child to do so as well.    \n\nThe village should have taught her that mother's day was about her mom, in turn the village should be helping to teach her child it's about her.", "Or, according to your logic, the husband could celebrate with his mommy the day before, no?", "Her husband should not even have to think about this. His wife, the mother of their first child, one of their first Mother's Day as a family, should be more important.\n\nNTA", "My husband has plans on the Saturday so I'm watching the baby solo all day.", "In the U.S., Grandparents Day is Sept. 10, but it's not widely celebrated or recognized.", "No.", "Wait, its parents day and it should be about the adult children?  tad ironic", "Get some help from the mothers you cant be bothered with? Lol", "Just wondering what's wrong with this option. \n\nYou go to the restaurant you want Saturday. \n\nSunday morning it's just you and your husband and your child. He goes see his mother, he can even take the baby with him if you want to relax or go out and do something for yourself (maybe spa or massage) and then spend the night with your husband. \n\nYou see how everyone can get what they want", "Ok difference of opinion, that's fine. But to me why can't OP compromise?  \n\nShe's literally saying I wanna go to this one restaurant or nothing else. \n\nWhen they can go to the restaurant Saturday night.  Have Sunday morning be all about OP, allow her husband to see his mom, and than the rest of day after lunch is back to being all about OP. \n\nThat's why I think OP is wrong, she want this day to be solely about her and no one else. I disagree with that but understand you disagree with me", "Kinda confused on your take. Your saying to show his child the importance of mothers day he should spend the entire day with his wife and not see his mom. \n\nIsn't that just saying mother's day is about your mom but once you have your own kids its not about them anymore", "True I stand corrected", "I just think of my mom and I know she would want to see her grandchild on Mother’s Day. But you guys are right, it is her first Mother’s Day and she deserves to have it be exactly how she wants", "I apologize I take it back - NTA and please enjoy your first Mother’s Day ❤️ sorry for trying to see both sides but yours is the right one after reading these comments", "Well let's change that! \n\nThis way the mothers who are mothering little ones still in the home can enjoy their day.", "My husband is not available on Saturday, so we can't do anything that day. We're exclusively breastfeeding and the baby won't take the bottle, so my husband can't take the baby with him on Sunday unless I come.\n\nSunday morning and evening, I will most likely be cooking breakfast and dinner and caring for the baby in between.", "My husband is not available on Saturday, so we can't do anything that day. The restaurant my MIL wants to go to is ok but there are only a couple things on the menu that I can eat due to dietary restrictions. \n\nAs for having the morning and evening being all about me, I honestly don't know what that would look like. My husband doesn't cook, so I will be cooking breakfast and dinner. The baby naps around 10 am and 2 pm, so we have to be home during that time.", "Kind of that yes.    Seems odd to me that women so grown they're now grandmothers seem to suddenly forget how hard it was for them when their babies where young still demanding a mothers day like it's their birthday or something.   \n\nAgain, respectfully speaking, how attention seeking can one be on the subject.   Let's guess the OP's age to be 30-ish or so - her mom and his had 30 years of it, let someone else be the focus for a change.    Seems weird, why are these two woman not trying to honor OP for a change, pass down the day like an heirloom", "Ok, so are you saying there is no compromise you can do that you'll be ok with? Outside of your way or nothing. \n\nAlso you can easily order breakfast and dinner.", "I'm not saying there's no compromise that I will be ok with. I'm saying that I don't see any compromise available that doesn't involve me giving up the only thing I want.\n\nThe compromise I would propose is that my MIL come over for breakfast and I will make a nice spread for her but that has been shot down.\n\n&#x200B;\n\n>Also you can easily order breakfast and dinner.\n\nTakeout is much less appealing to me than home-cooked food, especially since we're limited in where we can order from due to my dietary restrictions, but to each their own."]}