{"id": 16754, "submission_id": "13c9ejd", "title": "AITA for saying I can’t trust my gf because she broke her promise to my friend?", "selftext": "I (27M) and my girlfriend V (29F) have been together for 2 years. We generally get along well except for one thing-my best friend T (26M). T had a very bad childhood. He was severely neglected and left home alone. We bonded as kids and my family took him under our wing. T has many struggles and most jobs are not accommodating of his needs. He feels safest at home but he needs someone who he trusts as well. So I often pop over to his apartment and make sure he’s okay. \n\nV does not really understand mental health issues. She is a type A perfectionist who wakes up at 5AM and powers through her day. She’s also very nosy. I’ve protected T and they’ve never met but V constantly complains that I am crippling T by doing things for him. She thought he could just power through his issues. \n\nRecently, I went back to my home country for a visit but due to visa issues I couldn’t come back for six months. T went through a lot of difficulties in that time. My parents were too far away to help. I finally cracked and asked V to help T but not to talk to him and make him do things. \n\nI came back and everything had changed. V had made T move into her apartment and he cooks and cleans for her like a servant. He also has a to do list and a bunch of rules. I yelled at V and said I couldn’t trust her because she broke her promise to not interfere with my friend. I called her a terrible person. She was furious and told me to get out. AITA?", "created_utc": 1683590626, "permalink": "/r/AmItheAsshole/comments/13c9ejd/aita_for_saying_i_cant_trust_my_gf_because_she/", "score": 870, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I yelled at my girlfriend and said I couldn’t trust her and called her a terrible person because she broke her promise. I might be the asshole because she wasn’t trying to hurt him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA - Do you want T to grow as a person and improve himself? It sounds to me like you want to “protect” him from the big bad world and ensure that he never experiences anything that might disturb the bubble that surrounds him. You’re actually preventing him from getting better. \n\nThe “promise” you extracted from from your girlfriend was completely unfair. You asked her to promise, that if she should see someone hurting and in need of help, that she was not to try to help that person. You don’t agree with her methods, but it isn’t any worse than what you were doing. You make no mention about how T is doing in his new situation, you only seem to be angry that V broke an unreasonable promise. That’s on you.", "Dude, sounds like your friend needs your gf more than you. YTA.", "YTA, you can expect things to go the same if you’re not the one doing the helping. People respond differently to different people . Goal has been accomplished friend did not sit in house and go down. He made himself useful and actually supported your girlfriend. I’m sure it made him feel good to help the person who helps him. Mission accomplished.", "Why are you on AITA if you can't accept that you might be? This isn't going as you'd planned, is it?", "Sounds like your gf gave your friend more structure and encouragement in 6 months than you’ve provided in years and that seems to make you bitter. Why are you writing T off as some helpless person who can’t ever better his situation? In any case, you and your gf aren’t compatible - it doesn’t appear you have any respect or regard for her.", "Bet OP has probably told T therapy would be an awful decision", "INFO: your friend is living there rent free, and he quit his job. he is cooking and cleaning. So essentially he is just giving services in exchange for housing and safety. \n\nWhat is wrong with that?", "tbh, seems like V axtually was getting him on a good path, giving her the benefit of the doubt that this wasn't exploitations. \n\nyou are overly indulging this kid, and y'all have a pretty toxic codependency thing happening. i have trouble believing any of this is real because even through your biased lens your gf seems to most functional and level headed person here.", "> She was furious and told me to get out. \n\nThe best thing she ever did. Of course it would have been better if she just broke up with considering how different your values are. \n\n&#x200B;\n\n>I’ve protected T and they’ve never met but V constantly complains that I am crippling T by doing things for him.\n\nI would be scared to have kids with you if your babying an adult like this.", "I feel like I've seen this one before.  Regardless, YTA.  You asked her not to talk to him?  Really?  What's wrong with you?\n\nAnyway, they both seem better off without you.", "YTA.  You asked her to host your friend, alone, for a few months.  You've excluded her from knowing anything about your friends struggles that have led him to your home, in your absence. She also can not expect him to do anything.  He is only allowed to be a chore for her. You sent her a full grown baby and YOURE mad?", "YTA you were treating your friend like a child. It looks like your gf has gotten him up and being active, which is great! Your friend is an adult and could have left at any point if he didn’t want to be there. Why can’t you just be happy your friend is adjusting?", "INFO: how did you want her to help him without talking to him?", "YTA. All of this is super infantilizing to your friend who is an adult who can make their own choices. You keep saying that you know best but maybe T knows what is best for him more than you.", "INFO\n\nhow does T feel about your gf and their situation?", "INFO Have you talked to T about what he is feeling and doing? I feel that we need to know how T is doing and feeling before judging.", "You need to ask him, not coerce or convince him of what _you_ believe he needs, how his state of mind and general well being has been since moving in with V.\n\nMaybe what you thought he needed wasn’t fully what he needed. It could be that showing him a structured way of living has improved his life all around. We are creatures of habit, doing daily chores and cooking meals isn’t a bad routine to get into.", "How does T feel about the situation?", "Yta", "YTA\n\nYou speak very poorly of both your girlfriend and your friend. You call your girlfriend nosy and speak of her motivation and organization as if they are bad things, as well as saying that you have to \"protect\" your friend from her. If you feel that way, why are you even with her? She deserves someone who doesn't talk down about her like that. \n\nAnd you speak of your friend as if he is a pet, or at best a child who is fully incapable of even basic life skills. Sure, mental health can make even very simple things near impossible sometimes. I've been there. But it isn't a good place to be or stay, and I've needed family or friends to give me that little bit of help to get me going again. And I've been grateful for that. But when your girlfriend takes in your friend so that he has somewhere to live and doesn't immediately need a job, then helps him to start caring for himself and his new living space, you get angry. \n\nYou are so focused on being the one who knows best in this situation that it's causing you to treat your friend and your girlfriend badly.", "YTA you told V not to talk to him or make him do anything. OP you are human equivalent of a damm fruit loop..\nYou are absolutely co dependent in him. \nSeems V was showing him how to do things for himself. To show him he is capable of doing things.\nShe isn't coddling him like you and your family have been doing. \n\nT is a grown ass man start treating him as such. He isn't a child. He seems more thrn capable to do things for himself. \n\nThe only person who has a issue with T doing things for himself is you. Because you have a hero complex. You think that T can't survive without you.  \nWhen it's obvious that he can.", "I don’t think OP is listening Reddit. YTA", "your friend isn’t a baby, you know", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (27M) and my girlfriend V (29F) have been together for 2 years. We generally get along well except for one thing-my best friend T (26M). T had a very bad childhood. He was severely neglected and left home alone. We bonded as kids and my family took him under our wing. T has many struggles and most jobs are not accommodating of his needs. He feels safest at home but he needs someone who he trusts as well. So I often pop over to his apartment and make sure he’s okay. \n\nV does not understand mental health issues. She is a type A perfectionist who wakes up at 5AM and powers through her day. She’s also very nosy. I’ve protected T and they’ve never met but SV constantly complains that I am crippling T by doing things for him. She thought he could just power through his issues. \n\nRecently, I went back to my home country for a visit but due to visa issues I couldn’t come back for six months. T went through a lot of difficulties in that time. My parents were too far away to help. I finally cracked and asked V to help T but not to talk to him and make him do things. \n\nI came back and everything had changed. V had made T move into her apartment and he cooks and cleans for her like a servant. He also has a to do list and a bunch of rules. I yelled at V and said I couldn’t trust her because she broke her promise to not interfere with my friend. I called her a terrible person. She was furious and told me to get out. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. you asked your girlfriend to help T and she turned his life upside down and exploited him instead. she uprooted him from where he felt safest and forced him to do housework with the time and energy he could have been using to focus on his health or trying to find work, which is basically exactly what you asked her not to do.\n\nlots of people commenting that you don't know what T needs, which may be true but you certainly know better than any of us since you've actually met this person, let alone had a lifelong relationship with him. structure can be helpful for some mental health issues, but again we don't know what mental health issues T is experiencing (and it sounds like he has other needs) or anything else about him, and what's described in this post and these comments show that this was clearly exploitation. even if she was just providing structure that was helpful for him, she had no right to do that.", "you're correct, you can't trust her. She sounds toxic and exhausting, maybe it's best to stick with your best friend and let her go.\n\nEdited to change my vote to YTA. More information was needed. I'm leaving the original comment, minus the vote so it doesn't look like I'm being dodgy", "YTA she seems to have actually helped T quite a bit. He stuck to a schedule for the first time probably in his life and did things on his own. This is good. He is learning to be self sufficient which everyone needs to be able to do in some capacity. Childhood trauma or trauma in general doesn’t mean someone should be codependent and not know how to do things. You seem upset he won’t be relying on you . Did you ask T if he was okay how he had been in these months? Or did you just assume?", "INFO: what does T say? It’s suspicious you don’t mention how he’s doing or how her behavior negatively effected him like you would be if had actually done him any harm. Just that V did not do what you’ve been doing and did not just silently help him and make sure he never does anything for himself.", "I’m the one that understands what T can and can’t handle. I feel like V is taking advantage of T and his trauma to get her housework done when she could just do it herself or pay a housekeeper.", "He doesn’t need her.", "The goal is to support T not make him V’s servant.", "I think many people in the thread are misinterpreting what I am saying.", "No I’ve encouraged him to go to a therapist. He refuses because he doesn’t like talking about his trauma", "She’s taking advantage of his trauma to make him do things for her", "I am not indulging him. We are absolutely not codependent. You have absolutely no idea what T has been through and what he needs.", "Sounds like the friend who’s fiancé wanted to know why OP’s friend and him were so close and OP wouldn’t disclose to her. I know which one your talking about. \n\nAnd I totally agree here, Op is overindulging his fiend and not holding him account to be himself as a grown adult. A huge difference between helping and hindering and hindering & enabling is exactly what OP is going here", "There was a very similar thread a little while back, except it was a whole friend group who had this weird ownership of their friend with a rough background, instead of just one person with a weird ownership of their friend.", "Right?? Seems like there’s been a few really similar “I’m the only one who understands my poor friend and my gf doesn’t understand mental health so I have to protect them from mean gf!” I feel like there’s at least one a week currently", "I haven’t posted before. \n\nI meant talking as in giving him unsolicited advice and telling him what to do.", "I didn’t ask her to host him. I just asked her to make sure he was alive and maybe remind him to eat or sleep once or twice. NOT to move him in her apartment to be her gloried servant.", "I meant talking as in telling him unsolicited advice or make him do things.", "T is the sweetest person so he feels indebted to V for the rent situation but he could have extended his lease and I would have paid for another six or so month. I have done that before but V yelled at me for wasting money.", "He feels weird around her.", "He feels weird around her in his own words.", "He doesn’t have a “best friend” any more because V gave “best friend” an opportunity to grow and become a better person where OP wanted to ensure that “best friend” would be forever dependent upon him.", "Maybe. I’m tired of explaining it to her.", "I don’t think that’s at all obvious. It sounds like he may be growing, and coping, better with V. Your “help” sounds like infantilization. YTA", "INFO - have you asked T how he feels about this new situation? To be honest, saying that you're the one who understands what he can handle is coming across as pretty arrogant. Maybe having some structure and something constructive to do is helping him? Is he unhappy? Struggling? Has he said anything to you about all this?", "What do you think he needs? What has he been through? \n\nIt just seems like you're babying him and not actually giving him structure otherwise. Lots of people need structure, whether or not they're 'type A' or 'type B'.\n\nAlso, actually get T medical help away from you so he can handle himself. It's a bit toxic that you're keeping him close like this and not letting him grow as an individual.", "You’re not the only person capable of understanding T. You just want to protect the arrangement that makes T dependent upon you more than you support his personal growth.", "Or she wanted to give him structure and a chance to learn life skills under supervision.", "It sounds like he doesn’t need you.", "No he needs you...The big HERO.  /s \nSeems you like playing hero", "I don’t mean to be rude, Op, but your comments really make it sound like *you* need him to *need you.* I think you need to go speak to a licensed therapist about your response to this entire friendship - you may be hurting your friend more than helping him.", "How does T see it? \n\nThis is all about how you feel. How is he? What does he think?", "Why did you post here of you are just going to argue with EVERY person here?", "That’s the way things played out, he’s a grown man and offered help she accepted it. Did T feel used or was he happy. Maybe T did it for you since you weren’t available to help, being stuck in another country and all. Perhaps he wanted to be there for her to be a stand in for you. That’s a honorable thing for a friend to do for another friend who has been there for him. Unless V or T crossed the line with each other romantically what’s the problem? Why is this so hard for you to accept? It’s comes across as if you’re the only one with the problem. I think you should just say thank you to T, move him aside now that you’re back, and keep it moving. Try to see the positive in this. They both made the best of a situation in your absence. Are you afraid the T is capable of more than you think? V seems to believe so, T showed her with his actions. If he can assist her he can help himself. Continue to build T up from there. Encourage him, uplift let him know he can handle more things than he thinks. If he can setup for you in a crunch he can do it for himself daily. I just don’t see a problem here. Things happened and this was the result. It’s positive. It’s okay if it’s not what you expect. Take the win and be happy for T he did a good thing for you, because he owed you. V was just the beneficiary. Be happy your girlfriend and friend have bonded. Are you a little jealous?? Be honest. If T is as bad off as you explain and you are as good as you explain you have nothing to worry about.\n\nEDIT: to switch T and V.", "Doing some chores for free room and board is a pretty cushy deal.", "But you are telling us your girlfriend is comitting exploitation of a vulnerable person and participating in modern slavery and you're in a relationship with this person? There's so much wrong with this.\n\nEdit: I am aware you are struggling to communicate the situation exactly as is on here, and I do believe some people should not be forced into things that may be helpful for others, depending on complexity of needs and severity of disability, but if it is as you say then you need to speak to a professional or a local mental health support service, not reddit. Otherwise it is hard to believe it is as you say it is, and T is capable of more than you think he is. You can't think very highly of your partner if you think she is literally using and exploiting a mentally ill person who is unable to improve their condition with responsibility.", "And no, you're explaining yourself terribly and coming across even worse.", "He needs to talk about what happened to him with a professional so he can heal and grow and not keep everything bottled inside. He can’t keep coasting on other people holding his hand and paying for everything; it’s not healthy.", "have you told him that therapists aren't supposed to force you to talk about your trauma? that's a super legitimate boundary to set and therapy can be really helpful whether or not you discuss your trauma. for prolonged childhood trauma I would recommend looking for therapists who specialize in CPTSD and use approaches like somatic experiencing and IFS, but as long as you can find someone who respects his boundaries I'm sure he could get something out of it.", "She’s giving him a job and stability and pushing him outside his usual comfort zone. That is GOOD for people. How is he ever going to start to overcome his trauma if you do everything for him and shield him from the world?", "What does he want to do? \n\nCan he afford not working and getting a new place?", "But she isn't. The arrangement is mutually beneficial. No one is taking advantage of anyone in the scenario. You're just mad someone is actually asking something of him.", "She is giving him a place to live, food to eat, and honest work.", "How?", "Info: how?", "He IS codependent on you. Or he was, and you enabled it. You're not a therapist, trauma counselor, or psychiatrist. You don't know what he needs. You have just been coddling him so he doesn't have to face and hardship, and that's not helpful in the long run for his mental health.", "And how do you know exactly what he *needs*? Do you have a degree in psychology or psychiatry? He’s definitely codependent on you and you love it. You would be helping him instead of enabling him if you did. What does he say about the time that you were away and his interactions with V??", "Hey dude, I get you, you’re trying to do what is best for your friend. \n\nHowever, I can offer my own perspective as someone who due to childhood trauma went through a period of being pretty useless at looking after myself. Schedule and clear expectations imposed on me by others, rather than being left to my own devices (but helped) were what brought me out of it. These baby steps towards self sufficiency that she appears to be helping him with are probably far better help to him than being benignly ‘taken care of’ but left to hermit himself. \n\nSlowly building up a steady routine is what got me back to the land of the living. Then I went to school, law school, got a job… I definitely wasn’t as deep in it as your friend, but if this has led to a functional improvement, it may actually turn out to be what he needed. \n\nBeing helpless and hermit-y is a miserable life.", "Did you actually ask him how he was doing before you threw this temper tantrum?", "You appear to have no real interest in helping your friend improve his life. He is obviously capable of doing more, if he has been living with your girlfriend for months and actually doing things for himself. You should be encouraging him not holding him back. Grow up and stop thinking you know everything. Obviously YTA and you should be thanking your girlfriend not shit talking her.", "You asked her to reach out and help take care of him. Just because her version of that looks different doesn't mean she's being an asshole.", "Yeah, pretty sure you’re the same troll again.\n\nCan we skip to the part where you’re secretly in love with him?", "Either way, it was a huge ask.  Especially since you've been \"protecting\" your friend against your offensively productive partner for some time...for some reason. You say she doesn't understand mental health struggles and imply she is not nurturing in that way but you sent your friend to her anyway.  It's on you, buddy.", "People who don't pay rent often do extra chores to help make up for the household deficit they create. Normal roommates do chores too, and have to follow shared household rules. None of this sounds strange or cruel to me at all.", "I still don’t get exactly what you were asking her to do.", "Refusing to give advice to someone whose life is off track doesn't do them any favors.", "Does T have any income of his own? Is he able to have a job of some sort? (please note i'm disabled myself, though not physically, so I'm in no way saying he should be or anything - just trying to get a better picture of him a little more objectively if that makes sense?)", "What's the point in paying for an apartment for him to sit in by himself being miserable? How does that benefit anyone?", "This isn't a detailed enough answer, and provides no useful information.", "So he didn’t actually say that…", "Honestly, she's ableist. I couldn't personally date someone like that because, no matter how great they may be in other ways, that trumps everything, in my eyes, to make the person awful", "He feels indebted to her because he’s living with her without rent and he had to leave his job for a mental break. However, his lease could’ve been extended and I would have sent him money.", "Severe neglect that made him grow up too fast. He is diagnosed with PTSD", "He says he feels weird around her.", "The situation seems to be similar to that of a behavioral hospital. His rules are placed so he won't go days without showering or wear the same clothes every day, to contribute to the household, and to move around rather than lay about and sink deeper into depression. \n\nHe's been laid off, so this is a perfect opportunity to focus on his mental health and get a routine while being provided for by V. One commenter even typed that T may feel a crush towards V, so is pushed even more towards her.\n\nOP seems to think the housing is wrong because he wasn't notified that he was jobless so he could pay for T's lease. He wants T to depend on him because T experienced adultfication, but that is not solved with infantilization.", "Definitely...someone who doesn't have a god complex", "Exactly! Sometimes people aren’t capable of helping themselves and if you’re too scared of his discomfort to help him get the help he needs, you’re part of the problem.", "Right! And his trauma stems from neglect and isolation. He now has near constant companionship and rules and structure that one gets in a functioning family. The girlfriend seemed to provide the best possible relationship and structure for the friend. OP YTA.", "This right here! T needs to be in therapy and work through his issues. I have an acquaintance who is very codependent with his sister. He enables her just like OP is doing with T.", "I took psych classes in college as part of my sociology degree. V didn’t take any.", "I literally had no choice. My visa issues meant I couldn’t come back but I had no one near to check up on T. I was contemplating asking a health clinic but I wouldn’t want him to be hrut", "Just look at him and buy a sandwich once in an awhile and give it to him or ask if he slept and tell him to call me. \n\nNot rule over his life and make him a personal servant.", "He is diagnosed with PTSD. I’ve been trying to get him on disability. He had a steady job but they went out of business and the other jobs he worked at didn’t understand his needs. He was laid off a few months ago which allowed V to take advantage of him", "No he said “I feel weird around her”", "You are delusional. Helping someone instead of coddling them like a toddler is not ableist in any way.", "Ha ha you think she’s an ableist because she is the only person that has actually done something to help him out of his rut rather than enable him to fall further into depression.\n\nI do agree however that OP should let her go as he clearly has no respect for her and frankly she can do better than a man who is actually hindering his friends recovery because has a hero complex.", "She genuinely believes that there are ways that people can help themselves instead of acknowledging that there are problems too big to solve", "That's not healthy for him. He's an adult who needs to learn to take care of himself. She's giving him a free place to live and allowing him to take on some responsibility in a safe and supportive environment. Handing him money isn't doing the good you think it is.", "Has he told you this or are you assuming this? And you still haven't said whether he's happy with the situation or not.", "So he got fired from his job and kicked out of his apartment and you wanted your girlfriend to just... What? How was she supposed to help him without interacting with him? You just wanted her to wait on you who was trapped out of the country?", "Textbook definition of enabling. It's great you want the best for your friend, but you've been treating him like he can't take care of himself. The only way he's gonna learn how to survive as an adult is if he faces some of his issues.", "That doesn't explain anything. What kind of weird?\n\nWhat were the rules? His other chores? Why didn't he say no(child neglect in adults is different for everyone) since he has his own place? Was he expecting to be taken care of like a child?\n\nHow did he feel about this event? About cooking, cleaning?", "Is he uncomfortable with the current arrangement though?", "On paper, it sounds like everything T needs. Being goalness and having zero responsibility is so counter intuitive to recovery, maintenance and stability for people with mental health issues. Part of me hopes that V knows this and is actively trying to help and OP is scared to let go of the control they have had. I don't blame OP for this, it is very hard to shake the belief that you know exactly what is best for someone you've put so much time into caring for, and it's incredibly scary letting go of that. I don't think OP is being maliciously controlling and gets a kick out of this, I genuinely think they are really scared of T being hurt and they believe they are the only person who can prevent it, ultimately hurting T in the process unintentionally. \n\nIt seems to me that both he and T need to see a professional about this as their dynamic is definitely not healthy for either of them. It is also concerning that OP thinks his GF is actually exploiting T, that's a serious accusation. It's a difficult situation all round.", "***SERIOUSLY?!?!?!*** I took psych classes as part of my business degree but I'd never presume someone's needs/condition based on them. They don't teach nearly enough in an elective/minor in undergrad to have that qualification. Get off your high horse.", "So you took a psych class and you are serious that you know full in what T needs? It really sound like you like having him dependent on you. You’re not exactly helping him, you’re enabling him. You also have yet to answer anyone who asked what T thinks about all this? \n\nWas this also not the situation not long ago where your fiancé wanted to know the situation with T and was upset that your would not disclose to her his mental health issues? I’m almost positive the names here are or close to the same in that one.", "Yeah I got a whole bachelors in psych and I still wouldn’t presume to know what’s best in this case. Yikes.", "Ahahaha... no", "Hahshahahahahahahahahah omfg no you did not just say that.\n\nYou should have left it with I know T instead of I took intro to psych 5 years ago.\n\nA fool I swear", "That doesn't qualify you to define his needs.", "LOL he needs someone that is fully trained not someone that took a few classes.  there are specialty therapists / pyschiatrists that actually are trained to deal with certain traumas.", "So you are asking her to go feed him and give him a bit of attention like someone asking a friend to check up on their dog while on vacation?", "Isn’t that in a way making him do things and giving unsolicited advice? Ie. Making him eat, not trusting that he’s capable of eating or sleeping on his own, making him call you?", "How does looking at him help? What does her gaze accomplish exactly? And buying an unemployed person a sandwich doesn't help them for more than a few hours. It sounds like she had much more comprehensive help in mind, but you're upset because she's not treating him with kid gloves like you would.", "Why are you with (or seemingly still want to be with) someone who you feel has taken advantage of an unwell person by making your best friend an indentured servant? If everything is as you say, then rescue him and get him out of the situation! If you could have paid his rent rather than him moving in with V, then you certainly can find a place for the two of you. If we are to take everything you say as gospel then why are you even asking AITA?", "I'mma say you're NTA, but you should all sit down and work something out together, presuming you and v stay together, otherwise just you and T. \n\nT does need to try and have his own agency and advocate for himself. I'm not saying don't help him and stuff, but he does need to try and get some self-worth. Perhaps some therapy if he isn't in any right now? Or at least working out some sort of long term plan/goal with him?", "Buddy, that could mean just about anything. You need to give better information if you want people to actually see your point of view.", "No. I think she's an ableist because I've had hip and knee problems all my life and I've been pushed to do things that hurt my body while being told it's \"all in my head.\" Maybe I read this post wrong, but that's where I'm coming from. I'm almost always in pain now.", "So you're saying he's beyond help? That your sole aim for him is that he stays alive and remembers to eat, per another response you gave? That's pretty sad. You think she's made him into a servant; I get the feeling you quite like him being so dependant on you and you're pissed off now because you see him up and doing things. Nowhere have you given us any indication of how he feels about all this, so I have to go with YTA", "Nothing is too big to solve. He needs encouragement to want to solve it, and it seems like you discourage that at every chance.", "He says he feels weird around her", "He says he feels lightheaded around her and that he constantly needs to impress her and make her happy. I’m afraid it’s his trauma coming back. \n\nThe rules were getting up by a certain time, wearing different clothes, stuff like that. Micromanaging essentially. She once washed his hair in the bathtub because he couldn’t physically do it. \n\nHe got laid off and instead of telling me about it so I could pay his rent, he let V strong arm him into living with her in exchange for doing all the chores like cooking and cleaning.", "But it isn't a difficult situation all around. It is one person making sure another doesn't get what they need. He is toxic. His absence created growth. \n\nT is getting what he needs and is growing and V is helping him financially. OP doesn't want a friend in T, he wants a dependent, that's why he's arguing for exploitation as his role has been compromised. T and OP don't need counseling, OP needs to get hands off as he's the one in control of their dynamic. If he had pushed for V's advice, the housing, and the time off, they wouldn't be in this dynamic.\n\nT chose not to tell OP he was jobless and homeless. He chose to live with V. He chose not to look for a job and stay and is improving. Now OP is back and he wants to reverse it.", "I watched an episode of M\\*A\\*S\\*H with Dr. Sydney Freeman in it (he was the unit's psychologist). Does that count?! It was the one with the young and upcoming John Ritter.", "It’s not how I would put it but yes. V is too overwhelming for T", "He said he feels lightheaded around her or even thinking of her and he needs to impress her. He was almost having a panic attack when he told me.", "It's depression and OP says PTSD from adultfication, but notes because he took psych classes in college, he knows how to handle it.\n\nIt isn't anything physical. OP is infantilizing T. \n\nT's rules are to wake up at a certain time, take a shower, and change his clothes everyday. It is similar to a behavioral hospital. T used to have a job, got laid off, couldn't pay his lease, so went to live with V rent-free. While she provides, he contributes to the household. \n\nMental and physical issues are completely different and need to be treated differently.", "I’m sorry you are in pain and no one has taken you seriously over the years **BUT** that still doesn't explain or excuse why you are calling his girlfriend an ableist.  \n\nThere is nowhere in the commentary that says the friend is in physical pain - reading between the lines and the “tit bits” that the OP decides to share does it claim any physical ailment.  \n\nThere was a comment about him having head touching sensitivity **occasionally** BUT it also **doesn’t say** that GF forced the friend to wash his hair when he was experiencing one of these episodes so there is no physical element here…\n\nI hope at some point you find out what is wrong with you but in the meanwhile please try not to project your issues when there no equivalence exists.", "Except she isn’t doing things that hurt him. She’s making him shower and wear clean clothes, and has him doing basic chores so he’s not just sitting around wallowing in depression. She’s actually helping him, while OP has done nothing that actually helps and seems set on keeping him down.", "He suffers from mental health disabilities not physical health disabilities (from what I can gather). As an RN, we advocate for pharmacological and non pharmacological approaches to treating mental illness. As someone who has pretty severe depression and anxiety, I’ve found that a combination of medications, exercise, and therapy boost my endorphins enough. I’m actually no longer on antidepressants just one anti anxiety medication. OP’s friend could benefit from some structure and therapy. I know OP said in another comment that his friend is against therapy because he doesn’t like to talk about his trauma. Believe me, I get that and you can’t force it. He has to want it. I’ve been in therapy for 3 years and I’m just now starting to scratch the surface about my childhood trauma. It takes time, but it’s beneficial to his emotional and physical well-being.", "I’m saying that he needs help now not to be taken advantage of", "So the rules are… follow a basic living structure and proper hygiene?", "Lightheaded and needs to impress her? Sounds like a crush to me honestly. \n\nFrom what you described it seems like T was depressed and therefore isolates himself and you while trying to I assume be a good friend popped over and allowed him to stay there and alone V didn’t.\n\nYou asked her to check on him and if he really didn’t want to go there’s very little she could do to force him. He had to of at least willingly went and moved in.\n\nAlso having been around numerous people who’ve come from neglectful and bad home have set schedules and rules was a big help to them! It helped them feel a bit of control and consistency they were missing! It doesn’t make T a servant if by having V there to help keep him on it if it’s actually helping.", "Yeah, she's getting him out of a funk, getting him into a healthy routine that'll get him on track. He's been through adultfication and sought you to baby him, but that doesn't help him. \n\nNow that he's laid off, he can focus on his mental health. Strong arm? Seems like he went through the option of her and he's contributing while she works. Did you want him to mooch off of her instead? Lay around and waste away? He needs to keep moving especially as he's out of work. \n\nIs she helping him find work, are you? Is he looking for work?", "He was actually a psychiatrist", "He didn't say that. You sound like you're jealous she was able to give him something you couldn't.", "None of that gives me the impression she's abusing him. In fact, it kind of sounds like he has a little crush or fixation happening. Did he say he wanted to leave the apartment? Does he resent the chores? Did she do or say something to make him feel bad about himself? Because if the answers are no, you may have to face the possibility that your girlfriend actually did well here.", "That sounds like he likes your gf .", "Are these things in the comments? I don't see them in the post. I mean, that's a totally different situation to what I was responding to", "I didn't say no one has taken me seriously. He said she's making him to do things he has trouble with.\n\nI don't know where anyone is getting this dirty or need to wash thing. I responded to the post itself. If more information was added later, why not inform me instead of coming at me? I don't think my comment was uncalled for with the information given at the time. \n\nI know what is wrong with my legs. I was born with bilateral dislocated hips that weren't discovered until I was almost to the point of needing surgery to correct them. I was in braces until I was 2 and have had issues my whole life, not that that's your business.", "I'm sorry, where does it say she makes him shower and has helped him with depression? I'm not being snarky, I don't see it", "Thank you for the information. That was not in the original post. I'm guessing this information has been gathered from comments OP made and I did not see those comments.", "And I think you've been getting a little power rush from being supposedly the only one capable of helping him, handing out money for rent and keeping him dependant on you. You have been treating him like a child. I have read all of your responses and there is no indication that you have actually asked him for his opinion or about what he wants.", "YTA she is clearly not taking advantage of him.\n\nIf you got off your high (hero) horse for even a second you would see that she is helping him have a normalised life by assisting with household chores (like any housemate) and maintaining basic hygiene.\n\nYou have been enabling your friend for too long.  \n\nYou are not clearly not qualified to help him and apart from making sure he isn’t dead and has a roof over his head you have done NOTHING to assist him with getting the help he needs.\n\nYour girlfriend has made progress with getting him to do basic life chores/activities and you are clearly jealous that you can no longer put on your superhero cap and drop off some food and money to him.\n\nYour girlfriend is not the one who has been taking advantage of him.  You have been taking advantage of him to make yourself feel like his protector/hero.", "Having a safe home with structure and support in exchange for doing some chores is nowhere *near* \"taking advantage.\"", "He can’t eat 3 meals a day every day. It will make him throw up. Sometimes his hair is too sensitive to be touched. Sometimes his work clothes make him uncomfortable. The rigid rules don’t help him", "No he’s not looking for work. V says she’s too busy to help him find work and she is fine with the situaiton", "if you know literally anything about trauma then you know that feeling lightheaded and like you need to impress someone, and being near panic when talking about it, is a trauma response. that doesn't mean she's abusing him, but it means that something about her or her behavior is triggering his PTSD and that is not a safe environment to be in whether or not the other person did anything wrong.", "Says who? You?", "it sounds like you might have understood what he needed at one point, but times change and people grow to need different things. now you're just being suffocating, and it's time to let go a little bit. is everyone here but you wrong? are you just the one right person in this situation? folks are all saying the same thing, and it's up to you to listen. do you want to help your friend embrace this new chapter, or do you want to hold them back? feel free to keep an eye on the situation, but take some time to acknowledge that maybe what's best for him has changed, so you'll need to change to. YTA, but only because it's hard to see a friend grow up. It's almost understandable, but the way you're handling it is almost obsessive.", "Has he told you that since being with V? Has he actually said to you this is hurting me and I want her to stop? No? Then back off and realize you might actually be hurting him more than helping. YTA for acting like T literally can’t say anything for himself", "Is that what he said happened, or is this more of your freshman psychology knowledge?", "Of course she's fine with the situation, she's HELPING him. He's being active, contributing, and focusing on his mental health rather than being stifled by you or his job. How does HE feel?\n\nIf they're not looking, why aren't YOU? This is why people think you're codependent. \n\nThis experience is similar to a hospital and he NEEDS that.\n\nHas he actually been diagnosed and treated for PTSD or did you diagnose him? Just went back and saw your comments about being in psych classes in college.", "YTA. \nAs someone who stayed in a psych ward for 72 hours the parameters in order to get released were the following. In no particular order. \n\n1. Eat at least 1/2 of all your meals.\n2. Shower daily\n3. Do you laundry and wash your clothes. \n4. Take your prescription meds.\n5. Talk to the therapist on site\n6. Participate in group even if it’s responding to one question in big group.\n7. Make a plan for how to continue recovery with social worker and nurses on site.\n8. Drink at least a glass of water a day. \n\nThat’s what’s required to be successful at the place I went to. They didn’t let us isolate. You had to participate. You could nap but they would check on you and have you participate in group. You had to learn how to function. And gave us skills.", "YTA. Did you even check to see how he was doing.", "This sounds weird. I want you to help my friend but don't talk to him or make him do anything. What is she supposed to do, stalk him from afar.\n\nHow is she supposed to help him?\n\nSometimes, people need to be pushed out of their comfort zone to better themselves. I am speaking from experience with my own mental health and anxiety. It's easy to get stuck in a familiar pattern, good or bad, and it's hard to break. When you get comfortable with unhealthy coping mechanisms, it's hard to get out. Sometimes, you have to use tough love and you're not helping anyone by enabling them.\n\nYTA", "YTA- Sounds like T lost his job and home. V let him move in rent free. If she is working and T is unable he should be doing most the house work to help V out.", "I hope you’ll update us when you find out more about his reaction and what he’s feeling more specifically, OP! \n\nFrom here, I agree with most posters that it sounds like you’ve shielded T from a lot of things that could be good for him and that he might be doing better than you think in this new situation. But we can’t know. I think it’s safe to say you have an invested audience.", "I don't know if anyone else mentioned it; I stopped reading. Why are you with someone that would do the things you mention? I don't understand. \n\n\nHave you really been in a relationship with someone who would treat your friend as an indentured servant? And if you have been, that doesn't really make you capable of being the only person who can help your friend. Seems like you have poor judgment and shouldn't be responsible for anyone but yourself.", "So you'll show her this", "How was she supposed to help without taking to him? What did you expect her to do? I hope you break up with her and she keeps T in the custody battle. YTA", "YTA sounds like your girlfriend was helping your friend to me. Did you ask T how he felt about the situation before you freaked out?", "[removed]", "Is this real? WTF is wrong with you? You can’t live T’s life for him. Both of you need to grow up. I hope your gf leaves you for a man who doesn’t have an obsession with coddling another grown man. YTA", "YTA, I’m a Psychology major and recreational therapy is what it sounds like your girlfriend is doing. Since you took a few Psyc classes in college, I’m assuming all you learned was ways to distinguish certain mental illnesses right? That even if you took them your senior year it would have been about 5-6 years ago so your memory could be hazy. She’s giving him small household tasks that he can use in the future to help himself. Also from your other comments him not being able to eat 3 meals a day can come from him not consistently eating three meals a day as your body doesn’t like being fed food inconsistently. Her helping him get to a point where he can eat consistently is a good thing! Honestly I’m impressed she managed to do so much. You just reminding him to eat and occasionally making sure he’s alive doesn’t do much, not only does he develop a negative attachment to you but he also doesn’t learn how to do things himself. She likely taught him how to cook and clean while you were gone. Honestly I am kinda hoping she breaks up with you for T (since based on your responses he likely has a small crush on her and hasn’t fully processed the emotion he is feeling yet) and then he is able to slowly get the help and therapy he needs and YOU have done nothing to help him with.", "The situation with T and V actually sounds very similar, on paper at least, to how a private psychiatric hospital based on a \"community\" model is structured. Certain things - hygiene, sleep patterns, contributing to communal living through chores/duties - are expected, and enforced. (If a patient does not do these things, or is so unwell that they cannot, they are discharged to the community or to an acute inpatient psychiatric ward in a major hospital.) \n\nPatients are given social support and kindness, usually by nurses and social workers, attend psychotherapy and see a psychiatrist. They form relationships with other patients and work towards wellness and have a goal to re-enter the wider community after their treatment, and go on to further goals (including employment if that is possible for them) which include stability and community engagement. \n\nIt sounds like T may have lucked out and fallen on his feet, in a supportive and structured environment - for free, instead of thousands a week.", "YTA, as someone who has mental health issues and can be depressive at times. If I don't have a structure or routine ...forget it all bets are off.\nIt sounds like in the 6 months you were gone, your girlfriend provided the following for your friend: structure, routine, a safe place to process their mental health and companionship. All without accepting monetary compensation. \nI think you are struggling with the fact that this works for T. And now you don't think you will be needed as much to play knight in shining armour to him.", "How are YOU helping him grow into a functional adult? What have you done to help him learn the skills to survive without you? You are holding him down so he never has a chance! Leave him learn!", "YTA", "ESH — a couple of things are really bizarre about this post.  Why are you with your girlfriend?  You said you protected T by keeping him from her.  I wouldn’t want to be with someone who I was too scared to introduce to my best friend.  I’m generally, the way you talk about your girlfriend has a pretty negative connotation so idk why you are with her.\n\nBut also, you know how she is and what her thoughts are in the situation so why would you ask her to check in on him?  You know she’s not going to do it in the way you feel is best so you’re just setting yourself up for disappointment.  And I think it’s weird to send someone he has never met before to “take care” of him.  Couldn’t you check in via FaceTime or something?\n\nBut also, seems like V gave him the “tough love suck it up” method which many people in this comment section seem to agree with, but I don’t think that’s necessarily the best approach.\n\nBut it seems like T needs some actually professional medical help here.  You seem to care a lot so I really suggest you take steps to help make that happen.\n\nAnd FFS, break up with your girlfriend.  You clearly don’t like her.  Your belief systems and the way you operate are just too different.", "Info: have you asked T on how they feel about this?", "Man, there's a lot to unpack here. ESH. It sounds like you and your gf are trying to help in the ways you think are best, but neither of you are treating your friend like a person with agency. You're too soft on him, she's doing too much. It sounds like you all need to talk to each other like adults and let your friend express his needs and also take some responsibility for his life.", "I'm so confused about all the Y T A responses. This seemed like one of those situations you really can't pass judgement on without knowing a lot of details about how the living situation was. Everyone in the comments is assuming that V is having a polite and friendly relationship with T. \n\nWhich could totally be the case, but we don't know that. It doesn't help that OP is giving extremely vague responses and doesn't have any proof of V doing anything bad. \n\nHowever, the comments are insane. OP keeps saying \"He feels weird around her, lightheaded, wanting to impress her\" and the first thing the comments say is he has a crush on her. \n\nSeriously, wtf. Yes it's possible, but OP also said T almost had a panic attack while telling him this, and people are still on the \"He has a crush\" train. I don't think anybody here is qualified to make that assumption and directly assume V is helping him improve and not actually making things worse. For all we know, T might be feeling backed into a corner and doesn't advocate for himself. \n\nOP does seem like he wants to be T's only saviour of some sort, which is pretty weird. And I agree with the coddling comments. But almost no one has mentioned how V made T move in and start a new arrangement without informing OP. Was it really her place to do that? Regardless of whether he is right or wrong, it's basic common sense to inform him or ask him before doing so. Even if this is much better for T's health, things could've gone very wrong and she should've communicated with OP beforehand.\n\nFrom the information given, ESH.", "You are a man, your girlfriend is a woman, so everyone is going to tell YTA. Welcome to Reddit. \n\nBtw NTA", "Sounds like she's actually trying and succeeding at helping your friend. YTA.", "Talk to your friend. Ask him if this is helping. I'm a survivor of trauma with multiple mental health issues and other disabilities. I have an amazing friend who is also my carer. She does know when to push and when to leave me be. And she knows that from talking to me.\n\nIf this is truly about what's best for your friend, Reddit can't help you. Your friend can, and getting him into therapy means his therapist can help him set goals for improving his life and health, but strangers on the internet can't help her.\n\nBut YTA for making assumptions and yelling at your partner over them.", "YTA. Regardless of the rest of this-- whether V's strategy or yours is the best for T, ect ect-- you're an asshole for asking V to help T and then calling it \"breaking a promise\" that she went and did the exact thing you asked of her. Sounds like you're the one behaving abusively to the both of them, tbh?", "YTA, you should thank her instead", "YTA - Sorry someone finally stepped in and actually helped your friend instead of just enabling him. I hope she didn't do anything else terrible like get him into therapy or maybe found him a job. Heaven forbid she possibly spoke to him instead of playing charades like you asked of her. \n\nAudacity really is on sale this year and you must have got it real cheap.", "YTA", "This sounds like Munchhausen or better yet, Factitious disorder. If he wasn’t capable of any of these things then your girlfriends demands didn’t suddenly make him capable. He was always capable, you just enabled his “inability to do anything.” I think you’re used to being the knight in shining armour and you need the validation that you’re the only reason your friend is handling life, and now that you realise he actually doesn’t need you, you can’t cope. YTA and don’t support or love your friend at all.", "YTA, sounds like you need T more than he needs you. He sounds like he is doing better since living with V.", "Oh no your evil (ex?)girlfriend is mistreating your friend by (checks notes) making sure he eats regularly, stays hydrated and maintains a base hygiene standard of showering and changing clothes daily? And stays somewhat active doing chores (which anyone thats ever shared a house can tell you, its the work of the devil himself)? \nHow dare she torture him like that /s", "YTA \n\nV wants to date you, not you and T. Two years down the track, she's probably wanting to start a family with you, while you're busy fathering your childhood friend. \n\nYou say your girlfriend doesn't understand mental health, but neither do you if you think being a type A perfectionist excludes you from that. And as an aside, what does being nosy have to do with it? Weird thing to say about your partner.", "INFO: How did you not know he’d moved in with her? You were gone 6 months and you and your friend never talked about it?", "YTA. Seems like finally someone is trying to properly help him vs. just babying him. Sounds like your gf is a really good and kind-hearted person that is trying to prepare him properly for a life alone.", "you… asked her for a favor and then told her not to talk to him? you… thought that made sense? it is certainly weird that she’s moved this man into her home and now has him doing labor for her, but you could also be an ass and just overexaggerating + he’s just cooking and cleaning like a regular housemate would. given your words, i’ll go with the latter for now. YTA\n\nyou’re also SUPER vague about what he’s got going on. is he special needs? can he not\nmake decisions for himself?? you make it seem like he’s incapable of anything when clearly, that’s not true at all.", "Yta.....I know you mean well, but you're NOT helping your friend. Your gf is actually helping him. He NEEDS to learn how to cope with whatever drama he has and he NEEDS to learn to take care of himself. Sounds like your gf is helping him learn the skills he needs to function as an adult in this world. You've been enabling him to me dependent on others to care for him instead of doing it himself. Yeah, be a support system for him, but you also have to push him to learn to care for himself. You won't always be there, as proven by your 6 months hiatus. Or do you LIKE him being dependent on you for some reason? Because it's really weird you've never allowed them to meet. That's just not normal. You'd think you'd be happy your friend is becoming more independent. Are you sure you're not more angry that you're losing control of your friend and your gf DARED to disobey you? Because you seriously wanted her to go help him, but not talking to him or try to encourage him in any way. Also, what do you mean by help? What did you have to do for him exactly? There's definitely more to this story of she threw you out but kept the friend there.", "NTA \nNTA \nNTA \nT went from being housed independantly by a lifelong friend without condition. to housing based purely on Vs whims. if he has an episode and doesnt stick to his \"chores\" what happens? if v and op split up will she be able to isolate T from op? \nthis makes him vulnerable to being made homeless at any moment. \nEmotionally vulnerable people are at a much greater risk of being exploited and abused. \nop asked v to check in on him not upend his life for her own gain. if she wasnt prepared to just check in she shouldnt have done anything. \nif op wants to use his own funds to pay for Ts expenses he can, V saying its a waste of money is irrelevant. \nhas V told an equivalent money amount to T for the rent? if he wants a new job is it even feasible?", "So V gave your friend a job he’s able to do and a place to live?", "[removed]", "This is what I am thinking. How often did OP check on their friend if they didn’t even know they had moved in with the (ex) girlfriend.  I say ex cos if I was her he would be the ex now.", "/u/Disciplineset is a bot that stole part of this comment: /r/AmItheAsshole/comments/13c9ejd/aita_for_saying_i_cant_trust_my_gf_because_she/jjeogmo/", "not sure why you posted here. you are very close minded. were you thinking everyone would call you nta and you would be vindicated for yelling at your gf? unfortunately you don't appear to be understanding that you might be part of the problem regardless of your good intentions. you should consider some of the  rational responses to your post  and act accordingly.", "Oh but he needs you??? Think about that OP. Maybe he is capable of more than you’re giving him credit for.", "You could have outlined how t is being manipulated. Is she threatening him with eviction if he doesn’t clean up everything? Is she telling him he is useless or worthless unless he performs these tasks for her? Is she using or threatening violence against him for failure to comply?\n\nOr does she just expect a certain level of hygiene and contribution that you didn’t believe t was capable of and you’re feeling some way about him becoming more capable of day-to-day living without you rescuing him?", "Nah, we understand you just fine. You're still wrong. Accept it, and maybe try to learn form it.", "We r  not. Ur just a major AH", "INFO: how could she help him if you barred her from talking to or having him do anything? Also did you friend look better?\n\nSounds like your codependent, and if less about your friend and more about **you.**\n\nYTA - and a few psych course do not make you a licensed therapist. You cannot treat your friend and what you’re doing is beyond unethical.", ">maybe remind him to eat or sleep once or twice.\n\nSomeone who doesn't have actual brain damage needs to be pushed towards routine and structure for their own safety and health. If nothing else. What if you were single and this happened would he have starved to death? Exhausted himself into pure delirium? \n\nYou can have empathy for the stolen, broken childhood but at some point he does have to start reclaiming his adulthood - from the info you've given he's fully stagnated - do you not think he may find happiness and fulfilment if he had say a job, and a clean house - so like you he could go date a pretty girl, or go on holiday for a change of scene, or get himself into a gym habit or whatever? If everyone who's been through trauma just stagnated permanently we'd live in a very different and much worse world", ">I’m the one that understands what T can and can’t handle.\n\nHoly crap, thats a massive red flag right there.\n\n&#x200B;\n\nYTA.", "You sound like you want T dependent", "Are you a professional therapist or psychologist? \n\nIf not, you have NO CLUE what he actually needs. Just what you *think* he needs.", "Seems like he can handle doing things just fine.", "/u/Disciplineset is a bot that stole part of this comment: /r/AmItheAsshole/comments/13c9ejd/aita_for_saying_i_cant_trust_my_gf_because_she/jjfkht2/", "Still not answering the question. Best option I think at this point would be therapy, with a good therapist to help T towards emotional stablity.", "you seem incapable of answering this question with any coherency on multiple occasions. it's why responses to your posts are coming   across as frustrated. esa perhaps? or high functioning autism?  you seem incapable of understanding the responses here and won't even consider that you might be  the ahole. sorry  for being blunt but your tunnel vision isn't helping your cause", "I really strongly agree with this. OP might also look up the victim/persecutor/rescuer triangle to help better understand why so many commenters are saying he’s enabling his friend vs. actually helping him.", "Exactly. Sounds like someone has a savior complex.", "Op wants T to need him", "Not to mention he comments the same thing to that same question throughout the thread with very little detail after if he elaborates", "Op needs t to need him. It’s where he gets his sense of purpose from.", "If she didn’t take him in, where would he be?  Free rent in exchange for chores is easy unless your gf lives in a mansion.", "T has mental health concerns so great he needs an outside party to remind him he needs to eat and sleep, and because he, in literal, cannot keep himself alive. But you didn't want to call qualified health professionals to assist him because he could get hurt? My fellow redditor in christ. T is going to get hurt if he DOESNT get professional help.", "This is what happens when you have “dependents” in your care. Should’ve taken him with you since you’re the one who’s knows him and his needs and can take care of him. 🤷‍♀️ I can’t just up and leave my two (actual children) behind if I leave the darn house much less the country. And I also don’t get to pawn them off on anyone much less someone who would be a stranger to THEM (your gf). \n\nSorry bud, can’t have it both ways.", "Guess what? Feeling indebted to someone who gives you a free roof over your head and food in your belly is actually normal. So what if he does a little cleaning to compensate? \n\nYou’re actually hurting your friend by not letting them grow and experience grown up life. There are lots of people out here who have mental health issues including PTSD that manage to learn to function as everyday people. Sounds like your (ex) GF is giving T an opportunity to do so in a safe environment.", "It feels like you NEED to be relied on by T . It feels like a ego boost for you, makes you feel important. I dont think you actually care about T, you're not the only person who understands him. You wanna be special and its disgusting that you're basically babying T who needs structure and help. \n\nYour mentality on this and T makes me feel ick because it doesnt come from a place of love just feels manipulative", "I have PTSD, among other disorders. It doesn't render you helpless.", "And I stayed at a Holiday Inn Express last month for work. I’d say we are equally qualified to say what he needs, which is not at all.", "Dude, what happens to your friend if you get hit by a bus or some other accident befalls you? You are not helping your friend at all. I fully get he needs a support system. But you’ve isolated him to the point that it’s only you. There’s a reason it’s css asked a support “system.”  Please, think about what truly is best for your friend. What you had put in place was definitely not what’s best for him. And if you took even a psych 101 class, you know in your heart that you’re not truly helping him.", "Duuuddee. Noooooo. I was a psych major and am not qualified for shit. Sorry but the few classes you took in college mean nothing!!", "Lmao I passed AP psych during high school so apparently I know everything about psychology", "Ok so you don’t know shit then. Sounds like gf was making better strides than you did.", "And I took accounting classes but I wouldn’t do someone’s taxes. This argument just shows how ignorant and immature you’re being.", "🤣🤣🤣", "yeah cause a sandwich will fix him /s\n\nnone so blind as he will not see", "So it’s manipulative to do more than toss him some food now and then like he’s a poorly treated pet lizard? What do you think mental health recovery looks like?", "OP is YTA. \nOP is continuing to create a situation where T can’t grow and yet OP *left* T (as T’s *ONLY* support) for 6 months. \n\nYou can’t do that! OP should be encouraging and helping and fostering T’s growth and healing (with a professional therapist involved). But it’s 10 times worse that OP created this unhealthy and codependent relationship and just *left* T for 6 Fricken months. \n\nJust completely wild.", "more like watering the plants.\n\nop gives no credit to v and t", "But is that... bad? Because \"feeling like you need to impress someone and make them happy\" really isn't necessarily a negative thing-- did you not feel that way about her in the honeymoon stage of your relationship? And she's taking care of him-- I've definitely felt lightheaded and like I want to make them happy when my partner takes care of me while I'm ill or vulnerable... I know that those are relationship-feelings, not necessarily a great set of feelings to be developing between your best friend and your partner, but my point is that the feelings themselves aren't harmful and traumatic feelings. Those feelings can be good.", "He feels weird because she's not coddling and actively harming his mental health like he's used to with you.", "I've watched every episode of American Dad featuring Dr. Penguin. I guess I'm an expert now too.", ">Lightheaded and needs to impress her? Sounds like a crush to me honestly. \n\nPretty girl actually gives a shit and wants to help the lad with poor mental health reach his potential - no bullying, no insults, just genuine compassion - after lad was a hermit who did work/home/work/home on loop for...months? Years?\n\nYeah T is what psychology experts would diagnose as \"heterosexual male\"", "He could also feel weird around the girlfriend because of how OP has kept them separated before he left and now that he is back his friend is feeling guilty or ashamed that he did something that OP obviously disagrees with. He may have been totally fine living with OPs girlfriend until OP returned and made a big fuss about everything. His friend would obviously want to impress or agree with OP over the girlfriend because of their long standing history.", "Yeah, read the comments. People bury the real info to make them look better. Ask questions before thinking it's your situation, because that's how you make OP feel better for treating T like this and V like the villain when this is the best course of action short of actually putting someone in professional care. \n\nYou are independent. T is not but V is helping with chores and rules. Once he's able, he can add a job to that, then living alone, but OP is interfering. He only wanted to pay for his rent and has yet to answer if he was going to look for a job for T. \n\nIf T does not find himself able to work, he is still contributing and giving his life 'meaning' and being active. OP has not answered what he wanted T to do instead of contributing in her house, but I assume to just mooch off and be treated like a child.", "In his comments. OP calls it treating T as a servant, but his gf is giving T free food and lodging, and in return she makes sure he gets up at a reasonable time, wears clean clothes, washes himself and has him doing basic chores.\n\nOP asked her to look after T while he was stuck overseas, but in a comment he reveals that by “look after”, what he actually meant was take him a sandwich and make sure he was still alive a couple of times. He didn’t want her to do anything to actually help T because OP has decided that T is beyond saving and that anything that actually helps him is bad.\n\nIf you push him about how T feels about the situation, OP just says that T said the gf makes him feel weird. But if you keep pushing for an answer, he admits that what T actually said was that she makes him fell light-headed and that he needs to impress her. Which makes it clear that T has developed a crush on her, but doesn’t know what it is.", "You do realize it’s unhealthy to not be eating 3 meals a day/regularly eating right? It seems like your GF cares about how he’s doing and would be sympathetic if the rules hurt him but getting into a regular routine and having a scaffolding to build your life around can help when you’re dealing with mental health.", "change and growth is UNCOMFORTABLE. It's completely expected that positive changes will hurt for a while. It's why people hesitate to do it. You are hindering his growth and infantilizing him. Everything your GF is expecting of him is normal routines established by health professionals for people with depression.\n\n&#x200B;\n\nI mean come on, your GF is WASHING HIS HAIR FOR HIM. That is incredibly selfless, not selfish. You don't do that for people who you are taking advantage of. You do that for people you WANT to see grow.\n\n&#x200B;\n\nT needs your soon to be ex much more than he needs you. YOU ARE HURTING YOUR FRIEND. There is gonna be times when you can't be there to coddle him, just like recently. You can't be by his side forever. He needs growth so that way he could survive ON HIS OWN WITHOUT YOU.\n\nYou also need therapy as there is a clear savior complex built up in you. Heck, if you continue to coddle him which is harming him, you could even throw Munchausen by proxy syndrome in there.", "Exactly he doesn’t want to be left behind as he had in the past. Op I think is also co dependent . Friend seems to have benefited from the gf. If he wasn’t he would have left or never gone", "Thanks, I got here early and didn't see any of that. I never thought this was \"my situation\" but you're right that I made the mistake, somehow, of empathizing with OP without the critical thinking I normally apply. Guess I'm just having a shitty day. I'll edit my comment to change my vote. Thanks again for the info", "Thanks for explaining. There were no comments from OP when I originally commented. I've since changed my vote, since a couple of people have told me that. Normally I catch things like that, not sure why I'm off today", "Well he did take a few psych classes in college", "It's easy to do so in this case, so I understand. \n\nI hope your day gets better or tomorrow becomes fantastic.", "You are not helping your friend but rather let him suffer from his issues and become completely dependent on you. He needs to seek medical help asap if he is as dysfunctional as you’re describing him as. \nAlso, living rent free in someone’s house and helping with chores is NOT a slave. Also, you cannot just ask someone to take care of a whole-ass grownup human without providing ANY information to your girlfriend. What did you expect to happen? \nYour comments make you seem like you’re trying to be the savior of your friend and completely disregard his needs in the meantime. He doesn’t need you, he needs ACTUAL help. Not a savior-complex dude with control issues.\nYTA", "YTA. V is a legal adult, but you seems to think of him as your incapable toddler. You prevent his growth and development by limit other social contact with him, prevent him to do everyday life chore. You are essentially abusing him.\n\nStop taking away his autonomy. Show respect to people with mental difficulties.", "my dude, you are a toxic friend and you too need therapy. \n\nyou are enabling your friend and basically you generate a relationship of dependency. without proper help, he will never be able to be independent. \n\ni understand he doesn’t want to go to therapy (which personally i think it’s wrong - what is he expecting to happen if he just stews in his trauma?), but *you* could go to therapy and learn how to help him. or at least learn how not to incapacitate your friend further. \n\nYTA for yelling at your girlfriend who is trying a healthy approach.\n\nby the way, has your approach generate any progress?", "YTA I don’t understand Op’s logic by telling gf to help him but not to ask him to do anything, OP treated friend like a baby? Gf makes sense, as a depressed people with abandonment issue, all we need is somebody near us, and tasks are good for the sense of ‘achieving something’. I hope gf dump Op", "INFO: has your approach of completely enabling your friend generate any positive development in him?", "You keep mentioning all the things he can't do... but he seems to be doing them since you're not there.", "YTA. It sounds like you’re upset that she’s helping your friend become more independent. That includes being less dependent on you, which I suspect you enjoy and is the reason you’ve enabled him the way you have.", "Yeah, it sounds like your girlfriend is actually helping your friend? Like really really helping him to get on his feet, become actually functional? So basically, he is on the path to be employable after a while?\n\nYTA", "Behavioral changes, or additions or even trying new things, when possible, can work wonders for people with trauma. YTA", "Literally so many people are correct. \n\nYou didn’t want her to talk to him, therefore she don’t know him….but u left him in her care for 6 MONTHSSSS. \n\nLeave.", "OP, something I notice is that you didn't include T's thoughts on the situation & if he thinks it's helping or hurting.\n\n&#x200B;\n\nIt's **very** weird that neither V or T mentioned they were living together. I think being blindsided by this is entirely normal & this is an issue that needs to be discussed separately from all the others.\n\nI'm inclined to say NAH, just 3 people dealing with a complicated problem. You have tried to do good for T, but I think you need to consider your limitations, where you have succeeded in helping & where you have failed.\n\nUnconditional support & aid is a good thing.\n\nTough love & pushing someone to grow **is also a good thing.**\n\nHaving someone that supplies each is good combination.\n\nSomething you should deeply consider: You asked your GF to check in oh him, but once you introduce people you cannot control their relationship. You asked her to help & she is investing **a lot** of time & effort into helping someone you care about & she very likely only cares about because you do.\n\n(assuming she isn't a monster & this is not a purely exploitive relationship).\n\nWhat kind of stuff is on his list? \n\nWhat are the rules?\n\nAre these things you think are healthy? \n\nClean my house & sit silently in the corner is bad.\n\nContribute to the household & take care of yourself is good.\n\nI'm inclined to say NAH, just 3 people doing their best in a complicated situation without easy answers.\n\n&#x200B;\n\n> I yelled at V and said I couldn’t trust her because she broke her promise to not interfere with my friend.\n\nI want to reiterate, it's **really really** weird to be surprised by this & **is** a violation of your trust regardless of if the motivation is kindness, exploitation or something else.\n\nWhy didn't either V or T talk to you about living together & everything else?\n\nDid V & T actively misrepresent the situation, or did you just never talk to either of them about it?", "Info: Everything here depends on how V feels about the situation. What's his take?\n\nLooks like you already answered in another comment. NTA", " NTA. He’s not a servant & should not be treated as such. Girlfriend is happy cause she’s got free labor!", "NTA. Your girlfriend sounds abusive. What are you doing about your friend’s situation ?", "YTA You basically forced her to help your friend. When she did and she seemed to be more successful than you in helping him and he actually appeared to be able to take action you blamed her. Stop babying him. You’re not helping him.", "After reading through the comments, YTA.", "INFO: do you think what you’re doing right now it’s working for him? Because you told us you’re basically enabling him, and things never changed. Instead your gf hosted him when he was in trouble and in exchange asked him to have a structure/a routine and help out in the house. And it doesn’t seem like he’s worse for it? You said “you fear it’s his trauma coming back” but is he hurt? Is he suffering?\n\nI’m also curious about the glorified servant thing. Isn’t it normal to do things for people who are hosting you for free?", "Sorry bro you are wrong on this. Apologize to your gf.\n\n&#x200B;\n\nYTA", "YTA\n\nIt sounds like V is letting T work in exchange for a place to live, food, etc. That seems like a normal and healthy exchange. He has structure but can stay at home. He is probably learning how to function better than if he did nothing. \n\nT is an adult. If he didn’t like any of this why didn’t you know for 6 months? Did you never call him? Why wouldn’t he move out if he hated it?", "Honestly sounds like T needs therapy if he isn’t going already… you’re coddling him a lot and it seems like a very codependent relationship. Provided that V isn’t exploiting him, it sounds like she’s giving him some level of structure and occupation. \n\nYou’re kind of an A.", "YTA\n\nIt seems that T thrives on attention and structure and V is making sure that he has both.", "I think the three of you need some sort of group counseling session.", "YTA and also part of growing and overcoming is not putting someone is a bubble and sheltering them from the world. I don’t think your girlfriend is making him a slave if he is living there for free he should be helping with cooking and cleaning full stop. He should be learning to become an independent adult. Having PTSD myself, you aren’t going to over come it if you just shut yourself off from the world and it’s not really a life you should want for your friend either. You can’t make progress without facing the reality of certain triggers etc. That’s a scary thought I get it but it does require alot of work and some of that is hard work.", "yta and hopefully single soon 😁", "You’re just mad/jealous that your gf is actually helping your friend instead of enabling him like you have done for so long\n\nWhat your GF is doing is showing him how to be a person when you’re not around, whereas it sounds like you want V to crumble unless YOU are the one to save him. YTA", "This whole story is weird as hell i honestly dont know OP I don't know......lol", "“I took a few psychology classes in college” well I actually have a psychology degree and YTA!", "maybe i’m just a cynic but i have a hard time believing his gf would spend a quarter of the total time they spent together totally single and helping his friend function in society. also it doesn’t seem like the pair are doing long distance as it seems like this would’ve come up before OP got back. like i don’t think the girlfriend is the asshole, and i don’t think OP is for wanting to help his friend. but there’s a line and I think OP crossed it, sometimes you can be overprotective and overbearing with the best of interests to someone else’s detriment. like i don’t think OP is doing it on paper but what he’s doing isn’t a long term solution. so OP you’re not an asshole for wanting to protect your friend but YTA for not listening to the judgments here and being so certain in your beliefs that you refuse to see how what you’re doing may not actually be best for your friend long term. also you’re insane for your psyc class comment. that’s literally meaningless, i could say i took one space class and am now understand astrophysics. get your friend real help, and if the real psychologist says what you were doing is best then fine, but until then you have no reason to be so sure.", "Info: do you even like V?", "Hard to say. It really depends on how T is feeling. Is he feeling better? Is he more productive? It comes down to how he is doing.", "Lmao these keep popping up. Marry ur friend and get on w life eh", "YTA. He needs a little tough love. I had a friend in a very similar situation. I shielded him and made sure everything was “nice”. Once I pushed him a little to step outside his comfort zone he started thriving. Your gf seems like she was striving to break his routines which could be a good thing.", "Hmmm idk about that. It's hard when people don't understand a mental illness and try to push a person into doing something they are not ready or never will be. But the way you described, it doesn't seem like she did that. The things she made him do don't look too bad at all for his mental health. Maybe they are even good. If he was truly unable to live like this, he would have had a breakdown already, don't you think? I feel like your guys should talk about it. You should recognize the situation has changed and your friend is more capable than you believed. Your girlfriend must be ready to be flexible if needed because, despite being capable to do a lot, he still has issues that need work and it's a painful process. Your friend isn't voiceless in this situation and should be able to express what he thinks, how he felt about this new situation and how he wants to live from now on. He is not a kid or a pet. It sounds like everyone was just trying to do the best for T in your own way, even though you ended up antagonizing each other. I'm going with NAH", "Idk if I can trust that this is everything, he was cooking and cleaning? But was it really like a servant or as an adult with responsibilities lol idk I think you might be TA", "YTA\n\nDon’t do anything with him or talk to him but take care of him…\n\nIt sounds like she is taking care of him. He is learning to be part of a household. He lives there and he is doing his part. He isn’t being coddled so he stays wallowing in his issues. \n\nYou are mad she didn’t take care of him the way you do it. But she is not you and she cares enough to take care of your friend. Why not be surprised and happy he is functioning and making progress instead. Maybe you should consider your approach wasn’t the best way to help him.", "YTA. Sounds like you don’t realise that having direction and routine is a good thing for some people who struggle with mental health.\n\nYou wanted your gf to help without talking to him? Pretend he’s invisible? Yeah that’s going to really make him feel better.\n\nI think you might have purposely held your friend back because you wanted to be their saviour and have a saviour complex, so you kept him broken.", "YTA. T is a whole ass adult who can say no, and they didn't and moved into your gf's apartment and is helping out and being active. Something you couldn't manage to do because you're coddling T and treating him like a human pet/child. T can always leave. T is not. Maybe you should actually look at that dynamic instead of flipping out she didn't obey your direct orders. She's your gf (or ex now), not your subordinate.", "YTA, dude as a fellow person with a horrifying childhood and cptsd .... You still need to learn to clean and take responsibility at the very least. He's getting free rent, so does chores in exchange. That's 100% a valid arrangement. We can't move on from our pasts if we just spend our lives wallowing. If he feels \"weird\" living with your girlfriend, then he needs to make changes in his life to move out on his own. \n\nSeeing my drug addict parents my entire life put a fire under my ass to create something better for myself. Yes its tough af (ptsd flashbacks and crying on my way to work and school many days), but getting out of your comfort zone makes you grow as a person. Even 4 years ago after my moms suicide I wouldn't have imagined how much Id be handling now. I did that by slowly stepping more and more out of my comfort zone. I'm only oversharing my backstory because your friend should hear from people who actually understand what it's like moving past abusive childhoods.", "Honestly I'm torn here, sounds like having some routine has helped T but does sound like V is overpowering to him from your comments.\n\nHas she got him any mental health care in these 6 months?\n\nPresumably you spoke with both V and T while you were away, did neither of them talk to you about this?\n\nCan he come and live with you now you're back?", "INFO: how does T feel about his life right now? Is he unhappy? Did V somehow threaten ie blackmail or force him to do all the things he’s doing, or did he choose to and you just disagree? And what kind of “help” were you expecting V to provide to T without speaking to him?", "INFO - Your story doesn't add up, your friend T and you knew each other since you were kids, now you both are in your mid-20s. So assuming you both are childhood friends, means you both having living in the same town or city for a long time. So, doesn't this mean you should have a residency or citizenship by now in the country you're working in (not home country)?\n\nOtherwise, having a visa that gets renewed since you're a kid seems like a huge hassle.\n\nUnless you and T both traveled together to move to a different country with its own visa requirements, this story seems to be missing this piece of information.", "NTA. You know your friend's background better.\n\nI am not saying that the way he was living was ideal, but \"tough love\" is not the way to (help) heal a traumatized person, it possibly has the opposite effect.\n\nAnd I don't think your girlfriend's action come from though love. You would have known the situation a lot earlier, there would be discussions about it, but she kept it hidden.\nIt also troubles me that you describe the housework as \"being a servant\". This could very well mean that you are too soft on your friend, but it can also mean that you described the situation as it seemed and felt to you. Adding on that you had no idea what was going on, I am inclined to believe that your GF has malicious intent.", "Yta", "Your girlfriend is not wrong for making him do basic day to day tasks, like cleaning and cooking, it's what is necessary to function and survive in modern society.\nIf your friend is so unwell that he cannot do such tasks, he does need professional help- and let me tell you, coddling him to the point he isn't required to do them isn't helping, it's enabling and currently making it worse.\n\nI've been in a psych ward as a caretaker (i had to be there for my sibling, who is a minor) and i had the chance to observe how they treated patients there. A part of the healing process, especially for people that struggle to compete their daily routine, is to enforce the habits of a healthy schedule: eating their meals, interacting with others during group time, reading, playing cards, talking with psychiatrists and psychologists, following a basic hygiene routine, going to sleep at the right time etc... All because this is what also helped them get better, along with the meds. \n\nYou'll not always be able to be there- what will happen if, for any reason, you won't be able to be there for him? Will he be able to take care of himself if you're not capable to reach out, maybe because something so important happened you are physically prevented from doing so?\n\nYTA for lashing out at your girlfriend. I get you love your friend, but if you really want to help him you need to aid him by enabling healthy habits, not enabling the unhealthy one that could quite literally kill him if there's no one checking on him.", "I’m gonna go MORE INFO because the oddest thing about this post is that OP’s girlfriends move OP’s vulnerable friend into HER apartment and has him cooking and cleaning for HER. \n\nOP may have enabled his friend, weird that he said to help but not talk to him but I’m gonna need more info to make a judgment.", "OP said above he was laid off. It's a fine line between mutual favour and manipulation.", "I 100% agree with this^ \n\nI hope the gf and his friend dump him because if I, (someone who has PTSD from trauma throughout childhood too), ever had someone like OP in my life I’d be screwed. What the gf did is a life saver! It’s exactly what my aunt and uncle did to help me get back on my feet and while I still struggle with things, I now live on my own THANKS to them.\n\nOp sounds jealous that his friend doesn’t actually need him the way he thought he does, and that it was his gf who actually helped the friend instead of enabling him to stay codependent. Every response from Op is about how HE feels on the situation not about what his friend has actually said. The friend almost sounds scared to actually speak his feelings to Op because he knows what Op is really like. \n\nIf anyone is going to be labeled abusive, it should be Op because enabling that behaviour IS abusive. YTA btw", "YTA, your girl friend has done more in the last 6 months and made him more functional than you did. You made him helpless. I would say thank you...Keep doing it.", "Agreed. But it's not a kid, it's a 26 year old grown man", "Neither of these folks are doing the right thing for T they need treatment by a trained professional.", "Agree 100%\n\nHis expectation that she would sit tight in a holding pattern for six months is nuts.  YTA.", "People who have been manipulated and abused will fall back into familiar patterns with people who do the same thing under the guise of helping or loving. Him doing things and surviving does NOT automatically mean she has helped.", "I recall a similar post as well! did a google search and found [this](https://www.reddit.com/r/AmItheAsshole/comments/119jlkr/aita_for_telling_my_fianc%C3%A9e_that_my_friends/) from February! And the [update](https://www.reddit.com/r/AmITheDevil/comments/11crc40/comment/ja4kg42/?utm_source=reddit&utm_medium=web2x&context=3) from that OP!", "Yeah, I agree. T needs professional help, not V - she is doing good, but she isn't a professional and can only help so much - and deffinently not what OP was doing. Like others have pointe out, OP wanted V to check up on T, how you do when you are taking care of someones dog or plants.\n\nYTA OP.", "In another comment he replied, and this is not an exact quote mind you, “~T feels light headed and as that he really wants to please her”. So, from my own perspective and the perspective of many others, not bad weird. In fact it sounds like a crush or genuine appreciation. \n\nHe also mentioned in another comment that apparently in the beginning, V would help T wash his hair on days that he felt it was impossible to do so and other things to really help T start up a healthy hygiene/home routine", "You are delusional. Helping someone instead of coddling them like a toddler is not ableist in any way.", "This right here is THE comment. I have multiple family members who flew across the country and paid thousands to have treatment at one of these kinds of centres. The structure of balancing work - play - relaxation, in that community environment with highly qualified professionals checking in daily, working their hardest to find optimal medication plans and therapies for each individual person, had exponentially positive effects on their lives. \n\nOne of those family members who I'm particularly close to literally had their whole life turned around. He left home in deep, painful, crisis at the end of his rope, and returned as a whole new version of himself. Motivated, excited about his new skills and hobbies that he never would've touched before being so far out of his comfort zone, applying that balanced routine to the home environment, and with more hope and peace of mind than I'd seen in him for years. The morning after he got home and I woke up to witness all of this, it brought tears to my eyes. They empowered my loved one to come back to us and more importantly, to himself. I *wish* that I had the resources to go there myself, can't say enough good things.", "I must say that it is slightly disappointing for someone with your education to just go along with the herd here to definitively paint this situation one way or the other. I would go so far as to say it is irresponsible of you if your claim is true. Every negative \"YTA\" here has made some reaching assumptions about OP themselves and defined this situation as clearly in favour of the friend and gf, even though there is clearly not enough information to determine anything. There is a tonne of missing info about T's perspective, the things V has actually done or not done and what OP has actually done in the past and whether or not he has actually got the power to wield over this person in such a way that it HAS actually created a negative attachment. You are also asserting that OP is not helping in any meaningful way without ascertaining anything other than \"it sounds like she is doing this to help\" - she may well have (good intentioned, possibly) looked up on line these things and came to this conclusion to do so. This, in a vaccuum is no bad thing. Neither is, inherently, going and checking on your traumatised friend and being there for them without doing much else to help. Making judgement without doing anything to clarify a very unclear situation (one that, if you were reading carefully, also includes a ESL communication barrier here) is something you should probably cease doing if you intend to practice in hopes of actually making a career out of helping others.\n\nAnd a final point? \"I hope she breaks up with you for him, sounds like a crush\"? Really, how infantile. Do better. Don't ship people for your mental entertainment.", "This is the way.", "one of the most baffling posts i’ve seen and this is the only comment that seems to make sense. i’m particularly disturbed by the number of people playing armchair psychologist when no ethical professional should be making a judgment about what this person “needs” without a lot more info and actually speaking to him.", "And you're the kind of person to make everything about gender only. WIMMIN BAD", "Thats right, women should only be cooking and cleaning, and definitely not be on the manly website reddit.", "What a nice worldview.", "I don’t think so man, it sounds like she’s giving him board for chores. That’s a generous deal.", "You need help. Enabling a grown ass man who will never grow with you babying him. Sounds like you’re in love with this guy.", "Ok. If you think this is true, why not just let him move in with you now?\n\nWhen people stay in a bad situation it’s often because they have nowhere to go of nobody to help. But T has you. So if this situation is actually bad for him why not just help him get out of it?", "Are you sure you aren’t the codependent one?", "you certainly don’t need a girlfriend. watch her leave your ass for your friend xxx", "I think you just don’t like the fact YTA", "So I take it that you are upset that your girlfriend is helping your friend and you don’t like it , because you don’t have your pet project anymore.", "Not misinterpreting, you are just a bad friend who thinks he is helping T but is hindering him. Your friend makes no progress with your ‘help’. It’s not a sustainable form of support. YTA", "No, I think they’re just seeing through your white knight bullshit facade. \nMaybe your gf is an asshole and using your friend, but you are ALSO an asshole for treating your friend like a child just to make yourself feel heroic. You’re both bad. You infantilizing and babying your friend doesn’t make you a good person. You aren’t his protector, his hero, his knight in shining armor. If your friend needs help, recommend him to professionals. You supporting him like this is actually crippling him, and your desire to keep him crippled makes you the asshole.", "Are you in love with T or do you just like that T is dependent on you?", "YTA and you have a saviour complex. That much is clear", "Sounds like you’re upset because T can function without you now.", "If you’re worry was that he wouldn’t even eat or sleep and instead she managed to get him to be active and complete tasks shouldn’t you be thrilled? It really sounds like you enjoy your friend being helpless and depending on you.", "She gave him structure and a purpose. Step back and observe how his mental health is actually doing before passing judgment.", "What would you rather have him do in his life? To be constantly coddled by you and your family for the rest of his life? Idk the extent of his trauma but your gf seems to be taking a different approach with him. All your coddling hasn't helped him, maybe some change now would.", "You also demanded she not speak to him or ask him anything. That’s unreasonable.", "I also agree with him 100%........... Because his gf seems to be the most efficient and level head person here.", "OP doesn't mention how T feels about the last six months. Which is very very weird on it's own.", "Having him do daily tasks does not make him a servant. Perhaps you should look at this with a different perspective that V is giving him productive tasks, this can actually build up someone’s self esteem and help them feel better about their capabilities. Maybe you should get out of the way of enabling your friend, appreciate V for hosting him and helping out in her own way. And maybe you are jealous that he might not ‘need’ you in the same way anymore", "Unless there is something missing, I am seeing a bunch of armchair psychologists flashing their \"Asshole Enthusiast\" flair at you and making wild assumptions without finding out more of what happened. On that note, once you volunteer some of the information, you might as well volunteer all of it, lest it becomes a shit-fest like it has. I'd like to believe you that you have not been there for your friend solely for your own gain, which would be pretty sick. I am sort of not surprised at the people in this sub, and then again I am sort of surprised at how much reaching is going on here.", "What is V asking him to do that’s making you say she’s using him as a servant?", "This sounds weird. I want you to help my friend but don't talk to him or make him do anything. What is she supposed to do, stalk him from afar.", "Yes, first there was that one, then more recently there was 'my fiancee stared at my friend's self harm scars until he flipped at her'", "There was also that one a couple months ago about the guy who would take boys trips with his \"best friend\" and ignore his wife the whole time.\n\nExcept they had a weird relationship where he didn't want to share anything about his friend for privacy, but was fine with airing his wife's dirty laundry.  \n\nOh, and he and the friend slept in the same bed for literally years.", "This is the one I was thinking about! It is as bad as I remembered. poor GF", "Like giving him unsolicited advice to eat or sleep? Do you see how what you’re demanding is impossible?", "There’s a happy medium OP. She may be pushing things too far at times but clearly he’s more capable of independence and adulting skills than anyone has given him credit for. It’s exceptionally strange that they never met then that you asked her to care for him but not speak to him or essentially try to help him.\n\nWhat you’re describing here is a state of arrested development which is not sustainable longterm unless his needs are such that carers can be acquired and funded. \n\nI have two children with significant disabilities and I will be doing them a disservice if I don’t encourage as much independence as they can achieve.", "Omg so instead you play pretend as his therapist? Are you going to take care of your friend forever? Pay his rent forever? Why are you SO against your friend learning life skills, honest question. Are you worried that he will rely less on you? What’s the issue???", "You’re not answering tho. You said he feels weird and want to impress her + he’s indebted to her (both valid imo? A person swoop in and actually helps you and push you to do things! It doesn’t sound like she’s pushing too far tho, just helping him find a routine, It’s good!)\n\nBut did he actually tell you he wants to go back to before?", "and you don't see anything wrong with coddling T for the rest of his life? spending huge amounts of money on someome who isn't capable of helping themselves?", "Thank you for writing this. \n\nFrom my perspective it could be a lot of fawning or something similar involved and the girlfriend might be retraumatizing him again with her actions and words.", "I'm starting to get downvoted 💀 I'm extra confused because this sub loves to attack people who do something without getting permission or approval from the person in charge/responsible for something. It seems like a complete 180 for this one post.", "It’s just an observation about this sub. And it never fails, what? are you seriously going to tell me if someone posts that I (27f) told my boyfriend (29M) to take care of my friend (26F) who has mental health issues and in a delicate place mentally, while I was gone, instead HE moved HER to the apartment and get her to cook and clean like a servant and HE has given HER a to do list that she has to follow….. That everyone is going to call op YTA and boyfriend is doing the right thing?  lol you know the answer everyone knows the answer.  This sub makes everything about gender only. Not me", "Sir this is a Wendy’s", "This invalidates the use of the word co-dependent as this is a two sided issue. Which OP, giving him the benefit of the doubt, is saying is not an issue. He checks up on him. His responsibility to another human being that is not his child is zero. Unless you have some compelling evidence that OP is using this guys misery to a) make himself feel better and b) keep him mired in a shitty cesspool of life, is an absolutely massive reach. The guy probably does need mental health help from a professional. It has probably been suggested. It cannot be forced if the person does not want it. What this T guy DOES NOT need, absolutely, unequivocally, is to be manipulated into being an indentured servant as if that rigid routine is helpful. If anything (AND I AM ADMITTEDLY REACHING HERE), that kind of domination and manipulation is probably part and parcel of what got this person to the place they are at. You are throwing around words you either don't understand or you cannot be bothered having a coherent thought about this situation.", "Yes, absolutely this. OP, you can't protect your friend from life and hardship. \n\nTo me it sounds like you are complaining, that your gf has taken away your \"toy\". Have you asked your friend how he feels about it? If he is ok with it, it's none of your business. If she is not abusing him in any way, but giving him something to do, something that he can help with and feel needed, there is nothing wrong with what she has done. Of course he needs therapy as well and a long term plan to get him on his own feet, but in the meantime why should he not be allowed to help someone in the house? Is it because he is doing \"women's work\" in the house?  \n\nYou telling her to \"not talk to him\" is actually a red flag for me, so YTA for trying to isolate your friend from others and claiming to be the only person he needs.", "[removed]", "there was one with a family friend (with cuts on his arms) and they shared a kiss. but it's all brotherly friendship now. OP got mad at his girl for staring at the scars (even if OP never gave her a headsup or a simple short explanation)\n\ntldr, the friend gave him a friendly blowj and OP broke up with his girlfriend.", "Yeah, I’m just waiting for another update with ‘and then he gave me a BJ’ at the end or whatever", "I get the feeling OP pumped and pumped T trying to get him to complain about V and the \"feel weird\" comment was the most negative he could squeeze out of him.\n\nYTA OP.", "it benefits OP because that would make him feel like a savior and such a good person", "Absolutely agreed. It might even be unknowingly. There is truly not much here to go on. And if this tripe is what the poster above is going to use as their thought process in their career? Good luck.", "yeah i’m sorry about that! it’s also v puzzling bc they (correctly) came down v hard on the mom who wanted the brother to do chores in lieu of rent but this guy should be grateful for the opportunity? (not saying they’re comparable—just an odd juxtaposition.)\n\ni’m sure i’ll get downvoted for this but i see a strain of ableism where disabled folks should be grateful for any intervention that makes them appear more functional without even considering the possibility of coercion. op also doesn’t seem to be a native english speaker, and some people are clearly interpreting his unclear responses in the worst light possible.", "Yet everyone else is talking about mental health and you're the only one having a rant about gender. Keep deluding yourself", "So you’re solution is babying him? You actually think that will help him?", "This is literally co-dependency at work here and by infantilising him, you are robbing him of an opportunity to grow and learn coping skills.", "I'm fucking crying bro 😂😂", "Current masters psych major. Taking a couple psych classes does NOT make you qualified to assess his needs and treat them as you see fit.", "Then why doesn’t he move in with you?\n\nNone of this makes sense. \n\nT: I feel weird around her. \nYou: Cool story bro, lemme go tell Reddit. \n\nI’m looking at your comments and you don’t actually seem to have or be interested in any proactive solutions to help T with his life or what you claim is in a bad situation. You’re only interested in trying to convince people V is a bad person.", "I just saw that one today and thought the same", "I missed that one!", "What you wanted her to do was throw him a bone so YOU could feel good and superior. Rather than giving him the tools to succeed. People like you are one of the reasons cycles aren’t broken.", "Hi. I have PTSD and OCD. And YTA. Some problems are too big to solve... in a day,  a week,  a month, but by God I will solve them one by one and take my mental health back.  \n\nEmotional support is always welcome but you are crippling him.  You are making him feel smaller than his problems and as if he is not able to overcome them. He has to overcome them or live in misery the rest of his life. You are leading him into a hopeless existence. You suck.", "I actually have a mental illness, and mental illness runs in my family. People CAN and do help themselves. We have coping mechanisms which are very important and encouraged by mental health professionals, ones who have actually studied and worked in the field, not just a few classes like you claim. They encourage routine and facing obstacles because that is how we heal. Coddling and having everything done for us, as you have done for T causes more problems. Not only does it infantilize the person, it can increase mental health symptoms and cause the person to not want to even do for themselves, because what’s the point of someone else will do it?   Frankly it sounds like T is probably in better shape than he was before you returned. If he is actively able to do the chores she has asked him, that is arguably better than when you were worried he wouldn’t be alive. She is giving him the structure he missed out in as a child.\n\nTLDR: She is doing what actual mental health professionals would endorse and you are doing the opposite.", "Bro this is awful - you are just writing him off. He actually deserves support and help, even in V is in the wrong that certainly doesn’t make you in the right. You’ve enabled and kept him down. She’s tried a different approach. Get off your high horse, YTA", "Haha. I can read. And I’ve read the rest of the comments. Nice try to weasel out.", "I read a wiki article about that topic and also consider myself to be an expert now 🤣", "I have a PhD in psychology but I still wouldn't say with confidence what any of my childhood friends need.", "That's exactly what I thought. He basically asked his gf to visit his friend like he's stuck in a zoo. Tapping the glass, making sure the animal is still alive and then tossing it some food. Wtf, your friend is a human being. Help him to live like one.", "Absolutely this! OP has never had any true experience with his own mental health or any experience with properly trained mental health professionals because I don’t know if any who would discourage routine and encourage coddling.", "Absolutely. OP needs T to be a victim so he can rescue him. V interrupted that pattern and is helping T heal on his own, so she must be the villain", "Op you're doing more harm than good to your friend.", "Not only that but as soon as OP left V stepped in and actually pushed T on the road to healing from his trauma", "Omg who died and made you his therapist. Your girlfriend is right, you are willingly crippling this man and actively preventing him from getting over his trauma. You know what doesn't help with trauma? Constantly being reminded about your trauma by those around him. Let the man move on with his life ffs! YTA", "I went through a program for people with chronic pain (often accompanied by depression) that basically told us to do all the things you’ve mentioned V has him doing. The most important part of getting out of a downward spiral of any kind is often to set a routine and have some specific tasks that make you feel like you have a purpose. When someone helps you stick to those routines and tasks it actually shows that they care. If he couldn’t afford rent because he lost his job, how is offering him a place to stay a bad thing? Just because he has been doing chores around the house while he is living there rent free doesn’t mean that your wife has decided to turn him into her “slave.” \n\nThe narrative you’ve created for this situation really isn’t logical. And my guess is that the lightheaded feeling T has is more because the routine and responsibilities are actually helping and he is no longer spiraling and he feels both seen and cared for.", "Sounds like he's functioning better with her than he was when you were running his life.", "What you are describing are super practical steps in  helping someone who is suffering from depression. It's hard to so the little things (like washing your hair) and your GF is giving him small things to achieve each day. If your friend is consenting to this then it sounds like it's of benefit to him.", "Sounds like she is making him responsible and not enabling him.", "Well he's handling her just fine without you around! So it seems like you're the problem in this equation", "That's obviously not the truth. And before you say he \"feels weird around her\" until you give more specifics on their what's that weird feeling no one can deduce if it's a good weird, like a crush, or bad weird, like he's uneasy and low key afraid of something.", "You are agreeing with someone comparing your friend to a dog?…omg.", "Look, I get you want to keep your friend emotionally crippled. It's a drug for you, but it sounds like your GF did more for him than you ever would. \n\nYou gave your GF an unreasonable task. Help this friend, but don't talk to him or interact with him at all. Seriously? \n\nYTA", "This really sounds like he has a crush on your GF. Maybe you're actually jealous for both of them?", "Tbh weird does not always equal bad, recovery is never easy. Nobody said there weren't going to be any triggers. There are a handful of replies from people that have been in psych ward or work in such a field and here you are, not replying to them at all. \n\nThe way you speak of v and t makes me think you need some introspection and a time out away from this situation. \n\nSomething is telling me that you need more help than t at the moment. I'm genuinly trying to be helpful to you by saying: maybe think about going to a therapist yourself before you bother t and v with your projections. The fact that you would post such a serious issue on AITA and not even want to acknowledge that you MIGHT be in the wrong and that you havent even bothered speaking with a professional for advice is a MAJOR red flag. You are in a position where you can damage the situation if you do not act accordingly, DO BETTER! TALK TO A PRO without projecting at v, who is doing the best she can within her means and knowledge.", "Maybe he feels weird because he’s an unpaid live-in housekeeper without any autonomy.", "Yup. And now Op is casting weird aspersions at V and making odd hints at her behavior and acting like she’s a predator. \n\nNope. She’s *actually helping*. But OP can feel their emotional support Abuse survivor (T) slipping away from OP’s dependency and Op can’t stand it.", "\"The more you do, the more you cab do\"", "Actually you said exactly that “ **because I've had hip and knee problems all my life and I've been pushed to do things that hurt my body while being told it's** ***\"all in my head*****.\"”**\n\nI was trying to be empathetic to your struggles but I neither asked nor were interested in the details!  So maybe keep your business to yourself rather then tell people passive aggressively.\n\nYour comment absolutely was uncalled for based on the original information!  So he’s doing a bit of housework and basic hygiene which the OP BELIEVES is taking advantage of him it does not say the friend didn’t want to do it or was being forced!    \n\n\nJust because someone don’t mollycoddle someone and don’t enable them to retreat into themselves DOES NOT make them an ableist.\n\nI think you need to look up what ablest means before trying to label someone with it! “ discrimination and social prejudice against people with physical or mental disabilities and/or people who perceive themselves as being disabled”\n\nSo now you know how based on the original comment is she discriminating and showing prejudice when she is clearly doing the exact opposite?", "Dude can leave at any time and is getting free room and board while he once again quits his job. He's not exactly getting the short end of the stick here.", "Are you keeping your friend as a pet? Do you want him to be a non-functional member of society? I don't understand you at all. It seems your gf cares more about his future than you do.", "As someone who works in mental health, it sounds like she actually helped him while you sat there, watched, and enabled his trauma. What do you think a treatment program would be like? Those are the basic rules for almost any mental health treatment program. Programs, mind you, that it sounds like your friend needs severely. THe rigid rules are much more beneficial to his mental health than you allowing him to rot in squalor and chaos.", "Did he throw up or complain his hair was too sensitive to wash? If no then it was clearly a non issue. Sometimes a routine and basic hygiene is enough to help people in depression or ptsd. Focusing a routine could be helping him. Why not take a moment to see what the results of a change in scenery and routine is doing for him before assuming the worst? What’s the harm? If you truly want to help T, recognize that your way wasn’t working.", "What you’re saying is that your friend is so unwell that he is unable to feed, bathe, and clothe himself in clean clothes, and your horrible, awful girlfriend betrayed your trust by … figuring out how to keep your friend fed, bathed, and clothed in clean clothes? And all it took was you being out of country for six months?\n\nIt sounds like you were enabling your friend to indulge in his worst impulses and as soon as you were out of the picture he started healing. Take a good long look at your impact on your friend’s life, and how you are treating your saint of a girlfriend.", "How is he supposed to hold a job that requires work clothes if you are essentially babying him to not wear work clothes when they feel uncomfortable but he obviously needs to wear them because of work?", "If he’s that incapacitated, he needs to be hospitalized. But it sounds like with V, he’s actually quite capable.", "Honestly, what he describes sound like my journey out of all that shit. I felt lightheaded after every session with my therapist. And it sounds completely different to someone triggering my PTSD. Mine stems from Afghanistan, so that may explain why it seems so different, i would still think he is on a good way.", "or, and here's a thought, someone with complex PTSD could be completely overwhelmed by their being thrust into an uncomfortable situation that they were not prepared for and the only semblance of a support system was (not saying i agree with OP that she is horrible) was inadequate.", "You said, \"I’m sorry you are in pain and no one has taken you seriously over the years\" I never said no one has taken me seriously and emphasising \"all in my head\" in bold with italics doesn't manipulate what I said into \"no one has taken me seriously.\" Sheesh!   \n\n\nYou also said, \"I hope at some point you find out what is wrong with you\" which is really derogatory and presumptuous. I gave you the details because ***I know what is wrong with me and nowhere did I say it was unknown.*** Again, sheesh! \n\nI'm done talking to you. You can feel free to read back over the other replies to my comment to see what I do or do not at this point understand.", ">Dude can leave at any time\n\nSpoken like someone who has never encountered housing issues. Not sure where OP is but half my country is struggling to find housing. In another comment OP even says he himself is struggling to find a new apartment and he already has a job.", "Sorry but this entire branch of the post appears to be here just for an argument or a fight. You're accusing OP of making assumptions about what is good for another person, while doing the exact same thing yourself. Someone's got you angry and it sure as fuck can't be this random guy."]}