{"id": 16763, "submission_id": "13ce3hs", "title": "AITA For giving away a bunk bed that I could have sold in order to help my sister-in-law and brother with their rent?", "selftext": "(Fake names for anonymity)\n\nMy sister-in-law “Fae” and brother “Max” had recently struggled to afford their rent, as it went up. They received the standard 90 day notice from their landlady, but still struggled to keep up with the rent due to not spending responsibly.\n\nFae and Max asked me if I could help them financially. I respectfully told them no. (If they had been in debt because something unavoidable drained their savings (like medical expenses) I would have taken from my own savings. But that isn’t what happened here.)\n\nFae and Max decided to sell one of their cars. Max has to take the bus to work on certain mornings now. But they are now fully caught up with their rent payments and have become more responsible with their spending.\n\nI have a close friend “Jim” with two young daughters. His youngest’s crib used to be in he and his wife’s room, but now she is too old for the crib and will be sharing a room with her sister.\n\nJim casually mentioned this to me, and that he felt bad, since having two normal beds in that room would be tight. I had a bunk bed that I used to share with a roommate. It’s just been sitting around in storage, so I offered it to Jim for free as long as he helped me move it.\n\nMy parents recently moved into a new house and held a small housewarming party. Jim and his wife attended as well, as we’ve been friends for years and consider each other family. During the party, Jim brought his daughters up to me to “Thank auntie OP for giving us your bunk bed.”\n\nFae happened to be in the dining room as well when that happened. She and Max came up to me after the other guests left and said they were disappointed that I had given the bunk bed to Jim when I could have easily sold it to help them with their rent situation.\n\nFae and Max acknowledged that I had no technical obligation to help with their rent. But said it was about morals and that since I was choosing to be generous, I should have prioritized actual family over Jim.\n\nMy father wanted me to apologize to Fae and Max, since I could have easily gotten two or three hundred for the bunk bed and that would have helped them a lot before they had to sell one of their cars. My mother told me not to, because Fae and Max are responsible for themselves and I was allowed to do something generous for Jim.\n\nI still feel bad, since Fae and Max had to sell one of their cars and relying on the bus is inconvenient. I still don’t think that I should have to apologize for doing a generous thing for a friend. But I know I’m biased. Are Fae, Max, and my father right that actual family should have come before a friend?", "created_utc": 1683602937, "permalink": "/r/AmItheAsshole/comments/13ce3hs/aita_for_giving_away_a_bunk_bed_that_i_could_have/", "score": 20, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I gave away a bunk bed to a friend, when I could have sold it and earned at least two or three hundred dollars for it instead.\n(2) My sister-in-law and brother could have really used that money to help with their rent, and they had to sell one of their cars because I did not sell the bunk bed to be able to give them money. They said that, since I was choosing to be generous, actual family should have come before my friend.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "If selling a car was on the table, it doesn't sound like $300 would have been the make or break here.", "Ya mom said it best \"My mother told me not to, because Fae and Max are responsible for themselves and I was allowed to do something generous for Jim\" \n\nNTA.", "NTA. They are adults and responsible for their own bills.  You are an adult and free to give away or sell your possessions as you see fit (and keep any proceeds). They need to grow up.", "NTA\n\nSelling used furniture is absolutely not easy or a guarantee. Your entire life isn't devoted to selling your persona belongings to help various relatives pay their rent.", "2 or 3 hundred is NOT a used car. Fae and Max's ridiculous guilt is... ridiculous. \n\nNTA.", "NTA. This wouldn’t be the first and only. It’s just the beginning of you eroding your extra belongings. Savings and bank accounts in the name of  with offsetting their expenses… that will never be enough. \n\nYour friends are worthy of help too, and you’re not obligated to analyze each and every decision to achieve maximum return for other family members.", "NTA. They’re disappointed you didn’t sell something that belonged to you, in order to pay their debt, instead of them selling something that belonged to them in order to pay their debt? And, your dad agrees? I see where your brother gets his entitlement.", "I’ve said before in this sub: never let someone else volunteer you to solve a problem you didn’t create and couldn’t prevent.  NTA", "NTA\n\nIt is not your responsibility. It is up to YOU what YOU do with your belongings. Would it have been a kind gesture to do that to help Max and Fae? Yes. Was it also a nice gesture to gift it to someone else you are very close to for their young children? Yes. You also could have chopped it up and burned it. It was YOUR bed.\n\nMax and Fae trying to guilt you into feeling bad for not giving them money or selling off your things for a profit to give them the money is the a-hole move here. That kind of behavior is what what turn me off from ever wanting to help them with money, regardless of the situation.\n\nEdit - spelling", "Riding the bus is smart economics. \n\nSelling a bunk bed would have yielded little money, and could have been a big pain.", "You are not responsible for your family’s debts and finances. You are definitely NTA in this situation and you have a right to give an unused item to whomever you want! The fact that Fae even thought that up is a sign she’s counting your money on the regular. Not cool.", "NTA, family should come first, yes, but generally in lieu of \"doing nothing\" or thoughtlessly doing something. In this instance, you provided a friend with a needed item, which is still fine. Your father's wrong to ask you apologise, and don't do it, as youve done nothing wrong", "NTA. You don't own Fae and Max anything. The need to sort their lives out and keep on top of their rent.", "NTA\n\n> since I was choosing to be generous, I should have prioritized actual family over Jim.\n\nFamily means dick.", "NTA", "You have zero obligation to help your brother and SIL. They were irresponsible with their spending. You can choose to help whomever you decide you want to help. I can't comprehend how the three of them thought you did anything wrong or owe them anything simply because you're related.\n\nI'm with your mother. Don't apologize.\n\nNTA", "NTA. You mentioned that they were in a tight spot because of “spending irresponsibly” not because of an unavoidable situation. They got themselves into a situation it’s not your responsibility to sell your possessions to help with.", "NTA at all. They aren't your responsibility. Fuck that.", "NTA It’s honestly really entitled of them to even bring it up.", "\"baaaah, you gave something to someone other than us. We should always come first because we are family! Booooo hoooo, you don't love your family!!!\". Sound familiar? Let me tell you a secret about these \"blood is thicker than water\" types, they're all talk, no show. Watch how fast they have excuses instead of help if you have troubles and there is actually something they could do for you.  NTA give what you like to whom you like. That family aren't worth investing in. They are manipulative. The kids ought to be able to have cousins, though, it's valuable even if they suck.", "Definitely NTA! You did what felt right to you. They are adults and should figure out their life and to come up with a more long term solution for their life. Do not feel any guilt!", "They never asked for the bunk bed or indicated they needed it. They should shut all the way up because this makes no sense. NTA. You could have sold blood to help them out financially too, you know? And somehow selfish you just hasn't been all that willing to help out family? Yeah see how goofy this sounds?\n\n🤣", "NTA. It sounds like they’d have still had to sell the vehicle to get out of their tight spot. Regardless, if you had sold the bunk bed instead you were still under no obligation to give them the money. Ask your dad what personal belongings he was planning on selling to raise the money to get them out of their tight spot before they wound up selling the car. Since he cares so much about getting them out of their tight spot, he should have been the first to step up and sell something/give them money.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n(Fake names for anonymity)\n\nMy sister-in-law “Fae” and brother “Max” had recently struggled to afford their rent, as it went up. They received the standard 90 day notice from their landlady, but still struggled to keep up with the rent due to not spending responsibly.\n\nFae and Max asked me if I could help them financially. I respectfully told them no. (If they had been in debt because something unavoidable drained their savings (like medical expenses) I would have taken from my own savings. But that isn’t what happened here.)\n\nFae and Max decided to sell one of their cars. Max has to take the bus to work on certain mornings now. But they are now fully caught up with their rent payments and have become more responsible with their spending.\n\nI have a close friend “Jim” with two young daughters. His youngest’s crib used to be in he and his wife’s room, but now she is too old for the crib and will be sharing a room with her sister.\n\nJim casually mentioned this to me, and that he felt bad, since having two normal beds in that room would be tight. I had a bunk bed that I used to share with a roommate. It’s just been sitting around in storage, so I offered it to Jim for free as long as he helped me move it.\n\nMy parents recently moved into a new house and held a small housewarming party. Jim and his wife attended as well, as we’ve been friends for years and consider each other family. During the party, Jim brought his daughters up to me to “Thank auntie OP for giving us your bunk bed.”\n\nFae happened to be in the dining room as well when that happened. She and Max came up to me after the other guests left and said they were disappointed that I had given the bunk bed to Jim when I could have easily sold it to help them with their rent situation.\n\nFae and Max acknowledged that I had no technical obligation to help with their rent. But said it was about morals and that since I was choosing to be generous, I should have prioritized actual family over Jim.\n\nMy father wanted me to apologize to Fae and Max, since I could have easily gotten two or three hundred for the bunk bed and that would have helped them a lot before they had to sell one of their cars. My mother told me not to, because Fae and Max are responsible for themselves and I was allowed to do something generous for Jim.\n\nI still feel bad, since Fae and Max had to sell one of their cars and relying on the bus is inconvenient. I still don’t think that I should have to apologize for doing a generous thing for a friend. But I know I’m biased. Are Fae, Max, and my father right that actual family should have come before a friend?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA You owe no one an apology. You were helping a family with two young children. Fae and Max need to grow up and be responsible for themselves.", "NTA. Your brother and SIL were irresponsible and are now facing the consequences of their actions. It's ridiculous of them to expect you to sell your own property to help them. If they are so desperate they can sell their own stuff.", "NTA.  The amount of money would have been a tiny drop in a giant bucket of their debt.", "If they struggled financially, maybe selling one car was the best decision they could make. Less money for fuel and other costs a car comes with. And I doubt a couple hundreds of dollar would have helped them that much. Also, why should you sell your things because of their iresponsabilities? You would just set a precedent and they'd expect the same thing next month and the month after that, and so on. NTA", "NTA if they needed beds for their kids I would expect you to give your family the bunk beds but not to sell.\nYour friends needed beds for their kids.\nThat’s important too, besides your relatives had caught up on their rent.\nGood Lord you’re allowed to help other people.", "NTA \"due to not spending responsibly\". Welp, looks like my work is done here.", "NTA if you give money to family to bail them of their own messes, you're creating expectation and dependency. Adults need to be responsible and take responsibility.", "NTA if you’re father is so concerned with your brothers finances, he can help pay their rent. You did a nice thing for a friend, nothing wrong with that.", "NTA \n\nDon’t forget they became more responsible about their spending when they had to sell the car. They now keep up on their bills.\n\nWhy? Because you helped them by not enabling their irresponsible spending by bailing them out. They needed to struggle so they could learn and do better. \n\nYou did the right thing.", "NTA. Your personal belongings are not untapped money sources for your family to demand, and selling furniture is a giant PITA (especially for large/heavy/otherwise difficult to move things) and who knows what you would’ve gotten anyway.", "I would be surprised if they get half that much for an old bunk bed set. Second hand furniture market is dead.", ">it doesn't sound like $300 would have been the make or break here.\n\nThat was much earlier, when they had only missed their first rent payment. Selling the car was a last resort, as they were on their last leg with their landlady in terms of paying back all the months of missed rent they owed.\n\nIt would not have fully repayed their debt by any means. It just would have been much more helpful then versus when they had to sell the car.", "Unless the car was only worth $300. A complete junker", "Listen to your mother. NTA.", "For some reason, I read this and heard Tommy Lee Jones voice in my head.", "Yep, has been my experience too."]}